{
  "post": {
    "title": "LG launches 45\" and 39\" OLED gaming monitors with smart TV features | Best of both worlds or a compromise that satisfies neither?",
    "author": "chrisdh79",
    "id": "1k53wd7",
    "score": 553,
    "created_utc": 1745321175.0,
    "selftext": "",
    "num_comments": 253,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1k53wd7/lg_launches_45_and_39_oled_gaming_monitors_with/"
  },
  "comments": [
    {
      "id": "moewx0w",
      "author": "mr_bots",
      "body": "What’s the purpose of a smart monitor that’s already hooked up to the smartest box in the house? They just added WebOS to gather more data to sell.",
      "score": 603,
      "created_utc": 1745321660.0,
      "replies": [
        {
          "id": "moez1b0",
          "author": "None",
          "body": "[removed]",
          "score": 146,
          "created_utc": 1745322592.0,
          "replies": [
            {
              "id": "moiaefj",
              "author": "ehxy",
              "body": "if it's a piece of shit like their 32\" i'd steer clear everyone.  I'm still in the situation of fighting to get my warranty honored despite currently living in canada while having purchased in US.  The warranty card says it covers both canada and us.  \n\nThey've been real assholes about it.\n\nI'll buy LG tv's, I will never buy a LG monitor ever again that's for damn sure",
              "score": 12,
              "created_utc": 1745359543.0,
              "replies": []
            },
            {
              "id": "mof716n",
              "author": "alc4pwned",
              "body": "I mean the price tag is definitely more related to the ultra high end specs these have, but yes.",
              "score": -6,
              "created_utc": 1745325817.0,
              "replies": [
                {
                  "id": "mogalrk",
                  "author": "Vynlovanth",
                  "body": "I wouldn’t say it’s ultra high end in 2025 considering it still has DP 1.4 and 3440x1440 resolution.  I’d sooner pony up for the 45GX950A-B 5120x2160 for $2,000 or go with a standard-sized 34” 3440x1440 QD-OLED, Dell/Alienware and MSI have some with basically the same specs for $800.",
                  "score": 18,
                  "created_utc": 1745338274.0,
                  "replies": [
                    {
                      "id": "mogyqiy",
                      "author": "alc4pwned",
                      "body": "It's not at the very top, but compared to what most people are using? I'd say it's quite high end. I would also pay extra for the 5k2k options currently, but these are still super nice monitors.\n\nThe prices in the article are just the MSRPs, they'll probably be available for a lot less in the not so distant future. The 34\" options with similar specs also had higher MSRPs at launch than what you can buy them for now.\n\nI have the older version of the 39\" OLED which also had an MSRP of something like $1500, but I got it for $1000.",
                      "score": -7,
                      "created_utc": 1745345221.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mofc5fy",
          "author": "shalol",
          "body": "Fun fact: The name of any file you run through LGs media player goes directly to LG HQ, for, reasons.\n\nI think they als send camera stills of content being displayed to HQ if you have a certain image feature enabled…",
          "score": 34,
          "created_utc": 1745327686.0,
          "replies": [
            {
              "id": "mofvtlp",
              "author": "DaoFerret",
              "body": "Makes me happy my TV isn’t connected to the internet.",
              "score": 20,
              "created_utc": 1745333964.0,
              "replies": [
                {
                  "id": "mogijya",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -4,
                  "created_utc": 1745340600.0,
                  "replies": [
                    {
                      "id": "mogkymi",
                      "author": "DaoFerret",
                      "body": "Fair enough.  \n\nIt isn’t hardwired into any internet.\n\nIt isn’t on WiFi.\n\nCould it be piggybacking on an IoT connection somewhere?  Probably, but my IoT are locked into their own network that is mostly disconnected from internet access by the firewall.\n\nThere are definitely still pathways I can see for access, but there’s only so much one person can reasonably do.",
                      "score": 4,
                      "created_utc": 1745341286.0,
                      "replies": [
                        {
                          "id": "mohio8t",
                          "author": "Shadow647",
                          "body": "have you heard about Amazon Sidewalk?",
                          "score": -2,
                          "created_utc": 1745351156.0,
                          "replies": [
                            {
                              "id": "mohlnix",
                              "author": "DaoFerret",
                              "body": "I’ve heard of it, and know some people whose devices use it, however I don’t have any Amazon devices in my house, nor do my neighbors (so far as I’m aware).\n\nThat was what I meant by “there are definitely still pathways I can see for access but there’s only so much one person can reasonably do.”",
                              "score": 3,
                              "created_utc": 1745352030.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mofsftw",
          "author": "AcceptableTune2498",
          "body": "How am I supposed to stream my shows without this? It’s not like I can just stream through my web browser (with adblocker extensions). Oh wait.",
          "score": 9,
          "created_utc": 1745332961.0,
          "replies": []
        },
        {
          "id": "mok1xtz",
          "author": "zexton",
          "body": "some streaming services on pc, dont have features such as hdr, highest bitrate, dolby atmos etc, depending on the streaming service  \nnot even disney+ own app on windows 11 have full support for everything\n\nso in those cases webos is useful,",
          "score": 2,
          "created_utc": 1745382498.0,
          "replies": []
        },
        {
          "id": "moiursx",
          "author": "abarrelofmankeys",
          "body": "Yeah people have been buying monitors as TVs to avoid this shit, they’re just farming data. No one wants this. Your computer can do this crap without this.",
          "score": 3,
          "created_utc": 1745366369.0,
          "replies": []
        },
        {
          "id": "monbf6o",
          "author": "clay12340",
          "body": "Well this way your monitor can experience software based crashes as well as your PC. It's pretty brilliant. Hopefully, they can add a really slow ass Roku menu or something to have to wait through before you select the proper input for your PC monitor.",
          "score": 2,
          "created_utc": 1745431120.0,
          "replies": []
        },
        {
          "id": "moexhua",
          "author": "None",
          "body": "[deleted]",
          "score": 4,
          "created_utc": 1745321921.0,
          "replies": [
            {
              "id": "moeyjn9",
              "author": "mr_bots",
              "body": "No one willing to drop $1,500-$1,700 on a gaming monitor uses smartv features. They’d have a dedicated AppleTV or nvidia shield since they’re superior to any smarttv platform. Even the tvs running android like the shield are slow and laggy and lack audio codec support that the shield has.",
              "score": 30,
              "created_utc": 1745322382.0,
              "replies": [
                {
                  "id": "mofvptz",
                  "author": "GreatStuffOnly",
                  "body": "I’m running LG C3 connected to Rtx 4090 as my main usage when I’m in the bedroom. Sometimes, I don’t want to control it via PC, I would just watch plex on smartTV. Same with playing some Spotify right away. It does have its uses but limited.",
                  "score": 6,
                  "created_utc": 1745333933.0,
                  "replies": []
                },
                {
                  "id": "mofxkyl",
                  "author": "Zapador",
                  "body": "Yeah that combo seems utterly pointless. And this seems a bit expensive, paid 1000 USD a year ago for my 45\" LG OLED monitor with more or less the same specs and luckily no stupid smart TV features.",
                  "score": 1,
                  "created_utc": 1745334493.0,
                  "replies": []
                },
                {
                  "id": "mor77me",
                  "author": "christoskal",
                  "body": "I have LG C2 as my monitor and I am using the smarttv part a lot. \n\nIt's considerably easier to get dolby vision playing though plex than through windows for example.\n\nIt's also rather nice to simply allow access to someone else to throw videos to it. \n\nAppleTV and Nvidia shield offer pretty much nothing for the uses that someone that has a pc on the TV would use it, using native WebOS is considerably better in pretty much every way, with the most important being that colors appear a lot better in the native apps.",
                  "score": 1,
                  "created_utc": 1745482988.0,
                  "replies": []
                },
                {
                  "id": "mof75zb",
                  "author": "alc4pwned",
                  "body": "Can't they simply ignore the smart tv features..?",
                  "score": 2,
                  "created_utc": 1745325867.0,
                  "replies": [
                    {
                      "id": "mof9ed5",
                      "author": "mr_bots",
                      "body": "You can. It’s just not a selling point and I’d keep it off the WiFi and only connect it periodically for firmware updates.",
                      "score": 2,
                      "created_utc": 1745326696.0,
                      "replies": [
                        {
                          "id": "mofaamm",
                          "author": "alc4pwned",
                          "body": "I don't think the smart features were ever a main selling point though. These are $1600+ 240Hz OLED monitors - people are buying them mainly just because they're good high end gaming monitors.",
                          "score": 5,
                          "created_utc": 1745327021.0,
                          "replies": [
                            {
                              "id": "mofak6u",
                              "author": "mr_bots",
                              "body": "I guess I worded it weird. It’s LG trying to advertise it as a feature that the actual buyers won’t care about but it’s mainly there to let LG use common chipsets and firmware to save money and gather data from users to sell.",
                              "score": 3,
                              "created_utc": 1745327118.0,
                              "replies": []
                            },
                            {
                              "id": "moizia6",
                              "author": "CosmicCreeperz",
                              "body": "Yeah, the smart features are like an extra $20 at most.  You can get a standalone 4k streaming device for $30.  Just putting a faster WiFi capable SoC, more RAM and flash in what is basically already an OLED TV is pretty minimal compared to the total cost.",
                              "score": 1,
                              "created_utc": 1745368006.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mofw2bj",
                          "author": "DaoFerret",
                          "body": "Do you NEED to update the firmware though if you’re keeping it off the internet?",
                          "score": 1,
                          "created_utc": 1745334036.0,
                          "replies": [
                            {
                              "id": "mog7nl1",
                              "author": "hickok3",
                              "body": "Not the same obviously, but I have a Samsung TV that I bought just before the Xbox Series X came out. When I got my Xbox it wouldn't work on my TV until I updated the firmware, so it is possible for new tech to not work until firmware has been updated. ",
                              "score": 4,
                              "created_utc": 1745337416.0,
                              "replies": [
                                {
                                  "id": "mogaraj",
                                  "author": "DaoFerret",
                                  "body": "Fair enough.  I had a similar problem with my monitor when I got my PS5.  It had a problem with the launch firmware that they quickly resolved (a friend got a monitor a month or two later and it was fixed).\n\nYou could update the firmware Offline though by downloading it and putting it on a USB drive.  (Not sure that’s an option for some of the latest TVs though)",
                                  "score": 1,
                                  "created_utc": 1745338319.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mogef50",
                              "author": "mr_bots",
                              "body": "I have an Alienware QD-OLED that had broken HDR  when combined with nvidia GPUs until a firmware update so it does happen.",
                              "score": 4,
                              "created_utc": 1745339393.0,
                              "replies": [
                                {
                                  "id": "mogf8dq",
                                  "author": "DaoFerret",
                                  "body": "Was there an option to download the firmware and put it on a flash drive so the monitor didn’t have to go “online” to update?",
                                  "score": 1,
                                  "created_utc": 1745339632.0,
                                  "replies": [
                                    {
                                      "id": "mogfv47",
                                      "author": "mr_bots",
                                      "body": "That one was able to update through the dp cable with an installer from Dell. I have a Samsung that also had some bugs and it updated through a USB though.",
                                      "score": 3,
                                      "created_utc": 1745339816.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "moh2u2j",
                          "author": "SolidOshawott",
                          "body": "I updated my LG C2 firmware a while back and all the apps and menus got slower, I don't recommend.",
                          "score": 1,
                          "created_utc": 1745346433.0,
                          "replies": [
                            {
                              "id": "mohtyak",
                              "author": "blackburnduck",
                              "body": "Same here, my lg gets slower every update. Never buying lg stuff again, they obviously make this to get you to buy a “newer faster”.",
                              "score": 1,
                              "created_utc": 1745354465.0,
                              "replies": [
                                {
                                  "id": "mohxh4a",
                                  "author": "SolidOshawott",
                                  "body": "Well, what's left? Just Sony.\n\nI've been burned by Samsung way too many times to buy another device of theirs again. The LG TV got slow software but the panel, which is what matters, is excellent.",
                                  "score": 1,
                                  "created_utc": 1745355501.0,
                                  "replies": [
                                    {
                                      "id": "mohxyoy",
                                      "author": "blackburnduck",
                                      "body": "For tvs? Anything not connected, I quite like ambilight as a diferential feature more than I care for 3% better hdr.\n\nIf I can go for a dumb tv, I will, any day.\n\nFor monitors? Anything not smart. With this money you can buy a 480hz monitor.",
                                      "score": 1,
                                      "created_utc": 1745355647.0,
                                      "replies": [
                                        {
                                          "id": "moi0tl6",
                                          "author": "SolidOshawott",
                                          "body": "I'd totally get a dumb TV but they don't really exist anymore.\n\nAnd right now my TV and monitor are one and the same.",
                                          "score": 1,
                                          "created_utc": 1745356529.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "moj04tq",
                                      "author": "CosmicCreeperz",
                                      "body": "Yeah, so just ignore the smart features and get a Roku, AppleTV, etc.",
                                      "score": 1,
                                      "created_utc": 1745368225.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mogd3yl",
                          "author": "Polymersion",
                          "body": "A lot of them will scrape your wifi data from any connected device and use it to connect themselves to the network.\n\nThey *really* don't want you opting out of the spyware.",
                          "score": -1,
                          "created_utc": 1745339010.0,
                          "replies": [
                            {
                              "id": "moh2ova",
                              "author": "SolidOshawott",
                              "body": "That's not a thing. And even if it was you could blacklist the MAC from the router.",
                              "score": 1,
                              "created_utc": 1745346390.0,
                              "replies": []
                            },
                            {
                              "id": "mor7hzs",
                              "author": "christoskal",
                              "body": "Why would you write something like this? \n\nThis is obviously something that has never happened. The whole thread is filled with weird conspiracy theories and lies like this and it confuses me.",
                              "score": 0,
                              "created_utc": 1745483173.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mofkezz",
                  "author": "ArchusKanzaki",
                  "body": "Nvidia Shield does not stream Netflix in 4K. I am using Samsung G80SD, and I can also see there are differences between output in Netflix from the Netflix app inside my monitor apps, and output from my PC. Alot of streaming companies does not stream 4K on PC or phone or tablet apparently. Either that, or the TV upscaler is doing alot better than Windows's.\n\nBasically, there are reasons for it.",
                  "score": 0,
                  "created_utc": 1745330471.0,
                  "replies": [
                    {
                      "id": "mofkpok",
                      "author": "mr_bots",
                      "body": "I haven’t used a shield in a few years since I switched to AppleTVs but I never had any issues streaming 4K HDR Netflix.",
                      "score": 5,
                      "created_utc": 1745330566.0,
                      "replies": [
                        {
                          "id": "mofoica",
                          "author": "ArchusKanzaki",
                          "body": "[From this reddit thread, seems that Shield is no longer updated and so they never fix the Netflix problem](https://www.reddit.com/r/ShieldAndroidTV/comments/1ansjx4/netflix_not_4k_even_with_all_requirements_met/). Not sure about Apple TV but pretty sure Apple will make sure it kept up-to-date so yeah, you won't face problem.\n\nAlso, it used to be that you can stream 4K using the Netflix app inside Windows PC.... but they took it out when they change the app to just \"app\", by making it just a browser window. Browser only supports max 1080p. Just to double-check, Godzilla Minus One have 4K and HDR10+ on my Samsung TV Netflix app, but not on both Edge browser and Windows Netflix app.\n\nBut even disregarding everything.... both Nvidia Shield and Apple TV took up HDMI slot. If you have your PC connected to the DisplayPort, PS5 to HDMI, and Switch to the other HDMI, you now run out of HDMI slot. I personally use my monitor as a TV too for my bedroom so I do not need to use living room TV.",
                          "score": 1,
                          "created_utc": 1745331768.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "moeyika",
              "author": "wirelessfingers",
              "body": "...when am I going to want to do that? It's not a hassle to keep my computer on. Even if the thing is oft, it takes like 30 seconds to go from off to watching netflix. Absolutely worthless feature.",
              "score": 3,
              "created_utc": 1745322368.0,
              "replies": [
                {
                  "id": "mofvccg",
                  "author": "Another_one37",
                  "body": "What about the HDR limitations in Windows as well as the Netflix limitations in Windows? \n\nGetting a PC to play nice with 4k HDR Netflix is often a tall task and in many cases is even impossible, regardless of what Netflix says.\n\nWebOS wouldn't have these limitations",
                  "score": 2,
                  "created_utc": 1745333823.0,
                  "replies": [
                    {
                      "id": "mofybii",
                      "author": "wirelessfingers",
                      "body": "For like the 3 people that want this then sure but this feature set did not exist before now for a good reason.\n\nI'm not familiar with 4k HDR limitations, but I wonder if piracy already solved that problem on pc.",
                      "score": 1,
                      "created_utc": 1745334715.0,
                      "replies": [
                        {
                          "id": "mor7uqr",
                          "author": "christoskal",
                          "body": ">For like the 3 people that want this then sure\n\nYou can't mean that it's rare for people to want to watch movies and tv shows in good quality\n\n> but this feature set did not exist before now for a good reason.\n\nYeah and it sucked. We went from shitty standard 1080 to dolby vision 4k, it's really weird to skip one of the biggest upgrades in movie quality because \"it didn't exist in the past\"\n\n> I wonder if piracy already solved that problem on pc.\n\nNo, it hasn't. In fact because of lack of standards it had made the problem even worse.\n\nYou can fight for years trying to get a file to work on windows correctly and with the correct brightness or you can just press one button and play it through WebOS perfectly instantly.",
                          "score": 0,
                          "created_utc": 1745483402.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "moezbr8",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -6,
                  "created_utc": 1745322715.0,
                  "replies": [
                    {
                      "id": "mof3bqo",
                      "author": "lazava1390",
                      "body": "Companies love people like you.",
                      "score": 10,
                      "created_utc": 1745324374.0,
                      "replies": []
                    },
                    {
                      "id": "mofpk53",
                      "author": "Benzy2",
                      "body": "That’s fine and all, but a plug in device to one of the HDMI ports is cheap and better performing than most all integrated options.  If my options are constant on data collection and add placements vs an HDMI added device to give me the streaming I’d like…I’ll take the HDMI device every time.",
                      "score": 1,
                      "created_utc": 1745332088.0,
                      "replies": [
                        {
                          "id": "mor840c",
                          "author": "christoskal",
                          "body": "That is absolutely not true, almost all plug in devices, even really expensive ones, have considerably worse image quality than the native apps. Even Shield that is loved is a lot worse than WebOS native player. \n\n> If my options are constant on data collection and add placements vs an HDMI added device to give me the streaming I’d like\n\nThese are not your only options. You can have the integrated high quality free service and disable data collection really easily. There are even lists that disable all connections like that with a single click without even needing a pihole.",
                          "score": 1,
                          "created_utc": 1745483572.0,
                          "replies": [
                            {
                              "id": "moroiif",
                              "author": "Benzy2",
                              "body": "The processing power in the integrated options is poor.  Anyone who’s tried to stream sunshine/moonlight has seen that it’s not enough with the integrated choices.  They quickly become slow and stutter.  Maybe this monitor put in better processing power but I doubt it.",
                              "score": 1,
                              "created_utc": 1745492880.0,
                              "replies": [
                                {
                                  "id": "morowce",
                                  "author": "christoskal",
                                  "body": "Nah, even my considerably older LG TV that I have for my living room has sunshine working perfectly, the newest ones would have absolutely no issue.",
                                  "score": 1,
                                  "created_utc": 1745493062.0,
                                  "replies": [
                                    {
                                      "id": "moroyu8",
                                      "author": "Benzy2",
                                      "body": "Nah then you’re running 1080 30fps.",
                                      "score": 1,
                                      "created_utc": 1745493094.0,
                                      "replies": [
                                        {
                                          "id": "morpuqn",
                                          "author": "christoskal",
                                          "body": "4k 60fps babyy \n\nI am not sure why people that do not have these devices have opinions about how they work without even caring to search for it first.\n\nI see it all the time in /r/gadgets, people have strong opinions about things they have absolutely no experience with. It's just weird.\n\n\nEdit :\n\nWhat the hell? \n\nThe moonlight sub even has a pinned thread full of comments saying the exact same thing I just told you, if you don't believe me go read the comments of many others there. Just weirdos in this sub seriously, you got a good piece of information and your first response was to write a stupid aggressive comment about it, write another calling me a liar and then block me. Seriously wtf",
                                          "score": 1,
                                          "created_utc": 1745493495.0,
                                          "replies": [
                                            {
                                              "id": "morpz70",
                                              "author": "Benzy2",
                                              "body": "I bet you don’t even need a gaming PC and just do it on your smart TV outperforming the 5090.  You’re so full of shit",
                                              "score": 1,
                                              "created_utc": 1745493551.0,
                                              "replies": []
                                            },
                                            {
                                              "id": "morpzwk",
                                              "author": "Benzy2",
                                              "body": "Liar",
                                              "score": 1,
                                              "created_utc": 1745493559.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mofm902",
                      "author": "Shrouds_",
                      "body": "I literally use a hdmi switch… I can just flip between my pc and ps5 with the click of a button",
                      "score": 1,
                      "created_utc": 1745331062.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mofylyc",
              "author": "alucohunter",
              "body": "Then what's the point in having a monitor? \"I want to sit at my desk but I don't want to use my pc, but I want to watch netflix\" my brother in christ buy a television",
              "score": 1,
              "created_utc": 1745334802.0,
              "replies": []
            },
            {
              "id": "moq9m17",
              "author": "trainbrain27",
              "body": "This is 2025, if you can afford a monitor like that, you can afford to keep the PC on 24/7.\n\nQuick math says it should be less than $100/year, idle is cheap, and streaming isn't nearly as hungry as gaming.",
              "score": 1,
              "created_utc": 1745465521.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mof8xqj",
          "author": "eldelshell",
          "body": "I have a LCD 43 in my bedroom for watching TV and to play PC games. Also, for many living in a shared apartment, having a single device is nice. Not the whole world is the typical American household.",
          "score": 1,
          "created_utc": 1745326525.0,
          "replies": [
            {
              "id": "mofmc9r",
              "author": "Shrouds_",
              "body": "HDMI switches are like $50",
              "score": 1,
              "created_utc": 1745331091.0,
              "replies": []
            },
            {
              "id": "mofab1r",
              "author": "mr_bots",
              "body": "I get having one screen. I just don’t see any overlap in who would spend that much for a monitor that doesn’t also have a high end gaming PC where splurging a little more for a much better experience with an AppleTV or nvidia shield isn’t also part of the package.",
              "score": 1,
              "created_utc": 1745327025.0,
              "replies": [
                {
                  "id": "mofgb96",
                  "author": "Svv33tPotat0",
                  "body": "I hate that I have a Roku TV. I haaate Smart TVs, but I still have one. But if I am on my gaming desktop, I am absolutely not wanting to deal with any of the Smart TV nonsense there. I am guessing my setup is pretty common.",
                  "score": 5,
                  "created_utc": 1745329130.0,
                  "replies": []
                },
                {
                  "id": "mogbsz8",
                  "author": "eldelshell",
                  "body": "DVB although you could buy a PC tuner too I guess but then your PC is on all day just to watch TV.",
                  "score": 1,
                  "created_utc": 1745338627.0,
                  "replies": [
                    {
                      "id": "mol9tbp",
                      "author": "Less_Party",
                      "body": "It's a nice side benefit rather than something I'd seriously argue people should buy one for but I've got an M1 Macbook and that's a lot 'nicer' to just have on all day than my big lumbering desktop that draws something obscene like 80W at idle and is clearly audible throughout the room.",
                      "score": 1,
                      "created_utc": 1745407676.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mofxizi",
          "author": "pimpbot666",
          "body": "I hope it has P in P. It would be nice to have my favorite show playing in a small window while I crunch spreadsheets on my computer in my home office. \n\nI mean, I guess we can do that now with another window.\n\nI remember P in P being a big TV feature. With the demise of live broadcast television, it’s not a big selling point.",
          "score": 1,
          "created_utc": 1745334477.0,
          "replies": []
        },
        {
          "id": "mog24x5",
          "author": "fuckdonaldtrump7",
          "body": "Isn't LG one of the companies playing unwanted ads on people's TV home screen? Probably want more ad revenue.",
          "score": 1,
          "created_utc": 1745335838.0,
          "replies": []
        },
        {
          "id": "moge9g7",
          "author": "Macqt",
          "body": "Ads. It’s ads. They want to show you ads with no simple way to block them.",
          "score": 1,
          "created_utc": 1745339347.0,
          "replies": []
        },
        {
          "id": "mohrjdl",
          "author": "AkodoRyu",
          "body": "Sure, but I also get the use case - you may not want to boot up the 300W box to watch a few YT videos. Electricity is expensive - my 2 home PCs are something like 50% of my total electric bill, which is not small. I would still pick a dumb monitor and a media box instead, though.",
          "score": 1,
          "created_utc": 1745353749.0,
          "replies": [
            {
              "id": "mohsyvk",
              "author": "mr_bots",
              "body": "Absolutely but I also have a Lunar Lake laptop I just most of the time unless I’m gaming because it sips power.",
              "score": 1,
              "created_utc": 1745354170.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mohsa3f",
          "author": "wh1pp3d",
          "body": "Just never connect the monitor to Wifi",
          "score": 1,
          "created_utc": 1745353968.0,
          "replies": []
        },
        {
          "id": "moicc12",
          "author": "shiftt28",
          "body": "Fr who asked for this?",
          "score": 1,
          "created_utc": 1745360179.0,
          "replies": []
        },
        {
          "id": "mojtxkg",
          "author": "Xylus1985",
          "body": "It can charge you a subscription to use basic monitor functions",
          "score": 1,
          "created_utc": 1745379030.0,
          "replies": []
        },
        {
          "id": "mokwulb",
          "author": "Qwesttaker",
          "body": "Because then they use it to push advertising and collect data on you like they do with your TV",
          "score": 1,
          "created_utc": 1745400717.0,
          "replies": []
        },
        {
          "id": "moloiop",
          "author": "dgj212",
          "body": "This, the reason I got a monitor was to avoid a smart tv",
          "score": 1,
          "created_utc": 1745413513.0,
          "replies": []
        },
        {
          "id": "mom8e12",
          "author": "Wilko23",
          "body": "And the idea of playing ads on startup etc as the TVs like to do these days",
          "score": 1,
          "created_utc": 1745419868.0,
          "replies": []
        },
        {
          "id": "moqyybh",
          "author": "REV2939",
          "body": "don't need to turn on the PC if you're just trying to watch something real quick.",
          "score": 1,
          "created_utc": 1745477819.0,
          "replies": []
        },
        {
          "id": "mofvxa4",
          "author": "Trev0117",
          "body": "For what it’s worth media streaming on desktop is such a miserable experience that even a cheap smart tv UI might be an improvement, try streaming anything that isn’t YouTube in 4k (and god forbid hdr), I bet you literally can’t. Got an oled monitor and can’t watch movies on it cause windows media consumption sucks ass. Thinking of buying a second Apple TV just for the monitor.",
          "score": 0,
          "created_utc": 1745333995.0,
          "replies": []
        }
      ]
    },
    {
      "id": "moex6z2",
      "author": "NuclearReactions",
      "body": "Best of both worlds? Maybe 10 years ago, now this sounds like an absolutely bad idea. My phillips started displaying ads on the home screen some time ago thanks to google and their scummy OS.\n\nYes i paid 2.5k for more ads.",
      "score": 222,
      "created_utc": 1745321784.0,
      "replies": [
        {
          "id": "mof9osn",
          "author": "Nimradd",
          "body": "No way I’m connecting my TV to the internet. I’ve been wanting the opposite of what this is. I want dumb TVs again. It’s horrible if they try to make monitors «smart».",
          "score": 45,
          "created_utc": 1745326801.0,
          "replies": [
            {
              "id": "mofe7ln",
              "author": "okram2k",
              "body": "look up commercial displays. They are all the features of modern TVs with no smart features, only simple HDMI inputs. Most intense software many include is wifi streaming from another device. They are though more expensive because they're targeted at business customers but sometimes you can find used ones pretty cheap",
              "score": 18,
              "created_utc": 1745328405.0,
              "replies": [
                {
                  "id": "mofkkgf",
                  "author": "SweetCosmicPope",
                  "body": "My company just gave away a bunch of 80” 4k displays when we closed our Denver office.  I’m in a different state, otherwise I would have totally snagged one.",
                  "score": 3,
                  "created_utc": 1745330520.0,
                  "replies": []
                },
                {
                  "id": "moffxyk",
                  "author": "Nimradd",
                  "body": "I know they technically exist, I just wish they were consumer products and cheaper because I don’t want the extra features. I can make my smart TV kinda «dumb» again just blocking it from accessing the internet.",
                  "score": 5,
                  "created_utc": 1745329005.0,
                  "replies": [
                    {
                      "id": "mofohyr",
                      "author": "Briantastically",
                      "body": "The consumer TVs are cheaper because of the extra features. The manufacturers assume they will make their profit selling information the tv scrapes from your viewing habits.",
                      "score": 6,
                      "created_utc": 1745331764.0,
                      "replies": [
                        {
                          "id": "mofp9ue",
                          "author": "Nimradd",
                          "body": "I get that they will make some money selling my data or showing me ads, but for each TV that is a very, very small amount compared to the price of the TV itself. Nobody in their right mind would purchase my viewing habits for a three digit number of dollars?",
                          "score": 0,
                          "created_utc": 1745332002.0,
                          "replies": [
                            {
                              "id": "mofr2se",
                              "author": "Briantastically",
                              "body": "My limited understanding is that tv manufacturers sell the TVs at or below their cost, and the profit is almost entirely a result of the metrics/ad business. Even if they’re only making a few dollars per month from you over the years that adds up to a healthy margin.",
                              "score": 3,
                              "created_utc": 1745332552.0,
                              "replies": [
                                {
                                  "id": "mofx11k",
                                  "author": "Nimradd",
                                  "body": "My understanding is that’s only true for the cheap TVs. Manufacturing costs of high end/mid end TVs have big margins. I only know this from knowing guys in the business, the goal is «upselling» all the time.",
                                  "score": 2,
                                  "created_utc": 1745334326.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mojp2qt",
                              "author": "Deciver95",
                              "body": "You underestimate what a loss leader is\n\nIf you truly want a dumb TV, you'll have to pay for it. You can't have the best of both worlds unfortunately",
                              "score": 1,
                              "created_utc": 1745377112.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "moff6rz",
          "author": "foggybottom",
          "body": "Get an Apple TV and don’t connect your physical tv to the internet so you don’t have to see all the bloat",
          "score": 27,
          "created_utc": 1745328744.0,
          "replies": [
            {
              "id": "mofg3fe",
              "author": "NuclearReactions",
              "body": "Thanks, ideally i want to avoid using any additional device, the beauty of the tv is being able to just turn it on with the remote, press either netflix or youtube and watch something. It's such a casual thing that adding additional steps would lead to me simply not using it (i never watch it actively unless it's movies night or something like that)\n\nThe proxy or pi hole thing should work well, worst case scenario I'll consider apple tv (as long as i don't have to pay any subscruption) or a simple windows based gaming pc which would replace most of my consoles.",
              "score": -5,
              "created_utc": 1745329057.0,
              "replies": [
                {
                  "id": "mofi5df",
                  "author": "foggybottom",
                  "body": "For what it’s worth, I hit power on my Apple TV remote and it turns on the tv and the Apple TV at the same time and goes right to the Apple interface. There are no extra steps, just plug and go. \n\nThere are no subscriptions when it comes to the Apple TV (Apple TV+ is the service with all the shows they are releasing). You download whatever apps you use and go from there. \n\nYour other option could be Roku if you want. I’ve used both and prefer the Apple interface as it feels cleaner and I find the Roku interface a bit sluggish.",
                  "score": 23,
                  "created_utc": 1745329736.0,
                  "replies": [
                    {
                      "id": "mofmy0d",
                      "author": "PooForThePooGod",
                      "body": "Roku sucks and is full of ads -Roku user",
                      "score": 12,
                      "created_utc": 1745331280.0,
                      "replies": [
                        {
                          "id": "mogsv6l",
                          "author": "TapTapTapTapTapTaps",
                          "body": "My god, their new menu full video ads fucking blow too. I don’t know how they ever thought that would be okay.\n\nRoku has been running on this stupid idea if they add more menus to the left menu, no one will care. So I got turn them off, but they add a new one almost monthly, so now you have this list of like 12 menus you’ve shut off. So they switched to this full video ads and just yeah.\n\nFuck Roku.",
                          "score": 5,
                          "created_utc": 1745343540.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mofsg5a",
                      "author": "NuclearReactions",
                      "body": "Ok that definitely puts it on the possible solutions list, thanks!",
                      "score": 5,
                      "created_utc": 1745332963.0,
                      "replies": [
                        {
                          "id": "mofv5in",
                          "author": "NATOuk",
                          "body": "Can confirm, multiple TVs with Apple TV boxes and I only use the Apple Remote with each of them. Only used the original remote to do the initial setup/config of the TV, then they went in a drawer",
                          "score": 6,
                          "created_utc": 1745333766.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mofrwrp",
                      "author": "Thechasepack",
                      "body": "I have a chromecast with google tv and I like the interface a lot better than my roku.",
                      "score": 3,
                      "created_utc": 1745332802.0,
                      "replies": [
                        {
                          "id": "mofukgb",
                          "author": "foggybottom",
                          "body": "I used to use Roku much more but it’s the interface in my old tv. I’m honestly not a huge fan of it really. It’s very slow now. Was just giving an alternative that is much cheaper though. I’ve never used the google tv interface so couldn’t really talk to that but it’s sounding like it’s probably better",
                          "score": 1,
                          "created_utc": 1745333593.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mohyabj",
                      "author": "IrishWolfHounder",
                      "body": "Put an Apple TV on each tv, throw in a pi-hole if you are a bit technically inclined and you can have a pretty good consistent experience with no ads.  \n\nI even got my MIL to do this.  (Let me set her up I mean). The Apple TV can be customized pretty well and is easy to use.  She’s pretty happy with this.",
                      "score": 1,
                      "created_utc": 1745355746.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mofm7j5",
                  "author": "pinkynarftroz",
                  "body": "I thought it would be a hassle, but our setup is a dumb plasma TV with a Mac mini hooked to it. We’ve got a Bluetooth keyboard and trackpad that we use to wake the Mac when we turn on the TV. It’s actually way faster to navigate and search on streaming sites with a cursor and keyboard you can type with. And of course it has an ad blocker if we want to watch anything on YouTube.\n\nI’ll never ever go back to a smart TV with a shitty interface and slow remote.",
                  "score": 7,
                  "created_utc": 1745331050.0,
                  "replies": [
                    {
                      "id": "mofs3qu",
                      "author": "dominus_aranearum",
                      "body": "I've been running my TV off a computer for the last 15+ years. Current setup is a Xulu XR1 mini PC with Linux and a Bluetooth keyboard/track pad on a 75\" Aver interactive flat panel. Adblockers on Firefox. No commercials in this house.",
                      "score": 1,
                      "created_utc": 1745332860.0,
                      "replies": []
                    },
                    {
                      "id": "mofs963",
                      "author": "NuclearReactions",
                      "body": "I was considering just looking at the issue from a different POV: how can i integrate mouse+kb in my couch without impairing immediate access? Worth exploring for sure, may be more feasable than i thought",
                      "score": 1,
                      "created_utc": 1745332905.0,
                      "replies": [
                        {
                          "id": "mofu0kw",
                          "author": "pinkynarftroz",
                          "body": "We’ve got a table in front of the couch. You can also just put the trackpad and keyboard on a tray or something. You definitely do not need a full size keyboard for this. The apple Bluetooth one without the num pad is a good size.",
                          "score": 1,
                          "created_utc": 1745333429.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mog5mwy",
                      "author": "rudimentary-north",
                      "body": "macOS has such awful scaling issues on larger screens that I use a mini windows PC for this purpose.",
                      "score": 1,
                      "created_utc": 1745336836.0,
                      "replies": [
                        {
                          "id": "mog75oh",
                          "author": "pinkynarftroz",
                          "body": "That doesn't matter with media. The scaling of full screen playback is program dependent. You're thinking of the interface elements.",
                          "score": 1,
                          "created_utc": 1745337273.0,
                          "replies": [
                            {
                              "id": "mog7uuq",
                              "author": "rudimentary-north",
                              "body": "yes I am thinking of the interface elements.  in order to get full screen media playing, you have to interact with the interface.  Web browsing was a nightmare compared to windows 11",
                              "score": 1,
                              "created_utc": 1745337473.0,
                              "replies": [
                                {
                                  "id": "moguhkk",
                                  "author": "pinkynarftroz",
                                  "body": "In my opinion, you're massively overstating the issue. It's so minor and few people will really notice or care. You speak like a web browser is unusable on MacOS.",
                                  "score": 1,
                                  "created_utc": 1745344007.0,
                                  "replies": [
                                    {
                                      "id": "mohp46p",
                                      "author": "rudimentary-north",
                                      "body": "Just stating my experience.  I’m 100% in the Apple ecosystem except for this media Pc, because the scaling issue bothered me so much. I did find the web browser almost unusable on my Mac scaled to my 4k TV.\n\nI don’t think the issue is minor at all, plenty of forum posts out there complaining about the way macOS handles 4k displays",
                                      "score": 1,
                                      "created_utc": 1745353047.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mofric4",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1745332682.0,
                  "replies": [
                    {
                      "id": "mofrswj",
                      "author": "NuclearReactions",
                      "body": "That's good to know, had no idea. My last apple product was my old iphone 3gs, very out of the loop",
                      "score": 1,
                      "created_utc": 1745332769.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mofr74w",
          "author": "menkoy",
          "body": "Yeah... I recently bought an LG TV. About every week it asks me to update, which involves it running like shit, restarting, and making me agree to new terms and conditions again. Every week. If I ignore it then it asks me to update after 3 minutes of being turned on, every time I turn it on. On top of that my home screen is 80% ads that play way too loud and obscure the 2-3 apps I actually want to use. Those apps have also randomly uninstalled themselves a couple times.",
          "score": 3,
          "created_utc": 1745332589.0,
          "replies": []
        },
        {
          "id": "mofhw4a",
          "author": "ArchusKanzaki",
          "body": "I think it depends. My Samsung G80SD have those \"smart TV features\" and I do love them. Its the only way to get 4K Netflix or other streaming services to stream actual 4K output for some reason. The upscaler also works quite well.\n\nAs for the ads? I do not encounter any but the thing is, everything about the TV generally stays out-of-the-way when doing normal computer stuffs so I do not need to interact with TV stuffs on daily basis. I just do it when I want to watch Netflix",
          "score": 4,
          "created_utc": 1745329652.0,
          "replies": [
            {
              "id": "mofmiga",
              "author": "pinkynarftroz",
              "body": "I might be wrong, but Netflix can be 4K under Safari on MacOS. I remember Apple making a big deal about this for being the only browser allowing that resolution.\n\nA quick search seems to corroborate this.",
              "score": 2,
              "created_utc": 1745331145.0,
              "replies": [
                {
                  "id": "mofn0f6",
                  "author": "ArchusKanzaki",
                  "body": "Maybe they do special support for Safari on Mac, but Windows PC no longer have 4K HDR as of now. I checked both the Windows Store Netflix app, and opening Netflix on Microsoft Edge browser (which some noted that it used to support). I am using Godzilla Minus One for checking\n\nMight also be because the connection is using the DisplayPort instead of HDMI.... but switching is a deal-breaker for me since I use both HDMI for PS5 and Switch.",
                  "score": 2,
                  "created_utc": 1745331301.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mofqyje",
          "author": "dylanholmes222",
          "body": "You can switch to just the app list mode which is a more basic UI (kinda like Apple TV) but it doesn’t have all the crazy large Ads rotating on the carousel",
          "score": 2,
          "created_utc": 1745332517.0,
          "replies": [
            {
              "id": "mofrxnt",
              "author": "NuclearReactions",
              "body": "Thx will check!",
              "score": 1,
              "created_utc": 1745332809.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mofv88g",
          "author": "Moskeeto93",
          "body": "You should definitely check out [the Projectivy Launcher.](https://www.howtogeek.com/i-finally-tamed-my-google-tv-home-screen-with-this-app/) It's so much better than the default launcher, has no ads, and is very customizable. I use it on any Google TV device now. It also easily takes over as the default launcher so you never have to see home screen ads again.\n\nAlso, check out r/Projectivy_Launcher for some examples of how others are customizing their home screens.",
          "score": 2,
          "created_utc": 1745333789.0,
          "replies": []
        },
        {
          "id": "mofxju2",
          "author": "SvenTropics",
          "body": "I never hook up my TV's to the internet. I use a roku box or chromecast for streaming.",
          "score": 1,
          "created_utc": 1745334484.0,
          "replies": []
        },
        {
          "id": "moh9mn6",
          "author": "ball_fondlers",
          "body": "This would have been shit ten years ago too, it’s just that the “smart” features would have been underpowered enough to ignore. If I have a monitor, I want it to do exactly one thing - display whatever is plugged into it. If I want streaming services or AI bullshit, I’ll bring those in myself.",
          "score": 1,
          "created_utc": 1745348450.0,
          "replies": []
        },
        {
          "id": "mof4zai",
          "author": "xpen25x",
          "body": "but without the smart function you would have paid way more. have you looked at non-smart tv;s in the same size and cost?",
          "score": -16,
          "created_utc": 1745325029.0,
          "replies": [
            {
              "id": "mof6euo",
              "author": "NuclearReactions",
              "body": "When i bought it it was 2018, i doubt the tv ads were factored into the price.\n\nNot in the market for a tv now (and won't be for as long as this TV lives, hopefully another 10 years) but that would be the plan. Either buy a non smart one (no idea if there are 65\"+ non smart oleds now I'm curious) or buy one and not connect it to the internet.\n\nAs for the current tv I'm working on a proxy server and have the tv connect there instead. It should load everything but the ads once I'm done.",
              "score": 7,
              "created_utc": 1745325583.0,
              "replies": [
                {
                  "id": "mog8mib",
                  "author": "xpen25x",
                  "body": "even in 2018 it was all about harvesting your viewing now sending you ad's and even in 2018 smart tv's were comparable in price and very few monitors were built then as well. and there are non-smart but they are made for the commercial space.",
                  "score": 1,
                  "created_utc": 1745337695.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mof9k4t",
              "author": "None",
              "body": "[deleted]",
              "score": 5,
              "created_utc": 1745326754.0,
              "replies": [
                {
                  "id": "moga76g",
                  "author": "xpen25x",
                  "body": "thats because they want to harvest your viewing. unless you never connect it to the internet they are getting all the shows you are watching smart streaming or OTA. what times the tv is active how long you stay on a channel all of that. that is why they are so cheap and why walmart bought visio",
                  "score": 1,
                  "created_utc": 1745338156.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mofbg69",
              "author": "alc4pwned",
              "body": "Nah, I have the previous version of the 39\" monitor with no smart tv features (different brand but same panel) and it had around the same MSRP as this one.",
              "score": 1,
              "created_utc": 1745327437.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mof06am",
      "author": "umadeamistake",
      "body": "“Smart television features” = advertisments",
      "score": 49,
      "created_utc": 1745323074.0,
      "replies": []
    },
    {
      "id": "moex1zj",
      "author": "cat_prophecy",
      "body": "Having recently bought a smart TV monitor I can tell you that the smart TV stuff is the worst part of it.\n\nI don't need Netflix or Hulu on my monitor, it's connected to a fucking computer already. About the only thing that's \"unique' to it is that it has an OTA antenna for TV. But who, in 2025, is watching over the air TV? Certainly not people buying OLED monitors.",
      "score": 191,
      "created_utc": 1745321722.0,
      "replies": [
        {
          "id": "mof0mgo",
          "author": "SonMystic",
          "body": "OTA antenna is actually pretty nice I think. I agree the smart features don't seem to match up since you're connected to a computer with it, but an antenna that doesn't require Internet connection to watch some stuff like live sports on local channels is a very nice perk I think.\n\nSmall edit to this: after just a bit more thought, even using something like this as a spare monitor would be a decent idea. You could swap over to a sports game on a second screen, sacrificing no processing power or internet bandwidth. I like this idea.",
          "score": 40,
          "created_utc": 1745323262.0,
          "replies": [
            {
              "id": "mof3db2",
              "author": "Buckeye_Monkey",
              "body": "Yep. Live sports, local news, and severe weather coverage are why we have antennas on our TVs. Everything else is streamed.",
              "score": 14,
              "created_utc": 1745324391.0,
              "replies": []
            }
          ]
        },
        {
          "id": "moeyq1j",
          "author": "Wisniaksiadz",
          "body": "True, what's the point of ,,monitor with small computer\" when you are going to Hook it to ,,normal\" computer anyway",
          "score": 12,
          "created_utc": 1745322458.0,
          "replies": [
            {
              "id": "mof06yn",
              "author": "gregallen1989",
              "body": "They can charge more for it and make more money.",
              "score": 7,
              "created_utc": 1745323082.0,
              "replies": [
                {
                  "id": "mof168r",
                  "author": "raptir1",
                  "body": "Not only can they charge *you* more for it, they can bundle in ads and crap to get money from other companies as well!",
                  "score": 6,
                  "created_utc": 1745323493.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mof1lzm",
              "author": "thorpie88",
              "body": "Guess there is some market for people using consoles with them. Although they also have access to some apps android has a way larger range to choose from",
              "score": 1,
              "created_utc": 1745323676.0,
              "replies": []
            },
            {
              "id": "mofa6cg",
              "author": "VagueSomething",
              "body": "Data harvesting, pushing their own ads, inevitably releasing a shitty AI assistant that suggests settings and TV to watch probably.",
              "score": 1,
              "created_utc": 1745326977.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mof1240",
          "author": "TheSpatulaOfLove",
          "body": "We watch OTA because I didn’t want to pay Comcast $85/mo for basic cable and there is local content that isn’t piped through IPTV options.",
          "score": 8,
          "created_utc": 1745323446.0,
          "replies": []
        },
        {
          "id": "mof13hz",
          "author": "raptir1",
          "body": "> But who, in 2025, is watching over the air TV?\n\n\nr/cordcutters would like a word with you. ",
          "score": 11,
          "created_utc": 1745323461.0,
          "replies": []
        },
        {
          "id": "mof1f7d",
          "author": "w1n5t0nM1k3y",
          "body": "I have a \"Smart TV\" in my living room and for the last 5+ years I've just used a small PC under the TV to do all the streaming. Putting computer in the TV is just a bad idea because they are generally underpowered and not well supported. The small PC under my TV was cheap and does so much more than the TV can do.",
          "score": 3,
          "created_utc": 1745323597.0,
          "replies": [
            {
              "id": "mof4uty",
              "author": "xpen25x",
              "body": "many of us have been doing HTPC for 25 or more years. granted the htpc's are so much smaller now. remember getting one of the first mini-itx embeded boards to use as an htpc running winME and then 98 with its MCE.",
              "score": 1,
              "created_utc": 1745324981.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mofcwuo",
          "author": "JohnJohn173",
          "body": "People really havent used netflix or hulu on their computer and it shows. I cant use hulu because for whatever reason, even with my location, it locks me out and does not allow me to watch or browse hulu. Netflix and all other streaming services with movies or tv speficially are locked behind 720p 16:9. I just bought an ultrawide to see content in its recorded aspect ratios and it was painful trying to figure out what was going on. I have since sailed the sea, found the content I want to watch, and enjoy it how its supposed to be seen. This does not help with sports though, if you can somehow get espn+ or hulu to work, those are at least broadcast in 1080p. \n\nWe have the ability to make streaming services work on pc, but as of now, in order to watch above 720p you have to be on a tv. This monitor would allow you to do that it seems.",
          "score": 3,
          "created_utc": 1745327956.0,
          "replies": [
            {
              "id": "mofh72m",
              "author": "Svv33tPotat0",
              "body": "I can block Hulu and YouTube ads on my browser no problem. So I'd take the quality decrease just for that tbh.",
              "score": 2,
              "created_utc": 1745329424.0,
              "replies": [
                {
                  "id": "mofhlcq",
                  "author": "JohnJohn173",
                  "body": "This is me, I was trying to catch the yankees game last night and adblock is a life saver, but hulu and espn+ literally do not work on my pc. Its crazy, its a fresh install, not using any vpns, no adblock even, and both do not work. Max is the only place I can catch live sports and its always soccer or f1, things I like but dont keep up with.",
                  "score": 1,
                  "created_utc": 1745329555.0,
                  "replies": []
                },
                {
                  "id": "mofivni",
                  "author": "ArchusKanzaki",
                  "body": "Sounds like someone who does not have 4K screen tbh",
                  "score": -1,
                  "created_utc": 1745329975.0,
                  "replies": [
                    {
                      "id": "mofsas6",
                      "author": "Svv33tPotat0",
                      "body": "Yeah I'm good on that. My desktop monitor is like 2400 by whatever and I think maybe my TV is too.",
                      "score": 1,
                      "created_utc": 1745332919.0,
                      "replies": []
                    },
                    {
                      "id": "mp6yps3",
                      "author": "Itwasallyell0w",
                      "body": "you don't need 4k, use 4x dsr and all your streaming apps including Netflix will stream 4k even on a 1080p monitor",
                      "score": 1,
                      "created_utc": 1745694775.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mofv11f",
              "author": "ArchusKanzaki",
              "body": "More like alot of people either never really try to have 4K on their Netflix, or does not even have 4K display. Most people here seems to not be aware of the quality reduction, either its because they do not notice, or they never experienced actual 4K.\n\nTbf, this is probably because the rest of specs are.... not great. 45\" Curved WQHD OLED in 2025? When 42\" and 48\" Flat OLED exist? I don't know who is this for. I guess that's why they promote the WebOS to try to slot it as Smart Monitor. In contrast, not much people even know that Samsung's G80SD even have Samsung Smart TV things inside them, because its more like a footnote in their feature list instead. They don't even tag it as Smart Monitor despite it probably qualifies as such and Samsung also produce Smart Monitor.\n\n....And now that I think about it, you do not need 4K too for this. Its only WQHD.",
              "score": 1,
              "created_utc": 1745333729.0,
              "replies": [
                {
                  "id": "mofympg",
                  "author": "JohnJohn173",
                  "body": "I'm sure lots of people would love to watch streaming services through a browser, I'm sure many have tried, think about all the college kids hosting movie nights or families with a home network sitting down to watch something. If I can immediatelly start watching a show and notice the resolution isnt getting any better surely than can too. And these specs are fine lol, you mention 42\" and 48\" already being a thing but I guess you fail to realise 45 is literally in the middle of both of those. Not a huge difference. 1440 isnt terrible either, this seems to be a middle of the road gaming monitor with some smart features. If I hadnt just bought an ultrawide wqhd monitor I'd be looking at this one.",
                  "score": 1,
                  "created_utc": 1745334808.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mojxf29",
              "author": "pogray",
              "body": "You need to use Edge or Safari if you want Netflix to stream in 4k",
              "score": 1,
              "created_utc": 1745380489.0,
              "replies": [
                {
                  "id": "mon1fae",
                  "author": "JohnJohn173",
                  "body": "This does not work for me as per the last time I tried, but I'll try again, maybe I was too stoned last time to notice",
                  "score": 1,
                  "created_utc": 1745428313.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mofg633",
          "author": "Stunning_Variety_529",
          "body": "Are you kidding me? OTA broadcasts are amazing.",
          "score": 2,
          "created_utc": 1745329081.0,
          "replies": [
            {
              "id": "moqcl42",
              "author": "Afferbeck_",
              "body": "If you like ads, \"reality TV\", ads, \"news\", and ads. ",
              "score": 1,
              "created_utc": 1745466752.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mof4p1v",
          "author": "mgwair11",
          "body": "Personally, I love it and find it quite cool. If you are a console gamer as well as pc gamer, it’s a display that becomes a one stop shop.",
          "score": 1,
          "created_utc": 1745324917.0,
          "replies": []
        },
        {
          "id": "mof7ggt",
          "author": "71-HourAhmed",
          "body": "The only streaming service that offers 4K HDR via PC is Netflix and that is only in Edge or their own Windows App. You actually do need a streaming device if you want to watch something like Fallout in 4K HDR on a PC monitor. \n\nI have a 4K OLED and I use an HDHomeRun 4K Flex to watch my OTA channels on my PC while doing other things. That’s where the local news is. I watch the occasional football game on there as well. There’s a new channel that shows Hannah Barbara cartoons 24X7 from MyTV that I kind of dig too.",
          "score": 1,
          "created_utc": 1745325976.0,
          "replies": []
        },
        {
          "id": "mofj33l",
          "author": "ArchusKanzaki",
          "body": "Your Netflix is on 1080p on your computer, but will stream 4K in your TV. That's why.",
          "score": 1,
          "created_utc": 1745330042.0,
          "replies": []
        },
        {
          "id": "mof4dhd",
          "author": "xpen25x",
          "body": "you bought it because it was cheap. it was cheap because of the smart function for them to harvest your tv viewing. and many are watching OTA  tv. as people move away from cable they are getting their locals from antenna.",
          "score": 1,
          "created_utc": 1745324792.0,
          "replies": [
            {
              "id": "mofnzzd",
              "author": "cat_prophecy",
              "body": "It was not cheap. It wasnt even the cheapest OLED monitor.",
              "score": 1,
              "created_utc": 1745331608.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mof4nnc",
          "author": "None",
          "body": "You should watch over the air TV, it’s a great way to get more familiar with your local news stations",
          "score": 1,
          "created_utc": 1745324903.0,
          "replies": []
        },
        {
          "id": "mof43xg",
          "author": "Rufuz42",
          "body": "I use a 42” C3 and my favorite part of using it as a monitor is when I turn it on and it asks me if I want to run the pixel scrubbing thing for 5-10 minutes right then. LG - the only 100% wrong time to ask me that question is when I am turning it on after hours of non use. And the constant firmware upstate prompts get old.",
          "score": 0,
          "created_utc": 1745324686.0,
          "replies": []
        }
      ]
    },
    {
      "id": "moewrlc",
      "author": "N0SF3RATU",
      "body": "Are there ads? Have ads made their way to monitors now?",
      "score": 30,
      "created_utc": 1745321591.0,
      "replies": [
        {
          "id": "moeygo3",
          "author": "Barcaroli",
          "body": "It's gonna happen friend\nWe are fried",
          "score": 8,
          "created_utc": 1745322346.0,
          "replies": []
        }
      ]
    },
    {
      "id": "moex5gt",
      "author": "TripleSecretSquirrel",
      "body": "Literally nobody wants smart tv features baked into their gaming monitor. Nobody.\n\nI guess their hope is that someone buys this as a standalone console-like device that just streams games, but that’s got to be such an incredibly narrow use-case! Really it just allows them another vector for days collection.",
      "score": 46,
      "created_utc": 1745321766.0,
      "replies": [
        {
          "id": "mofppm1",
          "author": "ArchusKanzaki",
          "body": "You can just ignore the smart TV stuffs. My Samsung G80SD have smart tv stuffs inside it, but it turns-on directly to my DisplayPort like a normal monitor. It's also pretty neat to watch 4K streaming stuffs too since companies really do not want 4K stream to be pirated and it only allows Smart TV apps to receive 4K output",
          "score": 1,
          "created_utc": 1745332134.0,
          "replies": []
        },
        {
          "id": "mof9ce0",
          "author": "alc4pwned",
          "body": "The smart tv features aren't really the main selling point of these and can presumably just be ignored. The article seems to just be focusing on that aspect for the clicks.",
          "score": 0,
          "created_utc": 1745326675.0,
          "replies": []
        },
        {
          "id": "mof1syw",
          "author": "thorpie88",
          "body": "Can't get a bunch of apps I'd want to use through the Xbox store.",
          "score": -5,
          "created_utc": 1745323759.0,
          "replies": []
        }
      ]
    },
    {
      "id": "moexlwm",
      "author": "boersc",
      "body": "Most 'smart' tvs aren't really that smart and get stupider by the year, as apps get deleted.\nI prefer a dumb tv/monitor and dongle (fire tv, google tv, ...) for the apps.",
      "score": 12,
      "created_utc": 1745321970.0,
      "replies": [
        {
          "id": "mofuaj7",
          "author": "billythygoat",
          "body": "If they made them smart with groundbreaking streaming tech with like an n150 Intel chip with like 64gb of ssd/emmc storage and 8 gb of ram, then we’re talking. Otherwise any smart tv/monitor is just weird and scum.",
          "score": 1,
          "created_utc": 1745333511.0,
          "replies": [
            {
              "id": "moidusd",
              "author": "cloudcity",
              "body": "they would still be filled with ads",
              "score": 1,
              "created_utc": 1745360692.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "moez1yf",
      "author": "shadowdrgn0",
      "body": "![gif](giphy|d10dMmzqCYqQ0|downsized)",
      "score": 7,
      "created_utc": 1745322600.0,
      "replies": []
    },
    {
      "id": "mofo8x0",
      "author": "donnydominus",
      "body": "Nope. I'll just take a monitor please. No need for some ad-ridden interface that bogs down in a year because it only has 1000 mb of memory. \n\nPlease no one buy this shit.",
      "score": 6,
      "created_utc": 1745331685.0,
      "replies": []
    },
    {
      "id": "mof2am2",
      "author": "dasrudiment",
      "body": "Worst of both worlds..",
      "score": 4,
      "created_utc": 1745323959.0,
      "replies": []
    },
    {
      "id": "moey3lv",
      "author": "unematti",
      "body": "Sounds like the worst of both worlds. I want a 65 inch good quality screen without the smarts.",
      "score": 5,
      "created_utc": 1745322188.0,
      "replies": [
        {
          "id": "mofiipg",
          "author": "andynator1000",
          "body": "It sounds like you’re looking for a TV",
          "score": 4,
          "created_utc": 1745329858.0,
          "replies": [
            {
              "id": "mofl2ae",
              "author": "unematti",
              "body": "They all have smarts. The rep literally just left me when I said I want a dumb tv... Yeah, I would love a 4k120Hz 65 inch OLED tv for gaming... But I don't need the smarts and I rather not have them at all. So that's why I didn't buy one yet. I might get a big screen beyond tho. That one also doesn't have extra smarts, and it's an OLED",
              "score": 2,
              "created_utc": 1745330680.0,
              "replies": [
                {
                  "id": "moflrw7",
                  "author": "alc4pwned",
                  "body": "You can just not use the smart features though?",
                  "score": 2,
                  "created_utc": 1745330909.0,
                  "replies": [
                    {
                      "id": "mofugjm",
                      "author": "billythygoat",
                      "body": "I have one I turned the smarts off, it still has the smarts asking if I want to watch my show on another streaming platform. Very creepy.",
                      "score": 1,
                      "created_utc": 1745333561.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mogqi5p",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1745342867.0,
                  "replies": [
                    {
                      "id": "mohemc2",
                      "author": "unematti",
                      "body": "I had an android tv, used ADB to get rid of most of the smarts",
                      "score": 1,
                      "created_utc": 1745349938.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mof3gxf",
      "author": "jacobpederson",
      "body": "Perfectly happy just using the LG smart TV's AS a monitor since 2019.  Great way to avoid paying the monitor tax.",
      "score": 2,
      "created_utc": 1745324432.0,
      "replies": []
    },
    {
      "id": "mof4xxq",
      "author": "slayez06",
      "body": "So I have a C2 as my HTPC monitor in my bedroom, It tries to update it's self every week, So I blocked the url it uses to do this on the router... no lie... they changed it this week and now i'm getting update warnings again. \n\nI prefer dumb monitors",
      "score": 2,
      "created_utc": 1745325015.0,
      "replies": []
    },
    {
      "id": "mofbro4",
      "author": "JohnJohn173",
      "body": "If browsers could just display streamed media content at a resolution above 720p maybe we wouldnt need something like this. The seas have helped me obtain and watch 4k ultrawide movies without the terrible compression and forced resolution and aspect ratio browsers force.",
      "score": 2,
      "created_utc": 1745327552.0,
      "replies": []
    },
    {
      "id": "mofioo9",
      "author": "ArchusKanzaki",
      "body": "I mean, my 32\" Samsung G80SD is already doing this. I'm more surprised that LG have not done this before. For my Samsung, it basically got what is supposed to be the chip for their 8K TV, inside the monitor alongside with other normal desktop PC stuffs, and it generally works well. The default option is to go to PC stuffs first and foremost, but it can switch to smart TV things when you want to do streaming. The upscaler also works alot better inside the Smart TV compared to inside Windows for some reason too.\n\nAlso, in case you guys not aware, Netflix limited 4K output to TV apps apparently.",
      "score": 2,
      "created_utc": 1745329911.0,
      "replies": [
        {
          "id": "mogm5ht",
          "author": "Isoi",
          "body": "Yep, I also have that monitor and I haven't had any bad experience with the smart tv features.",
          "score": 1,
          "created_utc": 1745341632.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mofrhwl",
      "author": "CamRoth",
      "body": "Why the hell would I need or want smart tv features on a monitor I have plugged into a PC...",
      "score": 2,
      "created_utc": 1745332678.0,
      "replies": []
    },
    {
      "id": "mog2vsk",
      "author": "None",
      "body": "Fuck the smart stuff - all I need is a screen. The rest is ON MY PC",
      "score": 2,
      "created_utc": 1745336051.0,
      "replies": []
    },
    {
      "id": "mog3p85",
      "author": "Grzegorxz",
      "body": "‘’smart TV Features’’\n\nMy computer monitor ITSELF has excplicit ads now!!",
      "score": 2,
      "created_utc": 1745336285.0,
      "replies": []
    },
    {
      "id": "moggjec",
      "author": "jsamuraij",
      "body": "Pointless",
      "score": 2,
      "created_utc": 1745340016.0,
      "replies": []
    },
    {
      "id": "moggjvr",
      "author": "tree_squid",
      "body": "Smart TV features in my monitor? I don't even want them in my TV, fuck that shit",
      "score": 2,
      "created_utc": 1745340020.0,
      "replies": []
    },
    {
      "id": "mogpfvd",
      "author": "HG21Reaper",
      "body": "I would like a 34” 4k OLED with 90w PD, 2 HDMI and USB-C / Thunderbolt 4. Remove the smart features and I will buy that shit in a heartbeat",
      "score": 2,
      "created_utc": 1745342568.0,
      "replies": []
    },
    {
      "id": "mogskyl",
      "author": "flux_capacitor3",
      "body": "I wonder how many ads it will have? lol",
      "score": 2,
      "created_utc": 1745343456.0,
      "replies": []
    },
    {
      "id": "mogx7hm",
      "author": "ddelamareuk",
      "body": "Secretly Monitoring All Remote Transmissions",
      "score": 2,
      "created_utc": 1745344777.0,
      "replies": []
    },
    {
      "id": "moh5naa",
      "author": "Original_Ossiss",
      "body": "I’m getting pissed at the smart tv options anymore. \n\nThey’re sticking ads onto my screen without my permissions. What’s next, can’t use the thing unless you’re connected to the internet once every 24 hours?",
      "score": 2,
      "created_utc": 1745347269.0,
      "replies": [
        {
          "id": "moif8qy",
          "author": "x10011010001x",
          "body": "Seeing as many video games, Microsoft programs, etc have gone that route, probably.",
          "score": 1,
          "created_utc": 1745361161.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mof3tmv",
      "author": "Clear_Efficiency5765",
      "body": "1440p 45” ewww",
      "score": 2,
      "created_utc": 1745324573.0,
      "replies": []
    },
    {
      "id": "moeyl6p",
      "author": "Wisniaksiadz",
      "body": "Ive been using 55'' LED or OLED as monitor for like 5y now and I just dont want to go back maan.",
      "score": 1,
      "created_utc": 1745322400.0,
      "replies": []
    },
    {
      "id": "moezm0e",
      "author": "SometimesWill",
      "body": "It would make more sense to just make it all in one computer that can also function as an external monitor for other devices.",
      "score": 1,
      "created_utc": 1745322836.0,
      "replies": []
    },
    {
      "id": "mof08aw",
      "author": "redzaku0079",
      "body": "But that gamer they're targetting already is using those services on his PC and other smart TV. Maybe even pirating his shows.",
      "score": 1,
      "created_utc": 1745323098.0,
      "replies": []
    },
    {
      "id": "mof1bot",
      "author": "ProphetManX",
      "body": "Why man, why have they still not just made a nice 40in curved 4k 120hz model yet.   \n\nCurved were all the rage for a while, and really it's worthless unless you're sitting right in front of the screen.  Now that you can use a 40in TV as a monitor (due to 120+hz support) I can both game and work on that screen.  4k resolution at 40in is like having 4 1080p 20in monitors.  So much room for productivity during the day. \n\nThe only problem with a 40in monitor are the edges, the corners are pretty far away, so this is a model where a curved screen would be great, because you're sitting right in front of it.\n\nI bought the lg 40in 4k oled model a couple of years back, I love it. It was $1000 on Amazon and have zero problems. The only upgrade I'm looking for is for it to be curved  =/\n\nAm I the only person left that wants this?",
      "score": 1,
      "created_utc": 1745323556.0,
      "replies": [
        {
          "id": "moffkct",
          "author": "DerSchattenJager",
          "body": "My wish list for a monitor is:\n\n- 4K @120hz GSync\n- 45-48” \n- 21:9 Ultrawide\n- OLED\n\nSo far, they usually only have 2 or 3 of those, and they’re like $1500",
          "score": 2,
          "created_utc": 1745328875.0,
          "replies": [
            {
              "id": "mofkiih",
              "author": "alc4pwned",
              "body": "The 5k2k displays that recently came out are the first to really meet those requirements right? And yeah they're $2k+, which is kinda to be expected with that spec list.",
              "score": 2,
              "created_utc": 1745330503.0,
              "replies": [
                {
                  "id": "mofl5y9",
                  "author": "DerSchattenJager",
                  "body": "Oh, do you have a link to one? I’ve not been able to find one with all those specs",
                  "score": 1,
                  "created_utc": 1745330713.0,
                  "replies": [
                    {
                      "id": "mofnkgx",
                      "author": "alc4pwned",
                      "body": "They're just now coming out: [https://www.lg.com/us/monitors/lg-45gx950a-b-gaming-monitor](https://www.lg.com/us/monitors/lg-45gx950a-b-gaming-monitor)",
                      "score": 1,
                      "created_utc": 1745331475.0,
                      "replies": [
                        {
                          "id": "mofp5dc",
                          "author": "DerSchattenJager",
                          "body": "Sweeeet! Thanks for the link!",
                          "score": 1,
                          "created_utc": 1745331963.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mofqka7",
          "author": "ArchusKanzaki",
          "body": "Can't you just sit abit farther away? I used to have problem with my 32\" not having curves but nowadays not so much after I increase my sitting distance. I just upgraded to another flat 32\" because I also use my monitor as my bedroom TV and the curve will compromise that feature.",
          "score": 1,
          "created_utc": 1745332394.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mof37vf",
      "author": "MissusNesbitt",
      "body": "I use an LG C3 as my “gaming” monitor and it has never been connected to the internet specifically because I can’t stand smart tv “features.” LG is one of the less frustrating options in the market but for a device that needs to do nothing but turn on and display my content I wish I could rip it all out.",
      "score": 1,
      "created_utc": 1745324331.0,
      "replies": [
        {
          "id": "mofiwtm",
          "author": "NotanAlt23",
          "body": "Hey, I want one of those monitors. Could you tell me if it has the Gaming Auto motion plus? Or just Auto motion plus in general? All I can find is that the G7 has it but not sure about G3.",
          "score": 1,
          "created_utc": 1745329985.0,
          "replies": []
        },
        {
          "id": "moh80gr",
          "author": "LetMeSleep21",
          "body": "Have you found a way to disable the intermittent \"connect your tv to the internet\" popup? The TV randomly turns on with this prompt.",
          "score": 1,
          "created_utc": 1745347975.0,
          "replies": [
            {
              "id": "mohf4jc",
              "author": "MissusNesbitt",
              "body": "I solved that by disabling WiFi. I can’t remember the exact setting name, but it’s in there.",
              "score": 2,
              "created_utc": 1745350090.0,
              "replies": [
                {
                  "id": "mohm08v",
                  "author": "LetMeSleep21",
                  "body": "Drat, that's already disabled...\nI must be on a different firmware than you.",
                  "score": 1,
                  "created_utc": 1745352134.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mof44ad",
      "author": "xpen25x",
      "body": "this would give me more room on my desk with a 39in 4k honestly i wish they made more 32in 4k tv's i dont game so 60hz would be fine.",
      "score": 1,
      "created_utc": 1745324690.0,
      "replies": []
    },
    {
      "id": "mof4veq",
      "author": "Voidfang_Investments",
      "body": "I use the 42 C3 and couldn’t be happier",
      "score": 1,
      "created_utc": 1745324987.0,
      "replies": []
    },
    {
      "id": "mof5xzg",
      "author": "Acevedo1992",
      "body": "Aside from “smart” features always being the worse thing for the customer, the sizing is so frustrating.\n\nThe C4 comes in 42” and 48” because they noticed the PC market was using them as monitors. So now they’re offering 39”, 42”, 45”, and 48” for PC users. \n\nBUT if you’re looking for a home theater your options are 55”, 65”, 77”, and 83”. Like how is there an entire 12” between sizes??",
      "score": 1,
      "created_utc": 1745325404.0,
      "replies": [
        {
          "id": "mofrpvh",
          "author": "ArchusKanzaki",
          "body": "I presume that's because that's the most cost-effective way to cut the big mother panels to create the display. Its only recently they making 27\" 4K display and I presume that's because the mother panel yield was not good enough to economically make 27\" 4K display.",
          "score": 3,
          "created_utc": 1745332745.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mofahpc",
      "author": "zushiba",
      "body": "No thanks. The bent part of monitors is that they aren’t selling my data and pushing ads at me. And I won’t buy one that will.",
      "score": 1,
      "created_utc": 1745327093.0,
      "replies": []
    },
    {
      "id": "mofg624",
      "author": "None",
      "body": "I’ve had a Smart Samsung, LG, Vizio, and Sony and none of them are seamless when it comes to streaming compared to an actual device. Seems like the TV is going to explode when I boot it up and instantly launch an app.",
      "score": 1,
      "created_utc": 1745329081.0,
      "replies": []
    },
    {
      "id": "mofh1yu",
      "author": "cbeiser",
      "body": "I have a computer. Why would I want another computer in my monitor that I can't control nearly as well (mostly a way to force ads).",
      "score": 1,
      "created_utc": 1745329378.0,
      "replies": []
    },
    {
      "id": "moficqb",
      "author": "TMack23",
      "body": "Some fun data that CharGPT dug up, which may or may not be accurate, showed Roku/Visio reporting $18-20 per device per year. So average this out to the lifetime of the device and the industry figures they’ll make $100 on data collection and targeted advertising over the life of your TV. This is a big deal to them when the typical profit margin for the hardware along is 6% range.",
      "score": 1,
      "created_utc": 1745329803.0,
      "replies": []
    },
    {
      "id": "mofidg1",
      "author": "zeldaink",
      "body": "24\" 4k 144Hz and I'm sold. Money is no object.",
      "score": 1,
      "created_utc": 1745329810.0,
      "replies": [
        {
          "id": "mofrasj",
          "author": "ArchusKanzaki",
          "body": "I'll take even 60Hz honestly. I want to put it vertically and use it as my secondary monitor. \n\nReason is because the edge movement is way too drastic between my current 4K and my secondary 1080p because of how Windows do scaling. I need to use a separate app called LitteBigMouse to make mouse movement more dpi-aware.",
          "score": 1,
          "created_utc": 1745332619.0,
          "replies": [
            {
              "id": "mog3qbu",
              "author": "zeldaink",
              "body": "LG already had 24\" 4k monitor (24MD4KLB-B), but it's discontinued and their smallest 4k display is at 27\" - 27G850A-B. I can't find it for sale here :(",
              "score": 1,
              "created_utc": 1745336293.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mofkr5g",
      "author": "Gnarlodious",
      "body": "I had an LG computer display and it failed inside warranty. They made me ship it back and refunded the purchase price. Now they are hammering me to buy another one. But never again LG.",
      "score": 1,
      "created_utc": 1745330580.0,
      "replies": []
    },
    {
      "id": "moftfl9",
      "author": "asinglepieceoftoast",
      "body": "Samsung already did this…. Like years ago",
      "score": 1,
      "created_utc": 1745333255.0,
      "replies": []
    },
    {
      "id": "moftxvw",
      "author": "crimxxx",
      "body": "I can see some people that want to watch Netflix and not have to deal with your computer to get there as a nice to have. Also if it has a remote control it can be nice if say you had this in a bed room wanted to watch from a bed, and control it. On the flip side companies have slowly been moving to making there built in tv os more data gathering and ad showing, which would make me feel like it will nit be the best option if those bother you. \n\nAlso I personally don’t feel this feature warrants a premium over without it since you do have it connected to a computer most likely, and usually the built in modules are as cheap as they can get away with. Nice to have (also assuming you can fully disable and not have it get in the way), some people will find a use, I don’t think I would ever pay extra even if I considered the use case where I want to use it.",
      "score": 1,
      "created_utc": 1745333406.0,
      "replies": []
    },
    {
      "id": "mog55pj",
      "author": "Wellithappenedthatwy",
      "body": "Why are smart TVs so dumb?",
      "score": 1,
      "created_utc": 1745336700.0,
      "replies": []
    },
    {
      "id": "mogbf0v",
      "author": "Fidodo",
      "body": "I already have my gaming PC hooked up to my TV.",
      "score": 1,
      "created_utc": 1745338512.0,
      "replies": []
    },
    {
      "id": "mogco69",
      "author": "NoSignificance4349",
      "body": "Neither one or the other. Gamers will not buy it people not interested in gaming too they want TV.",
      "score": 1,
      "created_utc": 1745338881.0,
      "replies": []
    },
    {
      "id": "mogeqp9",
      "author": "Medium_Banana4074",
      "body": "It's not even 4k. Bah.",
      "score": 1,
      "created_utc": 1745339487.0,
      "replies": []
    },
    {
      "id": "mogl8df",
      "author": "Isoi",
      "body": "My g80sd has Tizen and honestly I like it.",
      "score": 1,
      "created_utc": 1745341364.0,
      "replies": []
    },
    {
      "id": "mogxcdq",
      "author": "Dominick_PK",
      "body": "Can I just have my 24 inch monitors back please",
      "score": 1,
      "created_utc": 1745344816.0,
      "replies": []
    },
    {
      "id": "mogzf1s",
      "author": "keeleon",
      "body": "So a smart TV without sound.",
      "score": 1,
      "created_utc": 1745345422.0,
      "replies": []
    },
    {
      "id": "mohae3r",
      "author": "creazywars",
      "body": "So now my computer AND my monitor have to boot up?",
      "score": 1,
      "created_utc": 1745348678.0,
      "replies": []
    },
    {
      "id": "mohdv7y",
      "author": "TheRealSeeThruHead",
      "body": "I don’t even use webos on my lg tv",
      "score": 1,
      "created_utc": 1745349714.0,
      "replies": []
    },
    {
      "id": "mohezek",
      "author": "EdCenter",
      "body": "I'm excited about the 39\" version of their GX9! I've been watching reviews of their 45\" GX9 and it seems like the perfect monitor for work & gaming, but 45\" is just too big. But 39\" is PERFECT!",
      "score": 1,
      "created_utc": 1745350048.0,
      "replies": []
    },
    {
      "id": "mohsnby",
      "author": "sinstein",
      "body": "One benefit of Smart monitors - you can get a TV expensed from your workplace because it is technically a \"monitor\"",
      "score": 1,
      "created_utc": 1745354076.0,
      "replies": []
    },
    {
      "id": "mohzxnh",
      "author": "SamuelHamwich",
      "body": "I haven't got a new TV for about 2 years, are the UIs still so laggy it's actually annoying?  Or did they get some processor speed since then?  I can't stand browsing the TV menus with 3 second delay for each menu.  (Even on my Samsung)",
      "score": 1,
      "created_utc": 1745356250.0,
      "replies": []
    },
    {
      "id": "moi4di2",
      "author": "0nSecondThought",
      "body": "I just want a large format oled monitor. No smart anything. Why can’t they grasp this?",
      "score": 1,
      "created_utc": 1745357633.0,
      "replies": []
    },
    {
      "id": "moi5jln",
      "author": "goldaxis",
      "body": "I don't own many TVs, but the LG I own prompts me constantly for updates. No thanks. The data collection business needs to be put under.",
      "score": 1,
      "created_utc": 1745357994.0,
      "replies": []
    },
    {
      "id": "moi9whr",
      "author": "Dan-in-Va",
      "body": "It depends on the quality. Lots of kids would benefit from this.",
      "score": 1,
      "created_utc": 1745359380.0,
      "replies": []
    },
    {
      "id": "moieta5",
      "author": "x10011010001x",
      "body": "Smart TV's were a great idea until advertising absolutely everywhere became popular. I got a TCL Roku TV about 7 years ago and noticed a huge increase in ads during COVID. Enough of them that it prompted me to factory reset the TV and only use it as another monitor and connection to my stereo. Every update brought more ads that slowed it down more. Ads for the background, ads on the right side, ads at the bottom, briefly even pop-up ads when I turned it on. I have a theory that smart TV's prompted streaming services to seek ad revenue because they knew the only way around ads would be special ad-free memberships. 7 years later, there's ads everywhere and the \"correct\" way to bypass is membership for fewer ads. YouTube even has ads if you pay for the \"ad-free membership\" now.\n\nIf LG can promise NO ADS in the UI, seems like a good idea. But because I'm about 99.99% certain that's not gonna happen, seems like a bad idea.",
      "score": 1,
      "created_utc": 1745361017.0,
      "replies": [
        {
          "id": "moj95ir",
          "author": "None",
          "body": "I have an Apple TV. The only ads are for shows on Apple TV+. I bet I could turn those off. it’s a great device.",
          "score": 1,
          "created_utc": 1745371392.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mojfbky",
      "author": "Chance815",
      "body": "Learn me, why a computer monitor would not be good as a TV? Or is this a size thing?",
      "score": 1,
      "created_utc": 1745373570.0,
      "replies": []
    },
    {
      "id": "mojpv4f",
      "author": "thePZ",
      "body": "Who is going to buy the 39” at $1599 when the 45” is only $100 more at $1699 other than the few who physically cannot fit it?",
      "score": 1,
      "created_utc": 1745377409.0,
      "replies": []
    },
    {
      "id": "mojza0k",
      "author": "deusfaux",
      "body": "reminder that curved displays by necessity distort all content you view on it. \n\nyou can make an argument that for non media, like productivity, it's a trivial alteration, but for everything else, you're introducing a problem without a current solution",
      "score": 1,
      "created_utc": 1745381298.0,
      "replies": []
    },
    {
      "id": "mokgwzr",
      "author": "peanut340",
      "body": "Sorry but I don't want to drop down to 1080p for high refresh, just give me 1440p with some minor letterboxing or something.",
      "score": 1,
      "created_utc": 1745390530.0,
      "replies": []
    },
    {
      "id": "mokuo7u",
      "author": "QuantumQuantonium",
      "body": "Please raise your hand if you wanted ~~dumb~~ smart TV features in a monitor let alone a gaming monitor.",
      "score": 1,
      "created_utc": 1745399320.0,
      "replies": []
    },
    {
      "id": "momagc0",
      "author": "semiquaver",
      "body": "I’m not about to connect my freaking monitor to wifi just so LG can use content recognition to spy on what I’m doing. \n\nOr so these monitors piggyback on the computer’s network via the wired connection? If so that’s even worse.",
      "score": 1,
      "created_utc": 1745420472.0,
      "replies": []
    },
    {
      "id": "monv9ax",
      "author": "imakesawdust",
      "body": "LG has already shown smart TVs that analyze screen content to guess the viewer's mood.  Now let's extend this concept to a computer monitor that analyzes screen content: it's relatively easy to perform optical character recognition so one of these smart monitors could be used as a type of keylogger...",
      "score": 1,
      "created_utc": 1745436901.0,
      "replies": []
    },
    {
      "id": "mopzvw9",
      "author": "OhManOk",
      "body": "Can we just have a 32 inch 1440 OLED, for the love of christ",
      "score": 1,
      "created_utc": 1745461771.0,
      "replies": []
    },
    {
      "id": "mpa6bp9",
      "author": "q123459",
      "body": "curved monitor cannot substitute tv for more than one person. also smart tv part lacks nvidia rtx hdr.",
      "score": 1,
      "created_utc": 1745742095.0,
      "replies": []
    },
    {
      "id": "mog7dk8",
      "author": "proscriptus",
      "body": "The secret, if you can afford it, is to get a commercial display. You can get all of the TV features you want without any of the ads. They're not as \"smart,\" but in exchange you get much better build quality and warranties up to five years.",
      "score": 1,
      "created_utc": 1745337336.0,
      "replies": []
    },
    {
      "id": "moffayh",
      "author": "Smokey-McPoticuss",
      "body": "I was excited with such a large Oled display, but then when I saw smart tv\n\n![gif](giphy|hWGBKil1b9fpR5go1f|downsized)",
      "score": 0,
      "created_utc": 1745328785.0,
      "replies": []
    },
    {
      "id": "mofu9xp",
      "author": "SnooPickles2750",
      "body": "So a monitor with Ads, no thanks.",
      "score": 0,
      "created_utc": 1745333506.0,
      "replies": []
    },
    {
      "id": "mogh0hn",
      "author": "gamerfiiend",
      "body": "I literally bought a 32 oled gaming monitor for the purpose of being my TV because I didn’t want any smart features.. looks like they’ll add it anyways lol",
      "score": 0,
      "created_utc": 1745340155.0,
      "replies": []
    },
    {
      "id": "mogq80c",
      "author": "abatwithitsmouthopen",
      "body": "We don’t need 45 and 39 inch gaming monitors. What’s needed is more 27 inch and 31 inch OLED gaming monitors.",
      "score": 0,
      "created_utc": 1745342787.0,
      "replies": []
    }
  ]
}