{
  "post": {
    "title": "Intel’s future laptops will have memory sticks again",
    "author": "a_Ninja_b0y",
    "id": "1ghc9ti",
    "score": 1099,
    "created_utc": 1730485586.0,
    "selftext": "",
    "num_comments": 55,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ghc9ti/intels_future_laptops_will_have_memory_sticks/"
  },
  "comments": [
    {
      "id": "luxerm0",
      "author": "MentalAusterity",
      "body": "Good god, it took me way too long to realize they were talking about DIMMs. For a sec, I thought Sony found an old warehouse full of Memory Stick Duos and sold them to intel…",
      "score": 430,
      "created_utc": 1730498398.0,
      "replies": [
        {
          "id": "luxm7co",
          "author": "TheTjalian",
          "body": "You know you're old when that's the first thing that came to mind\n\n(It's okay, me too!)",
          "score": 113,
          "created_utc": 1730501053.0,
          "replies": [
            {
              "id": "luylzp6",
              "author": "theycmeroll",
              "body": "Had PSP flashbacks\n\n![gif](giphy|cEOG7nGA7448M)",
              "score": 37,
              "created_utc": 1730514685.0,
              "replies": []
            },
            {
              "id": "luy56l6",
              "author": "Keks3000",
              "body": "Ha, me as well! Sony Ericsson K750i with MP3s playing from a Memory Stick Duo that I ordered directly from China because they were stupid expensive in Germany. That was one hell of a phone man, to me it felt like a leap about as big as the jump to my first iPhone :-)",
              "score": 9,
              "created_utc": 1730507962.0,
              "replies": [
                {
                  "id": "luzkbht",
                  "author": "radio-ray",
                  "body": "That was my first phone. I was too young to get the memory stick that I needed and I didn't even know how to order stuff online...",
                  "score": 3,
                  "created_utc": 1730534116.0,
                  "replies": []
                },
                {
                  "id": "lv5w1dz",
                  "author": "rpkarma",
                  "body": "I miss my M600i…",
                  "score": 2,
                  "created_utc": 1730633829.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lv0mj6e",
          "author": "secretrapbattle",
          "body": "That isn’t what happened? I have to read the article some year I guess.",
          "score": 2,
          "created_utc": 1730555654.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luwcsjx",
      "author": "thefpspower",
      "body": "This is not because the consumer hated it, it was the OEMs that couldn't upcharge you for memory upgrades like before, they even played around with selling the memory parts of it at cost to keep the OEM's happy but seems like it didn't work.",
      "score": 286,
      "created_utc": 1730486137.0,
      "replies": [
        {
          "id": "luwnlu4",
          "author": "Angry_Villagers",
          "body": "The article says that it is partly because they had to outsource a lot of the components from outside companies and even rivals. This made it unprofitable. It also indicates that their initial intention was never for this to be the way forward for their entire product line but merely an attempt to create the most efficient system possible. Who knows what their intent actually was, but within the context given in the article all of this makes sense and seems rational.",
          "score": 99,
          "created_utc": 1730489540.0,
          "replies": [
            {
              "id": "luwppx2",
              "author": "thefpspower",
              "body": "Well yeah if they can't sell the memory with a nice margin it's not worth it, you still have to take the hit for warranty, so you can't sell it at cost.\n\nIntel has tried this before a few years ago and it didn't work, they thought it could work now because it's way more efficient but the OEMs don't give a crap about effciency, they want the margins.",
              "score": 44,
              "created_utc": 1730490213.0,
              "replies": [
                {
                  "id": "luzltyd",
                  "author": "iamnotexactlywhite",
                  "body": "wdym “take the hit for warranty”?",
                  "score": 4,
                  "created_utc": 1730535208.0,
                  "replies": [
                    {
                      "id": "lv0odea",
                      "author": "GrynaiTaip",
                      "body": "Some units will be defective and manufacturer will have to replace them for free. It's an extra cost that has to be factored into the final price of the device.",
                      "score": 3,
                      "created_utc": 1730556336.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "luwtwvf",
                  "author": "CompromisedToolchain",
                  "body": "Intel is big on connectors now. It only makes sense to focus on integrating parts and not trying to be the only game in town. Their focus is on connectivity at modern transistor manufacturing levels. Check out the Universal Chiplet Interconnect Express.",
                  "score": 2,
                  "created_utc": 1730491541.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "luz75b5",
              "author": "HippoLover85",
              "body": "Imo intel and amd should both go to on package memory, and sell their chips to oems with 2 or 3 different memory capacities. On package memory is the way forward.",
              "score": 1,
              "created_utc": 1730525083.0,
              "replies": [
                {
                  "id": "n0bj0ja",
                  "author": "The_B_Wolf",
                  "body": "Intel is already doing this, no? Kind of a straight up admission that Apple was right to do this back in 2020.",
                  "score": 1,
                  "created_utc": 1751151949.0,
                  "replies": [
                    {
                      "id": "n0cnslm",
                      "author": "HippoLover85",
                      "body": "Lunar lake was. Pat said they were canceling on package because oems didnt like it (couldnt upsell laptops for memory).\n\nWill see if they reverse course. They should imo. \n\nApple is definitely right.",
                      "score": 1,
                      "created_utc": 1751167902.0,
                      "replies": [
                        {
                          "id": "n0cp6sz",
                          "author": "The_B_Wolf",
                          "body": "Apple upsells on memory and storage upgrades. (Boy do they ever.) I wonder how Pat will feel when Intel gets canceled because they can't deliver laptops with both performance and battery life.",
                          "score": 1,
                          "created_utc": 1751168527.0,
                          "replies": []
                        },
                        {
                          "id": "n0cql12",
                          "author": "The_B_Wolf",
                          "body": "*Pat said they were canceling on package because oems didnt like it (couldnt upsell laptops for memory).*\n\nMy grandfather informs me that this is not possible. I have been told many times that makers of Windows laptops are saints who will bend over backward to deliver more value for their customers without making an extra dime, while Apple is run by criminal vampires and the guy in charge is an accountant who looks like Nosferatu.",
                          "score": 1,
                          "created_utc": 1751169133.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "luwx0i9",
          "author": "OhhhhhSHNAP",
          "body": "Apple: yeah, yeah, exactly… I’ll just sit right here, trying not to draw any attention",
          "score": 14,
          "created_utc": 1730492535.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lux6ncj",
      "author": "Tenableg",
      "body": "I'm ready for hardware expiration dates.",
      "score": 61,
      "created_utc": 1730495656.0,
      "replies": [
        {
          "id": "lux85wx",
          "author": "roberte94066",
          "body": "Windows 11 kind of took care of that-",
          "score": 37,
          "created_utc": 1730496156.0,
          "replies": [
            {
              "id": "lux8a49",
              "author": "Tenableg",
              "body": "Think to the future.",
              "score": 13,
              "created_utc": 1730496195.0,
              "replies": []
            },
            {
              "id": "lv0b38u",
              "author": "None",
              "body": "[deleted]",
              "score": 3,
              "created_utc": 1730550976.0,
              "replies": [
                {
                  "id": "lv1efyi",
                  "author": "gargravarr2112",
                  "body": "Win10 ran on just about any hardware that could run Win7.\n\nWin11 is not noticeably more resource-intensive than Win10. However, it *requires* a Coffee Lake or newer Intel CPU and a TPM. So for no other reason than Microsoft Says So, older generations of hardware are officially unsupported and the installer will usually tell you it can't run Win11, even though the hardware is capable.\n\nThere's a few workarounds (am running Win11 on my Kaby Lake i5 gaming PC) but it will doubtless be a matter of time before MS disables those.",
                  "score": 3,
                  "created_utc": 1730565135.0,
                  "replies": [
                    {
                      "id": "lv6bu8b",
                      "author": "None",
                      "body": "and Apple has been doing this for years and years. Every OS version has a machine compatibility list. Systems age out. They do at least support three releases, but the release cycle is yearly. So anything older than 2017 MB Pros are eol. Some of these could be purchased with 32GB ram. They aren’t doorstops yet.",
                      "score": 1,
                      "created_utc": 1730641025.0,
                      "replies": [
                        {
                          "id": "lv6hqm0",
                          "author": "gargravarr2112",
                          "body": "Yup, one of the reasons I stopped buying Apple hardware. My 2014 Retina is unsupported. At least it's possible and fairly easy to run alternative OSes on that hardware. Was a major concern when they brought out their M chips; there's at least one Linux option now, but with a fully integrated hardware and software platform, Apple has the final say in what you can run on the hardware you paid for - you don't fully own it.\n\nMicrosoft seems to want a slice of the same pie; they've dabbled in it before, such as Windows RT on tablets with ARM CPUs that were also a nightmare to run alternative OSes on. However, whilst they have a significant majority in the OS market, they don't have much of a presence in the hardware market. They can't force obsolescence in the same way Apple can. I wonder what's going to happen with Windows 12; will it only run on machines less than a year old? If so, I foresee an even larger exodus to Linux.",
                          "score": 2,
                          "created_utc": 1730643220.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lv0z1he",
                  "author": "Pineapple_Assrape",
                  "body": "Announcing end of service for old windows then arbitrarily locking out a ton of hardware from being able to run the new one.",
                  "score": 6,
                  "created_utc": 1730560033.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lv0s0w8",
              "author": "notjordansime",
              "body": "Wait how?",
              "score": 1,
              "created_utc": 1730557648.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lv006iu",
          "author": "sunkenrocks",
          "body": "Like the Apple III? That thing had such bad cooling, they're garunteed to give out using them for a certain amount of time! \n\nIt was so bad, the official support line when you called told you to pick your Apple III up about 2-6in off your desk... And drop it, hoping the chips slot back into place after the heat popped them out!\n\nThere's some terrible PCs out there and of course, in theory, every computer will eventually fail... But that's the only one I know of from a decently sized company that has a 100% failure rate lol",
          "score": 7,
          "created_utc": 1730545136.0,
          "replies": []
        },
        {
          "id": "luzklwj",
          "author": "notagoodscientist",
          "body": "That’s actually what they’ve built into CPUs already, servers only so far, but you buy the hardware which has parts locked out then you pay for a license to unlock them for a limited period of time https://www.intel.com/content/www/us/en/products/docs/ondemand/overview.html",
          "score": 2,
          "created_utc": 1730534324.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luxwr97",
      "author": "imakesawdust",
      "body": "Hate to see them pull out of the discrete GPU market.",
      "score": 15,
      "created_utc": 1730504848.0,
      "replies": [
        {
          "id": "lv0slhd",
          "author": "notjordansime",
          "body": "Wait I thought the ARC gpus weren’t cancelled?",
          "score": 6,
          "created_utc": 1730557842.0,
          "replies": [
            {
              "id": "lv0vwk2",
              "author": "Znuffie",
              "body": "They aren't.",
              "score": 1,
              "created_utc": 1730558964.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luxh73g",
      "author": "Quiet_Desperation_",
      "body": "Until we get battery life on par with a MBP I don’t care. I just want a Linux Laptop on ARM, with the battery and performance of a MBP. That’s it. I can run 16 docker containers and all of my dev software on my M2 Max MBP for 6-8 hours. My last Lenovo Linux machine would last 2 hours max under that same load",
      "score": 54,
      "created_utc": 1730499259.0,
      "replies": [
        {
          "id": "luy1721",
          "author": "TehOwn",
          "body": "Speaking as someone who used to fix laptops, you bought one of the worst makes of garbage budget laptops and compared it to a premium MacBook that costs thousands.\n\nReminds me of when people compare their iPhone to Android but their last Android was a 5 year old budget-line second hand phone and their iPhone is the iPhone 25 Super MAX Plus XXL.\n\nhttps://www.tomsguide.com/best-picks/best-laptops-for-battery-life#section-the-longest-lasting-laptop\n\nHere's a Dell with a Snapdragon that outlasts a MacBook Pro, according to Tom's Hardware. Honestly, though, I can see why you'd prefer the MacBook.",
          "score": 51,
          "created_utc": 1730506477.0,
          "replies": [
            {
              "id": "luy30h5",
              "author": "danielv123",
              "body": "I got expensive Lenovo's and dells as well, it's the same. Actually, the 200$ Lenovo N21 Chromebook I had in 2015 had the 4th best laptop battery life I have ever had, second to M1 8gb (sold because 8gb is a joke and it was swapping bad with 4 tabs open), 16gb M1 (eventually got stolen) and 18gb m3 pro (amazing machine)\n\nI just wish apple sold ram and storage with less than 1000% margin.",
              "score": 21,
              "created_utc": 1730507149.0,
              "replies": [
                {
                  "id": "luyukpz",
                  "author": "pizoisoned",
                  "body": "Yeah I like my Apple hardware, I just wish I didn’t have to make future decisions with today’s budget. It’s beyond stupid that memory has to be determined at purchase and that’s it forever.",
                  "score": 10,
                  "created_utc": 1730518487.0,
                  "replies": []
                },
                {
                  "id": "luzq289",
                  "author": "Ray-chan81194",
                  "body": "Actually I would buy an apple product if they stop charging RAM and Storage like crazy. Paying $200 and you should get 1TB storage, not 512GB.",
                  "score": 10,
                  "created_utc": 1730538322.0,
                  "replies": [
                    {
                      "id": "lv0aye2",
                      "author": "danielv123",
                      "body": "If I could get a mere 100% markup I'd probably get the top spec version.",
                      "score": 2,
                      "created_utc": 1730550913.0,
                      "replies": []
                    },
                    {
                      "id": "lv0vuv9",
                      "author": "Znuffie",
                      "body": "Just FYI - it's $600 extra to upgrade to 2TB on the latest Mac Mini.",
                      "score": 1,
                      "created_utc": 1730558948.0,
                      "replies": [
                        {
                          "id": "lv0y743",
                          "author": "Ray-chan81194",
                          "body": "$400 from 256GB to 2TB sounds better to me, not $800.",
                          "score": 1,
                          "created_utc": 1730559747.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lv0li4c",
          "author": "PaddiM8",
          "body": "> Until we get battery life on par with a MBP I don’t care \n\nBut we do have that now... The new snapdragon laptops sometimes even outperform the macs. Even some new ones with intel chips have similar battery life",
          "score": 2,
          "created_utc": 1730555273.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luxggn7",
      "author": "pcpartlickerr",
      "body": "Hopefully not Optane.",
      "score": 5,
      "created_utc": 1730498996.0,
      "replies": []
    },
    {
      "id": "luznm5r",
      "author": "pandaSmore",
      "body": "/ And it may abandon desktop GPUs.",
      "score": 2,
      "created_utc": 1730536528.0,
      "replies": []
    },
    {
      "id": "lv0r3el",
      "author": "heatedhammer",
      "body": "That's assuming there will be any Intel laptops in the future to begin with.\n\nIntel is swimming in its own shit.",
      "score": 2,
      "created_utc": 1730557321.0,
      "replies": []
    },
    {
      "id": "luzni0d",
      "author": "radiantai2001",
      "body": "oh so stupid laptops with high end processors and only 8gb of ram haven't been killed off after all... yayyy....",
      "score": 2,
      "created_utc": 1730536441.0,
      "replies": []
    },
    {
      "id": "luyt627",
      "author": "Avrution",
      "body": "Next step, bring back removable cpu's on laptops.",
      "score": 2,
      "created_utc": 1730517826.0,
      "replies": []
    },
    {
      "id": "lv0nehj",
      "author": "SmittyMcSmitherson",
      "body": "The reason for memory on package (MOP) is to support the fastest memory bandwidths which is nearly impossible with memory on board and not supported with CAMM. So wins for low cost expand ability, but losses for performance.",
      "score": 1,
      "created_utc": 1730555978.0,
      "replies": []
    },
    {
      "id": "lv15kho",
      "author": "kutkun",
      "body": "Inconsistency is not something I like. Hope they build a reliable and sustainable ecosystem. But I am not betting on it.",
      "score": 1,
      "created_utc": 1730562221.0,
      "replies": []
    },
    {
      "id": "luyzy2v",
      "author": "isaiddgooddaysir",
      "body": "Well wasn’t going to buy an intel laptop ever again anyway",
      "score": 1,
      "created_utc": 1730521084.0,
      "replies": []
    },
    {
      "id": "luwt3y7",
      "author": "None",
      "body": "People also want hot swappable batteries in phones, but let’s be honest….the percentage of people that will actually swap ram instead of buying a new machine is….probably less than 1%.\n\nThey should have just figured out how to make the memory chips how swappable on the SoC itself. The they could just make a base model and let users pay for the upgrades before buying. Right now, how is probably works is they get and SoC with non changeable memory, they have to order different SoC’s in bulk.",
      "score": -24,
      "created_utc": 1730491285.0,
      "replies": [
        {
          "id": "luwwoz5",
          "author": "3Dchaos777",
          "body": "“They should have just figured out”\nEasier said that done buddy lmao. Why don’t they “just figure out how to cure cancer” also!",
          "score": 12,
          "created_utc": 1730492431.0,
          "replies": [
            {
              "id": "lv5gyin",
              "author": "philocity",
              "body": "Hey man I’m just an ideas guy, that’s why I make the big bucks. The engineers can figure it out, and if they can’t, we’ll fire them and hire a team of interns to do it instead.",
              "score": 1,
              "created_utc": 1730623962.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lv0bacr",
          "author": "rubseb",
          "body": "It's not just about upgradability. It's about repairability. If the RAM can be hot-swapped then replacing a faulty stick is a piece of cake (either for users or for repair shops). If the whole motherboard needs to be replaced, that's another story. Even if still under warranty, the warranty usually doesn't cover a loan device while your own is being repaired, so I'd much rather have a laptop that can be repaired in minutes if it comes to that, as opposed to having to be shipped across the country to some repair facility where, after three weeks, they decide it's not worth the work and they send you a new device instead that you have to configure again from scratch.",
          "score": 2,
          "created_utc": 1730551066.0,
          "replies": []
        }
      ]
    }
  ]
}