{
  "post": {
    "title": "Why Apple doesn’t make iPhones in America – and probably won’t",
    "author": "a_Ninja_b0y",
    "id": "1kxexgh",
    "score": 1150,
    "created_utc": 1748432604.0,
    "selftext": "",
    "num_comments": 270,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kxexgh/why_apple_doesnt_make_iphones_in_america_and/"
  },
  "comments": [
    {
      "id": "mup0f68",
      "author": "SkyriderRJM",
      "body": "Because the facilities that make iPhones are CITIES.  Not factories.",
      "score": 576,
      "created_utc": 1748438105.0,
      "replies": [
        {
          "id": "mupbvc3",
          "author": "Lunar_Landing_Hoax",
          "body": "That's what I was trying to say. Somebody said they could bring it to Mississippi for cheap labor but the biggest city in Mississippi has 150,000 people. The Foxconn facility in Zhengzhou employs 200,000 people. Just doing a quick and easy lift and shift of those operations is a complete fantasy, it's not gonna happen. ",
          "score": 382,
          "created_utc": 1748441728.0,
          "replies": [
            {
              "id": "mupc50i",
              "author": "SkyriderRJM",
              "body": "People think these things are made in a single factory with like 500 workers.  NOPE.",
              "score": 204,
              "created_utc": 1748441809.0,
              "replies": [
                {
                  "id": "mupd5nz",
                  "author": "Lunar_Landing_Hoax",
                  "body": "The 200K figure I said also doesn't account for the materials needed that are also sourced in China. Like you said, NOPE. ",
                  "score": 148,
                  "created_utc": 1748442107.0,
                  "replies": [
                    {
                      "id": "mupk33z",
                      "author": "Zomunieo",
                      "body": "There’s about 86 million people living in the Pearl River Delta. It’s the largest manufacturing hub in the world now. Like Silicon Valley, it’s an ecosystem of industry, education and investment that took decades to build and would take decades to replicate.",
                      "score": 96,
                      "created_utc": 1748444093.0,
                      "replies": [
                        {
                          "id": "muuhi8w",
                          "author": "NestyHowk",
                          "body": "Shiiiet, at the point the US is, it might take centuries not decades",
                          "score": 8,
                          "created_utc": 1748505219.0,
                          "replies": [
                            {
                              "id": "mv5fof3",
                              "author": "gargravarr2112",
                              "body": "And exactly what are they going to build it with, when they tariffed all the raw materials...",
                              "score": 3,
                              "created_utc": 1748644414.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "muptkoz",
                      "author": "swampcholla",
                      "body": "This is a shipping issue. It complicates logistics but does not render the problem unsolvable",
                      "score": -88,
                      "created_utc": 1748446779.0,
                      "replies": [
                        {
                          "id": "muq6fgb",
                          "author": "Dramatic_Explosion",
                          "body": "There are a number of solutions to the problem, with the easiest being wait 3 years for Trump to be out of office.",
                          "score": 71,
                          "created_utc": 1748450495.0,
                          "replies": [
                            {
                              "id": "muqeqgg",
                              "author": "swampcholla",
                              "body": "so you can get your phone cheaper?",
                              "score": -72,
                              "created_utc": 1748452948.0,
                              "replies": [
                                {
                                  "id": "muqqblw",
                                  "author": "Heisenberg_235",
                                  "body": "Your phone would be cheaper if Trump wasn’t in office yes",
                                  "score": 54,
                                  "created_utc": 1748456260.0,
                                  "replies": [
                                    {
                                      "id": "musqfss",
                                      "author": "swampcholla",
                                      "body": "Fucking hilarious.  So many downvotes and I'm sure the vast majority, if not all, have come from people who have never held a factory job and have not a clue of what this takes from the worker or the engineering perspective.  And they'd sell their neighbor just so some stupid little piece of technology doesn't cost them as much.  Meanwhile, they replace it 3x as often as needed, despite \"loving the environment\" and ever other piece of rubbish.\n\nThe phones are designed here.  Believe me, the people designing them have a pretty good idea of what ti takes to make them.  It goes hand in hand.",
                                      "score": -42,
                                      "created_utc": 1748478100.0,
                                      "replies": [
                                        {
                                          "id": "muuq6ya",
                                          "author": "Zanariyo",
                                          "body": "Would you be so kind as to remind us which American piss-baby had the bright idea to start a trade war with the entire world by introducing tariffs in everything in the year 2025?",
                                          "score": 5,
                                          "created_utc": 1748510351.0,
                                          "replies": [
                                            {
                                              "id": "muzqeoz",
                                              "author": "swampcholla",
                                              "body": "Which has nothing to do with the capability to build something",
                                              "score": 1,
                                              "created_utc": 1748568884.0,
                                              "replies": [
                                                {
                                                  "id": "muzrqvw",
                                                  "author": "Zanariyo",
                                                  "body": "... But everything to do with the current/upcoming price increases.",
                                                  "score": 3,
                                                  "created_utc": 1748569327.0,
                                                  "replies": [
                                                    {
                                                      "id": "muzryp4",
                                                      "author": "swampcholla",
                                                      "body": "And nothing to do with the topic, other than the use of offshoring and technology transfer",
                                                      "score": 1,
                                                      "created_utc": 1748569400.0,
                                                      "replies": [
                                                        {
                                                          "id": "muzshvb",
                                                          "author": "Zanariyo",
                                                          "body": "It has to do with your phone being more expensive while trump is in office, as the previous comment pointed out.",
                                                          "score": 2,
                                                          "created_utc": 1748569579.0,
                                                          "replies": [
                                                            {
                                                              "id": "mv3kq1s",
                                                              "author": "swampcholla",
                                                              "body": "the post was about making them here.  You have problems with reading comprehension.",
                                                              "score": 1,
                                                              "created_utc": 1748624513.0,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "muszvnn",
                                          "author": "brookme",
                                          "body": "Were designed here, until China stole the technology.",
                                          "score": 0,
                                          "created_utc": 1748481362.0,
                                          "replies": [
                                            {
                                              "id": "mut2ttw",
                                              "author": "swampcholla",
                                              "body": "Still designed here, but who knows for how long.  And still the dumbasses downvoting because they haven't a fucking clue continue.",
                                              "score": -1,
                                              "created_utc": 1748482366.0,
                                              "replies": [
                                                {
                                                  "id": "mux2xdw",
                                                  "author": "None",
                                                  "body": "[deleted]",
                                                  "score": 2,
                                                  "created_utc": 1748539573.0,
                                                  "replies": [
                                                    {
                                                      "id": "muzqvgo",
                                                      "author": "swampcholla",
                                                      "body": "Seriously?  This is nothing but regurgitated bullshit, by a reporter that likely knows less about the subject than you do. And your technical qualifications are what?",
                                                      "score": 0,
                                                      "created_utc": 1748569040.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "musehcs",
                          "author": "The_Quackening",
                          "body": "Calling it a \"shipping issue\" is like calling WW2 a \"disagreement\"\n\nTechnically possible does not mean it's realistically possible.",
                          "score": 15,
                          "created_utc": 1748474040.0,
                          "replies": [
                            {
                              "id": "musscwn",
                              "author": "swampcholla",
                              "body": "And you know this how?  Have you done assembly line work?  Been on the engineering side of building a factory?  I mean, other than hockey and gaming, just what is your specialty?",
                              "score": -4,
                              "created_utc": 1748478770.0,
                              "replies": [
                                {
                                  "id": "musv7z4",
                                  "author": "The_Quackening",
                                  "body": ">Have you done assembly line work? Been on the engineering side of building a factory?\n\nYes actually. I'm an electrical engineer.\n\nMostly done work in food packaging plants.",
                                  "score": 15,
                                  "created_utc": 1748479771.0,
                                  "replies": [
                                    {
                                      "id": "mut3xt8",
                                      "author": "swampcholla",
                                      "body": "And I've done aerospace production.  It's certainly capable of being done outside of China.  You know it.  It's largely robotic.  Its a matter of putting together cells.  Automobile plants manage to do it - bring materials and parts in from all over the world and assemble them locally.  If Canada didn't have local content laws, there would be almost zero manufacturing done there.  Same with Europe.",
                                      "score": -3,
                                      "created_utc": 1748482734.0,
                                      "replies": [
                                        {
                                          "id": "mutsdf5",
                                          "author": "jacksteveno1",
                                          "body": "Sure auto plants do but the majority of American cars don’t really stack up to foreign ones so idk if this is a great example of American manufacturing",
                                          "score": 6,
                                          "created_utc": 1748491946.0,
                                          "replies": [
                                            {
                                              "id": "muu32i2",
                                              "author": "swampcholla",
                                              "body": "Really?  And that statement comes from what experience?  \n\nIve owned Toyotas, Honda, Volkswagens, Chevy, GMC, Nissan, Mitsubishi, Jeep, and a Lexus. \n\nThe biggest pieces of shit in that list were the Nissan and the Mitsubishi. The Honda was the most underpowered.  Every one of those not currently in my fleet delivered at least 250,000 mi except the Nissan (blown engine at 170,000) and the Mitsu (constant stuff breaking at 80,000 mi). \n\nThe Honda, Chevy, GMC, and Volkswagons were all made in the USA.",
                                              "score": 1,
                                              "created_utc": 1748497110.0,
                                              "replies": []
                                            }
                                          ]
                                        },
                                        {
                                          "id": "muu7ysd",
                                          "author": "ten-million",
                                          "body": "And what about finding the labor to do all this new manufacturing? Are we not trying to deport a lot of our construction and agricultural labor? \n\nAnd these phones are going to be more expensive than ones made elsewhere. Not even counting production costs there are the tariffs on US made products. Why would anyone buy the US made phone if you don’t live in the US?\n\nNo one seriously thinks tariffs are a good idea. Trump just likes them because he can strut around like a big man. He’s too stupid to know how stupid he is. His supports will parrot any dumb idea that comes out of Trumps mouth. God forbid Trump ever gets told no. He’ll throw a tantrum! That whole crowd is a bunch of ethically, morally, and intellectually, weak babies.",
                                          "score": 6,
                                          "created_utc": 1748499751.0,
                                          "replies": [
                                            {
                                              "id": "muw3y63",
                                              "author": "swampcholla",
                                              "body": "Tariffs have their place in well thought out industrial policy. Not that the asshats in the Trump Administration have a clue about what good industrial policy is. The Chinese have a pretty good handle on it, but so far all they’ve done with it is produce domestic market bubbles and disrupt international relations. \n\nAs far as labor goes, it’s neither rocket science nor is it outdoor work.",
                                              "score": 1,
                                              "created_utc": 1748529785.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "musdxxn",
                          "author": "Dashing_McHandsome",
                          "body": "Shipping to where exactly? If you're thinking Apple would have some kind of factory in the US assembling parts shipped from China that doesn't solve anything. Those parts would still be subject to tariffs.",
                          "score": 10,
                          "created_utc": 1748473864.0,
                          "replies": [
                            {
                              "id": "musr3v8",
                              "author": "swampcholla",
                              "body": "Not every fucking thing in this world is made in China.  And whether or not the parts would still be subject to the same levels of tariff is not settled.  Look at the changes with respect to the multi-national US/Mexico/Canada auto parts.  Different from when it started.",
                              "score": -5,
                              "created_utc": 1748478332.0,
                              "replies": [
                                {
                                  "id": "musws5p",
                                  "author": "Dashing_McHandsome",
                                  "body": "Well, you sound like you have it all figured out. Maybe Apple could hire you as a consultant and you could advise them on how to move their supply chain to the United States.",
                                  "score": 12,
                                  "created_utc": 1748480304.0,
                                  "replies": [
                                    {
                                      "id": "mut3a98",
                                      "author": "swampcholla",
                                      "body": "The rest of the world manages to make stuff with components sourced multi-nationally, and I doubt the iPhone is 100% Chinese.\n\nIts all a matter of incentives.  When Apple started producing in China, the manufacturing infrastructure was barely there.  the incentive (to the CEO responding to the shareholders) was to do whatever it takes to reduce costs.",
                                      "score": -4,
                                      "created_utc": 1748482518.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mupqks5",
              "author": "None",
              "body": "[deleted]",
              "score": 56,
              "created_utc": 1748445935.0,
              "replies": [
                {
                  "id": "mups9o8",
                  "author": "Lunar_Landing_Hoax",
                  "body": "Dang it's cheaper even with the tariffs? Or is it because the materials the factory needs incurs tariffs?",
                  "score": 18,
                  "created_utc": 1748446413.0,
                  "replies": [
                    {
                      "id": "museumn",
                      "author": "The_Quackening",
                      "body": "They don't have to pay tariffs to sell outside of the USA if the factory is in india",
                      "score": 19,
                      "created_utc": 1748474163.0,
                      "replies": []
                    },
                    {
                      "id": "mur1wd5",
                      "author": "know-your-onions",
                      "body": "I’m not the person you’re replying to, but the point will be that they could afford to build a factory in the US and employ people in the US. It was always going to be more expensive than manufacturing in India, but aligned better with their goals. Maybe they could make better quality products close to home, or innovate more. Maybe they liked the idea of creating jobs for Americans, and/or maybe they figured they can charge more for a product made in America.\n\nThere could be any number of reasons, but now that Trump has fucked everybody’s shit up they can no longer afford to do it. They didn’t want to take the cheap option, but have essentially been forced to do so. And whatever positives were going to come from that, will no longer occur. It’s probably good for India though.",
                      "score": 10,
                      "created_utc": 1748459568.0,
                      "replies": []
                    },
                    {
                      "id": "mv5gclx",
                      "author": "gargravarr2112",
                      "body": "Risk is a big driver in corporate decisions. With the orange man flip-flopping on tariffs like a metronome, businesses cannot plan even a week ahead. Who's going to take the risk on investing all this money building stuff in America when it could wind up costing millions for no reason? That's a huge figure that no business wants to spend. Just exploit cheap labour internationally and deal with the US as an exception.",
                      "score": 1,
                      "created_utc": 1748644644.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "muuuzqv",
                  "author": "PropaneSalesTx",
                  "body": "So whats the locals thought on this? Clearly it wasnt Biden…",
                  "score": 1,
                  "created_utc": 1748513056.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "muqtr6z",
              "author": "sharpshooter999",
              "body": "You're telling me that Omaha NE is bigger than the largest cities in Mississippi? I guess I always assumed that the cities got bigger the further east you went",
              "score": 3,
              "created_utc": 1748457241.0,
              "replies": [
                {
                  "id": "mur0j5v",
                  "author": "azhillbilly",
                  "body": "Charleston WV is the capital of WV and has a population of 47k people. The entire state only has 1.7 million and dropping. \n\nWhen the state is the bottom of the barrel in terms of income people do everything they can to leave and nobody wants to move there.",
                  "score": 13,
                  "created_utc": 1748459178.0,
                  "replies": []
                },
                {
                  "id": "murpk7r",
                  "author": "dunno0019",
                  "body": "Jeebus, no. \n\nI think you are forgetting about states like Vermont and Maine. \n\nThe city of Montreal in Canada has a bigger population than both those states combined.",
                  "score": 4,
                  "created_utc": 1748466231.0,
                  "replies": []
                },
                {
                  "id": "mur8829",
                  "author": "Lunar_Landing_Hoax",
                  "body": "You may be right as a general trend but MS has been losing population from out migration. There just aren't enough good jobs there. ",
                  "score": 3,
                  "created_utc": 1748461368.0,
                  "replies": [
                    {
                      "id": "muuv93x",
                      "author": "PropaneSalesTx",
                      "body": "Hard to have good jobs when the education is dog shit.",
                      "score": 3,
                      "created_utc": 1748513196.0,
                      "replies": []
                    },
                    {
                      "id": "mv91xfp",
                      "author": "PeanutVendor",
                      "body": "I work with electronics manufacturing facilities in Mississippi. It’s a vicious cycle: they can’t attract business because they don’t have the staff to support it. They can’t attract staff because they pay like shit. And they can’t improve pay because they don’t have the business revenue to afford it…",
                      "score": 3,
                      "created_utc": 1748702234.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "musx7wg",
              "author": "None",
              "body": "[deleted]",
              "score": 8,
              "created_utc": 1748480453.0,
              "replies": [
                {
                  "id": "muuvbd3",
                  "author": "PropaneSalesTx",
                  "body": "The only thing would be port/river access for export.",
                  "score": 3,
                  "created_utc": 1748513229.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "musgzj7",
              "author": "VarusAlmighty",
              "body": "How did that production get there in the first place and how to we go about building that here?",
              "score": 2,
              "created_utc": 1748474873.0,
              "replies": [
                {
                  "id": "mush97r",
                  "author": "Lunar_Landing_Hoax",
                  "body": "It's like anything else, it would take resources. ",
                  "score": 2,
                  "created_utc": 1748474964.0,
                  "replies": []
                },
                {
                  "id": "mv0c3ds",
                  "author": "Ellyemem",
                  "body": "You’d start by repairing a stable civil service that can maintain a level of policy consistency for decades beyond any one administration because in turbo mode it’s going to be a 15 year push.\n\nIt’s also not going to be short term, line-goes-up American capital profitable to build, so private equity and companies won’t help pony up to build it (hence offshoring). So you’d need to vote for taxation so that the government can fund it, although if we can hold focus we could also then have some of the profits go back into government coffers to defray future taxes — if we don’t let some administration give it away for pennies once the hard part of building it is done.\n\nYou’ll also need an incredibly technical and well trained workforce that would require a further investment in education — not just more money but in targeting that spending toward schools that adopt useful curricula. On the upside, could save some money by getting rid of pointless elementary school standardized testing mandates that have done effectively nothing to improve education despite trying them in different forms for 30+ years.\n\nIn a nutshell, that’s what China did for over 40 years while starve the beast conservatives and their expensive military adventures abroad have bankrupted the government and they were asleep at the wheel with respect to China’s focused internal investments and growth.\n\nWe could begin to catch up no problem, but not if we lose our minds every couple of elections and let in some maniacs who want to rip it all down fast. There’s absurd private wealth here already, so if the rich were going to invest in modernizing the US they’d have done it decades ago.",
                  "score": 2,
                  "created_utc": 1748576880.0,
                  "replies": []
                },
                {
                  "id": "mv4m8in",
                  "author": "PancAshAsh",
                  "body": "Start with an enormous, poorly educated population you can justify paying <$5/day, and educate them to the bare minimum level needed to assemble electronic components. Also, have absolutely no environmental or labor laws so the workforce is being literally worked to death for extremely low wages in unsafe and dirty conditions.\n\nOr, you can do what the US did in the 1940s and 1950s and just take advantage of the fact that a world war just destroyed most of the rest of the world's factories.",
                  "score": 1,
                  "created_utc": 1748635308.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mv0ps14",
              "author": "R3dditN0ob",
              "body": "100% employment rate for that MS city here we go!",
              "score": 1,
              "created_utc": 1748583290.0,
              "replies": []
            },
            {
              "id": "mutpry9",
              "author": "None",
              "body": "Thats why china is the number 1 economy and the usa is debted to them all that money stays in china",
              "score": 1,
              "created_utc": 1748490818.0,
              "replies": [
                {
                  "id": "muzc3f5",
                  "author": "AnswersWithCool",
                  "body": "Countries are not individuals, US debt held by China is China investing in the U.S. because it’s such a stable place to park your money with good stable return on those bonds.",
                  "score": 1,
                  "created_utc": 1748563933.0,
                  "replies": [
                    {
                      "id": "mv0avz0",
                      "author": "None",
                      "body": "Who the fk are you",
                      "score": -3,
                      "created_utc": 1748576380.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mus70ih",
              "author": "Kindly_Education_517",
              "body": "them employees in Zhengzhou aint demanding $30 per hour wages free healthcare & insurance with 3 months PTO and paid holidays like Americans",
              "score": -4,
              "created_utc": 1748471604.0,
              "replies": [
                {
                  "id": "musaj51",
                  "author": "Lunar_Landing_Hoax",
                  "body": "No one in the US is getting 3 months PTO. ",
                  "score": 6,
                  "created_utc": 1748472744.0,
                  "replies": []
                },
                {
                  "id": "muum7u8",
                  "author": "Okay_Ocean_Flower",
                  "body": "You are mad about $60k a year lmao",
                  "score": 2,
                  "created_utc": 1748508017.0,
                  "replies": []
                },
                {
                  "id": "mv4n3hp",
                  "author": "PancAshAsh",
                  "body": "Well for one thing US workers don't get \"free healthcare\" we get the opportunity to deduct some of our pay to pay for health insurance that may or may not be subsidized by our employers, depending on the employer. 3 months of PTO is also pretty much unheard of.",
                  "score": 1,
                  "created_utc": 1748635568.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "muqgrpz",
              "author": "Responsible_Rip1058",
              "body": "Why does it need to be quick or easy?",
              "score": -3,
              "created_utc": 1748453544.0,
              "replies": [
                {
                  "id": "mur8yi3",
                  "author": "Lunar_Landing_Hoax",
                  "body": "Because Apple isn't a nationalized company and shareholders won't tolerate several quarters of lost revenue while ramping up whole new industries in the US.\n\n\nI mean if you want to get rid of our neoliberal world order and start nationalizing industries that's definitely a conversation I'm happy to have, as a democratic socialist. But I'm not holding my breath for this in the current arrangement of our economy.",
                  "score": 17,
                  "created_utc": 1748461575.0,
                  "replies": []
                },
                {
                  "id": "mus8uk9",
                  "author": "StpdSxyFlndrs",
                  "body": "Yeah, it doesn’t matter that we’ve burned all bridges with literally every trade partner we’ve ever had. We can just bootstrap all the factories and materials into existence the way god intended. No need to waste years planning/building facilities, or figuring out sources for needed raw materials. I’m guessing it can be done in about two weeks with the power of thoughts and prayers. Besides, I heard they already have the concept of a plan, so we’re good.",
                  "score": 8,
                  "created_utc": 1748472200.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mupt9j4",
              "author": "swampcholla",
              "body": "But thats making products for the entire world, not just one region",
              "score": -17,
              "created_utc": 1748446692.0,
              "replies": [
                {
                  "id": "murw6vz",
                  "author": "ONLY_SAYS_ONLY",
                  "body": "Alexa, what are “economies of scale”?",
                  "score": 5,
                  "created_utc": 1748468195.0,
                  "replies": [
                    {
                      "id": "musqr8h",
                      "author": "swampcholla",
                      "body": "And past a certain point the marginal cost of one place, two, or three is insignificant.  Also, Alexa, what is \"supply chain disruption\".  Like, say, the Japanese Tsunami, etc.\n\nOtherwise known as \"don't put all your eggs in one basket\".",
                      "score": 0,
                      "created_utc": 1748478208.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "muqn8so",
          "author": "fire2day",
          "body": "Back when Foxconn was in the news for having a lot of suicides all around the same time, their suicide rate was lower than that of China, or the USA. It seemed like a lot for one company, but it was just because their workforce was so large. Back then, they had ~93,000 employees.",
          "score": 20,
          "created_utc": 1748455387.0,
          "replies": [
            {
              "id": "mutj3so",
              "author": "Jess_S13",
              "body": "They got the visibility due to the association with Apple, \"Factory that builds electric panels for EATON\" doesn't have the same impact as most people don't associate that brand with their daily lives.",
              "score": 1,
              "created_utc": 1748488115.0,
              "replies": []
            }
          ]
        },
        {
          "id": "muqsadc",
          "author": "classicnikk",
          "body": "Holy crap you’re not kidding. Just looked up one of the factories. They are GINORMOUS!!!",
          "score": 6,
          "created_utc": 1748456820.0,
          "replies": []
        },
        {
          "id": "muybbx2",
          "author": "jvin248",
          "body": "Automotive Vehicles are much more complex than a simple phone, there are three or four phones in a modern vehicle. There are 3,000 employees at a typical assembly factory. Suppliers ship in parts from all points of the nation and internationally. \n\n(that Foxxcon \"200k employees\" number build all the laptops and tablets too, it's not just phones).\n\nApple first sets up a phone assembly plant in the US. Then they set up circuit board and cpu facilities. Several universities are actively creating chip factories to meet the current and future needs). They bring new/relocated parts for everything else to the US. Many aspects of sub-component parts are automated already. It's not a labor thing.\n\nThe only reason Apple says \"it's too hard\" is because they support the opposing political party. They say it \"costs too much\" and your next phone will be twice as much because they support the opposing politicians. That is the whole issue. They spend lobby money getting the other politicians elected. \n\n.",
          "score": -2,
          "created_utc": 1748552186.0,
          "replies": [
            {
              "id": "muzsi2m",
              "author": "wysiwywg",
              "body": "!remindme in 1 year\n\nDude, you’re thinking it very lightly. \n\nLet’s just start with the basics: minerals and natural resources for the production of chips/components. Even if Apple has the wishful thinking of what you describe, they would STILL need massive amounts of natural resources to get it done. \n\nSecond, it’s an entire ecosystem that produces the components and if you ever looked inside a phone, they have different parts from around the world.\n\nGood luck and as I said, see you next year!",
              "score": 3,
              "created_utc": 1748569581.0,
              "replies": []
            },
            {
              "id": "mv14m19",
              "author": "buffalosabresnbills",
              "body": "> Several universities are actively creating chip factories to meet the current and future needs).\n\nDo you even believe what you write?",
              "score": 3,
              "created_utc": 1748591616.0,
              "replies": []
            }
          ]
        },
        {
          "id": "musqy7l",
          "author": "QuadraticCowboy",
          "body": "Duh, that’s how large scale manufacturing works.  \n\nThis article is shit and a sorry excuse to a sorry excuse of “Apple can’t make phones without third world underpaid labor” lmao what a joke.  ",
          "score": -5,
          "created_utc": 1748478276.0,
          "replies": [
            {
              "id": "muss3r4",
              "author": "SkyriderRJM",
              "body": "Yeah, no.  You don’t understand the scale.",
              "score": 2,
              "created_utc": 1748478681.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mutpu3e",
          "author": "None",
          "body": "And they get paid pennies on the dollar",
          "score": -4,
          "created_utc": 1748490844.0,
          "replies": [
            {
              "id": "muu452u",
              "author": "culturedgoat",
              "body": "That’s not how you use that phrase. “Pennies on the dollars” refers to a low (monetary) percentage of a larger established value.",
              "score": 2,
              "created_utc": 1748497676.0,
              "replies": [
                {
                  "id": "muv5qbv",
                  "author": "None",
                  "body": "Your stupid lol",
                  "score": -4,
                  "created_utc": 1748518212.0,
                  "replies": [
                    {
                      "id": "muvezhi",
                      "author": "culturedgoat",
                      "body": "no u",
                      "score": 2,
                      "created_utc": 1748521859.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "muor56p",
      "author": "iateyourdinner",
      "body": "You don’t need to read to article to know the answer: Because it’s cheaper to make elsewhere.",
      "score": 416,
      "created_utc": 1748434848.0,
      "replies": [
        {
          "id": "muqk4sh",
          "author": "CeramicDrip",
          "body": "Yes, but also why would they make it in America? Like not every product has to be made in America. The only things that actually need to be made domestically are things that we would need during wartime. When times are peaceful, you could always trade for these things. When in war, you won’t care about your iphone.",
          "score": 49,
          "created_utc": 1748454524.0,
          "replies": [
            {
              "id": "murs3l5",
              "author": "dunno0019",
              "body": "Because the orange buffoon started a trade *war*.",
              "score": 34,
              "created_utc": 1748466970.0,
              "replies": []
            },
            {
              "id": "muu7k99",
              "author": "JuventAussie",
              "body": "Not only that, to make iPhones cost effectively you need to have the same low environmental standards to mine and process the raw material to make the components.\n\nHave you seen the rivers in India and China around their chemical plants?",
              "score": 7,
              "created_utc": 1748499523.0,
              "replies": [
                {
                  "id": "muv4928",
                  "author": "mmmmmarty",
                  "body": "The raw materials here would never get past the 404 submittal",
                  "score": 1,
                  "created_utc": 1748517573.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mv479xr",
              "author": "tooltalk01",
              "body": "Apple iPhone it the single largest import from China, or valued at about $41+B last year.  \n\nNot everything has to be made in the US, but we should try to onshore production of high-value, high-tech goods.",
              "score": 1,
              "created_utc": 1748630863.0,
              "replies": []
            },
            {
              "id": "muruezv",
              "author": "Even_Reception8876",
              "body": "Because things used to be made in America and because of that we could afford to live. Now we outsource cheap labor and items are cheaper so they lower our wages but things that are made domestically like houses didn’t decrease because the labor and materials are from the US so people are rightfully upset that we fucked our entire system. I don’t think bringing iPhones back will fix anything but we absolutely fucked ourselves",
              "score": -9,
              "created_utc": 1748467657.0,
              "replies": [
                {
                  "id": "mus32s5",
                  "author": "PhillAholic",
                  "body": "The real problem is the cost of land and wages not keeping up with inflation. The rich just keep taking more and more. ",
                  "score": 7,
                  "created_utc": 1748470328.0,
                  "replies": [
                    {
                      "id": "mutymok",
                      "author": "xlink17",
                      "body": "Wages have kept up with inflation and have in fact increased more than inflation. Why does everyone on reddit believe this despite it being such an easy thing to look up?",
                      "score": -4,
                      "created_utc": 1748494868.0,
                      "replies": [
                        {
                          "id": "muxcsk5",
                          "author": "Snipedzoi",
                          "body": "Median has increased not minimum",
                          "score": 4,
                          "created_utc": 1748542292.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "muoyc8j",
          "author": "mrGeaRbOx",
          "body": "Because exploitation is more profitable than fair wages. The system requires desparate people willing to take less and less",
          "score": -88,
          "created_utc": 1748437403.0,
          "replies": [
            {
              "id": "mup2yai",
              "author": "Nielsly",
              "body": "Not only exploitation, Chinese wages are quite high nowadays compared to other countries in the region. The main thing nowadays is that the supply chain is already there, moving the entire supply chain would be extremely expensive and not moving it and only moving final product assembly would involve transport of dozens of individual parts and managing the supply rates, rather than just one completed device",
              "score": 102,
              "created_utc": 1748438943.0,
              "replies": [
                {
                  "id": "mupglck",
                  "author": "smurb15",
                  "body": "I remember seeing it in the 90s. Everywhere was getting moved across seas or down south which we were told it makes it cheaper. They fell for it, that's for sure",
                  "score": 16,
                  "created_utc": 1748443100.0,
                  "replies": []
                },
                {
                  "id": "mupvd43",
                  "author": "SpaceGoonie",
                  "body": "This is the crux... Yes, China has the supply chain. The reason goes back to times past when Chinese labor was extremely cheap. In other words, Apple created the conditions that exist and that it now uses as an excuse to avoid making phones where labor is more costly.",
                  "score": 1,
                  "created_utc": 1748447280.0,
                  "replies": [
                    {
                      "id": "muqbmk1",
                      "author": "Nielsly",
                      "body": "Part of the supply chain was always in China, and has only gotten more advanced. Moving it currently does not only involve labor costs for each step in the chain, but also the economy of scale in the supply chain, every brand produces in China or adjacent countries, bringing the supply to the US would involve massive investments for a less efficiënt system, also increasing costs",
                      "score": 6,
                      "created_utc": 1748452028.0,
                      "replies": []
                    },
                    {
                      "id": "mur2fil",
                      "author": "InclinationCompass",
                      "body": "The CCP went all-in on making China the top manufacturer in the world for decades. It was their plan to dominate the world in manufacturing. There are literally cities with nothing but factories in China. Combine that with lower human rights standards, and there’s no way the US can compete.",
                      "score": 5,
                      "created_utc": 1748459719.0,
                      "replies": [
                        {
                          "id": "murp38b",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 0,
                          "created_utc": 1748466097.0,
                          "replies": [
                            {
                              "id": "murucqx",
                              "author": "InclinationCompass",
                              "body": "And that’s the problem with unchecked capitalism",
                              "score": 1,
                              "created_utc": 1748467639.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "musr6x8",
                      "author": "QuadraticCowboy",
                      "body": "Exactly.  But why are you on reddit?  Reddit doesn’t want the truth, only repackaged rage bait",
                      "score": 1,
                      "created_utc": 1748478362.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mup2zsn",
              "author": "sofixa11",
              "body": "Paying less for the same labour to people whose labour costs less because their cost of living is lower isn't exploitation. If the employees are fairly compensated for their work, for their desired standard of living where they live, that's fine.\n\n(The anti-suicide nets aren't though)",
              "score": 36,
              "created_utc": 1748438956.0,
              "replies": [
                {
                  "id": "murfhnx",
                  "author": "Imaginary-Worker4407",
                  "body": "This, people always tell me that it's is unfair that I'm not being paid the same as my American peers (I work remote from a cheaper country).\n\n\nBut I don't agree, I'm being paid very well for my situation, I can even afford a lifestyle than my American peers can't.\n\n\nBtw, the US would benefit from applying anti-suicide measures.",
                  "score": 3,
                  "created_utc": 1748463425.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "muqd3cy",
              "author": "AmNoSuperSand52",
              "body": "Ironically, China has perfected capitalism",
              "score": 4,
              "created_utc": 1748452462.0,
              "replies": [
                {
                  "id": "museote",
                  "author": "aaffpp",
                  "body": "And America has perfected, corrupt Corporate Communism.",
                  "score": 1,
                  "created_utc": 1748474110.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "musec1i",
              "author": "aaffpp",
              "body": "Not 'the system', it's Consumers that dictate this.",
              "score": 0,
              "created_utc": 1748473991.0,
              "replies": []
            },
            {
              "id": "mup1p72",
              "author": "Aaron_Hamm",
              "body": "He said from a phone lol",
              "score": -44,
              "created_utc": 1748438531.0,
              "replies": [
                {
                  "id": "mup2pcx",
                  "author": "shodan5000",
                  "body": "And? ",
                  "score": 13,
                  "created_utc": 1748438863.0,
                  "replies": [
                    {
                      "id": "musoctu",
                      "author": "David-Puddy",
                      "body": "But do you not participate in society? \n\n\n Got em!!!!",
                      "score": 1,
                      "created_utc": 1748477384.0,
                      "replies": []
                    },
                    {
                      "id": "mup48cq",
                      "author": "Aaron_Hamm",
                      "body": "If you were willing to pay enough for a phone to pay the kids making them fair wages, someone would meet that demand. \n\nYou (we all) care more about paying the least possible than we do making sure anyone gets their fair share",
                      "score": -29,
                      "created_utc": 1748439359.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mut4kn9",
          "author": "Klaumbaz",
          "body": "Apple has spent $55billion per year for 20 years improving China's MFG capabilities. They outspent USA State Department in worldwide efforts.",
          "score": -4,
          "created_utc": 1748482945.0,
          "replies": []
        }
      ]
    },
    {
      "id": "muomcmt",
      "author": "Marlowe_Eldridge",
      "body": "Because an iPhone would cost $3,000 if made in America.",
      "score": 301,
      "created_utc": 1748432991.0,
      "replies": [
        {
          "id": "muomvmy",
          "author": "a_Ninja_b0y",
          "body": "3500 Dollars as estimated by an analyst\n\n\nSource :- https://www.cnn.com/2025/04/09/tech/apple-iphones-cost-tariffs-impact-intl-hnk",
          "score": 198,
          "created_utc": 1748433198.0,
          "replies": [
            {
              "id": "mupymo3",
              "author": "Ok-Midnight1594",
              "body": "The dumb part is people will still buy them.",
              "score": 8,
              "created_utc": 1748448204.0,
              "replies": [
                {
                  "id": "mupza4o",
                  "author": "trixtah",
                  "body": "Some people sure but this would completely tank sales considering the alternatives would not be getting the same price hike",
                  "score": 32,
                  "created_utc": 1748448392.0,
                  "replies": []
                },
                {
                  "id": "mw4iho2",
                  "author": "i_am_really_b0red",
                  "body": "*Some people \n\nTheir sales would plummet to like fractions of percentages compared to currently",
                  "score": 1,
                  "created_utc": 1749127155.0,
                  "replies": [
                    {
                      "id": "mwijmcn",
                      "author": "Ok-Midnight1594",
                      "body": "As long as credit exists people will continue to overpay for things they don’t need.",
                      "score": 1,
                      "created_utc": 1749314878.0,
                      "replies": [
                        {
                          "id": "mwkvnjq",
                          "author": "i_am_really_b0red",
                          "body": "Yeah but 3k is not a small amount, Most normal people with a mentally sound brain will shift away from iPhone",
                          "score": 1,
                          "created_utc": 1749343223.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "muq0t06",
                  "author": "Prize_Instance_1416",
                  "body": "They’re still the best phone /portable computer. Yes some crap android things do certain things well, but they’re never as complete as an iPhone imho",
                  "score": -29,
                  "created_utc": 1748448832.0,
                  "replies": [
                    {
                      "id": "mur1zyq",
                      "author": "azhillbilly",
                      "body": "What exactly does iPhone do better than other phones?",
                      "score": 8,
                      "created_utc": 1748459596.0,
                      "replies": [
                        {
                          "id": "murs2wk",
                          "author": "Prize_Instance_1416",
                          "body": "Why, flex of course. Not Rolex flex but cell flex for sure",
                          "score": -15,
                          "created_utc": 1748466964.0,
                          "replies": [
                            {
                              "id": "mussbad",
                              "author": "Itsme340",
                              "body": "Uh, ok",
                              "score": 4,
                              "created_utc": 1748478754.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mv48pfx",
              "author": "tooltalk01",
              "body": "Apple's cost to import an iPhone wholesale from Foxconn, China is only about $200 which then retails for $1,000.  That's about a 80% gross margin.  \n\nI think a 50% increase in cost is realistic in the US; or $350.  This can still be be sold for $1,000 retail, but of course, Apple needs that 80% profit margin!",
              "score": 2,
              "created_utc": 1748631281.0,
              "replies": []
            }
          ]
        },
        {
          "id": "muor450",
          "author": "hangender",
          "body": "7000$ if we go by California labor laws and taxes.\n\n3000$ if we go by Louisiana probably",
          "score": 86,
          "created_utc": 1748434837.0,
          "replies": [
            {
              "id": "muovggb",
              "author": "KP_Wrath",
              "body": "Might be able to get $2800 if you do the shitty parts of Mississippi.",
              "score": 41,
              "created_utc": 1748436412.0,
              "replies": [
                {
                  "id": "muozhzo",
                  "author": "Lunar_Landing_Hoax",
                  "body": "There isn't a base of labor in shitty parts of MS. Smart, hard working people leave and go to where the jobs are. ",
                  "score": 26,
                  "created_utc": 1748437796.0,
                  "replies": [
                    {
                      "id": "mup1sxj",
                      "author": "showyourdata",
                      "body": "where the right kind of jobs are.",
                      "score": 5,
                      "created_utc": 1748438566.0,
                      "replies": [
                        {
                          "id": "mup2rx9",
                          "author": "Lunar_Landing_Hoax",
                          "body": "Even if the smart hard-working people stayed around, I don't think Mississippi even has a big enough population to support this manufacturing. I just googled it and the main Foxconn factory employs 200K. The biggest city in MS has a population of 150K. ",
                          "score": 8,
                          "created_utc": 1748438886.0,
                          "replies": [
                            {
                              "id": "mupaaus",
                              "author": "Tupperwarfare",
                              "body": "Then we need to start busing 50k people into the town, starting very soon!",
                              "score": 6,
                              "created_utc": 1748441259.0,
                              "replies": []
                            },
                            {
                              "id": "muq043x",
                              "author": "snowflake37wao",
                              "body": "jobs? Jobs is dead, get over it. If Apple decides to bring the manufacturing home it means theyve already manufactured the robots to do the jobs it takes a Mississippi city and a quarter of people to do. There wont be no jobs but there might be monthly stipends from Apple because of all the money they saved not paying people to do the jobs the robot line is doing for the host city. Who knows, I hear New Mexico residents are getting $750 a month all because of a tax surplus since they legalized weed or something this week.",
                              "score": -2,
                              "created_utc": 1748448633.0,
                              "replies": [
                                {
                                  "id": "mur2q0k",
                                  "author": "azhillbilly",
                                  "body": "One time 500 dollar rebate for under 24k a year. Not per month.",
                                  "score": 3,
                                  "created_utc": 1748459803.0,
                                  "replies": [
                                    {
                                      "id": "murxh41",
                                      "author": "snowflake37wao",
                                      "body": "https://www.reddit.com/r/politics/s/wuGEAbYhZN\n\nhttps://www.businessinsider.com/albuquerque-new-mexico-basic-income-marijuana-tax-2025-5",
                                      "score": 1,
                                      "created_utc": 1748468582.0,
                                      "replies": [
                                        {
                                          "id": "mus3k7s",
                                          "author": "PhillAholic",
                                          "body": "> The program is providing the $750 monthly payments to 80 families\n\nThat’s very small",
                                          "score": 2,
                                          "created_utc": 1748470483.0,
                                          "replies": []
                                        },
                                        {
                                          "id": "muse0l6",
                                          "author": "azhillbilly",
                                          "body": "Oh that pilot program. Yeah it’s short term testing like some other states have tried but it’s never been expanded before, would be nice though.",
                                          "score": 1,
                                          "created_utc": 1748473888.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "muptvhn",
                      "author": "swampcholla",
                      "body": "You don’t need to be smart to work an assembly line. Thats the whole point",
                      "score": 1,
                      "created_utc": 1748446863.0,
                      "replies": [
                        {
                          "id": "muq0u20",
                          "author": "Lunar_Landing_Hoax",
                          "body": "You have to be sober and able to make it to a shift in time, and work for the whole shift. That takes a baseline. Getting people that will show up on time and sober is not always easy, that's why we don't have all the manufacturing jobs available today in the US filled. ",
                          "score": 1,
                          "created_utc": 1748448841.0,
                          "replies": [
                            {
                              "id": "muqfkiq",
                              "author": "swampcholla",
                              "body": "There's a small - very small - amount of truth to that.  However, working in a clean, quiet environment with a decent wage goes a long way to getting people to come to work.  And regardless of industry, any hiring manager will tell you THE biggest challenge is finding and retaining good people.",
                              "score": -1,
                              "created_utc": 1748453192.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "muoxlhl",
                  "author": "dubhd",
                  "body": "A Mississiphone",
                  "score": 8,
                  "created_utc": 1748437149.0,
                  "replies": [
                    {
                      "id": "muoyep9",
                      "author": "tomi_tomi",
                      "body": "Nope",
                      "score": 7,
                      "created_utc": 1748437426.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mupy1mo",
                  "author": "snowflake37wao",
                  "body": "Whats been going on in Kansas these days? Haven’t heard from them in awhile; still nothing but tornados, being flat, and somewhere around the middle of a country map? Perfect real estate. Except the tornados. If those get to be too much of a problem, and they will, how about Nebraska? Last I heard it was just as nothing going on and flat, except instead of tornados you just get freak blizzards out of nowhere while just driving thru. Should be around the middle of a US map too. Probably.",
                  "score": 2,
                  "created_utc": 1748448035.0,
                  "replies": []
                },
                {
                  "id": "murg2hp",
                  "author": "galagapilot",
                  "body": "come to Western PA. We still have wages from the 1980s in most of these small towns. \n\nWe'll get that thing built for under a grand.",
                  "score": 1,
                  "created_utc": 1748463589.0,
                  "replies": []
                },
                {
                  "id": "mv0xj88",
                  "author": "idvnno",
                  "body": "I doubt the average worker pool in Mississipi would be competent enough to put an iphone together.",
                  "score": 1,
                  "created_utc": 1748587516.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "muplsbd",
              "author": "darth_voidptr",
              "body": "I have blaming California for having labor laws. I also hate that it's ok for companies (almost all of them, not just Apple) use China because it doesn't have effective labor laws. \n\nThe regulation body is usually blamed for high costs, but consider that our completely inadequate supply of living space, combined with poor health care and school/day-care for children are substantial reasons why labor needs to demand high wages. China subsidizes a lot of that, and they're correct to do so. \n\nAny solution to bring manufacturing back to the US, that's serious and not just a gimmick, needs to address the fundamental issues in a way that doesn't set us back to 1500 AD.",
              "score": 5,
              "created_utc": 1748444578.0,
              "replies": [
                {
                  "id": "musfq01",
                  "author": "aaffpp",
                  "body": "Its simple solution really. America Consumers must pay the true cost of items. Why not 3,500.00 for an iPhone? This individual device has more computing power that NASA had in the 1960s and that the entire country during WWII",
                  "score": 2,
                  "created_utc": 1748474451.0,
                  "replies": [
                    {
                      "id": "mutl1a9",
                      "author": "Jess_S13",
                      "body": "The more likely option is people will just stop buying them. Look what's happened to new car purchases since prices got out of hand. So now we wont have the jobs, nor the products. New car purchases are down since 2008 crash and over 50% of new car purchases are made by people over 55. Things getting more expensive doesn't mean consumers will just get over it and pay more, they generally just stop all together.",
                      "score": 1,
                      "created_utc": 1748488868.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mupjggi",
              "author": "Atilim87",
              "body": "Which state allows child labor again?",
              "score": 1,
              "created_utc": 1748443913.0,
              "replies": [
                {
                  "id": "mupre0m",
                  "author": "zamzuki",
                  "body": "Iowa, Arkansas, Ohio, Wisconsin and New Jersey.  \n\nWith the national law being 14. \n\nIowa allows children to work factories like meat packing. \n\nArkansas, Ohio, Wisconsin is mostly agricultural work but they laxed the laws and you can work any place that’s “agricultural adjacent” \n\nNew Jersey is summer employment only and for agricultural work or tourism depending on the permit granted.",
                  "score": 7,
                  "created_utc": 1748446163.0,
                  "replies": [
                    {
                      "id": "muqavot",
                      "author": "Liam_Neesons_Oscar",
                      "body": "I'd love to see computer parts manufacturers figure out how to make their work \"agricultural adjacent.\" Maybe they'd build procs and boards for farm equipment and sell off the \"excess\" 85% to Apple.",
                      "score": 1,
                      "created_utc": 1748451805.0,
                      "replies": [
                        {
                          "id": "muqbxhl",
                          "author": "zamzuki",
                          "body": "If more laws pass like in Iowa it won’t have to be agricultural adjacent.",
                          "score": 1,
                          "created_utc": 1748452119.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mup6mja",
          "author": "Rupes100",
          "body": "That's just billionaires trying to scare the public so it doesn't impact their bottom line. \nThey could absolutely make them in the US, they could cost roughly the same but apple would only make a billion a quarter instead of 5 or whatever it is. \nThe profit margins would go down that's all and big Corps don't want that so they spin this nonsense. ",
          "score": -10,
          "created_utc": 1748440122.0,
          "replies": [
            {
              "id": "mupip9c",
              "author": "Hans0000",
              "body": "Companies care about profit margins? No way, who would've thought. \n\nThat's also the only way US big tech is advancing at such a fast pace, because they have so much cash to throw at R&D, otherwise if they tried to be \"fair\" they would stagnant like EU tech sectors.",
              "score": 1,
              "created_utc": 1748443698.0,
              "replies": []
            }
          ]
        },
        {
          "id": "muomqe1",
          "author": "Stargate_1",
          "body": "Nah they could just keep the prices as are and still make profit, but then tehy'd make LESS profit, so it's obviously not an option",
          "score": -81,
          "created_utc": 1748433142.0,
          "replies": [
            {
              "id": "muopuln",
              "author": "trickman01",
              "body": "I’m going to need to see your math since you are making this claim.",
              "score": 34,
              "created_utc": 1748434359.0,
              "replies": [
                {
                  "id": "muoqc7h",
                  "author": "Stargate_1",
                  "body": "It wasn't a very serious comment. I was just making a joke about the massive profit margin iPhones have since their tech isn't more expensive than that of any other manufacturer yet the prices are somehow significantly higher despite offering nothing justifying those prices.",
                  "score": -30,
                  "created_utc": 1748434545.0,
                  "replies": [
                    {
                      "id": "muor05k",
                      "author": "trickman01",
                      "body": "Their prices seem more or less in line with the other top selling phones like Galaxy or Pixel.",
                      "score": 21,
                      "created_utc": 1748434795.0,
                      "replies": []
                    },
                    {
                      "id": "muovek4",
                      "author": "MileHigh_FlyGuy",
                      "body": "Do you even have an idea of the profit margins on an iPhone?",
                      "score": 7,
                      "created_utc": 1748436393.0,
                      "replies": [
                        {
                          "id": "mv15tls",
                          "author": "buffalosabresnbills",
                          "body": "> Do you even have an idea of the profit margins on an iPhone?\n\nDoes your supposed figure include engineering, production,  and development costs, or just raw component cost?",
                          "score": 1,
                          "created_utc": 1748592319.0,
                          "replies": []
                        },
                        {
                          "id": "mup2qms",
                          "author": "sofixa11",
                          "body": "Apple's overall average profit margin is 25%. It's probably less on iPhone hardware specifically because they have the whole walled garden to get 30% off of, but still, it's probably a healthy margin.",
                          "score": -4,
                          "created_utc": 1748438874.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "muoy1i7",
                  "author": "mrGeaRbOx",
                  "body": "Weird how you didn't ask the original claimant. I guess having to back up claims with math is \"selective\" for you?",
                  "score": -15,
                  "created_utc": 1748437302.0,
                  "replies": [
                    {
                      "id": "muoyj6m",
                      "author": "trickman01",
                      "body": "Because somebody has already linked a source for that.  Weird how if you look at things in context it makes sense.\n\nhttps://old.reddit.com/r/gadgets/comments/1kxexgh/why_apple_doesnt_make_iphones_in_america_and/muomvmy/",
                      "score": 13,
                      "created_utc": 1748437469.0,
                      "replies": []
                    },
                    {
                      "id": "mupibse",
                      "author": "k1rage",
                      "body": "There's already been a source provided for that",
                      "score": 3,
                      "created_utc": 1748443593.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "muonuns",
              "author": "Gurtang",
              "body": "The definitely would increase prices. Not to the amount mentioned, but still increase. Why not ?",
              "score": 17,
              "created_utc": 1748433585.0,
              "replies": []
            },
            {
              "id": "muopim0",
              "author": "baumpop",
              "body": "https://law.bepress.com/cgi/viewcontent.cgi?referer=&httpsredir=1&article=2238&context=expresso#:~:text=Nonetheless%2C%20corporate%20law%20does%20not,goals%20apart%20from%20profit%2Dmaximization.",
              "score": 4,
              "created_utc": 1748434231.0,
              "replies": [
                {
                  "id": "muoq06n",
                  "author": "Stargate_1",
                  "body": "From your linked document:\n\nIn describing the duties of directors, U.S. corporations statutes typically refer to “the interests \r\nof the corporation.”7\r\n It is far from clear that the plain meaning of these words requires that the \r\ninterests of the corporation be understood as synonymous with the maximization of the \r\nshareholders’ profits from the venture.8\r\n \n\nFormatting might be fucked Injust copied the passage",
                  "score": -5,
                  "created_utc": 1748434418.0,
                  "replies": [
                    {
                      "id": "muorfhu",
                      "author": "baumpop",
                      "body": "There is no codified law to maximize shareholder profit. There’s a board of directors who basically makes their own little kingdom of laws that they put a lord into to manage. A lot of this hierarchy stuff is holdover from the damn renaissance European bullshit so heavily implied shit never made it into actual law. Just 800 years of gentlemen’s agreements and skull duggery ",
                      "score": -2,
                      "created_utc": 1748434953.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "muonhwm",
              "author": "Banndrell",
              "body": "I'm inclined to believe this.",
              "score": -8,
              "created_utc": 1748433444.0,
              "replies": []
            },
            {
              "id": "muoo6v0",
              "author": "None",
              "body": "[deleted]",
              "score": -2,
              "created_utc": 1748433717.0,
              "replies": [
                {
                  "id": "muoozds",
                  "author": "Stargate_1",
                  "body": "No, that's not accurate. Most publicly traded companies have this obligation. Not all.\n\nIf you're not publicly traded, this obligation does not exist, and even then it does not apply to every company",
                  "score": 0,
                  "created_utc": 1748434026.0,
                  "replies": [
                    {
                      "id": "muop5ws",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1748434095.0,
                      "replies": [
                        {
                          "id": "muopd6v",
                          "author": "Stargate_1",
                          "body": "It is indeed a given with Apple but again, publicly traded =/ obligation to increase profits.\n\nJust because you have shares for sale doesn't mean you promise neverending growth",
                          "score": 0,
                          "created_utc": 1748434174.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "muozleq",
      "author": "Bleakwind",
      "body": "According to Cook, man who build their supply chain.\nChina is attractive to them because of the number of skilled engineering for tooling and processes, which can fill stadiums while you’ve be hard pressed to find enough in the States to fill a room.",
      "score": 38,
      "created_utc": 1748437828.0,
      "replies": []
    },
    {
      "id": "muoqofp",
      "author": "Galwadan",
      "body": "And won't be made. It's easier to wait until the Trump presidency ends than to build a factory.",
      "score": 72,
      "created_utc": 1748434673.0,
      "replies": [
        {
          "id": "muoy5tt",
          "author": "igby1",
          "body": "Optimistic to think the convicted felon will leave office voluntarily in Jan 2029. Either he won’t leave or he’ll install some puppet like Putin did with Medvedev.",
          "score": -8,
          "created_utc": 1748437342.0,
          "replies": [
            {
              "id": "mup0p6x",
              "author": "SkyriderRJM",
              "body": "He’ll die of natural causes eventually.  No one lives forever.  At some point we will be living in a post-Trump US.",
              "score": 25,
              "created_utc": 1748438197.0,
              "replies": [
                {
                  "id": "mup1owu",
                  "author": "igby1",
                  "body": "That won’t matter if the corruption results in permanent R control",
                  "score": 8,
                  "created_utc": 1748438528.0,
                  "replies": [
                    {
                      "id": "mup266h",
                      "author": "SkyriderRJM",
                      "body": "That is a very valid problem, and why people need to stop focusing on just Trump.  He’s a symptom; not the cause.\n\nThe problem is this nation is utterly brainwashed by certain propaganda networks.  Until they are discredited and dismantled and we start operating on a basis of a shared set of facts, this shit ain’t getting better.",
                      "score": 17,
                      "created_utc": 1748438687.0,
                      "replies": [
                        {
                          "id": "mus3wcv",
                          "author": "PhillAholic",
                          "body": "It’s going to take the majority of them to suffer extreme hardships and majority of the majority to die off for that to go away. It’s a cult. ",
                          "score": 1,
                          "created_utc": 1748470591.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mup3gdr",
                  "author": "showyourdata",
                  "body": "except GOP momentum is to strong among the MAGA dictators lovers. It will transition to some GOP. We will never have a fair election in the country for at least 50 years.",
                  "score": -3,
                  "created_utc": 1748439107.0,
                  "replies": [
                    {
                      "id": "mupabfs",
                      "author": "SkyriderRJM",
                      "body": "Well that’s why people need to take part in their local elections.\n\nThat said, I have seen no evidence that MAGA will be able to coalesce behind a single leader once Trump is out of the picture.  It’s possible but it’s also not guaranteed.",
                      "score": 2,
                      "created_utc": 1748441264.0,
                      "replies": [
                        {
                          "id": "mur7y7t",
                          "author": "azhillbilly",
                          "body": "Yeah, I don’t see anyone following Vance if Trump does in office, he’s got the spine of a jellyfish and the mannerisms of a monkey.",
                          "score": 2,
                          "created_utc": 1748461290.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mus5o4p",
                      "author": "MagmaSeraph",
                      "body": "Not if we just lay down and take it, anyway.",
                      "score": 1,
                      "created_utc": 1748471164.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mus1m87",
                  "author": "RussianDisifnomation",
                  "body": "Until they install the trump ynasty",
                  "score": 0,
                  "created_utc": 1748469863.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "musi4m3",
              "author": "aaffpp",
              "body": "Vance = Medvedev Vance is a real nobody who kissed his way to the top..",
              "score": 0,
              "created_utc": 1748475255.0,
              "replies": []
            },
            {
              "id": "mur2028",
              "author": "TheMaskedGorditto",
              "body": "Absolutely, positively, rent free.",
              "score": -3,
              "created_utc": 1748459596.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "muomltw",
      "author": "None",
      "body": "[deleted]",
      "score": 64,
      "created_utc": 1748433092.0,
      "replies": [
        {
          "id": "muoot42",
          "author": "Iceman9161",
          "body": "Uneducated voters don’t care about design/engineering jobs because they can’t get them. They also don’t really want to work in a factory but the brainwash has convinced them it’s a good job.",
          "score": 59,
          "created_utc": 1748433957.0,
          "replies": [
            {
              "id": "muorexc",
              "author": "ReptilianOver1ord",
              "body": "It’s worth noting that big tech is trying pretty hard to outsource some of their design/engineering work too (or replace it with AI). Those jobs are high paying and suck up some of the profits that could be lining the pockets of the shareholders.",
              "score": 24,
              "created_utc": 1748434947.0,
              "replies": [
                {
                  "id": "muqo1ec",
                  "author": "wamj",
                  "body": "At the end of the day they are a publicly traded company and their legal responsibility is to their shareholders first.",
                  "score": 3,
                  "created_utc": 1748455609.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "muozlaj",
              "author": "mrGeaRbOx",
              "body": "The deep irony being the only reason they view factory jobs as good jobs is because of labor rights activism and strong unions... Which they also opposed.\n\nWorking in a factory has always been a menial job and more or less dead end. The difference is that there was a time in history where we had enough people banded together to demand a fair wage for that menial mindless job.",
              "score": 15,
              "created_utc": 1748437827.0,
              "replies": [
                {
                  "id": "mup36i4",
                  "author": "showyourdata",
                  "body": "\"Working in a factory has always been a menial job and more or less dead end.\"\n\nFalse. Union Car factores, aircraft factories all use to pay well and open up opportunities for their worker and families. With OIT, my dad could made $150,000 a year In 1978, working at McDonnell Douglas.\n\nHis factories job record education, knowledge. smarts. You don't get a dumb dumb to tune an aircraft engine in a multi-million dollar aircraft. YOu can NOW because tuning engines is \"strike proof\" due to it's automation.",
                  "score": -10,
                  "created_utc": 1748439018.0,
                  "replies": [
                    {
                      "id": "mup9fxm",
                      "author": "mrGeaRbOx",
                      "body": "Menial just means repetitive and not requiring a mental workload. Tune an engine? Come on, dude drop the Hollywood scripted view of what your talking about.\n\nDead end means that there is little opportunity for advancement, unless you're counting shift supervisor.\n\nBoth are accurate.",
                      "score": 14,
                      "created_utc": 1748440994.0,
                      "replies": [
                        {
                          "id": "mus4evg",
                          "author": "PhillAholic",
                          "body": "Yes but typically when you say a job is menial and dead end it’s heavily implied it’s not a good paying job. ",
                          "score": 0,
                          "created_utc": 1748470755.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mup5bjv",
          "author": "Habba84",
          "body": "There is an actual concern behind this. Moving design is much easier than moving manufacturing, which makes design very volatile asset to have. China is conquering the technology business because they manufacture so much by themselves. They have learned how to make their own designs too. Perhaps not yet as well as Apple designers in US, but the gap isn't big anymore. Chinese cars and phones are as good as your average western products, sometimes even better. But at the fraction of costs.\n\nMoving manufacturing to US is a strategic move.",
          "score": 2,
          "created_utc": 1748439709.0,
          "replies": [
            {
              "id": "mup9uz1",
              "author": "BufferUnderpants",
              "body": "What’s the actual risk you’re addressing with that? That businesses would be able to use the manufacturing capability to build phones that compete with Apple? Like Samsung, LG, Huawei, and ZTE? What’s the mitigation? Having the manufacturing capability so that Samsung et al can produce in the US?",
              "score": 4,
              "created_utc": 1748441124.0,
              "replies": [
                {
                  "id": "muq6bof",
                  "author": "Habba84",
                  "body": "What if China prevents exporting iPhones to US? What if China decides to nationalize the factories and start producing MePhones that are almost identical to iPhones?\n\n80% of microchips are produced in China, Taiwan, South Korea and Japan. While some of them are allies to US, in future China may have the ability to block US from these microchips.\n\nThis is about vector of developments. In future, US's superiority in tech may be in danger, and thus greatly reduce their global influence. We are already in the age of automated warfare. US military power might become obsolete very quickly due to their inability to produce autonomous robots at the same rate as China.\n\nThis is all speculation of course, but we are in the edge of technological revolution, and US does not have the best hand.",
                  "score": -4,
                  "created_utc": 1748450463.0,
                  "replies": [
                    {
                      "id": "muq7gtj",
                      "author": "BufferUnderpants",
                      "body": "It’s just the US having these fantasies of war with their suppliers of consumer electronics, it was the same deal with Japan, they just want to sell you shit",
                      "score": 8,
                      "created_utc": 1748450800.0,
                      "replies": [
                        {
                          "id": "muq89o9",
                          "author": "Habba84",
                          "body": "Well, we thought trade would have kept Russia happy...",
                          "score": 0,
                          "created_utc": 1748451036.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mupxxw6",
      "author": "None",
      "body": "[deleted]",
      "score": 16,
      "created_utc": 1748448007.0,
      "replies": [
        {
          "id": "mus0tdh",
          "author": "Preform_Perform",
          "body": "$30/hr with $45/hr overtime?\n\nSounds decent enough to me.",
          "score": 9,
          "created_utc": 1748469609.0,
          "replies": [
            {
              "id": "muvzvo9",
              "author": "soccerjonesy",
              "body": "But keep in mind, as you build these phones, they’ll become $3000+ MSRP, same for any competitor forced to work in America. Now you’ll be forking over at least $125 a month for 2 years financing it at 0% with zero tax with your phone carrier. Throw in a family, a family plan, etc., and suddenly your monthly phone bill for a family of 4 will go from $150-200 to well over $700 a month. That means 10% of your pre-taxed income goes to your phone plan alone. Start adding in tax and interest and you’ll see it is wildly unaffordable, especially since Apple won’t be paying you $80k salary a year to build an iPhone, more like $40k.",
              "score": 0,
              "created_utc": 1748528622.0,
              "replies": []
            }
          ]
        },
        {
          "id": "muqws9g",
          "author": "veronica_deetz",
          "body": "I have a white collar job now but I genuinely loved working in a factory in college. The only part of the job that sucked was getting minimum wage. I would honestly prefer factory work if it paid well/had good benefits. \n\nI prefer being physically tired at the end of the day over being completely mentally drained",
          "score": 6,
          "created_utc": 1748458113.0,
          "replies": [
            {
              "id": "musskra",
              "author": "ItHurtsWhenIP404",
              "body": "Look up Foxconn and the living/working conditions.  See if that changes your mind. Should these be made in America and keep that money here, yes, but..",
              "score": -1,
              "created_utc": 1748478846.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "murl3du",
      "author": "Shas_Erra",
      "body": "Money\n\nSaved you a click",
      "score": 7,
      "created_utc": 1748464992.0,
      "replies": []
    },
    {
      "id": "muom91n",
      "author": "GenazaNL",
      "body": "Because it's cheaper elsewhere.",
      "score": 33,
      "created_utc": 1748432951.0,
      "replies": [
        {
          "id": "muoyqss",
          "author": "mrGeaRbOx",
          "body": "The reason it's cheaper elsewhere is that they have lower safety standards meaning working makes your life shorter and dangerous. \n\nIt cost you personally less but you're just trading years off of the end of someone else's life. I mean sure some children may lose limbs in factories and die in their late 40s of cancer but hey you need a cheap phone!!! Otherwise you wouldn't be able to replace it every few years and might have to save up. Can you imagine?",
          "score": -18,
          "created_utc": 1748437542.0,
          "replies": [
            {
              "id": "mup09nc",
              "author": "Lunar_Landing_Hoax",
              "body": "The spirit of your reply isn't wrong but I don't think children are losing limbs in Foxconn factories. ",
              "score": 17,
              "created_utc": 1748438052.0,
              "replies": [
                {
                  "id": "mup28qg",
                  "author": "showyourdata",
                  "body": "Replace that with Committed suicide.",
                  "score": -2,
                  "created_utc": 1748438711.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "muozvte",
              "author": "Pinelli72",
              "body": "Didn’t Trump just close down OSHA? Here come the iPhones!",
              "score": 3,
              "created_utc": 1748437926.0,
              "replies": []
            },
            {
              "id": "mup36mf",
              "author": "mkosmo",
              "body": "It's not just lower safety stadards, but lower every standards from labor to environmental.\n\nPeople who buy stuff from china while complaining about carbon emissions of domestic companies are missing the forest through the trees.",
              "score": -9,
              "created_utc": 1748439019.0,
              "replies": [
                {
                  "id": "mup6geo",
                  "author": "ddevilissolovely",
                  "body": "Ah yes, no use complaining about US carbon emissions which are oh so famously low.",
                  "score": 4,
                  "created_utc": 1748440069.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mupo75w",
      "author": "stlredbird",
      "body": "The only way they will ever be made in America is if the factories are fully automated and don’t need actual people.",
      "score": 6,
      "created_utc": 1748445263.0,
      "replies": []
    },
    {
      "id": "muosth8",
      "author": "MVPizzle_Redux",
      "body": "We don’t have the fucking expertise to build these things. We have finance bros , lawyers, engineers and coders here, we geared our economy around it. We have like 45 people that can plan out how put these things together at scale let alone actually do it",
      "score": 22,
      "created_utc": 1748435468.0,
      "replies": [
        {
          "id": "mup35uz",
          "author": "None",
          "body": "[deleted]",
          "score": -18,
          "created_utc": 1748439012.0,
          "replies": [
            {
              "id": "mup3g4k",
              "author": "MVPizzle_Redux",
              "body": "No it’s not lol you don’t have an entire generation of kids primarily focused to become electrical engineering majors  graduating this year in the United States. They have a sense of national pride around semiconductor industry that kids strive to become apart of from a young age.\n\nTheir transistor development career path follows the same “work insanely hard” culture that our finance /legal people follow.",
              "score": 13,
              "created_utc": 1748439105.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "muowcwl",
      "author": "Seandouglasmcardle",
      "body": "It seems that zero people commenting here actually bothered to read the article.\n\nAccording to the article, it’s because US lacks the highly technical skills that the Chinese and Indian workforce has spent two decades developing. \n\nThe US also lacks the sheer number of people who would have the expertise to build something as complex as an iPhone. The chinese company that assembles the iPhone employs 900,000 assembly line workers to meet the demand.",
      "score": 47,
      "created_utc": 1748436726.0,
      "replies": [
        {
          "id": "mur5ks8",
          "author": "justaguy394",
          "body": "To be clear, that 900k is not all for the iPhone, that’s the whole company (Foxconn) at peak season (and they make a jillion different things) and they aren’t all assembly line workers.",
          "score": 3,
          "created_utc": 1748460612.0,
          "replies": []
        },
        {
          "id": "mupuomw",
          "author": "swampcholla",
          "body": "Explain what “highly technical skills “ are required to assemble something on a line. \n\nIf you want to talk about designing the line, ill buy that",
          "score": -3,
          "created_utc": 1748447089.0,
          "replies": [
            {
              "id": "muq8yjf",
              "author": "marijuana_user_69",
              "body": "it is about designing the line, and managing and running it properly once designed, adapting the process to challenges that arise, and optimizing it for speed and cost and allocating resources to effectively meet & balance the schedule and other output requirements. most of the best people for that kind of work are in china. not just for iphones but for all the parts that go into making the iphone at the final assembly lines",
              "score": 3,
              "created_utc": 1748451238.0,
              "replies": [
                {
                  "id": "muqeli9",
                  "author": "swampcholla",
                  "body": "It's process development.  People do it here for all kinds of assembly lines.  China has not cornered the market on that talent.",
                  "score": 3,
                  "created_utc": 1748452909.0,
                  "replies": [
                    {
                      "id": "mutz2d5",
                      "author": "marijuana_user_69",
                      "body": "it's not that they cornered the market, but they're at the front of it and there's just more people who are good at it in china these days",
                      "score": 1,
                      "created_utc": 1748495084.0,
                      "replies": [
                        {
                          "id": "muu3x2d",
                          "author": "swampcholla",
                          "body": "Ans so your solution is just concede?",
                          "score": 1,
                          "created_utc": 1748497559.0,
                          "replies": [
                            {
                              "id": "muuiven",
                              "author": "marijuana_user_69",
                              "body": "no? who said that?",
                              "score": 2,
                              "created_utc": 1748506021.0,
                              "replies": [
                                {
                                  "id": "muw4a84",
                                  "author": "swampcholla",
                                  "body": "Thats essentially what you are suggesting. You say it can’t be done in the US, so that means conceding that part of the market and technology space for good.",
                                  "score": 0,
                                  "created_utc": 1748529880.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "muqgflk",
                  "author": "Speedstick2",
                  "body": "Bullshit, if America can have assembly plants for motor vehicles that have thousands of parts in them then they can assemble an iPhone.",
                  "score": 1,
                  "created_utc": 1748453446.0,
                  "replies": [
                    {
                      "id": "mutyumr",
                      "author": "marijuana_user_69",
                      "body": "i'm not saying america couldn't do it. i'm saying that it's easier to do all that in china because there are more people capable of all that stuff and all the best people are in china now, especially for consumer electronics.\n\nyou get good at things by doing them, and if you stop doing them, you stop being good at them. plus the state of the art has advanced in the time since a lot of this stuff was outsourced",
                      "score": 2,
                      "created_utc": 1748494978.0,
                      "replies": [
                        {
                          "id": "mv6hxjl",
                          "author": "Speedstick2",
                          "body": "Hence the point that the goal is long term not short term.",
                          "score": 1,
                          "created_utc": 1748658224.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mup30tj",
          "author": "None",
          "body": "[deleted]",
          "score": -27,
          "created_utc": 1748438966.0,
          "replies": [
            {
              "id": "mup66lu",
              "author": "Danne660",
              "body": "The reality is that getting US producers to make customized products for your business is often almost impossible. Don't matter if you try to get your stuff from the us eventually you will give up and look for foreign production.",
              "score": 13,
              "created_utc": 1748439982.0,
              "replies": []
            },
            {
              "id": "mup5die",
              "author": "Seandouglasmcardle",
              "body": "Actually, I work at a robotics company, and we struggle to find technically skilled candidates. And we’re only looking for a handful, not 900,000.\n\nI’ve personally witnessed the decline myself in the past 15 years. If you take money out of the equation, the US would not be able to compete. The Chinese workforce has eclipsed the American workforce.\n\n I am constantly seeing competing Chinese products outperforming made in the USA products, much to the chagrin of my superiors. That wasn’t the case a decade ago.",
              "score": 25,
              "created_utc": 1748439726.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "muppz7i",
      "author": "MBSMD",
      "body": "If Apple does face a tariff on their phones (or other devices), they should spell out on the invoices exactly how much the tariff costs and what the tariff is, so customers know who from and why they're paying it.",
      "score": 4,
      "created_utc": 1748445765.0,
      "replies": [
        {
          "id": "muqh0q9",
          "author": "fibonaccisprials",
          "body": "Does America include tax on the price of the item or is that added at checkout?  just curious.  I agree it should include the tariff cost and say trump tax or something",
          "score": 1,
          "created_utc": 1748453618.0,
          "replies": [
            {
              "id": "murc5h2",
              "author": "glitterpens",
              "body": "It’s added at the end of checkout usually",
              "score": 2,
              "created_utc": 1748462470.0,
              "replies": []
            },
            {
              "id": "musqdmj",
              "author": "MBSMD",
              "body": "Added at time of checkout as it can differ depending on state of residence/purchase.",
              "score": 1,
              "created_utc": 1748478079.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mus5fox",
      "author": "MiniMini662",
      "body": "It’s cheaper to keep it offshore even if tariffs were 50 %",
      "score": 5,
      "created_utc": 1748471087.0,
      "replies": []
    },
    {
      "id": "muoorm5",
      "author": "IamChwisss",
      "body": "Isn't the iPhone already expensive enough?",
      "score": 14,
      "created_utc": 1748433941.0,
      "replies": []
    },
    {
      "id": "mup5ihn",
      "author": "Konradleijon",
      "body": "Cheaper labor standards",
      "score": 3,
      "created_utc": 1748439770.0,
      "replies": []
    },
    {
      "id": "mupmo8a",
      "author": "PlainJaneGum",
      "body": "Definitely won’t",
      "score": 3,
      "created_utc": 1748444831.0,
      "replies": []
    },
    {
      "id": "muqgoca",
      "author": "Riversntallbuildings",
      "body": "TLDR-Supply Chains and cheap labor.",
      "score": 3,
      "created_utc": 1748453517.0,
      "replies": []
    },
    {
      "id": "murp60u",
      "author": "oripash",
      "body": "Because then they’d cost $3500-$4000 per device and not enough people would buy that to make it viable to make them.",
      "score": 3,
      "created_utc": 1748466119.0,
      "replies": []
    },
    {
      "id": "mutn9dk",
      "author": "Randomcommentor1972",
      "body": "Unless they announce a really awesome robot that builds them day and night (like the one that takes them apart for recycling)",
      "score": 3,
      "created_utc": 1748489766.0,
      "replies": []
    },
    {
      "id": "mupb2bz",
      "author": "Yodl007",
      "body": "Because Apple doesn't \"make\" the iPhones. They assemble them from components mostly made from other companies (the SOC is theirs). And those other companies would have to produce the stuff in the US as well or ship the components to the Apple assembly plant in the US.",
      "score": 2,
      "created_utc": 1748441487.0,
      "replies": []
    },
    {
      "id": "mupujjp",
      "author": "Promortyous",
      "body": "People really don’t understand that you don’t want these jobs here. They’ll have as low as pay as humanly possible while wanting the most out of their employees. This shit doesn’t mAKe uS GrEaT aGaIN” Manufacturing died off here for the sole reason of we aren’t cheap enough, people still stuck in the “glory” days of factory jobs and overlooking how drastically different everything is now.",
      "score": 2,
      "created_utc": 1748447050.0,
      "replies": []
    },
    {
      "id": "mupw8ad",
      "author": "2kids2adults",
      "body": "Uuuuhhhh. Cause nobody would pay the exoxrbanat price to have them made in America? It would be suicide for the sales of the iPhone.",
      "score": 2,
      "created_utc": 1748447523.0,
      "replies": []
    },
    {
      "id": "muq6gy8",
      "author": "AEternal1",
      "body": "From what I have seen they have attempted to get production in other countries and they have found that the workforce just isn't capable of the insane level of precision that apparently China achieves. And I don't mean that to say in that they can't do it at all they just can't do it to the scale that Apple requires.",
      "score": 2,
      "created_utc": 1748450507.0,
      "replies": []
    },
    {
      "id": "mureo15",
      "author": "goldaxis",
      "body": "The fact that we can't for so many different reasons should be alarming. But who cares about the future when you play gotcha with political bickering in the moment. As though this problem has festered through half a dozen administrations across both parties.",
      "score": 2,
      "created_utc": 1748463191.0,
      "replies": []
    },
    {
      "id": "mut80xk",
      "author": "Simonic",
      "body": "Also - minimum wage. $1300/month vs $300/month - per employee. \n\nManufacturing to the extent they imagine will NEVER be back here. Sure - certain aspects of the chain could come back, but still not without price increases. \n\nAnd if they got rid of all min wages - our economy would effectively collapse.",
      "score": 2,
      "created_utc": 1748484114.0,
      "replies": []
    },
    {
      "id": "mutk79y",
      "author": "ownerofkitkats",
      "body": "Because they would have to spend a lot more money on labor if they did",
      "score": 2,
      "created_utc": 1748488539.0,
      "replies": []
    },
    {
      "id": "muprlht",
      "author": "count_chocul4",
      "body": "“There’s also the question of whether there’s enough demand for factory jobs in America. Manufacturing has been on the decline in the United States, with only 8% of American workers holding jobs in that sector as of earlier this year compared to roughly 26% in 1970, according to the Bureau of Labor Statistics”\n\nYeah as if we the working people had a say in factory jobs going overseas. Real classy cnn, it wasn’t workers who decided to take jobs overseas, it was greedy corporations. tRump loves the greedy fucks who took those jobs away from us.",
      "score": 3,
      "created_utc": 1748446221.0,
      "replies": []
    },
    {
      "id": "muosshk",
      "author": "CanisMajoris85",
      "body": "Because we don’t have the robots to completely replace human labor yet and the factories would take years to build even if we did.",
      "score": 4,
      "created_utc": 1748435458.0,
      "replies": [
        {
          "id": "mupik97",
          "author": "Bossman1212",
          "body": "We will also need Amigos to build the factories.  \nI have worked commercial construction for 40 years and I sincerely use the word Amigos to mean my friends.",
          "score": 3,
          "created_utc": 1748443659.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mup5sid",
      "author": "Brilliant-Event9872",
      "body": "I wouldn’t be surprised if prisoners are forced to make them",
      "score": 3,
      "created_utc": 1748439857.0,
      "replies": []
    },
    {
      "id": "muph4dy",
      "author": "the-samizdat",
      "body": "apple has invested $245 billion into china in the last ten years. to put that in perspective, the Marshall Plan, (AKA EU Recovery Program) provided a total of $13.3 billion in aid or 135 billion in today’s value.",
      "score": 3,
      "created_utc": 1748443250.0,
      "replies": []
    },
    {
      "id": "muu80ui",
      "author": "TobiasReaperB",
      "body": "Simple, these rich fucks can’t get American citizens to come to work for a handful of dimes…they would have to actually pay us, which they do NOT want to do. \n\nSo, they go to some country with an extremely poor populace that they can exploit for pennies to produce a phone that’ll cost us $1000! \n\nIt’s never enough for these greedy POS.",
      "score": 3,
      "created_utc": 1748499783.0,
      "replies": []
    },
    {
      "id": "muoqmd2",
      "author": "0n0n-o",
      "body": "Yeah because apples profit margins will be less.",
      "score": 9,
      "created_utc": 1748434652.0,
      "replies": [
        {
          "id": "muorobo",
          "author": "Da_Steeeeeeve",
          "body": "No they wont.\n\n  \nApple will make what they want to make, the consumer prices however? Those will shoot up.\n\n  \nCompanies NEVER absorb the cost they just pass it on.\n\n  \nIn this case estimates from experts are around 3-3500 dollars cost in the cheapest parts of America to make the phone, up to 7-8000 in the places with stricter labour laws.",
          "score": 2,
          "created_utc": 1748435043.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mupwm9d",
      "author": "Solstice_Fluff",
      "body": "America just needs to provide universal healthcare, low income housing, low rate insurance. \n\nThen it can be considered.",
      "score": 2,
      "created_utc": 1748447632.0,
      "replies": []
    },
    {
      "id": "muqjm3a",
      "author": "Tricky-Efficiency709",
      "body": "Cuz Capitslism, Republicanism…all the isms…..",
      "score": 2,
      "created_utc": 1748454378.0,
      "replies": []
    },
    {
      "id": "muse3qi",
      "author": "aaffpp",
      "body": "Funny this is, Trump can't even figure out how to use an iPhone, yet he is adamant he is quite capable of dictating industrial strategy.",
      "score": 1,
      "created_utc": 1748473916.0,
      "replies": []
    },
    {
      "id": "mutbf67",
      "author": "Kaizen2468",
      "body": "There is no probably. They will never do it",
      "score": 1,
      "created_utc": 1748485312.0,
      "replies": []
    },
    {
      "id": "muu93dr",
      "author": "mten12",
      "body": "I saw a video where a large bicycle creator in the USA used to do everything US based and made most bikes by hand. Well after Walmart and other huge orders they had to ramp up facilities and over a decade moved some parts to china to be made then shipped here to be assembled because for example handle bars would cost 19cents or so each made to their custom spec and order. \n\nAfter tariffs announced he found a USA metal producer add sent the plans and asked for a quote on a large order. And was given like $9 per handlebar as an example. Which would never happen for his company. Almost the whole price of the bike or whatever he was saying. \n\nThis is a small example of why a complicated device like the iPhone will never be made on US Soil. Not to mention the amount of workers needed to ramp production and such. \n\nYou could maybe “maybe” assemble them in America with the right tax incentives but that would still take 5-10 years to strike a deal and build and shift the supply chain.",
      "score": 1,
      "created_utc": 1748500380.0,
      "replies": []
    },
    {
      "id": "muut798",
      "author": "yulDD",
      "body": "Americans sleeping in dormitories?",
      "score": 1,
      "created_utc": 1748512089.0,
      "replies": []
    },
    {
      "id": "muon7og",
      "author": "Fancy-Pair",
      "body": "Slave labor",
      "score": 0,
      "created_utc": 1748433331.0,
      "replies": [
        {
          "id": "muoq5sd",
          "author": "MillionEgg",
          "body": "Incorrect",
          "score": -5,
          "created_utc": 1748434477.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mupbphz",
      "author": "partisan59",
      "body": "In America you can't use what's essentially slave labor (yet) the way they do in China and India",
      "score": 0,
      "created_utc": 1748441679.0,
      "replies": []
    },
    {
      "id": "mup2e2g",
      "author": "Tasty-Performer6669",
      "body": "$\n\nsaved you a click",
      "score": -1,
      "created_utc": 1748438760.0,
      "replies": []
    },
    {
      "id": "mup4jsk",
      "author": "DjImagin",
      "body": "Simple.  They know no one will spend over 3k every two years to upgrade their phone and it will murder their profit margins to shareholders.",
      "score": 0,
      "created_utc": 1748439461.0,
      "replies": [
        {
          "id": "muptalj",
          "author": "Illustrious-Cookie73",
          "body": "$3000? Where?",
          "score": -2,
          "created_utc": 1748446701.0,
          "replies": [
            {
              "id": "muqgwyn",
              "author": "DjImagin",
              "body": "Are you naturally stupid or just willfully?",
              "score": 1,
              "created_utc": 1748453588.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mup8zbz",
      "author": "sinkmyteethin",
      "body": "Do people not understand factories are fully automated now? They literally run in the dark, 24/7. This has been going on for at least a decade. What's the cost of an iPhone, the R&D apple says it puts in it, or the materials or both? Cause if it's just materials there is NO reason why Asian android phones same spec cost 200 dollars, and apple 2000. You guys don't get it",
      "score": -1,
      "created_utc": 1748440851.0,
      "replies": [
        {
          "id": "muphn2x",
          "author": "Ill1458",
          "body": "![gif](giphy|dFmpr1JHPNxD2)",
          "score": 3,
          "created_utc": 1748443397.0,
          "replies": []
        },
        {
          "id": "mupt7qr",
          "author": "Illustrious-Cookie73",
          "body": "$2000?  Where?",
          "score": 1,
          "created_utc": 1748446679.0,
          "replies": [
            {
              "id": "mur3kln",
              "author": "sinkmyteethin",
              "body": "That's usually the price in Europe for the top model",
              "score": 1,
              "created_utc": 1748460043.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mupe9dd",
      "author": "Phronias",
      "body": "Forget about the cost, it's a simple lack of the required skills that the American public possess. Being cheaper to make elsewhere has nothing to do with it at all.",
      "score": -3,
      "created_utc": 1748442426.0,
      "replies": []
    },
    {
      "id": "muozzyn",
      "author": "jweaver0312",
      "body": "US lacks the skills, load a crap. That’s when you know someone tells lies.",
      "score": -8,
      "created_utc": 1748437964.0,
      "replies": []
    },
    {
      "id": "mut9gav",
      "author": "1960Dutch",
      "body": "What should happen is that these businesses invest with partnerships to schools to get Americans educated to fill these roles in the future",
      "score": 0,
      "created_utc": 1748484610.0,
      "replies": []
    },
    {
      "id": "muolpr9",
      "author": "None",
      "body": "Cuz they can’t add tariffs to US made products.",
      "score": -14,
      "created_utc": 1748432736.0,
      "replies": []
    },
    {
      "id": "muply1z",
      "author": "None",
      "body": "Sounds like companies should never reach a state where they are in the billions. Everyone here is just stating that either you are the billionaire screwing others or the one getting screwed. Making excuses for these companies as if they needed to raise their prices at all. People love to back up those they will never be.",
      "score": -1,
      "created_utc": 1748444624.0,
      "replies": []
    }
  ]
}