{
  "post": {
    "title": "Old Nest thermostats are about to become dumb: What you need to know",
    "author": "chrisdh79",
    "id": "1k7xgsq",
    "score": 2940,
    "created_utc": 1745619315.0,
    "selftext": "",
    "num_comments": 554,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1k7xgsq/old_nest_thermostats_are_about_to_become_dumb/"
  },
  "comments": [
    {
      "id": "mp1uiok",
      "author": "Minionz",
      "body": "If google doesn't want to support them, then open source these models so other people can make custom firmware/control/alerts for them.",
      "score": 2535,
      "created_utc": 1745620656.0,
      "replies": [
        {
          "id": "mp1uths",
          "author": "None",
          "body": "[removed]",
          "score": 745,
          "created_utc": 1745620761.0,
          "replies": [
            {
              "id": "mp2p33m",
              "author": "kr4ckenm3fortune",
              "body": "That precisely the reasons they don't want to. They don't want you to. They want you to keep buying products, filling the landfill.\n\nThey never cared about that.",
              "score": 315,
              "created_utc": 1745631334.0,
              "replies": [
                {
                  "id": "mp8f7rm",
                  "author": "Blusterlearntdebrief",
                  "body": "Indeed, planned obsolescence has been in full swing since the lightbulb",
                  "score": 26,
                  "created_utc": 1745712529.0,
                  "replies": [
                    {
                      "id": "mp9lzbv",
                      "author": "Smurtle01",
                      "body": "The lightbulb is not really planned obsolescence. It’s more akin to the fact that brighter lightbulbs burn out faster. And people would prefer to see better than have longer lasting bulbs. (As shown by LED lights lasting MUCH longer than more conventional bulbs.) \n\nHere’s a good video on the topic: https://youtu.be/zb7Bs98KmnY?si=4-dbOcAQeQHcnTfo\n\nEssentially, it’s pretty complicated situation, atleast for specifically the lightbulbs n stuff back then.",
                      "score": 7,
                      "created_utc": 1745730188.0,
                      "replies": [
                        {
                          "id": "mpnyia1",
                          "author": "fleemfleemfleemfleem",
                          "body": "https://en.wikipedia.org/wiki/Phoebus_cartel\n\nThere was literally a cartel of manufacturers that worked together to lower the life expectancy of a bulb to 1000 hours.",
                          "score": 4,
                          "created_utc": 1745937024.0,
                          "replies": [
                            {
                              "id": "mpstlgx",
                              "author": "Smurtle01",
                              "body": "yes, and the video I posted talks about said cartel as well. It’s not as straight forward as you might think.",
                              "score": 1,
                              "created_utc": 1745995834.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mpvjz0q",
                      "author": "kr4ckenm3fortune",
                      "body": "Nope. That went into full swing once some idiots discovered you make more money selling products than services.",
                      "score": 1,
                      "created_utc": 1746034824.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mpa8osb",
                  "author": "HugsyMalone",
                  "body": "Yep. Best you're gonna be able to do is if someone reverse engineers everything and devises a crude solution from scratch. Google ain't gonna do it because the whole point is making money by selling new devices. 😒👌",
                  "score": 1,
                  "created_utc": 1745743589.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mp22spu",
              "author": "WhisperTits",
              "body": "True but you gotta pay for that home assistant integration unfortunately ($15 last time I checked but they might actually be going through an API right to your account online to make any thermostat adjustments).",
              "score": 111,
              "created_utc": 1745623493.0,
              "replies": [
                {
                  "id": "mp30scr",
                  "author": "Striving2Improve",
                  "body": "Not exactly. You can hook up to matter on some newer ones for free and change temperature but not run the fan or set schedule. So the exposed feature set is incomplete but the community could solve this.",
                  "score": 29,
                  "created_utc": 1745635577.0,
                  "replies": []
                },
                {
                  "id": "mp2kpe9",
                  "author": "McFlyParadox",
                  "body": "Does ecobee charge for HA integration? I've heard their integration is better, anyway.",
                  "score": 20,
                  "created_utc": 1745629742.0,
                  "replies": [
                    {
                      "id": "mp2lqa9",
                      "author": "ExaminationSerious67",
                      "body": "No, and yes. They stopped giving out API keys, but if you do a homekit integration with it, you can get most of the important things. Still can't get the aux just to come activate with it tho for some reason.",
                      "score": 19,
                      "created_utc": 1745630111.0,
                      "replies": [
                        {
                          "id": "mp2wqy4",
                          "author": "McFlyParadox",
                          "body": "Isn't home kit locked into Apple's ecosystem, though?",
                          "score": 0,
                          "created_utc": 1745634063.0,
                          "replies": [
                            {
                              "id": "mp33sn8",
                              "author": "ournewoverlords",
                              "body": "Home Assistant has an integration that allows some HomeKit accessories (including Ecobee) to integrate directly to HASS using HomeKit protocol",
                              "score": 8,
                              "created_utc": 1745636688.0,
                              "replies": []
                            },
                            {
                              "id": "mp30o2z",
                              "author": "ExaminationSerious67",
                              "body": "maybe, but it works without internet access for me.",
                              "score": 3,
                              "created_utc": 1745635534.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mp2r0yf",
                  "author": "vector2point0",
                  "body": "You’re right, the integration is just via an API to the online side of the account, it will stop working when the app does.",
                  "score": 1,
                  "created_utc": 1745632009.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mp2gna1",
              "author": "helpjack_offthehorse",
              "body": "But can it play doom.",
              "score": 20,
              "created_utc": 1745628289.0,
              "replies": [
                {
                  "id": "mp2icum",
                  "author": "tjmaxal",
                  "body": "Yes actually",
                  "score": 16,
                  "created_utc": 1745628900.0,
                  "replies": [
                    {
                      "id": "mp2m8qj",
                      "author": "theemptyqueue",
                      "body": "Can it play Crisis?",
                      "score": 1,
                      "created_utc": 1745630297.0,
                      "replies": [
                        {
                          "id": "mp2nq7w",
                          "author": "tjmaxal",
                          "body": "It caused one",
                          "score": 2,
                          "created_utc": 1745630838.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mp38x7y",
                  "author": "None",
                  "body": "The answer to this question is always \"yes\". It just depends on how much effort someone wants to expend to make it happen.",
                  "score": 6,
                  "created_utc": 1745638758.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mp4iwh0",
              "author": "sneekysmiles",
              "body": "They wouldn’t do that for the same reason General Electric opted to redesign the lightbulb to make it burn out eventually.",
              "score": 1,
              "created_utc": 1745664043.0,
              "replies": []
            },
            {
              "id": "mp4ozi6",
              "author": "ghoulgang_",
              "body": "Calling a nest a perfectly functional device is hilarious to me. I’ve made a lot of money replacing them with real thermostats ",
              "score": 1,
              "created_utc": 1745667211.0,
              "replies": []
            },
            {
              "id": "mp202hq",
              "author": "hacksoncode",
              "body": "Internet-enabled home thermostats are a *terrible* kind of device to be run by some fly by night organization with questionable security practices. \n\nSay what you will about google. They know how to do security.",
              "score": -69,
              "created_utc": 1745622570.0,
              "replies": [
                {
                  "id": "mp24j7l",
                  "author": "atbths",
                  "body": "11 year old open-source organization = 'fly by night'.  Ok.",
                  "score": 25,
                  "created_utc": 1745624087.0,
                  "replies": []
                },
                {
                  "id": "mp225an",
                  "author": "richie510",
                  "body": "I’m so confused by your comment.",
                  "score": 39,
                  "created_utc": 1745623272.0,
                  "replies": [
                    {
                      "id": "mp23piy",
                      "author": "Dr_Jabroski",
                      "body": "I don't think he knows home assistant is fully local with optional Internet functionality.",
                      "score": 37,
                      "created_utc": 1745623803.0,
                      "replies": [
                        {
                          "id": "mp2kvte",
                          "author": "McFlyParadox",
                          "body": "Or open source, with anyone able to audit their code.",
                          "score": 5,
                          "created_utc": 1745629806.0,
                          "replies": [
                            {
                              "id": "mp2o4a3",
                              "author": "stratospheres",
                              "body": "Open source being more secure is questionable. Ask Apple how Heartbleed felt  after using it.",
                              "score": -7,
                              "created_utc": 1745630981.0,
                              "replies": [
                                {
                                  "id": "mp2tu44",
                                  "author": "elsjpq",
                                  "body": "We have literally decades of evidence that open source software is *more* secure, not less",
                                  "score": 6,
                                  "created_utc": 1745633005.0,
                                  "replies": [
                                    {
                                      "id": "mp4o53i",
                                      "author": "stratospheres",
                                      "body": "This is literally not true.\n\nEdit: and repeating it without giving more context of the actual pros and cons is dangerous.\n\nHere's yet another example of that from just a few weeks ago: https://thehackernews.com/2025/03/nine-year-old-npm-packages-hijacked-to.html?m=1",
                                      "score": 0,
                                      "created_utc": 1745666809.0,
                                      "replies": [
                                        {
                                          "id": "mp4ph4o",
                                          "author": "stratospheres",
                                          "body": "And this one that steals your crypto survived through 4 separate releases of an open source library, all there for the \"open source eyes\" to see:  https://www.theregister.com/2025/04/23/ripple_npm_supply_chain/",
                                          "score": -1,
                                          "created_utc": 1745667441.0,
                                          "replies": [
                                            {
                                              "id": "mp4qteu",
                                              "author": "stratospheres",
                                              "body": "Listen, I'm not anti open source. I use it every single day. But the pithy short answer above is just dangerous. Feel free to live in a bubble if you want, but assuming that it's magical is wrong.\n\nDo you personally understand all of the code in those open source packages you rely on, or at least have assurance on their safety *from someone you know and trust*?\n\nIf not, it's still closed source to you.",
                                              "score": 2,
                                              "created_utc": 1745668068.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mp2r9qy",
                                  "author": "McFlyParadox",
                                  "body": "Security through obscurity isn't any more secure though. Just ask any company who's had a security flaw get exploited in their closed source code.",
                                  "score": 5,
                                  "created_utc": 1745632095.0,
                                  "replies": [
                                    {
                                      "id": "mp4nysk",
                                      "author": "stratospheres",
                                      "body": "For Heartbleed, the open source bug in OpenSSL, one of the most widely used packages and arguably one of the most critical ones, was there for over 2 years. Looked at by many eyes. \n\nI don't disagree. I like open source and use it every day. My point is that open source being inherently more secure is just plain wrong. And I say this as someone who uses open source software as part of our codebase every day and has developed software professionally for almost 40 years.\n\nAsk yourself this. Are the only eyes looking at open source software the \"good guys\"?\n\nHere's another:\n\nIf you develop software professionally, how much time do you spend upgrading npm packages as the old ones are found to have security holes?\n\nFor all the downvoters, enjoy your reflex. For any of you that want to actually understand and not just bark \"open source good... closed source bad\", feel free to expand your mind a bit: https://www.zdnet.com/article/heartbleed-open-sources-worst-hour/\n\nOr perhaps look at how Apple's Goto Fail worked out: https://www.zdnet.com/article/proof-of-concept-captures-all-ssl-traffic-via-apples-goto-fail-exploit/ with more details here: https://www.imperialviolet.org/2014/02/22/applebug.html\n\nBTW, I'm perfectly aware of the myriad of problems the Nest had under a closed source model. IOT devices are a pain to keep safe for a few reasons.\n\nThat said, the assumption that letting us look at the code magically makes it safe is just shortsighted. Do you have any idea how convoluted that code base will be after 15 years of development? \n\nTL;DR is this stuff is hard. Assuming that it's magically safer because it's open source is wrong and more importantally, dangerous. It still takes care, feeding and diligence.",
                                      "score": 0,
                                      "created_utc": 1745666723.0,
                                      "replies": [
                                        {
                                          "id": "mp4s2o9",
                                          "author": "McFlyParadox",
                                          "body": "\n>My point is that open source being inherently more secure is just plain wrong\n\nIf you said *\"open source is inherently secure is just plain wrong\"*, I would have agreed. But open source *is* ***more*** secure than closed source, by simple virtue of having more eyes on it, and being auditable by anyone. Yes, this means bad actors can take advantage of it too, but it also means they need to work quietly and quickly, too, because the good actors have all the same information as them. \n\nYou can -and should- point out all the times open source software had bugs in it that were caught and explored by bad actors first. But they are far outnumbered by the number of times the same things happened to closed source software.",
                                          "score": 3,
                                          "created_utc": 1745668633.0,
                                          "replies": [
                                            {
                                              "id": "mp4xrd4",
                                              "author": "stratospheres",
                                              "body": "The problem here is that you don't know that. The problems that actually exist are an unknowable set. \n\nAlso, the fact that there are many, many examples of security holes existing through multiple releases of open source packages, sometimes for years, tells us that the assumption that many eyes *are actually looking* at this packages is just overly optimistic.\n\nI pointed this out in another thread, but if you, yourself, didn't look at and understand every open source package you use, or alternately, get assurance that it's safe from someone who you know and trust, then it's still closed source to you, but not to motivated bad actors, which is arguably worse.",
                                              "score": 0,
                                              "created_utc": 1745671052.0,
                                              "replies": [
                                                {
                                                  "id": "mp4y7fe",
                                                  "author": "stratospheres",
                                                  "body": "Also, it's about to get a lot worse: https://www.msn.com/en-us/technology/cybersecurity/the-cve-program-for-tracking-security-flaws-is-about-to-lose-federal-funding/ar-AA1CZ6ZZ",
                                                  "score": 1,
                                                  "created_utc": 1745671232.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mp2u5nv",
                          "author": "hacksoncode",
                          "body": "I know it is ... *in general*, but the home assistant webpage says that this integration uses the google cloud service APIs to control the Nests.",
                          "score": -1,
                          "created_utc": 1745633118.0,
                          "replies": [
                            {
                              "id": "mp3q9oz",
                              "author": "Dr_Jabroski",
                              "body": "That's the point of open sourcing the firmware. You can then have the community change it so it only contacts your LAN. Once you can write firmware you can make the device do anything the hardware is capable of.",
                              "score": 1,
                              "created_utc": 1745647048.0,
                              "replies": [
                                {
                                  "id": "mp4y8dy",
                                  "author": "hacksoncode",
                                  "body": "Modern FW is protected cryptographically and really can't be updated without the secret keys... releasing those essentially completely destroys the security of the device.",
                                  "score": 1,
                                  "created_utc": 1745671242.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mp263gm",
                      "author": "Feminist_Hugh_Hefner",
                      "body": "I think what they're saying is that they have no idea what they're talking about.",
                      "score": 13,
                      "created_utc": 1745624612.0,
                      "replies": []
                    },
                    {
                      "id": "mp23p7v",
                      "author": "sweaterandsomenikes",
                      "body": "I’m not. Easy way for someone with bad intentions to hack into your mainframe. \n\nI have no idea what I’m talking about. It does seem like an easy way to access all your other connected devices.",
                      "score": -13,
                      "created_utc": 1745623800.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mp29g4k",
                  "author": "TheSlitheringSerpent",
                  "body": "So with home assistant, the point is to not let any IOT device to communicate with the internet directly. They only talk to YOUR home assistant server on YOUR LAN, and you can expose home assistant to the internet if you so desire (always following security practices, i.e. 2FA, SSL certs in order, maybe even restricting access through a VPN, etc.). You own your data, your devices, your server, and your access to it all, with no relying on external third parties for the functionality of your home.\n\nOf course, that is the Utopian pitch, and realistically anti-consumer practices means you either have to wait for an offline integration to get hacked together, or you're stuck with proprietary stuff like Tuya handling all your IOT requests on their servers in china.\n\nThing is, it's still possible to pull it all off if you put in the effort, and if the companies cooperate and don't turn all their products into e-waste the moment they lose interest in them.....and that's what we should all strive for, even if it means having to learn how to maintain some things yourself.",
                  "score": 5,
                  "created_utc": 1745625737.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mp21y8n",
          "author": "Mindless_Consumer",
          "body": "But what about future thermostat sales? Think of the shareholders!",
          "score": 124,
          "created_utc": 1745623206.0,
          "replies": [
            {
              "id": "mp24r36",
              "author": "damndammit",
              "body": "I’m not buying any more Nests after this.",
              "score": 123,
              "created_utc": 1745624158.0,
              "replies": [
                {
                  "id": "mp2aevf",
                  "author": "helava",
                  "body": "Yeah, this is just effectively extortion. Fuck Google, fuck Nest.",
                  "score": 58,
                  "created_utc": 1745626074.0,
                  "replies": [
                    {
                      "id": "mp2o0kz",
                      "author": "Candid-Piano4531",
                      "body": "Agreed. Fuck these guys.",
                      "score": 11,
                      "created_utc": 1745630943.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mp31jio",
                  "author": "PlayingDoomOnAGPS",
                  "body": "I wanted a Nest back in the day but as soon as Google bought them, I noped out, knowing what as coming. I got an Ecobee and have had no complaints.",
                  "score": 20,
                  "created_utc": 1745635853.0,
                  "replies": [
                    {
                      "id": "mp34ch1",
                      "author": "damndammit",
                      "body": "Good to know. Honestly, I’ve been looking for an excuse to leave Nest behind. We bought ours before Google got to ‘em.",
                      "score": 1,
                      "created_utc": 1745636903.0,
                      "replies": []
                    },
                    {
                      "id": "mpaeegf",
                      "author": "BLPvonBaron",
                      "body": "What ecobee have you got pls mate?",
                      "score": 1,
                      "created_utc": 1745747267.0,
                      "replies": [
                        {
                          "id": "mpcemzz",
                          "author": "PlayingDoomOnAGPS",
                          "body": "It the Ecobee 3. An older one but I've been very happy with it.",
                          "score": 1,
                          "created_utc": 1745774912.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mp3rkq6",
                      "author": "myst3r10us_str4ng3r",
                      "body": "Tbf, Ecobee has plenty of room for improvement with issues that they've neglected to patch for years.",
                      "score": 1,
                      "created_utc": 1745647764.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mp4kqc0",
                  "author": "bugbugladybug",
                  "body": "I'm not buying any Google hardware again. It's nothing but trouble.",
                  "score": 2,
                  "created_utc": 1745665059.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mp22o98",
          "author": "Orangesteel",
          "body": "Exactly this. Google destroyed Nest. It’s really sad.",
          "score": 128,
          "created_utc": 1745623452.0,
          "replies": [
            {
              "id": "mp2cmhx",
              "author": "baker8491",
              "body": "Added to the long list of google products they ruin themselves",
              "score": 71,
              "created_utc": 1745626853.0,
              "replies": []
            },
            {
              "id": "mp26jmx",
              "author": "seamus_mc",
              "body": "Their security system too, its annoying.",
              "score": 21,
              "created_utc": 1745624758.0,
              "replies": []
            },
            {
              "id": "mp2qh3y",
              "author": "bottle-of-water",
              "body": "Throw Pebble on that pile. They cannot continue to get away with this!",
              "score": 22,
              "created_utc": 1745631821.0,
              "replies": [
                {
                  "id": "mp31s15",
                  "author": "PlayingDoomOnAGPS",
                  "body": "They're absolutely going to keep getting away with this. I can't even get people to quit using Google Search and Chrome despite the fact that they suck and there are better options out there.",
                  "score": 27,
                  "created_utc": 1745635940.0,
                  "replies": [
                    {
                      "id": "mp6kbdw",
                      "author": "therealhairykrishna",
                      "body": "What's the better search option though? Everything else sucks ass at actually searching, regardless of how much better they are for privacy issues.",
                      "score": 5,
                      "created_utc": 1745690256.0,
                      "replies": [
                        {
                          "id": "mp6n59e",
                          "author": "PlayingDoomOnAGPS",
                          "body": "Every search engine sucks ass at roughly the same level though. Google has absolutely no qualitative advantage any more and they pack in more and more ads as well as rank search results according to how well paid they are. Bing doesn't do as much manipulation with the rankings and Duckduckgo just gives a couple of basic keyword ads without profiling you. \n\nSEO has just ruined the traditional search engine so it's functionally nothing but basic keyword searches, while Google has turned their algorithm away from serving users and focused it completely on advertising. I use DDG and Brave search and they're fine for keyword searches.\n\nHonestly, just about the only thing these LLM AI chatbots are good for is search. With a little practice, you can quickly get them to help filter the wheat from the chaff and give clear, useful search results like Google used to. For now. The enshittification cycle will come for them too, and I expect advertisers will adapt SEO for the AI age by using their own AIs to pollute ChatGPT and Copilot results with crap too. But for now, they work pretty well as search engine replacements. I'm partial to Copilot in particular, mainly because I use it extensively for work so I'm familiar with its little quirks.",
                          "score": 1,
                          "created_utc": 1745691127.0,
                          "replies": [
                            {
                              "id": "mp6nynm",
                              "author": "therealhairykrishna",
                              "body": "My experience is that it's harder to find the information that I looking for with DDG and Bing.",
                              "score": 3,
                              "created_utc": 1745691379.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mp3qiew",
                      "author": "ShatterSide",
                      "body": "I've been fed up with Google search for a while now. I have been trying Bing at work. Sometimes try DuckDuckGo.\n\n\nWhat is your recommendation for a replacement?\n\n\nAt one point I heard about a paid one that was completely add free, but I don't remember what nor have I heard any updates.",
                      "score": 4,
                      "created_utc": 1745647179.0,
                      "replies": [
                        {
                          "id": "mp3vfdn",
                          "author": "p3dal",
                          "body": "I have the same struggle. I try to force myself to use DuckDuckGo, but it seems worse in every way.",
                          "score": 17,
                          "created_utc": 1745649912.0,
                          "replies": [
                            {
                              "id": "mp3xmai",
                              "author": "bautofdi",
                              "body": "Can’t see myself using a conservative search platform :/ stuck with Bing for now as I find it moderately better.",
                              "score": 2,
                              "created_utc": 1745651158.0,
                              "replies": []
                            },
                            {
                              "id": "mp4ciyx",
                              "author": "nagi603",
                              "body": "DDG recently started advertising AI... hopping on that bandwagon. So yeah, they are definitely not getting better.",
                              "score": 0,
                              "created_utc": 1745660179.0,
                              "replies": [
                                {
                                  "id": "mp58z6p",
                                  "author": "p3dal",
                                  "body": "I really don’t care about that much I’m talking about how it takes me longer to find what I am looking for with DDG, especially when using maps, images, or shopping.",
                                  "score": 3,
                                  "created_utc": 1745675295.0,
                                  "replies": [
                                    {
                                      "id": "mp6lzrv",
                                      "author": "nagi603",
                                      "body": "> especially when using maps, images, or shopping.\n\nHmm, do they still use basically a re-skinned bing for those? I know for text they have their own, but last I heard they still had no native capabilities for those.",
                                      "score": 1,
                                      "created_utc": 1745690768.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mp401uq",
                          "author": "5trong5tyle",
                          "body": "Ecosia or Qwant. EU tech so massively better on privacy and following regulations. Also not supporting the US trade war machine.",
                          "score": 9,
                          "created_utc": 1745652582.0,
                          "replies": [
                            {
                              "id": "mp4y5df",
                              "author": "purplegreendave",
                              "body": "Google is still the only search engine that can put a date beside results. When I'm looking for *problem with x piece of software* or *best product y value for money* I like to choose results from the last 12 months if possible not 10 years ago which could be irrelevant.\n\nThe first one to do it will make me try to switch.",
                              "score": 1,
                              "created_utc": 1745671210.0,
                              "replies": []
                            },
                            {
                              "id": "mp46ekm",
                              "author": "ShatterSide",
                              "body": "Alright, I'll look into it, thanks.\n\nI will say, I would be concerned about EU censoring policies. Sometimes I try duckduckgo to find a PDF of a book, or an ISO standard, or something that I need quickly and briefly.\n\nSome search engines more aggressively block possible copyright infringing sites.",
                              "score": 1,
                              "created_utc": 1745656402.0,
                              "replies": [
                                {
                                  "id": "mp4kx7k",
                                  "author": "Muslim_Wookie",
                                  "body": "> I will say, I would be concerned about EU censoring policies.\n\nWhat are you referring to, can you expand on this?\n\nI will be really honest with you about the root of my question, I don't really believe that there's some untoward censoring policies so I want to know what you are talking about.",
                                  "score": 2,
                                  "created_utc": 1745665161.0,
                                  "replies": [
                                    {
                                      "id": "mp4oik0",
                                      "author": "ShatterSide",
                                      "body": "Well, I suppose sometimes it's largely a feeling based in anecdotal experience, other times it's absolutely evidence based.\n\nFor similar search terms, Google and other 'big names' tend to not find what I'm looking for, for a variety of reasons (primary of course that it's not a web page selling things that I'm looking for).\n\nIf I search a document or book name or ISBN or an ISO standard with \".pdf\", for example, I am less likely to get what I need with some search engines.\n\nAdditionally, the EU more aggressively blocks sharing sites, like Libgen and torrent sites and mirrors in general.\n\nDoes this all apply automatically to search engines? No, I suppose not. But an EU based service is going to be MUCH more likely to comply with laws (or legal threats) than one situated elsewhere.\n\nI could be off-base here, and I don't claim what I say is 100% true. Just a concern / consideration as I stated above.",
                                      "score": 3,
                                      "created_utc": 1745666988.0,
                                      "replies": [
                                        {
                                          "id": "mp52kku",
                                          "author": "Muslim_Wookie",
                                          "body": "I vehemently disagree with your reasoning.\n\nI see that as a government actually doing it's job and taking care of people.\n\nIf something is blocked due to copyright and it shouldn't be, I am with you. But is that up to the government to decide on and selectively enforce? I don't think so. It should be up to the people to do their best to vote in government that makes better copyright laws, specifically ones that don't bend over for US corporate interests. Because that's the root of the problems you are describing, various international agreements in which US corporate interests are enforced on the sovereign citizens of other nations. So to me that screams of irony and hypocrisy.\n\n> If I search a document or book name or ISBN or an ISO standard with \".pdf\", for example, I am less likely to get what I need with some search engines.\n\nThis is also completely anecdotal and I would ask you to actually prove it but you will of course (and frankly I would say rightly so) say that you don't want to go to the effort to do a proper study to prove something on Reddit. Obviously though that gives me no reason to do anything other than dismiss that statement of yours as anecdotal nothing.\n\nHonestly it's incredible to me that you cite this:\n\n>No, I suppose not. But an EU based service is going to be MUCH more likely to comply with laws (or legal threats) than one situated elsewhere.\n\nCorporations SHOULD be complying with laws! This is so topsy turvy my goodness...\n\nPEOPLE UPVOTED THAT STATEMENT!!!! What in the world!!!!",
                                          "score": -1,
                                          "created_utc": 1745672945.0,
                                          "replies": [
                                            {
                                              "id": "mp86i3o",
                                              "author": "ShatterSide",
                                              "body": "First of all, I am not trying to convince anyone of anything. I expressed my concerns with my use-case.\n\nSecond, I did not complain that governments enforced copyright law or anything of the sort (although copyright law needs an overhaul in general, but that's a different story).\n\nThird, it's a slippery slope to censor and block services and freedom of speech in general. \"Think of the children\" and \"Protect the children\" are two arguments commonly used to push political idealist agendas and more dangerously censor ANY information the government doesn't want out there. Once that avenue is open, it's going to be difficult as hell to prevent abuse. You better trust the government a whole lot. In the USA, right now, there is record little trust in the government. All this has never been more relevant than it is right now.\n\nThis is the difference between treating the internet as a utility vs a service. (Or users as a customer vs as the product).\n\nMy use-case is my own. I'm not telling you how to live your life.",
                                              "score": 2,
                                              "created_utc": 1745709399.0,
                                              "replies": [
                                                {
                                                  "id": "mp9bso5",
                                                  "author": "Muslim_Wookie",
                                                  "body": "It's not a slippery slope at all. You can actually put reasonable and strong safeguards in place for it. That you use the situation in the USA to back your view here is crazy given those checks and balances have proven to be worthless. So I'd rather trust in the government and have those reasonable protections for the vulnerable of society combined with the reasonable and strong safeguards against those protections being extended to the stifling of a free society; until such time as when I can't and need to take to the streets about it. \n\nThat you ignored the point that you are complaining that EU corporations are much more likely to comply with laws than a corporation elsewhere is very concerning.",
                                                  "score": 1,
                                                  "created_utc": 1745725357.0,
                                                  "replies": [
                                                    {
                                                      "id": "mpac5r0",
                                                      "author": "ShatterSide",
                                                      "body": "Didn't mean to ignore that point, apologies.\n\n\nThe EU is often overly restrictive. It's as simple as that, really. I love Europe don't get me wrong. I think \"Europe\" has a lot to teach the rest of the work. I love the GDRP, I love how it seems generally citizens firsti think consumer protection is generally unmatched.\n\n\nI consume information. A lot. Of all types. What if my queries and searches would benefit most from not having a well behaved walled garden? Well then I'm going to go with a search engine that I would trust to provide unaltered responses.\n\n\nI didn't complain that EU corps would obey laws, but rather that I would prefer to use a service that I would expect to be less restrictive.\n\n\nLet's try an analogy. Content a government wishes to restrict is not going anywhere. There is an argument for legalizing pot, simply because then it reduces the illegal logistics behind. Less exposure to other drugs or criminals etc.\n\n\nA bit exteme of an analogy I admit. I thought about deleting it but I'll leave it.\n\n\nI would prefer the internet to be treated as a utility. I would prefer legal action be taken against indidual sites and users. I would prefer not adding useless friction and annoyance for a user.",
                                                      "score": 1,
                                                      "created_utc": 1745745814.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mpbvavb",
                      "author": "TwoToedSloths",
                      "body": "Google open sourced Pebble and let the guy that created them relaunch it...",
                      "score": 1,
                      "created_utc": 1745768991.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mp4cg4i",
                  "author": "nagi603",
                  "body": "They recently re-launched, btw:\n\nhttps://ericmigi.com/blog/introducing-two-new-pebbleos-watches/",
                  "score": 3,
                  "created_utc": 1745660129.0,
                  "replies": [
                    {
                      "id": "mp5q793",
                      "author": "bottle-of-water",
                      "body": "Yes! Im super excited about that! I took my Time Round out for the first time in years because Rebble exists.",
                      "score": 2,
                      "created_utc": 1745680930.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mp77j20",
                  "author": "TooStrangeForWeird",
                  "body": "They fucked up Fitbit too.",
                  "score": 1,
                  "created_utc": 1745697698.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mp3bagc",
              "author": "don991",
              "body": "Google: Where good products go to d̵i̵e̵ get killed.",
              "score": 6,
              "created_utc": 1745639736.0,
              "replies": []
            },
            {
              "id": "mp2ihyu",
              "author": "tjmaxal",
              "body": "They bought it. It’s like musicians that smash expensive guitars on stage. Is it a slap in the face to people that can’t afford those guitars sure but it’s their property to destroy if they want to no matter how stupid that move may be.",
              "score": -9,
              "created_utc": 1745628949.0,
              "replies": [
                {
                  "id": "mp2l9x5",
                  "author": "c0reM",
                  "body": "Eh… it’s more like smashing your fans’ guitars.\n\nI mean I know they aren’t bricking the thermostats completely. But they kind of are no longer fit for the intended purpose so…",
                  "score": 10,
                  "created_utc": 1745629945.0,
                  "replies": []
                },
                {
                  "id": "mp304j1",
                  "author": "AmNoSuperSand52",
                  "body": "The difference is the fans don’t own part of the guitar",
                  "score": 3,
                  "created_utc": 1745635327.0,
                  "replies": []
                },
                {
                  "id": "mp2x18i",
                  "author": "Some_01",
                  "body": "dazzling profit reply aback thought mysterious cable unique airport wild\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                  "score": 2,
                  "created_utc": 1745634169.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mp28r2u",
          "author": "jswitzer",
          "body": "Or stop buying products from Google because they give up supporting everything that isn't ads.",
          "score": 81,
          "created_utc": 1745625496.0,
          "replies": [
            {
              "id": "mp3hq8k",
              "author": "Foygroup",
              "body": "That’s my plan, except I bought a product from nest not google.  I also have door locks and smoke detectors from nest that will no longer be supported.\n\nNow to replace all my locks, smoke detectors, and thermostats to a company not getting bought out and subsequently dumped by a bigger company.",
              "score": 17,
              "created_utc": 1745642592.0,
              "replies": [
                {
                  "id": "mp4fdos",
                  "author": "gSTrS8XRwqIV5AUh4hwI",
                  "body": "No, the solution is to replace them with products that don't depend on \"the cloud\". Products with open protocol specifications that you can integrate with home assistant, say, where home assistant talks directly to those devices locally, via Ethernet, WiFi, zigbee, whatever, without the internet or other peoples' servers (\"the cloud\") being involved. It's better for security and privacy, too.",
                  "score": 12,
                  "created_utc": 1745661934.0,
                  "replies": [
                    {
                      "id": "mp56cb7",
                      "author": "Foygroup",
                      "body": "I agree with you, I’d rather not be dependent on the cloud for any of it.  But what products do you suggest that would cover that?  Can you suggest a brand(s) to start looking into with all the features?",
                      "score": 2,
                      "created_utc": 1745674349.0,
                      "replies": [
                        {
                          "id": "mp5hgo8",
                          "author": "gSTrS8XRwqIV5AUh4hwI",
                          "body": "Unfortunately, I have no idea, as I tend to just DIY such stuff, but that probably isn't for you.\n\nMy \"smart themostat\" is an ESP8266 with an I2C temperature sensor connected to it (maybe 3 EUR total) that feeds temperature data via WiFi to my home server which in turn is connected to the CAN bus of my heat pump and which runs software that I wrote that uses that temperature data and a bunch of other information to control the heat pump. That works great, and involves no external servers whatsoever ... but it's probably not for you if you don't know how to use a soldering iron and stuff ;-)\n\nThough I guess that home assistant might be a good starting point, they probably have a lot of information about which devices work with home assistant and whether they rely on \"the cloud\" or work via a completely local connection. It's maybe not quite plug-and-play, but should be accessible without much prior knowledge.",
                          "score": 2,
                          "created_utc": 1745678157.0,
                          "replies": [
                            {
                              "id": "mp6egoo",
                              "author": "Foygroup",
                              "body": "Thanks for the info, but I am quite handy.  We took our 80’s house gutted and redid the electrical, plumbing, HVAC, all the walls and floors down to joists and studs.  All done by my wife and I.  Currently working on the last couple rooms. Tiling the bathroom as we speak.  \n\nUnfortunately everything in the house is reliant on the cloud.  SmartThings, Nest, Google, it’s all tied together. I can solder with the best of them.  I am a telecom engineer by trade, but grew up building houses as a family business.\n\nSo nothing you mentioned is not do-able. The question is just getting it on a platform we can support long term.",
                              "score": 2,
                              "created_utc": 1745688493.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mpamfuj",
                          "author": "dovbearaaron",
                          "body": "Most everything in my home is Aqara.  All local control with no cloud.",
                          "score": 1,
                          "created_utc": 1745752026.0,
                          "replies": [
                            {
                              "id": "mpdwl3s",
                              "author": "Foygroup",
                              "body": "Thank you, I will look into that.",
                              "score": 1,
                              "created_utc": 1745791673.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mpbvh1h",
                          "author": "TwoToedSloths",
                          "body": "Just look for products that use Matter, specifically Matter over Thread.",
                          "score": 1,
                          "created_utc": 1745769044.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp7h5na",
              "author": "Riptor_25",
              "body": "Over the years I've watched so many Google ventures get axed in the worst ways possible, always resulting in users left high and dry. Also the discounts are scummy; less than 50% off newer models means they're still making a profit, and trying to strongarm users into complying. I got my nest (not affected by this), and told myself it was the last Google product I'd buy.",
              "score": 1,
              "created_utc": 1745700807.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp2lvhe",
          "author": "Worst-Lobster",
          "body": "Nah sorry best we can do is have you buy a different device and throw the old nest in the landfill. Sincerely,  Google .",
          "score": 16,
          "created_utc": 1745630163.0,
          "replies": [
            {
              "id": "mp4r7sr",
              "author": "kjlo5",
              "body": "“But we’ll give you a discount on a new Nest. Just $150 for you because you’re such a great customer.”\n\nGarbage. I just got an email that said something to the effect of that.",
              "score": 3,
              "created_utc": 1745668248.0,
              "replies": [
                {
                  "id": "mp6bwgl",
                  "author": "Worst-Lobster",
                  "body": "Oh damn , I was joking but it tracks I suppose",
                  "score": 1,
                  "created_utc": 1745687718.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mp25k8d",
          "author": "pmjm",
          "body": "Some of the hardware in those thermostats includes modules from TI, STMicro, etc, all of which would prevent Google from open-sourcing the firmware. They do publish the source for the portions of the Linux kernel and Gnu tools that they are required to.",
          "score": 7,
          "created_utc": 1745624433.0,
          "replies": [
            {
              "id": "mp9drdu",
              "author": "306bobby",
              "body": "Google has been pretty good at open sourcing device trees (see all Nexus and Pixel's within AOSP)\n\nUpdating the OS these nest thermostats run should only require the compiled blobs from the modules mentioned. You shouldn't need the source code to update how the software side functions\n\nETA: likely these old thermostats still have similarities to the new ones that would open them up to exploitation. I could see that as a definite reason for Google to keep the door shut. Don't want the latest and greatest nest to have custom firmware that prevents Google from tracking you",
              "score": 1,
              "created_utc": 1745726226.0,
              "replies": [
                {
                  "id": "mp9q8v7",
                  "author": "pmjm",
                  "body": "That's a fair point about exploits. \n\nThe counter-argument is that those exploits can be patched by the open-source community, but the counter argument to *that* is that the vast majority of people will never install, or even become aware of unofficial updates and exposing the source could do more harm than good.",
                  "score": 1,
                  "created_utc": 1745732494.0,
                  "replies": [
                    {
                      "id": "mpai467",
                      "author": "306bobby",
                      "body": "I don't mean exploits as security vulnerability, but exploit as in \"oh this model that's just released has similar hardware as this one that has its source available. I bet we can build a functional source early right now\" which would allow the nerds of the world to strip the Google from the Google from release",
                      "score": 1,
                      "created_utc": 1745749577.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mp2itik",
          "author": "Mister_Brevity",
          "body": "Then third party would be preferable to Google’s new stuff, I really doubt they’ll do it",
          "score": 3,
          "created_utc": 1745629063.0,
          "replies": []
        },
        {
          "id": "mp22xb7",
          "author": "None",
          "body": "[removed]",
          "score": 9,
          "created_utc": 1745623537.0,
          "replies": [
            {
              "id": "mp2fdkv",
              "author": "Pretagonist",
              "body": "Yeah, I get that my smart things will be talking to the cloud but I try to only buy things that also allow local control.",
              "score": 3,
              "created_utc": 1745627829.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp222rt",
          "author": "h0tel-rome0",
          "body": "How dare you not support capitalism",
          "score": 6,
          "created_utc": 1745623249.0,
          "replies": []
        },
        {
          "id": "mp2djzp",
          "author": "rararagidesu",
          "body": "Down with proprietariat! Alternative, free (as in freedom) firmware, connection to local Home Assistant instance as sole 'phoning home' form - one can always dream. Instead those devices would be trashed very soon, similarly to milions of computers not up to task of running Win11 per MS official requirements. Hint: those happily run any flavor of desktop Linux or could be cheapo low wattage home [virtualisation] server. ;)",
          "score": 7,
          "created_utc": 1745627181.0,
          "replies": []
        },
        {
          "id": "mp3lqzs",
          "author": "darkslide3000",
          "body": "There's probably a deep legal jungle of proprietary third-party code and documentation they don't have the rights to involved that makes them not even want to think about that.",
          "score": 2,
          "created_utc": 1745644594.0,
          "replies": []
        },
        {
          "id": "mp29fpe",
          "author": "timelessblur",
          "body": "Problem with opening sieving it is there is most likely a ton of code they don’t want released and still in active use on the other devices sadly.",
          "score": 2,
          "created_utc": 1745625733.0,
          "replies": []
        },
        {
          "id": "mp34eti",
          "author": "SniperPilot",
          "body": "Google: lol nah.",
          "score": 1,
          "created_utc": 1745636929.0,
          "replies": []
        },
        {
          "id": "mp3cz5b",
          "author": "bremergorst",
          "body": "But G$ can’t profit off of that\n\n![gif](giphy|3sXxyP8q2RlJoGpMn8)",
          "score": 1,
          "created_utc": 1745640464.0,
          "replies": []
        },
        {
          "id": "mp3khfv",
          "author": "Hije5",
          "body": "But then people wouldn't be inclined to buy the new shit. It's that simple.",
          "score": 1,
          "created_utc": 1745643936.0,
          "replies": []
        },
        {
          "id": "mp3me3o",
          "author": "MapPristine",
          "body": "How on earth do you imagine that poor alphabet/google are supposed to make more profit if they just allow this? It’s much better for them if you just buy new stuff. Please give them more money. \n/s",
          "score": 1,
          "created_utc": 1745644935.0,
          "replies": []
        },
        {
          "id": "mp3zarn",
          "author": "prijindal",
          "body": "But the point is not to support them so that people buy new ones. It is planned obsolescence",
          "score": 1,
          "created_utc": 1745652140.0,
          "replies": []
        },
        {
          "id": "mp41hx2",
          "author": "Hellguin",
          "body": "Nope, they want to make you buy the newer one.",
          "score": 1,
          "created_utc": 1745653442.0,
          "replies": []
        },
        {
          "id": "mp4db3t",
          "author": "Plati23",
          "body": "While I agree with you wholeheartedly… the problem is that these companies have no motivation to do things like that when they’re internationally creating the obsolescence. Their goal is to send you out to buy a new one and giving users ways to keep it with the same or better functionality flys in the face of those goals.",
          "score": 1,
          "created_utc": 1745660665.0,
          "replies": []
        },
        {
          "id": "mp4dfvc",
          "author": "f3zz3h",
          "body": "At this point it should be a legal requirement for any company selling these types of devices. Especially Google.",
          "score": 1,
          "created_utc": 1745660747.0,
          "replies": []
        },
        {
          "id": "mp4k8zh",
          "author": "Kresche",
          "body": "This would be a sick ~~EU~~ Consumer Protection mandate. Companies releasing products as closed source is fine so long as when the hardware is no longer able to sustain with a live service, all code that runs on the hardware itself must be l\nreleased within that same year of discontinuing said software service connection to the hardware. \n\nIt just solves so much heartache, pain, and waste. And creates jobs and market opportunities for those willing to use the code and step in. \n\nAf far as security, which is a real concern, the way to counter that argument is simply that obfuscation isn't a valid security method. Given this truth, it isn't much of a stretch to deem arguments formed to defend stopping the release of this code as extensions of code obfuscation. That's because the code will never be patched anyways going forward, so any claim of danger is ignoring the fact that defacto code function can be sourced manually over time by any bad actors anyways. So simply specifying a time not greater than 1 year before the code is released should be enough to technically appease that crowd anyways, after which time the real code would be released. \n\nThis does not require the online service code and it shouldn't. Just the code that is existing on the hardware, along with any extra code required to communicate with that hardware (Like secret internal keys meant to stop the change of code on the hardware by non company action, which would be a moot security point by the time such services are canceled)\n\nAm I missing anything obvious here?",
          "score": 1,
          "created_utc": 1745664798.0,
          "replies": []
        },
        {
          "id": "mp4qezc",
          "author": "LazaroFilm",
          "body": "It should be law that if you stop supporting your hardware, you have to release the source code. This would stop planned obsolescence pretty quickly.\n\nAnd if you don’t want to release it because of IP, then keep on supporting it.",
          "score": 1,
          "created_utc": 1745667879.0,
          "replies": []
        },
        {
          "id": "mp5yvq6",
          "author": "digitalphildude",
          "body": "This is the way.",
          "score": 1,
          "created_utc": 1745683654.0,
          "replies": []
        },
        {
          "id": "mp69cw1",
          "author": "TwiceInEveryMoment",
          "body": "This should be law. If companies are allowed to just brick things we paid money for, they should have to release the API.",
          "score": 1,
          "created_utc": 1745686943.0,
          "replies": []
        },
        {
          "id": "mp6bcl6",
          "author": "NewDad907",
          "body": "Liability reasons? I mean what happens if someone’s house burns down because the hacked up custom firmware caused overheating/short and burned someone’s house down? Super unlikely I know, but I could see big ass companies like Google/Allhabet being jerks and using that excuse.",
          "score": 1,
          "created_utc": 1745687550.0,
          "replies": [
            {
              "id": "mp7p8o6",
              "author": "Minionz",
              "body": "I'd liken it to modifying your phones OS with a custom firmware. The manufacturer doesn't take on liability for letting you change the os/software on the device. I think similarly if a phone/video game server etc is discontinued, they should provide the ability to self host the software to maintain the functionality. There are more than enough people with the ability to host/modify software if given the means to do so. At the end of the day a thermostat in of itself is a very basic device.",
              "score": 1,
              "created_utc": 1745703498.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp6gzv8",
          "author": "kurbycar32",
          "body": "I don't want to make the impression I'm defending Google, but they did make the stadia controller work with generic Bluetooth after killing off stadia.  So there's some precedent.",
          "score": 1,
          "created_utc": 1745689252.0,
          "replies": []
        },
        {
          "id": "mp7w8me",
          "author": "FoofieLeGoogoo",
          "body": "This should be law.",
          "score": 1,
          "created_utc": 1745705869.0,
          "replies": []
        },
        {
          "id": "mp9mbtg",
          "author": "drdildamesh",
          "body": "That's not evil enough for a company that removed \"don't do evil shit\" from its mission statement.",
          "score": 1,
          "created_utc": 1745730370.0,
          "replies": []
        },
        {
          "id": "mpd2x3k",
          "author": "WeirdSysAdmin",
          "body": "I have a first gen nest and I’ll just say that I’ll replace it with something that is already open source. Create a massive amount of people that will never buy Nest products again.",
          "score": 1,
          "created_utc": 1745782347.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp1qytf",
      "author": "ledow",
      "body": "What you need to know....\n\nCompanies don't care about your purchase after the money has been cashed out.",
      "score": 1432,
      "created_utc": 1745619434.0,
      "replies": [
        {
          "id": "mp24zps",
          "author": "BlackSecurity",
          "body": "And this is one of the reasons I prefer dumb appliances. They just work. Sure maybe I can't adjust the temperature when I'm at work, but whatever it's not a big deal anyways. Never really needed it in the past.",
          "score": 284,
          "created_utc": 1745624239.0,
          "replies": [
            {
              "id": "mp2707k",
              "author": "justaguy394",
              "body": "I bought a condo last year and it still has what looks like the original mercury thermostat from when it was built in 1976. I looked into replacing it with a smart thermostat but then I realized that nothing I bought would last 50 years, lol. So I’m keeping it for now.",
              "score": 129,
              "created_utc": 1745624910.0,
              "replies": [
                {
                  "id": "mp2edmt",
                  "author": "Careful_Middle4049",
                  "body": "I started not replacing things that aren’t broken and all of a sudden I buy nothing",
                  "score": 105,
                  "created_utc": 1745627475.0,
                  "replies": [
                    {
                      "id": "mp3u51e",
                      "author": "maxis2bored",
                      "body": "Where did you get these things? With a time machine? 😭😭😏",
                      "score": 2,
                      "created_utc": 1745649188.0,
                      "replies": [
                        {
                          "id": "mp4tea6",
                          "author": "Careful_Middle4049",
                          "body": "I will say, my threshold for something being broken is probably much higher than most. I’m still rocking an iPhone 12 Pro with a shattered back because that doesn’t affect the functionality at all.",
                          "score": 2,
                          "created_utc": 1745669216.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mp3b927",
                  "author": "Croquete_de_Pipicat",
                  "body": "One of our dumb, but digital thermostats broke a few weeks ago. The first couple of places I went to buy a replacement only had smart thermostats for the same wattage. It took me some time, but I found a good dumb replacement (though it took me a 20 minute bike ride to get it).\n\nI learnt my lesson with a Nest smoke detector that broke after 6 months of use, and eventually just became unsupported by Google.",
                  "score": 14,
                  "created_utc": 1745639719.0,
                  "replies": []
                },
                {
                  "id": "mp4j9yw",
                  "author": "RawrRRitchie",
                  "body": ">I realized that nothing I bought would last 50 years, lol\n\n\"You'd be lucky if the new one lasts 10 years\"",
                  "score": 2,
                  "created_utc": 1745664255.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mp2ozs1",
              "author": "ryohazuki224",
              "body": "Yeah, all the talk about \"smart appliances\" sound cool and all. But once support for those smart features drop off, then what?\nIts part of the plan though. Planned Obsolescence. Sell us products with smart features that require continuous support for them to work, then the company drops support after a set number of years. Ya gotta upgrade or you cant use the thing anymore.",
              "score": 26,
              "created_utc": 1745631301.0,
              "replies": [
                {
                  "id": "mp4f8dr",
                  "author": "MuscleManRyan",
                  "body": "“Your fridge and freezer will resume cooling once you’ve purchased Cyan ink for your printer! Please note that Cyan ink cartridges were discontinued over 20 years ago”",
                  "score": 10,
                  "created_utc": 1745661844.0,
                  "replies": []
                },
                {
                  "id": "mp2qg4n",
                  "author": "Brassica_prime",
                  "body": "Ltt was looking into commercial robot mop/Zamboni… $70k, \n\nso why does it need the cloud? \n\n—company, to save the movement data. \n\nCan i store it locally in case you decide to turn off the service in two years?\n\n— no.\n\nGtfo then\n\nAnd the company doesnt exist 3 years later and its (im assuming) garbage super roomba",
                  "score": 18,
                  "created_utc": 1745631812.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mp27aul",
              "author": "SloppyCheeks",
              "body": "You can also set up \"smart\" devices for home automation locally. Granted, it's a lot more effort, especially if you're learning as you go, but it's the only way I'd invest in home automation. You cannot trust these companies with your privacy or long-term usability of their devices.",
              "score": 12,
              "created_utc": 1745625009.0,
              "replies": []
            },
            {
              "id": "mp2tbn2",
              "author": "None",
              "body": "[deleted]",
              "score": 14,
              "created_utc": 1745632824.0,
              "replies": [
                {
                  "id": "mp2xnbw",
                  "author": "Testing123YouHearMe",
                  "body": "How long is long term to you? Most of these thermostats are over 10 years old\n\nAverage furnaces are about 15 years old",
                  "score": 6,
                  "created_utc": 1745634397.0,
                  "replies": [
                    {
                      "id": "mp36nsp",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 0,
                      "created_utc": 1745637826.0,
                      "replies": [
                        {
                          "id": "mp3fq38",
                          "author": "Testing123YouHearMe",
                          "body": "That's exactly what's happening if you read the article",
                          "score": 6,
                          "created_utc": 1745641682.0,
                          "replies": []
                        },
                        {
                          "id": "mp48rbj",
                          "author": "Pavotine",
                          "body": "I bring you Beaplumber and an ancient Danfoss thermostat. \n\nhttps://youtube.com/shorts/Vv3c8ILSycI?si=1coAOBWxJ-zICfWP",
                          "score": 2,
                          "created_utc": 1745657830.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp3e11o",
              "author": "Dull_Bid6002",
              "body": "I thought this too. Then I saw how much it saved on the electric bill. Pays for itself within a few months. \n\n\nI'd argue it's one of the only useful smart home tech things.",
              "score": 3,
              "created_utc": 1745640927.0,
              "replies": [
                {
                  "id": "mp499q6",
                  "author": "MachinaThatGoesBing",
                  "body": "The ability to have it automatically recognize when nobody's home and switch into a power saving mode *is* a pretty great feature on its own.",
                  "score": 2,
                  "created_utc": 1745658138.0,
                  "replies": [
                    {
                      "id": "mp4a329",
                      "author": "Volesprit31",
                      "body": "I had to block this ability as it cutting the heat off during my long gaming sessions.",
                      "score": 1,
                      "created_utc": 1745658639.0,
                      "replies": [
                        {
                          "id": "mp4mvjn",
                          "author": "MachinaThatGoesBing",
                          "body": "It uses the presence of your phone (at least the way we have it set up). Perhaps you were just using the \"presence sensor\" on the device itself.",
                          "score": 2,
                          "created_utc": 1745666180.0,
                          "replies": [
                            {
                              "id": "mp4ruky",
                              "author": "Volesprit31",
                              "body": "Yes that's what I was doing. Back then I thought enabling location on my phone drained the battery so I never had it on.",
                              "score": 1,
                              "created_utc": 1745668532.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp33qz9",
              "author": "Jeremypsp",
              "body": "This is why even with smart devices, make sure they function normally by it's own and not fully reliant on app control",
              "score": 1,
              "created_utc": 1745636671.0,
              "replies": []
            },
            {
              "id": "mp3oyl8",
              "author": "zack6595",
              "body": "i mean in that case you'd be perfectly happy with the Nest Gen 1 or Gen 2 since that's what they're turning into...",
              "score": 1,
              "created_utc": 1745646337.0,
              "replies": []
            },
            {
              "id": "mp4t4gk",
              "author": "ElaineV",
              "body": "A “dumb” thermostat almost killed my pets when I was a kid. Actually it did kill some. The house got too hot and the pets (small rodents) overheated/ got heat stroke. It was horrible and tragic.",
              "score": 1,
              "created_utc": 1745669096.0,
              "replies": []
            },
            {
              "id": "mp9ek0i",
              "author": "306bobby",
              "body": "I have no issues with smart applications even, as long as I'm not reliant on the company whatsoever after purchase. \n\nIf it's built for something like HA and never needs to call home to function, I'm all for it. Too bad such a thing is hard to come by these days",
              "score": 1,
              "created_utc": 1745726592.0,
              "replies": []
            },
            {
              "id": "mpai5px",
              "author": "system3601",
              "body": "You are 1000% correct. This is a great sign for over complicating simple things and then dumping support.",
              "score": 1,
              "created_utc": 1745749602.0,
              "replies": []
            },
            {
              "id": "mpajg8u",
              "author": "asbestosmilk",
              "body": "I’m usually a dumb home appliance advocate, but I got a smart thermostat last year basically for free from my power company, and it’s really nice when you’re bed.\n\nCan’t fall asleep because it’s too hot/cold? \n\nWake up in the middle of the night hot/cold?\n\nDon’t get out of bed, just grab your phone and adjust the temperature.",
              "score": 1,
              "created_utc": 1745750367.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp2h8wb",
          "author": "kurotech",
          "body": "Unless it's a subscription service then they only care as long as they don't have to invest more money into it and they don't drop a new product line and then here we go again",
          "score": 3,
          "created_utc": 1745628505.0,
          "replies": []
        },
        {
          "id": "mp1s156",
          "author": "saberkiwi",
          "body": "I always loathe this sort of conclusion toward planned obsolescence. Cyber security needs change continually after a physical item ships. It’s not possible — I don’t mean feasible under the iron thumb of ruthless capitalism, I mean possible — update obsolete tech indefinitely. Every new model release would necessitate commitment to support and integrate with those changing cyber security needs. \n\nIt doesn’t scale. It can’t, it never has, and it never could. \n\nBut we whine anyway because screw the company, I guess. \n\nI get it, I do: I’m as anti-big-corp as the next fella, but there’s also a reasonable and apprehensible logic behind why old tech is no longer allowed to connect to the pretty main server of things.",
          "score": 27,
          "created_utc": 1745619797.0,
          "replies": [
            {
              "id": "mp1tskt",
              "author": "TellinStories",
              "body": "That’s a fair point, but the corrollary is that companies should therefore be explicit with potential consumers the minimum time they can expect the item to be supported for.",
              "score": 108,
              "created_utc": 1745620404.0,
              "replies": [
                {
                  "id": "mp1vgjm",
                  "author": "saberkiwi",
                  "body": "Can you think of a feasible way for a company to forecast the pacing of cyber security changes, or even their own innovation and roadmaps? No company that I know of launched a product while knowing its sunset date. Most launches aren’t even ready for the market, just tossed out there and patched like the dickens for a while.",
                  "score": -41,
                  "created_utc": 1745620982.0,
                  "replies": [
                    {
                      "id": "mp1x7bu",
                      "author": "Finnman1983",
                      "body": "They do this with smartphones already.  They may not be able to perfectly forecast, but they can set a reasonable maximum to set consumer expectations.  Also provide a more modular interface to replace products on the wall that doesn't require an electrician or some comfort with wiring in the home.  Could there not be a local server solution?  literally just a device in a closed environment over LAN/Wifi that continue to operate automated functions \"globally\" across devices in the home at the user's own risk/discretion?\n\nDo the benefits of smart devices outweigh the mounting issues of consumerism, trash, pollution etc.?\n\nI say that as someone who upgrades his mobile device often so I'm not claiming to be perfect.  But at least with a mobile device, I can continue to use many of it's basic or even web based functions, long past any security support.",
                      "score": 42,
                      "created_utc": 1745621586.0,
                      "replies": []
                    },
                    {
                      "id": "mp1xcvv",
                      "author": "NorysStorys",
                      "body": "I mean having a planned EoL is very common in the tech space, Microsoft for example gives ample years notice for an ending of support for a windows version so it’s not beyond the scope of something like nest planning a final support year from inception of the product, they just don’t because most consumers won’t buy a thermostat with a 10 year lifespan.",
                      "score": 25,
                      "created_utc": 1745621639.0,
                      "replies": []
                    },
                    {
                      "id": "mp20mnu",
                      "author": "ObviousPseudonym7115",
                      "body": "Almost all mature products for enterprise provide exactly those timelines. It's the norm. It just not pervasive outside of that space and hasn't yet been legally mandated for consumer products.\n\nProviding a strict guarantee can be a hard ask for young, precarious startups but can be overcome\nby being returning to more conservative engineering and business practices and giving up on the \"move fast and break things\" mentality that involves \"throwing things over the fence and crossing your fingers\". That's a pretty recent business strategy, not a universal one, and while it drove a boom in innovation during a flush economy, a market full of expiring garbage does not really hold up once consumers are financially strapped and care about durability, repairability, and predictable expenses.",
                      "score": 11,
                      "created_utc": 1745622758.0,
                      "replies": []
                    },
                    {
                      "id": "mp20pue",
                      "author": "OcotilloWells",
                      "body": "They are certainly not forthcoming that it will definitely have a sunset date at some point in the future though.",
                      "score": 3,
                      "created_utc": 1745622788.0,
                      "replies": []
                    },
                    {
                      "id": "mp2omzc",
                      "author": "Marston_vc",
                      "body": "I think the industry is mature enough at this point to have a pretty good idea of when they’ll be sunsetting products like this. \n\nEspecially with smart appliances like this where the company is no longer putting out the best product they can, but rather, a purposefully “nerfed” product that they know they can release a “better” version of next year with the smallest technical improvement. \n\nApple is infamous with this. Google, Amazon and other tech companies are no better with their own appliances.",
                      "score": 2,
                      "created_utc": 1745631172.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp1uewo",
              "author": "CompromisedToolchain",
              "body": "That’s why you don’t try to solve the problem **for all of technology products that exist**, you just focus on your products. \n\nThis is a huge design failure. If you can’t update a smart device when it’s running your own firmware and is constantly online then it’s a **you problem**, as many products design around these issues.\n\nEEPROM is incredibly cheap. Sensors are stupid cheap. OTA updates already are a feature, so yeah this is a huge miss.\n\nNest could’ve planned for this, but instead they wanted to get to market as soon as possible. Now we have a bunch of garbage and they have our money. \n\nFool me once…",
              "score": 53,
              "created_utc": 1745620619.0,
              "replies": []
            },
            {
              "id": "mp1wuv0",
              "author": "NorysStorys",
              "body": "I absolutely agree with you but you would think support would last for at least a reasonable amount of time as well, a decade or so is not long for a thermostat all things considered.",
              "score": 9,
              "created_utc": 1745621467.0,
              "replies": [
                {
                  "id": "mp2c4sc",
                  "author": "paaaaatrick",
                  "body": "Well then I have good news for you, these will still function as thermostats",
                  "score": 1,
                  "created_utc": 1745626680.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mp27dj9",
              "author": "AEternal1",
              "body": "How about standardized systems, that only have customer access, wherever they want? Absolutely no need for corporations to always keep their nose in my hardware. A hacker isn't going to much care about a local micro server for my home. They only care because they can target big corporations servers. Get my data off their servers, and I'm sure I'll be just fine with community supported systems.",
              "score": 8,
              "created_utc": 1745625034.0,
              "replies": [
                {
                  "id": "mp2rda8",
                  "author": "Brassica_prime",
                  "body": "If the corporate overlords cant see that you are using it how will they know you didnt buy it and leave it in the box! \n\nPhoning home ticks me off, why do i need to use my toaster outside of my own wifi… camera sure, 99% of everything else… i dont need it on the other side of town.  If you leave town and keep lights on, thats on you",
                  "score": 5,
                  "created_utc": 1745632129.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mp1zj2o",
              "author": "ObviousPseudonym7115",
              "body": "Another thing that doesn't scale is everyone finding themselves on a hundred different perpetual replacement treadmills driven by manufacturers' arbitrary post-purchase decisions.\n\nIt would completely reasonable to require manufacturers to either announce and guarantee a specific end of life date prior to purchase, or guarantee that they have appropriate licenses and processes in place to make their software open source prior to a commercial end-of-life.\n\nWe don't have that yet because we struggle to exercise any kind of political capital against industry these days, but like the adjacent \"right to repair\" we're likely to see that kind of legal framework start forming sooner than later because the way things are right now is not sustainable.",
              "score": 6,
              "created_utc": 1745622385.0,
              "replies": []
            },
            {
              "id": "mp1ucin",
              "author": "smbrgr",
              "body": "I mean this is just a lack of imagination on your part. It is absolutely a solvable problem to keep people’s tech up & running in most instances but there’s been little R&D in that direction because obsolescence is profitable.",
              "score": 19,
              "created_utc": 1745620596.0,
              "replies": [
                {
                  "id": "mp1xypr",
                  "author": "NorysStorys",
                  "body": "That and people won’t buy a thermostat with a known lifespan. It’s the kind of thing in a joke you install and forget about it for decades until it finally dies and some of the earlier dumb thermostats are remarkably simple and ingenious things, hell I’m almost certain there are some incredibly early gen thermostats out there ticking along as they did when they were installed.",
                  "score": 16,
                  "created_utc": 1745621847.0,
                  "replies": [
                    {
                      "id": "mp3gagz",
                      "author": "upsidedownshaggy",
                      "body": "My first apartment that I had 3 years ago now still had a functioning mercury thermostat that had a little manufacturing stamp on it with a date from 1992 so yeah there’s def plenty of old thermostats still happily ticking along out there",
                      "score": 1,
                      "created_utc": 1745641938.0,
                      "replies": []
                    },
                    {
                      "id": "mp57yfo",
                      "author": "L0nz",
                      "body": "Except these thermostats will continue to work just fine as a normal thermostat, they're only turning off the online features. I don't think that's too unreasonable for a 14 yr old device",
                      "score": 1,
                      "created_utc": 1745674935.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mp1w0wo",
                  "author": "saberkiwi",
                  "body": "While I agree obsolescence is profitable in many industries, the turnover and loss from sunsetting hardware or software is not zero.\n\nFor Google to keep developing Nests, they need to continue to earn revenue from the product. How do you propose they fund R&D?",
                  "score": -8,
                  "created_utc": 1745621177.0,
                  "replies": [
                    {
                      "id": "mp1yhf5",
                      "author": "NorysStorys",
                      "body": "Anyone buying a google product is almost doing this to themselves, google is a graveyard of abandoned and forgotten tech and unsupported software and often are far far worse than their rivals for that habit. Google+, Stadia, phones that are not even that old just to name a few.",
                      "score": 16,
                      "created_utc": 1745622026.0,
                      "replies": [
                        {
                          "id": "mp20dvn",
                          "author": "Finnman1983",
                          "body": "Guilty. 😭",
                          "score": -1,
                          "created_utc": 1745622678.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp27krn",
              "author": "Theletterkay",
              "body": "Dont charge shit tons of money for something that will be outdated so quickly. Especially when its something as vital as running AC and Heat.",
              "score": 5,
              "created_utc": 1745625101.0,
              "replies": []
            },
            {
              "id": "mp20pnt",
              "author": "lorarc",
              "body": "There is no reason why old tech can't connect to the \"pretty main server\". You just have to keep an endpoint alive which is not that expensive to update. It's not a security issue on that part.\n\nThough of course tech won't be working forever, even if you try your best without updates sooner or later something like expired root certificate will get you.",
              "score": 3,
              "created_utc": 1745622786.0,
              "replies": [
                {
                  "id": "mp3r36m",
                  "author": "ArdiMaster",
                  "body": "It can absolutely be a security issue if the API itself turns out to have a design flaw.",
                  "score": 1,
                  "created_utc": 1745647496.0,
                  "replies": [
                    {
                      "id": "mp4f7mw",
                      "author": "lorarc",
                      "body": "Well, it certainly can't be a threat to the server. It could be risk of leaking the credentials but that stays after disconnecting the API and could be mitigated.",
                      "score": 1,
                      "created_utc": 1745661831.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp4hxxa",
              "author": "gSTrS8XRwqIV5AUh4hwI",
              "body": "> Cyber security needs change continually after a physical item ships.\n\nThat is sort-of bullshit. For one, it's not a law of nature that software in devices must have vulnerabilities. A lot of that is just the result of bad software development practices that businesses have no incentive to fix because they can use the vulnerabilities to sell support and updates and replacements.\n\n> It’s not possible — I don’t mean feasible under the iron thumb of ruthless capitalism, I mean possible — update obsolete tech indefinitely.\n\nThat is pretty much bullshit, too. I mean, maybe not indefinitely, but certainly much longer than they do. So, 30 years would be perfectly possible, and would be close enough to indefinitely in practice for many products.\n\n>  Every new model release would necessitate commitment to support and integrate with those changing cyber security needs. \n\nThere are no \"changing cyber security needs\". More precisely: Most vulnerability fixes are just fixes of broken code or hard-coded credentials. Those were vulnerabilities when the product was released, not the result of some \"changing need\". The one big area where that might not be quite true is crypography, where faults in protocols or primitives get discovered and thus those need to be replaced. However, for one, that field has matured a lot, and the current generation of protocols and primitives can generally be considered pretty reliable. But also, it's just software, and software that is generally not particularly specific to the respective hardware, so it's not really that hard to update anyway.\n\nThe major shift in that area was the shift away from clear text communication to encryption, which required more processing power in devices to handle, and thus couldn't really be done with an update. But for one one could argue that manufacturers dragged their feet on that, so we could have had that much earlier, instead of needing to replace everything, but more importantly: That is behind us. All new devices do have the processing power. So, changng details of the cryptography used is much more feasible.\n\nBut also, part of the solution here, too, is local control. If your device only talks to your local home assistant instance, then cyber security is much less critical than if it directly talks to the public internet. And it's better for privacy. And the product can't be obsoleted by the manufacturer switching off their server. And it's much easier to apply security updates for home assistant, should those be necessary.",
              "score": 1,
              "created_utc": 1745663482.0,
              "replies": []
            },
            {
              "id": "mp9fo7g",
              "author": "306bobby",
              "body": "I disagree\n\nThe product should be able to connect to a local endpoint, such as HA. \n\nIt can turn off all cloud access for the reasons you describe, and enable some sort of ufw rule to block all traffic except the one server you select locally (if any, else it's just a dumb device)\n\nThat way, the option still exists to have a smart feature set without relying on the company whatsoever\n\n\nThere are products designed like that from the beginning with no obsolescence worries whatsoever besides software support within things like Home Assistant",
              "score": 1,
              "created_utc": 1745727107.0,
              "replies": []
            },
            {
              "id": "mp1sebi",
              "author": "ledow",
              "body": "Give people a subscription to security updates then.",
              "score": 0,
              "created_utc": 1745619920.0,
              "replies": [
                {
                  "id": "mp1vien",
                  "author": "saberkiwi",
                  "body": "Security updates eventually require more from the hardware than can be supported.",
                  "score": 1,
                  "created_utc": 1745621000.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mp1seqf",
              "author": "dldietlin",
              "body": "Thank you!",
              "score": 1,
              "created_utc": 1745619924.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp23u05",
          "author": "McFizzlechest",
          "body": "Gen 1 and Gen 2 launched 14 and 13 years ago. That’s an eternity for tech products. If Google is going to offer deep discount coupons for those owners to upgrade, I’d be all over that.",
          "score": 5,
          "created_utc": 1745623846.0,
          "replies": [
            {
              "id": "mp2di5m",
              "author": "CosmicCreeperz",
              "body": "Launched but not discontinued.  It only matters when the last new one was sold.\n\nAlso, this isn’t a phone, it’s a device installed on a wall in your home.  You don’t compete with Honeywell by calling a 10 year old thermostat obsolete and unsupported.",
              "score": 27,
              "created_utc": 1745627164.0,
              "replies": []
            },
            {
              "id": "mp2cmx6",
              "author": "McDanger",
              "body": "They are offering the 4th gen for \"CAD 219.99 (MSRP CAD 379.99).\"\n \nI installed my Gen 2 Nest  three months ago. I got it for free, but I'm still annoyed.\n\n I won't be forking out $220 for something they can kill in another couple years.",
              "score": 11,
              "created_utc": 1745626857.0,
              "replies": []
            },
            {
              "id": "mp35chx",
              "author": "RegulatoryCapture",
              "body": "Has Honeywell ever stopped supporting a functioning product?\n\nBecause that’s who they are competing with in this space. Honeywell may be well behind on the UI and smart features, but you know that shit is going to last forever and you’ll be able to call them (or you hvac guy can call them) about 20 year old products and get an answer. \n\nThermostats don’t last forever, but there’s a pretty big difference between “the relay died” or “the screen cracked” and “the company decided they didn’t want them to work anymore. ",
              "score": 3,
              "created_utc": 1745637297.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp1yrfo",
          "author": "HarvesterConrad",
          "body": "Small tangent. I was looking for some cheap front and back door cameras that 1) didn’t require a sub and 2) didn’t upload to the cloud. Blink does this but you have to buy a base station AND your own storage AND it costs more than the cameras while limiting some functionality….the thing that really pissed me off is that the storage can’t be greater than like 2gigs. WHY!",
          "score": 1,
          "created_utc": 1745622122.0,
          "replies": [
            {
              "id": "mp2k5aa",
              "author": "crzytech1",
              "body": "Wyze Cam V3 doesn't require a paid sub if you use an SD card. They're still around new.\n\nThe newer ones need a sub though.  Definitely do some reading before you buy.",
              "score": 2,
              "created_utc": 1745629540.0,
              "replies": []
            },
            {
              "id": "mp2wvi4",
              "author": "ishboo3002",
              "body": "Check out reolink. Fully local can either record to an SD card in the camera or to a hub.",
              "score": 2,
              "created_utc": 1745634111.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp2wzm7",
          "author": "whutupmydude",
          "body": "I just set my temp to be at 72 degrees 24/7 for my heat pump and I stopped caring - it either heats or cools to that temp. Controlling it on my way home after a trip where I had turned it down or off is the only thing I feel like I lose by not having one.",
          "score": 1,
          "created_utc": 1745634153.0,
          "replies": []
        },
        {
          "id": "mp57xaw",
          "author": "Ghozer",
          "body": "But not really...\n\n\"They will not break at a fundamental level, though. Google is not “bricking” them. You’ll still be able to change your home’s climate by turning the dial manually or accessing the remaining functions on the device itself,\"\n\nfrom the article, it's only the 'connected' stuff (via google cloud) that wont work...",
          "score": 1,
          "created_utc": 1745674924.0,
          "replies": [
            {
              "id": "mp6b4l5",
              "author": "ledow",
              "body": "There's little point in having a \"connected\" thermostat that is later just a.... thermostat.",
              "score": 1,
              "created_utc": 1745687483.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp5gtd6",
          "author": "slayer_of_idiots",
          "body": "To be fair, it Google had said this model will only connect to their cloud for 10 years when I bought it, I probably would have still done it.",
          "score": 1,
          "created_utc": 1745677947.0,
          "replies": []
        },
        {
          "id": "mp1u890",
          "author": "sexaddic",
          "body": "It’s 14 years old.",
          "score": -12,
          "created_utc": 1745620556.0,
          "replies": [
            {
              "id": "mp1uzd7",
              "author": "ledow",
              "body": "So?\n\nIt's still removing working features from a working device from a still operational company.",
              "score": 13,
              "created_utc": 1745620817.0,
              "replies": [
                {
                  "id": "mp1v9dv",
                  "author": "ledow",
                  "body": "Also... it's a fucking thermostat.  Kind of integral part of people's homes.",
                  "score": 12,
                  "created_utc": 1745620913.0,
                  "replies": [
                    {
                      "id": "mp21cy1",
                      "author": "thetalkingcure",
                      "body": "it still works, and will continue to work. it just won’t be able to connect to the app",
                      "score": 1,
                      "created_utc": 1745623005.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mp1vu96",
                  "author": "sexaddic",
                  "body": "It requires resources dedicated to supporting and securing a 14 year old product. Resources that are no longer being paid for.",
                  "score": -10,
                  "created_utc": 1745621114.0,
                  "replies": [
                    {
                      "id": "mp1x155",
                      "author": "shamsway",
                      "body": "You’re absolutely correct. I don’t love it but it makes sense, and they’re offering ~50% discount on newer thermostats.",
                      "score": -2,
                      "created_utc": 1745621527.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp1za4r",
              "author": "NorysStorys",
              "body": "And some people have dumb thermostats that have been ticking away for 50 years. 14 years is not long in a home appliance. A Refrigerator, washing machine or an oven can be repaired for decades (many companies won’t do it because they would rather you just bought a new one). Essentially they wanted into the home appliance market but are not prepared to give the kind of support and technical access that would typically come with.",
              "score": 8,
              "created_utc": 1745622300.0,
              "replies": [
                {
                  "id": "mp214d8",
                  "author": "sexaddic",
                  "body": "And this one is no different. It will work dumb.",
                  "score": 0,
                  "created_utc": 1745622925.0,
                  "replies": [
                    {
                      "id": "mp26uxt",
                      "author": "gmmxle",
                      "body": "Yes, it's different: it loses features.\n\nIn contrast to that, a fifty year old refrigerator that still works still has all its original features.\n\nYour argument is equivalent to saying that a fridge that no longer cools isn't losing functionality because you still have the option of putting a fresh, huge ice block in every other day and it will still keep things cool.",
                      "score": 3,
                      "created_utc": 1745624861.0,
                      "replies": [
                        {
                          "id": "mp276ol",
                          "author": "sexaddic",
                          "body": "It’s a change in how technology works. It’s unreasonable and ignorant to expect a IoT product to be supported past 14 years",
                          "score": 0,
                          "created_utc": 1745624970.0,
                          "replies": [
                            {
                              "id": "mp2p97h",
                              "author": "gmmxle",
                              "body": "Alright.\n\nThen why did you argue that this was no different than a fifty year old fridge that was still running, if you're now arguing that it's unreasonable and ignorant to expect it run exactly as it did when purchased?",
                              "score": 1,
                              "created_utc": 1745631395.0,
                              "replies": [
                                {
                                  "id": "mp2qf9q",
                                  "author": "sexaddic",
                                  "body": "I didn’t argue that. I argued that the functionality of the 50 year old thermostat and the 14 year thermostat are no different anymore. They can still turn on and off the AC/heat.",
                                  "score": 1,
                                  "created_utc": 1745631803.0,
                                  "replies": [
                                    {
                                      "id": "mp2qtw3",
                                      "author": "gmmxle",
                                      "body": "But that's a bad argument, since one of those things works exactly like it did on day 1, and the other one doesn't.\n\nWhy make such a misleading argument?",
                                      "score": 2,
                                      "created_utc": 1745631940.0,
                                      "replies": [
                                        {
                                          "id": "mp2sn6o",
                                          "author": "sexaddic",
                                          "body": "And I’m saying that the technology is new. The smart features simply CANNOT last 50 years. That’s not how modern day technology works. There will be zero days in the hardware that will get discovered and also simply the inability to run software anymore.",
                                          "score": 1,
                                          "created_utc": 1745632579.0,
                                          "replies": [
                                            {
                                              "id": "mp4m6x9",
                                              "author": "gmmxle",
                                              "body": ">And I’m saying that the technology is new. The smart features simply CANNOT last 50 years.\n\nThat's a reasonable argument. \n\nIt's just not the argument you made earlier. \n\nI just don't get why you're so stuck on claiming that these devices still work like they did on day 1 - just \"manually\" -, when you're also claiming that it's impossible that these devices will work like they did on day 1 for more than a couple of years.\n\nThose are two mutually exclusive claims.",
                                              "score": 2,
                                              "created_utc": 1745665831.0,
                                              "replies": [
                                                {
                                                  "id": "mp4mgz0",
                                                  "author": "sexaddic",
                                                  "body": "I’m not, you’re just misinterpreting me or perhaps I’m not typing clearly. I’m not claiming they worked like day 1. I am  specifically saying that the device hasn’t lost all functionality, and still works as a dumb thermostat just like any other dumb thermostat.\n\n\nMy statement was, “And this one is no different. It will work dumb.” In response to someone saying their dumb thermostat works for 50 years.",
                                                  "score": 1,
                                                  "created_utc": 1745665973.0,
                                                  "replies": [
                                                    {
                                                      "id": "mp7fyex",
                                                      "author": "gmmxle",
                                                      "body": "Well, you made a one-line reply to a post that contained more than just a statement that dumb thermostats were still working decades later, so that may be one source of misinterpretation.\n\nBut you're also pushing back against any statement saying that these devices are losing functionality.\n\nYou're *implicitly* admitting it - by saying that it hasn't lost *all* functionality - but all of your statements are still lacking the *explicit* admission that functionality has been lost, and that that's a thing that is setting them apart from decades old devices, gadgets and appliances that still work today in exactly the same way as they did on day 1.\n\nI'm just not sure why you seem to be pushing back again that. Yeah, sure, there *may* be technical and/or economic reasons, but that doesn't change the underlying facts: customers are losing functionality.",
                                                      "score": 1,
                                                      "created_utc": 1745700424.0,
                                                      "replies": [
                                                        {
                                                          "id": "mp7ghxz",
                                                          "author": "sexaddic",
                                                          "body": "I’m confused. I’ve stated that yes it’s losing functionality and that after 14 years it’s completely reasonable.",
                                                          "score": 1,
                                                          "created_utc": 1745700598.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp21s7x",
              "author": "0nSecondThought",
              "body": "The thermostat I replaced with a nest was 50 years old and never had any features removed.",
              "score": 2,
              "created_utc": 1745623149.0,
              "replies": [
                {
                  "id": "mp22lex",
                  "author": "sexaddic",
                  "body": "This doesn’t stop it from working. It only makes it so the smart features don’t work. You can still walk up to it and change it. It’s incredibly difficult to make security updates for such old hardware. Your 50 year old thermostat wasn’t internet connected.",
                  "score": 0,
                  "created_utc": 1745623425.0,
                  "replies": [
                    {
                      "id": "mp9g2vb",
                      "author": "306bobby",
                      "body": "Yeah but it's worth didn't decrease either...\n\nThe 50 year old thermostat does what it was advertised and bought to do\n\nThe nest does not",
                      "score": 0,
                      "created_utc": 1745727298.0,
                      "replies": [
                        {
                          "id": "mp9q528",
                          "author": "sexaddic",
                          "body": "And now we’re back to ignorance of how technology works",
                          "score": 1,
                          "created_utc": 1745732436.0,
                          "replies": [
                            {
                              "id": "mpahsd0",
                              "author": "306bobby",
                              "body": "There's nothing about \"how technology works\" that forces this to happen brother\n\nGoogle couldve easily pushed an EOL update allowing you to connect to a local instance of something like Home Assistant and disable all cloud access.\n\nNow security is not an issue, as the thermostat is communicating to a server on the local network only, and that server is what will connect to the Internet. And sure, the tech illiterate who don't know/care will still see it as a dumb thermostat, but at least it won't be ewaste to those with perfectly accessible homelabs",
                              "score": 1,
                              "created_utc": 1745749379.0,
                              "replies": [
                                {
                                  "id": "mpat74g",
                                  "author": "sexaddic",
                                  "body": "Under what standard? The devices don’t support matter and it would take a team to rewrite the firmware for these devices. Multiple revisions, multiple tests, multiple hours. Or offer a 50% discount and say buy a new one that’s longer term supported.",
                                  "score": 1,
                                  "created_utc": 1745755408.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp20epk",
              "author": "Ruttagger",
              "body": "The thermostat at my grandparents house is 85 years old, still works perfectly.",
              "score": 0,
              "created_utc": 1745622686.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mp1rjo0",
      "author": "Ruttagger",
      "body": "They offered me a discount on a new Nest, I told customer support I will be switching to a different product.\n\nStop supporting my gen 1 nest thermostat, thats fine, but making it so the app will no longer control it is crazy.  They are actively stopping it, just leave me alone, this thermostat should last my lifetime.",
      "score": 644,
      "created_utc": 1745619631.0,
      "replies": [
        {
          "id": "mp2at4b",
          "author": "InvincibleAlex",
          "body": "I used to be a big supporter of Nest products before they were bought by Google. Back then, they would send me a new camera for free to replace one that they stopped supporting. Then about 2 years ago, Google stopped supporting my Nest cameras with an offer to replace only one of them for free. Ever since then, I’ve been hopping off the Google train. I am switching over to Ecobee.",
          "score": 176,
          "created_utc": 1745626213.0,
          "replies": [
            {
              "id": "mp2ugqz",
              "author": "SrslyCmmon",
              "body": "They had VC money then, they could be generous. They were cultivating a brand so they could sell it off and go retire with their millions.",
              "score": 76,
              "created_utc": 1745633228.0,
              "replies": [
                {
                  "id": "mp32tg7",
                  "author": "PlayingDoomOnAGPS",
                  "body": "This right here. I'm increasingly reluctant to try new tech stuff because I know they're just burning VC cash to get big enough to sell to Google or Amazon and then the enshittification will proceed without delay. Why even bother getting invested when I know how it's going to end?",
                  "score": 47,
                  "created_utc": 1745636324.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mp3i0vh",
              "author": "PrepperBoi",
              "body": "I left my nest at my old rental so my brother kept it connected, never bought another one. \n\nIt did save some money, but it was also expensive af",
              "score": 4,
              "created_utc": 1745642731.0,
              "replies": []
            },
            {
              "id": "mp6s5a8",
              "author": "jenorama_CA",
              "body": "I worked at Apple and several folks I knew jumped ship to work for Nest. Then they got acquired by Google. Some of those folks are back at Apple. None of them are at Google any more.",
              "score": 1,
              "created_utc": 1745692661.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp22m3h",
          "author": "unrulystowawaydotcom",
          "body": "Try to get them to give you a free one then sell it secondhand new. Bam.",
          "score": 23,
          "created_utc": 1745623431.0,
          "replies": [
            {
              "id": "mp25bic",
              "author": "Ruttagger",
              "body": "I already emailed customer support telling them they should be sending me a brand new one.\n\nSee what they say, probably ignore me, haha.",
              "score": 10,
              "created_utc": 1745624351.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp3gyhd",
          "author": "etzel1200",
          "body": "This isn’t a phone. They need 20-50 years of support. The thermostats at my parents house are almost 50 years old and they can still buy the same design.",
          "score": 11,
          "created_utc": 1745642239.0,
          "replies": [
            {
              "id": "mp3ne6o",
              "author": "Ruttagger",
              "body": "Yup, my grandparents house thermostat is 84 years old.\n\nI guess I could just use the nest as a non smart thermostat, but I spent the money so I could change the temp from my phone.",
              "score": 5,
              "created_utc": 1745645475.0,
              "replies": [
                {
                  "id": "mp3seuj",
                  "author": "Strikereleven",
                  "body": "Being that old it's probably bimetal strips and mercury switches, simple and just works.",
                  "score": 3,
                  "created_utc": 1745648224.0,
                  "replies": [
                    {
                      "id": "mp5hhhs",
                      "author": "Ruttagger",
                      "body": "Ya its not an option packed device thata for sure.\n\nThis Nest Thermostat thing isn't the first experience I've had where I'm actually starting to regress and go back to a non smart home.\n\nMy outside front house lights used to be smart, and connected to an apo, and a schedule and my router, bla bla bla.  Now they are sinole bulbs, with dawn/dusk sensors.  They turn on in the evening, and off in the morning.  Ive had zero issues with them for 5 years.",
                      "score": 1,
                      "created_utc": 1745678164.0,
                      "replies": [
                        {
                          "id": "mp5up5s",
                          "author": "Strikereleven",
                          "body": "I have my backyard lights on a christmas tree light timer, I need to adjust it about 3 times a year. I do want some dusk/dawn sensors on it. I have nightlights in my house that have light and motion sensors in them, so they only turn on when they sense movement at night.",
                          "score": 1,
                          "created_utc": 1745682340.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp62jt6",
              "author": "XcRaZeD",
              "body": "The thermostat part isn't the problem, it's the security of it. This is an inherent problem with anything connected to the internet, it needs constant maintenance.\n\nThis is no different from any other device discontinuing its service due to aged firmware that can't be updated. We accept this for phones and computers, this is no different. They can't allow you to host it locally because google doesn't own all the services being used on it.",
              "score": 1,
              "created_utc": 1745684817.0,
              "replies": [
                {
                  "id": "mp67y4i",
                  "author": "etzel1200",
                  "body": "Except it is different. It’s infrastructure and needs longer support lifecycles.",
                  "score": 1,
                  "created_utc": 1745686511.0,
                  "replies": [
                    {
                      "id": "mp6c10x",
                      "author": "XcRaZeD",
                      "body": "It isn't different. I work for a direct competitor to Nest, and we had to go through this exact same thing earlier this year. Every single person in the company wanted to support the device off of their own hardware, but it was not feasible for a myriad of technical and legal reasons.\n\nNest operates fairly similarly to us. The hardware functions very similarly as well. It's not that they don't want to support it, it's that it will become increasingly more expensive and difficult to do so, alongside an increasingly larger risk of it being a security hazard.",
                      "score": 1,
                      "created_utc": 1745687756.0,
                      "replies": [
                        {
                          "id": "mp6kuf2",
                          "author": "etzel1200",
                          "body": "Then the approach has to be rethought. Simpler, dumber devices with less programmability that don’t need as much support. \n\nIf infrastructure hardware can’t be supported in the long term, it shouldn’t be made that way.",
                          "score": 2,
                          "created_utc": 1745690416.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp6wd1c",
              "author": "SupposablyAtTheZoo",
              "body": "The nests will still work though, just not via the app. All the manual functionality will still work just fine.",
              "score": 1,
              "created_utc": 1745693999.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp8xgpl",
          "author": "CappinPeanut",
          "body": "Wait, they are making it so the app will no longer control it!!? I thought they were just going to stop rolling out updates.\n\nNow that pisses me off. I actually bought a new one at Costco last month for $137 but ended up returning it after I decided “nah, mine works just fine”. Now they are gone from Costco.\n\nI’m gonna switch brands, also. That’s bullshit if they kill app support.",
          "score": 2,
          "created_utc": 1745719504.0,
          "replies": []
        },
        {
          "id": "mpofq6v",
          "author": "War32567",
          "body": "Man, that's just stingy. \n\nWhen Google did away with nest's alarm system, even if you just had the baseline one, they gave you a free nest doorbell, an ADT kit, and a year of ADT+ for free. (I was not a fan of ADT at all but that's besides the point) they gave me more in value than what I had spent on the original alarm system.",
          "score": 1,
          "created_utc": 1745942024.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp2f2n6",
      "author": "None",
      "body": "All this means is that I won’t ever buy a Google nest again.",
      "score": 76,
      "created_utc": 1745627721.0,
      "replies": [
        {
          "id": "mpsm324",
          "author": "roial_with_cheeze",
          "body": "Don't buy Google products at all as [they always discontinue them](https://killedbygoogle.com/).",
          "score": 1,
          "created_utc": 1745991609.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp1t4b9",
      "author": "DXsocko007",
      "body": "Stop buying anything made or owned by Google. They never invest into their products. They give up all the time. Get an ecobee and bee happy",
      "score": 346,
      "created_utc": 1745620171.0,
      "replies": [
        {
          "id": "mp1uwes",
          "author": "zushiba",
          "body": "Google acquired Nest is 2015, these are all the models made before Google owned Nest. So the people getting googled here are owners of non Google products, like myself who didn’t want to own a god damned Google product but still got fucked by Google anyway. \n\nI’m a little salty.",
          "score": 238,
          "created_utc": 1745620789.0,
          "replies": [
            {
              "id": "mp2059m",
              "author": "parmdhoot",
              "body": "They did the same thing with the original nest cams. About two of those cameras they were super expensive I think like $200 each.  And now they just don't work.  every company should have a plan to open source the software if they are no longer going to support it.",
              "score": 32,
              "created_utc": 1745622597.0,
              "replies": [
                {
                  "id": "mp2j24y",
                  "author": "Th3Batman86",
                  "body": "I have a nest cam that needs a new power cord. Can’t get it. Can still works but no cord from google. So have to make a random usb c to A work. Still pay them yearly for camera but they can’t get me a new cord.",
                  "score": 7,
                  "created_utc": 1745629151.0,
                  "replies": []
                },
                {
                  "id": "mp3s46k",
                  "author": "MyChickenSucks",
                  "body": "Our outdoor Nest cam must be 8-9 years old now.  Still works fine.  Nest made good hardware.  Google still kept the old Nest video software app because their garbage Home never quite worked.",
                  "score": 1,
                  "created_utc": 1745648060.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mp2b94m",
              "author": "Spanky2k",
              "body": "Yeah, and Google purposefully held back support of Apple devices, which was really frustrating for everyone that bought into the products in the first place because they were set up by former Apple engineers. We never got the promised HomeKit/Siri support that always going to be arriving 'soon'. Well, not until a few years ago and only with new products.",
              "score": 5,
              "created_utc": 1745626370.0,
              "replies": []
            },
            {
              "id": "mp2qola",
              "author": "NessieReddit",
              "body": "Same thing with Fitbit. Agh.",
              "score": 5,
              "created_utc": 1745631889.0,
              "replies": [
                {
                  "id": "mp994bm",
                  "author": "DXsocko007",
                  "body": "Yup Fitbit is just a joke now. Everyone had a fit bit. Google ruined it",
                  "score": 1,
                  "created_utc": 1745724217.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mp2a5bl",
              "author": "agentchuck",
              "body": "Man, I remember back when \"getting googled\" sounded like a positive thing. I miss the before times.",
              "score": 8,
              "created_utc": 1745625982.0,
              "replies": [
                {
                  "id": "mp46khc",
                  "author": "Evocatorum",
                  "body": "In the long long ago.",
                  "score": 3,
                  "created_utc": 1745656505.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mp2u2rm",
              "author": "c0rnfus3d",
              "body": "This right here. Google dragged us into their eco system when we purchased out of it. First my Drop Cam now Nest Thermostats, next will be my Nest Smoke detectors. Fuck Google.",
              "score": 4,
              "created_utc": 1745633089.0,
              "replies": []
            },
            {
              "id": "mp3i4b0",
              "author": "PrepperBoi",
              "body": "https://killedbygoogle.com/",
              "score": 1,
              "created_utc": 1745642776.0,
              "replies": []
            },
            {
              "id": "mqwezt3",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1746545496.0,
              "replies": [
                {
                  "id": "mqwh9ek",
                  "author": "zushiba",
                  "body": "Yup, I've been burned twice by my Nest. I was so fucking pissed when Google bought Nest and Google purposely broke Alexa support. I had to go download fucking Google Home, add the stupid fucking thing in that app then go get a new \"Alexa Skill\", add Googles stupid fucking skill then add my fucking Thermostat back. \n\nJust so I could maintain the same god damn functionality I had last week. All I want to do is turn up/down the temperature via voice command so I don't have to go upstairs to manually press a button or twist a knob. Why is that so fucking difficult!?\n\nI've always been wary of buying anything that was App controlled. I know how transient app support can be.",
                  "score": 1,
                  "created_utc": 1746546155.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mp3nbvw",
          "author": "whattareddit",
          "body": "I switched from Nest to Ecobee at a new home, and I regret it. It is honestly impressive how many things don't work as expected and have been broken as reported in reviews for ages.\n\n* \"Follow me\" does no such thing. When entering a room after a long period of inactivity, SmartSensor reports my presence fine but the thermostat makes zero adjustments.\n* Geofencing is unreliable. Other apps on my mobile device trigger fine (with the exact same radius) and I have turned off all battery optimizations and ensured permissions are fine for the Ecobee app.\n* The VOC/CO2 air quality sensor measurements have no basis in reality whatsoever. I can blow smoke into the thermostat or light a candle nearby with no measured changes, but when my house is unoccupied with nobody inside it wants me to open a window because of a sudden drop in quality? I even bought a standalone meter to see if there is any correlation between events. There is not. Ecobee is making shit up.\n* Creating custom schedules is an exercise in frustration.\n* Trying to understand how Eco+ works is an equally frustrating experience when the thermostat doesn't tell you any details why it is ignoring your schedules.\n* Their rebate program with my electric company can't verify my account for some reason and doesn't allow me to cancel the application or resubmit it, yet they email me constantly to try again. Support told me the program is full and I should try again...even though their outsourced provider running this program doesn't let me. Great job guys!\n* The official integration for SmartThings (and probably others) doesn't allow you to explicitly toggle heat or cooling modes. Only Auto.\n* The frequency of advertisements in the app has noticeably increased, which is unacceptable in ANY form when I made a one-time purchase of a thermostat.\n\nThere is plenty more. Ecobee won't fix any of it. But hey...my thermostat can play Spotify for some fucking reason?",
          "score": 16,
          "created_utc": 1745645441.0,
          "replies": []
        },
        {
          "id": "mp1v41x",
          "author": "Able-Tale7741",
          "body": "Some were purchased prior to Nest being bought by Google.  Important to remember in this scenario.",
          "score": 18,
          "created_utc": 1745620862.0,
          "replies": []
        },
        {
          "id": "mp2ee1q",
          "author": "CosmicCreeperz",
          "body": "Ecobee discontinued support on two of their older models in 2024.  They may not have the history of shitty cancellations Google does, but they sure haven’t proved they are different.",
          "score": 19,
          "created_utc": 1745627479.0,
          "replies": [
            {
              "id": "mp4nts2",
              "author": "honestbleeps",
              "body": "What are you talking about?\n\nDiscontinuing something isn't the same as making it so the app can't control it.\n\nMy ecobee, which I believe is first gen, still works fine.",
              "score": 2,
              "created_utc": 1745666655.0,
              "replies": [
                {
                  "id": "mp6frq9",
                  "author": "CosmicCreeperz",
                  "body": "Then yours isn’t one of the affected ones.  This stuff isn’t hard for anyone to look up.\n\n“Ecobee is discontinuing support for its oldest thermostats, the Smart Thermostat and Energy Management System (EMS), on July 31, 2024. These thermostats will no longer connect to Ecobee servers, receive updates, or function with features requiring server connectivity, such as weather information and smart home integrations.”",
                  "score": 3,
                  "created_utc": 1745688887.0,
                  "replies": [
                    {
                      "id": "mp6qjma",
                      "author": "pokemaster787",
                      "body": "> “Ecobee is discontinuing support for its oldest thermostats, the Smart Thermostat and Energy Management System (EMS), on July 31, 2024. These thermostats will no longer connect to Ecobee servers, receive updates, or function with features requiring server connectivity, such as weather information and smart home integrations.”\n\nDoesn't Ecobee *also* have an open API though? So you could still use the features just without going through Ecobee's servers/app. Obviously that's more work, but it's way better than just saying \"this is a brick now\"",
                      "score": 1,
                      "created_utc": 1745692166.0,
                      "replies": [
                        {
                          "id": "mp6s978",
                          "author": "CosmicCreeperz",
                          "body": "If so, that is certainly a bonus. Letting other companies or OSS projects support is (Home Assistant, Hubitat, etc) would certainly provide more goodwill and confidence than Google’s shitty policy.\n\nI doubt they’d support it via any server API so it’s not going to have any “away from home” features without rolling a REALLY custom solution with home VPN etc.",
                          "score": 1,
                          "created_utc": 1745692695.0,
                          "replies": [
                            {
                              "id": "mp6t40m",
                              "author": "pokemaster787",
                              "body": "Yeah there's an API you can access the Ecobee through on your local network, last I checked (admittedly I haven't done deep research into it, though). Would require either being in the same network for control or running a home server or VPN. \n\nNot the easiest for most consumers but leagues better than just turning off wireless connectivity entirely like Google is. Hopefully the open source community will/has come up with a simple option for users already hosting a VPN or home server.",
                              "score": 1,
                              "created_utc": 1745692962.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp53uj4",
              "author": "None",
              "body": "[deleted]",
              "score": 0,
              "created_utc": 1745673426.0,
              "replies": [
                {
                  "id": "mp6gspc",
                  "author": "CosmicCreeperz",
                  "body": "They literally say “discontinued SUPPORT” on their website.  Amazing, words can mean more than one thing!",
                  "score": 1,
                  "created_utc": 1745689192.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mp46ggy",
          "author": "CptBartender",
          "body": ">They give up all the time.\n\n[Killed by Google](http://killedbygoogle.com)",
          "score": 3,
          "created_utc": 1745656435.0,
          "replies": []
        },
        {
          "id": "mp6sh2b",
          "author": "jenorama_CA",
          "body": "We had a pre-acquisition Nest and loved it, but then they started with that “log in with your Google account” baloney. We got an Ecobee and haven’t regretted it.",
          "score": 2,
          "created_utc": 1745692763.0,
          "replies": []
        },
        {
          "id": "mp3r7uj",
          "author": "coupledcargo",
          "body": "When I bought it, it was owned by nest",
          "score": 1,
          "created_utc": 1745647566.0,
          "replies": []
        },
        {
          "id": "mp4s9ck",
          "author": "kjlo5",
          "body": "Google stopped supporting one of their products!? What a shame. I’m gonna go post this on Google Plus to make sure everybody on social media knows about this.",
          "score": 1,
          "created_utc": 1745668716.0,
          "replies": []
        },
        {
          "id": "mp20mqj",
          "author": "Ruttagger",
          "body": "Ya i saw this coming sinnce Google bought them.\n\nIm thinking about grabbing an Ecobee, they look nice.",
          "score": 0,
          "created_utc": 1745622759.0,
          "replies": [
            {
              "id": "mp2dgnl",
              "author": "MrsMiterSaw",
              "body": "Ecobees are fantastic. I put floor heating in my home, and so I have 7 of them.  Works perfectly, never had a problem, interface is simple and intuitive, and the remotes allow you to move the temp sensors around.\n\nThat is, you can tell the system to use the main thermostat temp all day, since it's in the main part of your house. But then tell it to use a remote which is upstairs at night. This means it accurately controls temp for the living room during the day and the bedrooms at night.\n\nIn our house, one room has a \"cold\" wall, so we use a remote 100% of the time, and in my bedroom I put one remote sensor on the floor directly, so it controls the floor temp instead of the air temp from 6-9am.\n\nEdit: love my ecobees... But the downvotes seem to indicate others have had problems? Please discuss. I have had no problems.\n\nOn the other hand, my mom has two nests and I find them somewhat counter intuitive to navigate when she asks me to mess with them (mainly because I only do that 1-2x a year)",
              "score": 2,
              "created_utc": 1745627149.0,
              "replies": [
                {
                  "id": "mp3o9lw",
                  "author": "whattareddit",
                  "body": "Man, I wish my Ecobee worked like this (which is **exactly** how they advertise it and how I would expect it to work). Support is no help whatsoever. I really regret migrating from Nest.",
                  "score": 3,
                  "created_utc": 1745645954.0,
                  "replies": [
                    {
                      "id": "mp3stcp",
                      "author": "MrsMiterSaw",
                      "body": "What's wrong with yours? I literally have 7.  4 run like normal, 1 with the remote as a floor heater in the morning, and two run using the remotes as sensors because the are mounted on exterior walls that are a little colder than room.\n\nThe warm up feature also works perfectly (learns how long it takes to bring the room up, and turns on ahead of time. This is pretty improtant with floor heating, because it takes  over an hour to warm up a cold room).\n\nAnd I have pulled the data to deal with one room that didn't seem to heat (there was a problem with the boiler loop in that room).\n\nI don't use the presence feature, since it takes too long to heat a room if you're waiting for it to detect an occupant.",
                      "score": 1,
                      "created_utc": 1745648447.0,
                      "replies": [
                        {
                          "id": "mp40z4x",
                          "author": "whattareddit",
                          "body": "I posted a list of grievances a little bit up in the thread, but I would honestly settle for a reliable \"follow me\" feature. I always understood that to be their killer feature which makes it sting even more.\n\nI have a simple setup: forced central air, natural gas furnace, and freshly pulled wiring with a proper C wire and no splices or janky adapters -- all servicing a single zone. All equipment is properly maintained and serviced by me and the equipment is less than 10yrs old. The house is about 1500sqft and the thermostat is located in the living room. The Zigbee SmartSensor is on the exact opposite side of the house (my bedroom) and the furthest from the equipment and thermostat. No connection issues and the sensor reliably records my motion and presence each time, albeit with a totally unacceptable cool down time that demonstrates quality engineering is not Ecobee's primary motivator.\n\nBecause this is my bedroom, I'm not in it all day. No matter the season, the temperature delta between my bedroom and the living room is between 8 to 12 degrees Fahrenheit. The Ecobee app reliably shows the differing temperatures of the sensor and thermostat. However, devoid of all common sense, the temperature physically displayed on the thermostat can be an average of these two temperature readings and not the actual temperature of the thermostat. I have an Accurite weather station right next to the thermostat, so I see it every time when Ecobee decides to intentionally gaslight any person reading the thermostat display with a temperature 6 degrees off from reality.\n\nI would expect that if I enter my bedroom after a long time of inactivity, while there is also activity in my living room, the thermostat will compensate for this and run the equipment to reach the desired temperature as measured as an average between the two. I would also expect that if I am not in the living room at all, but I'm in the bedroom, then the thermostat temperature will be ignored. It rarely works this smoothly. There is unnecessary complexity with the home/away/night modes and the ability to choose which sensors to use during each mode. Given that geofencing with their Android app is unreliable, I cannot be sure which mode the thermostat will be in at any time and which sensors will be used to determine the set temperature.\n\nI am sure I can dig into this further and develop various automations to compensate for the platform flaws...but it is kinda ridiculous to do so.",
                          "score": 1,
                          "created_utc": 1745653134.0,
                          "replies": [
                            {
                              "id": "mp5c4xx",
                              "author": "MrsMiterSaw",
                              "body": "Huh. That's crazy. Mine works perfectly well. I think thr displayed temp may be the average, but it certainly uses the remote sensor for control, especially when I use the \"floor\" sensor which routinely reads 78-80 deg when the room is still below 70.\n\nMaybe it's the presence sensors that muck it up? I also don't use the geofense (something I have found doesn't work worth shit on any platform unless I write my own apps to literally search for my phone's MAC at home).\n\nSorry to hear. I build automation and control systems for a living, and I honestly cannot understand why smart thermostats have problems.",
                              "score": 1,
                              "created_utc": 1745676391.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mp2euwh",
                  "author": "Ruttagger",
                  "body": "Sweet.  Sounds like a good product.",
                  "score": -2,
                  "created_utc": 1745627645.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mp2cve3",
          "author": "MrsMiterSaw",
          "body": "Ecobee is also a superior product. Significantly.",
          "score": 0,
          "created_utc": 1745626939.0,
          "replies": []
        },
        {
          "id": "mp4ef4n",
          "author": "CutieBoBootie",
          "body": "What is to stop Google (or amazon) from acquiring ecobee and doing the same thing currently happening to people who bought nest products pre-google?",
          "score": 0,
          "created_utc": 1745661345.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp1s72e",
      "author": "scruffles360",
      "body": "I had been putting off a switch to ecobee because nest has been “good enough” for a decade. They are now significantly worse than good enough (even new). \n\nFor the discounted price Google offered me for an upgrade I bought a top of the line ecobee through my electric company ($130 off)",
      "score": 38,
      "created_utc": 1745619852.0,
      "replies": [
        {
          "id": "mp2edh2",
          "author": "Lagulous",
          "body": "Smart choice",
          "score": 1,
          "created_utc": 1745627474.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp1vlmo",
      "author": "JJ82DMC",
      "body": "So on October 25, I need to buy an install a competitor brand. Noted...",
      "score": 99,
      "created_utc": 1745621031.0,
      "replies": [
        {
          "id": "mp1wxhp",
          "author": "EnderWiggin07",
          "body": "Check your utility's websites for smart thermostat rebates. Both gas and electric providers may offer one. Where I live i could get total $75 for sending in a fillable pdf and a copy of my receipt",
          "score": 40,
          "created_utc": 1745621492.0,
          "replies": [
            {
              "id": "mp21x80",
              "author": "sketchymidnight",
              "body": "My utility came to do an energy assessment and gave me a recently Nest model and installed it for me",
              "score": 8,
              "created_utc": 1745623197.0,
              "replies": []
            },
            {
              "id": "mp2r014",
              "author": "JJ82DMC",
              "body": "My company, without me switching it on my own, has switched 3 times in the past 3 years. The most recent switch was a month ago. I guess I'll see if my latest one (Reliant) is offering anything.\n\nThe longer I've used Google products, the more wary I've become of buying their products (aside of the Pixel). They have an absolutely atrocious habit of just randomly discontinuing products, despite how well they may be used.\n\nMy older gen Assistant speakers and Max Hub are coming-up later this year for the chopping block as well, for example.",
              "score": 2,
              "created_utc": 1745632000.0,
              "replies": [
                {
                  "id": "mp48xv3",
                  "author": "maxolotl33",
                  "body": "Wait, they're discontinuing the speakers?! Do you have a link?",
                  "score": 2,
                  "created_utc": 1745657941.0,
                  "replies": [
                    {
                      "id": "mp4ql1f",
                      "author": "JJ82DMC",
                      "body": "As far as updates for the older generations, yes. At least according to an article I read a couple of weeks ago.",
                      "score": 2,
                      "created_utc": 1745667960.0,
                      "replies": [
                        {
                          "id": "mp4rlc0",
                          "author": "maxolotl33",
                          "body": "Damn, that sucks..",
                          "score": 2,
                          "created_utc": 1745668417.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp550e6",
              "author": "nukii",
              "body": "Depending on the state, you can also just get the rebate as a discount at purchase. In Connecticut that’s true for Lowe’s and Home Depot.",
              "score": 1,
              "created_utc": 1745673857.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mp1tf1h",
      "author": "0r0B0t0",
      "body": "That’s why I got an ecobee, Apple HomeKit requires the device work without the internet.",
      "score": 147,
      "created_utc": 1745620274.0,
      "replies": [
        {
          "id": "mp2dzq2",
          "author": "CosmicCreeperz",
          "body": "Ecobee discontinued a couple of their older models in July ‘24.  They are no better apparently.\n\nI guess I’m going to have to go look at Honeywell’s latest, there are 50 year old (non WiFi, sure) thermostats in homes still going strong.",
          "score": 40,
          "created_utc": 1745627336.0,
          "replies": [
            {
              "id": "mp2pijq",
              "author": "TheAceMan",
              "body": "Well you can technically use your Google Nest thermostat for the next 50 years without wifi as well",
              "score": 22,
              "created_utc": 1745631490.0,
              "replies": [
                {
                  "id": "mp31mvs",
                  "author": "CosmicCreeperz",
                  "body": "Why would I have bothered replacing my old one if I couldn’t actually control it remotely or have it learn my habits?  That’s the only damn feature that they sold it on.",
                  "score": 6,
                  "created_utc": 1745635887.0,
                  "replies": [
                    {
                      "id": "mp56nvu",
                      "author": "AerosolHubris",
                      "body": "I think they're saying that if you're ok with a non wifi one like the Honeywell, like it sounded from your comment, then you can keep the nest.",
                      "score": 3,
                      "created_utc": 1745674466.0,
                      "replies": [
                        {
                          "id": "mp6h660",
                          "author": "CosmicCreeperz",
                          "body": "Honeywell has been making smart thermostats for years.  My point is they don’t just give up on theirs since they are the #1 brand contractors install in new homes and people just expect them to work forever.",
                          "score": 0,
                          "created_utc": 1745689304.0,
                          "replies": [
                            {
                              "id": "mp6i0yg",
                              "author": "AerosolHubris",
                              "body": "That's fair. I was just explaining what the other commenter likely misunderstood about what you said.",
                              "score": 2,
                              "created_utc": 1745689562.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mp35hst",
                  "author": "hotwheelearl",
                  "body": "My nest has never been able to connect to WiFi anyways, so I’m not really affected lol",
                  "score": 2,
                  "created_utc": 1745637356.0,
                  "replies": [
                    {
                      "id": "mp3ghpk",
                      "author": "NCSUGrad2012",
                      "body": "Is it a glitch?   Did you try returning it when you got it?",
                      "score": 1,
                      "created_utc": 1745642028.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp2r2kb",
              "author": "NetNpIVijCI",
              "body": "Do you know how old the discontinued models are? I have one ive been using for 10+ years and it's still running fine.",
              "score": 8,
              "created_utc": 1745632025.0,
              "replies": [
                {
                  "id": "mp31yy8",
                  "author": "CosmicCreeperz",
                  "body": "I think ones launched between 2008-2010 and discontinued in 2013.  But that’s about the same as Nest which launched a year or two later and is discontinued a year or two later.",
                  "score": 3,
                  "created_utc": 1745636013.0,
                  "replies": []
                },
                {
                  "id": "mp4ay88",
                  "author": "Volesprit31",
                  "body": "10 years is nothing for a thermostat.",
                  "score": 1,
                  "created_utc": 1745659173.0,
                  "replies": [
                    {
                      "id": "mp63jkt",
                      "author": "XcRaZeD",
                      "body": "It's, quiet literally, the first Smart Thermostat to ever exist. It was inevitable that it would be phased out.",
                      "score": 3,
                      "created_utc": 1745685134.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp4pmje",
              "author": "ghoulgang_",
              "body": "The honeywell T10+ is the only smart thermostat I install at my customers homes",
              "score": 2,
              "created_utc": 1745667512.0,
              "replies": []
            },
            {
              "id": "mp4qdva",
              "author": "deekster_caddy",
              "body": "I have Honeywell wifi thermostats that are around 10 years old and working great. They will always work locally as basic thermostats if there is no wifi.",
              "score": 2,
              "created_utc": 1745667865.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp1xocn",
          "author": "elMurpherino",
          "body": "Ecobee thermostats have been working well for me.",
          "score": 30,
          "created_utc": 1745621748.0,
          "replies": []
        },
        {
          "id": "mp20a52",
          "author": "hacksoncode",
          "body": "Nest thermostats, including these, work fine without the internet.",
          "score": 15,
          "created_utc": 1745622643.0,
          "replies": [
            {
              "id": "mp2e4j6",
              "author": "CosmicCreeperz",
              "body": "They will disable all WiFi in Oct so they will only controllable on the device itself.  Ie all smart features will be disabled.",
              "score": 24,
              "created_utc": 1745627385.0,
              "replies": [
                {
                  "id": "mp4390j",
                  "author": "Jean-LucBacardi",
                  "body": "Yeah but it's still a working thermostat... \n\nAm I crazy to think that a 10 year old smart device *shouldn't* be expected to have support longer than that for security reasons?  You got what you paid for and then some.  Google isn't putting out security updates anymore and doesn't want it connected to their servers because of that.  Plain and simple.  Even windows 10 is getting canned this year at 10 years old.",
                  "score": -3,
                  "created_utc": 1745654481.0,
                  "replies": [
                    {
                      "id": "mp44gs1",
                      "author": "CosmicCreeperz",
                      "body": "It really depends on the “smart” device.  IMO Installed home appliances are not have their useful features DISABLED.  I don’t care about support but for fucks sake to have a perfectly working thermostat no longer be able to be controlled by my phone or home automation is bullshit.\n\nNest’s entire selling point was that it learns your routines and is controllable from a mobile app etc.  Without that it’s no better than a thermostat from from the 1950s.\n\nAnd Windows 11 is a FREE update for Windows 10 users (not to mention it will still work… Microsoft isn’t shutting down its Internet access, so it’s a poor analogy).  If Google wants to send me a free replacement, fine.  But nowhere in my original purchase did they say “if it lasts 10 years you’re going to have it buy a new one!”  What I got out of it is subjective to me.  And no part of the calculus was planned obsolescence.",
                      "score": 2,
                      "created_utc": 1745655210.0,
                      "replies": [
                        {
                          "id": "mp45upt",
                          "author": "Jean-LucBacardi",
                          "body": "Come on let's not treat Microsoft as the nice guys in this scenario.  The vast amount of PCs out there can not upgrade to Windows 11 due to outdated hardware (which is exactly why I'm assuming Google is dropping support for these).  At least Google is giving a discount on new hardware, which is far less than Microsoft is doing for my 2017 laptop which won't even be 10 years old when support for it is dropped.",
                          "score": 2,
                          "created_utc": 1745656064.0,
                          "replies": [
                            {
                              "id": "mp46n0k",
                              "author": "CosmicCreeperz",
                              "body": "I have a perfectly decent PC that can’t be upgraded (well it can, but I have to bypass the TPM check), and I don’t particularly care for Win11.  But the update is free, and if I don’t update the only con is no more security patches.  No real functionality that I care about is lost.\n\nThat is very different from “we are removing all features from your product so it’s just a less reliable version of your last device that cold have lasted decades more.”  If Microsoft disables all Internet access on Windows 10 you’ll have a point.  Not holding my breath.\n\nBesides, PCs are a bad comparison in general.  A 10 year old PC is nearly useless to me.  My 10 year old thermostat is just as useful as the day I got it.",
                              "score": 1,
                              "created_utc": 1745656548.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp2a7k6",
              "author": "MtbJazzFan",
              "body": "But can you control them from your devices on your network without Internet?",
              "score": 12,
              "created_utc": 1745626003.0,
              "replies": [
                {
                  "id": "mp2tuwq",
                  "author": "hacksoncode",
                  "body": "No, with the physical interface.",
                  "score": 2,
                  "created_utc": 1745633013.0,
                  "replies": [
                    {
                      "id": "mp2uuoy",
                      "author": "MtbJazzFan",
                      "body": "What u/0r0B0t0 is calling out is the ecobee thermostats can be controlled from another device (like their iPhone) without the interet.",
                      "score": 1,
                      "created_utc": 1745633368.0,
                      "replies": [
                        {
                          "id": "mp2vjw1",
                          "author": "hacksoncode",
                          "body": "Fair... but all they *said* was \"Apple HomeKit requires the device work without the internet\", with no elaboration. \n\nAnd my point is, Nest thermostats, though not remote controllable without the internet, work fine without it.",
                          "score": 1,
                          "created_utc": 1745633624.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mp2ll3d",
                  "author": "drake90001",
                  "body": "Yes.",
                  "score": -2,
                  "created_utc": 1745630057.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mpavtag",
          "author": "MangoAtrocity",
          "body": "Which is *such a good requirement*. I get the Apple hate, but man they do a lot for consumer privacy.",
          "score": 2,
          "created_utc": 1745756594.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp2fofb",
      "author": "kickasstimus",
      "body": "That’s a not insignificant amount of e-waste.",
      "score": 28,
      "created_utc": 1745627937.0,
      "replies": [
        {
          "id": "mp3we9a",
          "author": "haarschmuck",
          "body": "How is it e-waste? They're only removing remote support for those devices, they will still work and function just fine as a normal thermostat.",
          "score": -6,
          "created_utc": 1745650460.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp1zard",
      "author": "IcanCwhatUsay",
      "body": "They already are dumb. They were supposed to be this awesome open sourced thermostat and ended up being consumer locked garbage. The only thing they got right is the look.",
      "score": 31,
      "created_utc": 1745622306.0,
      "replies": [
        {
          "id": "mp2xyr5",
          "author": "JohnnyWix",
          "body": "I was hoping they actually learned. Like picked up that I am home 2 days a week and adjusted the heat those days, or my wife is home during the summer so adjust times accordingly.",
          "score": 5,
          "created_utc": 1745634512.0,
          "replies": []
        },
        {
          "id": "mp3hiwf",
          "author": "ChiefStrongbones",
          "body": "I was astonished by how awful the Nest thermostats are to actually use.  I went back to a Honeywell 7-day programmable thermostat and am happy.  It doesn't have any 'smart' features which is great.  All I want is remote network access to the normal functionality of a programmable thermostat.",
          "score": 1,
          "created_utc": 1745642494.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp2h2gg",
      "author": "Reverb20",
      "body": "If you check with your energy/gas supplier, you may be able to get one for free or very discounted.",
      "score": 8,
      "created_utc": 1745628441.0,
      "replies": []
    },
    {
      "id": "mp2k6xs",
      "author": "Chr15py0696",
      "body": "My apartment complex has them. They’re so fucking annoying. Not everything needs to be a “smart” device",
      "score": 9,
      "created_utc": 1745629558.0,
      "replies": [
        {
          "id": "mp4b6o9",
          "author": "Volesprit31",
          "body": "I'ts just great when you go on holidays in winter, you can switch off the heat and put it back a few hours before coming home, so you're not in a freezing house.",
          "score": 11,
          "created_utc": 1745659319.0,
          "replies": [
            {
              "id": "mp5k6qy",
              "author": "JalapenoBiznizz",
              "body": "Yeah I’m going to miss this nice feature. I’m not paying to switch this out in a rental.",
              "score": 4,
              "created_utc": 1745679034.0,
              "replies": []
            },
            {
              "id": "mpeoemt",
              "author": "mrfuzzyshorts",
              "body": "honeywell has thermostats that do those functions.",
              "score": 1,
              "created_utc": 1745801385.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mp1wtjo",
      "author": "PocketNicks",
      "body": "Don't buy any smart devices unless you know they work with local access (no internet/cloud services). Even better if you know they work with something like Home Assistant, Hubitat etc.",
      "score": 27,
      "created_utc": 1745621454.0,
      "replies": [
        {
          "id": "mp1zu9i",
          "author": "hacksoncode",
          "body": "Nest thermostats work fine with only local access.",
          "score": 3,
          "created_utc": 1745622492.0,
          "replies": [
            {
              "id": "mp20ck5",
              "author": "PocketNicks",
              "body": "Well, I guess the title is misleading then. Since that's not \"dumb\".",
              "score": 6,
              "created_utc": 1745622666.0,
              "replies": [
                {
                  "id": "mp20vh9",
                  "author": "hacksoncode",
                  "body": "The app won't work, of course. And the learning features required cloud service, but you can set and operate them just fine with the dial.\n\nSo \"dumb\" relative to what it used to be, but still \"working with local access\".",
                  "score": 3,
                  "created_utc": 1745622843.0,
                  "replies": [
                    {
                      "id": "mp2b54r",
                      "author": "TwoBionicknees",
                      "body": "there is absolutely no reason they can't launch a final version of early models only nest app that continues the functionality but doesn't get security updates, etc. People would be fine with that. then new app supports newer models. I get not wanting to continue support for old models forever (depends on the type of device and expected lifespan for how long that should be, for a thermostat it should be like 25+ years while for a graphics card it might be like 8 years). But just have a old version of the app that lets you use it as intended but no longer gets updated, ridiculously easy solution. Removing all support from app is just so stupid.",
                      "score": 3,
                      "created_utc": 1745626332.0,
                      "replies": [
                        {
                          "id": "mp2ttks",
                          "author": "hacksoncode",
                          "body": "> But just have a old version of the app that lets you use it as intended but no longer gets updated, ridiculously easy solution. \n\nA large cloud infrastructure is involved in \"just using the app\", and patching security holes is expensive... not excusing that, but it's not that easy.",
                          "score": 4,
                          "created_utc": 1745633000.0,
                          "replies": [
                            {
                              "id": "mp2v0b0",
                              "author": "TwoBionicknees",
                              "body": "i mean you can provide 99.99% of the functionality without the cloud, that's pretty much just a gimmick to begin with. Cutting it out of a final app version for old models is trivial. Also again providing something saying this won't receive security updates but will work forever, is easy. Just commit to providing it via website/download if play/apple stores get pissy about legacy app and no security updates.",
                              "score": 2,
                              "created_utc": 1745633425.0,
                              "replies": [
                                {
                                  "id": "mp3ka1c",
                                  "author": "hacksoncode",
                                  "body": "That would be a complete rewrite on several platforms.",
                                  "score": 1,
                                  "created_utc": 1745643830.0,
                                  "replies": [
                                    {
                                      "id": "mp4ngx5",
                                      "author": "TwoBionicknees",
                                      "body": "i think you'll find much like AI today, in the past 'cloud' features were mostly buzzwords and very little was done in the cloud. These are also very very trivial applications. People liked hearing about the cloud a decade ago and thought they were getting something more advanced and most apps weren't doing shit with a cloud to begin with. Controlling your heating system is so ridiculously basic and most of those functions were baked on and controllable locally anyway. It would likely be a very very minor change, if any, and just disabling some basic attempts to make more optimal plans by comparing a few in the 'cloud'.",
                                      "score": 1,
                                      "created_utc": 1745666479.0,
                                      "replies": [
                                        {
                                          "id": "mp4xzes",
                                          "author": "hacksoncode",
                                          "body": "Yes, well... the most *basic* feature people want is controlling their thermostat with their phone and computer, and none of that is done directly. It's purely done in the cloud.",
                                          "score": 0,
                                          "created_utc": 1745671141.0,
                                          "replies": [
                                            {
                                              "id": "mp4znx7",
                                              "author": "TwoBionicknees",
                                              "body": "> It's purely done in the cloud.\n\nIf you are using the app to tell the cloud to do something, its' not being done purely by the cloud because you are telling the app to do something. The cloud is literally just passing on that same command.\n\nIt's basically a service to pass on the message, it's exceptionally trivial step to skip and the cloud is doing nothing remotely complex in the slightest here.",
                                              "score": 1,
                                              "created_utc": 1745671818.0,
                                              "replies": [
                                                {
                                                  "id": "mp50hpx",
                                                  "author": "hacksoncode",
                                                  "body": "> It's basically a service to pass on the message, it's exceptionally trivial step to skip and the cloud is doing nothing remotely complex in the slightest here.\n\nOpening an encrypted and validated channel so that no one can remotely change your temperature without your consent is \"nothing\"? \n\nIf the designers were even slightly competent, that requires a certificate that isn't provisioned to every phone and computer that's ever been used to do it.",
                                                  "score": 0,
                                                  "created_utc": 1745672144.0,
                                                  "replies": [
                                                    {
                                                      "id": "mp5127m",
                                                      "author": "TwoBionicknees",
                                                      "body": "> Opening an encrypted and validated channel so that no one can remotely change your temperature without your consent is \"nothing\"? \n\nliterally, yes. Solved and piss easy for you know, 20 years.",
                                                      "score": 2,
                                                      "created_utc": 1745672365.0,
                                                      "replies": [
                                                        {
                                                          "id": "mp51eox",
                                                          "author": "hacksoncode",
                                                          "body": "The encrypted part yes. The validated part? No, that's hard to do without a database of authorized users that... isn't on the device, at least in this case.\n\nEdit: I'm not saying it's impossible to solve this problem... just that it would require significant rewrites to the code on both the phone/computer apps and the device firmware.",
                                                          "score": 1,
                                                          "created_utc": 1745672500.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mp2160n",
                      "author": "PocketNicks",
                      "body": "I'm almost certain they work with Home Assistant, so besides the 'learning' part, everything would work fine.",
                      "score": 1,
                      "created_utc": 1745622940.0,
                      "replies": [
                        {
                          "id": "mp21stt",
                          "author": "hacksoncode",
                          "body": "From the Home Assistant web site:\n\n>This integration uses the Smart Device Management API and Google’s Cloud Pubsub to efficiently listen for changes in device state or other events.\n\nSo... if those google APIs still work for these devices, maybe. But even if not, the device still works, it's just not remotely controllable.",
                          "score": 3,
                          "created_utc": 1745623155.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mp3bt6q",
                  "author": "OneSeaworthiness7768",
                  "body": "“Smart phones” and “smart TVs” refer to devices that have WiFi and apps. They still work as phones and TVs without those. Dumb phones are just phones without apps. Dumb nest is just a regular thermostat.",
                  "score": 0,
                  "created_utc": 1745639959.0,
                  "replies": [
                    {
                      "id": "mp3c3uj",
                      "author": "PocketNicks",
                      "body": "Right, and since these Nest thermostats can continue to work without the Google cloud services, using alternative smart apps like Home Assistant, then they're not going to become dumb. So, title is misleading.",
                      "score": 0,
                      "created_utc": 1745640086.0,
                      "replies": [
                        {
                          "id": "mp3eykx",
                          "author": "OneSeaworthiness7768",
                          "body": "Your comment implied that they weren’t “dumb” if they still worked locally.\n\n> Nest thermostats work fine with only local access.\n\n> Well, I guess the title is misleading then. Since that's not \"dumb\".",
                          "score": 1,
                          "created_utc": 1745641342.0,
                          "replies": [
                            {
                              "id": "mp3f8do",
                              "author": "PocketNicks",
                              "body": "If they work locally, that means they don't depend on the google cloud to work. That means they're not dumb. If disconnecting them from their cloud service essentially bricked them or didn't allow you to use them with another app, then they'd be dumb. My comment didn't imply anything, it was very clear. They still work, so they're not dumb.",
                              "score": -2,
                              "created_utc": 1745641465.0,
                              "replies": [
                                {
                                  "id": "mp3ft8t",
                                  "author": "OneSeaworthiness7768",
                                  "body": "I think you fundamentally misunderstand the usage of the term. “Dumb” devices *still work*. That doesn’t make them not-dumb.",
                                  "score": 1,
                                  "created_utc": 1745641722.0,
                                  "replies": [
                                    {
                                      "id": "mp3g6qs",
                                      "author": "PocketNicks",
                                      "body": "Nope, a smart device typically has an app or web interface, online functionality that allows it to be controlled or to control other devices through an internet or intranet connection. These Nest devices will still be able to do that even after Google shuts down their cloud service that is how they are currently being used \"smartly\". Since they'll still be able to function the same in every way except for the 'learning' feature, they'll still be smart devices.",
                                      "score": 1,
                                      "created_utc": 1745641890.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mp1vke0",
      "author": "HillarysFloppyChode",
      "body": "For people who don't want to read, it's the Gen 1 and 2, launched in 2012. \n\nThe Gen 3, launched in 2015, that most people bought because they were bundled with rebates, are NOT affected.",
      "score": 31,
      "created_utc": 1745621019.0,
      "replies": [
        {
          "id": "mp1yqh6",
          "author": "jbuckster07",
          "body": "Yet…",
          "score": 38,
          "created_utc": 1745622112.0,
          "replies": []
        },
        {
          "id": "mp2abje",
          "author": "majerus1223",
          "body": "doesnt matter, there is nothing wrong with the hardware.",
          "score": 8,
          "created_utc": 1745626042.0,
          "replies": []
        },
        {
          "id": "mp213lf",
          "author": "LazloHollifeld",
          "body": "And they’re pulling out of Europe completely. I’m guessing that they dont want to deal with the regulatory compliance.",
          "score": 20,
          "created_utc": 1745622918.0,
          "replies": [
            {
              "id": "mp2feaw",
              "author": "HillarysFloppyChode",
              "body": "I don’t recall these being popular in Europe, I think because of the way most hvacs are set up.  I seem to remember you had to get like a stand for them.",
              "score": -6,
              "created_utc": 1745627836.0,
              "replies": [
                {
                  "id": "mp4gqvl",
                  "author": "chabybaloo",
                  "body": "In the UK the model was slightly different, it didn't have A/C control. But it could still be wired to your boiler, without using a stand. The old wiring was disconnected from the main voltage (230V) and 12v power sent down it instead via the heat link box",
                  "score": 4,
                  "created_utc": 1745662767.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mpcj71r",
          "author": "kneel23",
          "body": "Wish the app would tell me which gen it is. It Just says Display-3.6. assuming that's gen3 then",
          "score": 1,
          "created_utc": 1745776245.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp2691r",
      "author": "damndammit",
      "body": "“…receive a code giving them $130 off a Nest Learning Thermostat (Gen 4). This model, launched in 2024, currently retails for $279.99, meaning the coupon will save you about 46% off that price. That’s not bad at all!”\n\n\n-It’s all bad. \n\n\n“To make this even better, this is not a “one per customer” offer. If you own three thermostats that are now becoming obsolete, you will get a coupon code that goes towards three new thermostats.”\n\n\n- You’re not helping. \n\n\n“you gotta hand it to Google for making it as painless as possible for the end user.”\n\n\n- Not painless in any way, and don’t tell me what to do.",
      "score": 22,
      "created_utc": 1745624664.0,
      "replies": [
        {
          "id": "mp3pvu8",
          "author": "zack6595",
          "body": "Your formatting is extremely confusing. First -'s than bullet points. I couldn't even tell at first you were responding... \n\nSide note 46% off a device that's like 10-12 years more modern is actually a decent deal honestly. If I got something like that on a Ring doorbell or camera i'd be pretty happy with it. IoT devices break down it's just the reality of what you are purchasing.",
          "score": 6,
          "created_utc": 1745646841.0,
          "replies": [
            {
              "id": "mp3wf43",
              "author": "damndammit",
              "body": "I’m using the app. It does whatever it wants with formatting. I edited the weirdness out several times, only to have it revert to the slop you see there. I finally gave up. Sorry, wish I could fix it. \n\n\nThe discount is only a decent deal if you’re organically in the market for a new device. All of my thermostats are working as well today as when I bought them. It would be wasteful to replace them, and it’s galling that the manufacturer offering the discount is also choreographing their obsolescence.",
              "score": 3,
              "created_utc": 1745650474.0,
              "replies": [
                {
                  "id": "mp9gw5t",
                  "author": "306bobby",
                  "body": "Well tbf in a few months they won't be!\n\n/s",
                  "score": 1,
                  "created_utc": 1745727680.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mp20sza",
      "author": "con40",
      "body": "Google ruins every home product eventually",
      "score": 14,
      "created_utc": 1745622819.0,
      "replies": [
        {
          "id": "mp25zje",
          "author": "IPCamfootthrowaway",
          "body": "Not just home products.  They’re like the opposite of king Midas…everything they touch turns to shit.",
          "score": 12,
          "created_utc": 1745624575.0,
          "replies": [
            {
              "id": "mp33qnm",
              "author": "the_gnurd",
              "body": "Mierdes touch",
              "score": 1,
              "created_utc": 1745636668.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mp67r4z",
      "author": "adamgetoutofurchair",
      "body": "This is so weak. Fuck Google.",
      "score": 5,
      "created_utc": 1745686450.0,
      "replies": []
    },
    {
      "id": "mp2o5na",
      "author": "charpman",
      "body": "They killed the basically killed the nest app off with latest thermostat and Google home is a poor replacement. They killed off protect smoke and CO detectors, and now this.\n\nI learned my lesson. No more Google products for me and what I do have is going in the trash.\n\nNeed to regime my domain email now as well.\n\nFuck Google.",
      "score": 8,
      "created_utc": 1745630995.0,
      "replies": [
        {
          "id": "mp2pirg",
          "author": "thermalquenches",
          "body": "Fuck \"google\"",
          "score": 3,
          "created_utc": 1745631492.0,
          "replies": []
        },
        {
          "id": "mp9hcbq",
          "author": "306bobby",
          "body": "Yeah the only Google hardware I own is Pixel, and none of it runs the stock OS (only good hardware to come from Google, the Nexus and Pixel lineup, mostly due to being open sourced enough to maintain after EOL)\n\nI can't trust anything else due to the lurking [Google Graveyard](https://killedbygoogle.com/)",
          "score": 1,
          "created_utc": 1745727895.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp29k7y",
      "author": "hereisoblivion",
      "body": "This should be illegal. \nI purchased a nest thermostat about 1 year ago in a house I just sold, and planned to install 2 more in my current home. \nThis guarantees I will not be doing that.....",
      "score": 15,
      "created_utc": 1745625776.0,
      "replies": [
        {
          "id": "mp3w7xs",
          "author": "haarschmuck",
          "body": "> This should be illegal.\n\nSo.... companies should be legally forced to support a product forever?\n\nCome on.\n\n\nThis only affects models that are at least 10 years old. And those devices will still work just fine, they just won't have app integration. That's a way better deal than other companies where the device becomes literally unusable without the app.",
          "score": -6,
          "created_utc": 1745650358.0,
          "replies": [
            {
              "id": "mp4g25r",
              "author": "hereisoblivion",
              "body": "If the product is a core function of controlling your home air conditioning system, absolutely. \nA cellphone, laptop, operating system, etc, of course not. \n\nBut disabling core features of an air-conditioning system is a whole different ballgame.  To compare cellphone support to disabling features of a building.... You have to realize the two aren't even comparable.",
              "score": 3,
              "created_utc": 1745662352.0,
              "replies": []
            },
            {
              "id": "mpfrdsj",
              "author": "Alewort",
              "body": "Product lifetimes must be appropriate to their usage in order to be fit for purpose. It is not normal to replace core components of a dwelling every few years.",
              "score": 2,
              "created_utc": 1745817725.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mp2a1qz",
      "author": "Spanky2k",
      "body": "I really regret buying into the Nest ecosystem. I've got a bunch of these; had a 2nd gen at my previous house and have 4 gen 3s in my current house and I have a load of Nest smoke alarms too. I remember being excited about Nest when they were first released; designed by ex-Apple staff and looked really nice. But then Google bought them and good iOS support was always due to be coming 'soon'. Siri support was never quite promised but always hinted as being available in the near future. Just like they were strongly hinting years ago that they'd add some Nest compatible radiator TRVs but again, that never materialised. \n\nBesides all that; I really hate the 'learning' part of them. I just want to be able to set it to a temperature, set it remotely using my phone or a voice command or schedule it to be a temperature for certain times of the day. I don't want it to learn and adjust settings whenever I turn it up. I don't want it to learn when I'm home or not and I don't want it to turn off when I'm out (there's almost always someone at home and when there's not, there are pets here).\n\nI know I need to replace them all but it's not obvious what works well. I want Apple HomeKit Support. I want Smart TRV support. I want separate zone support. I have four underfloor heating zones and radiators that control two floors. Right now I have a Nest per underfloor heating room and one Nest for the rest of the house which is heated by radiators. The last time I looked into it, there weren't any solutions available in the UK that could handle all of that.",
      "score": 3,
      "created_utc": 1745625947.0,
      "replies": [
        {
          "id": "mpbep4r",
          "author": "madjalapeno",
          "body": "Home Assistant is probably your best bet, but there is a learning curve.",
          "score": 1,
          "created_utc": 1745763733.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp2z75t",
      "author": "dj_spanmaster",
      "body": "\"Heating systems in Europe are unique and have a variety of hardware and software requirements that make it challenging to build for the diverse set of homes. Therefore moving forward we’ll no longer launch new Nest thermostats in Europe.\"\n\nIf you had told me ten years ago that this was a statement by fucking *GOOGLE* I would have called you a liar straight to your face. They used to be a software company that did some real magic, actual innovation where things were difficult. \"Challenging\" was just another Tuesday. Now they're just another company too big and addicted to profits for its own good.",
      "score": 4,
      "created_utc": 1745634977.0,
      "replies": [
        {
          "id": "mp3mgtm",
          "author": "nikhkin",
          "body": "This is more annoying than them discontinuing older models. \n\nIf the old thermostats work in Europe, there's no excuse for them abandoning the market. \n\nIt's a thermostat. It has to trigger an \"on\" signal or an \"off\" signal.",
          "score": 3,
          "created_utc": 1745644976.0,
          "replies": [
            {
              "id": "mp4c68p",
              "author": "trumps_baggy_gloves",
              "body": "This is what I can't understand. There must be some other reason behind this. I've 3 thermostats, so I guess I'll be needing to replace those in the next few years. Any ideas what to get instead?",
              "score": 1,
              "created_utc": 1745659952.0,
              "replies": [
                {
                  "id": "mp4chjw",
                  "author": "nikhkin",
                  "body": "I got one free when my boiler was replaced, but I think it's a newer model that is still supported. \n\nI'll have a look into replacing over the next few years, just in case. I've heard good things about Hive thermostats from friends. \n\nFunny thing is, I was looking at getting some cameras and figures I'd go with Nest since I have the thermostat. I guess I'll look at other brands if I can be sure those won't also lose support.",
                  "score": 1,
                  "created_utc": 1745660153.0,
                  "replies": [
                    {
                      "id": "mp4gdjy",
                      "author": "trumps_baggy_gloves",
                      "body": "I remember at the time I was getting the thermostats, the Nests were recommended over the Hive ones, ironically. I have a few eufy cameras which I'm pretty happy with. No subscription charge either, if you put a memory card in them.",
                      "score": 1,
                      "created_utc": 1745662545.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mp31ppk",
      "author": "SnooChipmunks2079",
      "body": "This kind of crap is why you should buy thermostats from thermostat companies. The remote access on my 2015 Honeywell still works. It’s not as sexy and it doesn’t “learn” but that’s fine.",
      "score": 3,
      "created_utc": 1745635917.0,
      "replies": [
        {
          "id": "mphyh2s",
          "author": "PeaTearGriphon",
          "body": "Nest only \"learns\" for a few days for each setting (cool, warm, cool/warm) and then sticks with that forever, not matter how much you change the temperature.",
          "score": 1,
          "created_utc": 1745854643.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp33atx",
      "author": "I_heart_your_Momma",
      "body": "Fuck all these corporations intentionally killing electronic devices that are still perfectly good. Just to force you to buy new again. \nThis is getting out of hand.",
      "score": 5,
      "created_utc": 1745636502.0,
      "replies": [
        {
          "id": "mp3wb4w",
          "author": "haarschmuck",
          "body": "The thermostats will still work fine, just not with the app. You can still use it physically as a thermostat. \n\nThis whole article is such a non-issue.",
          "score": 1,
          "created_utc": 1745650409.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp48aci",
      "author": "rantbox21",
      "body": "Reminder to not buy google products.",
      "score": 3,
      "created_utc": 1745657542.0,
      "replies": []
    },
    {
      "id": "mp4qcur",
      "author": "Additional_Cap72",
      "body": "My thermostat has NEVER had an opinion. I turn it clockwise to make my house warmer and that process has always worked …",
      "score": 5,
      "created_utc": 1745667852.0,
      "replies": []
    },
    {
      "id": "mp5ty7a",
      "author": "MBSMD",
      "body": "I will replace mine with a non-Google product.",
      "score": 5,
      "created_utc": 1745682105.0,
      "replies": []
    },
    {
      "id": "mp1tnxu",
      "author": "monstrinhotron",
      "body": "Me looking at my mechanical thermostat dating from some time in the 70s.\n\n\"that'll do pig. That'll do.\"",
      "score": 31,
      "created_utc": 1745620359.0,
      "replies": [
        {
          "id": "mp1uzki",
          "author": "kstick10",
          "body": "They’ll still work just fine a thermostats. Just won’t connect to anything else. You’re not superior to anyone here.",
          "score": -12,
          "created_utc": 1745620819.0,
          "replies": [
            {
              "id": "mp1vw34",
              "author": "monstrinhotron",
              "body": "True. But i'm ever so slightly richer. Until my old thermostat burns my house down somehow at least",
              "score": 16,
              "created_utc": 1745621131.0,
              "replies": [
                {
                  "id": "mp1wtnx",
                  "author": "bandit1206",
                  "body": "Or dumps mercury on the floor",
                  "score": -2,
                  "created_utc": 1745621455.0,
                  "replies": [
                    {
                      "id": "mp2jt3y",
                      "author": "Cjprice9",
                      "body": "Mercury isn't all that bad.  Mercury locked in a glass ampoule is even less bad.",
                      "score": 5,
                      "created_utc": 1745629419.0,
                      "replies": []
                    },
                    {
                      "id": "mp2m0yj",
                      "author": "None",
                      "body": "Thermostats don’t use mercury to operate. They basically just use a spring with a magnet attached to it. When the room heats up, the spring expands until the magnet grabs and completes a circuit (turns on the A/C). When the room is cooled, the spring contracts enough that the magnet detaches. It’s one of the ‘dumbest’ inventions of all time.",
                      "score": 2,
                      "created_utc": 1745630219.0,
                      "replies": [
                        {
                          "id": "mp2ubgp",
                          "author": "Cjprice9",
                          "body": "Isn't it a bimetallic strip, not a spring and a magnet?",
                          "score": 2,
                          "created_utc": 1745633176.0,
                          "replies": []
                        },
                        {
                          "id": "mp33jjh",
                          "author": "bandit1206",
                          "body": "They did back in the day.",
                          "score": 1,
                          "created_utc": 1745636593.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp2loui",
              "author": "None",
              "body": "Frankly we are superior it one regard: we can actually control the temperature in our houses lol",
              "score": 1,
              "created_utc": 1745630096.0,
              "replies": []
            },
            {
              "id": "mp1whll",
              "author": "EnderWiggin07",
              "body": "Right, and since it's still a programmable stat, it's still much better than the one from the 70s even",
              "score": 0,
              "created_utc": 1745621339.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp26aht",
          "author": "pmjm",
          "body": "I had one of those until this past winter, when I got a Nest. Being able to change the temperature with my voice in the middle of the night without getting up has been a game-changer.\n\nThe old thermostats are tanks, but you really don't know what you're missing.",
          "score": -2,
          "created_utc": 1745624678.0,
          "replies": [
            {
              "id": "mp44fm1",
              "author": "new-username-2017",
              "body": "Why do you need to change the temperature in the middle of the night?",
              "score": 1,
              "created_utc": 1745655190.0,
              "replies": [
                {
                  "id": "mp44lwx",
                  "author": "pmjm",
                  "body": "Sometimes it gets too hot or too cold.",
                  "score": 0,
                  "created_utc": 1745655298.0,
                  "replies": [
                    {
                      "id": "mp46i0a",
                      "author": "new-username-2017",
                      "body": "How though? I set my thermostat to 18C for overnight. If the room goes below 18C, the heating comes on until the room gets back to 18C, so I can never get too cold. If the room is above 18C then the heating won't come on at all. So a smart thermostat would make no difference at all.",
                      "score": 3,
                      "created_utc": 1745656462.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mp1ze5m",
      "author": "theREAL_Harambe",
      "body": "Lol leaving the google ecosystem completely was the smartest move I ever made. \n\nYou literally can’t trust them not kill their products.",
      "score": 5,
      "created_utc": 1745622339.0,
      "replies": []
    },
    {
      "id": "mp20dl5",
      "author": "parmdhoot",
      "body": "Any company that plans to no longer support a product after x amount of time should open source the firmware to allow independent third party people to be able to continue to use the hardware at their own pleasure. Google did the same thing with the original nest cams also and created tons of E-Waste because they decided to drop support for a certain hardware. These cameras were perfectly functional but now just sit as dead weights.",
      "score": 3,
      "created_utc": 1745622676.0,
      "replies": []
    },
    {
      "id": "mp307m8",
      "author": "LegoBSpace",
      "body": "Yet my old analog thermostat from the 1980s is still working just fine….",
      "score": 3,
      "created_utc": 1745635359.0,
      "replies": []
    },
    {
      "id": "mp30mvd",
      "author": "Tasty-Performer6669",
      "body": "Bring back dumb gadgets",
      "score": 3,
      "created_utc": 1745635521.0,
      "replies": []
    },
    {
      "id": "mp3h8cy",
      "author": "nothingexceptfor",
      "body": "Never buy Google’s or Facebook’s hardware",
      "score": 3,
      "created_utc": 1745642360.0,
      "replies": []
    },
    {
      "id": "mp3rbva",
      "author": "coupledcargo",
      "body": "I’m ok with them killing access to googles servers, but open it up so I can talk to it locally from HA",
      "score": 3,
      "created_utc": 1745647628.0,
      "replies": []
    },
    {
      "id": "mp3vjne",
      "author": "Development-Feisty",
      "body": "This is why I don’t buy products like that, anything that counts on a developer to continue to support a product is a crapshoot and at the price they were charging for these there was no way I was ever going to pay for one (like as a gift for my Mom who has a house)",
      "score": 3,
      "created_utc": 1745649978.0,
      "replies": []
    },
    {
      "id": "mp3yn7d",
      "author": "Koseoglu-2X4B-523P",
      "body": "This signifies all that is wrong in the world today. You own nothing.",
      "score": 3,
      "created_utc": 1745651758.0,
      "replies": []
    },
    {
      "id": "mp4eypk",
      "author": "Zombieneker",
      "body": "Add that to the mountain of examples why live service products suck.",
      "score": 3,
      "created_utc": 1745661679.0,
      "replies": []
    },
    {
      "id": "mp6lu9t",
      "author": "ThrowawayAl2018",
      "body": "What *exactly* you need to know: Another \"Planned Obsolesce\" to fill the coffers of billionaires.",
      "score": 3,
      "created_utc": 1745690720.0,
      "replies": []
    },
    {
      "id": "mp8rdwv",
      "author": "marvinfuture",
      "body": "I love my nests. They are great, but if I can't use them anymore because google doesn't want to support them, then I will refuse to buy another google one",
      "score": 3,
      "created_utc": 1745717167.0,
      "replies": []
    },
    {
      "id": "mp9zfq6",
      "author": "Positive_Chip6198",
      "body": "Never invest in google, this was already true 15 years ago",
      "score": 3,
      "created_utc": 1745737871.0,
      "replies": []
    },
    {
      "id": "mp34y6m",
      "author": "This_Elk_1460",
      "body": "My Honeywell thermostat that cost a fraction of the price will never have this problem.",
      "score": 6,
      "created_utc": 1745637140.0,
      "replies": []
    },
    {
      "id": "mp23cvn",
      "author": "olearyboy",
      "body": "Threw mine out a couple of years ago, switched to ecobee, haven’t looked back",
      "score": 2,
      "created_utc": 1745623684.0,
      "replies": []
    },
    {
      "id": "mp24l06",
      "author": "paulsteinway",
      "body": "I have one in my basement where the furnace is. The wire from the basement to upstairs for the thermostat was broken years ago when the house was renovated. I got a temperature sensor to hang upstairs and the thermostat uses that instead of its internal temperature sensor. How the fuck am I supposed to replace that? In October when the temperatures are falling.",
      "score": 2,
      "created_utc": 1745624103.0,
      "replies": []
    },
    {
      "id": "mp2c6hw",
      "author": "Judman13",
      "body": "Honeywell T6 Pro Z-wave. Totally local control with home assistant (or any zwave capable system) and no one can brick it but hardware failure.",
      "score": 2,
      "created_utc": 1745626697.0,
      "replies": []
    },
    {
      "id": "mp2c87y",
      "author": "DuneChild",
      "body": "My electric company gave me the one I have and they send me $25 a year to keep it installed. I’m guessing they’ll offer a new one if they’re going to lose the ability to control it.",
      "score": 2,
      "created_utc": 1745626714.0,
      "replies": [
        {
          "id": "mp2xdvy",
          "author": "Ljhughes8",
          "body": "I did also but mine won't connect to  wifi any more and it  is the second one",
          "score": 1,
          "created_utc": 1745634298.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp2cr5n",
      "author": "WarbossTodd",
      "body": "Planned obsolescence in action folks.",
      "score": 2,
      "created_utc": 1745626898.0,
      "replies": []
    },
    {
      "id": "mp2evbf",
      "author": "robot2084tron",
      "body": "This is terrible news for me, my gen 1 still working without issues\n\nCan I assume newer models have a monthly subscription fee ?",
      "score": 2,
      "created_utc": 1745627649.0,
      "replies": [
        {
          "id": "mp2nnnm",
          "author": "ComputerSong",
          "body": "I have a gen 3.  No subscription.",
          "score": 3,
          "created_utc": 1745630812.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp2fat2",
      "author": "mayhem6",
      "body": "I never got one of these or anything similar. This is something I hadn't thought of; obsolescence. All tech will eventually be obsolete and these are no different. I guess as long as they make regular programmable thermostats, I am good.",
      "score": 2,
      "created_utc": 1745627801.0,
      "replies": []
    },
    {
      "id": "mp2vfbq",
      "author": "Nehal1802",
      "body": "More e-waste!",
      "score": 2,
      "created_utc": 1745633579.0,
      "replies": []
    },
    {
      "id": "mp2vnog",
      "author": "tifosiv122",
      "body": "Terrible for those early adopters",
      "score": 2,
      "created_utc": 1745633664.0,
      "replies": []
    },
    {
      "id": "mp2zkmu",
      "author": "minion71",
      "body": "This why I love open source and hate service based devices !!",
      "score": 2,
      "created_utc": 1745635117.0,
      "replies": []
    },
    {
      "id": "mp30k43",
      "author": "chronocapybara",
      "body": "Utter horseshit.",
      "score": 2,
      "created_utc": 1745635492.0,
      "replies": []
    },
    {
      "id": "mp35jb3",
      "author": "MisterRipster",
      "body": "PICHAI needs to resign",
      "score": 2,
      "created_utc": 1745637372.0,
      "replies": []
    },
    {
      "id": "mp38llj",
      "author": "No_Milk398",
      "body": "Can it play Crysis?",
      "score": 2,
      "created_utc": 1745638630.0,
      "replies": []
    },
    {
      "id": "mp39w05",
      "author": "Kevo_xx",
      "body": "Typical Google being the absolute worst company on Earth when it comes to supporting their products and services.",
      "score": 2,
      "created_utc": 1745639152.0,
      "replies": []
    },
    {
      "id": "mp3bj93",
      "author": "omgsideburns",
      "body": "I was a bit miffed when I received this notice today, but then I realized I’ve had it since it came out, I’ve installed it in its third home now. I was looking for an excuse to upgrade. Something more home assistant friendly would be cool.",
      "score": 2,
      "created_utc": 1745639840.0,
      "replies": []
    },
    {
      "id": "mp43ass",
      "author": "itsaride",
      "body": "I'm sure the EU can get a few billion out of them for this.",
      "score": 2,
      "created_utc": 1745654511.0,
      "replies": []
    },
    {
      "id": "mp4nc9m",
      "author": "Substantial-Rip-6207",
      "body": "It’s annoying companies have the planned obsolescence with products. Hate to see the day Phillips Hue does this",
      "score": 2,
      "created_utc": 1745666415.0,
      "replies": []
    },
    {
      "id": "mp4qtei",
      "author": "605qu3",
      "body": "“Yes, Google is going to help you out with this transition.” - how the fuck is arbitrarily terminating functionality in return for a coupon to buy a NEW product that will doubtless suffer the same fate “helping” in any sense of the word? I have a house full of Google products. I swear on all things sacred and holy that every one of them will be wiped and sent to the recycling facility by the end of this weekend, and I’ll never spend another dollar on these evil fucks again. \n\n“Don’t be evil” my fuzzy ass.",
      "score": 2,
      "created_utc": 1745668068.0,
      "replies": []
    },
    {
      "id": "mp4rcw6",
      "author": "TopdeckIsSkill",
      "body": "This is why I bought a thermostat that could 100% be controlled by buttons.\nIt has smart features but they are optional",
      "score": 2,
      "created_utc": 1745668312.0,
      "replies": []
    },
    {
      "id": "mp4zaql",
      "author": "alfonseexists",
      "body": "Fuck google",
      "score": 2,
      "created_utc": 1745671670.0,
      "replies": []
    },
    {
      "id": "mp5jk1w",
      "author": "realcoray",
      "body": "I bought a gen 1 very early on and loved it.  Great design and software.  Google bought nest and pretty soon it started to go downhill.\n\nI had no intention of upgrading but my local power company had an insane deal on the latest one and while it still functions fine, it isn’t nearly as nice.\n\nLike they shipped them and the screen was so dim and the face so shiny you could barely see anything.  They added brightness but the combo of the shiny face and what not still sucks in comparison to a gen 1.\n\nThen you have to use google home software, which sucks so bad.  Because it is so generic, designed I guess to work with any smart thermostat, it lost all of the great clean and simple design the original had.  Have to drill down 7 times to do anything.\n\nThey should release the original code and let someone figure it out.",
      "score": 2,
      "created_utc": 1745678831.0,
      "replies": []
    },
    {
      "id": "mp5rz78",
      "author": "supified",
      "body": "The way google treats tech really seems like a short sighted strategy, google home? Google anything, they have such a long reputation now of dumping these products and ceasing all support It has got to be making people think twice about supporting or purchasing anything with their name on it.  I know I would hesitate at a minimum.",
      "score": 2,
      "created_utc": 1745681491.0,
      "replies": []
    },
    {
      "id": "mp64y4c",
      "author": "Prackinhoff11",
      "body": "Nest is ass, overpriced shinny wall art.\nPlenty of smart thermostats out there for less money",
      "score": 2,
      "created_utc": 1745685579.0,
      "replies": []
    },
    {
      "id": "mp6ft9e",
      "author": "KStang086",
      "body": "FTC do your fucking job",
      "score": 2,
      "created_utc": 1745688900.0,
      "replies": []
    },
    {
      "id": "mp6ui6u",
      "author": "mtndewgood",
      "body": "They've never been smart. The only new 'feature' ever added to mine in 8 years was a credit if I let them control my thermostat on some lame ass eco mode that would have froze my families asses off . The 'sun block' feature that is supposed to adjust the temp for direct sunlight on the thermostat doesn't work at all.. never did",
      "score": 2,
      "created_utc": 1745693404.0,
      "replies": [
        {
          "id": "mp73y6y",
          "author": "Jim3001",
          "body": "They tried that in Texas. Wanted ERCOT to directly control thermostats during the day to ease the load on the grid. They got told to add more capacity. No one wants to come home to a 90 degree house or worse yet overheating pets.",
          "score": 2,
          "created_utc": 1745696515.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp79i16",
      "author": "Captain_Comic",
      "body": "Android Authority gargling Google’s nuts so hard in this article",
      "score": 2,
      "created_utc": 1745698348.0,
      "replies": []
    },
    {
      "id": "mp8mfw4",
      "author": "HG21Reaper",
      "body": "Main reason as to why I don’t wanna get smart appliances. Once the company decides to end support, you end up with a very expensive brick.",
      "score": 2,
      "created_utc": 1745715264.0,
      "replies": []
    },
    {
      "id": "mpbttef",
      "author": "Nu11X3r0",
      "body": "Have a Nest, loved it, had planned on upgrading it to a newer model down the road. Got the email about discontinuing support for a functional device and now I'm looking at a replacement elsewhere, friends are in the same boat. Fairly certain we're not alone and this decision to end support has caused a ton of potential customers to consider the other options.\n\nI mean FFS they were basically offering me retail price on an upgrade where even Sonos offers a decent discount to upgrade their devices.",
      "score": 2,
      "created_utc": 1745768540.0,
      "replies": []
    },
    {
      "id": "mpgpovf",
      "author": "rjksn",
      "body": "Once Google bought them i stopped recommending them. Google is not a good long term product owner. ",
      "score": 2,
      "created_utc": 1745838570.0,
      "replies": []
    },
    {
      "id": "mp1x4e3",
      "author": "throwawayhyperbeam",
      "body": "Long live dumb devices. When given a choice that's what I'll typically take.",
      "score": 3,
      "created_utc": 1745621558.0,
      "replies": []
    },
    {
      "id": "mp1zzpp",
      "author": "mk2rocco",
      "body": "Just buy a new one, idiot. - Probably Google",
      "score": 4,
      "created_utc": 1745622543.0,
      "replies": []
    },
    {
      "id": "mp3670c",
      "author": "Bugger9525",
      "body": "Dont buy iot devices.",
      "score": 4,
      "created_utc": 1745637634.0,
      "replies": []
    },
    {
      "id": "mp1rlyc",
      "author": "master2873",
      "body": "Doesn't surprise me in the slightest. Planned obsolescence. Hopefully these can still be used after being removed from their network, as I remember years ago during a bad heatwave, Google services were down that powered these devices, and users couldn't use their Nest to cool, or heat their houses.\n\nBasic, cheap thermostats will always be king to me just because of issues like I stated above. Usually easier to install too, especially for those with older houses that don't have updated wiring to units to support these smart devices like I do.\n\nEdit: Forgot to mention too, the coupon system seems like a slap in the face to me as I don't see why they can't just make these older devices function normally without smart functions locally, and literally taking people's money while taking the product away they paid for. Hope this leads to a class action suit if possible.",
      "score": 4,
      "created_utc": 1745619653.0,
      "replies": []
    },
    {
      "id": "mp1y420",
      "author": "mtnslice",
      "body": "They were already dumb",
      "score": 3,
      "created_utc": 1745621898.0,
      "replies": []
    },
    {
      "id": "mp20fk0",
      "author": "mjc4y",
      "body": "Infuriating.   I feel like Captain Adama in the reboot BSG:  no networks aboard my Battlestar!\n\nNot to sound like a Luddite, but seriously, an ancient analog Honeywell thermostat will last the life of a house.   (Half the life if the house is built well.) \n\nTen years ago people were joking about the Internet of Shitty Things.  This is morphing into the Internet of Dead Things.",
      "score": 2,
      "created_utc": 1745622694.0,
      "replies": []
    },
    {
      "id": "mp212ju",
      "author": "Dookie-Trousers-MD",
      "body": "I have a 40 year old mercury thermostat in my place. Works great",
      "score": 2,
      "created_utc": 1745622909.0,
      "replies": []
    },
    {
      "id": "mp31f87",
      "author": "Automatic-Prompt-450",
      "body": "Imagine using proprietary software for your smart devices",
      "score": 2,
      "created_utc": 1745635809.0,
      "replies": []
    },
    {
      "id": "mp3b5ri",
      "author": "MapleMonstera",
      "body": "This Reddit thread  brought to you by: ecobee",
      "score": 2,
      "created_utc": 1745639681.0,
      "replies": []
    },
    {
      "id": "mp3i1vp",
      "author": "dumbdude545",
      "body": "Laughs in nest that's never been connected to the internet. Fuck iot devices.",
      "score": 2,
      "created_utc": 1745642744.0,
      "replies": []
    },
    {
      "id": "mp33fkf",
      "author": "Brief_Accountant_881",
      "body": "Wtf why is a friggin smart thermostat necessary?! All you should need is a knob that goes up or down. That’s it. That’s all I’ll ever want or need for a thermostat in my house! All this smart tech is unnecessary. Not every darn thing needs to be “improved” upon!",
      "score": 2,
      "created_utc": 1745636551.0,
      "replies": [
        {
          "id": "mp3m6nj",
          "author": "nikhkin",
          "body": "Smart thermostats allow people to control the heating when not at home. \n\nThey also have features that change the settings depending on whether people are at home or not. \n\nIf you're late home from work, the heating doesn't come on and waste energy by heating an empty home, for example.",
          "score": 5,
          "created_utc": 1745644824.0,
          "replies": [
            {
              "id": "mp3njev",
              "author": "Brief_Accountant_881",
              "body": "🙄",
              "score": -1,
              "created_utc": 1745645555.0,
              "replies": [
                {
                  "id": "mp3nvxs",
                  "author": "nikhkin",
                  "body": "Just because you do not see a benefit, doesn't mean it is not beneficial for others.",
                  "score": 2,
                  "created_utc": 1745645747.0,
                  "replies": [
                    {
                      "id": "mp3o6l2",
                      "author": "Brief_Accountant_881",
                      "body": "🙄",
                      "score": -1,
                      "created_utc": 1745645907.0,
                      "replies": [
                        {
                          "id": "mp3osxt",
                          "author": "nikhkin",
                          "body": "What a remarkable counterargument.",
                          "score": 2,
                          "created_utc": 1745646251.0,
                          "replies": [
                            {
                              "id": "mp3qc8l",
                              "author": "Brief_Accountant_881",
                              "body": "😘",
                              "score": -1,
                              "created_utc": 1745647085.0,
                              "replies": [
                                {
                                  "id": "mp52vs7",
                                  "author": "Muslim_Wookie",
                                  "body": "You're dumb as a sack of bricks, and as prideful as a gym bro with no self awareness.",
                                  "score": 1,
                                  "created_utc": 1745673062.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mp830bd",
          "author": "Cimexus",
          "body": "Yeah sorry I’m not walking down two flights of stairs and back up again every time I want to change the temperature. Our thermostat is in an area of the house quite distant from where we actually are most of the time, so the wifi connectivity is a must.",
          "score": 1,
          "created_utc": 1745708196.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp3fflt",
      "author": "SecretIdentity012361",
      "body": "And this is why I will never own anything \"smart\".. Other than my phone, since that's kind of forced on us. You'd think people would have learned by now that those stupid gadgets you buy from these companies are the peak of planned obsolescence. They have every intention of bricking your devices after 2-5 years. Also, why would you pay companies to let them steal personal information about you and everyone you know so they can make a profit off of it?.. If a company wants to make money off of me then they can owe me a % of the profits. Otherwise, keep your smart devices away from me.",
      "score": 2,
      "created_utc": 1745641552.0,
      "replies": [
        {
          "id": "mp3lrn8",
          "author": "nikhkin",
          "body": "13 years is a tad more than 2-5 years. \n\nAs for why people would want such a device: convenience.",
          "score": 2,
          "created_utc": 1745644604.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp1x2wn",
      "author": "leathco",
      "body": "I got a gen 2 for 59 dollars late last year on clearance at walmart.  Prolly wont be getting the upgrade or a new nest, and prolly not even gonna get another smart themostat.  I'll just keep using what I have without the smart features that I rarely use anyway.",
      "score": 1,
      "created_utc": 1745621544.0,
      "replies": []
    },
    {
      "id": "mp1yrrp",
      "author": "LydianSharp5",
      "body": "Last year I finally configured my Nest to be a “dumb” thermostat (which is not trivial by the way, but found a great guide to do so by somebody who figured it out). My Nest was turning on at silly times for reasons on it knew. Now it never does anything on its own. Turns out the best model for my home is that when I’m cold I turn the knob a bit to the right and when I’m warm I turn it to the left. The only useful “smart” feature is that I can ask Alexa the temp and tell her to change it — from my bed if need be. :)",
      "score": 1,
      "created_utc": 1745622125.0,
      "replies": [
        {
          "id": "mp34wis",
          "author": "PossibleMechanic89",
          "body": "One feature jest always lacked was Alexa’s ability to “know” what the temp is. \n\nI can’t say “Alexa, turn it up”. I have to tell it a target temp.",
          "score": 1,
          "created_utc": 1745637122.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp23h5b",
      "author": "1h8fulkat",
      "body": "And if you haven't learned yet to avoid cloud powered devices and only purchase smart home devices that integrate locally with Home Assistant, let the be your reminder.",
      "score": 1,
      "created_utc": 1745623724.0,
      "replies": []
    },
    {
      "id": "mp253qs",
      "author": "timewarpUK",
      "body": "I wonder if home/away will work from the proximity sensor?\n\nThe article suggests not, but this could just be referring to the phone location function. I hope.",
      "score": 1,
      "created_utc": 1745624277.0,
      "replies": []
    },
    {
      "id": "mp25k15",
      "author": "infinitynull",
      "body": "I've never adopted these smart devices because I always feared this. I'm not happy that I was right either though. All this \"cloud storage\", \"subscription models\", AI powered, Internet of things devices just take away agency. Screw 'em. You don't own them and they can be taken away at any time. I'm not paying for that.\n\nI'm officially a codger.",
      "score": 1,
      "created_utc": 1745624431.0,
      "replies": []
    },
    {
      "id": "mp26cgx",
      "author": "CAM6913",
      "body": "It’s not surprising they want to sell more thermostats, I have a different brand smart thermostat and the company did this a few years ago.",
      "score": 1,
      "created_utc": 1745624696.0,
      "replies": []
    },
    {
      "id": "mp2gpbs",
      "author": "PadSlammer",
      "body": "Okay, what are the non-Google options out there?",
      "score": 1,
      "created_utc": 1745628309.0,
      "replies": [
        {
          "id": "mp2ltrl",
          "author": "thelectroom",
          "body": "Ecobee",
          "score": 3,
          "created_utc": 1745630146.0,
          "replies": [
            {
              "id": "mp2opec",
              "author": "birdinahouse1",
              "body": "As someone who does HVAC. Ecobee has given me no problems (aka: call backs).",
              "score": 4,
              "created_utc": 1745631196.0,
              "replies": []
            },
            {
              "id": "mpbwclr",
              "author": "TwoToedSloths",
              "body": "> Ecobee\n\nBetter switch brands bucko: https://www.theverge.com/2024/5/2/24147154/ecobee-smart-thermostat-end-of-support",
              "score": 1,
              "created_utc": 1745769314.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mp2l726",
      "author": "pwrof3",
      "body": "I bought a Nest Cam, the newest one that Google designed and made. It went completely dead one day and never turned back on. This was one day after the warranty was up. \nMy Ring cameras are all 10 years old and still going strong.",
      "score": 1,
      "created_utc": 1745629917.0,
      "replies": []
    },
    {
      "id": "mp2q4un",
      "author": "MaxwellCarter",
      "body": "Why did they write a whole article on this without saying why the f@ck this is happening?",
      "score": 1,
      "created_utc": 1745631703.0,
      "replies": []
    },
    {
      "id": "mp2wa90",
      "author": "pastorHaggis",
      "body": "I switched to a Venstar thermostat a few months ago because I didn't want to deal with someone else's service and it has a local API mode that I can use Home Assistant to control with no issues. I can disable internet access and just keep the Wi-Fi and I can still use Home Assistant.\n\nI'll never buy a non-phone product from Google again.",
      "score": 1,
      "created_utc": 1745633891.0,
      "replies": []
    },
    {
      "id": "mp316p9",
      "author": "aegee14",
      "body": "I’ve stopped using anything Google thinks of as a potential project, such as Nest. They can just decide on a whim to stop the whole project and then things become obsolete. And, Google does this a lot.\n\nNest, Stadia, Chromecast, Dropcam, no F’ing more for me.",
      "score": 1,
      "created_utc": 1745635722.0,
      "replies": []
    },
    {
      "id": "mp32odr",
      "author": "HouseMDx",
      "body": "I think I'm in the minority, but I'm actually surprised my 2 Gen1's are still going strong.  I know the backup battery in them can't last forever.  Been considering upgrading for a while.  The coupon offer seems reasonable to me.",
      "score": 1,
      "created_utc": 1745636275.0,
      "replies": []
    },
    {
      "id": "mp34cvn",
      "author": "the_gnurd",
      "body": "Kind of a clickbate-y picture what with that being a gen 3. At a glance it made me think they were included when they are not.",
      "score": 1,
      "created_utc": 1745636908.0,
      "replies": []
    },
    {
      "id": "mp4f8c1",
      "author": "TinDumbass",
      "body": "Mine are all dumb anyway. I've had 3 with a W5 error that stops them connecting to WiFi and the app",
      "score": 1,
      "created_utc": 1745661843.0,
      "replies": []
    },
    {
      "id": "mp4fsc0",
      "author": "CMDR_omnicognate",
      "body": "Might be worth looking if you can replace these with a raspberry pi with a zigbee module so you can run everything locally, hopefully then google won't randomly depreciate it",
      "score": 1,
      "created_utc": 1745662184.0,
      "replies": []
    },
    {
      "id": "mp4glzz",
      "author": "stinkybumbum",
      "body": "You can still use them surely? Even if it doesn’t connect to your phone it still works",
      "score": 1,
      "created_utc": 1745662687.0,
      "replies": []
    },
    {
      "id": "mp4h7g6",
      "author": "chabybaloo",
      "body": "Had an app that would allow you to see your current and history of when your thermostat was on. I think it showed internal temp as well, as a graph Very useful. Especially for diagnosing issues\n\nI don't know what Google did, but they killed access to the api(?)  and it no longer works.\n\nI already learnt the hardway not to buy locked in hardware.\n\nI did purchase an \"open energy monitor\" and they also have guides and sell a US version.",
      "score": 1,
      "created_utc": 1745663044.0,
      "replies": []
    },
    {
      "id": "mp4hp2p",
      "author": "aaffpp",
      "body": "Can you sue them for killing product features that are paid for?",
      "score": 1,
      "created_utc": 1745663335.0,
      "replies": []
    },
    {
      "id": "mp4m1c8",
      "author": "Jlx_27",
      "body": "Google doing shitty things, how unsurprising.",
      "score": 1,
      "created_utc": 1745665751.0,
      "replies": []
    },
    {
      "id": "mp4ykn8",
      "author": "LivingHighAndWise",
      "body": "This is why I stop buying Google products years ago. It's almost like Google leadership is intentionally trying to run the company into the ground.",
      "score": 1,
      "created_utc": 1745671381.0,
      "replies": []
    },
    {
      "id": "mp51jc8",
      "author": "LEM1978",
      "body": "Once Google bought Nest, I stopped buying its products and got rid of my nest doorbell cam. \n\nI knew this 💩 would happen",
      "score": 1,
      "created_utc": 1745672547.0,
      "replies": []
    },
    {
      "id": "mp54b2l",
      "author": "Blunttack",
      "body": "I’ve had a Sensi thermostat for a decade… it was like 40 bucks. Works great. Not sure I understand why anyone would spend 5 times that on a thing that does the same thing. Cause it’s round? lol.",
      "score": 1,
      "created_utc": 1745673595.0,
      "replies": []
    },
    {
      "id": "mp5dwqn",
      "author": "Softrawkrenegade",
      "body": "Iv had all the smart features turned off for years anyway. Never jived with the learning feature. Just want it hooked up to wifi so i can control remotely.",
      "score": 1,
      "created_utc": 1745676991.0,
      "replies": []
    },
    {
      "id": "mp666jx",
      "author": "NeuroXc",
      "body": "Good thing I went with Ecobee",
      "score": 1,
      "created_utc": 1745685966.0,
      "replies": []
    },
    {
      "id": "mp9ol93",
      "author": "Ruskerdoo",
      "body": "[What a surprise! /s](https://killedbygoogle.com)",
      "score": 1,
      "created_utc": 1745731580.0,
      "replies": []
    },
    {
      "id": "mpaxyg7",
      "author": "Medium_Spicy2023",
      "body": "What is everyone getting to replace them? I am thinking Ecobee.",
      "score": 1,
      "created_utc": 1745757513.0,
      "replies": []
    },
    {
      "id": "mpb34es",
      "author": "drearylanemuffin",
      "body": "Great. Just in time for winter 👍",
      "score": 1,
      "created_utc": 1745759581.0,
      "replies": []
    },
    {
      "id": "mpek7uv",
      "author": "bitNine",
      "body": "I don’t think mine is affected, but if it is I sure as shit won’t buy another one.",
      "score": 1,
      "created_utc": 1745799846.0,
      "replies": []
    },
    {
      "id": "mphghus",
      "author": "nice_guy_threeve",
      "body": "They were never really smart to begin with.  I think there are only 2 features that I feel have any value over a \"dumb\" thermostat: Control it with my phone, and collect usage data.\n\nSpecifically I can remember shortly after installing mine, I heard the compressor come on, then maybe 2 minutes later the schedule changed the temp and it turned back off.  My thoughts: if it were really smart, it wouldn't have come on at all.  And that's pretty low hanging fruit.",
      "score": 1,
      "created_utc": 1745849107.0,
      "replies": []
    },
    {
      "id": "mpi7dbz",
      "author": "punklinux",
      "body": "This condo came with a 1st Gen Nest, and it died two years ago. I replaced it with the dumbest thermostat I could that would allow me to switch to \"auto\" (like heat when cold, cool when hot, without me hitting a switch). I think it's a Phillips.",
      "score": 1,
      "created_utc": 1745857291.0,
      "replies": []
    },
    {
      "id": "mp366za",
      "author": "pixel_of_moral_decay",
      "body": "Stop buying cloud controlled shit. It’s all disposable.\n\nLocal control or GTFO.  I just pass.",
      "score": 0,
      "created_utc": 1745637634.0,
      "replies": [
        {
          "id": "mp37oxb",
          "author": "OutdoorCO75",
          "body": "Some people need to control things remotely",
          "score": 3,
          "created_utc": 1745638253.0,
          "replies": [
            {
              "id": "mp3gzwu",
              "author": "pixel_of_moral_decay",
              "body": "Local control doesn’t mean not controlling things remotely. It just means not relying on a 3rd party to MITM until they want to stop, and sell your data while doing it.",
              "score": 2,
              "created_utc": 1745642256.0,
              "replies": [
                {
                  "id": "mp4bkuo",
                  "author": "Volesprit31",
                  "body": "See, the issue is, as someone not in the tech field, I don't even understand your comment. I'm not sure if those technical characteristics can be found easily when I'm looking to buy a thermostat anyway.",
                  "score": 1,
                  "created_utc": 1745659569.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mp37ik8",
      "author": "applemasher",
      "body": "Wow, this is horrible. I have 2 of these thermostats and they work great. A thermostat is not something you should need to upgrade. This is just corporate greed. Ironically, I just watched the first episode of black mirror, and boom here we are.",
      "score": 1,
      "created_utc": 1745638179.0,
      "replies": [
        {
          "id": "mp3wzfl",
          "author": "nicuramar",
          "body": "> A thermostat is not something you should need to upgrade\n\nWhy? Where do you draw the line? It has firmware, so why wouldn’t it need upgrades?",
          "score": 0,
          "created_utc": 1745650796.0,
          "replies": [
            {
              "id": "mp4jx9a",
              "author": "applemasher",
              "body": "Because it just works. The new thermostats have no meaningful upgrades. They also haven't had any real updates to the device in 5+ years. On the scale of google, it should cost fractions of pennies to maintain. It's kinda like having to buy a new stove or fridge, because it can't call home.",
              "score": 1,
              "created_utc": 1745664618.0,
              "replies": [
                {
                  "id": "mp684iw",
                  "author": "adamgetoutofurchair",
                  "body": "For real. I have the Gen 1 and never had an issue. Having to replace it because of greed doesn’t really sit well with me. Add it to the long list of why everything sucks.",
                  "score": 1,
                  "created_utc": 1745686566.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mp3btf8",
      "author": "OddbitTwiddler",
      "body": "Note to self.  Trash the $1500 NEST thermostats I bought and replace them with dumb ones.",
      "score": 1,
      "created_utc": 1745639962.0,
      "replies": []
    },
    {
      "id": "mp21h4b",
      "author": "r1Rqc1vPeF",
      "body": "So that mains power outage last year that killed my old Nest thermostat (my heating boiler and a few other electronic things) did me a favour then?\n\nThe power company paid to replace/repair everything. So a few more years before this new one becomes obsolete.",
      "score": 1,
      "created_utc": 1745623044.0,
      "replies": []
    },
    {
      "id": "mp2thkq",
      "author": "wumbologist-2",
      "body": "Don't buy google shit?",
      "score": 1,
      "created_utc": 1745632883.0,
      "replies": []
    },
    {
      "id": "mp377rx",
      "author": "plastiqden",
      "body": "What you need to know…is that you should never buy any Google products because the support will be cut years before the hardware should age out. They should get out of the products game completely, but it must be somehow be profitable to regularly screw over your customer base.",
      "score": 1,
      "created_utc": 1745638055.0,
      "replies": [
        {
          "id": "mp45zdj",
          "author": "evilbarron2",
          "body": "But they didn’t buy Google devices, right? They bought Nest devices, and then Google bought Nest",
          "score": 3,
          "created_utc": 1745656142.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp3dzef",
      "author": "None",
      "body": "lol this is why I never switch to a smart thermostat. So obviously was always gonna happen",
      "score": 1,
      "created_utc": 1745640908.0,
      "replies": []
    },
    {
      "id": "mp3hz89",
      "author": "1970s_MonkeyKing",
      "body": "Well those will end up in the dumpster just like Ecobee. \n\nI hated that thing. It kept on cycling the C wire to sample data which blew out my contactor switch on my gas pack.",
      "score": 1,
      "created_utc": 1745642709.0,
      "replies": []
    },
    {
      "id": "mp3ryoc",
      "author": "Strikereleven",
      "body": "I've had a gen 3 for 7 years and honestly feel like it's been dumb this whole time. The auto schedule thing always ran like crap, it was hot when I got home and would randomly get hot in the middle of the night or morning. I tried resetting the learning several times and if I left it on too long it would start messing up. I've been running efficiently off of a timed schedule for 5 years.  \n  \nI was also really annoyed they collect all this cooling data from my system, it knows the temp outside, humidity, so it knows how long it should take my house to cool, but when my system has a problem and isn't cooling I never got an alert that there was a problem. I'd come home and it's 85 in the house because it's been running the pump all day with no fan, or the pump didnt come on because the capacitor went out. The only benefit over a cheapo thermostat is it looks nice and I can control it from my phone.",
      "score": 1,
      "created_utc": 1745647974.0,
      "replies": []
    },
    {
      "id": "mp44h0m",
      "author": "fatnote",
      "body": "As of this morning, the Nest app says my thermostat is offline even though the thermostat itself says everything is good. Coincidence??",
      "score": 1,
      "created_utc": 1745655215.0,
      "replies": []
    },
    {
      "id": "mp602qo",
      "author": "Capable_Mud_2127",
      "body": "I didn’t chose this POS so glad their giving me a good reason to move on",
      "score": 1,
      "created_utc": 1745684032.0,
      "replies": []
    },
    {
      "id": "mp1srux",
      "author": "phoenixmatrix",
      "body": "They were always dumb. They looked super pretty though! But the temp swing between the heat and cold threshold was super wide (a big part of the \"cost savings), and the learning algorithm made a ton of nearly random point in time adjustments if you tweaked it a lot.\n\nThose things fucking sucked. Ecobee was so much better.",
      "score": -1,
      "created_utc": 1745620051.0,
      "replies": [
        {
          "id": "mp20nn8",
          "author": "thermalquenches",
          "body": "\"Ecobee\" is shit",
          "score": 2,
          "created_utc": 1745622767.0,
          "replies": []
        },
        {
          "id": "mp1x3ik",
          "author": "pholan",
          "body": "It is nice to be able to cycle the fan for a few minutes while in bed or to turn up the heat remotely if out of the house. As you said, my 2nd generation Nest is not as good as the old Honeywell I had in terms of sticking close to the set point and doing a good job at pre-cooling or heating to hit the schedule. I’m not sure if I’ll revert to a seven day programmable non smart thermostat or seek another brand of smart thermostat that can be set up without a C wire(I definitely don’t care enough to rerun my thermostat wiring.)",
          "score": 1,
          "created_utc": 1745621550.0,
          "replies": [
            {
              "id": "mp212qe",
              "author": "phoenixmatrix",
              "body": "There a lot of smart thermostats that can be controlled remotely these days. Even very early in its life the Nest already had a fair bit of competition.",
              "score": 3,
              "created_utc": 1745622910.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mp204yr",
      "author": "Ashamed-Status-9668",
      "body": "Narrator: they always were.",
      "score": 0,
      "created_utc": 1745622593.0,
      "replies": []
    },
    {
      "id": "mp2gfhp",
      "author": "CubesFan",
      "body": "What you need to knownis that they were a waste if money and resources in the first place.",
      "score": 0,
      "created_utc": 1745628211.0,
      "replies": []
    },
    {
      "id": "mp1zfr9",
      "author": "ABotelho23",
      "body": "It came out in 2012, relax lol\n\nOver 10 years for electronics is pretty generous.",
      "score": -5,
      "created_utc": 1745622354.0,
      "replies": []
    },
    {
      "id": "mp21tgj",
      "author": "ZachMatthews",
      "body": "This feels like a class action lawsuit. ",
      "score": 0,
      "created_utc": 1745623161.0,
      "replies": []
    },
    {
      "id": "mp2y2gl",
      "author": "D1RTY_D",
      "body": "Does home still operate it?",
      "score": 0,
      "created_utc": 1745634549.0,
      "replies": [
        {
          "id": "mp3mjmi",
          "author": "nikhkin",
          "body": "No, it's losing app support. \n\nYou have to control it entirely through the thermostat itself.",
          "score": 3,
          "created_utc": 1745645016.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp1zols",
      "author": "hacksoncode",
      "body": "\"about to\"... in half a year.",
      "score": -3,
      "created_utc": 1745622439.0,
      "replies": []
    },
    {
      "id": "mp2r72p",
      "author": "gBoostedMachinations",
      "body": "Gonna let people in on a little secret: smart home devices were *always* fucking stupid.",
      "score": -1,
      "created_utc": 1745632068.0,
      "replies": []
    }
  ]
}