{
  "post": {
    "title": "Switch 2 owners report overheating and crashes, even in less demanding games | Overheating usually occurs in docked mode",
    "author": "chrisdh79",
    "id": "1lqro0g",
    "score": 2278,
    "created_utc": 1751554544.0,
    "selftext": "",
    "num_comments": 291,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lqro0g/switch_2_owners_report_overheating_and_crashes/"
  },
  "comments": [
    {
      "id": "n15gw0d",
      "author": "Horvat53",
      "body": "Switch 2 owner, I noticed in dock mode the console gets very hot and was surprised how hot it was.",
      "score": 312,
      "created_utc": 1751559947.0,
      "replies": [
        {
          "id": "n17xde0",
          "author": "swarmy1",
          "body": "I feel like some extra ventilation in the dock would have been a good idea. They have a tiny blower in there to cool the dock's internals. They could have sized it up a bit to improve airflow around the console.",
          "score": 105,
          "created_utc": 1751586840.0,
          "replies": [
            {
              "id": "n1onsxm",
              "author": "otter5",
              "body": "Good thing Nintendo made 3rd party stuff so easy to do",
              "score": 16,
              "created_utc": 1751829982.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n190qj1",
          "author": "dramafan1",
          "body": "It definitely gets hotter and the fans run more if using it in docked mode. Maybe it’s more under clocked when in handheld mode. Or a large external display uses the GPU more.",
          "score": 29,
          "created_utc": 1751602026.0,
          "replies": [
            {
              "id": "n1av4b4",
              "author": "unripenedfruit",
              "body": "It has more power available, so it will run at higher clocks when docked.\n\nThis was the same with the original Switch. Handheld mode had reduced performance.\n\nExcept according to this, it sounds like they maybe didn't get it quite right with the Switch 2",
              "score": 25,
              "created_utc": 1751634771.0,
              "replies": [
                {
                  "id": "n1gag4p",
                  "author": "notjordansime",
                  "body": "Wasn’t switch 1 limited to 720p in handheld?",
                  "score": 1,
                  "created_utc": 1751713261.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n1c0ab9",
              "author": "HeggenRL",
              "body": "Of course it is runs hotter when docked. You are aware of the differences in performance between the two modes?",
              "score": -6,
              "created_utc": 1751647682.0,
              "replies": [
                {
                  "id": "n1c126o",
                  "author": "dramafan1",
                  "body": "Yep, I prefer docked mode as the 4K output is much more enjoyable. It’s not like the heat directly impacts me anyway.",
                  "score": 3,
                  "created_utc": 1751647914.0,
                  "replies": [
                    {
                      "id": "n1cdd9k",
                      "author": "HeggenRL",
                      "body": "I am honestly a bit shocked to hear that the system actually crashes due to heat issues. I wonder how they have the dock positioned. Perhaps flush against the wall or inside the TV stand among a lot of other peripherals with next to no ventilation.",
                      "score": 1,
                      "created_utc": 1751651606.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n19vby2",
          "author": "Evil_Rogers",
          "body": "I aim a fan at mine now. Was having lots of fps dips on Cyberpunk when it got hot. The fan solves it but really sucks to have to do that, especially since the TV I use is 1080p like the screen. In handheld it barley even gets warm and always runs well.",
          "score": 17,
          "created_utc": 1751617657.0,
          "replies": []
        },
        {
          "id": "n18zx21",
          "author": "FragmentedFighter",
          "body": "Same. This has me worried.",
          "score": 10,
          "created_utc": 1751601669.0,
          "replies": [
            {
              "id": "n1972tu",
              "author": "QueezyF",
              "body": "Makes me hope this console doesn’t have a RROD/YLOD type mass recall. A lot of that was from high heat messing up solder joints.",
              "score": 16,
              "created_utc": 1751604877.0,
              "replies": [
                {
                  "id": "n1fxee3",
                  "author": "DethSonik",
                  "body": "Just wrap a towel around it every few days.",
                  "score": 1,
                  "created_utc": 1751705341.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n1e8zwj",
          "author": "capn_clockwork",
          "body": "I heard of this but have never had this issue. My friend was having the issue and I asked if he turned on the battery saver mode to keep it at around 80%-90- charge to prolong the life of the battery and that fixed it. So try that yall.",
          "score": 2,
          "created_utc": 1751675020.0,
          "replies": []
        },
        {
          "id": "n1c33dp",
          "author": "hobo_chili",
          "body": "…does that happen in undocked mode too?",
          "score": 1,
          "created_utc": 1751648520.0,
          "replies": [
            {
              "id": "n1ca9ia",
              "author": "Horvat53",
              "body": "No in undocked mode it’s completely fine, at least with the games I’ve played so far. Just in docked mode it gets toasty.",
              "score": 3,
              "created_utc": 1751650670.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n151eo6",
      "author": "None",
      "body": "It does get extremely hot to the touch when docked, however i have yet to have any crashes or such.",
      "score": 53,
      "created_utc": 1751555580.0,
      "replies": []
    },
    {
      "id": "n151uoo",
      "author": "Noritzu",
      "body": "Switch 2 owner here and while it gets warm mine has never gotten hot let alone overheated even after several hours of docked play.",
      "score": 150,
      "created_utc": 1751555705.0,
      "replies": [
        {
          "id": "n15b71o",
          "author": "Spanky2k",
          "body": "Since the news article is just based on a couple of random reddit posts itself, I'll chime in with my data point here too. Another Switch 2 owner here. I use my Switch 2 exclusively in docked mode with the Switch itself in a media cupboard with minimal ventilation and it's been very hot here recently. I've not witnessed it overheating once yet. At least, I've not had any crashes or noticed any problems in performance etc.",
          "score": 74,
          "created_utc": 1751558319.0,
          "replies": [
            {
              "id": "n167vgs",
              "author": "SexyOctagon",
              "body": "Same boat as you. Notice how warm it is when I pull it out of the dock after playing for a while, but haven’t had any issues. \n\nI will, however, buy the first third party dock that has better cooling built in.",
              "score": 12,
              "created_utc": 1751567580.0,
              "replies": [
                {
                  "id": "n1f65ms",
                  "author": "cecil721",
                  "body": "Did you see the article that Nintendo might lock-out third party docks?",
                  "score": 6,
                  "created_utc": 1751689818.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n19cf3i",
              "author": "Flawedlogic41",
              "body": "Played BotW switch 2 docked and undocked up to 14 hearts, two full stamina, and 2 divine beast.\n\nNever once overheated, goes warm after a long time.",
              "score": 4,
              "created_utc": 1751607437.0,
              "replies": []
            },
            {
              "id": "n15g5cv",
              "author": "Shas_Erra",
              "body": "I also use it mainly docked and had next to no issues (one crash during cyberpunk due to enemies getting grenade happy)",
              "score": 8,
              "created_utc": 1751559737.0,
              "replies": [
                {
                  "id": "n15zw7o",
                  "author": "QuackNate",
                  "body": "I use mine to cook steaks and it sucks because it doesn’t get hot enough.",
                  "score": 16,
                  "created_utc": 1751565250.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n165xk5",
              "author": "TheWittyWarlock",
              "body": "RBW, is this you lol?",
              "score": 1,
              "created_utc": 1751567002.0,
              "replies": []
            },
            {
              "id": "n1hals6",
              "author": "Baconmaster2890",
              "body": "I'd make sure it has ventilation. heat = bad. the cooler you can it the better the components will last :)",
              "score": 1,
              "created_utc": 1751727963.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n17ls76",
          "author": "whatnowwproductions",
          "body": "Switch 2 owner here. It gets hot.",
          "score": 8,
          "created_utc": 1751582867.0,
          "replies": []
        },
        {
          "id": "n15kkq6",
          "author": "Fusionman29",
          "body": "Mine got hot but i moved it as a result. The original intent was to put it in a media cupboard without much space or airflow and yeah that runs hot. I just put it on top of the media cupboard instead and while I’m not a huge fan of seeing it in my peripheral, I’ve had no problem",
          "score": 2,
          "created_utc": 1751561007.0,
          "replies": []
        },
        {
          "id": "n17zotf",
          "author": "beaver_cops",
          "body": "Some would say you’re an expert at docking",
          "score": 1,
          "created_utc": 1751587686.0,
          "replies": []
        },
        {
          "id": "n18vkr7",
          "author": "Taki_Minase",
          "body": "Mine is actually cold playing Witcher 3.  Gets warm playing cyberpunk, but not hot.",
          "score": 1,
          "created_utc": 1751599843.0,
          "replies": []
        },
        {
          "id": "n1c3m0w",
          "author": "hobo_chili",
          "body": "Does it get warm in undocked mode?",
          "score": 1,
          "created_utc": 1751648675.0,
          "replies": []
        },
        {
          "id": "n1e98rk",
          "author": "capn_clockwork",
          "body": "Left this under another comment but my friend was having this issue and I've never had it, the difference was that I've turned on battery save mode to keep it around 80% charge in the settings. He changed that as well and the issue went away, so if anyone else is having this issue, try that.",
          "score": 1,
          "created_utc": 1751675121.0,
          "replies": []
        },
        {
          "id": "n17tn3c",
          "author": "terminalbungus",
          "body": "I overheat every time I engage in docked play for hours, but I don’t own a Switch….",
          "score": -7,
          "created_utc": 1751585541.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n14znnf",
      "author": "MultiMarcus",
      "body": "One or two Reddit posts really do not make a trend. It does run hot that is very important to understand. It shouldn’t be overheating and if it is please contact Nintendo and your retailer. Some faulty units out of 5 million sold Nintendo switch 2 really does not seem like a worrying trend.",
      "score": 648,
      "created_utc": 1751555086.0,
      "replies": [
        {
          "id": "n152wyj",
          "author": "CMDR_omnicognate",
          "body": "news companies very often just report on reddit threads now, its so annoying",
          "score": 298,
          "created_utc": 1751556005.0,
          "replies": [
            {
              "id": "n157r0e",
              "author": "not_a_moogle",
              "body": "How many times did I read an 'article' about switches with a staple in the screen.  It was one game stop and maybe 5-10 switches.\n\nNot even news worthy.",
              "score": 64,
              "created_utc": 1751557357.0,
              "replies": [
                {
                  "id": "n16gmwb",
                  "author": "JoostinOnline",
                  "body": "I'd argue it was newsworthy, but just needed a less misleading title. Major fuck ups (even if they only affect 5 people) should be reported on to prevent it from happening again.",
                  "score": -14,
                  "created_utc": 1751570138.0,
                  "replies": [
                    {
                      "id": "n16k2ck",
                      "author": "bianary",
                      "body": "An event that occurred at one store across the entire country does not need to be prevented from happening again, it's already just a fluke.",
                      "score": 16,
                      "created_utc": 1751571161.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n1552i0",
              "author": "ChronoMecha",
              "body": "Wishful thinking. Likely AI slop article.",
              "score": 29,
              "created_utc": 1751556605.0,
              "replies": [
                {
                  "id": "n157n9d",
                  "author": "CMDR_omnicognate",
                  "body": "oh no it's probably written mostly with ai, but their \"sources\" are just reddit posts and comments, you see it with a lot of tech news. it's so shit",
                  "score": 26,
                  "created_utc": 1751557328.0,
                  "replies": [
                    {
                      "id": "n15fltq",
                      "author": "Ven18",
                      "body": "I imagine a huge percentage of tech people get most of their news from Reddit so it’s not shocking they are not exactly bastions of journalistic excellence.",
                      "score": 3,
                      "created_utc": 1751559581.0,
                      "replies": []
                    },
                    {
                      "id": "n17si3p",
                      "author": "MetroidHyperBeam",
                      "body": "My phone's browser recommending me an article that's nothing but a paraphrased version of a Reddit thread I literally read the previous day is a frequent occurrence.",
                      "score": 1,
                      "created_utc": 1751585145.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n15tub2",
                  "author": "Onetimehelper",
                  "body": "Based on AI Reddit posts and comments ",
                  "score": 7,
                  "created_utc": 1751563569.0,
                  "replies": [
                    {
                      "id": "n15v3qa",
                      "author": "ChronoMecha",
                      "body": "Very likely lol",
                      "score": 1,
                      "created_utc": 1751563918.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n15bxhu",
              "author": "BluestreakBTHR",
              "body": "“News” companies",
              "score": 2,
              "created_utc": 1751558527.0,
              "replies": []
            },
            {
              "id": "n1727sw",
              "author": "ChewyBivens",
              "body": "That’s not really a new thing. Local news channels have always reported stories based on something happening to like one or two households for as long as I can remember. ",
              "score": -2,
              "created_utc": 1751576546.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n17xitq",
          "author": "CosmicCreeperz",
          "body": "“NintendoSoup also shared tweets from Japanese owners who complained that the console's fan can become very loud before crashing.”\n\nIt started there first, [lots of Japanese users reporting it](https://nintendosoup.com/japanese-users-complain-about-overheating-nintendo-switch-2-consoles-and-noisy-fans/).",
          "score": 18,
          "created_utc": 1751586894.0,
          "replies": []
        },
        {
          "id": "n188pp4",
          "author": "cloudcreeek",
          "body": "The fact that even you admitted it runs hot seems like it's a little bit more than a trend of \"one or two reddit posts.\"",
          "score": 7,
          "created_utc": 1751591066.0,
          "replies": [
            {
              "id": "n18ougb",
              "author": "MultiMarcus",
              "body": "Well, no, I mean it runs hot in the sense that it warms up and gets hot like any other battery powered gaming handheld.",
              "score": 0,
              "created_utc": 1751597128.0,
              "replies": [
                {
                  "id": "n1ewtjw",
                  "author": "cloudcreeek",
                  "body": "Why mention it then if it's just like any other battery? You even stipulated \"that is very important to understand.\"\n\nSorry, that was a very Redditor way of me replying, but it sounds like you aren't using it as often or in the same way as OP and other user on this post.",
                  "score": 1,
                  "created_utc": 1751685391.0,
                  "replies": [
                    {
                      "id": "n1ey859",
                      "author": "MultiMarcus",
                      "body": "Well, I was referring to how like my iPad even if I use it for an entire day it doesn’t warm up noticeably at all. Sure there’s probably actually some heat radiating from it but I can’t feel that. Meanwhile, something like a steam deck or my desktop PC or now the switch 2 feel slightly warm. Right out of the dock, it feels warmer but not like overheating level warm. Just warm to the touch. These gaming handhelds almost always run quite hot. The switch 2 is in my mind actually one of the ones that runs cooler. At least compared to the more high-powered windows based handhelds.",
                      "score": 0,
                      "created_utc": 1751686031.0,
                      "replies": [
                        {
                          "id": "n1eyk1r",
                          "author": "cloudcreeek",
                          "body": "Interesting. From my iPhone 12, when it's charging and I'm using it to watch streaming shows, it gets noticeably hot.\n\nSometimes it even needs to power off to cool down.\n\nI personally don't own a switch 2 but my laptop also gets noticeably hot. \n\nMaybe you just got lucky/have good enough ventilation in your place for it to not be an issue, but the fact that it's an issue for so many other people should tell you it isn't just a one-or-two person thing.",
                          "score": 1,
                          "created_utc": 1751686184.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n17by31",
          "author": "nonresponsive",
          "body": "I mean, the same was said about Nvidia 50 series and melting cables, but then more stories popped up. The article isn't calling it a trend, it's merely stating it's happening. And maybe more people will report it if they find it happening to them too. Wouldn't you want to know if there's an actual problem or not?",
          "score": 12,
          "created_utc": 1751579593.0,
          "replies": []
        },
        {
          "id": "n181cos",
          "author": "Domascot",
          "body": "That one lined thread has at least 10 users having issues. Hard to tell wether its probably a few 100s of faulty units or in the tenthousands. Either way, i dont think the article is exaggerating the matter.",
          "score": 4,
          "created_utc": 1751588303.0,
          "replies": []
        },
        {
          "id": "n15xld4",
          "author": "p0rty-Boi",
          "body": "Anecdotally: my switch died and I had to send in for repairs. I think it got fried on the dock.",
          "score": 8,
          "created_utc": 1751564608.0,
          "replies": []
        },
        {
          "id": "n1553fs",
          "author": "zeelbeno",
          "body": "\"I put it in direct sunlight during a heatwave and covered all the sides so limit the fans cooling\"\n\nBreaking News - Switch 2 can overheat and crash.",
          "score": 22,
          "created_utc": 1751556613.0,
          "replies": [
            {
              "id": "n161ocd",
              "author": "---TheFierceDeity---",
              "body": "It's unironically what's gotten this \"Nintendo says they'll brick your console remotely\" story to circulate. I went and read the EULA segment and as far as I can tell what it actually says is along the lines of \"If you illegally modify your system and a system update causes loss of function it is not Nintendo's responsibility, we will not fix it, patch it or replace your system\"\n\nNot \"Nintendo is gonna laser target your specific Switch and brick it if they detect modifications\". It's \"if we push out a regular system update and it is incompatible with your modifications, tough shit not on us to fix it\"",
              "score": 22,
              "created_utc": 1751565757.0,
              "replies": [
                {
                  "id": "n16h111",
                  "author": "Jediverrilli",
                  "body": "It’s the same Eula as the other consoles. They block access to servers but with the game card only having a key on them it makes them unplayable. \n\nI’m on the side of don’t do stupid shit on your console. I have an og switch that can be home brewed and I only used it for Pokémon because I’m lazy and didn’t want to train new pokemon every time I had an idea. \n\nI went online for years with it and nothing happened because I didn’t use pirated games. Just don’t be stupid and nothing will happen.",
                  "score": 7,
                  "created_utc": 1751570254.0,
                  "replies": []
                },
                {
                  "id": "n164wxl",
                  "author": "zeelbeno",
                  "body": "It's basically just reddit being an echo-chamber for people who hate Nintendo.",
                  "score": 13,
                  "created_utc": 1751566702.0,
                  "replies": [
                    {
                      "id": "n17xy0j",
                      "author": "CosmicCreeperz",
                      "body": "How is that true, 90% of comments on this post are violently defending Nintendo with even less information than the article attacking them…\n\nCorrect answer is “no one knows enough to generalize, let’s wait and see.”",
                      "score": 6,
                      "created_utc": 1751587046.0,
                      "replies": [
                        {
                          "id": "n18obto",
                          "author": "GTA_Masta",
                          "body": "You need to explore more subreddit then. some subreddit hating on Nintendo while other is trying to make a point.",
                          "score": 1,
                          "created_utc": 1751596931.0,
                          "replies": []
                        },
                        {
                          "id": "n19ngyt",
                          "author": "zeelbeno",
                          "body": "Ah, i see you've made your decision based on 1 reddit post.\n\nFking genius",
                          "score": 0,
                          "created_utc": 1751613198.0,
                          "replies": [
                            {
                              "id": "n1br8ao",
                              "author": "CosmicCreeperz",
                              "body": "And your comment just supports it, wittle bitty fanboy.  Being so insecure you have to insult someone over a game console.  Wow.",
                              "score": 0,
                              "created_utc": 1751644912.0,
                              "replies": [
                                {
                                  "id": "n1bxaeg",
                                  "author": "zeelbeno",
                                  "body": "Hey now i called you a genius!\n\nThat's a compliment.",
                                  "score": 1,
                                  "created_utc": 1751646759.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n178kcz",
                  "author": "hedoeswhathewants",
                  "body": "I mean, they absolutely do try to detect mods and \"disable\" them. Otherwise you could just unmod it and use it normally.",
                  "score": 4,
                  "created_utc": 1751578523.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n15iqcf",
              "author": "Saloncinx",
              "body": "Or inside of a closed door entertainment center cabinet where the top of the switch is less than an inch from the bottom of the ceiling and there's no airflow at all.",
              "score": 8,
              "created_utc": 1751560477.0,
              "replies": []
            },
            {
              "id": "n1jf0ga",
              "author": "RebekhaG",
              "body": "Breaking newest do not put it directly sunlight and put it in shade and it will be just fine. Mine was played in handheld during a heatwave and it did just fine in the shade under a ceiling fan in my outdoor kitchen.",
              "score": 1,
              "created_utc": 1751752697.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n175d0o",
          "author": "TwoBionicknees",
          "body": "i mean, just out of some very bad luck i watch like 4-5 streamers and I think 3 of them have had their mariokart lag constantly on stream as it overheats a lot. \n\nThe fact that by all accounts, the dock basically blocks off and insulates the design while the fan on teh dock is for the dock only and doesn't have holes and channels to push air at the switch itself is just hilariously awful design. lets have a fan to cool practically nothing... but not use it to cool the hot electrical device that costs $500.",
          "score": 5,
          "created_utc": 1751577516.0,
          "replies": []
        },
        {
          "id": "n14zwtr",
          "author": "ajc2123",
          "body": "I was gonna say, how many do we know of out of 5 mil sold.\n\nFeels click baity to me.",
          "score": 13,
          "created_utc": 1751555158.0,
          "replies": [
            {
              "id": "n152ng4",
              "author": "benjoo1551",
              "body": "News outlets doing clickait??? Nooooo they would never",
              "score": 6,
              "created_utc": 1751555930.0,
              "replies": []
            },
            {
              "id": "n15zzwv",
              "author": "VenomOnKiller",
              "body": "Don't worry! He said it in the article! Many! Many redditers said it! Many! /s",
              "score": 0,
              "created_utc": 1751565279.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n15c07a",
          "author": "stormblaz",
          "body": "Correct, reddit kept saying how no one will buy switch 2, when switch 1 is excellent, how horrible the screen is, how lack luster the chat etc is.\n\nWell, switch 2 was and is the fastest selling console in the world with 5 million sold first month.\n\nReddit is an absolute complete echo chamber that isnt even close to real life implication and any statistics reddit implies should be questioned and used with a grain of salt.",
          "score": 7,
          "created_utc": 1751558549.0,
          "replies": [
            {
              "id": "n174n93",
              "author": "noother10",
              "body": "Funny thing is, out of the bunch of people I know who have a Switch 1, none have bought a Switch 2 and don't want to. To them they don't like the cost and the fact they have to pay to upgrade their games to be on Switch 2. Most of them have Xbox or Playstation, hell some are even now starting up their computers they've not touched for years and trying to find parts to upgrade them.",
              "score": -3,
              "created_utc": 1751577295.0,
              "replies": [
                {
                  "id": "n18lxly",
                  "author": "DeusScientiae",
                  "body": "You're all broke asses aren't you?\n\nYou see, the people buying the switches have adult money. 500 bucks isn't shit for years of entertainment.",
                  "score": -3,
                  "created_utc": 1751596018.0,
                  "replies": [
                    {
                      "id": "n19gev6",
                      "author": "stewie3128",
                      "body": "... Says the guy whose wife won't let him spend $100 on an SSD.\n\nYeah, I checked your profile.",
                      "score": 3,
                      "created_utc": 1751609454.0,
                      "replies": [
                        {
                          "id": "n1afqj3",
                          "author": "DeusScientiae",
                          "body": "That was me replying to someone else who had that restriction, not me. Maybe you should learn how to read. \n\nThat's actually too funny.",
                          "score": 0,
                          "created_utc": 1751628603.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n2eog75",
                      "author": "None",
                      "body": "Or they just aren't interested yet because they have access to 99% of the exact same library of games on the Switch 1 at this point in time 🤷",
                      "score": 0,
                      "created_utc": 1752171358.0,
                      "replies": [
                        {
                          "id": "n2frtld",
                          "author": "DeusScientiae",
                          "body": "You buy Nintendo for the exclusives. Your point is invalid.",
                          "score": 1,
                          "created_utc": 1752182692.0,
                          "replies": [
                            {
                              "id": "n2gas3n",
                              "author": "None",
                              "body": "And damn near all of them are available on the *first* Switch.\n\n\nYour rebuttal is basically pointless to Switch 1 owners until 2027 when there's something other than MKW and DK Bonanza",
                              "score": 1,
                              "created_utc": 1752188665.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n17i03v",
                  "author": "SQL617",
                  "body": "1 in 3 people in Japan own a switch, pretty wild.",
                  "score": -1,
                  "created_utc": 1751581593.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n18ss9j",
              "author": "ChubbyChew",
              "body": "Im not sure if this works in the way that people imply.\n\n\nAs i see it gaming as an industry is still new enough that it would have consistent generational growth, no?\n\nWhich is to say every subsequent generation \"should\" consistently be having more and more people who are willing to approach games as a medium or who grew up with them.\n\nMy brothers around 40, and a lot of his nostalgia is centered around the SNES - PS1 era of games.\n\nHe still buys consoles, bought a switch 2 and i dont doubt there are a lot more people in his generation who do the same. Consider that generation the current rising ceiling.\n\nAll the kids being born after his generation are being born into an era where games have a lot more relevance and appeal. Until his generation literally starts to die of age or lose interest in games entirely. The pool of people who are likely to buy games should just be increasing. \n\nUnless a company or the market fails drastically somewhere, every subsequent console generation should be performing substantially better than the last. \n\nIt should be the expectation. Theyre gaining exponentially more relevant market. But its always played off as a suprise that growth is still happening lol\n\nAnd thats before we even talk about wider distribution, looking for more literal markets to sell.\n\nEven if an entire generation or even 2 decided \"this sucks\" the number probably still goes up lol",
              "score": 0,
              "created_utc": 1751598697.0,
              "replies": []
            },
            {
              "id": "n15e1nn",
              "author": "MultiMarcus",
              "body": "Yeah, and like I love mine. It has a bunch of issues. I hate that the screen is kind of miserable. I really dislike it and I refuse almost entirely to play on it when I can avoid it.",
              "score": -4,
              "created_utc": 1751559133.0,
              "replies": [
                {
                  "id": "n1654sa",
                  "author": "stormblaz",
                  "body": "You don't represent 5 million units sadly.",
                  "score": 1,
                  "created_utc": 1751566765.0,
                  "replies": [
                    {
                      "id": "n165nd3",
                      "author": "MultiMarcus",
                      "body": "I didn’t say I did. I was sharing my personal opinion about the console and the issues that I have with it specifically the screen. I never said at all that I was representative of a larger group of people. I was just sharing my personal opinion.",
                      "score": 3,
                      "created_utc": 1751566918.0,
                      "replies": [
                        {
                          "id": "n166amx",
                          "author": "stormblaz",
                          "body": "Thats the issue though, 5 people in reddit show their opinion which creates the echo chamber and isnt realistic, the screen sucks, its been rated as the slowest and worst lcd screen rated and tested by system testers in history, its abysmal, but people do not care in the grand scheme.\n\n\nBut i totally get your point is true.",
                          "score": -5,
                          "created_utc": 1751567110.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n15p7qv",
          "author": "ChafterMies",
          "body": "You need at least 2 Reddit posts to say “users”.",
          "score": 4,
          "created_utc": 1751562297.0,
          "replies": []
        },
        {
          "id": "n1509zy",
          "author": "donkey_tits_and_weed",
          "body": "I have a few hand held retro gaming consoles (retroids, anbernics, etc) and they all run hot.",
          "score": 4,
          "created_utc": 1751555261.0,
          "replies": []
        },
        {
          "id": "n18liqv",
          "author": "ChubbyChew",
          "body": "Heating was always an issue with Switch 1 in my experience.\n\nEveryone i knew irl eventually had some form of damage from it. Actually ended up sending mine to Nintendo and getting either a fix or replacement.\n\nI would like to think its something thatd be corrected with the Switch 2, but i have 0 expectation of that being the case.\n\nIf nothing else at least repairs and replacements (in my experience) were free. If not time consuming.\n\nAll we know for certain is whether its a legitimate design concern or not, too many people are going to look for ways to represent it as somehow always being the fault of the consumer.",
          "score": 1,
          "created_utc": 1751595863.0,
          "replies": []
        },
        {
          "id": "n1652nm",
          "author": "None",
          "body": "It’s okay to report on things that are happening. It doesn’t mean your console is bad, it’s just a thing to be aware of. Sometimes news is just news",
          "score": -1,
          "created_utc": 1751566748.0,
          "replies": [
            {
              "id": "n165ha5",
              "author": "MultiMarcus",
              "body": "Cool I don’t think that’s a problem. I’m not saying that you can’t make an article about it. I’m just commenting on that article and stating that I do not think that a couple of consoles having issues is representative of some overall hardware fault.  Sometimes news is just news but that doesn’t mean you can’t comment on that news and share additional information and context.",
              "score": 2,
              "created_utc": 1751566868.0,
              "replies": [
                {
                  "id": "n16bkdw",
                  "author": "None",
                  "body": "Sure but now you’re talking about actual fanboyism. Two times does suggest a trend, and the suggestion of a trend isn’t a reflection of your choices or the console design, it’s just a suggestion of a trend",
                  "score": 2,
                  "created_utc": 1751568660.0,
                  "replies": [
                    {
                      "id": "n16fj7m",
                      "author": "MultiMarcus",
                      "body": "It represents something that can happen, but it doesn’t represent a trend when it’s 2 out of 5,000,000 products. Obviously Nintendo should address this going forward both by repairing the damaged products and by changing their manufacturing and design process to reduce the risk of this fault occurring again but it’s not really a trend among switch 2 users.",
                      "score": 6,
                      "created_utc": 1751569814.0,
                      "replies": [
                        {
                          "id": "n16ihrs",
                          "author": "None",
                          "body": "Right. It’s the suggestion of a trend. The only question is why you feel the need to argue about that",
                          "score": 2,
                          "created_utc": 1751570689.0,
                          "replies": [
                            {
                              "id": "n16ise3",
                              "author": "MultiMarcus",
                              "body": "Because about 10 seconds after this post was posted I saw comments from people talking about how this was a $500 console and that it is ridiculous to have such bad quality control. 2 out of 5,000,000 units isn’t indicative of bad quality control.  That just isn’t how any kind of technology works the failure rate for tech is quite high unfortunately and sometimes things slip through quality control.",
                              "score": 1,
                              "created_utc": 1751570776.0,
                              "replies": [
                                {
                                  "id": "n16kpu6",
                                  "author": "None",
                                  "body": "So you work for Nintendo?",
                                  "score": 1,
                                  "created_utc": 1751571359.0,
                                  "replies": [
                                    {
                                      "id": "n16mxvl",
                                      "author": "MultiMarcus",
                                      "body": "No, I just have rudimentary understanding of how building any modern technology works.",
                                      "score": 3,
                                      "created_utc": 1751572018.0,
                                      "replies": [
                                        {
                                          "id": "n16o65s",
                                          "author": "None",
                                          "body": "And a vested interest in one side of this issue. That’s fanboyism, I had you pegged right at the start",
                                          "score": 7,
                                          "created_utc": 1751572381.0,
                                          "replies": [
                                            {
                                              "id": "n16oif1",
                                              "author": "MultiMarcus",
                                              "body": "I honestly have no idea what you are on about. What’s wrong with responding to people who are drawing a completely wrong conclusion based on a headline?",
                                              "score": 1,
                                              "created_utc": 1751572480.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n16igu8",
                      "author": "Jediverrilli",
                      "body": "2 times is not a trend. It’s a piece of electronics. Shit just doesn’t work sometimes it doesn’t mean there is an actual problem it means that 2 people got a dud. \n\nThe usually accepted failure rate for electronics varies but 2,5% for a major issue is usually acceptable. If this was an issue you would need 125k consoles from the first 5 million for this to be a widespread issue. \n\nThis isn’t a thing and I hate people think it is.",
                      "score": 1,
                      "created_utc": 1751570681.0,
                      "replies": [
                        {
                          "id": "n16imy4",
                          "author": "None",
                          "body": "Right. It’s merely the suggestion of a trend, and not something that should be sending you",
                          "score": 0,
                          "created_utc": 1751570731.0,
                          "replies": [
                            {
                              "id": "n16jsqd",
                              "author": "Jediverrilli",
                              "body": "But it’s not even a trend. 2 is such an insignificant number that nothing can be deduced from it other than 2 people had lemons.",
                              "score": 0,
                              "created_utc": 1751571078.0,
                              "replies": [
                                {
                                  "id": "n16ku57",
                                  "author": "None",
                                  "body": "It’s the suggestion of a trend. What aren’t you getting?",
                                  "score": 1,
                                  "created_utc": 1751571393.0,
                                  "replies": [
                                    {
                                      "id": "n17ve3w",
                                      "author": "MachinaThatGoesBing",
                                      "body": "Why do you keep using this weird phrase, \"The suggestion of a trend\"?\n\nThat phrase doesn't really mean anything, and 2 or 6 or 10 or even 20 consoles having an issue out of several million isn't a trend, *nor* does it remotely suggest one. Those are just pretty typical end of the MTBF bell curve numbers — if this is a problem and not human error.\n\nWith *any* piece of equipment, with any component going into a bigger piece of equipment, there's going to be a certain number that are on the edge of tolerance or on the edge of failure, but in completely undetectable ways. There is no amount of QA process that can remedy this; it's just kind of a fact of making something. It doesn't suggest bigger trends. \n\nWhen our iMac came in 2001 and the hard drive died in it after a couple months of working fine…that was frustrating, but not indicative of some kind of negligence on the manufacturer's part. Just a component that tested as working but was apparently on the edge.\n\nIt is irresponsible of a tech journalist to publish something suggesting that there are larger trends based on what is essentially statistical noise and gossip on a site where people post anonymously.\n\nLike all journalists, their job is to increase people's knowledge about the world. That includes sharing knowledge about normal manufacturing flaw rates that they ought to possess, if they're at all qualified for their job.\n\nIf a pattern emerges of an actually significant number of units all with the same issue — and with some degree of certainty that user error isn't at fault — then it starts to get outside of the territory of normalcy, and it becomes worth reporting on.\n\n----------------\n\nEven when there is a trend, it doesn't always suggest negligence. When every single one of the dozen to two dozen Dell Optiplex GX270 desktops we had at my workplace in 2006 needed a motherboard replacement because of bad capacitors…that actually did suggest that there might be a larger issue. (Though it could still have just been an issue confined to that run.) Even then, it wasn't necessarily one the manufacturer should have been able to catch, given that the failures all happened after about 4-5 years of use. I don't see any reasonable way to test for this sort of failure before shipping out.\n\n(Though it *is* probably something their supplier should have caught while stress testing their capacitor designs.)",
                                      "score": 0,
                                      "created_utc": 1751586145.0,
                                      "replies": [
                                        {
                                          "id": "n180pac",
                                          "author": "None",
                                          "body": "“2 suggests a trend” is a cliche, because it does lol\n\nLook at all those words you typed",
                                          "score": 1,
                                          "created_utc": 1751588061.0,
                                          "replies": [
                                            {
                                              "id": "n1aqzjn",
                                              "author": "MachinaThatGoesBing",
                                              "body": "I wrote all that because I just get tired of seeing people loosing their heads and saying stupid shit that betrays not only their absolutely self-assured ignorance about how things work, but also a lack of curiosity or inquisitiveness around how they actually do work.\n\nLots of clichés and popular notions simply aren't reflective of reality. There's a ton of bunk and hooey that passes around as \"common knowledge\". (Also, this isn't a cliché that I've ever heard. It's an almost preschool-level concept of what a \"trend\" looks like.)\n\nTwo occurrences of *anything* is basically never enough data to suggest a \"trend\". It's just far too little information. Even for something *very unlikely*, it simply happening twice in close succession doesn't suggest a \"trend\". Because with enough chances to occur, you're basically *guaranteed* to get clustering of low-likelihood events now and then — especially if your line of demarcation for a cluster is a number as statistically insignificant as *two*.\n\nAnd for something that has sold 5.4 million units, you are guaranteed a few instances of almost any imaginable flaw. If there start to be hundreds and hundreds of reports, *that* would actually start to suggest some real design flaw, significant manufacturing error, or run of bad components — as opposed to expected random failures.\n\nTwo heads ups in a row on a quarter doesn't suggest a trend, certainly. Not if you know anything about how the world works.\n\nAnd if you know just a little bit about how manufacturing or electronics work, you also know that a few reports of any particular uncommon flaw on a product are *basically guaranteed*.",
                                              "score": 1,
                                              "created_utc": 1751633254.0,
                                              "replies": [
                                                {
                                                  "id": "n1ar458",
                                                  "author": "None",
                                                  "body": "You did it because you’re a fanboy. \n\nTwice.",
                                                  "score": 0,
                                                  "created_utc": 1751633302.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n196aio",
          "author": "MrPrickyy",
          "body": "One Nintendo D rider’s comment doesn’t discount the fact that people’s $500 consoles are breaking",
          "score": 0,
          "created_utc": 1751604517.0,
          "replies": []
        },
        {
          "id": "n15keyb",
          "author": "browsk",
          "body": "I mean tons of streamers playing the new Mario kart would start crashing and freezing after like 2 hours while in docked mode, definitely isn’t some 1 or 2 off thing",
          "score": -4,
          "created_utc": 1751560962.0,
          "replies": [
            {
              "id": "n15wwjz",
              "author": "browsk",
              "body": "Damn Nintendo really be sliding on Opps fr on god",
              "score": -7,
              "created_utc": 1751564418.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n156z1j",
          "author": "nanapancakethusiast",
          "body": "Thank you for doing a billion dollar corporation’s PR for them for free, I’m sure they appreciate it",
          "score": -13,
          "created_utc": 1751557140.0,
          "replies": [
            {
              "id": "n15acoc",
              "author": "someguy50",
              "body": "I'm so glad righteous people like you are here to keep invalid opinions under control",
              "score": 1,
              "created_utc": 1751558083.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n16gv1p",
          "author": "None",
          "body": "So how many need to before recalls?",
          "score": -5,
          "created_utc": 1751570204.0,
          "replies": [
            {
              "id": "n17kh7i",
              "author": "Questjon",
              "body": "The xBox 360 never recalled with first year failure rates of around 20% (the red ring of death).",
              "score": 1,
              "created_utc": 1751582429.0,
              "replies": [
                {
                  "id": "n188t0x",
                  "author": "None",
                  "body": "Xbox had a legendary warranty service up until the Xbox x one. They replaced or repaired every Xbox unit for free. I went through like 5/6 Xbox original & 360 units combined. They’re old warranty service  didn’t have an expiration before Xbox one x and the reason why I likely stayed Xbox. ❤️",
                  "score": 0,
                  "created_utc": 1751591101.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n16i0ce",
              "author": "MultiMarcus",
              "body": "Tens of thousands, honestly. This doesn’t seem to be a dangerous level of overheating all of the safety mechanisms are triggering as they should and shutting off the console. It doesn’t even seem to damage the console. Just like with any product if it’s broken by a manufacturing fault you should send it back. A recall is only really done in the case of a safety problem or complete failure of product and that’s not the case here it seems that some isolated units are having issues and obviously those should get fixed.",
              "score": -1,
              "created_utc": 1751570545.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n170um4",
      "author": "colonelc4",
      "body": "That means they'll update it and fix this by throttling the console, that's bad news ! I hope they chose the undervolting route instead.",
      "score": 9,
      "created_utc": 1751576140.0,
      "replies": []
    },
    {
      "id": "n173i69",
      "author": "Bayako7",
      "body": "I had some docked split fiction sessions where afterwards I felt that the switch was really hot. Other sessions-  nothing. And I would say it’s quite a demanding game on switch given it’s a launch title and looks really compared to other console versions. \nIt seems the switch running hot might also be triggered with WiFi connection or LAN confection and stuff happening in the background. Like system firmware download or patches download or something else.",
      "score": 5,
      "created_utc": 1751576943.0,
      "replies": []
    },
    {
      "id": "n16b23i",
      "author": "dropthemagic",
      "body": "Well mine doesn’t crash or anything. But in docked mode playing open world. It is hot af when I pull it out and the fans go crazy. Idk why they just don’t make the fan run faster while docked",
      "score": 11,
      "created_utc": 1751568511.0,
      "replies": [
        {
          "id": "n17lkss",
          "author": "None",
          "body": "[deleted]",
          "score": -1,
          "created_utc": 1751582799.0,
          "replies": [
            {
              "id": "n17nfay",
              "author": "ZzzSleep",
              "body": "The dock does have a fan.",
              "score": 5,
              "created_utc": 1751583423.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n18659o",
      "author": "celsowm",
      "body": "Being an early adopter has a price to pay",
      "score": 11,
      "created_utc": 1751590104.0,
      "replies": []
    },
    {
      "id": "n153a6g",
      "author": "007Ati",
      "body": "Remains pretty cool next to my PS5 pro. No crashes or anything after about 150h playtime",
      "score": 24,
      "created_utc": 1751556107.0,
      "replies": [
        {
          "id": "n153xen",
          "author": "flirtmcdudes",
          "body": "🆒",
          "score": -31,
          "created_utc": 1751556289.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n1530xy",
      "author": "Fankuan19",
      "body": "I have played hours straight of cyberpunk while docked, arguably the most demanding game currently on the system, with 0 issues",
      "score": 30,
      "created_utc": 1751556035.0,
      "replies": [
        {
          "id": "n15nl45",
          "author": "DarkLinkLightsUp",
          "body": "I have crashed the game a few times",
          "score": 21,
          "created_utc": 1751561846.0,
          "replies": [
            {
              "id": "n16las6",
              "author": "iknowhowtoread",
              "body": "Yes I’ve had it crash too. Once when doing a car delivery out of dog town for El Capitan Muamar, and I don’t remember the other times. At least twice though.",
              "score": 7,
              "created_utc": 1751571532.0,
              "replies": []
            },
            {
              "id": "n15wa6z",
              "author": "Fankuan19",
              "body": "That was just a chrome'd out netrunner, choom",
              "score": 12,
              "created_utc": 1751564246.0,
              "replies": [
                {
                  "id": "n15zw2u",
                  "author": "DarkLinkLightsUp",
                  "body": "Funny enough, it was when I looked in a mirror that it crashed one of the times. Other notable crash was the shopping mall with Sasquatch.",
                  "score": 8,
                  "created_utc": 1751565249.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n18vpp8",
              "author": "Taki_Minase",
              "body": "I had a weird black screen but the game and audio was still running.  Restarted, and fine.",
              "score": 3,
              "created_utc": 1751599900.0,
              "replies": [
                {
                  "id": "n18y9bz",
                  "author": "DarkLinkLightsUp",
                  "body": "Save early and save often.",
                  "score": 2,
                  "created_utc": 1751600964.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n160gr4",
              "author": "Anon28301",
              "body": "That’s normal for cyberpunk on any platform.",
              "score": 2,
              "created_utc": 1751565411.0,
              "replies": [
                {
                  "id": "n1658bn",
                  "author": "Wank_my_Butt",
                  "body": "tbh the PC version runs flawlessly for me now. They really worked hard to finish the game they sold us before finishing it.",
                  "score": 10,
                  "created_utc": 1751566793.0,
                  "replies": [
                    {
                      "id": "n17ac2a",
                      "author": "toyic",
                      "body": "PC version is completely unplayable if you have an AMD graphics card. Crashes to desktop. CDPR has it as a known issue and hasn't fixed it, so respectfully, get out of here with the they've worked hard to finish it, because it's still far from finished.\n\n\n I still feel scammed and have for years. Bought it launch day for my PS4 only to realize I'd been lied to and it was unplayable, instead of a refund I was offered a GOG copy. So I foolishly got that thinking it would be better. Nope. Utterly unplayable if you don't have an Nvidia graphics card.\n\nSo, cyberpunk is a game I can only watch other people have fun with, while I enjoy my $60 paperweight.\n\n\nI keep telling myself one of these days it'll be worth it, and like an utter fool I'm still somehow looking forward to Witcher 4. I keep hoping it'll be better this time but I know that's copium.",
                      "score": -3,
                      "created_utc": 1751579084.0,
                      "replies": [
                        {
                          "id": "n193tle",
                          "author": "Mhugs05",
                          "body": "I had a pc with a amd 6900xt that ran cyberpunk fine.  You can't run all the rt features as expected but it plays fine .",
                          "score": 1,
                          "created_utc": 1751603387.0,
                          "replies": [
                            {
                              "id": "n1bs5mx",
                              "author": "toyic",
                              "body": "Dude how? I have a 6900 too and it crashes to desktop every hour even when I disable raytracing?",
                              "score": 1,
                              "created_utc": 1751645192.0,
                              "replies": [
                                {
                                  "id": "n1ckhxd",
                                  "author": "Mhugs05",
                                  "body": "It's been years since I had it but never had an issue running it stock with up to date drivers.  \n\nYou have an under volt of overclock?  That can cause that behavior.",
                                  "score": 1,
                                  "created_utc": 1751653848.0,
                                  "replies": [
                                    {
                                      "id": "n1d5kbb",
                                      "author": "toyic",
                                      "body": "https://www.amd.com/en/resources/support-articles/release-notes/RN-RAD-WIN-25-6-3.html#:\\~:text=Known%20Issues,-Stutter%20may%20be&text=Intermittent%20system%20or%20application%20crash%20may%20be%20observed%20while%20playing,Radeon%E2%84%A2%20RX%209000%20series.\n\n  \nSorry, I have a 7900, not a 6900- I was wrong on that. Looks like it's an issue with the 7 series on cards just not working with the game.",
                                      "score": 1,
                                      "created_utc": 1751660713.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "n17oinu",
                          "author": "Wank_my_Butt",
                          "body": "> get out of here with […]\n\nYeah, I use NVIDIA, so it’s been the opposite experience for me. No need to be rude. It’s shit if it’s as you say. CDPR used to be my favorite dev studio, and they still can do well, but I’m way more skeptical of them now.",
                          "score": 1,
                          "created_utc": 1751583791.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n195zjt",
          "author": "alvask88z4",
          "body": "good for you",
          "score": 0,
          "created_utc": 1751604376.0,
          "replies": [
            {
              "id": "n1a3e2a",
              "author": "Fankuan19",
              "body": "Thanks!",
              "score": 1,
              "created_utc": 1751622328.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n156f6f",
      "author": "xavPa-64",
      "body": "The algorithm sure does love anti-Switch 2 engagement. \n\nAnd I guess right now I’m actively making it worse….",
      "score": 38,
      "created_utc": 1751556986.0,
      "replies": [
        {
          "id": "n1579sn",
          "author": "debaserr",
          "body": "All the new Switch owners get engaged by it as well as the corresponding group of haters.",
          "score": 8,
          "created_utc": 1751557223.0,
          "replies": []
        },
        {
          "id": "n1bbuay",
          "author": "AbroadNo1914",
          "body": "They don’t call it rage bait for nothing",
          "score": 0,
          "created_utc": 1751640288.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n151h7q",
      "author": "someguy50",
      "body": "Quick, get any critical anecdotal story to the front page",
      "score": 26,
      "created_utc": 1751555600.0,
      "replies": [
        {
          "id": "n16rhj1",
          "author": "cellsAnimus",
          "body": "“Are these switch users in the room with us now?”",
          "score": -2,
          "created_utc": 1751573373.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n18pl95",
      "author": "kovi2772",
      "body": "My switch 2 asnt had overeating to my knowledge but the bottom fan panels never exhale heat ever docked or not",
      "score": 3,
      "created_utc": 1751597418.0,
      "replies": [
        {
          "id": "n1jfxzq",
          "author": "RebekhaG",
          "body": "Lie mine stars the fans in dock mode when I'm outside when it's not 95 degrees fahrenheit and I play Mario Kart World for awhile the fan kicks on while in dock mode.",
          "score": 1,
          "created_utc": 1751753020.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n1a4pmg",
      "author": "Rare-Environment-198",
      "body": "Color me surprised",
      "score": 3,
      "created_utc": 1751623060.0,
      "replies": []
    },
    {
      "id": "n1algz5",
      "author": "TheTinRam",
      "body": "This is why you don’t buy day one. Also, you know they’re going to release OLED down the line as if it’s an improvement. It’s not, it should be the expectation but they decided to sandbag the first switch 2",
      "score": 3,
      "created_utc": 1751631086.0,
      "replies": [
        {
          "id": "n1qhaw3",
          "author": "TwanToni",
          "body": "exactly.  They used a hybrid 8/10nm closer to samsung 10nm node than their 8nm all the while having a cheap LCD monitor then they jacked up the accessories to mind blowingly stupid prices......",
          "score": 2,
          "created_utc": 1751852146.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n1dgfmj",
      "author": "TropicalLoneWolf",
      "body": "Switch 2?  \nMore like Switch 2 early.  \nOhhhhh!",
      "score": 3,
      "created_utc": 1751664300.0,
      "replies": []
    },
    {
      "id": "n150xvl",
      "author": "SheriffCrazy",
      "body": "I remember my day 1 Wii had an issue with av a month or two into owning it. I sent it in and Nintendo replaced it. It can happen to anything tbh. I doubt it’s widespread but would be pretty wild if it was.",
      "score": 4,
      "created_utc": 1751555448.0,
      "replies": []
    },
    {
      "id": "n167n0j",
      "author": "mpworth",
      "body": "I've played for hours in docked mode. Come to think of it, I have not played it in handheld mode even once. The only problem I've noticed is that in BOTW, the audio during cut scenes will stutter and get out of sync with the video. But I think that's more of a software problem from what I understand.",
      "score": 5,
      "created_utc": 1751567509.0,
      "replies": []
    },
    {
      "id": "n1639hd",
      "author": "AliveAndNotForgotten",
      "body": "I tried docking once and it was definitely hot.",
      "score": 5,
      "created_utc": 1751566220.0,
      "replies": [
        {
          "id": "n16p7h5",
          "author": "Neo_Techni",
          "body": "wink",
          "score": 1,
          "created_utc": 1751572688.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n15opei",
      "author": "aberrod",
      "body": "And this is why I don't early adopt anything anymore.",
      "score": 8,
      "created_utc": 1751562156.0,
      "replies": []
    },
    {
      "id": "n16iqg9",
      "author": "tdan84",
      "body": "Premium beta testers",
      "score": 5,
      "created_utc": 1751570761.0,
      "replies": []
    },
    {
      "id": "n155dr6",
      "author": "AstronautGuy42",
      "body": "Haven’t had a single technical issue with the switch 2 tbh. Had way way more crashes with my ps5 base on launch",
      "score": 8,
      "created_utc": 1751556694.0,
      "replies": [
        {
          "id": "n158lio",
          "author": "reddithater212",
          "body": "That means all of em should be good! Thanks, Bret.",
          "score": -21,
          "created_utc": 1751557593.0,
          "replies": [
            {
              "id": "n158u8e",
              "author": "AstronautGuy42",
              "body": "My experience is anecdotal. Just like this article is.",
              "score": 9,
              "created_utc": 1751557660.0,
              "replies": [
                {
                  "id": "n16q3ay",
                  "author": "Neo_Techni",
                  "body": "I'm reasonably sure they used a sample size larger than one though",
                  "score": 0,
                  "created_utc": 1751572954.0,
                  "replies": [
                    {
                      "id": "n1947mi",
                      "author": "Mhugs05",
                      "body": "There are many replies on here all saying their switch 2s run fine docked.  Mine has also had zero issues.",
                      "score": 2,
                      "created_utc": 1751603566.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n1ej2yc",
      "author": "Lagneaux",
      "body": "I'll say it again, and probably get downvoted again.\n\nThe Switch 0.7 ain't going so well. \n\nIt's like they released a prototype oled without a bunch of features",
      "score": 2,
      "created_utc": 1751679330.0,
      "replies": [
        {
          "id": "n4r7f8b",
          "author": "Financial_Warning534",
          "body": "Now that's some *cope* if I ever read it. 😂🫵",
          "score": 0,
          "created_utc": 1753293943.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n1k7tgc",
      "author": "awfulcitizen",
      "body": "Since I got my Switch 2, I have been playing it mostly in handheld mode, with no issues.  Today I plugged it into the Dock, and played 15 minutes Mario Kart 10, with my wife and the console froze and gave me the too hot temperature reading and it shut itself down.\n\nWhen I held the console in my hands, it was fuming hot. Whatever internal cooling Nintendo came up with is clearly not working.  I could understand if the game I was playing was something like Cyberpunk, but it really baffled me that Mario Kart would get the console to generate so much heat...\n\nI have a ba feeling about this.",
      "score": 2,
      "created_utc": 1751763419.0,
      "replies": []
    },
    {
      "id": "n17n5m2",
      "author": "Madmandocv1",
      "body": "Always wait for the second version.",
      "score": 5,
      "created_utc": 1751583330.0,
      "replies": [
        {
          "id": "n17w1cm",
          "author": "SnooPies6274",
          "body": "2-3 years from now? People need their Nintendo now!",
          "score": 3,
          "created_utc": 1751586368.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n15ol6d",
      "author": "Optimus_Prime_Day",
      "body": "I run mine only in docked mode, and its in a cabinet with other electronics... no issues whatsoever.\n\nIm guessing one or two users had bad fans in their docks.",
      "score": 3,
      "created_utc": 1751562123.0,
      "replies": []
    },
    {
      "id": "n15391l",
      "author": "AjaniTheGoldmane",
      "body": "Mine has been freezing a lot this week and I was starting to wonder if there was a red ring type of thing. This at least tells me I'm not alone.\n\nEDIT - Dock is sitting on a hard, flat surface out in the open in a house with the thermostat set on 70.\n\nHas locked up and required a hard shutdown on Mario Kart World in the dock and in handheld. Needed a reset on Mario Maker 2 in handheld, too.",
      "score": 5,
      "created_utc": 1751556098.0,
      "replies": []
    },
    {
      "id": "n16vl29",
      "author": "thumb_emoji_survivor",
      "body": "Nintendo fans: “I actually kind of like it, it’s a reminder to take a break”",
      "score": 4,
      "created_utc": 1751574578.0,
      "replies": [
        {
          "id": "n1aecls",
          "author": "Streetperson12345",
          "body": "Haha, this is so true, as with any of the diehards.",
          "score": 1,
          "created_utc": 1751627965.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n15e081",
      "author": "jetstobrazil",
      "body": "‘Switch 2 owners report not overheating and crashing in all games’ didn’t get them the same clicks",
      "score": 2,
      "created_utc": 1751559121.0,
      "replies": []
    },
    {
      "id": "n15s5mz",
      "author": "PeterMode",
      "body": "Had mine since release day. No issues thus far.",
      "score": 2,
      "created_utc": 1751563107.0,
      "replies": []
    },
    {
      "id": "n180u14",
      "author": "liquidsyphon",
      "body": "When OLED?",
      "score": 2,
      "created_utc": 1751588111.0,
      "replies": []
    },
    {
      "id": "n16k9oi",
      "author": "Devilofchaos108070",
      "body": "Yikes.\n\n\nYeah glad I didn’t buy into the hype and waited",
      "score": 2,
      "created_utc": 1751571224.0,
      "replies": []
    },
    {
      "id": "n16xr0t",
      "author": "RedArmyRockstar",
      "body": "That's what happens when you buy mediocre hardware from a shady company!",
      "score": 1,
      "created_utc": 1751575220.0,
      "replies": []
    },
    {
      "id": "n16bvtj",
      "author": "Boulderdrip",
      "body": "at this point anyone who buys ANY product on launch is a gullible FOOL. Companies have PROVEN that their current strategy is release unfinished products, and MAYBE fix it later once people already bought it.",
      "score": 2,
      "created_utc": 1751568754.0,
      "replies": []
    },
    {
      "id": "n174fvw",
      "author": "dpahs",
      "body": "The overheating comes from the switch having Ethernet even while sleeping.\n\nI saw a Reddit post about that, turned it off and it's not warm to touch anymore.\n\nNintendo does need to fix that issue though",
      "score": 2,
      "created_utc": 1751577233.0,
      "replies": []
    },
    {
      "id": "n16e1yg",
      "author": "Difficult_Two_2201",
      "body": "So glad I didn’t spend the money. Def waiting at least a year for all of the early kinks to (hopefully) get worked out",
      "score": 2,
      "created_utc": 1751569382.0,
      "replies": []
    },
    {
      "id": "n16eax1",
      "author": "KananX",
      "body": "It’s a terrible overpriced device, outdated hardware that eats too much power, badly designed dock that overheats the device aside from general overheating due to either bad design or outdated hardware, infamous “Ampere” architecture of Nvidia that was never well known to be efficient, all this for the great price of just 500 bucks. Sadly people didn’t boycott it because until this point it wasn’t well known how bad the device truly is, in the end it’s 200-300 bucks worth at best sold at 500 and you have to deal with these issues, didn’t even mention the 2002 era sluggish LCD screen. Oh and the games are also cheap at just 80 bucks or so per game. All in all a “great” deal I bet.",
      "score": 1,
      "created_utc": 1751569453.0,
      "replies": [
        {
          "id": "n16ooiu",
          "author": "AntiGrieferGames",
          "body": "Interesting that even the x86 Devices are much superior, better and newer than a switch 2, which are z1 extreme aka 2023 chips.\n\nThe Switch 2 uses a 2020 nvidia architecture (aka Ampere), which is no wonder why its ineffiecy, also Apere is made by Samsung, which is the overheat issue knowing for that. And Samsung Chips are very known to be crappy. Not much issue on a desktoplineout (laptop not aswell?), but the arm versions yes.",
          "score": 7,
          "created_utc": 1751572531.0,
          "replies": [
            {
              "id": "n1974xd",
              "author": "Mhugs05",
              "body": "Dlss makes it better than any other current handheld using AMD apu alone.  There's a good digital foundry in depth look at cyberpunk and it runs it better than pretty much every other handheld available while using less power.",
              "score": 1,
              "created_utc": 1751604905.0,
              "replies": [
                {
                  "id": "n19pu85",
                  "author": "AntiGrieferGames",
                  "body": "I didnt talking about upscaling tho.",
                  "score": 0,
                  "created_utc": 1751614531.0,
                  "replies": [
                    {
                      "id": "n1ag8uh",
                      "author": "Mhugs05",
                      "body": "Ok that makes no sense.  It is objectively better and is on by default with switch games.  People also run fsr on PC handhelds because they are not powerful enough to run at native resolution and end up being unplayable if not.",
                      "score": 2,
                      "created_utc": 1751628833.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n195xiu",
          "author": "Mhugs05",
          "body": "It's very competitive at its price point.  Runs pretty much every game that's available better than a steam deck while using less power and costing less.  I also wouldn't be surprised to see a firmware update for the screen adding overdrive that takes care of the motion blur.  I'd also much rather have a slower refresh speed monitor with vrr vs even an OLED without vrr.  \n\nThere's lots of very in depth analysis on digital foundry especially cyberpunk going into detail about the performance.  It even regularly beats out the Xbox series s because of how good dlss is even though it's running at a lower internal resolution and consuming a fraction of the power.  DLSS makes it better than all of the other handhelds available because they currently all only have fsr3 at best which is trash.",
          "score": 4,
          "created_utc": 1751604350.0,
          "replies": [
            {
              "id": "n1baftk",
              "author": "KananX",
              "body": "The steam deck has a great screen and doesn’t overheat, the steam deck is a fully usable PC the Switch is not, try again , you sound like a Nvidia fanboy, pathetic to be a corporate trillion dollar ass kisser in 2025 while those same people don’t give a fuck about you and demand highest prices while ripping you off with bad products. Also the ROG Ally completely destroys the Switch in every regard, learn to open your eyes get minimal information about tech and come back.",
              "score": -1,
              "created_utc": 1751639859.0,
              "replies": [
                {
                  "id": "n1bcm7w",
                  "author": "Mhugs05",
                  "body": "Your the idiot here.  It doesn't overheat.  Sitting by the pool right now and no issues.  Docked playing for many hours, no issues.  Steam deck runs steamos which isn't a full  PC OS but a Linux build that is solely for gaming.  Every version of the steamdeck is non vrr making them all trash.  Rog aly has a shitty little tiny screen and Asus is a horrible anti consumer company worse than Nvidia and Nintendo combined.  \n\nMaybe you should open your eyes, anyone with decent vision can see anything running fsr3 and back is absolutely trash compared to even the lightweight dlss on the switch.  \n\nAnd, I'll buy a steam deck whenever an updated one comes out too, so I don't really care.  It'll pair well with my 9800x3d 5080 PC.  Also can run steamlink from my nice pc on my tandem oled iPad pro.  Got lots of options.",
                  "score": 2,
                  "created_utc": 1751640525.0,
                  "replies": [
                    {
                      "id": "n1f6rlv",
                      "author": "cecil721",
                      "body": "You're*, checkmate.",
                      "score": 1,
                      "created_utc": 1751690129.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n17mchw",
          "author": "whatnowwproductions",
          "body": "It’s none of what you said. The only poor part is the screen and battery.",
          "score": -4,
          "created_utc": 1751583059.0,
          "replies": [
            {
              "id": "n1866w2",
              "author": "None",
              "body": "[deleted]",
              "score": -1,
              "created_utc": 1751590121.0,
              "replies": [
                {
                  "id": "n19fbae",
                  "author": "whatnowwproductions",
                  "body": "And yet I have plenty of criticism to give. If you're going to look though my profile at least do it properly instead of doing half the job.",
                  "score": 1,
                  "created_utc": 1751608889.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n16ib23",
          "author": "Banmers",
          "body": "lemmie guess, you bought 3?",
          "score": -6,
          "created_utc": 1751570633.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n15a9b0",
      "author": "Ok_Professional1414",
      "body": "If only they allowed 3rd party docks",
      "score": 1,
      "created_utc": 1751558057.0,
      "replies": []
    },
    {
      "id": "n16acpd",
      "author": "Kiseido",
      "body": "I wonder if those people with overheating managed to plug up the air intakes with lint or something.",
      "score": 1,
      "created_utc": 1751568304.0,
      "replies": [
        {
          "id": "n16osx7",
          "author": "Neo_Techni",
          "body": "that soon? doubt it",
          "score": 2,
          "created_utc": 1751572568.0,
          "replies": [
            {
              "id": "n18oy3f",
              "author": "Kiseido",
              "body": "With how many people already have them, surely some small percentage of people will have been using them in a place with lots of fluff or dust",
              "score": 1,
              "created_utc": 1751597167.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n19ih0f",
      "author": "Deceptiveideas",
      "body": "Curious if these people are storing them in tv cabinets causing a lack of air flow.",
      "score": 1,
      "created_utc": 1751610528.0,
      "replies": []
    },
    {
      "id": "n19my5w",
      "author": "RiseUpHunkerDown",
      "body": "I don’t own one yet but for me it’s definitely a “when not if” purchase- sorry if this is a dumb question but is this something that can be mitigated by hardware updates? Or should I anticipate potentially buying an aftermarket cooling attachment or something",
      "score": 1,
      "created_utc": 1751612912.0,
      "replies": [
        {
          "id": "n1dm05a",
          "author": "Neo_Techni",
          "body": "> but is this something that can be mitigated by hardware updates? \n\nyes",
          "score": 1,
          "created_utc": 1751666248.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n19tx9y",
      "author": "mtsim21",
      "body": "Never had mine hot to touch and used it in both modes a fair bit.",
      "score": 1,
      "created_utc": 1751616848.0,
      "replies": []
    },
    {
      "id": "n1a3my4",
      "author": "ShadowValent",
      "body": "The dock has a fan. Seems like they need to be more aggressive with it through a firmware update.",
      "score": 1,
      "created_utc": 1751622466.0,
      "replies": []
    },
    {
      "id": "n1aca8i",
      "author": "N-Haezer",
      "body": "![gif](giphy|A7ZbCuv0fJ0POGucwV)",
      "score": 1,
      "created_utc": 1751626995.0,
      "replies": []
    },
    {
      "id": "n1acvul",
      "author": "SMikahla",
      "body": "Dock mode has always been the Switch's weak point. Cramming that much heat into such a small space was bound to cause problems.",
      "score": 1,
      "created_utc": 1751627282.0,
      "replies": []
    },
    {
      "id": "n1adhe3",
      "author": "Theadra",
      "body": "buy a USB fan and mount it to the dock in a way that moves air away from the thing, learned this during the S1 while playing, well anything.",
      "score": 1,
      "created_utc": 1751627565.0,
      "replies": []
    },
    {
      "id": "n1aepsm",
      "author": "EVGACAB",
      "body": "Huh it just feels a little warm to me. Like what I would expect",
      "score": 1,
      "created_utc": 1751628137.0,
      "replies": []
    },
    {
      "id": "n1dpi4e",
      "author": "Trip4Life",
      "body": "This is why I didn’t buy it at launch. There’s always some issue with the first shipment that’s missed until mass numbers are out within the population. This will probably be fixed in the next two big shipments and be working great in 6 months to a year.",
      "score": 1,
      "created_utc": 1751667527.0,
      "replies": []
    },
    {
      "id": "n1f5ly3",
      "author": "Power0fTheTribe",
      "body": "Why do people even bother buying the switch 2 when a better switch 2 will be here next year",
      "score": 1,
      "created_utc": 1751689543.0,
      "replies": [
        {
          "id": "n1lfdve",
          "author": "Sulsamaimi",
          "body": "Most people don't want to wait a year for a marginally better console",
          "score": 1,
          "created_utc": 1751783449.0,
          "replies": [
            {
              "id": "n1lgh86",
              "author": "Power0fTheTribe",
              "body": "As if the switch 2 isn’t a marginally better switch 1? Arguably WORSE than the OLED apparently?",
              "score": 1,
              "created_utc": 1751784076.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n1fckln",
      "author": "HGLatinBoy",
      "body": "The OG switch was known to warp from the heat in dock mode. I’m surprised the extra fan was only put in to hel cool down the dock and not the system itself ",
      "score": 1,
      "created_utc": 1751693179.0,
      "replies": []
    },
    {
      "id": "n1gl5qt",
      "author": "infamusforever223",
      "body": "Guess this means I should wait for later models when they get that issue sorted out.",
      "score": 1,
      "created_utc": 1751718557.0,
      "replies": []
    },
    {
      "id": "n1j3398",
      "author": "AnaBanona",
      "body": "This product really seems like it went through the most relaxed quality control process ever.",
      "score": 1,
      "created_utc": 1751748653.0,
      "replies": []
    },
    {
      "id": "n1jejjm",
      "author": "RebekhaG",
      "body": "It's because they have their dock vent obstructed if you have it away from things it's just fine. Mine is just fine docked.",
      "score": 1,
      "created_utc": 1751752535.0,
      "replies": []
    },
    {
      "id": "n1jg973",
      "author": "RebekhaG",
      "body": "I'm assuming they had bad fans because mine running just fine in dock mode even the fans kick on even in hot weather. Had mine since launch and no problems except for the battery indicator problem. So this is fake news.",
      "score": 1,
      "created_utc": 1751753130.0,
      "replies": []
    },
    {
      "id": "n1ls08m",
      "author": "confessorkev",
      "body": "I haven't heard of one thing like this until now and I've never experienced overheating or crashing on my switch 2. Did some journalist get a donation from another company to bash the switch? I don't know",
      "score": 1,
      "created_utc": 1751790856.0,
      "replies": []
    },
    {
      "id": "n1vq51e",
      "author": "WesternFungi",
      "body": "$500 smartphone can do more gaming than this crapshoot device.",
      "score": 1,
      "created_utc": 1751925885.0,
      "replies": []
    },
    {
      "id": "n34lhpy",
      "author": "ChangeBackground1977",
      "body": "When the wifi is off it does not overheat",
      "score": 1,
      "created_utc": 1752520014.0,
      "replies": []
    },
    {
      "id": "n15tknq",
      "author": "hipnotyq",
      "body": "Blocking this website for using reddit posts to justify and support an article. If OP posts from them again, ill block OP too. Too much fake news these days, enough already.",
      "score": 0,
      "created_utc": 1751563496.0,
      "replies": []
    },
    {
      "id": "n14yesi",
      "author": "Jonathank92",
      "body": "never be an early adopter. Let the issues be worked out",
      "score": -4,
      "created_utc": 1751554731.0,
      "replies": [
        {
          "id": "n154852",
          "author": "dandroid126",
          "body": "I mean, it works fine for 4999998 of the 5000000 sold. I think those odds are pretty good.",
          "score": 11,
          "created_utc": 1751556370.0,
          "replies": [
            {
              "id": "n154h03",
              "author": "Jonathank92",
              "body": "or maybe those other ones haven't publicly discussed it yet. Who knows. Either way it doesn't hurt to wait 6 months for things to shake out",
              "score": -13,
              "created_utc": 1751556439.0,
              "replies": [
                {
                  "id": "n15cwei",
                  "author": "Dt2_0",
                  "body": "There are manufacturing defects in every electronic device. That is why warranties exist. So far this seems to be a few faulty units. Not anything to really be concerned about.",
                  "score": 3,
                  "created_utc": 1751558806.0,
                  "replies": []
                },
                {
                  "id": "n1583zi",
                  "author": "nero40",
                  "body": "A few faulty units out of a few millions units sold isn’t an uncommon occurrence, it happens all the time whether in tech or in anything else, really. \n\nUnless this is actually widespread (like the JoyCon drift), then this is probably just faulty units. That’s normal. We’ll have to wait a bit more to see if there would be more reports coming out, to see if this is actually a real, widespread issue.",
                  "score": 7,
                  "created_utc": 1751557457.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n14zo8v",
          "author": "Inner-Conclusion2977",
          "body": "Exactly",
          "score": -1,
          "created_utc": 1751555090.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n15hgnz",
      "author": "cheechfool",
      "body": "Lol. F Nintendo",
      "score": 0,
      "created_utc": 1751560113.0,
      "replies": []
    },
    {
      "id": "n15yb2s",
      "author": "None",
      "body": "That's strange, I play in toasty Texas and have yet to experience any sort of heating up. Even on long late night sessions with full brightness on and everything, it still feels cool to the touch generally. \n\n\nMy old rog ally on the other hand acted like a little space heater and would actively be really hot to the touch.",
      "score": 1,
      "created_utc": 1751564810.0,
      "replies": [
        {
          "id": "n169zq9",
          "author": "xLifeIsStrange",
          "body": "It only gets hot on docked mode with some games. It remains pretty cool in handheld mode.",
          "score": 4,
          "created_utc": 1751568200.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n17lsdx",
      "author": "bugturd",
      "body": "Mine gets seriously hot whenever I take it out of the oven.",
      "score": 1,
      "created_utc": 1751582869.0,
      "replies": []
    },
    {
      "id": "n1552g1",
      "author": "RajangRath",
      "body": "Yeah my switch 2 shouldn't be \"fresh out of the toaster\" hot after 2 hours of deltarune",
      "score": -1,
      "created_utc": 1751556605.0,
      "replies": []
    },
    {
      "id": "n16ox5g",
      "author": "Gloomy_Notice",
      "body": "I couldn’t imagine having thoughts and still buying a switch 2",
      "score": 0,
      "created_utc": 1751572603.0,
      "replies": []
    },
    {
      "id": "n16pbu2",
      "author": "AntiGrieferGames",
      "body": "Interesting thing is, that even the x86 Devices are much superior, better and newer than a switch 2, which are z1 extreme aka 2023 chips.\n\nThe Switch 2 uses a 2020 nvidia architecture (aka Ampere), which is no wonder why its ineffiecy, also Apere is made by Samsung, which is the overheat issue knowing for that. And Samsung Chips are very known to be crappy. Not much issue on a desktop lineout (laptop not aswell?), but the arm versions yes.\n\nIm not suprised for this. Switch 2 is a ewaste thing.",
      "score": 1,
      "created_utc": 1751572724.0,
      "replies": []
    },
    {
      "id": "n16ytm3",
      "author": "PyschoJazz",
      "body": "These upvotes are all wishful thinking",
      "score": 0,
      "created_utc": 1751575541.0,
      "replies": []
    },
    {
      "id": "n15i20u",
      "author": "larini_vjetrovi",
      "body": "Sorry for the spelling\n\nI really hope that they will fix this at least to some point with updates. I mean its not some cheap thing in the end. I dont have switch and i never had one, but players deserve to have good console since they buy the thing.",
      "score": -2,
      "created_utc": 1751560283.0,
      "replies": []
    },
    {
      "id": "n17z42y",
      "author": "TheTasteOfInk05",
      "body": "Switch 2 is a pile of dog shit",
      "score": -3,
      "created_utc": 1751587475.0,
      "replies": []
    },
    {
      "id": "n15nb2u",
      "author": "None",
      "body": "[deleted]",
      "score": 0,
      "created_utc": 1751561769.0,
      "replies": [
        {
          "id": "n15r6fr",
          "author": "Goddamn_Grongigas",
          "body": "Hard to play on the train though",
          "score": 1,
          "created_utc": 1751562839.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n17c4kk",
      "author": "BRZRKRGUTS",
      "body": "Yeah aftermarket docks don't have fans don't be cheap.",
      "score": 0,
      "created_utc": 1751579650.0,
      "replies": [
        {
          "id": "n1dm65i",
          "author": "Neo_Techni",
          "body": "aftermarket docks don't exist for it yet. The USB-C port is locked down",
          "score": 1,
          "created_utc": 1751666308.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n16066d",
      "author": "chief_yETI",
      "body": "Even if this is true (probably isnt), it won't have any impact on sales.",
      "score": -1,
      "created_utc": 1751565327.0,
      "replies": []
    },
    {
      "id": "n16l5fm",
      "author": "BUROCRAT77",
      "body": "🤣🤣🤣",
      "score": 0,
      "created_utc": 1751571487.0,
      "replies": []
    },
    {
      "id": "n17ffy3",
      "author": "OutlyingPlasma",
      "body": "And to think, they could have just bought a steam deck for the same price.",
      "score": -1,
      "created_utc": 1751580737.0,
      "replies": []
    },
    {
      "id": "n166j3v",
      "author": "Spunndaze",
      "body": "Hey, look,  lies on the internet.",
      "score": -4,
      "created_utc": 1751567180.0,
      "replies": []
    },
    {
      "id": "n15rtfx",
      "author": "Striking-Marzipan-",
      "body": "Fake news",
      "score": -2,
      "created_utc": 1751563014.0,
      "replies": []
    },
    {
      "id": "n1673i6",
      "author": "lysergamythical",
      "body": "Nintendo shill army is vast and omnipresent on Reddit. “mY sWiTCh 2 iS FiNE..” all the downvotes in the world aren’t going to change the fact that this is a terrible value console and that Nintendo is the epitome of a scum bag corporation.",
      "score": -5,
      "created_utc": 1751567346.0,
      "replies": [
        {
          "id": "n1ady2s",
          "author": "Putrid-Item-1592",
          "body": "It’s only 50$ more than a PS4 Pro and is portable.",
          "score": 2,
          "created_utc": 1751627780.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n1558u9",
      "author": "Jaambie",
      "body": "Careful, complaining about your switch 2 might get it bricked by Nintendo!",
      "score": -9,
      "created_utc": 1751556655.0,
      "replies": []
    },
    {
      "id": "n14y7hn",
      "author": "gldoorii",
      "body": "$500\n\nDownvoting doesn't justify it",
      "score": -26,
      "created_utc": 1751554674.0,
      "replies": [
        {
          "id": "n1503i9",
          "author": "MrCatchTwenty2",
          "body": "$450\n\nEdit: \"I'm not mad, don't put it in the paper that I'm mad\"",
          "score": 13,
          "created_utc": 1751555211.0,
          "replies": [
            {
              "id": "n15bti8",
              "author": "gldoorii",
              "body": "Oh you don't buy a game with it?",
              "score": -6,
              "created_utc": 1751558496.0,
              "replies": [
                {
                  "id": "n15e1sj",
                  "author": "MrCatchTwenty2",
                  "body": "I didn't.",
                  "score": 1,
                  "created_utc": 1751559134.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n151hdv",
          "author": "SheriffCrazy",
          "body": "And yet still the most affordable gaming machine and portable machine on the market besides like an emulation system.",
          "score": 6,
          "created_utc": 1751555601.0,
          "replies": [
            {
              "id": "n157gx7",
              "author": "Snipedzoi",
              "body": "400 dollar steam deck??",
              "score": 5,
              "created_utc": 1751557279.0,
              "replies": [
                {
                  "id": "n15bbi5",
                  "author": "Dependent-Mode-3119",
                  "body": "Arguably steam deck is not as much of a deal. The switch 2 comes with 2 controllers and ability to be docked to a tv",
                  "score": -2,
                  "created_utc": 1751558354.0,
                  "replies": [
                    {
                      "id": "n15bp9x",
                      "author": "Snipedzoi",
                      "body": "30 dollar gamesir supernova and 20 dollar dock from Amazon? The supernova is so much better than the pro 2?",
                      "score": 0,
                      "created_utc": 1751558462.0,
                      "replies": [
                        {
                          "id": "n16fp6v",
                          "author": "Dependent-Mode-3119",
                          "body": "I mean just because the deck is capable of it doesn't mean it's really set up so anyone can use it in that way. \n\nIt's also got a higher resolution panel with better colors with VRR and 120hz. I could go on.",
                          "score": -2,
                          "created_utc": 1751569863.0,
                          "replies": [
                            {
                              "id": "n179fbk",
                              "author": "illegiblefret",
                              "body": "What does that even mean? And why did you move to talking about the screen? Yes the 4 year newer device has a better screen. Just like the steam deck had a better screen then the original switch?",
                              "score": 4,
                              "created_utc": 1751578797.0,
                              "replies": []
                            },
                            {
                              "id": "n16hxkn",
                              "author": "Snipedzoi",
                              "body": "Haha that's a good joke ofc it is it has a console UI the whole time",
                              "score": 1,
                              "created_utc": 1751570521.0,
                              "replies": [
                                {
                                  "id": "n16j3pl",
                                  "author": "Dependent-Mode-3119",
                                  "body": " I mean that to target a larger display you need 1080p realistically at a minimum. The issue is that you have the individually go in there and re-tinker with the settings to target the higher resolution with a similar framerate. I've yet to see a game look better docked on the deck than it does on the switch 2. \n\n  \nI had a steam deck so don't play dumb here. It's not like a ROG ally that can tap into a 25w performance mode to make up the difference.",
                                  "score": 1,
                                  "created_utc": 1751570869.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n154cgt",
          "author": "Edmundyoulittle",
          "body": "Except it isn't",
          "score": 3,
          "created_utc": 1751556404.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n15icol",
      "author": "ChangeBackground1977",
      "body": "The battery life is my main concern. It drains even when fully off. Makes me think its sending data to china secretly\n\nEdit: I mean Japan not China.",
      "score": -7,
      "created_utc": 1751560367.0,
      "replies": [
        {
          "id": "n15jm74",
          "author": "junglespycamp",
          "body": "Ahh yes. Nothing more famous than Japanese companies conspiring with the Chinese government.",
          "score": 2,
          "created_utc": 1751560734.0,
          "replies": [
            {
              "id": "n15kk97",
              "author": "ChangeBackground1977",
              "body": "If you think about it they are already holding us to their laws when it comes to the switch 2 by bricking systems..... Critical thinking is dead these days",
              "score": -13,
              "created_utc": 1751561003.0,
              "replies": [
                {
                  "id": "n15n02o",
                  "author": "junglespycamp",
                  "body": "Ahh yes. Critical thinking like not knowing the difference between China and Japan.",
                  "score": 4,
                  "created_utc": 1751561685.0,
                  "replies": [
                    {
                      "id": "n15oaoe",
                      "author": "ChangeBackground1977",
                      "body": "This exchange scratched your itch didnt it? Youre such a superior person omg",
                      "score": -11,
                      "created_utc": 1751562041.0,
                      "replies": [
                        {
                          "id": "n16kx4s",
                          "author": "Devilofchaos108070",
                          "body": "You just seriously like doubled down on being completely wrong.\n\n\nYou are some piece of work.  It’s crazy to see.  \n\n\nI’m not the one you were responding to, just someone else reading the comments.",
                          "score": 1,
                          "created_utc": 1751571418.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n17eank",
      "author": "Frostburn7311",
      "body": "Not saying this isn’t a concern but also my PS5 gets hot. We leave the entertainment center door open while playing so it gets better airflow (has venting in the back of the cabinet). I have my Switch 2 directly next to the PS5 and have had no issues so far.",
      "score": -1,
      "created_utc": 1751580356.0,
      "replies": []
    },
    {
      "id": "n158h8l",
      "author": "reddithater212",
      "body": "Nintendo switch 2 pro?",
      "score": -7,
      "created_utc": 1751557560.0,
      "replies": []
    },
    {
      "id": "n15y3k3",
      "author": "Dixa",
      "body": "The old docks had a fan. No fan in the new ones?",
      "score": -2,
      "created_utc": 1751564747.0,
      "replies": [
        {
          "id": "n16parl",
          "author": "Neo_Techni",
          "body": "there is one",
          "score": 2,
          "created_utc": 1751572715.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n157c60",
      "author": "User-no-relation",
      "body": "wow nintendo made a dud console after making an amazing console.  no way",
      "score": -17,
      "created_utc": 1751557242.0,
      "replies": []
    }
  ]
}