{
  "post": {
    "title": "The USB-C charging mandate arrives in the EU — here’s what that means | The common charging standard brings USB PD support, improved labelling, and less e-waste.",
    "author": "chrisdh79",
    "id": "1hnfal0",
    "score": 540,
    "created_utc": 1735307489.0,
    "selftext": "",
    "num_comments": 82,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hnfal0/the_usbc_charging_mandate_arrives_in_the_eu_heres/"
  },
  "comments": [
    {
      "id": "m4153gu",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1735307490.0,
      "replies": []
    },
    {
      "id": "m417ytt",
      "author": "jonnycanuck67",
      "body": "What will I put in that drawer with every cable “standard” invented since the Mexican Revolution?",
      "score": 106,
      "created_utc": 1735308684.0,
      "replies": [
        {
          "id": "m41ob5a",
          "author": "Sylvurphlame",
          "body": "Nothing. You leave that shit alone. You know damn well that if you attempt to clean out a junk drawer, you only end up with *two* junk drawers.",
          "score": 94,
          "created_utc": 1735314615.0,
          "replies": [
            {
              "id": "m41oh1b",
              "author": "jonnycanuck67",
              "body": "My math has failed me again … haha",
              "score": 11,
              "created_utc": 1735314670.0,
              "replies": [
                {
                  "id": "m41owmv",
                  "author": "Sylvurphlame",
                  "body": "It’s okay. Shit’s insidious. That’s how they get ya.",
                  "score": 8,
                  "created_utc": 1735314816.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4f9bn8",
              "author": "ClaudiuT",
              "body": "Every time I cleaned a cable drawer I ended up needing something. Last time it was a mini USB cable...",
              "score": 3,
              "created_utc": 1735509946.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m41loc0",
          "author": "gbroon",
          "body": "I can't throw them out, one day that RCA to VGA cable will come in useful.",
          "score": 39,
          "created_utc": 1735313726.0,
          "replies": [
            {
              "id": "m42geb6",
              "author": "cas13f",
              "body": "That day will be within a month or so of getting rid of it.",
              "score": 16,
              "created_utc": 1735323648.0,
              "replies": []
            },
            {
              "id": "m41lxfd",
              "author": "jonnycanuck67",
              "body": "Exactly lol",
              "score": 8,
              "created_utc": 1735313812.0,
              "replies": []
            },
            {
              "id": "m4446vj",
              "author": "pafrac",
              "body": "This is exactly why I've got so much shit in my loft.\n\nIf you're an engineer and don't keep random shit in case it comes in useful, well, you're not an engineer.",
              "score": 3,
              "created_utc": 1735343515.0,
              "replies": [
                {
                  "id": "m4izjz1",
                  "author": "OnboardG1",
                  "body": "This is why we still have shit from the 70s in our lab. We all know that current source will come in handy one day despite having like 5 others that are more portable and accurate.",
                  "score": 2,
                  "created_utc": 1735569309.0,
                  "replies": [
                    {
                      "id": "m4keh8m",
                      "author": "pafrac",
                      "body": "It'll definitely come into it's own when you realise someone forgot to get the other 5 calibrated ...",
                      "score": 1,
                      "created_utc": 1735585533.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4mvv2v",
                  "author": "richardelmore",
                  "body": "Still trying to convince my inner hoarder that it’s OK to get rid of all the old parallel SCSI cables and terminators.",
                  "score": 1,
                  "created_utc": 1735614949.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4blnv1",
              "author": "jonfitt",
              "body": "I may still need this SCART cable.",
              "score": 3,
              "created_utc": 1735456146.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m41bp95",
          "author": "linxdev",
          "body": "[Cable Tester](https://www.amazon.com/Treedix-Tester-Checker-Acrylic-Charging/dp/B0CF95VL2Y?crid=YFAD8WFFMATA&dib=eyJ2IjoiMSJ9.CVEuU1F8IK9XW68LlX-p-yk3MyFcDbZSIyWCoy8Y_sTVf1CahdmoWzzjfuGaC6YlvGttrOPDDrG0ITLVODCwdw_8x4NwyFDEe36kIdnHxnWrMJllfTEwqhrbQ_E7n_Xz6Fdt1JsNC5whILKBQod2qk2gsTGXkppEiEw9EtUW407-YCancxKYRotaCcMQ8vRY5s2PqrMP1W6809SkUDRoKwsdk4yRTl0JRE6kqD4A4EE88RYNwndI0e5NAOrP8g7xFvBTVRozdn06p2-paAdq7RhYjC3fBB-AkQXhRIzsooc.wn9VcsLQemla-1GUszmOuRS8fojeTz8ZfiBBWiLCOH0&dib_tag=se&keywords=usb%2Bcable%2Btester&qid=1735309986&sprefix=usbcable%2Btester%2Caps%2C128&sr=8-7&th=1)\n\nSo you know what each cable is.",
          "score": 9,
          "created_utc": 1735310157.0,
          "replies": [
            {
              "id": "m420prw",
              "author": "neversummer427",
              "body": "Would love if cables had labels so I don’t need to test them",
              "score": 7,
              "created_utc": 1735318670.0,
              "replies": [
                {
                  "id": "m45j7xw",
                  "author": "dertechie",
                  "body": "USB Forum too busy coming up with confusing names to print a spec for cable labels or color coding.",
                  "score": 5,
                  "created_utc": 1735364186.0,
                  "replies": []
                },
                {
                  "id": "m439rek",
                  "author": "linxdev",
                  "body": "That would be nice.  I bought blank tags from Amazon so I could tag cables as I test them with that device.   I use color tags and then write specifics about the cable.",
                  "score": 2,
                  "created_utc": 1735333101.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m41cy61",
              "author": "jonnycanuck67",
              "body": "Haha :)",
              "score": 2,
              "created_utc": 1735310636.0,
              "replies": [
                {
                  "id": "m41e2d1",
                  "author": "linxdev",
                  "body": "I have one.  That device works well.",
                  "score": 1,
                  "created_utc": 1735311052.0,
                  "replies": [
                    {
                      "id": "m41em76",
                      "author": "jonnycanuck67",
                      "body": "I know what they all are, it was a joke about the junk cable drawer we all have…",
                      "score": 3,
                      "created_utc": 1735311253.0,
                      "replies": [
                        {
                          "id": "m49i2bi",
                          "author": "ryapeter",
                          "body": "Just one more thing for the drawer",
                          "score": 1,
                          "created_utc": 1735425897.0,
                          "replies": []
                        },
                        {
                          "id": "m49i39p",
                          "author": "ryapeter",
                          "body": "Just one more thing for the drawer",
                          "score": 1,
                          "created_utc": 1735425906.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m45kqq3",
          "author": "NotAPreppie",
          "body": "Just waiting until my old AppleTalk cables are useful again.",
          "score": 2,
          "created_utc": 1735364951.0,
          "replies": []
        },
        {
          "id": "m41z68o",
          "author": "QuestionablePanda22",
          "body": "Once a new usb standard drops in the distant future you can turn it into a usb-c graveyard i suppose",
          "score": 4,
          "created_utc": 1735318176.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4caj9q",
      "author": "snajk138",
      "body": "I don't get why some people are against this, it just makes things so much easier. I went on a work trip abroad last week and I only brought one tiny two-port charger for everything, two laptops, two sets of headphones, tablet, two phones, chromecast, BT speaker etc.",
      "score": 10,
      "created_utc": 1735472085.0,
      "replies": [
        {
          "id": "m4dj5mv",
          "author": "justenf99",
          "body": "Because the government should not be dictating what a business offers in it's products. It's a disgusting abuse of power. As well it's totally unnecessary because you can easily get inexpensive adapters that let you use usb-c cables with iPhones. \n\nI predict that this will also stifle the innovation and adoption of newer and better technology as every advance will require government action to allow it's use.",
          "score": -15,
          "created_utc": 1735490894.0,
          "replies": [
            {
              "id": "m4dpwu3",
              "author": "snajk138",
              "body": "Sure, like our standardized outlets stifled innovation or what? Do you remember how it was before the EU made USB mandatory? When each manufacturer had its own charging cable standard that they also changed every year so you had to get new cables for every new phone. That was the solution the market proposed, keep throwing away working things so that they could be payed more. \n\nKeep sucking the corporate dicks all you want but I am happy we (the people and the government) keep them in check.",
              "score": 18,
              "created_utc": 1735493008.0,
              "replies": [
                {
                  "id": "m4e3zkt",
                  "author": "Jim3001",
                  "body": "Nah, they never remember the shothole these rules saved us from. I remember the line from when the OG rule was adopted. 32 proprietary chargers across all the manufacturers. That was ridiculous. And back then, they never said that it had to be USB, they just wanted a common cable. USB just won the race.",
                  "score": 5,
                  "created_utc": 1735497315.0,
                  "replies": []
                },
                {
                  "id": "m4fv0hb",
                  "author": "justenf99",
                  "body": "Are you seriously comparing standardized electrical outlets in homes and other places to requiring a business to put something on their products? Were you born as stupid or do you have to study first?",
                  "score": -9,
                  "created_utc": 1735517066.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5b0neg",
              "author": "BytchYouThought",
              "body": ">a government should not be dictating what a business offers in it's products.\n\nYeah, if a business wants throw rat poison in it's food products the government shouldn't be able to dictate in order to protect it's citizens and consumers. Totally shouldn't just let businesses do whatever they want. \n\nStop it dude.",
              "score": 1,
              "created_utc": 1735965174.0,
              "replies": [
                {
                  "id": "m5b35hb",
                  "author": "justenf99",
                  "body": "Holy shit, are you really saying that this is the same thing as putting rat poison in food? I mean how stupid are you?!! You're the idiot that should stop it.",
                  "score": 0,
                  "created_utc": 1735966260.0,
                  "replies": [
                    {
                      "id": "m5bv5cc",
                      "author": "BytchYouThought",
                      "body": "Holy shit are you really trying to back out of your own words? You said government should have no say in what a business produces in their products. Period. I mean how dumb could you be? Saying that is no different than supporting companies doing anything they want such as poisoning food which government exists to literally stop companies from doing. \n\nGet over yourself.",
                      "score": 2,
                      "created_utc": 1735981626.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m43mjpf",
      "author": "None",
      "body": "Just gonna end up with a draw that has loads of usb c cables.. Some of which do quick charging and mostly ones only do trickle charging",
      "score": 39,
      "created_utc": 1735337291.0,
      "replies": [
        {
          "id": "m44rgb2",
          "author": "AlwaysLateToThaParty",
          "body": "What it means is i won't have to carry around anything in my bag except a quick charge cable.",
          "score": 21,
          "created_utc": 1735352224.0,
          "replies": []
        },
        {
          "id": "m46qnv8",
          "author": "governmentspy44",
          "body": "God you lot really do find a way to whinge about everything don’t you",
          "score": 24,
          "created_utc": 1735390944.0,
          "replies": [
            {
              "id": "m48gqzz",
              "author": "None",
              "body": "ay nothing's ever good enough LOL\n\n\"yeah well screw your stupid consumer protections, i'm shitty at picking out accessories\"",
              "score": 6,
              "created_utc": 1735413485.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m46p5b1",
          "author": "antagron1",
          "body": "And some that carry data and some that do not. Grr",
          "score": 5,
          "created_utc": 1735390147.0,
          "replies": [
            {
              "id": "m4bocah",
              "author": "lolercoptercrash",
              "body": "When do you need to transfer data by cable anymore?\n\nI have a data cable in my work bag for an external monitor, but other than that I don't use a USB C to C cable for data at all.\n\nUSB dongles have a cable built in and I usually use one of those for memory cards.",
              "score": 0,
              "created_utc": 1735457758.0,
              "replies": [
                {
                  "id": "m4c5g32",
                  "author": "antagron1",
                  "body": "Oh I have a USB C portable dac, and some mini keyboards and macropad type devices that. Eed data.",
                  "score": 6,
                  "created_utc": 1735468822.0,
                  "replies": []
                },
                {
                  "id": "m4cnsio",
                  "author": "jupatoh",
                  "body": "CarPlay? Not all cars support wireless CarPlay",
                  "score": 2,
                  "created_utc": 1735479293.0,
                  "replies": []
                },
                {
                  "id": "m4co600",
                  "author": "YZJay",
                  "body": "Thunderbolt? External drives?",
                  "score": 2,
                  "created_utc": 1735479466.0,
                  "replies": []
                },
                {
                  "id": "m4jnnzs",
                  "author": "audigex",
                  "body": "If anything I do this MORE now than a few years ago\n\nOn my desk in front of me are a DAC for my headphones and an 8bitdo Ultimate controller in its dock. Both use USB-C for both power/charging, and data (the controller's dock communicates with the controller via 2.4GHz, and back to the PC using USB-C)\n\nIt's true that *most* of the time I just need power, but it's definitely not unheard of to use USB-C for data transfer too",
                  "score": 1,
                  "created_utc": 1735577334.0,
                  "replies": [
                    {
                      "id": "m4l8eub",
                      "author": "lolercoptercrash",
                      "body": "But you have that on your desk at all times. You are not gonna be surprised by the need for a data cable very often. \n\nThat DAC probably came with the data cable you need, and you will use the cable after you throw the DAC away.\n\nI almost never *need* to carry a data USB-C to USB-C cable with me. I still don't hear many examples where people do.\n\nI'm not saying at home you won't use USB C for data, im saying people will almost never find themselves in a situation where they need a USB C data cable (typically when you are traveling) and they only have power.",
                      "score": 1,
                      "created_utc": 1735594700.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m44shtf",
          "author": "sylfy",
          "body": "The USB PD part looks like a step in the right direction, but this makes no mention about the mess of standards that USB is, the whole bunch of cables with different capabilities, and data transfer speeds. At the end of the day, it looks like a poorly thought through top-down implementation.",
          "score": 0,
          "created_utc": 1735352640.0,
          "replies": [
            {
              "id": "m46jgfa",
              "author": "Kyrond",
              "body": "This is just about charging. My BT headphones,  razer, and powerbank don't need to talk to each other, just receive/give power.\n\n\n\nThe other mess is only caused by USB IF and manufacturers.",
              "score": 6,
              "created_utc": 1735386829.0,
              "replies": [
                {
                  "id": "m47s9mx",
                  "author": "danielv123",
                  "body": "There is one thing I'd like defined in the charging standard.\n\nIf I plug my laptop into a laptop, what happens?\n\nA -> C, the laptop with the C port charges. C -> C? Who knows\n\nIt comes up quite a bit - for example, I was on a trip and wanted to charge my flashlight from a portable power station. Flashlight decided to start charging the power station instead.",
                  "score": 1,
                  "created_utc": 1735405535.0,
                  "replies": [
                    {
                      "id": "m4jnz64",
                      "author": "audigex",
                      "body": "That flashlight presumably functions as a power bank? It should offer you the option to charge or discharge either through two different ports (like my power banks all have) or some sort of control\n\nThe fact it doesn't is a fault of your power bank",
                      "score": 1,
                      "created_utc": 1735577429.0,
                      "replies": [
                        {
                          "id": "m4jr8di",
                          "author": "danielv123",
                          "body": "Doesn't fix the issue. My phone only had one port, so a dedicated discharge port doesn't make sense. My laptop allows charging on all ports, which is nice - but leaves it ambiguous when it will allow discharging from those same ports.",
                          "score": 1,
                          "created_utc": 1735578428.0,
                          "replies": [
                            {
                              "id": "m4jrtuv",
                              "author": "audigex",
                              "body": "Really that should be part of the device settings and firmware/software - it’s not something USB should be negotiating because there’s no way to programmatically detect it\n\nYou’d have the same problem whatever type of cable and port you used because fundamentally it’s a decision for the user to make\n\nSo I don’t think that’s a USB-C issue, that’s just the manufacturers of the devices not giving the user enough control over their functionality",
                              "score": 1,
                              "created_utc": 1735578613.0,
                              "replies": [
                                {
                                  "id": "m4jse3a",
                                  "author": "danielv123",
                                  "body": "The device settings and firmware/software are designed after the USB specification. I think the USB specification should specify how to handle this.",
                                  "score": 1,
                                  "created_utc": 1735578785.0,
                                  "replies": [
                                    {
                                      "id": "m4jzzsa",
                                      "author": "audigex",
                                      "body": "That doesn’t make sense because it’s not something that can be negotiated unless it was a simple case of the device with more power sending power to the one with less\n\nThe spec tells you how they should electrically negotiate, not how they decide which sends power\n\nA phone, laptop, and power bank all function very differently so they can’t all use the same software option or button or whatever, so how do you specify that?\n\nOr to flip this around a moment: how would you specify it?\n\nThe only thing I’d perhaps say is that the specification should include some kind of “if the device is capable of both sending and receiving power, the device must provide a function for the user to toggle whether the device is configured to send or receive power. Auto is permitted in which case the device will respect the request from the other end, or if both are on auto then the device with more charge will send power to the other”\n\nBut you can’t specify details beyond that, and individual manufacturers could include it now but don’t bother\n\nAnd either way it’s not something specific to USB-C nor does anyone else do it better…",
                                      "score": 1,
                                      "created_utc": 1735581121.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m49tzyn",
                      "author": "zootbot",
                      "body": "Just flip the cable around",
                      "score": 1,
                      "created_utc": 1735430082.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m460u06",
              "author": "ryapeter",
              "body": "\nOne day we will reach one cable for everything.",
              "score": 2,
              "created_utc": 1735374414.0,
              "replies": [
                {
                  "id": "m46burn",
                  "author": "GMNestor",
                  "body": ".. and in the drawer bind them.",
                  "score": 5,
                  "created_utc": 1735381849.0,
                  "replies": [
                    {
                      "id": "m49htip",
                      "author": "ryapeter",
                      "body": "😂",
                      "score": 2,
                      "created_utc": 1735425814.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m49batu",
      "author": "DrKersh",
      "body": "best thing I did last year, was to buy some decent cables for everything I could have connected at the same time, and don't even  bother to remove the clip from any  new one  I got with anything I purchase \n\nEvery cable is rated for pd 3.1 240w or 40gbps and call it a day for at least the next 5 years,  probably 8",
      "score": 7,
      "created_utc": 1735423595.0,
      "replies": []
    },
    {
      "id": "m4hy05y",
      "author": "ulyssesric",
      "body": "And that also means a LOT more people will ask why the Type-C external disk read speed is throttled at \\~40 MB/sec.",
      "score": 2,
      "created_utc": 1735549377.0,
      "replies": []
    },
    {
      "id": "m4cth3i",
      "author": "Beddingtonsquire",
      "body": "Until you find out there are a dozen USB-C cables and they all do different things.",
      "score": 2,
      "created_utc": 1735481815.0,
      "replies": [
        {
          "id": "m4cvf7m",
          "author": "Krimsonrain",
          "body": "So buy the one that does everything and call it a day",
          "score": 1,
          "created_utc": 1735482628.0,
          "replies": [
            {
              "id": "m4cw97t",
              "author": "Beddingtonsquire",
              "body": "But that doesn't stop bundles of cables that are indecipherable - do they charge only? Data? Data and charge? Video signal? How fast do they charge? Etc.\n\nJust as much e-waste and rubbish.",
              "score": 0,
              "created_utc": 1735482967.0,
              "replies": [
                {
                  "id": "m4cwxi5",
                  "author": "Krimsonrain",
                  "body": "I just buy a quality cable that says it is rated for the functions I need it for. I have literally never had an issue with a USB c cable not doing what I need it to. The free ones that come with cheap rechargeable devices are obviously only going to charge the device. You're making this way more complicated than it needs to be and seem like you just want to complain. \n\nIf you really want to grandstand about e waste start researching disposable vapes and how much lithium, plastic, and pcbs gets thrown away into trash cans each day.",
                  "score": 3,
                  "created_utc": 1735483236.0,
                  "replies": [
                    {
                      "id": "m4czva4",
                      "author": "Beddingtonsquire",
                      "body": "I don't care about ewaste, it's dug out of one hole in the ground and out in another.\n\nMy point is the justification is bunk because it's not standardised.",
                      "score": -1,
                      "created_utc": 1735484370.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4iyc66",
                  "author": "Gunter5",
                  "body": "You can't say just as much waste, i agree with you but youre over exaggerating. One of the things they are proposing is making it easier to identify them\n\nI use usb c like 95% of the time, have a bunch of cables, I'm confused by their difference in thickness, there has to be a different but I never had issues",
                  "score": 1,
                  "created_utc": 1735568849.0,
                  "replies": [
                    {
                      "id": "m4j1ws1",
                      "author": "Beddingtonsquire",
                      "body": "Will fewer cables be made? That will be the measure.",
                      "score": 1,
                      "created_utc": 1735570178.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m4uxjk6",
      "author": "Responsible-Ad-1086",
      "body": "Until USB -D comes along",
      "score": 1,
      "created_utc": 1735745702.0,
      "replies": []
    },
    {
      "id": "m527xng",
      "author": "mysteryliner",
      "body": "A new problem I discovered:\n\nSimple product that have a USB-C port now, but are missing a little chip and they will only charge with a old USB-A to USB-C cable. So I'm still stuck with 1 foot in the past.",
      "score": 1,
      "created_utc": 1735848343.0,
      "replies": []
    },
    {
      "id": "m4f4m9d",
      "author": "drfsupercenter",
      "body": "\"less ewaste\" is laughable considering my USB-C cables don't even last a whole year before breaking",
      "score": -1,
      "created_utc": 1735508474.0,
      "replies": [
        {
          "id": "m4jo2ks",
          "author": "audigex",
          "body": "I've never broken a USB-C cable, maybe you just need to take better care of your shit?",
          "score": 2,
          "created_utc": 1735577457.0,
          "replies": [
            {
              "id": "m5e84mi",
              "author": "None",
              "body": "I've had throw a number away, the casing has failed and wires became exposed.",
              "score": 1,
              "created_utc": 1736017081.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m43yeqy",
      "author": "chriswaco",
      "body": "Glad I can save the planet by throwing out all of my USB-A and Lightning cables adapters.",
      "score": -25,
      "created_utc": 1735341397.0,
      "replies": [
        {
          "id": "m476kva",
          "author": "itinerantmarshmallow",
          "body": "Do you even live in the EU to moan about this?",
          "score": 16,
          "created_utc": 1735397978.0,
          "replies": [
            {
              "id": "m48iswr",
              "author": "moog_master",
              "body": "He is just an iPhone enthusiast that still honestly believes it's a better phone than the rest of the market.",
              "score": 9,
              "created_utc": 1735414154.0,
              "replies": [
                {
                  "id": "m4jpi4d",
                  "author": "audigex",
                  "body": "Even as an iPhone user and lover (I've still got my iPhone 3GS in a drawer), I still think USB-C is the better standard than Lightning - it allows for far more power and much higher data rates\n\nWithin arms reach of me are my USB-C iPhone 15 (2023) and my USB-C Airpods 4 (2024). On the same desk are my lightning iPad Air (2015) and my old Airpods (2018) which I used until last week\n\nUSB-C is way better. They can charge faster, and the devices can charge each other which is SO useful. Eg I forgot to charge my Airpods but could just charge them from my phone. I can charge my fiancee's phone from my phone when she had signal and I didn't, but she had no battery left\n\nI love my iPhone, I love my Airpods, I love my iPad. I love my MacBook and my Mac Mini. So I sure as shit don't hate Apple... but I still think USB-C is better",
                  "score": 2,
                  "created_utc": 1735577893.0,
                  "replies": [
                    {
                      "id": "m4kp6a6",
                      "author": "moog_master",
                      "body": "USB c is better than lightning... It's not an opinion, it's the power and data transfer capability\nRegarding iPhone as a product... It does the job well, but there are  just cheaper and better alternatives.\nRegarding their dark side, iPhone vs right to repair is a fun thing to google",
                      "score": 1,
                      "created_utc": 1735588826.0,
                      "replies": [
                        {
                          "id": "m4ksxo3",
                          "author": "audigex",
                          "body": "Cheaper yes, better is subjective\n\nTo be clear I'm not an Apple diehard. I know I listed most of their products above, and I do use them daily... but I also have most other things too\n\nI also have various Android, Windows, Linux machines/devices in this same room - the most used OS in my house is Linux (especially if including Android). I like a lot of what Android does and do use it especially for tinkering with electronics, but I prefer iOS as my daily driver for my phone",
                          "score": 1,
                          "created_utc": 1735589979.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m4bqgqm",
          "author": "im_thatoneguy",
          "body": "USB A isn’t going anywhere it’s micro USB that’s getting the axe.",
          "score": 5,
          "created_utc": 1735459058.0,
          "replies": []
        },
        {
          "id": "m4jocuv",
          "author": "audigex",
          "body": "You can recycle them, and overall it's expected to be a net gain over the long term to the tune of millions of tons of raw materials",
          "score": 1,
          "created_utc": 1735577544.0,
          "replies": [
            {
              "id": "m4k1c56",
              "author": "chriswaco",
              "body": "It only saves raw materials if phone companies stop including cables with phones.",
              "score": 1,
              "created_utc": 1735581525.0,
              "replies": [
                {
                  "id": "m4kr7yf",
                  "author": "audigex",
                  "body": "Yes, exactly\n\nApple no longer provide a cable with most accessories (eg AirPods) and are likely to stop providing USB-C cables with iPhones in a couple of years (once they're past the \"You just changed to USB-C, you can't stop giving us a cable now!\" complaints)\n\nIn a couple of years it's unlikely you'll get a cable with most new phones, on the basis that everyone will have several already",
                  "score": 1,
                  "created_utc": 1735589457.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m4i1zxl",
      "author": "martinbean",
      "body": "Aren’t we already using USB-C as a de facto standard for charging? Android phones have had USB-C for ages, and my iPhone has USB-C.",
      "score": -2,
      "created_utc": 1735551999.0,
      "replies": [
        {
          "id": "m4job5m",
          "author": "audigex",
          "body": "> and my iPhone has USB-C\n\nThis literally happened because of the EU mandate, it's only the been the \"de facto\" standard in the last couple of years because of the actual standard being imminent",
          "score": 3,
          "created_utc": 1735577529.0,
          "replies": []
        }
      ]
    }
  ]
}