{
  "post": {
    "title": "Leaked AMD Strix Halo benchmarks put this processor's integrated gaming GPU alongside the performance of the laptop Nvidia GeForce RTX 4060",
    "author": "a_Ninja_b0y",
    "id": "1hb23sv",
    "score": 181,
    "created_utc": 1733838430.0,
    "selftext": "",
    "num_comments": 41,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hb23sv/leaked_amd_strix_halo_benchmarks_put_this/"
  },
  "comments": [
    {
      "id": "m1dnw53",
      "author": "aitorbk",
      "body": "A 4060 in a cpu?  That can potentially be the bestseller of several.years.  all depends on pricing and what memory/mb is needed.\nFurthermore, HBM memory in package, like 32GB, would be the icing on the cake, and increase performance substantially.",
      "score": 42,
      "created_utc": 1733848269.0,
      "replies": [
        {
          "id": "m1f319q",
          "author": "Old-Board1553",
          "body": "It's the top model from Strix Halo. That will go from 2.5K up for sure.",
          "score": 11,
          "created_utc": 1733864167.0,
          "replies": [
            {
              "id": "m1hik5z",
              "author": "QuickQuirk",
              "body": "Are you suggesting $2500+?\nIt's dead in the water at that price.  A 4070 laptop can be had for $1500.\n\nThis works best as an APU to *reduce* costs, for the mid range $1000-1500 range.\n\nOtherwise there's no point to it unless the *efficiency* is significantly ahead of nvidias 40 series.",
              "score": 15,
              "created_utc": 1733897186.0,
              "replies": [
                {
                  "id": "m1i8lm8",
                  "author": "fareastrising",
                  "body": "If over 2k then they better go balls out on the ram. Nothing lower than 64GB at the very least",
                  "score": 6,
                  "created_utc": 1733914138.0,
                  "replies": [
                    {
                      "id": "m1l4ryt",
                      "author": "QuickQuirk",
                      "body": "It won't be 2k. Just doesn't make economic sense. No one will buy it.",
                      "score": 2,
                      "created_utc": 1733950830.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m1k41be",
                  "author": "GrayDaysGoAway",
                  "body": "4070 laptops get even cheaper than that. They're regularly available for around $1,100 these days.",
                  "score": 3,
                  "created_utc": 1733940005.0,
                  "replies": [
                    {
                      "id": "m1l4mro",
                      "author": "QuickQuirk",
                      "body": "yeah, so I don't buy the 2500k price tag, unless it's incredibly efficient with the whole package in at 45w max TDP for thin and light macbook competitors.",
                      "score": 3,
                      "created_utc": 1733950788.0,
                      "replies": [
                        {
                          "id": "m1lding",
                          "author": "Benzy2",
                          "body": "I believe it will push the $2500 mark.  Maybe some will come in cheaper, but I absolutely expect this to be the better build quality, better screen quality, higher base spec choice and push well into mid $2000’s for a decent spec build.  There are already Laptop options with a 4050 or 4060 that push low to mid $2000’s.  AMD isn’t going to sell a good CPU with integrated 4060 for less than a good CPU and 4060.  The point is to be more efficient and easier to cool.  At least at first.  Come in as the form factor choice for a generation or two, then trickle down to the budget performance choice.  But there is no way they undercut pricing on a quality CPU/4060 combo and ignore the premium market while they hold a monopoly on the best performing all in one.",
                          "score": 2,
                          "created_utc": 1733953447.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m1hl2ht",
                  "author": "Old-Board1553",
                  "body": "Yes 2500$. Think about it Strix Point aka HX 370 was 1500$+. Strix Halo line-up is another level above, even the base model from this line-up is better compared to HX 370/375. And the one in the article is the top model of Strix Halo, so you ain't gonna find it under 2200/2500$. Maybe the base model and the other versions that showed up online. But no chance for the top model. They want to compete with Apple and Macbook Pro/Max line-up with this.",
                  "score": 7,
                  "created_utc": 1733898589.0,
                  "replies": [
                    {
                      "id": "m1k537s",
                      "author": "GrayDaysGoAway",
                      "body": ">They want to compete with Apple and Macbook Pro/Max line-up with this.\n\nWell that's pretty stupid on their part. The people looking to buy Apple devices will never even consider anything with these AMD chips in them.\n\nOnly gamers will be interested in these, and those gamers can get far better performance for far less money with other hardware.",
                      "score": 6,
                      "created_utc": 1733940320.0,
                      "replies": [
                        {
                          "id": "m1lftsj",
                          "author": "QuickQuirk",
                          "body": "Not entirely true: There are a line of expensive high quality thin and light windows devices. None of them have close to the battery life of the macbook though.\n\nSo the *only* way I see this work is if the strix chip has pulled a phenonomal efficiency win with both GPU/CPU, to get it close to macbook level performance.\n\nI still think that the real value of this chip is reducing cost on the low end though - 4060 performance in one chip at lower cost and power. That would be a winner for AMD, and they could pump out a lot of these.\n\nWhile there is a windows market for these devices, it's not a large one.",
                          "score": 0,
                          "created_utc": 1733954147.0,
                          "replies": [
                            {
                              "id": "m1lhd98",
                              "author": "GrayDaysGoAway",
                              "body": "Honestly even if the efficiency is insane, I don't see that changing the equation much. I mean people buying Macbooks generally aren't doing so for the battery life. They're doing it for iOS and everything that comes with that.\n\nAnd yeah there are a fair number of expensive ultralight windows laptops, but afaik they don't generally sell well. Seems like every other day another one's being discontinued.\n\nBut yeah one way or another, totally agree that it's a very narrow market here if they're priced at $2k or above.",
                              "score": 1,
                              "created_utc": 1733954628.0,
                              "replies": []
                            },
                            {
                              "id": "m1lihof",
                              "author": "Old-Board1553",
                              "body": "That will never happen, unless Windows evolves on ARM and AMD speeds up the plan to enter in the ARM segment.",
                              "score": 0,
                              "created_utc": 1733954984.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m1gxo6g",
          "author": "_CatLover_",
          "body": "4060 mobile, not the one you put in your desktop pc",
          "score": 4,
          "created_utc": 1733887548.0,
          "replies": [
            {
              "id": "m1hha7e",
              "author": "GunnerTardis",
              "body": "Depends on the wattage, but mobile 4060 and desktop 4060 have identical performance.",
              "score": 3,
              "created_utc": 1733896486.0,
              "replies": [
                {
                  "id": "m1i71k0",
                  "author": "an0maly33",
                  "body": "Do they? Previous generations had differences in core count. Mobiles are always watered down to keep heat and power usage lower.",
                  "score": 8,
                  "created_utc": 1733913113.0,
                  "replies": [
                    {
                      "id": "m1j34eg",
                      "author": "GunnerTardis",
                      "body": "Usually that is the case but it is not unheard of, I believe there have been laptop gpus from previous generations that were identical in performance.\n\nHere is a [video](https://youtu.be/d2ru3DcK7Wc?si=AW9EZt3Map_OXj96&t=151) that dives into the laptop and desktop 4060. As you can see the dies are identical and there is nothing cut down from the card physically. \n\nThe joke is that NVIDIA put a laptop GPU in a desktop GPU as well, which makes sense why the 4060 was so disappointing in terms of performance. \n\nNormally desktop GPU push performance so hard they need to be cut down to cope with the laptop form factor, however it's almost like the desktop 4060 was made for laptops to begin with.",
                      "score": 3,
                      "created_utc": 1733928251.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1cw06m",
      "author": "a_Ninja_b0y",
      "body": "From the article :-\n\n\n''A next-gen AMD Ryzen gaming CPU has had its Geekbench benchmarks posted publicly, weeks before it was expected to debut at CES 2025. Rumored to be AMD’s flagship processor of the new Strix Halo line, it appears its integrated GPU can go toe-to-toe with an Nvidia RTX 4060. However, there’s also a massive catch.\n\n\nCurrent AMD desktop GPUs may not be the very best graphics cards in the world, but they have been holding their own in terms of raw power. However, it’s the company’s ability to embed its Radeon GPUs into its Ryzen CPUs that has proven a winner in the laptop and handheld spaces. Nearly all the best gaming handheld devices use an AMD CPU with an integrated GPU.\n\n\nAs the company takes over the portable PC space, its new AMD Strix Halo hardware could significantly increase performance. OneXPlayer recently launched impressive Strix Point handhelds, and Strix Halo could improve upon that further.\n\n\nHowever, the catch is that we might never play games on this specific chip. The cumbersomely named Ryzen AI Max+ Pro 395 is potentially only for enterprise or development hardware.\n\n\nAMD is still trying to make inroads into the artificial intelligence market, and having a laptop chip as powerful as a laptop RTX 4060 onboard could make a big splash.''",
      "score": 29,
      "created_utc": 1733838556.0,
      "replies": []
    },
    {
      "id": "m1dipko",
      "author": "Bobbler23",
      "body": "A low end integrated APU would certainly take a chunk out of what Nvidia call \"low end\" cards if we can get it in desktop architecture!",
      "score": 23,
      "created_utc": 1733846603.0,
      "replies": []
    },
    {
      "id": "m1dqr50",
      "author": "None",
      "body": "Praise the lord",
      "score": 6,
      "created_utc": 1733849166.0,
      "replies": []
    },
    {
      "id": "m1gwpm0",
      "author": "internetlad",
      "body": "Put that shit in the steam deck 2.",
      "score": 10,
      "created_utc": 1733887162.0,
      "replies": [
        {
          "id": "m1zrr3h",
          "author": "TareXmd",
          "body": "Too high of a power envelop. That will be powering the Valve Fremont, their home microconsole which will be able to stream to the Deck or Deckard.",
          "score": 1,
          "created_utc": 1734167272.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1gq6ak",
      "author": "bugeater88",
      "body": "thats insane. imagine putting one of those in an itx case and loading it up with batocera. relatively cheap(er) and powerful emulation machine",
      "score": 5,
      "created_utc": 1733884629.0,
      "replies": []
    },
    {
      "id": "m1fz7lj",
      "author": "get_homebrewed",
      "body": "contender for project Fremont?",
      "score": 2,
      "created_utc": 1733874665.0,
      "replies": []
    },
    {
      "id": "m1gd2b7",
      "author": "darti_me",
      "body": "We might eventually go full circle to the AGP/PCI days and have the GPU as an optional accelerator",
      "score": 2,
      "created_utc": 1733879672.0,
      "replies": []
    },
    {
      "id": "m1gpp95",
      "author": "None",
      "body": "For how many watts?",
      "score": 1,
      "created_utc": 1733884448.0,
      "replies": []
    },
    {
      "id": "m1zrm19",
      "author": "TareXmd",
      "body": "Please tell me this will be powering the Fremont. It's gotta be.",
      "score": 1,
      "created_utc": 1734167173.0,
      "replies": []
    },
    {
      "id": "m2c6kut",
      "author": "hey_you_too_buckaroo",
      "body": "Reminder to folks that laptop 4060 =/= desktop 4060.",
      "score": 1,
      "created_utc": 1734361898.0,
      "replies": []
    },
    {
      "id": "m1dy962",
      "author": "Blarg0117",
      "body": "I wonder what the thermal profile is like. Sounds like liquid cooling would be a necessity.",
      "score": -6,
      "created_utc": 1733851520.0,
      "replies": [
        {
          "id": "m1ffa1t",
          "author": "elite_haxor1337",
          "body": "lol. I'm laughing at this comment. Liquid cooling isn't ever \"necessary\". Chips don't \"need\" water, they just need to be cooled. Especially considering that this article is about mobile chips, something tells me they will not be water cooled. I mean sometimes these chips aren't even air cooled. They're passively cooled.",
          "score": 7,
          "created_utc": 1733867926.0,
          "replies": []
        },
        {
          "id": "m1ejsxj",
          "author": "crescentfreshchester",
          "body": "Key Features and Questions:\n\nThe massive 40 CU iGPU requires significant bandwidth, which might be addressed through HBM or multiple stacks of LPDDR5 RAM on the die carrier.\n\nThe CPU power seems excessive for the iGPU capabilities, potentially limiting its appeal for gaming and AI workloads.\n\nThe Strix Halo’s power consumption is expected to range from 15W to 120W, depending on the configuration.\n\nThe die carrier’s size and potential for expansion through DIMM sockets are unclear.",
          "score": 3,
          "created_utc": 1733858198.0,
          "replies": []
        },
        {
          "id": "m1fb5yn",
          "author": "Magnusg",
          "body": "Liquid cooling is kind of a lie.",
          "score": 6,
          "created_utc": 1733866653.0,
          "replies": [
            {
              "id": "m1i7dey",
              "author": "an0maly33",
              "body": "Not really. I can't turn back from liquid. It's silent AF even under load. My 2080 with the stock cooler sounded like a vacuum cleaner.",
              "score": 2,
              "created_utc": 1733913332.0,
              "replies": [
                {
                  "id": "m1i8jtm",
                  "author": "Magnusg",
                  "body": "interesting...  some if not the majority of liquid cooling systems are often louder, im glad it worked out for you though.  \n\nFor me it also makes it so much more difficult to manage updating components and frankly, it's almost always unnecessary to keep things cool.  \n\nthe 20 series had a lot of rough patches about it.  \n\nwith the exception of poorly designed graphic cards and kind of the large immediate heat reservoir that builds in i dont think there's really any measurable perf difference with liquid that is worth using unless you are doing some serious overclocking.",
                  "score": 1,
                  "created_utc": 1733914106.0,
                  "replies": [
                    {
                      "id": "m1i9zp4",
                      "author": "an0maly33",
                      "body": "My 3070 was loud too. I have 2 loops myself and a buddy of mine has 2. Mix of custom and AIO stuff. Haven't really had any issues aside from topping off my coolant once in a while. I know I should purge and flush periodically but I haven't bothered with that either.",
                      "score": 1,
                      "created_utc": 1733915023.0,
                      "replies": [
                        {
                          "id": "m1ib8uo",
                          "author": "Magnusg",
                          "body": "Tell me what brand of Nvidia GPU you are buying so I can avoid that manufacturer LMAO",
                          "score": 1,
                          "created_utc": 1733915757.0,
                          "replies": [
                            {
                              "id": "m1id384",
                              "author": "an0maly33",
                              "body": "2080 is EVGA and the 3070 is Gigabyte. The 3070 wasn't as bad but I'm not up for hearing a jet while I play games.",
                              "score": 1,
                              "created_utc": 1733916869.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m1fs8sw",
          "author": "None",
          "body": "watercooling is roughly as effective as a good CPU fan\n\nit's definitely not categorically superior",
          "score": 0,
          "created_utc": 1733872198.0,
          "replies": [
            {
              "id": "m1i7h2e",
              "author": "an0maly33",
              "body": "Agree on the cpu. I have a big heatsink and good airflow. It's quiet. My beef is with gpu air coolers. I need water there.",
              "score": 1,
              "created_utc": 1733913400.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1hvf3w",
      "author": "Thwitch",
      "body": "Seriously dont understand AMD'S reasoning behind putting hamstrung GPU's on the same die as an overkill CPU. Why can they not produce a chip with both low-midrange CPU & GPU?",
      "score": -3,
      "created_utc": 1733905065.0,
      "replies": [
        {
          "id": "m1i78zl",
          "author": "an0maly33",
          "body": "They do... the G cpus are your low end CPU/GPU. And they're surprisingly capable for what they are.",
          "score": 1,
          "created_utc": 1733913252.0,
          "replies": []
        }
      ]
    }
  ]
}