{
  "post": {
    "title": "The quest to save the world’s largest CRT TV from destruction",
    "author": "Remorse_123",
    "id": "1hl8h25",
    "score": 1714,
    "created_utc": 1735025258.0,
    "selftext": "",
    "num_comments": 106,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hl8h25/the_quest_to_save_the_worlds_largest_crt_tv_from/"
  },
  "comments": [
    {
      "id": "m3kafw2",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1735025259.0,
      "replies": []
    },
    {
      "id": "m3kd46l",
      "author": "joebewaan",
      "body": "440 pounds! That’s some old-school theft prevention system right there.",
      "score": 419,
      "created_utc": 1735027000.0,
      "replies": [
        {
          "id": "m3lmh9c",
          "author": "diacewrb",
          "body": "I would hate to be the guy who lifts that.\n\nThere are motorbikes around half that weight.",
          "score": 82,
          "created_utc": 1735052245.0,
          "replies": [
            {
              "id": "m3lxxxk",
              "author": "CL-MotoTech",
              "body": "The good news is that you can’t be the guy the lifts it.",
              "score": 33,
              "created_utc": 1735056346.0,
              "replies": [
                {
                  "id": "m3m57i8",
                  "author": "arandomvirus",
                  "body": "Don’t underestimate the power of crack",
                  "score": 13,
                  "created_utc": 1735058853.0,
                  "replies": [
                    {
                      "id": "m3n95wc",
                      "author": "KnightOfMarble",
                      "body": "No, we’re trying to *stop* those from happening!",
                      "score": 5,
                      "created_utc": 1735072880.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m3o8y6g",
          "author": "kurotech",
          "body": "The fact that the original owner bought it immediately after he found out about it was crazy to me the dude had like 100k to spend on one TV for his business that's awesome and I wish them the best at their new location also dude that got it congrats also on fixing it you've made yourself a star in the scene",
          "score": 16,
          "created_utc": 1735087585.0,
          "replies": [
            {
              "id": "m4wmt2h",
              "author": "KindaSortaGood",
              "body": "80's Japan was amazing economic times",
              "score": 3,
              "created_utc": 1735765961.0,
              "replies": [
                {
                  "id": "m4x13y1",
                  "author": "kurotech",
                  "body": "Yea and to think he had that much extra cash from udon noodles that's awesome",
                  "score": 1,
                  "created_utc": 1735770452.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m3mhrve",
          "author": "notfork",
          "body": "My grandfather who always had to have the latest and greatest in TV's had one of these, after he replaced it, it went into the kids play area at their house, as no one is gonna knock that over.  When we moved from Chicago in 99 he sold it for a few grand.",
          "score": 17,
          "created_utc": 1735063154.0,
          "replies": [
            {
              "id": "m3p4fs9",
              "author": "im_thatoneguy",
              "body": "Unlikely. The story goes that this TV only ever existed in photo shoots with none actually sold",
              "score": -11,
              "created_utc": 1735103210.0,
              "replies": [
                {
                  "id": "m3p5yw6",
                  "author": "JoeyBigtimes",
                  "body": "You didn’t watch the video then.",
                  "score": 16,
                  "created_utc": 1735104052.0,
                  "replies": [
                    {
                      "id": "m3ruohh",
                      "author": "Jontun189",
                      "body": "Average Redditor",
                      "score": 3,
                      "created_utc": 1735155260.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m3pikrt",
                  "author": "notfork",
                  "body": "IDK, it was a big honking huge tv, had a custom built stand, to support its weight. And grandfather was not the type to spend less than that on a TV. Replaced it with a giant rear projector that took up almost the entire wall. Then when we moved out of Chicago in 99 and he had to down size he got the 61inch Sony rear projection HDTV, which I know was about 20k.\n\n*man drove the same car for 20 years, but loved the latest and greatest, and biggest in TV's",
                  "score": 5,
                  "created_utc": 1735112012.0,
                  "replies": []
                },
                {
                  "id": "m3r4216",
                  "author": "Domspun",
                  "body": "The guy who had the service manual saw more than one.",
                  "score": 3,
                  "created_utc": 1735145258.0,
                  "replies": []
                },
                {
                  "id": "m3rja3j",
                  "author": "Ayellowbeard",
                  "body": "Username checks out",
                  "score": 2,
                  "created_utc": 1735151050.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m3lx4dx",
          "author": "r3d213",
          "body": "While I would normally agree. I've seen someone steal a AC unit on youtube. Where there's a will, there's a way lol.\n\nEdit: Kinda feel like I need to clarify. They didn't have a vehicle or dolly to take it. They just picked it up, and walked off with it lol.",
          "score": 12,
          "created_utc": 1735056058.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m3khpuq",
      "author": "sometipsygnostalgic",
      "body": "I watched this 2 days ago and adored it so much i made my girlfriend watch the whole thing with me yesterday. This isn't just a regular video about CRTs, this is a fucking Summoning Salt documentary of how they saved this tv. It's a rollercoaster. My favourite part is how months after the fact you learnt who the mysterious stranger actually was.\n\nThe youtuber in question only has 8 videos so this isn't their full time job. It's crazy how good this video turned out.",
      "score": 343,
      "created_utc": 1735030093.0,
      "replies": [
        {
          "id": "m3kl746",
          "author": "nib13",
          "body": "I really love how many people end up playing a part in this story and how different they all are, with the common thread of appreciating the TV.",
          "score": 56,
          "created_utc": 1735032486.0,
          "replies": []
        },
        {
          "id": "m3l2oua",
          "author": "JoyKil01",
          "body": "Direct link to video: https://youtu.be/JfZxOuc9Qwk",
          "score": 71,
          "created_utc": 1735043672.0,
          "replies": [
            {
              "id": "m3nphaq",
              "author": "KaJaHa",
              "body": "I don't even care for CRTs like that, but the sheer *passion* this little community had for preserving a piece of tech history is genuinely touching",
              "score": 26,
              "created_utc": 1735079145.0,
              "replies": []
            },
            {
              "id": "m3p3xk8",
              "author": "Different-Produce870",
              "body": "That was an awesome video",
              "score": 7,
              "created_utc": 1735102933.0,
              "replies": []
            },
            {
              "id": "m4wji59",
              "author": "sofa_king_we_todded",
              "body": "2M views in 10 days 👏",
              "score": 2,
              "created_utc": 1735764894.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m3lddpl",
          "author": "BC_Ages",
          "body": "Watched it yesterday, the ending blew my mind with who the stranger actually was. Never played any of the series’ games, but seeing that he was willing to help at the time he did is just so heartwarming.",
          "score": 27,
          "created_utc": 1735048616.0,
          "replies": []
        },
        {
          "id": "m3mhbuk",
          "author": "None",
          "body": "[deleted]",
          "score": 24,
          "created_utc": 1735063003.0,
          "replies": [
            {
              "id": "m3rlo7e",
              "author": "Ayellowbeard",
              "body": "You know a company is either way too massive, completely disconnected from earthly bonds, or both when every attempt to contact them over a period of a year on such an important and historic undertaking fails!",
              "score": 3,
              "created_utc": 1735151920.0,
              "replies": []
            },
            {
              "id": "m3n5pk5",
              "author": "None",
              "body": "governor wakeful head zesty expansion pause shrill sulky smoggy vase\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 3,
              "created_utc": 1735071585.0,
              "replies": [
                {
                  "id": "m3no5zk",
                  "author": "dazed2684",
                  "body": "He addressed the language barrier in the video.",
                  "score": 4,
                  "created_utc": 1735078613.0,
                  "replies": [
                    {
                      "id": "m3ox6zo",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 2,
                      "created_utc": 1735099382.0,
                      "replies": [
                        {
                          "id": "m3p7fum",
                          "author": "dazed2684",
                          "body": "They don't publish the phone numbers in phone books anymore 🤷‍♀️",
                          "score": 2,
                          "created_utc": 1735104884.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m3npjky",
          "author": "Santa_Ricotta69",
          "body": "It's also an interesting commentary on just how much good stuff exists in Japan. Seriously, the people there take such wonderful care of their things and really respect their property in a way North Americans just don't. I had my car imported from Japan and the person who owned it before me treated the thing like a museum piece. Basically a brand new 20 year old car. Everyone here treats material goods like they're disposable.",
          "score": 9,
          "created_utc": 1735079171.0,
          "replies": [
            {
              "id": "m3o37d0",
              "author": "sometipsygnostalgic",
              "body": "Ehh theres pros and cons. Respect in Japan goes to absurd levels where people no longer recognise each other's ability to have emotions and make mistakes. Vehicles here are a mess because they're very lived in (also a lot of urban japan has better public transport than most other countries and worse roads so less distance driven).",
              "score": 6,
              "created_utc": 1735085002.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m3l2qn3",
      "author": "JoyKil01",
      "body": "Direct link to the video that this article is about:  https://youtu.be/JfZxOuc9Qwk",
      "score": 53,
      "created_utc": 1735043700.0,
      "replies": [
        {
          "id": "m3m6sjs",
          "author": "skylarmt_",
          "body": "Part 2: https://www.youtube.com/watch?v=oHg5SJYRHA0",
          "score": -29,
          "created_utc": 1735059389.0,
          "replies": [
            {
              "id": "m3ndhr8",
              "author": "challenge_king",
              "body": "Wrong video. Give Rick the love he deserves.",
              "score": 6,
              "created_utc": 1735074500.0,
              "replies": []
            },
            {
              "id": "m3na38p",
              "author": "ZAFJB",
              "body": ":) just as I expected.",
              "score": 1,
              "created_utc": 1735073224.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m3llxlc",
      "author": "yarash",
      "body": "I still remember when that delivery truck came down our block\n\nWhat a lucky guy, I hear he got the last one in stock\n\nAnd the neighbors are just green\n\nThey say, \"That's the biggest screen we've ever seen!\"\n\nFranks 2000 inch TV",
      "score": 51,
      "created_utc": 1735052040.0,
      "replies": [
        {
          "id": "m3nbvjv",
          "author": "P2Mc28",
          "body": "This was what I was going to reply to my brother with when he linked me the video.  But then I watched the video and was so absorbed by it I had forgotten the song until reading your post just now lol.",
          "score": 13,
          "created_utc": 1735073889.0,
          "replies": []
        },
        {
          "id": "m44nynj",
          "author": "trainbrain27",
          "body": "That was impossible at the time, and now there are at least 40 video screens larger than the 12,000 square feet of a 2000 inch TV.\n\nIn All About the Pentiums, he lists ridiculous specs, but they're easily possible these days.    \n100Gb of RAM: currently overkill for most folks, but less than $200   \nT1 line, don't make me laugh, that's only 1.45 megabits, not enough for SD streaming.  \nFlat screen 40 inches wide? Many of us have that, but it's called a TV. \n\nTo be fair, my Commodore 64 is pretty neato, but not because it's fast.",
          "score": 1,
          "created_utc": 1735350852.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m3krcgj",
      "author": "RuthlessIndecision",
      "body": "Soon someone will be asking “how the hell did they get this his thing into the basement?”",
      "score": 16,
      "created_utc": 1735036668.0,
      "replies": []
    },
    {
      "id": "m3kuvow",
      "author": "RockD79",
      "body": "Watched the video a few days ago. A good watch. Definitely recommend it.",
      "score": 18,
      "created_utc": 1735039003.0,
      "replies": []
    },
    {
      "id": "m3liucm",
      "author": "Omardemon",
      "body": "I had a 40” Sony Trinitron “flat screen” box tx, holy shit that guy was a heavy fucking pig. I finally disposed of him only 3 years ago when it stopped working.",
      "score": 14,
      "created_utc": 1735050853.0,
      "replies": [
        {
          "id": "m3nfg7y",
          "author": "Fredasa",
          "body": "We had one of those.  I freaking dreaded the many times we had to move it.  It was literally dangerous.  I have no idea what became of it, either.",
          "score": 4,
          "created_utc": 1735075241.0,
          "replies": [
            {
              "id": "m3nfut4",
              "author": "Omardemon",
              "body": "Yes! Every time I moved him, I had a close call with something from something happening, every time the 300+ pound tv was moved, it was memorable, fucking ridiculous.",
              "score": 2,
              "created_utc": 1735075398.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m3lt6oh",
      "author": "donrb",
      "body": "Wild. Double the weight of the beast I had. The Sony KV-34XBR800 was a 34\" widescreen that supported 1080i and weighed 206 lbs. A monster. Almost dropped it a few times trying to move it. When it came time to upgrade to a flat screen (an LG 55\" I bought in 2011, still running strong today), it was an easy choice to give it away for free to have someone move it on their own (we helped... They didn't bring enough people). The LG and every TV afterward has felt like a feather",
      "score": 23,
      "created_utc": 1735054679.0,
      "replies": [
        {
          "id": "m3ly8qz",
          "author": "tryntafind",
          "body": "I had one of those too!  I moved it twice and the movers had to call for backup each time even though I warned them.  Getting that thing up on the stand required a makeshift system of ramps, lifts  and levers that felt like what the Egyptians used to build the pyramids.",
          "score": 11,
          "created_utc": 1735056452.0,
          "replies": [
            {
              "id": "m3m2etv",
              "author": "donrb",
              "body": "I think we usually got it done with 3 people. Did it with 2 with my brother and we almost lost it, nicked a corner. Kind of like moving fish tanks and massive wood dining room tables - you can never have enough people!!\n\nAnd yea, no one was ever prepared for that first lift...",
              "score": 1,
              "created_utc": 1735057896.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m3m3pub",
          "author": "r_golan_trevize",
          "body": "> The LG and every TV afterward has felt like a feather\n\nWhen we bought our current 55” flatscreen TV, the guy at Sam’s Club loaded it in the back of my truck so I didn’t actually handle the box till we got home. I thought he’d given me the demo TV’s empty box when I went to unload it in the driveway, lol\n\nI guess at some size they start getting heavy again though because the sheer size of the screen needs the reinforcement of a proper metal frame to resist deflection. I helped my mother-in-law install a 75” TV and that thing weighed *a lot* more than I was expecting.",
          "score": 7,
          "created_utc": 1735058345.0,
          "replies": [
            {
              "id": "m3m6f7u",
              "author": "donrb",
              "body": "Yea there are definitely 150lb flats out there, but you're looking at the largest screens around. I think even 85\" TVs are still manageable with two folks at around 75 lbs. Nothing you want to drop or try to hang solo, but easy peasy compared to the tube monsters of yesteryear",
              "score": 2,
              "created_utc": 1735059264.0,
              "replies": [
                {
                  "id": "m3m9a1q",
                  "author": "r_golan_trevize",
                  "body": "Oh, yeah, still easier to handle than our final 35” CRT.",
                  "score": 2,
                  "created_utc": 1735060243.0,
                  "replies": []
                },
                {
                  "id": "m3mcdt4",
                  "author": "dominus_aranearum",
                  "body": "I just installed a 136lb 75\" interactive display panel that I use as a TV. It actually has a handle on each side at the back. I wanted a mount that did more than just tilt but most mounts stop at 132lb support. Ending up finding a mount that extends, tips, twists and turns while supporting 275lbs. I'll never need another mount.",
                  "score": 1,
                  "created_utc": 1735061319.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m3pq5yw",
          "author": "gullzway",
          "body": "My old RCA F38310 moved houses three times.\n\nLargest Widescreen CRT made at 38\", around 225 lbs.\n\nFinally gave it away on craigslist, still worked great just took up an entire corner of a room.",
          "score": 3,
          "created_utc": 1735117550.0,
          "replies": []
        },
        {
          "id": "m3n60ud",
          "author": "None",
          "body": "beneficial money squeeze dime ruthless unpack aromatic waiting shocking snails\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 1,
          "created_utc": 1735071702.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m3l8ls6",
      "author": "Samwellikki",
      "body": "The Smash Brothers lobby is strong",
      "score": 8,
      "created_utc": 1735046552.0,
      "replies": []
    },
    {
      "id": "m3mfvn4",
      "author": "an1sotropy",
      "body": "I really want to hear from the Sony engineer he contacted, and started to share info, before Sony corporate shut him up and said that only corporate-approved interviews are allowed.",
      "score": 8,
      "created_utc": 1735062507.0,
      "replies": []
    },
    {
      "id": "m3lxnmb",
      "author": "CarltonSagot",
      "body": "In the early 90s my rich babysitter had a fucking massive crt. Looking at this I wonder how big it actually was, because I don't think they dumped 40k on a TV, no matter how much dough they had.",
      "score": 5,
      "created_utc": 1735056247.0,
      "replies": [
        {
          "id": "m3pcmlz",
          "author": "LoadedSteamyLobster",
          "body": "Are you certain it was a CRT? Perhaps it was one of those rear projection monsters from back in the day?",
          "score": 3,
          "created_utc": 1735108024.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m3meo0v",
      "author": "TheOvy",
      "body": "The troll at the end made me laugh harder than I have in months. Great video.",
      "score": 6,
      "created_utc": 1735062099.0,
      "replies": []
    },
    {
      "id": "m3lf9a6",
      "author": "stillcore",
      "body": "Man, it was difficult enough carrying a 27\" tube up 2 flights of stairs when building a MAME machine. I couldn't imagine adding another couple hundred pounds onto that.",
      "score": 6,
      "created_utc": 1735049403.0,
      "replies": []
    },
    {
      "id": "m3nf6wg",
      "author": "Fredasa",
      "body": "I got a good lol when the sh--post account said \"thx i'll buy that\" and the low-rent digital voice shot back \"No you won't\".",
      "score": 4,
      "created_utc": 1735075143.0,
      "replies": []
    },
    {
      "id": "m3mt02z",
      "author": "Pisstoffo",
      "body": "A coworker is friends with this guy and they said he’s awesome.  I’m happy he managed to get his holy grail!",
      "score": 5,
      "created_utc": 1735067033.0,
      "replies": []
    },
    {
      "id": "m3o1y9s",
      "author": "Edweirdo256",
      "body": "I had one of those.  36\" Mitsubishi tube TV.  I bought it in 1988 for $2500 (on my credit card).  It weight a ton.  I had to move it 5 times in 10 years.  I eventually gave it to a friend who had it in his basement for 10 more years (for the kids).  I never bought the extended warranty even though I got letters about it almost every year, and the thing lasted like 20+ years.",
      "score": 4,
      "created_utc": 1735084448.0,
      "replies": []
    },
    {
      "id": "m3mqb5d",
      "author": "saml01",
      "body": "Do they not have piano movers in Osaka?",
      "score": 3,
      "created_utc": 1735066090.0,
      "replies": [
        {
          "id": "m3r4sqr",
          "author": "Domspun",
          "body": "Yes, but the issue was the short notice. Usually, things like this are planned months in advance.",
          "score": 3,
          "created_utc": 1735145544.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m3meph2",
      "author": "themellowmedia",
      "body": "lol just saw this on YouTube. So cool. I remember saying back in the day that if someone broke into my apartment, at least the TV (Sony trinitron) would be left standing",
      "score": 2,
      "created_utc": 1735062112.0,
      "replies": []
    },
    {
      "id": "m3ng2ks",
      "author": "6dirt6cult6",
      "body": "It’s such a great story.",
      "score": 2,
      "created_utc": 1735075480.0,
      "replies": []
    },
    {
      "id": "m3pqf8i",
      "author": "RandomBitFry",
      "body": "I can hear the high pitch whistling just looking at the photo.",
      "score": 2,
      "created_utc": 1735117742.0,
      "replies": []
    },
    {
      "id": "m3klf2l",
      "author": "Riegel_Haribo",
      "body": "Reporting on a youtube video they saw on Reddit...",
      "score": 5,
      "created_utc": 1735032640.0,
      "replies": [
        {
          "id": "m3l26rh",
          "author": "legitsalvage",
          "body": "Yes, people like to read 2 min articles and not watch 35 min videos.",
          "score": 21,
          "created_utc": 1735043399.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m3mavz8",
      "author": "Ruttagger",
      "body": "I had the Sony XBR Trinitron 40\" with the connecting stand.\n\nThat thing was a beast that weighed over 300lbs.  Still one of the coolest most impressive peices of tech I had over the years.\n\nIt took 3 of my buddies to help me remove it from my basement when it was finally time to switch to a Plasma.",
      "score": 2,
      "created_utc": 1735060799.0,
      "replies": []
    },
    {
      "id": "m3mnkew",
      "author": "LoveMeSomeSand",
      "body": "Excellent video, if you haven’t seen it go watch it now!",
      "score": 1,
      "created_utc": 1735065138.0,
      "replies": []
    },
    {
      "id": "m3mo11d",
      "author": "Specialist_Brain841",
      "body": "I though the use of a net by the japanese movers was clever",
      "score": 1,
      "created_utc": 1735065297.0,
      "replies": []
    },
    {
      "id": "m3mxjpf",
      "author": "DadJokeBadJoke",
      "body": "I've still got a 32 inch Panasonic CRT in the garage.  I've kept it for Duck Hunt and also because I almost crushed myself getting it up on its shelf that I'm kinda afraid to move it again.  You can practically count the pixels with the naked eye.",
      "score": 1,
      "created_utc": 1735068641.0,
      "replies": []
    },
    {
      "id": "m3myrb8",
      "author": "6355592471",
      "body": "I'm glad I subbed to this guy a long time ago",
      "score": 1,
      "created_utc": 1735069073.0,
      "replies": []
    },
    {
      "id": "m3n8qnz",
      "author": "StIdes-and-a-swisher",
      "body": "I left my crt TV upstairs.",
      "score": 1,
      "created_utc": 1735072722.0,
      "replies": []
    },
    {
      "id": "m3no6gf",
      "author": "None",
      "body": "That’s the Fat Joe of TV’s",
      "score": 1,
      "created_utc": 1735078619.0,
      "replies": []
    },
    {
      "id": "m3nqrm6",
      "author": "ThePowerOfStories",
      "body": "I wonder if they had to do anything to it to get it to work in the US, which has a 120V 60Hz electrical system, while western Japan (including Osaka) uses the uncommonly-low-voltage 100V 60Hz standard (and just for fun, eastern Japan is 100V 50Hz).",
      "score": 1,
      "created_utc": 1735079663.0,
      "replies": [
        {
          "id": "m3pp0vk",
          "author": "lost_send_berries",
          "body": "A step-down transformer is pretty small compared to this thing. I think they're the size of a desktop PC or thereabouts, but much heavier.",
          "score": 1,
          "created_utc": 1735116696.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m3nuda2",
      "author": "LickSomeToad",
      "body": "I watched the video recently, what a fun ride! Loved seeing everyone come together to recalibrate and repair picture quality as well, how cool!",
      "score": 1,
      "created_utc": 1735081141.0,
      "replies": []
    },
    {
      "id": "m3o1eg2",
      "author": "Roubaix62454",
      "body": "We had a 34” Sony CRT HD tv. It weighed almost 200 lbs. It was not fun to move into our house and onto it’s dedicated stand. The picture was great. I’ll never forget when we first turned it on.",
      "score": 1,
      "created_utc": 1735084207.0,
      "replies": []
    },
    {
      "id": "m3o5umr",
      "author": "Adventurous_Meal1979",
      "body": "Just watched this video. What a wild ride. Detective work, helpful people and sheer luck got the job done!",
      "score": 1,
      "created_utc": 1735086187.0,
      "replies": []
    },
    {
      "id": "m3oscd5",
      "author": "thesummond",
      "body": "I just spoke to my uncle and he has an old crt in his basement that he was unable to move while doing restructuring so he just built a wall around it",
      "score": 1,
      "created_utc": 1735096915.0,
      "replies": []
    },
    {
      "id": "m3pjw2p",
      "author": "buddroyce",
      "body": "Saw this the other day and really give this guy props for going through all that to save a rare tv set.",
      "score": 1,
      "created_utc": 1735112932.0,
      "replies": []
    },
    {
      "id": "m3q95v6",
      "author": "MyReddittName",
      "body": "Why did they ship by air? Much cheaper to ship by sea. No one is in a hurry to use it.",
      "score": 1,
      "created_utc": 1735131113.0,
      "replies": []
    },
    {
      "id": "m3snzgb",
      "author": "nutallergy686",
      "body": "We had a 40” tube in the late 90s and it took 4 men to move it. Very front heavy and had handles built in. My parents had a custom cabinet made for it. Watched many laserdiscs on it.",
      "score": 1,
      "created_utc": 1735166611.0,
      "replies": []
    },
    {
      "id": "m3uymhl",
      "author": "generalraptor2002",
      "body": "Wow",
      "score": 1,
      "created_utc": 1735210432.0,
      "replies": []
    },
    {
      "id": "m4uojpw",
      "author": "CDavis10717",
      "body": "We had a 36” Sony TV in the late 90’s. It weighed 199lbs, was smooth and round with no way to grab and lift it.",
      "score": 1,
      "created_utc": 1735742074.0,
      "replies": []
    },
    {
      "id": "m3m5bci",
      "author": "entropydave",
      "body": "I had a 43” Sony tv when I lived in the U.K.  I left it behind when I emigrated, obviously. \nI didn’t realise they were that rare.",
      "score": 1,
      "created_utc": 1735058889.0,
      "replies": []
    },
    {
      "id": "m3lyurd",
      "author": "FoxRepresentative700",
      "body": "I’ve got a 1986 RCA Dimensia . I believe it’s a 26” Monitor, Oak finish. Got it free on the side of the road. with tags 30 minutes before a rainstorm rolled into town. 100lb unit into my 1996 Corolla",
      "score": 1,
      "created_utc": 1735056665.0,
      "replies": []
    },
    {
      "id": "m3mg0rj",
      "author": "whistler1421",
      "body": "I remember four people trying to get a 36”\nSony Wega up a flight of San Francisco stairs. Iirc around 240lbs but large and clumsy to maneuver in its box. Gave up at the first switchback.",
      "score": 1,
      "created_utc": 1735062556.0,
      "replies": [
        {
          "id": "m3ncbnq",
          "author": "Underwater_Karma",
          "body": "I had one of those, I was never happier to give a television away",
          "score": 1,
          "created_utc": 1735074056.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m3trlko",
      "author": "GM2Jacobs",
      "body": "E-waste!",
      "score": 0,
      "created_utc": 1735183629.0,
      "replies": []
    },
    {
      "id": "m3lbf1s",
      "author": "thepoorking",
      "body": "enjoyed every second of this thanks a LOT for sharing :)",
      "score": 1,
      "created_utc": 1735047783.0,
      "replies": []
    },
    {
      "id": "m3m6xoh",
      "author": "NickCharlesYT",
      "body": "I'll never complain about having to wheel my 180lb generator the 15 feet from its resting place to the transfer switch panel ever again...",
      "score": 0,
      "created_utc": 1735059438.0,
      "replies": []
    },
    {
      "id": "m3ps0z6",
      "author": "RevolutionaryLog9542",
      "body": "I bought the last big Sony commercial version of the TV. It was 350 pounds and $900. It threw out a sick cathode ray beam right in your face. In retrospect, those TVs could not have been good for you lol lol",
      "score": 0,
      "created_utc": 1735118937.0,
      "replies": []
    },
    {
      "id": "m3m2ar7",
      "author": "r_golan_trevize",
      "body": "I need to know the history of this particular unit. \n\nWho bought it it in the first place and for what purpose? How did it end up in a restaurant on the second floor? \n\nAnd if the restaurant was the same entity that initially purchased it, why? And how did they justify a (in today’s money) $100,000 TV when no one in the world would have walked in there and said, “Oh, they’ve only got a [27” TV]/[rear projection TV] and not a 440lbs 45” CRT TV in their waiting area. I can’t eat here.”",
      "score": -4,
      "created_utc": 1735057858.0,
      "replies": [
        {
          "id": "m3mhnd4",
          "author": "None",
          "body": "[deleted]",
          "score": 12,
          "created_utc": 1735063111.0,
          "replies": [
            {
              "id": "m3n3irq",
              "author": "r_golan_trevize",
              "body": "That’s good to know. I watched a good bit of it earlier but I guess I didn’t get that far.",
              "score": -2,
              "created_utc": 1735070778.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m3mhuqq",
          "author": "bert93",
          "body": "The history is in the video. There's an interview with the restaurant owner.",
          "score": 8,
          "created_utc": 1735063181.0,
          "replies": []
        },
        {
          "id": "m3mjquh",
          "author": "Frisbeethefucker",
          "body": "This is all explained in the video.",
          "score": 6,
          "created_utc": 1735063826.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m3m7ohq",
      "author": "kawsofdeath",
      "body": "Melee will never die! somebody grab this to use at a local PLS!",
      "score": -1,
      "created_utc": 1735059693.0,
      "replies": []
    },
    {
      "id": "m3lvhvk",
      "author": "Boring_username_21",
      "body": "Just don’t throw it out? There, I saved it from destruction. No need to thank me.\n\nEdit:\nForgot the /s. Thought it was obvious but I guess not.",
      "score": -11,
      "created_utc": 1735055490.0,
      "replies": [
        {
          "id": "m3m0353",
          "author": "TrptJim",
          "body": "For most people it's a 400lb paperweight that they don't know is anything special. What you're saying is \"just have someone who cares about it save it from destruction\" which is exactly what was done.",
          "score": 4,
          "created_utc": 1735057091.0,
          "replies": [
            {
              "id": "m3m0ehe",
              "author": "Boring_username_21",
              "body": "Yea it was just a bad joke based on the post title.",
              "score": 1,
              "created_utc": 1735057200.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m3lglfl",
      "author": "nomadcrows",
      "body": "Probably won't watch it but it's probably pretty interesting",
      "score": -8,
      "created_utc": 1735049950.0,
      "replies": []
    }
  ]
}