{
  "post": {
    "title": "Clever contact lenses watch for glaucoma even when wearers' eyes are shut",
    "author": "chrisdh79",
    "id": "1lcqro0",
    "score": 808,
    "created_utc": 1750074675.0,
    "selftext": "",
    "num_comments": 27,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lcqro0/clever_contact_lenses_watch_for_glaucoma_even/"
  },
  "comments": [
    {
      "id": "my62u89",
      "author": "Soakitincider",
      "body": "I just want a HUD in my contacts.",
      "score": 19,
      "created_utc": 1750115415.0,
      "replies": []
    },
    {
      "id": "my3o5qk",
      "author": "jake3988",
      "body": "IOP increases a lot right before waking?  So having a doctor's appointment where they check my pressure first thing in the morning is probably a bad idea and will give unnecessarily high readings?\n\nI'm not aware of this, but I'll have to investigate and see if this is actually true.  In which case, I'll start scheduling my appointments for the afternoon and see if there's a difference.",
      "score": 14,
      "created_utc": 1750090089.0,
      "replies": [
        {
          "id": "my3uygc",
          "author": "Notactuallyashark",
          "body": "Hi Optometrist here!\n\nKeep your AM appts. IOP increases while BP decreases or your body is in a horizontal position. It fluctuates even more with patients with glaucoma. We want to catch your highest readings we can so we can give an accurate risk assessment. If you don't have glaucoma, this spike won't affect your IOP enough to be unreliable, and there's checks, retests, and other scans necessary before glaucoma is even diagnosed or any treatment is initiated. So no need to worry about that.",
          "score": 34,
          "created_utc": 1750092077.0,
          "replies": []
        }
      ]
    },
    {
      "id": "my76kob",
      "author": "StMongo",
      "body": "Pretty cool tech but I can't imagine wearing contacts 24/7 just for health monitoring. Hope they make it work with glasses too.",
      "score": 2,
      "created_utc": 1750128982.0,
      "replies": []
    },
    {
      "id": "myk18jh",
      "author": "bonesnaps",
      "body": "To my knowledge, glaucoma is extremely easy to identify by an optometrist. This seems wildly unnecessary.",
      "score": 2,
      "created_utc": 1750296591.0,
      "replies": []
    },
    {
      "id": "my2hd76",
      "author": "funwithdesign",
      "body": "Hmmm. Let’s invent something that monitors something while you are asleep using something that isn’t a great idea to wear while you are asleep.",
      "score": -34,
      "created_utc": 1750076520.0,
      "replies": [
        {
          "id": "my2nyxn",
          "author": "FlorydaMan",
          "body": "I know you might not do it with ill intention, but I find these \"Heh, I know more than these experts, here's a funny remark about how dumb their proposal is\" comments really exhausting in this platform.",
          "score": 53,
          "created_utc": 1750079018.0,
          "replies": [
            {
              "id": "my2r8vp",
              "author": "funwithdesign",
              "body": "Just pointing out that given how much doctors recommend NOT wearing contact lenses while sleeping, it’s kind of odd that someone would invest time and money to develop something that is precisely that.",
              "score": -33,
              "created_utc": 1750080154.0,
              "replies": [
                {
                  "id": "my39we7",
                  "author": "mossymochis",
                  "body": "It takes one Google search to find an entire market of overnight wear approved contact lenses you can have prescribed by doctors. \n\nI don't know why you think no one working on these has considered the risks of overnight wear, I'm sure that's something they're weighing in their design and in their cost benefit analysis.",
                  "score": 27,
                  "created_utc": 1750085969.0,
                  "replies": []
                },
                {
                  "id": "my2t3sy",
                  "author": "FlorydaMan",
                  "body": "This is like saying \"omg I can't believe doctors prescribed me drugs given how much doctors recommend NOT doing drugs\".",
                  "score": 22,
                  "created_utc": 1750080789.0,
                  "replies": [
                    {
                      "id": "my2txee",
                      "author": "TwoBionicknees",
                      "body": "it really isn't. \n\nNo one at all gains a single benefit from wearing contacts while asleep. You can gain a slim benefit of the time saved to put them in again, but for anyone who has worn contact lenses you're talking about literal seconds and all to give your eyes no break from them which is a bad idea.\n\nAlso there is precisely zero need in the world to notice the signs of glaucoma within minutes of it happening, none, ever. It's not like a brain bleed, or a stroke, in which detection the second it starts can change treatment success rates and survival massively. it's something that develops over time and being caught in weeks rather than months is maybe something that ends up being beneficial.\n\nadds a cost, provides literally no benefits, only has downsides.",
                      "score": -31,
                      "created_utc": 1750081069.0,
                      "replies": [
                        {
                          "id": "my2vgjo",
                          "author": "MarvinMonroeZapThing",
                          "body": "Did you guys actually READ the article? Basically this is the same argument as “why is Apple developing a foldable phone when I don’t have a need for one?”  First off, it’s in the experimental stages, and if an actual product comes out of this it might be very different from what’s being tested now. That’s kind of the point of science. Second, even the article mentions the tech could find its way to eyeglasses some day. Third, the article explains the importance of rapid diagnosis. Personally I see my optometrist once a year…not often enough for any sort of rapid diagnosis of glaucoma. And lastly, I know people who wear 30-day lenses, only taking them out to replace them. I’m no expert as to whether that’s a good idea or beneficial, but it is a thing.",
                          "score": 21,
                          "created_utc": 1750081580.0,
                          "replies": [
                            {
                              "id": "my2y4sy",
                              "author": "TwoBionicknees",
                              "body": ">  Basically this is the same argument as “why is Apple developing a foldable phone when I don’t have a need for one?”\n\nno it's not, stop making terrible analogies.\n\nFirstly doctors never say don't take drugs for high bloodpressure, they say, don't do heroin, and even if they are prescribing you drugs they will say don't do heroin. Your argument was as if magically doctors say don't do drugs, but then will provide you with black tar heroin and say it's cool, which is an awful argument.\n\nThis isn't a phone that you don't want that others do want and there IS an upside. a folding phone can provide a bigger overall screen space in the same smallest package. me not wanting it doesn't change that.\n\n>Personally I see my optometrist once a year…not often enough for any sort of rapid diagnosis of glaucoma. \n\njesus christ man. Did YOU read the article? there are already contact lenses that do this, they just aren't designed to be worn at night. You can already diagnose glaucoma ridiculously easily.\n\n>Although there already are \"smart\" contact lenses that monitor the eyes for signs of glaucoma, the devices are typically only worn when the patient is awake. A new type of contact lens, however, watches over the eyes throughout the night, too.\n\nTHIS IS LITERALLY THE FIRST PARAGRAPH.\n\nNo making them wearable at night won't translate them to eyewear any more than the existing contacts do. NO finding out you have glaucoma at 3am and waking up with dry eyes and potential damage because you wore contacts over night rather than finding out at 10am when you put your day contacts in holds zero benefit.\n\nthis isn't an argument of 'a' contact that enables detection vs none and having to go to an optician or doctor. this is an argument of a lens that can already detect glaucoma... vs one you can wear at night that costs more, and detects a completely non emergent health issue that a few extra hours notice will provide zero benefit in any situation ever.\n\n>I’m no expert as to whether that’s a good idea or beneficial, but it is a thing.\n\ntwo people told you it was, instead of looking it up, you decided to try to counter with a thing. yes, longer term contacts are a thing, they are thinner, take more expensive materials to allow higher breatheability so that your eyes take less damage from wearing the contacts. the goal for longer term wear is as thin as possible with as few things blocking your eye from getting oxygen. A lens with more layers and substances so it can be a smart lens, is the antithesis of longer term wear contacts.",
                              "score": -15,
                              "created_utc": 1750082440.0,
                              "replies": [
                                {
                                  "id": "my30lmq",
                                  "author": "FlorydaMan",
                                  "body": "There is no way that someone is actually typing all this shit for this. Are these rage-bait bots?",
                                  "score": 6,
                                  "created_utc": 1750083213.0,
                                  "replies": [
                                    {
                                      "id": "my405xg",
                                      "author": "MarvinMonroeZapThing",
                                      "body": "That's where I am with it. Either he's REALLLLLLY got a beef with this subject for some odd reason or he shills for Big Glaucoma and doesn't want any new tech to screw with his end of year bonus.",
                                      "score": 4,
                                      "created_utc": 1750093539.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "my7e07i",
                                  "author": "GravitationalEddie",
                                  "body": "A lot of typing. Still no sense.",
                                  "score": 1,
                                  "created_utc": 1750131842.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "my2xczy",
          "author": "Only-Chef5845",
          "body": "False.\n\nDid you know that certaon contact lenses must only be weared while sleeping? You take em out and have \"good\" sight during the day.\n\nIt all depends...",
          "score": 8,
          "created_utc": 1750082196.0,
          "replies": [
            {
              "id": "my395bl",
              "author": "Alohagrown",
              "body": "Those are used only for a specific type of cornea disorder. For normal contact lenses wearers, sleeping in contact lenses greatly increases the risk of eye infections and other disorders.",
              "score": 5,
              "created_utc": 1750085751.0,
              "replies": []
            }
          ]
        },
        {
          "id": "my2wode",
          "author": "OnlyNeedJuan",
          "body": "Imma invent something that monitors for wise-asses, oh, there it's already going off.",
          "score": 1,
          "created_utc": 1750081978.0,
          "replies": []
        },
        {
          "id": "my2vebu",
          "author": "Riegel_Haribo",
          "body": "Now you need another set of contact lenses that looks for corneal ulcers...",
          "score": 1,
          "created_utc": 1750081559.0,
          "replies": []
        }
      ]
    }
  ]
}