{
  "post": {
    "title": "Apple's Base 128GB iPhone Storage Tier Needs to Go",
    "author": "chrisdh79",
    "id": "1ij6upk",
    "score": 1931,
    "created_utc": 1738859985.0,
    "selftext": "",
    "num_comments": 439,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ij6upk/apples_base_128gb_iphone_storage_tier_needs_to_go/"
  },
  "comments": [
    {
      "id": "mbbie8k",
      "author": "drc84",
      "body": "The 5gb iCloud needs to go.",
      "score": 1847,
      "created_utc": 1738860755.0,
      "replies": [
        {
          "id": "mbbm3vd",
          "author": "chesser45",
          "body": "Backup core data and nothing else. Media management is big storage and that costs money. They aren’t around to provide more than the minimum of free services.",
          "score": 354,
          "created_utc": 1738861777.0,
          "replies": [
            {
              "id": "mbcolcd",
              "author": "None",
              "body": "[deleted]",
              "score": 182,
              "created_utc": 1738872384.0,
              "replies": [
                {
                  "id": "mbe9bt4",
                  "author": "gulgin",
                  "body": "But the point of the iCloud isn’t to be convenient, it is to sell you more iCloud.",
                  "score": 140,
                  "created_utc": 1738889120.0,
                  "replies": [
                    {
                      "id": "mbedaw1",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 49,
                      "created_utc": 1738890424.0,
                      "replies": [
                        {
                          "id": "mbgnwuv",
                          "author": "EnoughWarning666",
                          "body": "Look, Apple is a small little company ok? If they just gave away good products for free (after you pay thousands for their hardware) they would go out of business! Do you want to be responsible for putting little ol' Apple out of business?",
                          "score": 13,
                          "created_utc": 1738928324.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mbiqybh",
                      "author": "x42f2039",
                      "body": "You must not use iCloud",
                      "score": 1,
                      "created_utc": 1738952868.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbfq6n1",
                  "author": "BowTrek",
                  "body": "Yes exactly. I want to back up all my texts without the media included in them.",
                  "score": 3,
                  "created_utc": 1738908696.0,
                  "replies": []
                },
                {
                  "id": "mbf7wv4",
                  "author": "UrbanPugEsq",
                  "body": "I don’t mind paying a bit more for iCloud but have they made it so that iMessage offloads media to iCloud yet?",
                  "score": 2,
                  "created_utc": 1738900931.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbctwlj",
              "author": "Jamie00003",
              "body": "Imagine defending a 3 trillion dollar corporation lol",
              "score": 59,
              "created_utc": 1738873856.0,
              "replies": [
                {
                  "id": "mbdd3tr",
                  "author": "FireLucid",
                  "body": "It's about on par with others.\n\nMicrosoft is the same size. Google gives 15. I also have a dropbox from when it was free way back and have another 15 there although only offer 2 now.",
                  "score": 25,
                  "created_utc": 1738879112.0,
                  "replies": [
                    {
                      "id": "mbdilzs",
                      "author": "Jamie00003",
                      "body": "All of those examples you gave there apart from one are triple apples 5 gig….",
                      "score": -11,
                      "created_utc": 1738880687.0,
                      "replies": [
                        {
                          "id": "mbdnztp",
                          "author": "FireLucid",
                          "body": "Microsoft is 5, Dropbox is 2, Google is 15.\n\nI am pretty sure I took advantage of several offers dropbox had in their start-up stage when they were trying to gain market share like referring users. Not what you get now.",
                          "score": 8,
                          "created_utc": 1738882282.0,
                          "replies": [
                            {
                              "id": "mbdo7ex",
                              "author": "Jamie00003",
                              "body": "If google can do it, Apple can",
                              "score": -6,
                              "created_utc": 1738882345.0,
                              "replies": [
                                {
                                  "id": "mbdy3vx",
                                  "author": "CosmicCreeperz",
                                  "body": "Google makes back their money selling your data and showing ads with the services.  That’s the whole point of an ad supported business.\n\nDo you want Apple to start selling your data and showing ads to offer services for free/cheaper?  FFS I don’t.",
                                  "score": 8,
                                  "created_utc": 1738885467.0,
                                  "replies": [
                                    {
                                      "id": "mbdyeb5",
                                      "author": "Jamie00003",
                                      "body": "Erm….https://www.macrumors.com/2024/11/19/apple-now-directly-selling-ads-in-news-app/",
                                      "score": 0,
                                      "created_utc": 1738885564.0,
                                      "replies": [
                                        {
                                          "id": "mbdytj3",
                                          "author": "CosmicCreeperz",
                                          "body": "In their news app?  While paying content providers? That’s not iCloud.  That’s acquiring content.  Apples to Googles.\n\nLooking at it more, it’s not even new.  Apple is just  acting as an ad exchange for an existing service with ads and taking a 30% cut.  News has always had ads and they still let companies choose to use other exchanges if they want.",
                                          "score": 8,
                                          "created_utc": 1738885703.0,
                                          "replies": [
                                            {
                                              "id": "mbe2en2",
                                              "author": "Jamie00003",
                                              "body": "🤷‍♂️didn’t do it before, now they are",
                                              "score": -3,
                                              "created_utc": 1738886874.0,
                                              "replies": [
                                                {
                                                  "id": "mbemqc0",
                                                  "author": "CosmicCreeperz",
                                                  "body": "Apple had an ad network in the past but they shut it down because it wasn’t their focus and the way they protected customer privacy meant it wasn’t that targeted.\n\nhttps://developer.apple.com/news/?id=01152016a\n\nI don’t think you understand what an ad network is. It’s a seller side marketplace s to offer ads to others, not displaying ads in their products to support them like Google does.",
                                                  "score": 3,
                                                  "created_utc": 1738893580.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mbcwlao",
                  "author": "egnards",
                  "body": "Imagine thinking everything is a black and white thing of “if you don’t agree with X you’re defending Y.”\n\nApple is a company, just like any other company.\n\nProviding data storage is a service.\n\nIf you had a small business that provided data storage, would you want to be paid for it? Of course you would, because it costs you money to store and send/retrieve that data.\n\nApple is no different.\n\n50GB of storage is literally $1, and for most consumers that realize they don’t need to store every movie/gif/mp3 on the cloud. . .thats going to be enough.",
                  "score": 71,
                  "created_utc": 1738874590.0,
                  "replies": [
                    {
                      "id": "mbcyj20",
                      "author": "Iguessthatwillwork",
                      "body": "Are you shitting me? Just because it's a business doesn't mean they aren't greedy fucks. You can be profitable and still be consumer friendly.",
                      "score": -28,
                      "created_utc": 1738875116.0,
                      "replies": [
                        {
                          "id": "mbdjnvd",
                          "author": "chesser45",
                          "body": "They are, they are providing a service that costs money to them at zero ongoing cost to users which includes those who have never even bought a product from them or own an Apple device.",
                          "score": 3,
                          "created_utc": 1738880991.0,
                          "replies": [
                            {
                              "id": "mbds813",
                              "author": "Iguessthatwillwork",
                              "body": "Yes, I just become aware they also provide it to non Apple product owners in which case I agree; asking for money is fair. \n\nI still stand ten toes on it being absolutely consumer unfriendly for those who own Apple products.",
                              "score": 2,
                              "created_utc": 1738883583.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mbcyxfg",
                          "author": "egnards",
                          "body": "I never said they aren’t greedy.\n\nIt’s a public company - public companies exist to create value to their shareholders.\n\nThey **CAN** be consumer friendly, but it’s not **not consumer friendly** to ask a nominal fee for a service.\n\nCompanies are not, and never will be, your friend. Companies exist to sell a service or a product.",
                          "score": 24,
                          "created_utc": 1738875224.0,
                          "replies": [
                            {
                              "id": "mbd38q6",
                              "author": "pappaberG",
                              "body": "You argue with people who don't understand basic principles of economic growth in listed companies existing within a competitive economical sector. No use. Distingushing between a product and a service is hard, and shareholders love stunted growth due to \"consumer friendliness\".\n\nThe average redditor possesses no more knowledge than an elementary schooler.",
                              "score": 19,
                              "created_utc": 1738876401.0,
                              "replies": [
                                {
                                  "id": "mbd3ewi",
                                  "author": "egnards",
                                  "body": "This is why I’ve stopped engaging with that person, it’s clear that their mindset is unable to grasp economical principle.",
                                  "score": 8,
                                  "created_utc": 1738876448.0,
                                  "replies": [
                                    {
                                      "id": "mbd5uo4",
                                      "author": "pappaberG",
                                      "body": "\nYOU NOT REWARDING IGNORANCE BY ENGAGING IN POINTLESS ARGUMENTS REMOVES THE CONSUMER FRIENDLINESS FROM REDDIT\n\nCORPORATE SHILL!!!!",
                                      "score": 10,
                                      "created_utc": 1738877113.0,
                                      "replies": [
                                        {
                                          "id": "mbd5zex",
                                          "author": "egnards",
                                          "body": "😂",
                                          "score": 5,
                                          "created_utc": 1738877150.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mbd8lec",
                              "author": "Iguessthatwillwork",
                              "body": "It absolutely not consumer friendly to when you are also cutting back on the value of your product in other realms. Where's my fucking charger? Oh yea it's them \"going green\". Fine then, lower the price or provide the lost value elsewhere(maybe the cloud storage for example).\n\nNo shit companies aren't my friends (whatever that means). I said a company can be consumer friendly and still make profit. \n\nAnd papaberg is just as dumb. I understand growth is important, but that doesn't mean it has to come at the cost of a crappier product or nickel and diming.",
                              "score": -7,
                              "created_utc": 1738877870.0,
                              "replies": [
                                {
                                  "id": "mbd9mwj",
                                  "author": "egnards",
                                  "body": "This is what we call a strawman.\n\nJust because one thing they do isn’t consumer unfriendly doesn’t mean I said anything about other aspects of their business being consumer friendly.",
                                  "score": 8,
                                  "created_utc": 1738878152.0,
                                  "replies": [
                                    {
                                      "id": "mbdc0or",
                                      "author": "Iguessthatwillwork",
                                      "body": "I figured you would say what does one thing have to do with the other. \n\nIf you make your product worse specifically to profit when a small amount of that profit could be channeled elsewhere into the very same product, it's related.",
                                      "score": -5,
                                      "created_utc": 1738878807.0,
                                      "replies": [
                                        {
                                          "id": "mbdd96r",
                                          "author": "egnards",
                                          "body": "But I didn’t say the first thing you said I’m saying.\n\nI said “one consumer neutral practice does not mean other practices aren’t unfriendly.”",
                                          "score": 8,
                                          "created_utc": 1738879153.0,
                                          "replies": [
                                            {
                                              "id": "mbdewhw",
                                              "author": "Iguessthatwillwork",
                                              "body": "If you want to look at every single aspect in a vacuum. \n\nI'm looking at the product as a whole, because a product is the sum of its parts.",
                                              "score": -3,
                                              "created_utc": 1738879619.0,
                                              "replies": [
                                                {
                                                  "id": "mbdfman",
                                                  "author": "egnards",
                                                  "body": "1) they’re different products - one is a phone, the other is a service you do not need a phone in order to use\n2) you’re just changing the terms of the original discussion, which I’m not willing to have a discussion about. I’m specifically talking about iCloud / which, again, is the original conversation topic.",
                                                  "score": 3,
                                                  "created_utc": 1738879823.0,
                                                  "replies": [
                                                    {
                                                      "id": "mbdj4wb",
                                                      "author": "Iguessthatwillwork",
                                                      "body": "I was under the impression you needed an Apple product for the 5gb cloud service. That's my mistake, excuse me. \n\nOn that front I absolutely agree they shouldn't be giving out free space(or extra free space in this case) for non paying customers. \n\nBut I can guarantee every Apple product that uses that cloud storage, has had cutbacks on the product. \n\nHaving said that, 5gb for Apple product owners is not consumer friendly and neither is asking for money while you continue to take away value from the products that use said cloud storage.",
                                                      "score": 2,
                                                      "created_utc": 1738880839.0,
                                                      "replies": [
                                                        {
                                                          "id": "mbdktr1",
                                                          "author": "egnards",
                                                          "body": "I have an Apple Phone and 2 Apple laptops [both for my business] - I don’t particularly think of myself as an Apple person - I prefer PC [which I have for personal use], and grew up on a PC. If I felt a different phone served my purpose best? That’s the phone I would buy, I have no allegiance to them.\n\nI literally only have an Apple Phone over an android because my former boss many many years ago wanted me to help him with social media, I was a teenager without a smart phones and he bought me one and paid for my phone plan.\n\nIn all that time, I have literally not even once been tempted to use iCloud - not even a single time. I have an external hard drive, which is my preferred backup method, and the one time I temporarily needed online storage? I got a Dropbox account [because it had features for external use outside of my own storage, and that’s what I needed].",
                                                          "score": 2,
                                                          "created_utc": 1738881338.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mbd0bju",
                          "author": "ActivisionBlizzard",
                          "body": "Company charges for service, what’s the discussion here?\n\nIf they gave 100gb out for free, people would just make lots of accounts and undercut their profit.\n\nIt would be lovely if there was just unlimited free storage for everyone, don’t get me wrong, but this is capitalism we’re talking about.",
                          "score": 17,
                          "created_utc": 1738875601.0,
                          "replies": [
                            {
                              "id": "mbd38hl",
                              "author": "RebornPastafarian",
                              "body": "Oh no! They'd only be a $2.9T company instead of $3T!\n\nTim Cook is not going to reward you for shilling in here.",
                              "score": -26,
                              "created_utc": 1738876399.0,
                              "replies": [
                                {
                                  "id": "mbd5j8x",
                                  "author": "ActivisionBlizzard",
                                  "body": "What are you advocating here? No one is shilling anything.\n\nMaybe they should give away iPhones as a public service?",
                                  "score": 13,
                                  "created_utc": 1738877027.0,
                                  "replies": [
                                    {
                                      "id": "mbewf7y",
                                      "author": "RebornPastafarian",
                                      "body": "“They would lose money if they had a slightly lower profit margin. That would be the end of the world!!!!!!!” ",
                                      "score": 0,
                                      "created_utc": 1738896890.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mbdamv1",
                                      "author": "Superfind",
                                      "body": "Suppose they should go and ship the iPhone with 64 gigs of storage. Just enough for your apps. Everything is stored in the cloud these days right? Only $1 for 50gb! I mean 200gb is only $3! That's more than you're getting base storage right now! Hey the companies doing you a favor alright, that 64gb of local storage is a service you gotta pay for, they could have made it 32, be thankful. This storage stuff ain't free if that 5gb were to go to 10 apple might have to file for bankruptcy.",
                                      "score": -15,
                                      "created_utc": 1738878422.0,
                                      "replies": [
                                        {
                                          "id": "mbdfpan",
                                          "author": "like25njas",
                                          "body": "Grow up",
                                          "score": 3,
                                          "created_utc": 1738879846.0,
                                          "replies": [
                                            {
                                              "id": "mbdfrlp",
                                              "author": "Superfind",
                                              "body": "Fair enough",
                                              "score": -1,
                                              "created_utc": 1738879866.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mbdk15f",
                                  "author": "chesser45",
                                  "body": "I think you need to educate yourself on what the guiding principles are for corporations. Maximizing profits is literally their purpose.\nIf you don’t like that…support cooperatives or community initiatives. Sadly neither of those sell iPhones.",
                                  "score": 2,
                                  "created_utc": 1738881100.0,
                                  "replies": [
                                    {
                                      "id": "mbewb5b",
                                      "author": "RebornPastafarian",
                                      "body": "Okay. \n\nAnd? ",
                                      "score": 1,
                                      "created_utc": 1738896851.0,
                                      "replies": [
                                        {
                                          "id": "mbfml8j",
                                          "author": "pappaberG",
                                          "body": "What are you doing on a discussion board if you can't handle having your point shat on?",
                                          "score": 0,
                                          "created_utc": 1738906979.0,
                                          "replies": [
                                            {
                                              "id": "mbk0v0c",
                                              "author": "RebornPastafarian",
                                              "body": "I can own Apple products and still point out that they could provide better products and services even if they had ***slightly*** lower profit margins. \n\nI can own Apple products, understand the basic aspects of capitalism, and still accurately point out that it would not be the literal end of the world if they were worth $2.9T instead of $3T. Or $2.8T. Or $2T. Or $1T.",
                                              "score": 1,
                                              "created_utc": 1738966058.0,
                                              "replies": [
                                                {
                                                  "id": "mbmd9oi",
                                                  "author": "pappaberG",
                                                  "body": "You could point out anything and everything as a random layman, but it holds zero weight.\n\nFor a company listed on the stock exchange, their main function is to grow and provide as much shareholder value as possible. They do this by maximizing profits.\n\nThis especially holds true for the biggest companies, as they would not be the biggest without this modus operandi.\n\nI completely understand your opinion as your interest as a consumer, but that's just not how capitalism works regardless of what we think or wish.",
                                                  "score": 0,
                                                  "created_utc": 1738997114.0,
                                                  "replies": [
                                                    {
                                                      "id": "mbocymb",
                                                      "author": "RebornPastafarian",
                                                      "body": "No. ",
                                                      "score": 1,
                                                      "created_utc": 1739030601.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mbeleev",
                          "author": "allislost77",
                          "body": "Do you know the definition of a business?",
                          "score": 1,
                          "created_utc": 1738893125.0,
                          "replies": [
                            {
                              "id": "mbesti6",
                              "author": "Iguessthatwillwork",
                              "body": "Do you know the definition of business ethics?",
                              "score": 0,
                              "created_utc": 1738895655.0,
                              "replies": [
                                {
                                  "id": "mbetpqm",
                                  "author": "allislost77",
                                  "body": "Good luck with that. Pretty simple. Don’t like it. Don’t buy the product. Everything costs significantly less than msrp. Let me guess? 16-20 years old?",
                                  "score": 1,
                                  "created_utc": 1738895961.0,
                                  "replies": [
                                    {
                                      "id": "mbfdb3s",
                                      "author": "Iguessthatwillwork",
                                      "body": "Good luck with what? Apple to behave ethically? \n\nDo you think I expect that miracle...I was just pointing out their greedy business practice. \n\nOut of genuine curiosity, where did you pluck 16-20 from?",
                                      "score": 1,
                                      "created_utc": 1738903025.0,
                                      "replies": [
                                        {
                                          "id": "mbfmrx2",
                                          "author": "pappaberG",
                                          "body": "People tend to outgrow idealism after that",
                                          "score": 1,
                                          "created_utc": 1738907063.0,
                                          "replies": [
                                            {
                                              "id": "mbfo9mn",
                                              "author": "Iguessthatwillwork",
                                              "body": "I didn't ask you and I'm not an idealist. \n\nAs I said, in the message not to you, \"I was just pointing out their greedy business practice\".",
                                              "score": 1,
                                              "created_utc": 1738907756.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mbfju6q",
                          "author": "Whole_Gear7967",
                          "body": "Really if you don’t like Apple go get an Android! They have to make money. You get paid for your job? They have people that need to feed their families as well!",
                          "score": 1,
                          "created_utc": 1738905762.0,
                          "replies": [
                            {
                              "id": "mbfofdg",
                              "author": "Iguessthatwillwork",
                              "body": "This sarcasm without /s right?",
                              "score": 1,
                              "created_utc": 1738907832.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mbhnrhk",
                          "author": "Talimebannana",
                          "body": "Nobody made you buy an iPhone dip shit",
                          "score": 1,
                          "created_utc": 1738941705.0,
                          "replies": [
                            {
                              "id": "mbifwtt",
                              "author": "Iguessthatwillwork",
                              "body": "I like my iPhone dip shit and I don't even use the cloud...",
                              "score": 1,
                              "created_utc": 1738949739.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mbdbriu",
                          "author": "passwordstolen",
                          "body": "What does this have to do with storage space?",
                          "score": 1,
                          "created_utc": 1738878736.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mbcz48w",
                      "author": "Jamie00003",
                      "body": "Please refer to my previous comment lmao",
                      "score": -8,
                      "created_utc": 1738875274.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbdjdu8",
                  "author": "chesser45",
                  "body": "Imagine a business, whose function is to provide value to their shareholders by selling products and services taking an L by giving away stuff for free beyond what is profitable to them. \n\n5Gb without even needing to prove you have an Apple device is pretty wild. They don’t keep just one copy since that would open them up to legal liability so it’s not just 5Gb on one 16tb disk somewhere, plus backups and DR. It’s not free to them… let’s just say that.\n\n\nHow much would it cost them to offer enough at zero cost to the consumer to backup a 128gb device? Not much? But if you wanted charity you shouldn’t be looking to a corporation.",
                  "score": 10,
                  "created_utc": 1738880911.0,
                  "replies": [
                    {
                      "id": "mbnfxjq",
                      "author": "BeesForDays",
                      "body": "> taking an L by giving away stuff for free beyond what is profitable to them.\n\nCostco .75 cent hotdogs is that you?",
                      "score": 1,
                      "created_utc": 1739019073.0,
                      "replies": []
                    },
                    {
                      "id": "mbeya0z",
                      "author": "Shitposternumber1337",
                      "body": "You’re defending a company that SKIMPS on the the cheapest parts like Storage and RAM. \n\nYou do you know much it would cost to go from 8GB to 16GB RAM or even 16-32? Practically nothing, which is why most tech people rightfully call Apple out for their bullsh*t.\n\n“OuR 8GB iS tHe sAmE aS 16GB oN oThEr OS” despite it being clearly wrong. But please defend the company that thinks you’re stupid enough for that",
                      "score": 0,
                      "created_utc": 1738897529.0,
                      "replies": []
                    },
                    {
                      "id": "mbdjoyz",
                      "author": "Jamie00003",
                      "body": "Won’t somebody think of the corporations! Giving more storage would surely make them go bankrupt! /s",
                      "score": -2,
                      "created_utc": 1738881000.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbdq7zl",
                  "author": "xurdm",
                  "body": "Brother it’s a dollar for 50gb. Get a job",
                  "score": 4,
                  "created_utc": 1738882958.0,
                  "replies": [
                    {
                      "id": "mbdqcjx",
                      "author": "Jamie00003",
                      "body": "I already pay for 2tb?",
                      "score": -1,
                      "created_utc": 1738882997.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbczmrc",
                  "author": "None",
                  "body": "imagine being entitled to demand everything for free",
                  "score": 4,
                  "created_utc": 1738875413.0,
                  "replies": [
                    {
                      "id": "mbd0jo3",
                      "author": "Jamie00003",
                      "body": "Lmao fanboi is strong in this one",
                      "score": -11,
                      "created_utc": 1738875662.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbeu65i",
                  "author": "meerlot",
                  "body": "You can get like 10TB external hard drive for $250 or 5TB external hard drive for $115. \n\nPeople who need more data can always use these options. Its copy and paste to transfer data from mobile to hard disk. (maybe things are different in iphones? )\n\nIts just that companies rely on people being lazy asf to make extra money.",
                  "score": 1,
                  "created_utc": 1738896119.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbd6zdl",
              "author": "azhillbilly",
              "body": "I have no media or app data selected, still won’t backup my contacts. Just always shows the ad to buy more storage. \n\nLike I am going to pay for an upgrade when the free part doesn’t work.",
              "score": 1,
              "created_utc": 1738877426.0,
              "replies": []
            },
            {
              "id": "mbdi6ty",
              "author": "fredrik_skne_se",
              "body": "It would be nice if you can set your own backup server.",
              "score": 1,
              "created_utc": 1738880565.0,
              "replies": []
            },
            {
              "id": "mbeb1t0",
              "author": "sketchy_ai",
              "body": "If I turn off backups of EVERYTHING, i somehow still do not have enough space to do a backup, so I am CONSTANTLY hounded to upgrade iCloud. Literally turning off EVERYTHING except \"Contacts\" is still too big to do a backup...",
              "score": 1,
              "created_utc": 1738889680.0,
              "replies": [
                {
                  "id": "mbeo1c8",
                  "author": "chesser45",
                  "body": "Weird, I have seen this issue in the past, but ended up resolving itself.",
                  "score": 1,
                  "created_utc": 1738894031.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbg5te1",
              "author": "pvdp90",
              "body": "Yes but 5gb is not enough even for core data. 15gb would let the platform have a lot more breathing room for core data and still be low enough that most people will still be pushed to subscribe",
              "score": 1,
              "created_utc": 1738917547.0,
              "replies": []
            },
            {
              "id": "mbf1p9o",
              "author": "darti_me",
              "body": "ICloud backing up ALL app data by default is such a trashy move. You have to navigate a lot hidden menus just to pare the backups to bare essentials.",
              "score": 0,
              "created_utc": 1738898721.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbbkepg",
          "author": "Mbanicek64",
          "body": "Yeah-- thats more the issue.",
          "score": 27,
          "created_utc": 1738861302.0,
          "replies": [
            {
              "id": "mbbu65t",
              "author": "CountOff",
              "body": "You mean the business model 😂",
              "score": 27,
              "created_utc": 1738863999.0,
              "replies": [
                {
                  "id": "mbbz8qq",
                  "author": "Zappiticas",
                  "body": "Exactly! The data amount is low so people will pay for more",
                  "score": 5,
                  "created_utc": 1738865387.0,
                  "replies": []
                },
                {
                  "id": "mbdwuow",
                  "author": "covertspeaker",
                  "body": "The iCloud subscription is simply the subscription price of being deep in the apple ecosystem. Google has the same product (cloud storage) at a lower price.",
                  "score": 6,
                  "created_utc": 1738885060.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mbcxf5u",
          "author": "ahornyboto",
          "body": "Yeah too small, it offer a smaller paid plan, the current lowest cloud plan is huge I’m not even using a quarter of it",
          "score": 5,
          "created_utc": 1738874816.0,
          "replies": []
        },
        {
          "id": "mbc18pw",
          "author": "Portatort",
          "body": "Without it basic sync of things like calendar, reminders and contacts wouldn’t work. \n\nThe free 5gb should stay",
          "score": 4,
          "created_utc": 1738865955.0,
          "replies": [
            {
              "id": "mbc2o6y",
              "author": "panthereal",
              "body": "Pretty sure they're implying that 5GB is too little",
              "score": 38,
              "created_utc": 1738866347.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbefhe4",
          "author": "trainbrain27",
          "body": "They need to make it feasible to transfer data over USB.\n\nEven using Apple brand cables, it's almost impossible to transfer and access voice memos or large amounts of photos.",
          "score": 2,
          "created_utc": 1738891147.0,
          "replies": [
            {
              "id": "mdr2w97",
              "author": "drc84",
              "body": "It’s so annoying. But it’s easier to transfer your pictures as .HEIC files.",
              "score": 2,
              "created_utc": 1740027101.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbftvpv",
          "author": "QuevedoDeMalVino",
          "body": "The lock on iCloud needs to go. I would very much like to use my own server for everything iCloud.",
          "score": 1,
          "created_utc": 1738910607.0,
          "replies": []
        },
        {
          "id": "mbko84e",
          "author": "Fishtoart",
          "body": "About 10 years ago",
          "score": 1,
          "created_utc": 1738973510.0,
          "replies": []
        },
        {
          "id": "mbby4kw",
          "author": "duderguy91",
          "body": "That’s pretty in line with free tier cloud storage solutions.",
          "score": -6,
          "created_utc": 1738865078.0,
          "replies": [
            {
              "id": "mbc2ah8",
              "author": "panthereal",
              "body": "Google has offered 15GB for free while letting you use multiple accounts for another 15GB.  Plenty of android phone providers bump that up to 100GB just for buying their phone which costs half the price of an iPhone",
              "score": 12,
              "created_utc": 1738866243.0,
              "replies": [
                {
                  "id": "mbczzto",
                  "author": "CroVlado",
                  "body": "I’m not defending Apple as I think they’re greedy and the os has sucked hard lately, but it’s a different business model. Google gives you a bit more space but also collects all of your information and sells it to advertisers based on your emails and uploads to their computers. They make a lot more money on the advertising portion selling your information than they care about a dollar or two from you per month.",
                  "score": 5,
                  "created_utc": 1738875512.0,
                  "replies": []
                },
                {
                  "id": "mbcy7sv",
                  "author": "duderguy91",
                  "body": "Huh that’s new, didn’t have that option when I was using android.  I was comparing to services like Dropbox, OneDrive, etc which are still around 10GB.",
                  "score": 2,
                  "created_utc": 1738875030.0,
                  "replies": [
                    {
                      "id": "mbcz3fh",
                      "author": "panthereal",
                      "body": "Those are all purely free services not locked behind a several hundred to $1000+ purchase either.\n\niPhone by default is trying to store more data than it offers you as a backup.  5GB is a joke considering you're paying potentially $1000+ for the device which accesses it",
                      "score": 3,
                      "created_utc": 1738875268.0,
                      "replies": [
                        {
                          "id": "mbd0i6h",
                          "author": "duderguy91",
                          "body": "iCloud doesn’t require an Apple device to use.  It is extremely well integrated into Apple devices, but not required.",
                          "score": 2,
                          "created_utc": 1738875651.0,
                          "replies": []
                        },
                        {
                          "id": "mbdl4kf",
                          "author": "chesser45",
                          "body": "Data storage costs money. If they raise the cost to encapsulate the potential customers customers to want more storage into the cost of the device we will complain. Literally no win scenario.",
                          "score": 2,
                          "created_utc": 1738881428.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mblwl21",
              "author": "yar2000",
              "body": "My free Steam account has almost 4x the Cloud storage space. This is just cheap as fuck - nothing more, nothing less.",
              "score": 1,
              "created_utc": 1738989207.0,
              "replies": [
                {
                  "id": "mblx3pr",
                  "author": "duderguy91",
                  "body": "That’s not a very apples to apples comparison.  Steam cloud is only for a very narrow range of storage.  Iirc game saves and game screenshots.  iCloud is a full featured cloud storage that can be used for any file type and accessed from any device.",
                  "score": 1,
                  "created_utc": 1738989424.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mbf3q7q",
          "author": "Ingrownpimple",
          "body": "5gb is criminal scam",
          "score": -1,
          "created_utc": 1738899441.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbbg2qr",
      "author": "chrisdh79",
      "body": "Feels like last year we were complaining about 64gb being the base. I’m getting old!",
      "score": 788,
      "created_utc": 1738860124.0,
      "replies": [
        {
          "id": "mbbh000",
          "author": "AdministrativeRiot",
          "body": "Old heads remember when we complained about 16gb!",
          "score": 409,
          "created_utc": 1738860376.0,
          "replies": [
            {
              "id": "mbbhga9",
              "author": "scruffles87",
              "body": "And 128GB was the max that felt like overkill",
              "score": 186,
              "created_utc": 1738860500.0,
              "replies": [
                {
                  "id": "mbbsb70",
                  "author": "noeagle77",
                  "body": "I remember I used to think that I would never fill a 128gb phone. I still do, but I used to too.",
                  "score": 90,
                  "created_utc": 1738863493.0,
                  "replies": [
                    {
                      "id": "mbbxnvi",
                      "author": "Crowbar_Faith",
                      "body": "RIP Mitch",
                      "score": 18,
                      "created_utc": 1738864950.0,
                      "replies": []
                    },
                    {
                      "id": "mbh413d",
                      "author": "sebastiansmit",
                      "body": "Is it an iPhone thing? Have had two phones with 128gb, haven't had to delete anything yet. Both were used for 2+ years.",
                      "score": 1,
                      "created_utc": 1738935190.0,
                      "replies": []
                    },
                    {
                      "id": "mbmwfiv",
                      "author": "jonnablaze",
                      "body": "I’m at 75GB after 2 years, so 128GB is fine.",
                      "score": 1,
                      "created_utc": 1739008314.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbbrzhc",
                  "author": "shidekigonomo",
                  "body": "The 1 gb on my iPod Shuffle will do just fine, thank you.",
                  "score": 24,
                  "created_utc": 1738863404.0,
                  "replies": [
                    {
                      "id": "mbbtato",
                      "author": "scruffles87",
                      "body": "I mean, that's a thousand songs right there, why would you ever need more?",
                      "score": 12,
                      "created_utc": 1738863763.0,
                      "replies": [
                        {
                          "id": "mbbv0ct",
                          "author": "Sam-Lowry27B-6",
                          "body": "There are less than a thousand good songs and the last good one was 20 years ago. Get off my lawn.",
                          "score": 17,
                          "created_utc": 1738864227.0,
                          "replies": [
                            {
                              "id": "mbc75yd",
                              "author": "Kylael",
                              "body": "Foo Fighters - the best of you ?",
                              "score": 1,
                              "created_utc": 1738867581.0,
                              "replies": [
                                {
                                  "id": "mbf6fm7",
                                  "author": "sabershirou",
                                  "body": "Yes but THE BEST THE BEST THE BEST version.",
                                  "score": 2,
                                  "created_utc": 1738900388.0,
                                  "replies": [
                                    {
                                      "id": "mbh1087",
                                      "author": "kevlarus80",
                                      "body": "[Indeed.](https://www.youtube.com/watch?v=5vRlJrkxsqo)",
                                      "score": 1,
                                      "created_utc": 1738934076.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mbce2s5",
                  "author": "kretinozavr",
                  "body": "Still feels like. Just checked, used 62gigs out of 128",
                  "score": 6,
                  "created_utc": 1738869476.0,
                  "replies": [
                    {
                      "id": "mbi9zi4",
                      "author": "UnratedRamblings",
                      "body": "I’ve got 48gb used out of 128gb.  Maybe people should curate their apps and content a bit better?",
                      "score": 1,
                      "created_utc": 1738948066.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbc0482",
                  "author": "NecessarySudden",
                  "body": "1Tb is new 128 gb",
                  "score": 2,
                  "created_utc": 1738865628.0,
                  "replies": []
                },
                {
                  "id": "mbbipxf",
                  "author": "sumsimpleracer",
                  "body": "Bill Gates thought 640K was all anyone would ever need.",
                  "score": 4,
                  "created_utc": 1738860844.0,
                  "replies": [
                    {
                      "id": "mbbkiva",
                      "author": "karatekid430",
                      "body": "That was RAM but yes same point",
                      "score": 23,
                      "created_utc": 1738861335.0,
                      "replies": [
                        {
                          "id": "mbbkmnh",
                          "author": "sumsimpleracer",
                          "body": "Ah woof. Thanks for the correction",
                          "score": 4,
                          "created_utc": 1738861364.0,
                          "replies": []
                        },
                        {
                          "id": "mbbnjrf",
                          "author": "fixminer",
                          "body": "There is also simply [no evidence](https://www.computerworld.com/article/1563853/the-640k-quote-won-t-go-away-but-did-gates-really-say-it.html) that he ever said that.",
                          "score": 7,
                          "created_utc": 1738862177.0,
                          "replies": [
                            {
                              "id": "mbbo6no",
                              "author": "karatekid430",
                              "body": "Regardless whether accurate or not, the quote was about RAM and not disk, so you’re missing the point clarifying this to me when I am only clearing up something different.",
                              "score": 2,
                              "created_utc": 1738862353.0,
                              "replies": []
                            },
                            {
                              "id": "mbbrpk7",
                              "author": "kamilo87",
                              "body": "But an Apple VP did say that 8GB on MacOS was like 16GB on Windows. At least that clown was mocked a lot and then Apple implemented 16GB of ram as base level. We need 256GB for iOS and 512GB for Macs as base config.",
                              "score": -1,
                              "created_utc": 1738863327.0,
                              "replies": [
                                {
                                  "id": "mbbuvph",
                                  "author": "sithelephant",
                                  "body": "Ramdoubler. /s",
                                  "score": 5,
                                  "created_utc": 1738864192.0,
                                  "replies": [
                                    {
                                      "id": "mbc0ed7",
                                      "author": "deadzol",
                                      "body": " But memory is suppose to be less than storage. Assuming the person that can recall ramdoubler can understand my point.",
                                      "score": 1,
                                      "created_utc": 1738865707.0,
                                      "replies": [
                                        {
                                          "id": "mbc11qz",
                                          "author": "sithelephant",
                                          "body": "It amuses me that my cheapish new gaming device has eight million times the RAM of my first computer.",
                                          "score": 3,
                                          "created_utc": 1738865908.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "mbcepe6",
                                      "author": "technobrendo",
                                      "body": "doubleram.js. Click that and download, it's safe i swear!!",
                                      "score": 1,
                                      "created_utc": 1738869650.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "mbcefji",
                                  "author": "mschuster91",
                                  "body": "For what it's worth he isn't incorrect. Apple's SSD chips are so blazing fast that, unlike the x86 world, they can actually serve as swap without the user noticing too much.",
                                  "score": -1,
                                  "created_utc": 1738869574.0,
                                  "replies": [
                                    {
                                      "id": "mbdf8k8",
                                      "author": "FireLucid",
                                      "body": "Are apples one somehow different to the SSD's available from other manufactures or is the x86 proc somehow slowing it down?",
                                      "score": 3,
                                      "created_utc": 1738879713.0,
                                      "replies": [
                                        {
                                          "id": "mbf2jem",
                                          "author": "kamilo87",
                                          "body": "The nand chips aren’t even the fastest available. Apple is ripping us all with the storage configs.",
                                          "score": 1,
                                          "created_utc": 1738899018.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mbcb6lh",
                  "author": "We_Are_Nerdish",
                  "body": "To be fair, I have managed just fine on my 8Plus since release to my 15ProMax upgrade.  \nHaving so much more storage now is actually overkill for the couple of images I end up keeping. I clean video's and photos out once every 2-3 months..",
                  "score": 1,
                  "created_utc": 1738868681.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbbsr9l",
              "author": "Juub1990",
              "body": "Old heads remember 8GB.",
              "score": 31,
              "created_utc": 1738863615.0,
              "replies": [
                {
                  "id": "mbcssyn",
                  "author": "flcinusa",
                  "body": "My OG aluminum one was only 8gb, it was also available in 4gb, glad I still had my iPod (with video) that was 60gb",
                  "score": 7,
                  "created_utc": 1738873554.0,
                  "replies": [
                    {
                      "id": "mbcvhlh",
                      "author": "shit_dicks",
                      "body": "Remember when we used to carry an HHD in our pockets? Insane to think about now. They had pretty good drop protection, but there was still the possibility of losing everything if you dropped it while the disc was spinning.",
                      "score": 5,
                      "created_utc": 1738874292.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbdc4ch",
                  "author": "Two_Shekels",
                  "body": "Often wonder how we were able to get away with only 8 gigs using more or less the same YT/Email/Insta/FB etc apps then as today.",
                  "score": 1,
                  "created_utc": 1738878836.0,
                  "replies": []
                },
                {
                  "id": "mbe25du",
                  "author": "jimbobdonut",
                  "body": "The first iPhone had base storage of 4 GB! It was pretty rare, but it happened.",
                  "score": 1,
                  "created_utc": 1738886791.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbbnjvl",
              "author": "DevilsWelshAdvocate",
              "body": "I didn’t even complain on my 8gb but yeah!",
              "score": 9,
              "created_utc": 1738862178.0,
              "replies": []
            },
            {
              "id": "mbbn4ai",
              "author": "N0x1mus",
              "body": "Yep, and these days iOS and System Data take up 20GB minimum.",
              "score": 8,
              "created_utc": 1738862057.0,
              "replies": []
            },
            {
              "id": "mbclssg",
              "author": "droneb",
              "body": "Dang I must be ancient for thinking on my PDA 32MB flash card",
              "score": 4,
              "created_utc": 1738871617.0,
              "replies": []
            },
            {
              "id": "mbbrn0f",
              "author": "chrisdh79",
              "body": "Back in the day Zip drives were cool!",
              "score": 4,
              "created_utc": 1738863307.0,
              "replies": []
            },
            {
              "id": "mbbsylr",
              "author": "narwhal_breeder",
              "body": "My 2GB ipod nano felt like infinite storage at the time.",
              "score": 2,
              "created_utc": 1738863671.0,
              "replies": []
            },
            {
              "id": "mbbuots",
              "author": "MartianMH_",
              "body": "Old heads remember when you had to put an SD card into your phone to even be able to take pictures (not iPhone though)",
              "score": 1,
              "created_utc": 1738864139.0,
              "replies": []
            },
            {
              "id": "mbbv8nk",
              "author": "RedAtomic",
              "body": "My first iPhone was the 8GB iPhone 4.",
              "score": 1,
              "created_utc": 1738864290.0,
              "replies": []
            },
            {
              "id": "mbbvm6f",
              "author": "trumpsucks12354",
              "body": "My 16gb iPhone 6s was a beast until i made the mistake of updating it to the latest iOS update. Now i get less than 8gb of storage",
              "score": 1,
              "created_utc": 1738864392.0,
              "replies": []
            },
            {
              "id": "mbcg2ub",
              "author": "Dracekidjr",
              "body": "Shit y'all don't remember the iPhone 3gs and 4 having 8gb models.",
              "score": 1,
              "created_utc": 1738870030.0,
              "replies": []
            },
            {
              "id": "mbcrnvn",
              "author": "Hypernatremia",
              "body": "I think my iPhone 6 was 8GB",
              "score": 1,
              "created_utc": 1738873238.0,
              "replies": []
            },
            {
              "id": "mbd3gmq",
              "author": "RebornPastafarian",
              "body": "Remember when Zune showed them up and they had to shunt all of the 8GB iPods to \"less wealthy\" countries?",
              "score": 1,
              "created_utc": 1738876461.0,
              "replies": []
            },
            {
              "id": "mbd791d",
              "author": "Logseman",
              "body": "16 GB was clearly insufficient in 2014 for the iPhone 6.",
              "score": 1,
              "created_utc": 1738877499.0,
              "replies": []
            },
            {
              "id": "mbgdq3o",
              "author": "kenq1",
              "body": "Fuck that I remember the 8gb iphones being the base model and now people are complaining about having 16x that amount smh",
              "score": 1,
              "created_utc": 1738922510.0,
              "replies": []
            },
            {
              "id": "mbjn093",
              "author": "gorkish",
              "body": "16GB was the top end capacity of the original iPhone. Base was 4GB",
              "score": 1,
              "created_utc": 1738962067.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbbhgzv",
          "author": "Doyouwantaspoon",
          "body": "I’ve had my iPhone 12 Pro Max since release day, and I still have over 49GB out of 128 available.\n\nFor the average user this is plenty of space, as long as you manage your photos.\n\nMy wife will take 30 pictures of the same thing, but then not pick out her favorite and delete all the rest. Hers is constantly full.",
          "score": 56,
          "created_utc": 1738860505.0,
          "replies": [
            {
              "id": "mbbi52h",
              "author": "TheBeatGoesAnanas",
              "body": "Just looked at the storage breakdown on my 15 Pro. If I deleted the Photos app and everything in it, I'd still have 107 GB of occupied drive space.",
              "score": 14,
              "created_utc": 1738860686.0,
              "replies": [
                {
                  "id": "mbbno27",
                  "author": "Redeem123",
                  "body": "With what? That’s certainly not typical. ",
                  "score": 11,
                  "created_utc": 1738862211.0,
                  "replies": [
                    {
                      "id": "mbbrm6v",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 5,
                      "created_utc": 1738863301.0,
                      "replies": [
                        {
                          "id": "mbbsamc",
                          "author": "brienneoftarthshreds",
                          "body": "They're not saying they have 107 free, they're saying that they would still be using 107gb",
                          "score": 8,
                          "created_utc": 1738863488.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mbbtvup",
                      "author": "TheBeatGoesAnanas",
                      "body": "iOS itself takes up 11.5GB; system data another GB and change. Photo and video attachments in the Messages app (ie videos others have sent to me I haven't saved to the camera roll) are 14GB. After Photos, there are 16 apps on my phone using >1GB, totaling a little over 40GB. Then another 100+ apps that take up 100MB-1GB each.\n\nI don't think I'm a particularly atypical iPhone user.",
                      "score": 3,
                      "created_utc": 1738863922.0,
                      "replies": [
                        {
                          "id": "mbc7ikl",
                          "author": "kooldude700",
                          "body": "Should periodically clear app caches (or delete and reinstall if there's no option for caches) cause all the images and videos you view on social media start to add up... Even just browser data adds up fast.\n\n\nEdit: here's my storage breakdown for the apps above 1GB (~3 months usage). https://imgur.com/a/QlLhBml\n\nIgnore whatsapp and podcasts cause those have actual things downloaded. The rest of the apps are all just storing caches and stuff with NO actual content downloaded.",
                          "score": 3,
                          "created_utc": 1738867677.0,
                          "replies": []
                        },
                        {
                          "id": "mbce3jt",
                          "author": "iDontRagequit",
                          "body": "I sure hope having 100+ apps is not typical\n\nthats dystopian as hell",
                          "score": 2,
                          "created_utc": 1738869482.0,
                          "replies": [
                            {
                              "id": "mbdim5k",
                              "author": "Habib455",
                              "body": "People getting mowed down by drones is dystopian, having a bunch of apps is not.",
                              "score": 7,
                              "created_utc": 1738880688.0,
                              "replies": []
                            },
                            {
                              "id": "mbd21ea",
                              "author": "TheBeatGoesAnanas",
                              "body": "What about having a bunch of apps is dystopian? I use most of them often enough to not bother uninstalling.",
                              "score": 7,
                              "created_utc": 1738876070.0,
                              "replies": []
                            },
                            {
                              "id": "mbcnawe",
                              "author": "Mammoth_Rain3248",
                              "body": "Dystopian? I have a terabyte and it lives 50-75% full. Games, pics, different apps and loads of documents I might need ",
                              "score": 3,
                              "created_utc": 1738872028.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mbbt3ka",
                  "author": "Doyouwantaspoon",
                  "body": "If you have a lot of games it could be that.",
                  "score": 2,
                  "created_utc": 1738863708.0,
                  "replies": [
                    {
                      "id": "mbbwbh4",
                      "author": "TheBeatGoesAnanas",
                      "body": "14 games, only one of which takes up more than 1 gig.",
                      "score": 1,
                      "created_utc": 1738864584.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbgo5rr",
              "author": "Henry5321",
              "body": "You should try the 16 pro. Each \"picture\" is like 30MiB. 30 pictures would be about a gigabyte. I realized they enabled some new \"live\" picture by default. Saves about a second on video along with your photo.",
              "score": 2,
              "created_utc": 1738928450.0,
              "replies": [
                {
                  "id": "mbiefn0",
                  "author": "Doyouwantaspoon",
                  "body": "Yikes. I just checked and my pics seem to be 2 - 3mb. That actually might make me consider getting a higher storage option when I next upgrade.",
                  "score": 1,
                  "created_utc": 1738949320.0,
                  "replies": [
                    {
                      "id": "mbp3pih",
                      "author": "Henry5321",
                      "body": "You can disable the option, it just defaulted on in my case. The normal pictures are still around 3MiB",
                      "score": 1,
                      "created_utc": 1739038380.0,
                      "replies": [
                        {
                          "id": "mbqi8ul",
                          "author": "Doyouwantaspoon",
                          "body": "Live Photos are 2-3mb. Portrait mode still photos are only like 1.2.",
                          "score": 1,
                          "created_utc": 1739053228.0,
                          "replies": [
                            {
                              "id": "mbukmc2",
                              "author": "Henry5321",
                              "body": "You are correct about the default. I am not sure what was up with the photos I took. I downloaded some other photos and they were all 6.5MiB (3MiB still plus 3.5MiB video).\n\nBut a few photos I needed to upload where 30MiB per. I have no idea why those live photos were so large. I was just taking stills. But I deleted them since I didn't need them anymore.\n\nMaybe I had a different quality setting?",
                              "score": 1,
                              "created_utc": 1739114962.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbbkowe",
              "author": "karatekid430",
              "body": "You don’t even have to manage them, they go to the cloud and I think it deletes them locally if it needs space",
              "score": 3,
              "created_utc": 1738861381.0,
              "replies": []
            },
            {
              "id": "mbdjgix",
              "author": "PM_YOUR_BOOBS_PLS_",
              "body": "Genshin Impact alone is over 30 GB.  2 minutes of 4K 60 FPS video is 1 GB.  Modern media adds up *fast*.  128 GB of storage is *not* enough.  You not storing much media on your phone doesn't change that.",
              "score": 2,
              "created_utc": 1738880932.0,
              "replies": [
                {
                  "id": "mbdqt0h",
                  "author": "Doyouwantaspoon",
                  "body": "I store ALL of my media on my phone. I don’t even own a computer. I just don’t record hours of video.",
                  "score": 1,
                  "created_utc": 1738883139.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbbpuhu",
              "author": "chrisdh79",
              "body": "My wife with you?",
              "score": 1,
              "created_utc": 1738862811.0,
              "replies": [
                {
                  "id": "mbbz074",
                  "author": "OneSkepticalOwl",
                  "body": "Yeah, but she can’t talk right now",
                  "score": 2,
                  "created_utc": 1738865321.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbhl1ux",
              "author": "DyZ814",
              "body": "I have always had the base storage on iPhones. Literally every iPhone that has existed where you could get different levels of storage on device, I've always gotten the lowest. \n\nI have never once had a problem with storage size lol. 8GB, 16GB, etc.",
              "score": 1,
              "created_utc": 1738940883.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbbk6mf",
          "author": "Ahindre",
          "body": "I just upgraded from a iPhone 8 with 64GB!  I don't know what to do with double the space.",
          "score": 6,
          "created_utc": 1738861239.0,
          "replies": []
        },
        {
          "id": "mbcq25c",
          "author": "vincentofearth",
          "body": "I’m literally reading this post on a 128GB iPhone. I have more than 70GB of free storage and I doubt I’ll be using that up anytime soon. As someone who takes very few photos, 128GB is fine for me. Now if Apple were to offer more storage for the same price, I won’t be complaining…",
          "score": 5,
          "created_utc": 1738872792.0,
          "replies": []
        },
        {
          "id": "mbcgyzo",
          "author": "thisischemistry",
          "body": "> Fast forward to 2025, and Apple offers 128GB as the base storage tier for most iPhone 16 models. That might sound like a lot by comparison, but it's becoming genuinely problematic for users caught in an ***increasingly aggressive AI*** storage squeeze.\n\nFound the problem!",
          "score": 5,
          "created_utc": 1738870276.0,
          "replies": [
            {
              "id": "mbhcivn",
              "author": "jkbike",
              "body": "Ah yes, the good old solution in search of a problem is usually a problem itself.",
              "score": 2,
              "created_utc": 1738938144.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbds19f",
          "author": "spreadthaseed",
          "body": "My gen 1 had 4GB ☠️",
          "score": 4,
          "created_utc": 1738883525.0,
          "replies": []
        },
        {
          "id": "mbbr442",
          "author": "fearrange",
          "body": "Yah, and Apple used to make 64GB as base and upselling 256GB as the next tier, skipping 128GB which would be enough for many. A real dick move.\n\nStill doing it for iCloud storage, $2.99/mo 200GB not quite enough? The next jump is $9.99/mo for  2TB.",
          "score": 3,
          "created_utc": 1738863160.0,
          "replies": []
        },
        {
          "id": "mbbhqkd",
          "author": "DigitallyDetained",
          "body": "My phone is 64gb and I’ve yet to fill it. Helps that I have a bit of extra iCloud storage for photos, but still…",
          "score": 4,
          "created_utc": 1738860577.0,
          "replies": []
        },
        {
          "id": "mbcgygz",
          "author": "ThatGamerMoshpit",
          "body": "Yup this is just rage/clickbait. 128gb is reasonable at this point. \n\nThe bigger issue is system ram.",
          "score": 6,
          "created_utc": 1738870273.0,
          "replies": []
        },
        {
          "id": "mbc7wjb",
          "author": "Babys_For_Breakfast",
          "body": "64GB is ridiculous though and it was just a few years back. My iPod in freakin ‘06 had 80GB and that was the lowest storage option. Pure greed.",
          "score": 2,
          "created_utc": 1738867783.0,
          "replies": []
        },
        {
          "id": "mbdyqz3",
          "author": "Vietzomb",
          "body": "Seriously, I’m approaching 40, heavy into media, and yet… I haven’t run out of space on my phone since we were at 32GB. And even then, it was just full of a bunch of bullshit, apps, and music I had in other places (streaming wasn’t really a thing yet). Aside from the pictures and contacts there was nothing to worry about transferring.\n\nMy best guess is there are lots of people running only 1-2 devices and it’s likely the 2nd device is just a larger version of their phone (so a tablet).\n\nBecause in my mind, if you have a computer (and/or hard drives/SSDs), this is total non-issue. A phone to me is like a temporary capture/storage device, of course in addition to being a phone. It’s great to have when capturing things on the go when you aren’t running any other equipment that day (if you even do to begin with). If I really want that top quality lossless audio downloaded, I’m obviously incapable of taking my whole library with me, but can certainly grab a ton. And even that matters a lot less when apps can auto-rotate tracks/albums in and out of local storage to keep stuff fresh or current. And the rest is… apps??\n\nBecause if it really is, exclusively, people’s documented cherished memories through photo/video that is filling their phones… anyone who knows anything about data management, knows it should never be stored in only one place anyways (phone + cloud alone isn’t sufficient either). \n\nSo then if the issue is just “needing” access to every photo you’ve ever taken while refusing to use the cloud for those small use-cases when you wanna pull up what you don’t have stored locally… like, you are just being difficult on yourself at that point. Like your stubbornness to move it off and have proper backups is sort of the problem.\n\nBut hey, maybe that’s just me.",
          "score": 1,
          "created_utc": 1738885679.0,
          "replies": []
        },
        {
          "id": "mbetyg3",
          "author": "SKK329",
          "body": "Yeahhh I struggle filling up 60gb on a phone.",
          "score": 1,
          "created_utc": 1738896046.0,
          "replies": []
        },
        {
          "id": "mbf0vj0",
          "author": "None",
          "body": "When Gmail debuted with 1 GB of storage their pitch was \"Never delete another email!\" Yeah, I'm old, but you can't tell people your email addy is just your name at gmail.com either.",
          "score": 1,
          "created_utc": 1738898432.0,
          "replies": []
        },
        {
          "id": "mbfd83w",
          "author": "sexytimesthrwy",
          "body": "640 kB should be enough for anyone.",
          "score": 1,
          "created_utc": 1738902992.0,
          "replies": []
        },
        {
          "id": "mbgdony",
          "author": "kenq1",
          "body": "Fuck that I remember the 8gb iphones being the base model and now people are complaining about having 16x that amount smh",
          "score": 1,
          "created_utc": 1738922486.0,
          "replies": []
        },
        {
          "id": "mbqz5db",
          "author": "TurboPikachu",
          "body": "I remember when me & my sis got our first iPhones, both 5Cs. She paid $300 for an 8GB and I paid $450 for a 16GB. She bragged about how much less she spent, but 1 year later she had to juggle deleting/installing apps weekly while I never had to even once.\n\nI think base is fine nowadays tho. I’ve had my XR for 5 years now and I just haven’t quite maxed out its 64GB.",
          "score": 1,
          "created_utc": 1739058725.0,
          "replies": []
        },
        {
          "id": "mbccnxp",
          "author": "pattymcfly",
          "body": "The issue is the photos can be like 30-40mb each depending on your configuration. That eats up storage very quickly.",
          "score": 0,
          "created_utc": 1738869090.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbbh144",
      "author": "Bennehftw",
      "body": "I think the bigger problem is that they give you “free” cloud storage, but it’s too small to even do one backup. You need to pay to do a backup.",
      "score": 440,
      "created_utc": 1738860385.0,
      "replies": [
        {
          "id": "mbbr51u",
          "author": "peppruss",
          "body": "I enjoyed backing up my phone to my computer over USB when it was still a thing with iTunes. Is that still possible with Apple Music?",
          "score": 72,
          "created_utc": 1738863167.0,
          "replies": [
            {
              "id": "mbbremh",
              "author": "itstheskylion",
              "body": "Yeah it’s still doable directly via finder on macOS and via iTunes on windows",
              "score": 67,
              "created_utc": 1738863242.0,
              "replies": [
                {
                  "id": "mbdjqf0",
                  "author": "dlist925",
                  "body": "Actually there’s a new Apple Devices app on Windows that replaces the backup/sync functions of iTunes.",
                  "score": 14,
                  "created_utc": 1738881011.0,
                  "replies": [
                    {
                      "id": "mbfjscl",
                      "author": "muad_dibs",
                      "body": "What is it called? I’m still using iTunes.",
                      "score": 3,
                      "created_utc": 1738905739.0,
                      "replies": [
                        {
                          "id": "mbfzejb",
                          "author": "dbanary12",
                          "body": "Apple Devices",
                          "score": 9,
                          "created_utc": 1738913694.0,
                          "replies": [
                            {
                              "id": "mbhdohr",
                              "author": "muad_dibs",
                              "body": "Oh wow, I thought they were saying “Apple Devices” as a generalization but that’s indeed the name. Thank you.",
                              "score": 3,
                              "created_utc": 1738938526.0,
                              "replies": [
                                {
                                  "id": "mbi6wen",
                                  "author": "StopAndReallyThink",
                                  "body": "Cool, what is it called?",
                                  "score": 1,
                                  "created_utc": 1738947189.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mbbrta4",
                  "author": "sloanemonroe",
                  "body": "I need to start doing this then. I hate making them richer.",
                  "score": 17,
                  "created_utc": 1738863356.0,
                  "replies": [
                    {
                      "id": "mbdxh15",
                      "author": "pm_me_your_taintt",
                      "body": "I just stopped using apple products when the basic backup wasn't enough space 🤷‍♀️",
                      "score": 2,
                      "created_utc": 1738885261.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbfqww2",
              "author": "watchme3",
              "body": "you should be able to set up automatic backups to storage on your pc over wifi",
              "score": 1,
              "created_utc": 1738909060.0,
              "replies": []
            },
            {
              "id": "mbgeuu9",
              "author": "IrregularRedditor",
              "body": "Yes, and now you can do it over wireless.",
              "score": 1,
              "created_utc": 1738923192.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbbtck4",
          "author": "Newtons2ndLaw",
          "body": "Biggest myth is that a company gives you free anything.",
          "score": 25,
          "created_utc": 1738863777.0,
          "replies": [
            {
              "id": "mbdk7lt",
              "author": "XBA40",
              "body": "What about the free samples at Costco?",
              "score": 6,
              "created_utc": 1738881153.0,
              "replies": [
                {
                  "id": "mbdq83j",
                  "author": "Chewbacca22",
                  "body": "You’ve already paid the membership to get in",
                  "score": 16,
                  "created_utc": 1738882959.0,
                  "replies": [
                    {
                      "id": "mbdqnd8",
                      "author": "XBA40",
                      "body": "Yeah, I was just kidding.",
                      "score": 3,
                      "created_utc": 1738883090.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mbc0d4l",
          "author": "MickeyMoore",
          "body": "If you don’t include media it’s plenty, used it for years to back up contacts, notes, and messages.",
          "score": 10,
          "created_utc": 1738865696.0,
          "replies": []
        },
        {
          "id": "mbbhieb",
          "author": "None",
          "body": "That’s my biggest issue",
          "score": 28,
          "created_utc": 1738860516.0,
          "replies": [
            {
              "id": "mbbn6cm",
              "author": "akumarisu",
              "body": "Every month I get a notification for $.99 charge for additional cloud storage and it ruins my day",
              "score": 25,
              "created_utc": 1738862073.0,
              "replies": [
                {
                  "id": "mbcjh0i",
                  "author": "ThunderChaser",
                  "body": "Me the first of every month seeing Apple take a dollar for 50 GB of iCloud :(",
                  "score": 1,
                  "created_utc": 1738870973.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbbk657",
              "author": "ZorseVideos",
              "body": "Thats the scam.",
              "score": 42,
              "created_utc": 1738861236.0,
              "replies": [
                {
                  "id": "mbbt04r",
                  "author": "SkollFenrirson",
                  "body": ">Thats the ~~scam~~ *Innovation™*.",
                  "score": 7,
                  "created_utc": 1738863682.0,
                  "replies": [
                    {
                      "id": "mbcltol",
                      "author": "AlexandersWonder",
                      "body": "You can still back up your phone manually to your computer. Doesn’t cost anything. You’re paying for convenience.",
                      "score": 3,
                      "created_utc": 1738871623.0,
                      "replies": [
                        {
                          "id": "mbct5ea",
                          "author": "SkollFenrirson",
                          "body": "Thanks, Tim",
                          "score": -4,
                          "created_utc": 1738873650.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mbbzpz1",
          "author": "None",
          "body": "That’s the point",
          "score": 3,
          "created_utc": 1738865519.0,
          "replies": []
        },
        {
          "id": "mbdhyrw",
          "author": "cape2cape",
          "body": "Could just do a backup to your computer.",
          "score": 3,
          "created_utc": 1738880500.0,
          "replies": []
        },
        {
          "id": "mbd5j0v",
          "author": "Ben_SRQ",
          "body": "That feeds into it, but *the worst* part is that there is always a badge on \"settings\" because you haven't backed up, but you can't without paying for it. And since you can't backup, you can't get rid of the badge.",
          "score": 4,
          "created_utc": 1738877025.0,
          "replies": []
        },
        {
          "id": "mbe2cwc",
          "author": "Psychobillycadillac1",
          "body": "there is an option for a one time 30 day free back up in general settings under transfer and reset. that being said - cloud subscription service is bullshit. I’m supposed to pay monthly for the security of my data until I fucking die?",
          "score": 2,
          "created_utc": 1738886858.0,
          "replies": []
        },
        {
          "id": "mbe2t7b",
          "author": "pwnersaurus",
          "body": "tbh doesn’t seem *that* unreasonable to charge for cloud backups? Nobody gives you that much cloud storage for free. The problem is that I do already have sufficient cloud storage in M365 but can’t use it for the iPhone backup",
          "score": 2,
          "created_utc": 1738887004.0,
          "replies": []
        },
        {
          "id": "mbc1me3",
          "author": "Portatort",
          "body": "> You need to pay to do a backup?\n\nWhy wouldn’t you?\n\nWhy would you expect it to be backed up for free?\n\nSomeone with a 2tb iPad should be able to do a full backup for free? Really?",
          "score": 3,
          "created_utc": 1738866058.0,
          "replies": [
            {
              "id": "mbc36ar",
              "author": "panthereal",
              "body": "5GB is 1/400th of 2TB\n\nlike come on bro chill out\n\nthey would get a long way just by offering 1/2 of the minimum storage size they offer for phones.",
              "score": 1,
              "created_utc": 1738866483.0,
              "replies": [
                {
                  "id": "mbdgf18",
                  "author": "like25njas",
                  "body": "Pay for it or back up to your computer like you used to do. Switch companies if you really can’t live with that reality.\n\nTLDR: grow up",
                  "score": 7,
                  "created_utc": 1738880052.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mbdvu07",
          "author": "knucklehead_89",
          "body": "I recently found out that they give you unlimited cloud storage temporarily to do device upgrades.",
          "score": 1,
          "created_utc": 1738884728.0,
          "replies": []
        },
        {
          "id": "mbfay97",
          "author": "ManicuredPleasure2",
          "body": "You can do a backup to your computer.",
          "score": 1,
          "created_utc": 1738902089.0,
          "replies": []
        },
        {
          "id": "mbfte0z",
          "author": "None",
          "body": "It’s not a problem for them. It’s by design",
          "score": 1,
          "created_utc": 1738910342.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbbod04",
      "author": "nissanfan64",
      "body": "I had to double check what I actually have (128gb) and I’m still good on this size. If I actually deleted some of the random 11k photos I have I’d be in a lot better of a spot. \n\nI’ll probably replace this with another 128gb when I need a new phone.",
      "score": 171,
      "created_utc": 1738862402.0,
      "replies": [
        {
          "id": "mbd2txa",
          "author": "pmth",
          "body": "Yeah I don’t get the issue. I don’t even come close to filling up 128gb, and that’s with probably 100 apps I have installed that I haven’t used in a year+",
          "score": 67,
          "created_utc": 1738876288.0,
          "replies": [
            {
              "id": "mbdd1sj",
              "author": "ShittyITSpecialist",
              "body": "Usually the people filling up their phone storage have it filled with 1000's of screenshots they never look at and hour long videos filmed in the highest quality of some important event they attended like a wedding. At least this is what I have noticed. \n\nThe other thing that takes up a lot of space are text messages. Some people never delete their texts and it adds up.",
              "score": 25,
              "created_utc": 1738879097.0,
              "replies": [
                {
                  "id": "mbjonbv",
                  "author": "Wrx_me",
                  "body": "I'd say that's a good part of it. My phone photo storage is ancient with many phone changes. I've used 250gb of my 512 storage size, and not even half of that is photos.",
                  "score": 2,
                  "created_utc": 1738962545.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbdqgek",
              "author": "Randy_Muffbuster",
              "body": "Yeah. 77.2 gigs used.\n\nI stream Apple Music. I have the big iCloud storage so all my photos are there if needed. I even have the feature turned off to auto delete old texts (I actually have texts from 2012!)\n\nStill barely over half storage.\n\nIn my mind with everything being cloud based storage is fine or could be smaller.\n\nGames? Xbox Cloud gaming works surprisingly well. It’ll only get better.",
              "score": 4,
              "created_utc": 1738883030.0,
              "replies": []
            },
            {
              "id": "mbd6b33",
              "author": "Ben_SRQ",
              "body": "Same. \n\nI stream a lot, but I don't keep any media on my device, and I have a laptop if I do need to take media with me on a trip... \n\nSo 128gb is fine for me. :shrug:",
              "score": 3,
              "created_utc": 1738877239.0,
              "replies": []
            },
            {
              "id": "mbdtq6z",
              "author": "IbanezPGM",
              "body": "My 64gb isn’t even half full",
              "score": 1,
              "created_utc": 1738884057.0,
              "replies": []
            },
            {
              "id": "mbf2qmp",
              "author": "jacob6875",
              "body": "Same here.  I take a lot of 4k video also.  But it all gets uploaded to iCloud overnight.  \n\nI have around 60gigs free.",
              "score": 1,
              "created_utc": 1738899089.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbdo8fq",
          "author": "StrangeAssonance",
          "body": "I have the 256gb one and could have done 128 as I don’t even have 70gb used.",
          "score": 4,
          "created_utc": 1738882353.0,
          "replies": []
        },
        {
          "id": "mbe0giw",
          "author": "goodonekid",
          "body": "I thought this before I had a kid. You end up taking a million photos and they all seem special because they change so fast",
          "score": 6,
          "created_utc": 1738886242.0,
          "replies": []
        },
        {
          "id": "mbhb61x",
          "author": "JefferyTheQuaxly",
          "body": "yea i have a 256 GB phone and i still use only 120 GB of storage, and i have a LOT of pictures, apps and such, still years away from probly needing 256 GB.",
          "score": 1,
          "created_utc": 1738937693.0,
          "replies": []
        },
        {
          "id": "mbf3p43",
          "author": "Curse3242",
          "body": "Exactly. When will your phone ever need that much storage?\n\nJust move your old videos & photos to your PC.",
          "score": 0,
          "created_utc": 1738899430.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbc6sqd",
      "author": "ray12370",
      "body": "The shit refresh rate on a $900 phone tier needs to go.",
      "score": 60,
      "created_utc": 1738867481.0,
      "replies": [
        {
          "id": "mbgs14q",
          "author": "alexanderpete",
          "body": "Well there are lots of options for phones at that price. If you're talking about USD, you can probably buy almost any other phone for that much.",
          "score": 1,
          "created_utc": 1738930325.0,
          "replies": []
        },
        {
          "id": "mbeg544",
          "author": "thatdudedylan",
          "body": "Aren't most 120hz these days?",
          "score": 0,
          "created_utc": 1738891367.0,
          "replies": [
            {
              "id": "mbenmg6",
              "author": "ray12370",
              "body": "The non pro models are at 60. I went into the Apple store recently bc my girl was interested in one, and I was shook when I saw the refresh rate on some of those iPhone 15 models.",
              "score": 10,
              "created_utc": 1738893889.0,
              "replies": [
                {
                  "id": "mbgmd8x",
                  "author": "freeturk51",
                  "body": "Thats apples tactic of creating a fake difference between the pros and the non-pros. Without a 60Hz screen, the only difference is a telephoto camera that most wont need and a processor that was already so fast that the last gen processor of the non-pros are already running laps around most phones",
                  "score": 1,
                  "created_utc": 1738927510.0,
                  "replies": [
                    {
                      "id": "mbh4tuk",
                      "author": "JamesHeckfield",
                      "body": "No shit? Have you considered publishing these findings? I’ve never heard of a company using such arcane and obscure tactics as…. Having more features in a more expensive version of the same product?\n\nThat’s brilliant!",
                      "score": 0,
                      "created_utc": 1738935476.0,
                      "replies": [
                        {
                          "id": "mbh51iy",
                          "author": "freeturk51",
                          "body": "It isnt a finding, it is a rant. Phones half the price of the base iPhones have high refresh rate displays, the iPhones can also have them without losing much profit",
                          "score": 3,
                          "created_utc": 1738935553.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mbbxpwq",
      "author": "danleon950410",
      "body": "Yeah right, article written by the sucker that tapes the entire concert looking at it only through the screen and never watches the video ever again",
      "score": 37,
      "created_utc": 1738864965.0,
      "replies": [
        {
          "id": "mbcvd6q",
          "author": "TheHumanPrius",
          "body": "Scathing. I love it.",
          "score": 6,
          "created_utc": 1738874259.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbbor5q",
      "author": "Meme_Pope",
      "body": "I’ve never had any issue with 128GB and I take a shitload of photos. \n\nI really think the issue is that the iPhone defaults to Live Photos and most boomers never change it. They take up significantly more space. For being such a niche feature that almost nobody uses, it’s wild that Live Photos are the default. I really think this is a clever scam by Apple to get people to fill up their storage and pay for iCloud storage.",
      "score": 141,
      "created_utc": 1738862510.0,
      "replies": [
        {
          "id": "mbc03yj",
          "author": "bentleyk9",
          "body": "I'm a young millennial and I love Live Photos. My dog is a maniac and difficult to take pictures of. The algorithm does a good job at picking out the best shot, and I like I can pick a different one if I want to",
          "score": 57,
          "created_utc": 1738865626.0,
          "replies": [
            {
              "id": "mbcepyd",
              "author": "ggderp",
              "body": "I’m there with you. Also saves from having to take multiple shots to ensure everyone’s eyes are open. I have this feature on and 128gb and no issues",
              "score": 17,
              "created_utc": 1738869654.0,
              "replies": []
            },
            {
              "id": "mbefmzy",
              "author": "thatdudedylan",
              "body": "I agree with you, but it doesn't make the above point not mostly true still.",
              "score": 1,
              "created_utc": 1738891198.0,
              "replies": [
                {
                  "id": "mbei5wf",
                  "author": "0100001010010",
                  "body": "But it’s not true. Live Photos are not a niche at all. Everyone who cares about editing photos on iPhone use them.",
                  "score": 2,
                  "created_utc": 1738892035.0,
                  "replies": [
                    {
                      "id": "mbekr36",
                      "author": "thatdudedylan",
                      "body": "Fair enough. \n\nI still don't think it should be a default-on option, and I would not be surprised if it was indeed to fill one's storage up faster.",
                      "score": 0,
                      "created_utc": 1738892906.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mbcd1ks",
          "author": "slawnz",
          "body": "Same. I have had 128GB for my last two devices and I have never filled more than around 80GB even though I do not hold back with photos / videos etc.",
          "score": 6,
          "created_utc": 1738869193.0,
          "replies": []
        },
        {
          "id": "mbew1n9",
          "author": "InsaneNinja",
          "body": "They should be the default. I don’t see where this “nobody uses” thing comes in. Most people I see love reviewing the good ones, which are always unplanned.",
          "score": 0,
          "created_utc": 1738896760.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbbhs54",
      "author": "contraryrhombus",
      "body": "I have the 128GB and it’s fine. The wife has a 128GB and it’s more than fine. Admittedly though, I pay for Apple One which includes 2TB of cloud so all my photos and videos are offloaded.",
      "score": 48,
      "created_utc": 1738860589.0,
      "replies": [
        {
          "id": "mbbir8s",
          "author": "Protean_Protein",
          "body": "This option is surprisingly reasonable in price and ease of use.",
          "score": 12,
          "created_utc": 1738860854.0,
          "replies": []
        },
        {
          "id": "mbbo0cu",
          "author": "Wamadeus13",
          "body": "I've been on a 128gb phone for a couple of years and have never had an issue. I get complaints from the free icloud constantly, though. I pay for googles cloud service and get 2TB to offload my video and photos too. I don't have a desire to move to icloud because it feels to restricting. I can't use it as seamlessly as I can Googles cloud with PCs and sharing to friends (or at least the last time I checked?) If apple did anything I wish it was to increase the base free icloud to like 50GB.",
          "score": 4,
          "created_utc": 1738862305.0,
          "replies": []
        },
        {
          "id": "mbdohzf",
          "author": "StrangeAssonance",
          "body": "I have to use the 2tb one cause my kid refuses to off load her photos and videos and she has way too many. Since I use family plan it’s still pretty good value for all of us.",
          "score": 2,
          "created_utc": 1738882432.0,
          "replies": []
        },
        {
          "id": "mbbkzfu",
          "author": "Fulcrous",
          "body": "Saying 128GB is fine but then paying $11/mo for 2TB cloud storage for the purposes of offloading photos/videos is some wilful ignorance. You are precisely the demographic of people being targeted by Apple to leech money off of. \n\nSure it’s only $11/mo but a few months of Apple cloud is more expensive than physical storage. Physical storage for phones in particular is ridiculously cheap.",
          "score": 15,
          "created_utc": 1738861462.0,
          "replies": [
            {
              "id": "mbbsah9",
              "author": "contraryrhombus",
              "body": "I don’t pay $11 for cloud storage. If you read my comment, I pay for Apple One. Which includes my families music subscription, my families TV subscription as well as my families access to 2TB cloud storage.\n\nAnd excuse me for wanting to offload my photos and videos into cloud storage so I have a backup accessible not just on my phone, but on my other devices as well as in case of any local storage breaking/becoming unrecoverable due to a fire or flood. \n\nSorry I don’t conform to your ideals.",
              "score": 26,
              "created_utc": 1738863487.0,
              "replies": [
                {
                  "id": "mbd1sio",
                  "author": "Some-Ask-1662",
                  "body": "I don't disagree, but iCloud first and foremost is a sync service and not a backup, especially if it is the only location of your photos. [Corruption is not as uncommon as you might think.](https://discussions.apple.com/thread/253684060?sortBy=rank)",
                  "score": 0,
                  "created_utc": 1738876003.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbbnhyk",
              "author": "Redeem123",
              "body": "Physical storage is not as reliable or automatic as iCloud. It relies on you actively backing up your phone to your computer and can easily be lost with a damaged drive. ",
              "score": 6,
              "created_utc": 1738862164.0,
              "replies": [
                {
                  "id": "mbbqkkb",
                  "author": "nemoknows",
                  "body": "Exactly. Automatic cloud backup is easy, relatively cheap, and \n\nWhat I’d really like to see is a myCloud device that functions like (and can replicate) iCloud but lives in my house. One externally managed backup is not enough. Something like the old Time Capsule, but without the router - just a drive that lives on your network.",
                  "score": 4,
                  "created_utc": 1738863010.0,
                  "replies": []
                },
                {
                  "id": "mbbpvxj",
                  "author": "Fulcrous",
                  "body": "iCloud is not as reliable as you think either.\nYou are at the whims of another organization’s policies. If something goes down, you cannot fix it yourself. \n\nYou are entirely dependent on an internet connection.\n\nCloud also has security and privacy risks (recall Apple keeping nudes despite being “deleted” by the user).\n\nYou have slower access to larger files/folders.\n\nIf there’s downtime or service outages, you have no way to access said data.\n\nYou still need physical backups. Cloud can and will lose data as a result of human error, accidental deletion, or provider issues.\n\nThere’s a good reason no org with an IT team worth their salt *only* runs cloud for storage.\n\nAt least with physical storage you have *choice*.\nI can back up everything on cloud based storage (i.e. google drive)or physical storage by storing files in my ssd, a redundancy hdd or device, or my own home server if I choose. I only go as far as redundant drives and google drive for important photos/videos/music - which is is also set up to be done automatically when I plug my device to my computer - but at least I have choice.",
                  "score": 6,
                  "created_utc": 1738862822.0,
                  "replies": [
                    {
                      "id": "mbcocun",
                      "author": "Redeem123",
                      "body": "Yes that’s all true, and it’s why I have multiple backup drives in addition to cloud storage. \n\nBut we’re talking about average users here. A professional company like Apple, Dropbox, Google, or whatever is a lot less likely to fuck up their data than they are as an individual. ",
                      "score": 1,
                      "created_utc": 1738872318.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbcewba",
                  "author": "SunsetCarcass",
                  "body": "I know it's coloqually called the cloud but the data isn't being stored in thin air, it's still physical storage just on apples servers. Might as well buy a 5TB external HDD for $100 and back up to that, or buy 2 1TB HDD and back up on both. Not sure how well Apple treats their consumers but you get like 5GB free cloud storage right? So you could backup new photos there and move them to the HDD at your leisure then delete your cloud storage for more recently taken photos.",
                  "score": 0,
                  "created_utc": 1738869703.0,
                  "replies": [
                    {
                      "id": "mbcniyt",
                      "author": "Redeem123",
                      "body": "I’m aware that the cloud isn’t literally a cloud. But drives in data centers are treated WAY better than your typical household external drive.\n\nFor starters, they’re better drives from the get go. They’re stored in a temperature controlled environment. They’re given maintenance. They aren’t regularly plugged and unplugged. They get steady power. And most importantly they have built in redundancies. It’s not perfect, but it’s a lot less likely to fail than a $100 Seagate drive and has near-zero chance of being spilled on, dropped, or otherwise lost due to human error. \n\nYes, that’s all stuff that you can do at home with relatively minimal technical skill. But we’re talking about average users here, and that’s not something most people want to deal with. ",
                      "score": 2,
                      "created_utc": 1738872090.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbdciop",
              "author": "SolidOshawott",
              "body": "Install Immich on a PC with sufficient storage and boom, problem solved.",
              "score": 1,
              "created_utc": 1738878948.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbcl27r",
      "author": "fullload93",
      "body": "I don’t care about the 128GB, for some people that’s still perfectly fine. But the real crime here is Apple’s 5GB iCloud storage limit which has NEVER been increased for free since it released in 2011!!! 5GB!!! That’s a total joke nowadays.",
      "score": 9,
      "created_utc": 1738871411.0,
      "replies": [
        {
          "id": "mbfd4gu",
          "author": "AbhishMuk",
          "body": "I just asked chatgpt (very authoritative, I know) how much the cost of storage has dropped from 2011. Apparently it’s close to 25 fold… if they offered 125gb of storage I don’t think too many people would’ve been as annoyed.",
          "score": 4,
          "created_utc": 1738902952.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbcerav",
      "author": "xRostro",
      "body": "I got so used to using 16gb and 64gb that i don’t even imagine getting anywhere close to my limit of 128gb on the 15 Pro Max",
      "score": 4,
      "created_utc": 1738869664.0,
      "replies": []
    },
    {
      "id": "mbmk1i1",
      "author": "XuX24",
      "body": "128gb is fine, what needs to disappear is 64gb ipads.",
      "score": 4,
      "created_utc": 1739000973.0,
      "replies": []
    },
    {
      "id": "mbbipgh",
      "author": "TheTarasenkshow",
      "body": "Who the hell is using up that much space? If you have pictures/videos you should be offloading them to another medium anyway.\n\nEdit: look, I’ll admit when I’m wrong, and I’m definitely wrong on this one. I checked my iPhones storage and I’m using 108gb and that’s with all my photos offloaded to iCloud 😂. Disregard me and my dumb opinions",
      "score": 42,
      "created_utc": 1738860841.0,
      "replies": [
        {
          "id": "mbbkf7l",
          "author": "LetsJerkCircular",
          "body": "Most people: “Best I can do is fill the phone storage to the brim and expect the place I buy a replacement from to transfer all my shit. How long is this gonna take..? What time do you guys close? Oops…sorry. Let’s just get it done. All this shit is very important to me, but not like a couple bucks a month important.”",
          "score": 31,
          "created_utc": 1738861306.0,
          "replies": []
        },
        {
          "id": "mbbm7lo",
          "author": "JMS1991",
          "body": "I save a lot of memes",
          "score": 4,
          "created_utc": 1738861805.0,
          "replies": []
        },
        {
          "id": "mbbk1cb",
          "author": "Ancient_Boner_Forest",
          "body": "𝕿𝖍𝖊 𝖏𝖚𝖎𝖈𝖊𝖘 𝖔𝖋 𝖉𝖔𝖒𝖎𝖓𝖎𝖔𝖓 𝖘𝖍𝖆𝖑𝖑 𝖘𝖙𝖗𝖊𝖆𝖒, 𝖆𝖓𝖉 𝖙𝖍𝖊 𝖚𝖓𝖜𝖔𝖗𝖙𝖍𝖞 𝖘𝖍𝖆𝖑𝖑 𝖈𝖍𝖔𝖐𝖊 𝖚𝖕𝖔𝖓 𝖙𝖍𝖊𝖎𝖗 𝖉𝖊𝖓𝖎𝖆𝖑.",
          "score": 10,
          "created_utc": 1738861199.0,
          "replies": [
            {
              "id": "mbbl3n4",
              "author": "d4nowar",
              "body": "I hope you do back then up in the case of a device failure though.",
              "score": 6,
              "created_utc": 1738861495.0,
              "replies": [
                {
                  "id": "mbbrhbf",
                  "author": "Ancient_Boner_Forest",
                  "body": "𝕿𝖍𝖊 𝖗𝖔𝖆𝖘𝖙𝖊𝖉 𝖘𝖍𝖆𝖑𝖑 𝖗𝖎𝖘𝖊, 𝖙𝖍𝖊 𝖚𝖓𝖘𝖕𝖎𝖙𝖙𝖊𝖉 𝖘𝖍𝖆𝖑𝖑 𝖉𝖊𝖕𝖆𝖗𝖙, 𝖆𝖓𝖉 𝖙𝖍𝖊 𝖘𝖆𝖑𝖙𝖊𝖉 𝖘𝖍𝖆𝖑𝖑 𝖙𝖆𝖘𝖙𝖊 𝖔𝖋 𝖊𝖙𝖊𝖗𝖓𝖆𝖑 𝖜𝖗𝖆𝖙𝖍. 𝕹𝖔 𝖙𝖊𝖓𝖉𝖊𝖗 𝖒𝖔𝖗𝖘𝖊𝖑 𝖘𝖍𝖆𝖑𝖑 𝖋𝖊𝖎𝖌𝖓 𝖘𝖙𝖎𝖋𝖋𝖓𝖊𝖘𝖘 𝖎𝖓 𝖙𝖍𝖊 𝖋𝖆𝖈𝖊 𝖔𝖋 𝖉𝖊𝖌𝖑𝖚𝖙𝖙𝖎𝖔𝖓, 𝖋𝖔𝖗 𝖙𝖍𝖊 𝖆𝖓𝖔𝖎𝖓𝖙𝖊𝖉 𝖒𝖚𝖘𝖙 𝖘𝖑𝖎𝖉𝖊 𝖚𝖓𝖗𝖊𝖘𝖎𝖘𝖙𝖊𝖉 𝖎𝖓𝖙𝖔 𝖙𝖍𝖊 𝖆𝖇𝖞𝖘𝖘 𝖔𝖋 𝖙𝖍𝖊 𝖇𝖑𝖔𝖔𝖉-𝖋𝖎𝖑𝖑𝖊𝖉 𝖒𝖆𝖜.",
                  "score": 3,
                  "created_utc": 1738863263.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mbccaii",
          "author": "fffawn",
          "body": "I have a phone with 512gb and I currently use 126.9 gb",
          "score": 2,
          "created_utc": 1738868987.0,
          "replies": []
        },
        {
          "id": "mbbufai",
          "author": "orange_fudge",
          "body": "You’d be shocked how much some apps use. Right now my WhatsApp is 8GB! My bank app is 2GB. Even Reddit is 640MB.\n\nMultiply that by all the various apps I use and it adds up.\n\n(I still proudly get by on a 64GB iPhone though!)",
          "score": 3,
          "created_utc": 1738864067.0,
          "replies": []
        },
        {
          "id": "mbbukwy",
          "author": "AdeptFelix",
          "body": "That's not even that much video on the more recent iPhones, with how high resolution everything is. I know people who have filled up their new phones in just a few months because they didn't realize just how much video was eating through storage.",
          "score": 3,
          "created_utc": 1738864110.0,
          "replies": []
        },
        {
          "id": "mbgjsve",
          "author": "jmegaru",
          "body": "I store movies and series and all kinds of stuff on my phone to watch when I'm not at home and have some free time. Even though I have 256gb i constantly have to juggle a bunch if stuff it's simply not enough, I'm still salty about Xiaomi removing SD card slot on all but the cheapest tier.... For some reason if you pay more you get less features.... ",
          "score": 1,
          "created_utc": 1738926091.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbbliax",
      "author": "Spork-in-Your-Rye",
      "body": "I recently switched from a 64GB iPhone and idk how I managed to put up with lack of storage for that long",
      "score": 3,
      "created_utc": 1738861609.0,
      "replies": []
    },
    {
      "id": "mbeg4w3",
      "author": "trainbrain27",
      "body": "I've still got 64, but I agree, memory chips are dirt cheap, consumers can get a 265GB SSD for $12.\n\nI know Apple uses somewhat different chips, but they're also buying in mega-bulk.",
      "score": 3,
      "created_utc": 1738891365.0,
      "replies": []
    },
    {
      "id": "mbeup5p",
      "author": "Hammer_beats_paper",
      "body": "They should be required to sell iPhones with available storage only.  They can make their software bloat as big as they want just don’t advertise it as “available” storage.   Net storage is all the consumer cares about.",
      "score": 3,
      "created_utc": 1738896300.0,
      "replies": []
    },
    {
      "id": "mbf80xy",
      "author": "SSG_Vegeta",
      "body": "It’s beyond enough storage for most users. I consider myself a heavy user and that puts me in the minority of users, and I’m content with my $100 upgrade to 256GB on the Pro, which currently has 126GB free. \n\nI throw a couple of bucks to both Google and Apple every month for cloud backup (I am paranoid so I keep both backups for my photos and files) and I don’t look back. They both load some photos and videos I haven’t viewed in a while to the cloud and keeps my on phone storage low. When I need them, so long as I’m in reception, they’re a click away. \n\nIf I’m not in reception, I can wait til I do need them. \n\nWould it be nice to start higher? Sure. \nAm I going to insist on more? Nope. \nThere are plenty more important issues in this world.",
      "score": 3,
      "created_utc": 1738900974.0,
      "replies": []
    },
    {
      "id": "mbfujqx",
      "author": "TRKlausss",
      "body": "I got an SE2 and is still going strong with 64GB… What’s the deal here?",
      "score": 3,
      "created_utc": 1738910966.0,
      "replies": []
    },
    {
      "id": "mbnx2nj",
      "author": "zliszt",
      "body": "128 GB is fine for iPhone, I am using 70 GB now. With 2 years of use. Doubt will fill all during the lifetime of this current iPhone. Of course there are many that needs more, but this is the base. Now, Mac with 256 GB? That’s ridiculous.",
      "score": 3,
      "created_utc": 1739025619.0,
      "replies": []
    },
    {
      "id": "mbbh65q",
      "author": "Redeem123",
      "body": "128 is fine for most people tbh. It’s still absurd what Apple charges for storage upgrades, though. \n\nBut even as a *power* user when it comes to photo/video, I’ve only used up ~500 gigs. That includes RAW photos, multiple hour long video edits, about 40gb in various editing software, etc",
      "score": 15,
      "created_utc": 1738860423.0,
      "replies": [
        {
          "id": "mbbin0u",
          "author": "Protean_Protein",
          "body": "They probably want you to pay for the iCloud+ storage option. But the lowest tiers of that are actually pretty great--a few bucks a month for 2TB of family storage. Photos automatically uploaded to cloud storage but still thumbnailed on the phone saves a huge amount of space and helps with managing backups. Never go above half the drive (64 GB) full. Apps set to offload when they're not used frequently too.",
          "score": 3,
          "created_utc": 1738860822.0,
          "replies": []
        },
        {
          "id": "mbbi600",
          "author": "None",
          "body": "[deleted]",
          "score": -6,
          "created_utc": 1738860693.0,
          "replies": [
            {
              "id": "mbbn29u",
              "author": "Redeem123",
              "body": "A typical photo is less than 5 mb. Meaning that you get 200+ per gig, or 20 thousand in 100gb. That’s 10 pictures a day for 6 years, if you don’t delete any of them. At a quick glance, a lot of my photos are in the 2-3mb range, so you actually get double that space. \n\nVideos are obviously going to take up a lot more space, but the average user is not  taking a ton of photos and video every day. ",
              "score": 5,
              "created_utc": 1738862042.0,
              "replies": []
            },
            {
              "id": "mbbu847",
              "author": "PitchforkSquints",
              "body": "It's fine for most people. Most normies barely test the 64gb limit in my experience. \n\n>have photos easily exceeding that simply from transferring data normally during upgrades the past five/ten years\n\nMost people don't drag a decade worth of photo files along with them locally on their cell phone. I transfer my photos to a backup hard drive + cloud storage and start fresh when I upgrade. I hit 128gb after 2-3 years generally.",
              "score": 1,
              "created_utc": 1738864013.0,
              "replies": [
                {
                  "id": "mbbv1uy",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 0,
                  "created_utc": 1738864239.0,
                  "replies": [
                    {
                      "id": "mbbybd1",
                      "author": "PitchforkSquints",
                      "body": ">I take/save a photo, and call it good. I don’t do any of that backup stuff.\n\nTwo is one and one is none. Say bye bye to years of precious memories if you ever lose/break your phone\n\n>mess around with drives\n\nI agree, using an external hard drive may be beyond your capabilities. Let's get you to bed, grandpa",
                      "score": 1,
                      "created_utc": 1738865129.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mbbzexx",
      "author": "sometipsygnostalgic",
      "body": "still surviving on 64gb",
      "score": 6,
      "created_utc": 1738865435.0,
      "replies": []
    },
    {
      "id": "mbcaj3i",
      "author": "GHOSTFUZZ99",
      "body": "Stop buying it then",
      "score": 6,
      "created_utc": 1738868500.0,
      "replies": []
    },
    {
      "id": "mbbtu2w",
      "author": "PublicJeremyNumber1",
      "body": "Only using 55GB on a four year old 64GB phone. Ios and Apps taking up 40 of the GBs. I’m good and looks like its time to delete old apps tbh",
      "score": 2,
      "created_utc": 1738863908.0,
      "replies": []
    },
    {
      "id": "mbc23j1",
      "author": "garylapointe",
      "body": "I've got two people on my wireless plan that don't need any more than that.\n\nI'm not even sure if they have more than that on their iPads.",
      "score": 2,
      "created_utc": 1738866188.0,
      "replies": []
    },
    {
      "id": "mbc6e3b",
      "author": "-ZeroF56",
      "body": "Headline unclear, back to 16GB",
      "score": 2,
      "created_utc": 1738867370.0,
      "replies": []
    },
    {
      "id": "mbc7anm",
      "author": "count_chocul4",
      "body": "Turn off the shit AI. You’ll be fine",
      "score": 2,
      "created_utc": 1738867617.0,
      "replies": []
    },
    {
      "id": "mbczgal",
      "author": "johnjmcmillion",
      "body": "Wasn’t this called for when 8GB was the base model? And again when it was 16? And 64?",
      "score": 2,
      "created_utc": 1738875364.0,
      "replies": []
    },
    {
      "id": "mbdt011",
      "author": "Pergaminopoo",
      "body": "I remember my mp3 player that had 512mb and I was a pretty big deal in school everybody else had 256mb",
      "score": 2,
      "created_utc": 1738883828.0,
      "replies": []
    },
    {
      "id": "mbe36rv",
      "author": "Djb0623",
      "body": "Bruh i was rocking a phone with 64GB until like 2 weeks ago",
      "score": 2,
      "created_utc": 1738887126.0,
      "replies": []
    },
    {
      "id": "mbeajmp",
      "author": "eestionreddit",
      "body": "I have a 256GB iPhone 13 mini and I haven't even used half of the storage space after 2.5 years. A lot of people simply don't need more than 128GB on their phone.",
      "score": 2,
      "created_utc": 1738889515.0,
      "replies": []
    },
    {
      "id": "mbfhunz",
      "author": "horsewitnoname",
      "body": "wtf do people need so much space? I still have a 64gb and have never come close to using all my space ",
      "score": 2,
      "created_utc": 1738904900.0,
      "replies": []
    },
    {
      "id": "mbfs5gs",
      "author": "cornflakes369",
      "body": "Wtf do you all do with your phones? I've had the same 64gb phone for 4 years now and never had issues with storage",
      "score": 2,
      "created_utc": 1738909697.0,
      "replies": []
    },
    {
      "id": "mbfzl4u",
      "author": "SideburnsG",
      "body": "I still have my old I phone 4 from 2010 with 16GB",
      "score": 2,
      "created_utc": 1738913803.0,
      "replies": [
        {
          "id": "mbg2c4e",
          "author": "NotIsaacClarke",
          "body": "Same with my 5. Lil guy’s still my backup phone",
          "score": 2,
          "created_utc": 1738915434.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbga3qc",
      "author": "07budgj",
      "body": "I dont have a huge issue with the base iPhone 16 having this considering prices have stayed fairly level. \n\nBut the 16 pro having this still is ridiculous considering how much they advertise the pro video features which need the storage.",
      "score": 2,
      "created_utc": 1738920222.0,
      "replies": []
    },
    {
      "id": "mbgj1ek",
      "author": "Additional_Desk8865",
      "body": "128gb base storage is fine… what’s more important is the free iCloud storage should be revised. Make it 5GB per device you own or something. Or just make it 5GB base and you gain an additional 1GB per device.",
      "score": 2,
      "created_utc": 1738925654.0,
      "replies": []
    },
    {
      "id": "mbgo79f",
      "author": "GirthyStone",
      "body": "this is something a simple person would say",
      "score": 2,
      "created_utc": 1738928470.0,
      "replies": []
    },
    {
      "id": "mbgrgo8",
      "author": "badger906",
      "body": "Why don’t you just buy the non base model then? the option is there. not everyone needs 128gb. So why would they add more for those that don’t. there’s more people out there who’s phone is just a phone and an email reader, than there is power users treating them like pcs.",
      "score": 2,
      "created_utc": 1738930060.0,
      "replies": []
    },
    {
      "id": "mbgw3r5",
      "author": "long-ryde",
      "body": "Fuck, I still have my 64GB",
      "score": 2,
      "created_utc": 1738932112.0,
      "replies": []
    },
    {
      "id": "mbhwi75",
      "author": "VidentCaelum",
      "body": "My 128 is great.",
      "score": 2,
      "created_utc": 1738944243.0,
      "replies": []
    },
    {
      "id": "mbjdo2j",
      "author": "tomthecomputerguy",
      "body": "I used to have an iPhone 6 Plus with only 16 gb. Now that’s a model that needed to go. Over half of that capacity went to the os. \n128gb is fine.",
      "score": 2,
      "created_utc": 1738959379.0,
      "replies": []
    },
    {
      "id": "mbrcycw",
      "author": "MOSFETBJT",
      "body": "I think 128 is fine tbh",
      "score": 2,
      "created_utc": 1739063477.0,
      "replies": []
    },
    {
      "id": "mbbncm1",
      "author": "Dense_Ideal_4621",
      "body": "i've got 54gb free on my 128gb iphone 14. what am i missing????",
      "score": 3,
      "created_utc": 1738862122.0,
      "replies": []
    },
    {
      "id": "mbc56ic",
      "author": "Jlt42000",
      "body": "What for? I’m on iPhone 11 and 32 or 64gb and it’s not nearly full. 128 seems more than enough for basic users?",
      "score": 3,
      "created_utc": 1738867037.0,
      "replies": []
    },
    {
      "id": "mbc9q2j",
      "author": "TheBoBiZzLe",
      "body": "What about a tiny, high storage card that just plugs in and allows us to change the storage amount?",
      "score": 3,
      "created_utc": 1738868280.0,
      "replies": []
    },
    {
      "id": "mbcp116",
      "author": "Fuskeduske",
      "body": "Idk i have 128gb and idk what to spend my space on",
      "score": 3,
      "created_utc": 1738872506.0,
      "replies": []
    },
    {
      "id": "mbevtqf",
      "author": "Kiwithegaylord",
      "body": "Dude, no. iPhones, first and foremost, are meant to be phones for the average person. Quit cramming in more shit to drive the price up. I don’t care about an 120hz screen, a camera that can shoot a blockbuster movie, and enough storage to download the entirety of Wikipedia. Progress is objectively good but progress for the sake of progress when the average person doesn’t care is annoying",
      "score": 3,
      "created_utc": 1738896685.0,
      "replies": [
        {
          "id": "mbf834s",
          "author": "erevos33",
          "body": "iPhones are for the average person? How old are you?!",
          "score": 0,
          "created_utc": 1738900996.0,
          "replies": [
            {
              "id": "mbfbrcc",
              "author": "Kiwithegaylord",
              "body": "I should have rephrased this, BASE model iPhones should be for the average person (even though they really aren’t)",
              "score": 1,
              "created_utc": 1738902408.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbf8sog",
      "author": "cdegallo",
      "body": "My gripe is that despite many phones start at 128gb, which I can swallow, but charge a significant amount for the incremental storage upgrades.  Storage is very cheap, but we see a $300 increase to go from a 128gb iPhone 16 to a 512gb phone 16.  In volume for phone manufacturers,128gb storage costs around $20 and 512gb is around $60.\n\nThey are charging nearly 10x the delta to a customer.",
      "score": 3,
      "created_utc": 1738901262.0,
      "replies": [
        {
          "id": "mbgjh96",
          "author": "jmegaru",
          "body": "They have to somehow make up the money they lose from cloud storage subscriptions on people who buy the larger storage....",
          "score": 1,
          "created_utc": 1738925903.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbgy6ym",
      "author": "wary",
      "body": "If you don't fucking like it then switch. They don't owe you anything nor do you owe them. Move on.",
      "score": 4,
      "created_utc": 1738932970.0,
      "replies": []
    },
    {
      "id": "mbbinvj",
      "author": "hallstevenson",
      "body": "128gb is fine and if people can't manage that, isn't that on them ? My iPhone 15 has 128gb and I'm using 56gb. Too many people take thousands of photos, will never do anything with most of them, and never do any housecleaning. Same with videos, same with saving Snaps to their device or reels, and so on.",
      "score": 6,
      "created_utc": 1738860828.0,
      "replies": []
    },
    {
      "id": "mbbiyin",
      "author": "Bscully973",
      "body": "I've never filled a phones 128 storage before. It's literally plenty.  What are y'all keeping on there? 🤣",
      "score": 3,
      "created_utc": 1738860909.0,
      "replies": [
        {
          "id": "mbc0on1",
          "author": "yutsi_beans",
          "body": "Music. I have hundreds of hours of playlists and don't want to lose access if I lose internet (e.g. on the subway).",
          "score": 7,
          "created_utc": 1738865797.0,
          "replies": []
        },
        {
          "id": "mbdimfh",
          "author": "zerGoot",
          "body": "music, high res photos and videos",
          "score": 1,
          "created_utc": 1738880690.0,
          "replies": []
        },
        {
          "id": "mbbz2o9",
          "author": "twister55555",
          "body": "8gb ram is plenty for my computing, why do yall need more?? Like it's absolutely plenty, what could yall be using your Mac's for that uses more than 8gb 🤣🤣🤣",
          "score": -3,
          "created_utc": 1738865341.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbbmux2",
      "author": "NuPNua",
      "body": "Haven't we had a solution for this for years called expandable memory so people can just add what they need?",
      "score": 2,
      "created_utc": 1738861985.0,
      "replies": [
        {
          "id": "mbc7yea",
          "author": "Duke_of_Scotty",
          "body": "Bring back SD cards. Why is a SD card $10 but if I go up one tier of phone it's $100. \n \nI'm still waiting for them to make all the phones like the BMW heated seat bullshit. All the phones would be 512gb hardware but you gotta pay to unlock the 256 and 512 tier upgrades from the base 128.",
          "score": 1,
          "created_utc": 1738867797.0,
          "replies": [
            {
              "id": "mbc8mqd",
              "author": "NuPNua",
              "body": "Yeah, I've managed to get a model that supports SD up to now. If Motorola stops supporting them in their midrange models, I don't know what's next, lol.",
              "score": 1,
              "created_utc": 1738867981.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbcaazh",
      "author": "InclinationCompass",
      "body": "The thing is, Apple charges way too much for increased storage. At $100 for an additional 128gb,  the profit margins must be insane.",
      "score": 2,
      "created_utc": 1738868439.0,
      "replies": [
        {
          "id": "mbcocfi",
          "author": "heeden",
          "body": "You can get a 1TB SD card for less than that.",
          "score": 1,
          "created_utc": 1738872314.0,
          "replies": [
            {
              "id": "mbcquz4",
              "author": "InclinationCompass",
              "body": "Exactly, it’s a ripoff. But apple can charge those fees because people do pay for it.",
              "score": 1,
              "created_utc": 1738873015.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbjfinq",
      "author": "Aggravating_Loss_765",
      "body": "60% of all new iPhones are 128GB. I understand apple but the Pro is a different level. 256GB should be base for both Pro models not just for the Max.",
      "score": 2,
      "created_utc": 1738959917.0,
      "replies": []
    },
    {
      "id": "mbebcys",
      "author": "sketchy_ai",
      "body": "My phone is a 128GB and it's half empty. I'd rather the lowest tier allowed me to save money, so from my perspective, getting rid of 128 makes no sense.",
      "score": 2,
      "created_utc": 1738889781.0,
      "replies": [
        {
          "id": "mbfdu2v",
          "author": "AbhishMuk",
          "body": "The actual difference in cost of NAND chips for Apple is probably less than a large coffee at Starbucks. If apple suddenly started selling the 256gb model as base, they’d probably not need to change their price much at all to keep very similar margins. \n\nPut another way - when the actual chip is so cheap, you aren’t saving money, apple is just fleecing those buying high storage capacities.",
          "score": 1,
          "created_utc": 1738903237.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbbm1oc",
      "author": "0r0B0t0",
      "body": "I'm using a little over 128GB but thats mostly all the pictures I never organized, and a bunch of podcasts I haven't deleted. I think the base is fine. The real problem is that backing up to your own server is not as seamless as iCloud.",
      "score": 1,
      "created_utc": 1738861759.0,
      "replies": []
    },
    {
      "id": "mbbp0b0",
      "author": "emptybottle2405",
      "body": "It’s cheaper for me to have the smallest storage size and share a family Apple plan. The monthly cost doesn’t come close to the increased phone price",
      "score": 1,
      "created_utc": 1738862581.0,
      "replies": []
    },
    {
      "id": "mbbp5wk",
      "author": "albsen",
      "body": "In summary: Base system to big, only have 100gb space left for my text documents and favorite cat videos. Must have mooooorrrreee space. Pls. If you use a phone for work 128gb is plenty.",
      "score": 1,
      "created_utc": 1738862623.0,
      "replies": []
    },
    {
      "id": "mbbptlg",
      "author": "therealpigman",
      "body": "I’m only using 79 of my 128 GB. I don’t need bigger if it increases price",
      "score": 1,
      "created_utc": 1738862804.0,
      "replies": [
        {
          "id": "mbbulmf",
          "author": "jweaver0312",
          "body": "When Apple went from 64 to 128, they didn’t increase prices. When they went from 128 to 256 for the Pro Max, they did increase the starting price.",
          "score": 1,
          "created_utc": 1738864116.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbbrexd",
      "author": "TheDevilsAdvokaat",
      "body": "It depends on how you are using your phone. I use my phone almost entirely as a phone. Occasionally I might play a puzzle game like sudoku  or read some books on it.\n\nIt has 128gb storage, it;s an iphone six plus and yet never have I come close to using all the storage. Mostly I just make and receive phone calls or texts.\n\nFor me 128gb is fine. In fact I could probably go as low as 32gb and still be fine.",
      "score": 1,
      "created_utc": 1738863244.0,
      "replies": []
    },
    {
      "id": "mbbrpva",
      "author": "pizoisoned",
      "body": "This phone has the highest usage I’ve ever had on a phone and it’s still only using 55/128gb. Looking at the breakdown in system, only like 4gb is photos and I have around 4500 photos on here- though I do turn off Live Photos by default. \n\nI won’t speak to others use cases, but I suspect it’s not actually that many people who are burning through the 128gb of storage that quickly.",
      "score": 1,
      "created_utc": 1738863329.0,
      "replies": []
    },
    {
      "id": "mbbs08t",
      "author": "zandadoum",
      "body": "I think 128 is good average nowadays. \n\nI have 10K pictures, hours and hours of offline music and still enough to get some offline movies and tv shows for when I travel",
      "score": 1,
      "created_utc": 1738863410.0,
      "replies": []
    },
    {
      "id": "mbbs0ql",
      "author": "-Dixieflatline",
      "body": "While I don't disagree, the vast majority of users shouldn't be maxing out photo and video quality unless they plan on actually processing the shots and footage later. If it's only ever going to sit on the device, or maybe a laptop, then you should probably halve the resolution and save the storage space.",
      "score": 1,
      "created_utc": 1738863413.0,
      "replies": []
    },
    {
      "id": "mbbt55m",
      "author": "shhhpark",
      "body": "The daily iCloud messages you can’t disable is getting really fucking old. Thinking of using my free upgrade soon solely because they keep trying to sell me shit",
      "score": 1,
      "created_utc": 1738863720.0,
      "replies": []
    },
    {
      "id": "mbbtyl8",
      "author": "door_to_nothingness",
      "body": "I have 128GB iPhone and haven’t maxed my storage space yet. 🤷‍♂️",
      "score": 1,
      "created_utc": 1738863942.0,
      "replies": []
    },
    {
      "id": "mbbu7pj",
      "author": "jweaver0312",
      "body": "They only did for the Pro Max (which raised the starting price).",
      "score": 1,
      "created_utc": 1738864010.0,
      "replies": []
    },
    {
      "id": "mbburau",
      "author": "tealfuzzball",
      "body": "10 years of iPhone, 12k photos, still only using 64gb",
      "score": 1,
      "created_utc": 1738864158.0,
      "replies": []
    },
    {
      "id": "mbbvu81",
      "author": "cat_prophecy",
      "body": "They won't kill it because they want you to buy their cloud storage subscription.",
      "score": 1,
      "created_utc": 1738864452.0,
      "replies": []
    },
    {
      "id": "mbbx5uu",
      "author": "TacoStuffingClub",
      "body": "How about making it easier to delete and sort photos? I’ve got 2TB storage for family that’s almost always near full.",
      "score": 1,
      "created_utc": 1738864812.0,
      "replies": []
    },
    {
      "id": "mbbzahy",
      "author": "crashbandyh",
      "body": "Since when is having more options a bad thing.",
      "score": 1,
      "created_utc": 1738865401.0,
      "replies": []
    },
    {
      "id": "mbc1eyj",
      "author": "dongerbotmd",
      "body": "Middle out compression can’t come out soon enough",
      "score": 1,
      "created_utc": 1738866002.0,
      "replies": []
    },
    {
      "id": "mbc62in",
      "author": "blueblurz94",
      "body": "In 5.4 years with my 512GB 11 Pro, I’ve used up 243GB so far. That number will increase but even if I use my phone for another 2-3 years, I’ll never get close to using all 512GB. Tbh I still got my money’s worth in storage. Also judging by other comments I’m in the minority when I say I do agree with the article.",
      "score": 1,
      "created_utc": 1738867281.0,
      "replies": []
    },
    {
      "id": "mbceyon",
      "author": "NexexUmbraRs",
      "body": "Does it need to go? Or should just 254gb be cheaper?\n\nIn the end it's the cheapest tier, if it goes will that make everything else cheaper or will it just cease to be an option for those who use under 100gb?",
      "score": 1,
      "created_utc": 1738869721.0,
      "replies": []
    },
    {
      "id": "mbcgzts",
      "author": "Caasi72",
      "body": "I've never had a problem with 128gb on my phone",
      "score": 1,
      "created_utc": 1738870283.0,
      "replies": []
    },
    {
      "id": "mbcxi1t",
      "author": "PLEASEHIREZ",
      "body": "The phone itself is expensive, but if you're talking about older people, not all of us even have 64 gb of storage used from multimedia on our phones.",
      "score": 1,
      "created_utc": 1738874837.0,
      "replies": [
        {
          "id": "mbdqqiq",
          "author": "_RADIANTSUN_",
          "body": "So what, it costs them like $5 for 128GB of storage...",
          "score": 1,
          "created_utc": 1738883117.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbd1ubr",
      "author": "volticizer",
      "body": "Storage is literally the cheapest it's ever been, the fact phones are still charging so much between storage tiers has got to go. That said I genuinely believe 256gb is absolutely PLENTY for the vast majority of people. I personally have a larger storage for music primarily but that's just because I'm a snob.",
      "score": 1,
      "created_utc": 1738876017.0,
      "replies": []
    },
    {
      "id": "mbd4u01",
      "author": "audiotech14",
      "body": "I have the 128 with more than half of it available, and I have 33,000 photos and 1700 videos. My wife and I share the 2TB iCloud storage, and my photos storage is “optimized”, so I have absolutely no need for more storage.",
      "score": 1,
      "created_utc": 1738876833.0,
      "replies": []
    },
    {
      "id": "mbd5b6k",
      "author": "IsaacFL",
      "body": "I have 76.77gb out of 128g available so no I don’t need more. Everything is in the cloud. why should I have to subsidize those who think they need more local storage?",
      "score": 1,
      "created_utc": 1738876965.0,
      "replies": []
    },
    {
      "id": "mbd7a0g",
      "author": "MagicBoyUK",
      "body": "LOL, no.",
      "score": 1,
      "created_utc": 1738877507.0,
      "replies": []
    },
    {
      "id": "mbd7jjr",
      "author": "Doppelfrio",
      "body": "I’m doing fine with my 64gb 12. More would definitely be nice so I don’t have to pay as much attention to storage and social media app cache, but 128 seems like more than enough for those who don’t need a lot. I don’t think the base tier needs to be higher",
      "score": 1,
      "created_utc": 1738877580.0,
      "replies": []
    },
    {
      "id": "mbdcags",
      "author": "EraTheTooketh",
      "body": "I’ve had a 64 GB iPhone for 5 years, am I out of touch? I have to offload apps for large updates but I’ve never ran out of space",
      "score": 1,
      "created_utc": 1738878884.0,
      "replies": []
    },
    {
      "id": "mbdcu4r",
      "author": "tkhan456",
      "body": "It will…in 5 more iPhone cycles",
      "score": 1,
      "created_utc": 1738879037.0,
      "replies": []
    },
    {
      "id": "mbdd2n1",
      "author": "One-Recording8588",
      "body": "I have had a 128gb iPhone for a couple years and have 0 issues. Don’t even get over 70 in use. Why does it need to be updated if it’s still usable?",
      "score": 1,
      "created_utc": 1738879103.0,
      "replies": []
    },
    {
      "id": "mbdfbhb",
      "author": "CheapCarabiner",
      "body": "I’m still fine with 64 and I have like 4000 photos",
      "score": 1,
      "created_utc": 1738879737.0,
      "replies": []
    },
    {
      "id": "mbdlm4q",
      "author": "baltimoretom",
      "body": "I have 256 and mine is never more than 50% capacity; everything is in the cloud.",
      "score": 1,
      "created_utc": 1738881572.0,
      "replies": []
    },
    {
      "id": "mbdp6vr",
      "author": "KennKennyKenKen",
      "body": "The that to pixel also.",
      "score": 1,
      "created_utc": 1738882642.0,
      "replies": []
    },
    {
      "id": "mbdqio7",
      "author": "starrmanquik",
      "body": "I sell numerous iPhones every week and most people comfortably go for the 128GB model. iCloud optimised photo storage massively reduces photo storage freeing up so much space on device!",
      "score": 1,
      "created_utc": 1738883050.0,
      "replies": []
    },
    {
      "id": "mbdryz0",
      "author": "spreadthaseed",
      "body": "8gb ram on MacBooks would like a mention",
      "score": 1,
      "created_utc": 1738883504.0,
      "replies": []
    },
    {
      "id": "mbdso8w",
      "author": "Exceed_SC2",
      "body": "What's wrong with 128GB on a phone, what is everyone putting on their phones?",
      "score": 1,
      "created_utc": 1738883725.0,
      "replies": []
    },
    {
      "id": "mbdzvt2",
      "author": "pitterlpatter",
      "body": "Leave the 128GB alone, damnit! Lol \n\nThere’s folks that don’t need the extra, and the smaller storage option has a better price point. My MIL doesn’t come close to maxing out her storage, and my wife’s on her work phone most of the time. Since I’m paying for both their phones,….🤣",
      "score": 1,
      "created_utc": 1738886053.0,
      "replies": []
    },
    {
      "id": "mbe1sjj",
      "author": "SpicyNuggs4Lyfe",
      "body": "Apple is always the last one to upgrade base storage. Pretty sure they had base model iPads with 32GB of storage within the last 3 years. 32!",
      "score": 1,
      "created_utc": 1738886674.0,
      "replies": []
    },
    {
      "id": "mbe2zts",
      "author": "CzarAce",
      "body": "“128gb is the new 4gb”\n\n![gif](giphy|GrUhLU9q3nyRG|downsized)",
      "score": 1,
      "created_utc": 1738887064.0,
      "replies": []
    },
    {
      "id": "mbe4adw",
      "author": "Gandalfthefab",
      "body": "If you are getting your phone on a 3 year contract like with Verizon's unlimited ultimate plan. It only costs you $2.50 more a month over those 3 years to upgrade to 512gb which I feel is the minimum for a phone in 2025",
      "score": 1,
      "created_utc": 1738887482.0,
      "replies": []
    },
    {
      "id": "mbekkct",
      "author": "brokebackzac",
      "body": "Idr how much storage is on my iphone, but I do know I haven't even used half of it, and I've had iPhones for like 12 years and passed photos, contacts, text messages, etc. from phone to phone that entire time.",
      "score": 1,
      "created_utc": 1738892842.0,
      "replies": []
    },
    {
      "id": "mbemkn6",
      "author": "TheRealFrantik",
      "body": "They literally just got rid of the base 64GB for iPads lol, I don’t think 128 is going anywhere anytime soon. \n\nFor most people, I think 128 is more than enough. I could be wrong though, maybe I’m just good at storage and deleting stuff; I’ve been using 128gb phones for at least 5 years and have never run out of space.",
      "score": 1,
      "created_utc": 1738893525.0,
      "replies": []
    },
    {
      "id": "mbenq4z",
      "author": "None",
      "body": "My iPhone 10 only has 64gb :/",
      "score": 1,
      "created_utc": 1738893924.0,
      "replies": []
    },
    {
      "id": "mbeoq22",
      "author": "Jes00jes",
      "body": "Why? Then they won't sell online storage.",
      "score": 1,
      "created_utc": 1738894264.0,
      "replies": []
    },
    {
      "id": "mbesy4q",
      "author": "jnmjnmjnm",
      "body": "My iP11 is only using 80 of 128, and over half of that are apps I don’t use anymore. Photos sync to my NAS drive automatically, so I purge them periodically.",
      "score": 1,
      "created_utc": 1738895699.0,
      "replies": []
    },
    {
      "id": "mbf880t",
      "author": "ruffznap",
      "body": "1000%. 1TB of storage is so cheap now. It’s just obnoxious they try to give you so little",
      "score": 1,
      "created_utc": 1738901047.0,
      "replies": []
    },
    {
      "id": "mbg6mpq",
      "author": "clezuck",
      "body": "For someone like my mom who would rather have a dumb phone, 128gb is too much for her.  Keeping it helps those who don’t use a smart phone AS a smart phone.",
      "score": 1,
      "created_utc": 1738918061.0,
      "replies": []
    },
    {
      "id": "mbgiag2",
      "author": "meunbear",
      "body": "I don’t think I’ve thought about how much storage my phone has.  I guess if you don’t have any other computers at all then it’s more important. I always thought of my phones photo storage as temporary.",
      "score": 1,
      "created_utc": 1738925224.0,
      "replies": []
    },
    {
      "id": "mbglc9u",
      "author": "ngydat",
      "body": "What bothers me with this article is the fact that they want you to let go storage tier progressively: a few years ago it was the 16 GB tier, then 64 GB. Now it's the 128 GB tier. At some point, it would be nice for the apps to be optimized storage-wise.",
      "score": 1,
      "created_utc": 1738926954.0,
      "replies": []
    },
    {
      "id": "mbgm6c2",
      "author": "Gr3yt1mb3rw0LF068",
      "body": "I dont do a lot on my phone so 128 is enough. I do prefer 256, but looked the amount in my storage was well under 75 gb.",
      "score": 1,
      "created_utc": 1738927407.0,
      "replies": []
    },
    {
      "id": "mbgt0xu",
      "author": "DanDanDan0123",
      "body": "I have never even come close to filling up my 128gb!  I take pictures quite often that I don’t intend to keep but never get around to deleting.  \n\nDoes the average person really need more?  Or it’s just people download apps they never/rarely use?  I",
      "score": 1,
      "created_utc": 1738930778.0,
      "replies": []
    },
    {
      "id": "mbi7ilh",
      "author": "joeljaeggli",
      "body": "There is a whole class of iPhone users who have never put any data on their iPhone other than phone numbers. Those people are fine. My work phone an XR and it has 8GB free of 64 GB. I am a heavy user…",
      "score": 1,
      "created_utc": 1738947363.0,
      "replies": []
    },
    {
      "id": "mbmgu7j",
      "author": "None",
      "body": "Apple's memory prices have always been nothing but greed. Part of the reason I don't buy their products.",
      "score": 1,
      "created_utc": 1738999104.0,
      "replies": []
    },
    {
      "id": "mbwhwx7",
      "author": "ChiefStrongbones",
      "body": "For comparison, Apple's [Mac mini pricing](https://www.apple.com/shop/buy-mac/mac-mini/apple-m4-chip-with-10-core-cpu-and-10-core-gpu-16gb-memory-256gb):\n\n\n    256GB base storage\n    512GB upgrade $200\n    1TB upgrade $400\n    2TB upgrade $800\n\nMeanwhile, 2TB of high performance storage costs [$170 retail](https://www.amazon.com/dp/B0BHJJ9Y77).  Apple is such an asshole company.",
      "score": 1,
      "created_utc": 1739134634.0,
      "replies": []
    },
    {
      "id": "mbbp62h",
      "author": "Game2Late",
      "body": "No. 128 is more than enough. If we need 1TB phones something has gone very wrong.",
      "score": 1,
      "created_utc": 1738862624.0,
      "replies": []
    },
    {
      "id": "mbbp9hs",
      "author": "nWhm99",
      "body": "r/apple: “Can someone explain why you’d need that much storage? Don’t you guys use iCloud?”",
      "score": 1,
      "created_utc": 1738862650.0,
      "replies": []
    },
    {
      "id": "mbc5bhz",
      "author": "reward72",
      "body": "I could never fill 64GB, let alone 128GB... The only thing I need storage for is photos and they are on the cloud... Why should I pay more if I dont need it?",
      "score": 1,
      "created_utc": 1738867075.0,
      "replies": []
    },
    {
      "id": "mbcr3r6",
      "author": "Nail_Biterr",
      "body": "Phones really shouldn't be anything under 512, or even 1TB.  it's crazy.  Storage is so cheap nowadays, that I don't understand why phone companies are still being so cheap on this.  \n\n(it's like a $20 difference for 1TB to 2TB to buy an external hard drive.  I understand that it's not apples to apples, but still shouldn't be a $100 difference each upgrade to storage)",
      "score": 1,
      "created_utc": 1738873083.0,
      "replies": [
        {
          "id": "mbde4be",
          "author": "SolidOshawott",
          "body": "I don't think 1TB of ultra compact, low powered, high speed storage is that cheap if you multiply by the number of phones sold.\n\nThat said, the MacBook Air's recent RAM bump to 16GB indicated that the 8GB difference cost next to nothing, despite previously being a $200 upgrade.",
          "score": 3,
          "created_utc": 1738879394.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbebtcz",
      "author": "DyeZaster",
      "body": "I’m on a iPhone 15 Pro and I still have less than 64GB of data stored on my phone lmao, weird article.",
      "score": 1,
      "created_utc": 1738889929.0,
      "replies": []
    },
    {
      "id": "mbhilzj",
      "author": "None",
      "body": "I’m currently using 35gb. I’m fine.",
      "score": 1,
      "created_utc": 1738940122.0,
      "replies": []
    },
    {
      "id": "mbbld2g",
      "author": "d4nowar",
      "body": "Local storage that isn't removable is basically just temp storage.",
      "score": 1,
      "created_utc": 1738861569.0,
      "replies": []
    },
    {
      "id": "mbbr7uu",
      "author": "Nova_Nightmare",
      "body": "\"Consumers\" over removable batteries, headphone jacks, removable storage, micro transactions and more by buying whatever was in front of them with little to no complaint. Apple doesn't care if it's not enough, none of these companies care when they can monetize these things, and control your data.\n\nWhen 128GB disappears, more storage will be at the already higher cost, it won't be cheaper.",
      "score": 1,
      "created_utc": 1738863189.0,
      "replies": []
    },
    {
      "id": "mbc6cbq",
      "author": "Grumpycatdoge999",
      "body": "Why? I’ve had iPhones for 5 years now and I still haven’t filled up 128gb",
      "score": 1,
      "created_utc": 1738867357.0,
      "replies": []
    },
    {
      "id": "mbcf1ud",
      "author": "HoldenMcNeil420",
      "body": "When I can get 4TB in a tiny stick that just pops into my motherboard. They can do so much better with storage on these things.",
      "score": 1,
      "created_utc": 1738869746.0,
      "replies": []
    },
    {
      "id": "mbctj4a",
      "author": "Maximum-Today3944",
      "body": "My dogs and I agree, 128gb is insufficient and we need more storage. I only have 20-25k photos of these sleeping angels and it is impossible to delete any.",
      "score": 1,
      "created_utc": 1738873755.0,
      "replies": []
    },
    {
      "id": "mbdcc0k",
      "author": "DGRebel",
      "body": "No way,  I don’t understand what people need to store on the phone. Put it in the cloud then put it somewhere safe if you really don’t trust the cloud. I’m not paying extra for useless physical storage.",
      "score": 1,
      "created_utc": 1738878897.0,
      "replies": []
    },
    {
      "id": "mbdej1u",
      "author": "superpingu1n",
      "body": "99.9% doesnt need more than 60gb lol stupid article",
      "score": 1,
      "created_utc": 1738879512.0,
      "replies": []
    },
    {
      "id": "mbdk2i7",
      "author": "None",
      "body": "No. You don’t need to house that much media on your phone or pay for a cloud service subscription. It’s just ridiculous to pay for that stuff when a multi TB hard drive can be bought for very cheap and used as your storage. You don’t need ALL of your media accessible at once. You also don’t need to shoot video in 4k 60fps. \n\nSome people need that storage, but normal people at most just need a computer at home that can be used to store media and backup copies. \n\nI consume a lot of media and I’m barely pushing 60-70 gb on my base model. I think most people need to realize they’re buying shit hey don’t need for reasons they don’t understand.",
      "score": 1,
      "created_utc": 1738881111.0,
      "replies": []
    },
    {
      "id": "mbdqfaw",
      "author": "DougS2K",
      "body": "I honestly don't know why people even buy Apple phones. You get less of a phone for your money and they are way to restrictive.",
      "score": 1,
      "created_utc": 1738883020.0,
      "replies": []
    },
    {
      "id": "mbdtnny",
      "author": "1leggeddog",
      "body": "I have a 128gb phone and barely use like half of it...\n\nWtf are you people putting in there?",
      "score": 1,
      "created_utc": 1738884035.0,
      "replies": []
    },
    {
      "id": "mbdyl4v",
      "author": "curtisas",
      "body": "I have had my phone for a year and a half and still have 64/128 gigs available. Why should I pay more because you can't manage your data?",
      "score": 1,
      "created_utc": 1738885626.0,
      "replies": []
    },
    {
      "id": "mbenmlw",
      "author": "violetferns",
      "body": "tf do y’all have on your phones that 128gb isn’t enough",
      "score": 1,
      "created_utc": 1738893890.0,
      "replies": []
    },
    {
      "id": "mbhr50x",
      "author": "asmessier",
      "body": "Support sd cards!!!!!",
      "score": 1,
      "created_utc": 1738942700.0,
      "replies": []
    },
    {
      "id": "mbh1ph9",
      "author": "yksvaan",
      "body": "Where do you actually use so much? Once a month i plug the phone to computer, copy, archive and delete from phone. People don't manage their files or what?",
      "score": 0,
      "created_utc": 1738934335.0,
      "replies": [
        {
          "id": "mbhzbm3",
          "author": "Return2TheLiving",
          "body": "My Spotify is currently taking about 90gb",
          "score": 1,
          "created_utc": 1738945052.0,
          "replies": [
            {
              "id": "mbi59vj",
              "author": "yksvaan",
              "body": "So you have almost 10k songs on your phone. Probably much more since the quality isn't lossless surely.",
              "score": 2,
              "created_utc": 1738946733.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbbinqh",
      "author": "XxBrando6xX",
      "body": "It’s E-waste in any kind of more developed country and even in not, I would question how much memory is even left after all of apples bloatware apps and the OS.",
      "score": 0,
      "created_utc": 1738860827.0,
      "replies": []
    },
    {
      "id": "mbbplri",
      "author": "stogie-bear",
      "body": "I'm using 72gb of 256gb. I should have saved money by buying a 128gb phone. It's good that that option exists and while I understand that tech writers need to make word counts and get clicks I wish they'd stop with this junk.",
      "score": 0,
      "created_utc": 1738862744.0,
      "replies": []
    },
    {
      "id": "mbbu3ng",
      "author": "Protomau5",
      "body": "Dumb article",
      "score": 0,
      "created_utc": 1738863981.0,
      "replies": []
    },
    {
      "id": "mbcwbh0",
      "author": "Sebastianx21",
      "body": "Every flagship 128GB needs to go.\n\n256GB should be the bare minimum.",
      "score": 0,
      "created_utc": 1738874516.0,
      "replies": [
        {
          "id": "mbd6exv",
          "author": "fla_john",
          "body": "I'm just fine with my 128 Pixel, take tons of photos and back it all up. Nowhere near full.",
          "score": 1,
          "created_utc": 1738877269.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbdqdqi",
      "author": "queerdude01",
      "body": "Apple is fxxkin' mean! Such luxurious products with lousy 5GB cloud storage! Shame",
      "score": 0,
      "created_utc": 1738883007.0,
      "replies": []
    },
    {
      "id": "mbe06dy",
      "author": "ahzzyborn",
      "body": "52/64 on my iPhone X after several years. Doubt I’ll need 128 for awhile",
      "score": 0,
      "created_utc": 1738886150.0,
      "replies": []
    },
    {
      "id": "mbe6t9w",
      "author": "Mammoth-Swan-9275",
      "body": "How bout 256gb on a MacBook? What a joke",
      "score": 0,
      "created_utc": 1738888300.0,
      "replies": []
    },
    {
      "id": "mbeei0c",
      "author": "Peelboy",
      "body": "This is why I’m never having another iPhone that is not provided by work.",
      "score": 0,
      "created_utc": 1738890821.0,
      "replies": []
    },
    {
      "id": "mbfr5cf",
      "author": "GreyBeardEng",
      "body": "What needs to happen is they need to put micro SD card expansion back in their phones.... Oh wait, that would cut into their planned obsolescence so nevermind.",
      "score": 0,
      "created_utc": 1738909179.0,
      "replies": []
    },
    {
      "id": "mbgc2bc",
      "author": "ThatEvilGuy",
      "body": "Thank you to everyone who said that 128GB is enough for them, good to know. We'll keep giving you 128GB at an increased price since you are so happy with it. \n\n\\- Sincerely, Apple",
      "score": 0,
      "created_utc": 1738921465.0,
      "replies": []
    },
    {
      "id": "mbmb8x7",
      "author": "Shadowhawk109",
      "body": "Apple's entire ecosystem of criminally undersized/under-RAM'd and no expandability needs to go.\n\n\nBut that would require admitting Apple does anything wrong. ",
      "score": 0,
      "created_utc": 1738996026.0,
      "replies": []
    },
    {
      "id": "mbd65ro",
      "author": "Szriko",
      "body": "My phone has 4gb of storage, what in the ever-loving hell do you need 128gb of storage for on a PHONE? It's for CALLING PEOPLE.",
      "score": -2,
      "created_utc": 1738877198.0,
      "replies": []
    }
  ]
}