{
  "post": {
    "title": "PS5 Pro signposts a disc-less future that few actually want | Digital games are an ever-growing market segment, but given a choice, consumers prefer to keep the physical option – making the disc-less PS5 Pro a baffling decision",
    "author": "a_Ninja_b0y",
    "id": "1gml7l1",
    "score": 157,
    "created_utc": 1731079883.0,
    "selftext": "",
    "num_comments": 126,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gml7l1/ps5_pro_signposts_a_discless_future_that_few/"
  },
  "comments": [
    {
      "id": "lw4gfx8",
      "author": "Takco",
      "body": "A baffling decision?\n\nHardly, Sony wants money. Go out and buy a disc drive. Seems to work for them.",
      "score": 101,
      "created_utc": 1731091644.0,
      "replies": [
        {
          "id": "lw657n5",
          "author": "superman_king",
          "body": "It’s baffling. \n\nI’ve owned every PlayStation console. I’m an enthusiast with disposable income.\n\nI decided not to buy the PS5 Pro when I found out it comes with less features than my current PS5. I have to buy extra “attachments” to make it work. I am honestly surprised they threw in a “free” controller at this point. The fact I can’t even watch movies on the “pro” variant is a joke.\n\nTheir target market wants the disc drive, so why remove it?",
          "score": 30,
          "created_utc": 1731110846.0,
          "replies": [
            {
              "id": "lw8d7ld",
              "author": "Ericjuuh",
              "body": "The “free” controller is the next step. Take a look at apple, they removed chargers which is a crucial supporting add-on for your device. Sony can easily follow suit and call it “sustainability”. Since everyone by now has controllers in their house right?",
              "score": 9,
              "created_utc": 1731149766.0,
              "replies": []
            },
            {
              "id": "lw69ktg",
              "author": "mark_99",
              "body": "The data says most people don't want the disk drive. They don't want to make 2 models again. Making just a disk model, or bundling the disk drive, increases the price for everyone including the majority that don't want it. You can buy an add on drive if you want one.\n\nNot baffling at all. Personally I haven't used an optical disk for anything for at least 10 years. The main use case seems to be people who want to save a few $ via 2nd hand games. Probably even less intersection with the target  market for PS5 Pro.",
              "score": 9,
              "created_utc": 1731112373.0,
              "replies": [
                {
                  "id": "lw6gqr5",
                  "author": "MRintheKEYS",
                  "body": "Oh no I rent discs through GameFly, knock out the solo campaign on the exclusive and then ship it right back to GameFly.  Rinse wash repeat.  \n\nUnless it’s a multiplayer game for me. Once I beat it, I’m pretty much through and it’s on to the next one.",
                  "score": 13,
                  "created_utc": 1731114911.0,
                  "replies": [
                    {
                      "id": "lwavsle",
                      "author": "mark_99",
                      "body": "Did you buy a PS5 Pro?",
                      "score": 1,
                      "created_utc": 1731183638.0,
                      "replies": [
                        {
                          "id": "lwbd63i",
                          "author": "MRintheKEYS",
                          "body": "Traded in my 5 for the Pro yeah at GameStop.  Was able to snag a disc drive at Walmart a few days before.",
                          "score": 2,
                          "created_utc": 1731189340.0,
                          "replies": [
                            {
                              "id": "lwmw9vf",
                              "author": "mark_99",
                              "body": "Yeah I don't think anyone actually objects to the very idea of disk drives... if you want one because you think it'll be a saving long-term, or want it to play movies, then go for it. But seems fine that it's an add-on for those that want it.",
                              "score": 2,
                              "created_utc": 1731356352.0,
                              "replies": [
                                {
                                  "id": "lwmxfs8",
                                  "author": "MRintheKEYS",
                                  "body": "Well I don’t have a choice. Like 75% of my PS4 and PS5 library is on disc. I’ve also been a GameFly subscriber for years now.",
                                  "score": 1,
                                  "created_utc": 1731356710.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lw9924u",
                      "author": "JayBayes",
                      "body": "And if everyone did that developers would go out of business.",
                      "score": 1,
                      "created_utc": 1731164530.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lw6injv",
                  "author": "superman_king",
                  "body": "> The data says most people don’t want the disk drive.\n\nMeanwhile \n\n> PS5 Disc Edition Makes Up 82% Of Sales For Sony’s Console In The US\n\nhttps://www.psu.com/news/ps5-disc-edition-makes-up-82-of-sales-for-sonys-console-in-the-us/#:~:text=PS5%20Disc%20Edition%20Makes%20Up,In%20The%20US%20%2D%20PlayStation%20Universe",
                  "score": 23,
                  "created_utc": 1731115598.0,
                  "replies": [
                    {
                      "id": "lw7uj9c",
                      "author": "Darigaazrgb",
                      "body": "Now research digital purchases vs physical.",
                      "score": 9,
                      "created_utc": 1731137396.0,
                      "replies": [
                        {
                          "id": "lw8xbsf",
                          "author": "jewbagulatron5000",
                          "body": "Purchases of digital licenses not actual ownership.",
                          "score": 1,
                          "created_utc": 1731160048.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lw845um",
                      "author": "Henrarzz",
                      "body": "Cool, and? Almost 80% of new game sales on PS5 is digital.",
                      "score": 6,
                      "created_utc": 1731143735.0,
                      "replies": []
                    },
                    {
                      "id": "lw8k9m1",
                      "author": "drae-",
                      "body": "Fomo. Availability. \n\nThe games they actually buy are digital.",
                      "score": 1,
                      "created_utc": 1731154045.0,
                      "replies": []
                    },
                    {
                      "id": "lw8oa50",
                      "author": "3600CCH6WRX",
                      "body": "I have a PS5 with a disc edition, but I only have a few games on disc. Most of the games I have are digital. The only ones I have on disc are the ones that come with extra goodies like limited editions. So do my friends around me.",
                      "score": -1,
                      "created_utc": 1731156088.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lw6nvnw",
                  "author": "Anton1699",
                  "body": "> The data says most people don’t want the dis[c] drive.\n\nWhat data? The data I’ve seen suggests that the base PS5 w/ disc drive outsells the driveless version by a significant margin even though it’s more expensive.  \nYes, people are buying more and more games digitally, but purchasing a driveless console means you no longer have a choice, while customers with a disc drive can choose which version of the game to buy.",
                  "score": 6,
                  "created_utc": 1731117482.0,
                  "replies": [
                    {
                      "id": "lw8kexj",
                      "author": "drae-",
                      "body": "It's like choosing to buy a pickup truck and never hauling a thing, because maaaaybe you'll need to haul a sheet of pkywood from home depot if you ever get around to building that deck.\n\nYou don't need a pick up, it's more expensive too, but hell you were a boy scout and damn if you won't be prepared for even the most remote possibilities.",
                      "score": 4,
                      "created_utc": 1731154123.0,
                      "replies": []
                    },
                    {
                      "id": "lw847pb",
                      "author": "Henrarzz",
                      "body": "Now check digital to physical sales ratio for games, not console itself",
                      "score": 0,
                      "created_utc": 1731143770.0,
                      "replies": [
                        {
                          "id": "lw90wna",
                          "author": "thewaragainstsleep",
                          "body": "Some of us watch our movie collection, too",
                          "score": 2,
                          "created_utc": 1731161487.0,
                          "replies": []
                        },
                        {
                          "id": "lw92zf8",
                          "author": "Anton1699",
                          "body": "That's not what we're talking about though. As I said in the comment you're replying to, I am aware that people buy more digital games and that trend is getting worse (imo) but in terms of consoles, PS5 sales data suggests that the majority of people want a PS5 with a disc drive, and they're willing to pay more for it.",
                          "score": 2,
                          "created_utc": 1731162299.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lw8pakc",
                  "author": "Bloody_Sunday",
                  "body": "It's not baffling due to what you described. It's because (a) they are reducing the cost by not including a drive, (b) they are maximizing profit by asking people to pay extra for it when they need it, (c) they are also maximizing profit by increasing the price of the whole unit with one important component gone. \n\nBut what you describe is not the way it normally works at all. A disc includes the game itself, and all you need beyond that is to download any updates. You can't expect everyone globally to have a fast, easily available and cheap or even reasonably priced internet connection to just install multiple 70-120GB games whenever they like. It will take time (customer annoyance), affect data plans that are not unlimited, the above limitations are also a considerable factor etc. \n\nAnd then there's also the issue of owning a physical copy of something that may eventually not be available online anymore - and that you can find various ways of making it work without an internet connection if that point is reached.",
                  "score": 2,
                  "created_utc": 1731156574.0,
                  "replies": []
                },
                {
                  "id": "lw6ck9k",
                  "author": "heeywewantsomenewday",
                  "body": "The main use is that I actually own my copy of my game.",
                  "score": -3,
                  "created_utc": 1731113426.0,
                  "replies": [
                    {
                      "id": "lw6zkqa",
                      "author": "andDevW",
                      "body": "With any online console games can be locked out via the OS. Sony could have easily moved to keep physical media and switch the way games work on the console. Discs contain games that work for one user and then require activation to work on any other accounts.",
                      "score": 6,
                      "created_utc": 1731121908.0,
                      "replies": [
                        {
                          "id": "lw8s6oo",
                          "author": "demonsta500",
                          "body": ">Discs contain games that work for one user and then require activation to work on any other accounts.\n\nWhat does this mean ?",
                          "score": 2,
                          "created_utc": 1731157891.0,
                          "replies": [
                            {
                              "id": "lwc5gtr",
                              "author": "andDevW",
                              "body": "**PS keeping physical media while eliminating the game resale market to stay competitive with PC which has no physical media.** Discs would install locked games that require activation via PSN. Discs could be purchased with and without activation included. Users can freely share game discs to avoid downloads. Discs bought with activation could automatically activate on the first console they're installed on.\n\nWith the current system each disc works as a license from console to console as long as the disc is always in the drive. **It's impossible for PS to continue to exist with this system undercutting game sales in perpetuity.** Studios will make more money from PC sales (zero resale) and end up deprioritizing PS as a platform.",
                              "score": 1,
                              "created_utc": 1731199269.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lw6zssi",
                  "author": "firedrakes",
                  "body": "i mean when you use yes man data sure...\n\nnot peer review data.\n\njust like rt is brand new tech(its not) . \n\nit makes game look so good(makes them look worse).\n\nbias og source is always a bad idea to use as a source",
                  "score": -5,
                  "created_utc": 1731121995.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lw957hy",
              "author": "_andthereiwas",
              "body": "You can't watch DVD on it!?! Thank God I got a drive version at launch.",
              "score": 2,
              "created_utc": 1731163139.0,
              "replies": []
            },
            {
              "id": "lw7r8hy",
              "author": "sagevallant",
              "body": "PS5 Minus? PS5 Casual?\n\nWait, does it not play movies because of the disc drive or can it not play videos at all?",
              "score": 1,
              "created_utc": 1731135344.0,
              "replies": []
            },
            {
              "id": "lwa9a7l",
              "author": "THEboioioing",
              "body": "I am happy that I do not need to pay the price for a drive that I won't use.",
              "score": 1,
              "created_utc": 1731176365.0,
              "replies": []
            },
            {
              "id": "lw83lro",
              "author": "iFozy",
              "body": "I’m a big enthusiast too, and I noticed during the ps4 cycle I bought maybe 3 games in disc - which in the end I owned digitally. I bought the PS5 digital. Not everyone is the same as you. Discs are inconvenient to me.",
              "score": 1,
              "created_utc": 1731143363.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw6c2ly",
          "author": "FuzzyWuzzyHadNoBear",
          "body": "for now..",
          "score": 1,
          "created_utc": 1731113255.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw5mueq",
      "author": "drunk_sasquatch",
      "body": "I prefer digital. I don’t prefer digital that never gets the discounts physical gets. Forcing consumers to use the Sony store only is the real thing we don’t want.",
      "score": 49,
      "created_utc": 1731104590.0,
      "replies": [
        {
          "id": "lw66e0r",
          "author": "Tibbaryllis2",
          "body": "Have to agree. I would personally trade Steam-like sales on my console for physical media.",
          "score": 7,
          "created_utc": 1731111259.0,
          "replies": []
        },
        {
          "id": "lw6spo3",
          "author": "orangpelupa",
          "body": "Hopefully this will push the government (EU?) to force Sony to allow 3rd party store in ps store. Like what happened to Apple / Google. ",
          "score": 6,
          "created_utc": 1731119294.0,
          "replies": []
        },
        {
          "id": "lw7r6h7",
          "author": "whutupmydude",
          "body": "I prefer digital but would also like some more codified form of consumer protection of the products I digitally own in the near future",
          "score": 2,
          "created_utc": 1731135310.0,
          "replies": []
        },
        {
          "id": "lw9nst8",
          "author": "2squishmaster",
          "body": "Same, disks are such a hassle and can get ruined.",
          "score": 1,
          "created_utc": 1731169493.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw6ah1i",
      "author": "CaptainColdSteele",
      "body": "While I do prefer digital games, I don't want to deprive myself of a disk drive for when I want to watch a DVD or play one of the few games I have that aren't digital",
      "score": 7,
      "created_utc": 1731112689.0,
      "replies": []
    },
    {
      "id": "lw5vrub",
      "author": "dmu_girl-2008",
      "body": "I mostly want disc drive for ps4 games a handful of ps5 games and my ps5 is also my dvd/Blu-ray player",
      "score": 6,
      "created_utc": 1731107550.0,
      "replies": []
    },
    {
      "id": "lw4fqmp",
      "author": "None",
      "body": "Few want digital games, but it's an ever growing market?\n\n\n\n\nThere is a big difference between what people say they want and what they're willing to spend money on.",
      "score": 32,
      "created_utc": 1731091438.0,
      "replies": [
        {
          "id": "lw6r9rz",
          "author": "Anton1699",
          "body": "Few want a digital-only console. If you have a disc drive, you can still buy games digitally. If you don’t have a disc drive, you no longer get the choice.",
          "score": 13,
          "created_utc": 1731118750.0,
          "replies": [
            {
              "id": "lw709t5",
              "author": "Knyfe-Wrench",
              "body": "People always want choices, even if they don't use them. 10 years ago I got a PC with a disc drive, and I used it maybe 5 times. My car still has a CD drive and I've used it about the same. If it didn't cost any extra I'd get both again. That doesn't mean it's not a dying medium.",
              "score": 6,
              "created_utc": 1731122185.0,
              "replies": [
                {
                  "id": "lw70xb3",
                  "author": "Anton1699",
                  "body": "I get where you’re coming from, but as far as I know, the base PS5 w/ the disc drive outsells the driveless version by a pretty wide margin and it is more expensive. Not to mention that the PS5 Pro primarily targets the enthusiast audience, who are pretty likely to own a large physical PS4/PS5 game library that just won’t be playable out of the box.",
                  "score": 3,
                  "created_utc": 1731122449.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lw4jy4u",
      "author": "im_thatoneguy",
      "body": "\"Consumers prefer to keep the physical option\".\n\nSales trends say the opposite.  This was a year ago. \n\n[Physical Games Represented Just 4% of Sales for PlayStation Last Quarter | Push Square](https://www.pushsquare.com/news/2023/11/physical-games-represented-just-4percent-of-sales-for-playstation-last-quarter)",
      "score": 46,
      "created_utc": 1731092681.0,
      "replies": [
        {
          "id": "lw5hz1k",
          "author": "Magnus_Danger",
          "body": "Also disc size is not sufficient for holding the entire game for almost all AAA titles now. All you have on the disc at best is a DRM code and a thin client. Unless you get like 12 discs which I guess is not out of the question for PC players...",
          "score": 7,
          "created_utc": 1731103040.0,
          "replies": [
            {
              "id": "lw8sj6w",
              "author": "demonsta500",
              "body": ">All you have on the disc at best is a DRM code and a thin client\n\nNot true for most games. Majority of disc games on PS5 play from the disc install without a patch required.\n\nhttps://www.doesitplay.org/",
              "score": 2,
              "created_utc": 1731158042.0,
              "replies": [
                {
                  "id": "lw8up52",
                  "author": "Magnus_Danger",
                  "body": "I did specify AAA titles which does not appear to be selected for in your chart.",
                  "score": 1,
                  "created_utc": 1731158969.0,
                  "replies": [
                    {
                      "id": "lw8vd35",
                      "author": "demonsta500",
                      "body": "Even with AAA games, the ratio will be the same. All the major Sony published games (and even Silent Hill 2) this year were fully playable from disc with no downloads. CoD does the paperweight disc but it's still the exception rather than the norm",
                      "score": 2,
                      "created_utc": 1731159245.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lw66hf7",
              "author": "magnomagna",
              "body": "yea but you can get pre-owned discs at much lower prices than buying a brand new game... which is probably the only reason why people still want discs",
              "score": 6,
              "created_utc": 1731111291.0,
              "replies": [
                {
                  "id": "lw7jpw9",
                  "author": "healmehealme",
                  "body": "I want discs because while I love playing games, a big part of enjoyment also comes from growing my collection. \n\nPlus they retain some value. If I need to make some money, I can sell off some games and make a decent chunk back.",
                  "score": 3,
                  "created_utc": 1731131035.0,
                  "replies": [
                    {
                      "id": "lw8kr28",
                      "author": "drae-",
                      "body": "Oh Hai Mr. T!",
                      "score": 1,
                      "created_utc": 1731154304.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lw5mv9f",
              "author": "antara33",
              "body": "Even if you had the full game, most game nowdays need a day 1 patch to work.\n\n\nSo in the event of a patch server shutdown, the physical game is just a glorified buggy mess.",
              "score": 0,
              "created_utc": 1731104597.0,
              "replies": []
            },
            {
              "id": "lw5zbx9",
              "author": "Omegalazarus",
              "body": "Discs are the real scam. If you lose or damage the disc you lose the game. You can't even play on a friend's system without the disc. Super lame.",
              "score": -4,
              "created_utc": 1731108782.0,
              "replies": [
                {
                  "id": "lw7ispp",
                  "author": "hndrxdb",
                  "body": "If your account gets hacked you also lose the game often times",
                  "score": 0,
                  "created_utc": 1731130548.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lw7fx2e",
          "author": "YukihiraLivesForever",
          "body": "Disc edition console makes up 82% of total sales though according to Circana\n\nhttps://www.psu.com/news/ps5-disc-edition-makes-up-82-of-sales-for-sonys-console-in-the-us/\n\nConsumers can prefer the physical option on the console while still preferring digital copies of a game. Having options is probably more important. Just depends what you want to push: hardware or software. For this console which they themselves say is for enthusiasts, it should focus on hardware imo but I’m not paid millions of dollars to give an input so",
          "score": 5,
          "created_utc": 1731129100.0,
          "replies": [
            {
              "id": "lw7uxmu",
              "author": "Darigaazrgb",
              "body": "So then it's good that the discless version is the default since it gives you the option of paying less if you don't want want a disc drive.",
              "score": 3,
              "created_utc": 1731137649.0,
              "replies": []
            },
            {
              "id": "lw8kxy0",
              "author": "drae-",
              "body": "It's like buying a pickup truck you never haul anything in, because maybe one day you'll need to buy a sheet of plywood from home depot for that deck you've been meaning to build the last 5 years.\n\nBoth are ridiculous.",
              "score": 2,
              "created_utc": 1731154405.0,
              "replies": []
            },
            {
              "id": "lw7jw2k",
              "author": "im_thatoneguy",
              "body": "I’m using my Xbox disc drive to play a cd. That’s all it’s done since I bought it.",
              "score": 1,
              "created_utc": 1731131126.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw88svm",
          "author": "None",
          "body": "The headline is a little clickbaity, in that it wants you to immediately think is 4% of all game sales, when is all sales for Playstation. Which will include accessories, console, subscription, add-on/DLCs and more, plus game sales. \n\nIt probably tell the same message if you look at the cash distribution, as stated in the article, where physical is roughly 1 third, but is not as jaw dropping.",
          "score": 1,
          "created_utc": 1731146866.0,
          "replies": []
        },
        {
          "id": "lxa6i3w",
          "author": "1llseemyselfout",
          "body": "Consumers prefer the perks of owning a physical copy but also prefer the convenience of digital versions.   \n\nWe should be able to sell or digital games and use them on other peoples devices.",
          "score": 1,
          "created_utc": 1731686657.0,
          "replies": []
        },
        {
          "id": "lw7rhu4",
          "author": "sagevallant",
          "body": "I would like to know the percentage of physical sales when, like, Elden Ring came out.\n\nBlack Myth Wukong was high digital, I'm sure, because the physical edition was late. BG3, too.",
          "score": 0,
          "created_utc": 1731135502.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw8ffus",
      "author": "roguebananah",
      "body": "I’d still highly recommend Steam to a lot of console gamers. This isn’t elitism PC but how a digital market place SHOULD be ran. \n\nYeah there’s no promise Steam will be like this forever and my thought is, thankfully I have options from… OTHER sources if they ever take away the games I’ve already bought",
      "score": 3,
      "created_utc": 1731151205.0,
      "replies": []
    },
    {
      "id": "lw4ou0z",
      "author": "AwesomePossum_1",
      "body": "Did ai write this? I thought this website had a higher level of journalism standard. This 3 page editorial is just him beating around the bush around ONE line of what he actually wanted to say: \"data shows ps5 with a disk drive sold better than the digital model\", yet he doesn't even link to that data or the study or say what the source is, so there's no way to actually check his claim.",
      "score": 11,
      "created_utc": 1731094138.0,
      "replies": [
        {
          "id": "lw6sk7x",
          "author": "throllaway_beds",
          "body": "Nah this is just the bar for \"gaming journalism\" which has always been a joke.",
          "score": 4,
          "created_utc": 1731119236.0,
          "replies": [
            {
              "id": "lw708ss",
              "author": "firedrakes",
              "body": "and yt gaming experts to..\n\nhi where df where experts in what we rant about.\n\nwithout legal calling ourselves out as expert and get sue.\n\noh btw we have no one in any of the fields we rant about. on are staff.\n\nbut one thing we have by a large margin is fans to send threats to anyone that question us!",
              "score": 2,
              "created_utc": 1731122174.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lw4y5lx",
      "author": "jacobpederson",
      "body": "They may say they prefer them . . . [but they don't buy like they prefer disks.](https://gamerant.com/ps5-total-sales-november-2024/)",
      "score": 7,
      "created_utc": 1731096955.0,
      "replies": []
    },
    {
      "id": "lw53cup",
      "author": "None",
      "body": "Not really a baffling decision at all.  I like having physical copies, but a lot of people either don’t care or even prefer digital.  (It is pretty convenient being able to just buy something from an app on my phone that automatically starts installing.)\n\nBesides, the whole industry is moving in that direction.  It’s not like consumers have other good options.",
      "score": 4,
      "created_utc": 1731098548.0,
      "replies": []
    },
    {
      "id": "lw8csde",
      "author": "Galwadan",
      "body": "I can sell old game and get another one. Repeat cycle few times. Of course I have to pay some additional cash, but it's still way more economic solution than getting digital copy that is rented, not owned.",
      "score": 2,
      "created_utc": 1731149496.0,
      "replies": []
    },
    {
      "id": "lw8hunl",
      "author": "KalashnikittyApprove",
      "body": "I prefer digital games but I hate the whole model around it. If I could download all of my games onto local storage for safekeeping and play them regardless of what happens to my account, or sell and trade them, I don't think I'd ever buy a physical game ever again. \n\nThat being said the writing is on the wall for physical and I don't expect that I'll be able to play any of my PS4 or PS5 discs on the PS6. I still buy discs but generally across PC, PS and Xbox most of my purchases digitally. For all its drawbacks, I think it's more future proof.",
      "score": 2,
      "created_utc": 1731152684.0,
      "replies": []
    },
    {
      "id": "lw8ocff",
      "author": "sizzlinpapaya",
      "body": "Up until this generation I was very big on physical only. But idk what changed, ease of use, time, idk… but anymore I’m a digital first person unless it’s something very specific. I’ve bought many games in PS5 this year and maybe 3 of them were physical.",
      "score": 2,
      "created_utc": 1731156119.0,
      "replies": []
    },
    {
      "id": "lw9hcqz",
      "author": "mduckworth92",
      "body": "I'm surprised to hear that people want disk drives. I love that I can just switch games without getting up off the couch. (Yes, I know lazy, but why do I need a physical disk) \n\nIn the past, when I'd go to sell my old games, they were effectively worthless at game stop.",
      "score": 2,
      "created_utc": 1731167368.0,
      "replies": []
    },
    {
      "id": "lw7fh68",
      "author": "encreturquoise",
      "body": "I won’t buy a digital only console, because physical games are always cheaper (new and used) and I can share them with friends. Also, I’m sure that any physical games will be playable in a distant future.",
      "score": 2,
      "created_utc": 1731128890.0,
      "replies": [
        {
          "id": "lw7jha9",
          "author": "pinkyNthabrain31",
          "body": "I 2nd your comment. Why, on this green and blue marble of ours, would I ever want to go full digital? You can't share digital games. If your friend wants to play but doesn't have the game, you have the disc version.\n\nAs far as price goes....PS Store wants $40 or $50 for the digital version of Cyberpunk. Ebay? New, unopened physical copy for less than $20.",
          "score": 1,
          "created_utc": 1731130907.0,
          "replies": [
            {
              "id": "lw8sp51",
              "author": "demonsta500",
              "body": ">You can't share digital games\n\nYou can though. Game sharing is there between accounts on PS and Xbox.",
              "score": 1,
              "created_utc": 1731158115.0,
              "replies": [
                {
                  "id": "lw8tium",
                  "author": "pinkyNthabrain31",
                  "body": "I stand corrected.",
                  "score": 1,
                  "created_utc": 1731158470.0,
                  "replies": [
                    {
                      "id": "lw8u8bx",
                      "author": "pinkyNthabrain31",
                      "body": "As far as I know not between two separate systems without having an account on console B.",
                      "score": 1,
                      "created_utc": 1731158772.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lw7jrd5",
              "author": "pinkyNthabrain31",
              "body": "And it doubles as a dvd/blu-ray player.",
              "score": 1,
              "created_utc": 1731131057.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw7qyij",
          "author": "Caci-que",
          "body": "This all day! Companies are continuing their effort to take ownership away from the consumer. The worst of these offenders, in my opinion, is adobe.",
          "score": 1,
          "created_utc": 1731135177.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw6yrds",
      "author": "flux_capacitor3",
      "body": "PC has had digital games for 20 years. lol. I haven't bought a disc game for PlayStation since MGSV on PS4. I know everyone says \"you don't own the game!\" when it's digital. Again, I revert back to PC owners haven't had discs in years. Nobody says shit about that.",
      "score": 2,
      "created_utc": 1731121593.0,
      "replies": []
    },
    {
      "id": "lw6my7s",
      "author": "sexaddic",
      "body": "No thanks. Digital is preferred.",
      "score": 2,
      "created_utc": 1731117142.0,
      "replies": []
    },
    {
      "id": "lw5th9r",
      "author": "KyuubiWindscar",
      "body": "If we were still running games off of discs, it’s a non issue. But because we’re running games from internal storage for speed, advanced DRM, patches and updates I wonder if there’s another way to drive for media preservation than just discs.",
      "score": 1,
      "created_utc": 1731106767.0,
      "replies": []
    },
    {
      "id": "lw60bwi",
      "author": "CucumberError",
      "body": "I’m torn. I do like physical media, but I also like not having to get up to change discs.",
      "score": 1,
      "created_utc": 1731109131.0,
      "replies": []
    },
    {
      "id": "lw7rksh",
      "author": "Doppelkammertoaster",
      "body": "It's binding the customer to your environment. Simple. \nEven with a disc you need a PSN account, right?\nSo, why bother. \n\nSame with films and shows. How many aren't published on Blu Ray because the companies want your dependency on their service. They try to force it.",
      "score": 1,
      "created_utc": 1731135552.0,
      "replies": []
    },
    {
      "id": "lw8fk7u",
      "author": "t_11",
      "body": "Why do people still want discs and Steam out here making a killing?",
      "score": 1,
      "created_utc": 1731151283.0,
      "replies": [
        {
          "id": "lw8wq2l",
          "author": "MaxDiehard",
          "body": "Because one day, Steam will eventually close. \n\nYou don't own a single digital item that you've purchased.",
          "score": 1,
          "created_utc": 1731159806.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw8wjey",
      "author": "MaxDiehard",
      "body": "They just didn't want to produce two different SKUs.\n\nIt's why Collectors Editions they produce only come with a digital copy, not a disk. So they only need to produce and sell one version.",
      "score": 1,
      "created_utc": 1731159731.0,
      "replies": []
    },
    {
      "id": "lw8yguf",
      "author": "Catch_022",
      "body": "Interesting, most PCs don't have drives and haven't for years.",
      "score": 1,
      "created_utc": 1731160513.0,
      "replies": []
    },
    {
      "id": "lw91ek3",
      "author": "Giul_Xainx",
      "body": "I gave up on gaming altogether back in 2019. I stopped buying games, PCs, and consoles. And it is because something sinister brewed in the background.\n\nI have seen all sides of the argument for, against, and even trade offs on gaming. But it boils down to money. If you follow the money you will see why things are going this way. It's not just the development, you have to remember security as well. Gaming is becoming a service because of security. Don't believe me? Bad actors are starting to infiltrate mods and cheats. Be careful what you do with your games from now on. You really do not know who to trust anymore. Features like unreal tournament 3, where they allowed custom maps to be put onto consoles (PS3, 360), will become a huge risk in the future. We have seen arbitrary code execution happen in videogames.\n\nI truly do believe that physical copies will be rendered a huge risk in the very near future as their code, as is, will be exploited. I would say the speed running community, if it gets bad enough, will be the most vulnerable victims in the very near future.\n\nI used to think that video games were a safe haven from hacks. But it looks like it is starting to be an avenue for bad actors to start taking over your machines. And it is all because no one really focused on them in such a manner.",
      "score": 1,
      "created_utc": 1731161684.0,
      "replies": []
    },
    {
      "id": "lw9x3rz",
      "author": "fuglygay",
      "body": "Makes me wonder, what if they decide to make PS6 disc-less? How badly do you think it will affect sales?",
      "score": 1,
      "created_utc": 1731172484.0,
      "replies": []
    },
    {
      "id": "lwa0n8k",
      "author": "None",
      "body": "So glad I got the slim disc version as soon as it came out. Buying the stand separate was enough of a pain; I straight-up wouldn’t buy the console if I needed to buy that *and* a disc drive.\n\nThey’re making some baffling decisions with this ‘new era’ of console gaming. It’s one thing to offer the choice of a digital or disc version, but it’s a whole other to *only* sell digital consoles and separate accessories.\n\nI know a lot of people who game but refuse to upgrade because of the base console price already, combined with the fact that most PS5 games are actually PS4 games (not to mention, the controllers fail more quickly and USB port failures have plagued some models). The quality and upgrade just doesn’t seem worth the price to a lot of people. And Sony’s response is to make the console more expensive and inconvenient to acquire. Solid.",
      "score": 1,
      "created_utc": 1731173618.0,
      "replies": []
    },
    {
      "id": "lwdf7ij",
      "author": "Difficult_Ad2864",
      "body": "Cheaper to produce and max out the profitability",
      "score": 1,
      "created_utc": 1731218051.0,
      "replies": []
    },
    {
      "id": "lwe24dv",
      "author": "StuckinReverse89",
      "body": "Its not a “baffling” decision though. Valve successfully made the PC market all digital and killed the physical market. Microsoft and Sony see this and want in on the action.   \n\nThere are far more advantages for corporations if games are digital only.  ",
      "score": 1,
      "created_utc": 1731232395.0,
      "replies": []
    },
    {
      "id": "lw6qw76",
      "author": "Ruttagger",
      "body": "Also everyone I know who games hasn't bought a physical copy of a game this entire console generation, myself included.\n\nI could be in the minority, but thats just my experience.",
      "score": 0,
      "created_utc": 1731118609.0,
      "replies": [
        {
          "id": "lw794y8",
          "author": "facest",
          "body": "No you’re right, but the article title kind of is as well. People don’t want digital to be their only option, but they’re mostly buying digital anyway.",
          "score": 0,
          "created_utc": 1731125948.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw5v5jx",
      "author": "unematti",
      "body": "I mean, I'm baffled people buy consoles, but people do things I find weird all the time. That said, if steam would try to F with my library, I would get all of it cracked for safe keeping",
      "score": 1,
      "created_utc": 1731107336.0,
      "replies": []
    },
    {
      "id": "lw57jjo",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1731099808.0,
      "replies": [
        {
          "id": "lw70sbs",
          "author": "Knyfe-Wrench",
          "body": "I've got bad news for you, that's true with physical too.",
          "score": -1,
          "created_utc": 1731122394.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw5g93c",
      "author": "brokenmessiah",
      "body": "Sony has always been trying to push for digital only. I think their PSP Go was literally the very first instance of this and people were split on it. I loved it and 16GB internal storage was insane for its time.",
      "score": 1,
      "created_utc": 1731102503.0,
      "replies": []
    },
    {
      "id": "lw622fu",
      "author": "phara-normal",
      "body": "The games aren't fully on the discs anyways..",
      "score": 1,
      "created_utc": 1731109743.0,
      "replies": []
    },
    {
      "id": "lw66q67",
      "author": "Astronut325",
      "body": "Sony earnings release states that the full game digital download ratio is 70% as of the latest earnings release.  \n\n Source (See page 10):  https://www.sony.com/en/SonyInfo/IR/library/presen/er/pdf/24q2_supplement.pdf \n\n And that’s a Q2 high. \n\nIf you ask me, people are asking for all-digital consoles.",
      "score": 1,
      "created_utc": 1731111377.0,
      "replies": []
    },
    {
      "id": "lw56i95",
      "author": "Sargatanas2k2",
      "body": "Don't buy it, or any other digital only consoles. If everyone does that (wishful thinking I know) then they will have no choice but to backtrack.",
      "score": -2,
      "created_utc": 1731099495.0,
      "replies": [
        {
          "id": "lw5goje",
          "author": "brokenmessiah",
          "body": "If you are against it, just don't buy it and regardless of what others are doing you stuck to your beliefs.",
          "score": 4,
          "created_utc": 1731102635.0,
          "replies": []
        },
        {
          "id": "lw5nrsr",
          "author": "antara33",
          "body": "I personally believe that physical games are a total waste of resources.\n\n\nFirst, most disks dont even have the full game, and even if they do, most games require patches to work and are a mess on release, so you still need to download stuff to make it work, and good luck if they decide to shut down the network.\n\n\nNo disk will save you from that.\n\n\nAt this point, since having a disk is no longer meaning that you will be able to play the game, neither saves you from downloading mandatory and required upgrades, why are we spending shittons of resources making, printing and moving them?\n\n\nI think about it from an eco friendly perspective, as dumb as that may sounds, disks are 100% useless in the modern era, save for selling older games, so instead of pushing for keeping a wasteful media format, why not push to enable game trading?",
          "score": 3,
          "created_utc": 1731104891.0,
          "replies": [
            {
              "id": "lw6008j",
              "author": "Divallo",
              "body": "\"and physical games are products that fall outside the control of publishers and platform holders in a way that they have found increasingly irritating in recent years.\"\n\nTrading your \"used\" digital games sounds great but there's virtually zero chance of it actually happening anytime soon.  Like the article states they want as much control as possible.\n\nAlso a used digital game is for all intents and purposes completely identical to a brand new digital game because they don't take damage or degrade the way physical used games do.  Publishers are aware of this and are adamantly opposed to the idea of digital game trading.",
              "score": 2,
              "created_utc": 1731109017.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lw51es8",
      "author": "Wander715",
      "body": "I'm digital only on PC and love it, but I get why the console user base still wants discs as an option.",
      "score": 0,
      "created_utc": 1731097954.0,
      "replies": [
        {
          "id": "lw7uzwm",
          "author": "Darigaazrgb",
          "body": "You have far less of a choice on PC.",
          "score": 1,
          "created_utc": 1731137688.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw4fk5y",
      "author": "None",
      "body": "[deleted]",
      "score": -2,
      "created_utc": 1731091387.0,
      "replies": [
        {
          "id": "lw5lu1v",
          "author": "OldKentRoad29",
          "body": "It's considered disc-less because it doesn't have disc drive built in like most consoles before it.",
          "score": 0,
          "created_utc": 1731104263.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw66rnv",
      "author": "foreveraloneasianmen",
      "body": "just buy a disk drive , its not that hard...seriously. People whine too much these days.",
      "score": -3,
      "created_utc": 1731111392.0,
      "replies": []
    },
    {
      "id": "lw5nrq7",
      "author": "kyleleblanc",
      "body": "I went all in on digital back on PS4 and I regret nothing.",
      "score": 0,
      "created_utc": 1731104890.0,
      "replies": []
    },
    {
      "id": "lw83yt4",
      "author": "Henrarzz",
      "body": ">few actually want\n\nGame sales data says that most actually do want it.",
      "score": 0,
      "created_utc": 1731143608.0,
      "replies": []
    },
    {
      "id": "lw89vgu",
      "author": "Soaddk",
      "body": "Who wants to change disc whenever they want to play a new game? What is this? 2008?",
      "score": 0,
      "created_utc": 1731147581.0,
      "replies": []
    },
    {
      "id": "lw8m9mo",
      "author": "dustofdeath",
      "body": "People are still romantizing old optical media with limited capacity.\nEven USB drives are a better physical media.",
      "score": 0,
      "created_utc": 1731155084.0,
      "replies": []
    },
    {
      "id": "lw8noo8",
      "author": "skinnyzaz",
      "body": "I don’t ever again want to worry about physical media! Just the thought of changing games by getting off the couch and dealing with a cd not to mention putting away/storing them is the most needless annoying thing I can think of when it comes to gaming.\n\nWhen ps5 was first released I bought a few physical games that were on sale, now after a few moves I have no idea where they are. If they were digital I would still have access to them. Never again will I buy physical media, would rather pay more for digital and make everything more convenient.",
      "score": 0,
      "created_utc": 1731155794.0,
      "replies": []
    },
    {
      "id": "lw6767g",
      "author": "thejoshfoote",
      "body": "Digital isn’t ever growing. They just push digital over physical. Can’t trade in ur digital, no resale value. Physical game stores are getting fewer n farther between. Higher margins on games and hardware. We are being steered into digital. Many games release limited amounts of physical copies now. Many indies have no choice but to be digital.",
      "score": -5,
      "created_utc": 1731111533.0,
      "replies": []
    },
    {
      "id": "lw8jycg",
      "author": "KingSwank",
      "body": "Consumers prefer to keep the physical option? I’m not gonna lie I don’t think I’ve seen anyone buy a physical copy of a game since before Covid.",
      "score": -1,
      "created_utc": 1731153873.0,
      "replies": []
    },
    {
      "id": "lw4qerk",
      "author": "Voltron_The_Original",
      "body": "I refuse to spend money on anything that is not tangible.",
      "score": -9,
      "created_utc": 1731094612.0,
      "replies": [
        {
          "id": "lw5cthl",
          "author": "rubseb",
          "body": "How are you using the internet, then?",
          "score": 6,
          "created_utc": 1731101438.0,
          "replies": [
            {
              "id": "lw5gktx",
              "author": "brokenmessiah",
              "body": "BOOM",
              "score": 0,
              "created_utc": 1731102604.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lw5yhfs",
      "author": "Marcysdad",
      "body": "Now that the ps5 pro is out and the add on disc drives are sold out almost everywhere, I'm sure Sony will get the message \n\nBut it's still weird bringing this article  out just now in a world where (sadly) almost no cds,  dvds, or blu ray discs are sold is weird.\n\n\nAlso, 70 percent of game sales on Playstation are digital.\nEven more on pc.\nAnd don't start with pc being an open platform \nYou're buying a license for a game.\nEverything else is piracy. \n\nI, for one happily, will pay extra for a disc drive when I'm given the option to choose\n\nIf not, too bad -  you lost a customer.",
      "score": -2,
      "created_utc": 1731108486.0,
      "replies": [
        {
          "id": "lw6s01w",
          "author": "volcia",
          "body": "> , I'm sure Sony will get the message \n\n Yes, they’ll get a message to just separate the disc drive so they can get more profit lmao",
          "score": 3,
          "created_utc": 1731119023.0,
          "replies": []
        }
      ]
    }
  ]
}