{
  "post": {
    "title": "Nikon Will Raise Prices in the US in One Month Because of Tariffs",
    "author": "diacewrb",
    "id": "1ku7hib",
    "score": 2341,
    "created_utc": 1748078358.0,
    "selftext": "",
    "num_comments": 117,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ku7hib/nikon_will_raise_prices_in_the_us_in_one_month/"
  },
  "comments": [
    {
      "id": "mtzelwx",
      "author": "RyuChamploo",
      "body": "![gif](giphy|I3WAJgc0J61Xxkff5o)",
      "score": 532,
      "created_utc": 1748079530.0,
      "replies": [
        {
          "id": "mu2rueq",
          "author": "nycdiveshack",
          "body": "This is a repeat of what happened in 2020, raise prices/lower quality and never undo either… have folks accept the new status quo",
          "score": 51,
          "created_utc": 1748123846.0,
          "replies": [
            {
              "id": "mu2z38b",
              "author": "None",
              "body": "This is a little different. The primary driver right now is one buffoons ego.",
              "score": 12,
              "created_utc": 1748126544.0,
              "replies": [
                {
                  "id": "mu3619q",
                  "author": "nycdiveshack",
                  "body": "The folks behind all this are people like Russ Vought (primary author of project 2025) and Howard Lutnick (Cantor Fitzgerald which is the biggest supporter of the heritage foundation). They want an era of isolationism for the U.S. because they think this country can prosper with the right access to raw materials and straight labor. It’s why they are working on shutting down access to proper education, having Trump go on and on about acquiring Canada and Greenland which is partly for resources and accessibility but also as a buffer zone to the rest of the world. They have been convinced into thinking AI is figure out all the problems but Elon Musk and Peter Thiel/Palantir. Palantir who is now the biggest defense contractor for the CIA/NSA based on publicly available data on DOD contracts. Palantir for years has been a major defense contractor for the UK and recently got done shifting through all the data over at NHS England which Kier announced will be shutdown. Palantir which has contracts with Norway giving them full access to all the data coming out of their government and public surveillance programs. Palantir who works very closely with the IDF on their war in Gaza.",
                  "score": 7,
                  "created_utc": 1748129147.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mu2y78a",
          "author": "SorelyMissing1110",
          "body": "Every company should start specific depicting the “Trump Tax” in addition to sales tax and other fees",
          "score": 5,
          "created_utc": 1748126207.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtztcgv",
      "author": "None",
      "body": "[removed]",
      "score": 281,
      "created_utc": 1748087552.0,
      "replies": [
        {
          "id": "mtztv10",
          "author": "ToMorrowsEnd",
          "body": "they still are trying to convince people that.   The grift is strong with them.",
          "score": 49,
          "created_utc": 1748087790.0,
          "replies": []
        },
        {
          "id": "mu070pb",
          "author": "No-Bother6856",
          "body": "Or remember when they were saying the tariffs are going to hurt but its a good thing in the long run because it will shift buyers to buying American made goods... which only makes any sense at all if foreign made goods go up in price.",
          "score": 43,
          "created_utc": 1748093114.0,
          "replies": [
            {
              "id": "mu0k41m",
              "author": "zffjk",
              "body": "And also only works if American companies ignore their fiduciary responsibility to raise their prices to match the foreign ones. This was never going to work.",
              "score": 25,
              "created_utc": 1748097572.0,
              "replies": []
            },
            {
              "id": "mu2gmad",
              "author": "sarhoshamiral",
              "body": "Trump is also saying he want tariffs to replace taxes. Unfortunate he and his supporters lack the smarts to realize it can't do both.",
              "score": 6,
              "created_utc": 1748119903.0,
              "replies": []
            },
            {
              "id": "mu64nqn",
              "author": "nikhkin",
              "body": "Now everyone will shift to using American cameras like... errrm... I guess a Polaroid or a Go Pro (assuming they're even manufactured in the US, which seems doubtful).",
              "score": 1,
              "created_utc": 1748180463.0,
              "replies": [
                {
                  "id": "mud8vyq",
                  "author": "No-Bother6856",
                  "body": "I don't even think those are US manufactured. There is a company making surveillance cameras that are actually US manufactured but yeah... the US camera industry died decades ago.",
                  "score": 1,
                  "created_utc": 1748277760.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mu0f4ff",
          "author": "bassthrive",
          "body": "Mexico will pay for the wall 2.0",
          "score": 13,
          "created_utc": 1748095967.0,
          "replies": []
        },
        {
          "id": "mu0bo0d",
          "author": "Tommy__want__wingy",
          "body": "Eating the tariffs….for the economy….\n\nIsn’t that…communism???",
          "score": 5,
          "created_utc": 1748094775.0,
          "replies": []
        },
        {
          "id": "mu1ahzk",
          "author": "adamjfish",
          "body": "![gif](giphy|OlSUgQk2sIlTW)",
          "score": 7,
          "created_utc": 1748105952.0,
          "replies": []
        },
        {
          "id": "mu1as6t",
          "author": "pcm2a",
          "body": "Might be more accurate to say it is a full tax on the consumer, or a partial tax on the consumer and seller, or a tax on the seller.\n\nIf Nikkon can raise its prices by 30% and remain competitive, then pass that tax on to us. However, if Nikkon can only raise prices by 10% to remain competitive then they eat 20%. If Nikkon cannot raise prices at all to remain competitive, then they decide if it's worth eating it all, not selling the product, or building it here.\n\nThere is no formula that can be applied to all products and markets.",
          "score": 2,
          "created_utc": 1748106040.0,
          "replies": []
        },
        {
          "id": "mu0y51w",
          "author": "Stockengineer",
          "body": "It’s not a tax… it’s just cost increase 😂 \nYou’re trying to explain a concept to majority of Americans who don’t even know working overtime is still more money…. Not less \n\nOr like.. 1/3 > 1/4 burger 🍔\n\nCase in point… 13 people don’t even realize the tariff isn’t a tax on the customer… it indirectly increases costs as the importers cost increases… so it’s not a sales tax 😂",
          "score": -15,
          "created_utc": 1748101982.0,
          "replies": [
            {
              "id": "mu3z5ga",
              "author": "wkw3",
              "body": "Correct. We don't even get tax revenue on it. Just buy the new Zenith iFone, it has five apps already..",
              "score": 1,
              "created_utc": 1748140539.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mu0e0l9",
      "author": "ImAMindlessTool",
      "body": "“Hey, we’re raising prices ***next month*** - so get out there and pad our Q2!”\n\nPretty much every company with a global presence.",
      "score": 26,
      "created_utc": 1748095587.0,
      "replies": [
        {
          "id": "mu15yvf",
          "author": "cmaldrich",
          "body": "Yeah thought this would be higher up. First thing that came to my mind.",
          "score": 5,
          "created_utc": 1748104505.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtzw1hz",
      "author": "kevin7eos",
      "body": "Well, this sucks because you know once Nikon raises the price everyone will do the same next. The only good thing that’s gonna come out of it is the used market prices are going up to time to get selling soon.",
      "score": 71,
      "created_utc": 1748088767.0,
      "replies": [
        {
          "id": "mu02sta",
          "author": "ZappySnap",
          "body": "Sony already raised their prices.",
          "score": 32,
          "created_utc": 1748091528.0,
          "replies": [
            {
              "id": "mu0aiyw",
              "author": "DigitallyDetained",
              "body": "Except Sony raised their prices globally. Dick move.",
              "score": 34,
              "created_utc": 1748094377.0,
              "replies": []
            },
            {
              "id": "mu090p6",
              "author": "YoBoyDooby",
              "body": "Canon also publicly announced that they will be raising their prices due to the tariffs.",
              "score": 15,
              "created_utc": 1748093841.0,
              "replies": [
                {
                  "id": "mu0s9f2",
                  "author": "diamondintherimond",
                  "body": "US only or globally?",
                  "score": 4,
                  "created_utc": 1748100138.0,
                  "replies": [
                    {
                      "id": "mu1dgk9",
                      "author": "Farcespam",
                      "body": "Only global for the US cause they started a trade war with the world. But nations are pivoting away from trade with the US. It's mainly only going to have extremely longterm effects on the US.",
                      "score": -1,
                      "created_utc": 1748106884.0,
                      "replies": [
                        {
                          "id": "mu3gmz9",
                          "author": "jjayzx",
                          "body": "???",
                          "score": 9,
                          "created_utc": 1748133230.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mu0e3xq",
          "author": "ASK_ABT_MY_USERNAME",
          "body": "It's only good if you want to get out of photography as a hobby/profession",
          "score": 7,
          "created_utc": 1748095620.0,
          "replies": []
        },
        {
          "id": "mu0ncbb",
          "author": "PabloBablo",
          "body": "Here is another question. Assuming the next admin reduces Tarrifs...will they follow suit and drop prices accordingly? \n\n\nMy bigger fear amongst all this is that the companies Raise their prices because the blame will be on Trump,and no one will lower them when things get reversed ",
          "score": 4,
          "created_utc": 1748098601.0,
          "replies": [
            {
              "id": "mu0zaaq",
              "author": "vmxcd",
              "body": "Probably not, nothings really gone back to even near pre-covid prices even though their costs have fallen (not as far, but still a lot lower than the peak).",
              "score": 12,
              "created_utc": 1748102345.0,
              "replies": []
            },
            {
              "id": "mu0s5og",
              "author": "i7-4790Que",
              "body": "they can/will if the product market is competitive enough and it's built more heavily on volume sales.   Somebody who's thirsty for sales/marketshare is going to drop prices and potentially force the competition's hand.  \n\n\nSome markets where consumers/groups just mindlessly bear things, probably not.  Some of this ultimately does come down to the really really stupid consumer base we've cultivated today, and not just the corpos themselves.  \n\nAnd with how emotionally invested so many people are into owning certain brands and making everything they have some sort of status symbol.  Well. GFL.",
              "score": 4,
              "created_utc": 1748100106.0,
              "replies": []
            },
            {
              "id": "mu1sct3",
              "author": "qazxdrwes",
              "body": "No because the underlying logistics network will change to optimize for this new reality, and changing logistics to optimize for a different reality costs money.\n\nLet's say that you're an American manufacturer that uses some imported parts.\n\nEven if tariffs were dropped, maybe your former foreign supplier went out of business and you're stuck with the new supplier. And maybe, your new supplier now has no competition, and they decide they can increase their prices by 10%. Maybe your old supplier still exists, but shipping has lost some efficiency and now costs more.\n\nObviously there is a fuck ton of nuance, but prices will remain higher until the market has years of stability to reach an equilibrium again.",
              "score": 4,
              "created_utc": 1748111628.0,
              "replies": []
            },
            {
              "id": "mu0sjgi",
              "author": "TomTomMan93",
              "body": "This is what will happen. Could be a shining moment where suddenly the rest of the gov turns on the guy and ousts him, there won't be anything to keep these companies from having inflated prices. They might lower them a bit but never what they were before. Probably will even say \"oh we need to recoup the money lost from those awful, awful trump tariffs. You understand, I'm sure. Aren't you so happy we all stood together against that bad man?\" \n\nIt's a pump and dump, man.",
              "score": 3,
              "created_utc": 1748100227.0,
              "replies": []
            },
            {
              "id": "mu1934q",
              "author": "Hashabasha",
              "body": "if demand is hit, then yes they might reroll the prices.",
              "score": 3,
              "created_utc": 1748105505.0,
              "replies": []
            },
            {
              "id": "mu3qjnn",
              "author": "LineRex",
              "body": "> Here is another question. Assuming the next admin reduces Tarrifs...will they follow suit and drop prices accordingly? \n\nit depends on if the market will bear the higher prices. Price is determined by cost + markup, and if they can make more money by lowering prices then they'll lower the markup.",
              "score": 1,
              "created_utc": 1748137092.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mu4ti86",
          "author": "obelix_dogmatix",
          "body": "Did you even read the article? Sony has already raised the prices and Canon already announced same.",
          "score": 1,
          "created_utc": 1748155891.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtzr1dd",
      "author": "TheITMan19",
      "body": "![gif](giphy|h7poIVSJYrs323ZPuu)",
      "score": 85,
      "created_utc": 1748086458.0,
      "replies": []
    },
    {
      "id": "mu0zmlv",
      "author": "alejandroc90",
      "body": "It's sad that even if the tariffs are gone the prices won't go down.",
      "score": 12,
      "created_utc": 1748102453.0,
      "replies": []
    },
    {
      "id": "mu08biq",
      "author": "chostax-",
      "body": "lol , I’m sure they’ll only raise prices in the USA. Things are going up in price here in Canada as well with no justification other than tariffs, even though the products have nothing to do with the US.\n\nFuck the American people for voting this guy in.",
      "score": 41,
      "created_utc": 1748093588.0,
      "replies": [
        {
          "id": "mu0bkv3",
          "author": "LostTheGameOfThrones",
          "body": "As has already been said in another comment, Sony have already confirmed their price rises will be global. America covers itself in shit, so the rest of us have to be covered too. Cheers, lads, nice one!",
          "score": 23,
          "created_utc": 1748094744.0,
          "replies": [
            {
              "id": "mu0cqq4",
              "author": "chostax-",
              "body": "Pretty much yup. If they don’t they’re just missing out of profits. What would stop me from buying a bunch of stock in Canada then driving over and selling them in the states for cash on the secondary market?",
              "score": 2,
              "created_utc": 1748095147.0,
              "replies": [
                {
                  "id": "mu1cys6",
                  "author": "Illustrious-Cookie73",
                  "body": "What would stop you?  I was led to believe that they will stop you at the border and collect the tariff from you if you want to bring it in.  I hope I’m wrong on this, but can’t find a definitive answer.",
                  "score": 10,
                  "created_utc": 1748106729.0,
                  "replies": [
                    {
                      "id": "mu389dh",
                      "author": "chostax-",
                      "body": "Yes probably but low chance they even check you",
                      "score": 1,
                      "created_utc": 1748129987.0,
                      "replies": [
                        {
                          "id": "mu4v8aa",
                          "author": "ShatterSide",
                          "body": "They were checking and catching people with eggs at the Mexican border.\n\n\nIf you have a ton of boxes in your car I can guarantee you're way more likely to be pulled aside.",
                          "score": 4,
                          "created_utc": 1748156910.0,
                          "replies": [
                            {
                              "id": "mucsg8o",
                              "author": "chostax-",
                              "body": "Mexican border vs Canadian border are very different…much less scrutiny, especially if you’re an American coming back in.",
                              "score": 2,
                              "created_utc": 1748272780.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mu15yj6",
          "author": "SupMonica",
          "body": "> Fuck the American people for voting this guy in.\n\nAnd by proxy, the millions that didn't even bother voting in the first place. Collectively there was an opportunity to not let that clown in, and they didn't do it.\n\nI get that Kamala Harris was no peach, but come on. She would have done better than what is currently there. Even if she was doing nothing at all, and posting on Instagram all day, would be progress.",
          "score": 5,
          "created_utc": 1748104502.0,
          "replies": []
        },
        {
          "id": "mu0kdg1",
          "author": "ExtremeCreamTeam",
          "body": "> lol , I’m sure they’ll only exude prices in the USA.\n\nExude? I can't even image what you meant to say, but since the only logical word I can think of that should be there is \"raise\", I'm not sure you can even blame autocorrect on this one.",
          "score": -3,
          "created_utc": 1748097655.0,
          "replies": [
            {
              "id": "mu0kz5v",
              "author": "chostax-",
              "body": "I use swipe text lol, definitely meant raise.",
              "score": 3,
              "created_utc": 1748097849.0,
              "replies": [
                {
                  "id": "mu1fhkc",
                  "author": "ExtremeCreamTeam",
                  "body": "I'm finna buss",
                  "score": 0,
                  "created_utc": 1748107522.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mtzv42p",
      "author": "ARobertNotABob",
      "body": "Donald \"This is why Americans can't have nice things\" Trump has a lot to answer for.",
      "score": 18,
      "created_utc": 1748088358.0,
      "replies": [
        {
          "id": "mu0b4wj",
          "author": "LostTheGameOfThrones",
          "body": "Blaming it all on Trump isn't going to solve the problem once his term is up. He said he'd do this and people still voted for him, whilst enthusiastically cheering for these very tariffs.",
          "score": 10,
          "created_utc": 1748094588.0,
          "replies": [
            {
              "id": "mu2imug",
              "author": "ultrahello",
              "body": "The problem is what’s called “intractable”. The stupid people that voted for him can’t be convinced they are stupid. And, *Idiocracy8 is right on the money: stupid breeds more stupid, exponentially. Once the victimization infects the host, it’s over. To them, all of their problems are caused by other people and the ego won’t let counter-information in. This gets passed directly to the children during their “accept all info” age and becomes ingrained. The only solution is to split the nation to quarantine the infection then reunite when the fever is over. Else, they will end up taking all of us down with them.",
              "score": 2,
              "created_utc": 1748120583.0,
              "replies": []
            },
            {
              "id": "mu0g2t4",
              "author": "mr_biteme",
              "body": "The problem is all, we don’t know if this is his last term????  Not like the orange child hasn’t been hinting at that….🤦‍♂️",
              "score": 3,
              "created_utc": 1748096284.0,
              "replies": [
                {
                  "id": "mu0m5xx",
                  "author": "LostTheGameOfThrones",
                  "body": "I'd argue that the real problem is that you've got a not-insignificant portion of your population who are still voting for the fella.",
                  "score": 5,
                  "created_utc": 1748098228.0,
                  "replies": [
                    {
                      "id": "mu2isd1",
                      "author": "ultrahello",
                      "body": "Losing their farms but still would vote again for him because they have zero ability for self-reflection, humility, and critical thinking.",
                      "score": 5,
                      "created_utc": 1748120635.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mu19oqy",
                  "author": "AyyyyLeMeow",
                  "body": "no the problem is that Vance is even worse. Yeah, believe it or not...",
                  "score": 1,
                  "created_utc": 1748105695.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mu0uyhd",
      "author": "tsalyers12",
      "body": "![gif](giphy|ZibJA6DNxsOuk2Q8pp|downsized)",
      "score": 4,
      "created_utc": 1748100984.0,
      "replies": []
    },
    {
      "id": "mu0d718",
      "author": "_WRY_",
      "body": "noooo I wanted a zF",
      "score": 3,
      "created_utc": 1748095303.0,
      "replies": [
        {
          "id": "mu36cv3",
          "author": "REVIGOR",
          "body": "It was on sale on the Nikon refurbished page a day or two ago",
          "score": 1,
          "created_utc": 1748129269.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mu1cc0n",
      "author": "FoxFisher",
      "body": "I don’t get how Trump didn’t get how this works. Yes in the end goverment gets more money from tariffs but your citizens pay more money to imported goods too… so you are effectively taxing your own people in a different way.",
      "score": 3,
      "created_utc": 1748106530.0,
      "replies": []
    },
    {
      "id": "mu0018j",
      "author": "hmmm_",
      "body": "You get a free trip to Europe if you buy all your gadgets while on holidays.",
      "score": 5,
      "created_utc": 1748090449.0,
      "replies": [
        {
          "id": "mu0aeq8",
          "author": "DigitallyDetained",
          "body": "You realize you still need to pay the taxes on that stuff when you get back, right? Pretty sure failure to do so is a felony.",
          "score": -15,
          "created_utc": 1748094335.0,
          "replies": [
            {
              "id": "mu0amnm",
              "author": "Wise_Composer_2661",
              "body": "How in the world would they know you bought it while your there unless you packed your receipt with you",
              "score": 16,
              "created_utc": 1748094412.0,
              "replies": [
                {
                  "id": "mu0chah",
                  "author": "DigitallyDetained",
                  "body": "That doesn’t make it legal",
                  "score": -18,
                  "created_utc": 1748095057.0,
                  "replies": [
                    {
                      "id": "mu0fqym",
                      "author": "fla_john",
                      "body": "Turns out laws don't matter! Fun!",
                      "score": 11,
                      "created_utc": 1748096175.0,
                      "replies": []
                    },
                    {
                      "id": "mu0ct2v",
                      "author": "Wise_Composer_2661",
                      "body": "None of the stuff our president is doing is legal so follow his example",
                      "score": 20,
                      "created_utc": 1748095170.0,
                      "replies": []
                    },
                    {
                      "id": "mu0guoo",
                      "author": "dandroid126",
                      "body": "And yet no one cares except you. \n\nSeriously, this is the kind of law that people break as casually as speeding on public roads. Yes, it's illegal, but it's widely unenforced, and everyone does it. \n\nThe purpose of this law is to stop people/companies from doing this and having a competitive advantage when re-selling the items they purchased elsewhere. If you aren't doing that, then no one is going to come after you. \n\nBesides, I believe the law has wording in it that this only applies if you purchase more than some dollar amount of stuff. If you are doing this only for yourself, then I doubt you could even hit that dollar amount (whatever it may be).",
                      "score": 6,
                      "created_utc": 1748096534.0,
                      "replies": [
                        {
                          "id": "mu32yjb",
                          "author": "Perfect_Opinion7909",
                          "body": "„As above so below.“\n\nAnd still people say Trump doesn’t represent the USA. QED.",
                          "score": 0,
                          "created_utc": 1748127999.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mu40d6f",
                      "author": "wkw3",
                      "body": "The felon-in-chief has declared crime season.",
                      "score": 1,
                      "created_utc": 1748141036.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mu0f6ey",
              "author": "TropeSage",
              "body": ">[$800 Exemption](https://www.cbp.gov/travel/international-visitors/kbyg/types-exemptions)\n\n>If you are arriving from anywhere other than a U.S. insular possession (U.S. Virgin Islands, American Samoa, or Guam) you may bring back $800 worth of items duty free, as long as you bring them with you. This is called accompanied baggage.\n\nThere is a 800 dollar duty exemption for most of the world as long as you don't travel to frequently.",
              "score": 4,
              "created_utc": 1748095985.0,
              "replies": [
                {
                  "id": "mu0fhm3",
                  "author": "Cookie_505",
                  "body": "A camera is likely more than that though. Some lenses aren't but even the. I hate this hobby lol so expensive.",
                  "score": 4,
                  "created_utc": 1748096089.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mu0d2u3",
      "author": "th3darklady21",
      "body": "My hubby just bought a d850 with plans to purchase some high end lens and I had planned to purchase a few lens in the coming months to round out my kit.",
      "score": 2,
      "created_utc": 1748095264.0,
      "replies": []
    },
    {
      "id": "mu16dv3",
      "author": "Ok-Interaction-8917",
      "body": "I only buy used because prices are already steep. Way to go on making it unaffordable orange asshole. I will be selling used gear in a month.",
      "score": 2,
      "created_utc": 1748104640.0,
      "replies": []
    },
    {
      "id": "mu1vvxe",
      "author": "patrickw234",
      "body": "I’m sure prices will go back down once the tariffs go away…..right?……",
      "score": 2,
      "created_utc": 1748112801.0,
      "replies": []
    },
    {
      "id": "mu0at6x",
      "author": "Lucky_Cry_2302",
      "body": "Thank your God Trump, republicans",
      "score": 4,
      "created_utc": 1748094474.0,
      "replies": []
    },
    {
      "id": "mu1aawo",
      "author": "Jujubatron",
      "body": "Good. Americans deserve that.",
      "score": 3,
      "created_utc": 1748105890.0,
      "replies": []
    },
    {
      "id": "mu35hed",
      "author": "perverseintellect",
      "body": "I love it. Americans are stupid enough to reward a corrupt, authoritarian, white supremacist and they won't learn from their mistake unless they are punished like this. Keep raising the prices.",
      "score": 2,
      "created_utc": 1748128939.0,
      "replies": [
        {
          "id": "mu5dt8c",
          "author": "Repulsive_Mud_567",
          "body": "10 upvotes from me.",
          "score": 2,
          "created_utc": 1748168267.0,
          "replies": []
        },
        {
          "id": "muf6rt3",
          "author": "celisum",
          "body": "See that’s a stupid statement, because not only are you denigrating an entire group of people who’s motivations you can’t simply boil down to simple hatr d, but also because if the tariffs have already gone into effect why would Nikon wait? Haven’t the price for them already gone up to sellin the USA? It’s like they’re playing a game and the game is to charge consumers more and then blame the scapegoat in the media for all your problems, not the fact that the execs made a conscious decision to raise the price rather than make less money.",
          "score": 0,
          "created_utc": 1748299763.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mu18jiu",
      "author": "HellP1g",
      "body": "Expensive hobby getting even more expensive. My X-T30 needs to be repaired ($620) and I need a better lens. I was looking around for a replacement, but with these price hikes I just might go the repair route. \n\nI really hate paying half the cost of what I bought it for just for a repair, but it might be the cheaper option",
      "score": 1,
      "created_utc": 1748105334.0,
      "replies": [
        {
          "id": "mu36fm5",
          "author": "REVIGOR",
          "body": "Or, buy before prices increase",
          "score": 1,
          "created_utc": 1748129298.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzhr0is",
      "author": "play_destiny",
      "body": "Once they raised the prices, don't think it will come back down even without tariffs.",
      "score": 1,
      "created_utc": 1750763684.0,
      "replies": []
    },
    {
      "id": "mu0jhh4",
      "author": "whlthingofcandybeans",
      "body": "Are they announcing this as a sales tactic?",
      "score": 1,
      "created_utc": 1748097375.0,
      "replies": []
    },
    {
      "id": "mu1jk4q",
      "author": "EfficientAccident418",
      "body": "As if Nikon isn't already overpriced...",
      "score": 1,
      "created_utc": 1748108791.0,
      "replies": []
    },
    {
      "id": "mu1zzjp",
      "author": "LinkedInParkPremium",
      "body": "Hey babe wake up new tariffs just dropped.",
      "score": 1,
      "created_utc": 1748114179.0,
      "replies": []
    },
    {
      "id": "mu1ggw7",
      "author": "TheJasonaut",
      "body": "It’d be REAL COOL if there were incentives or programs to bring plants/manufacturing to the US instead of just BOOM TARIFFS! It will and is changing some companies strategies, but just the most surface level, petty way to ‘encourage’ it.",
      "score": 0,
      "created_utc": 1748107824.0,
      "replies": []
    },
    {
      "id": "mu2z23l",
      "author": "One-Outside",
      "body": "Can we all just please collectively come together and stop buying stuff until this shit ends?",
      "score": 0,
      "created_utc": 1748126533.0,
      "replies": [
        {
          "id": "mu33qdh",
          "author": "None",
          "body": "[removed]",
          "score": 3,
          "created_utc": 1748128285.0,
          "replies": [
            {
              "id": "mu5dvad",
              "author": "Repulsive_Mud_567",
              "body": "Exactly!!!",
              "score": 1,
              "created_utc": 1748168302.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mu3hx9f",
      "author": "hbracerjohn1",
      "body": "Who cares",
      "score": -6,
      "created_utc": 1748133735.0,
      "replies": [
        {
          "id": "mu4894k",
          "author": "reddithater212",
          "body": "People who buy Nikons… People who work for Nikon… share holders.",
          "score": 3,
          "created_utc": 1748144547.0,
          "replies": []
        },
        {
          "id": "mu5dr0x",
          "author": "Repulsive_Mud_567",
          "body": "They make scientific and healthcare instruments too. So maybe you should care a little. 🤷‍♂️",
          "score": 5,
          "created_utc": 1748168230.0,
          "replies": []
        },
        {
          "id": "mu66dm2",
          "author": "tdstooksbury",
          "body": "Don’t be so dense. You know people care.",
          "score": 1,
          "created_utc": 1748181061.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mu789iq",
      "author": "None",
      "body": "Cool fuck Nikon, they have been fucking over there technicians with insane work schedules for years. Garbage corporation",
      "score": -1,
      "created_utc": 1748192768.0,
      "replies": []
    },
    {
      "id": "mu0gpyx",
      "author": "slavaMZ",
      "body": "r/unpopularopinion iPhone better than any Nikon",
      "score": -17,
      "created_utc": 1748096492.0,
      "replies": [
        {
          "id": "mu1dq50",
          "author": "anywhereanyone",
          "body": "What an idiotic statement.",
          "score": 5,
          "created_utc": 1748106967.0,
          "replies": []
        },
        {
          "id": "mu0ko3i",
          "author": "mastersplinteremover",
          "body": "In some ways. Sure. It’s a great camera for snapshots and the automatic image processing is everything most people want without having to process themselves. \n\nIt does not *yet* compare to the image quality and control you get out of mirrorless or dslr with a good lens.",
          "score": 3,
          "created_utc": 1748097750.0,
          "replies": [
            {
              "id": "mu1jrgr",
              "author": "slavaMZ",
              "body": "That’s why it’s an unpopular opinion. For non photographers it’s definitely better because we don’t all the functionality yet it’s always on you cause it’s a phone.",
              "score": -5,
              "created_utc": 1748108855.0,
              "replies": [
                {
                  "id": "mu2sdzh",
                  "author": "suffaluffapussycat",
                  "body": "As an ex-pro photographer, yes.\n\nMy iPhone is nowhere near as good as my DSLR, but the iPhone is the best thing to happen to photography *for the casual user*.\n\nGo back to the ‘90s and look at non-pro snapshots. Not so good usually.\n\nBut the feedback loop has been shortened into non-existence.",
                  "score": -1,
                  "created_utc": 1748124041.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mtzvwwy",
      "author": "texasconnection",
      "body": "Nikon? What do they sell?\n\nJust kidding, but honestly who cares I haven’t bought a camera since cell phones cameras became a thing",
      "score": -69,
      "created_utc": 1748088711.0,
      "replies": [
        {
          "id": "mtzwron",
          "author": "agms10",
          "body": "The incredibly large number of photographers. I think they care.",
          "score": 33,
          "created_utc": 1748089081.0,
          "replies": []
        },
        {
          "id": "mtzxxls",
          "author": "Tomacz",
          "body": "\nThey make* a lot of equipment used in medical and manufacturing fields as well.\n\nhttps://www.nikon.com/business/\n\nThe company I work for uses Nikon optical measuring equipment in our quality department.\n\nAlso photographers are still a thing. Nikon makes excellent cameras and lenses\n\nEdit: Make, not made. They still do",
          "score": 12,
          "created_utc": 1748089581.0,
          "replies": []
        },
        {
          "id": "mtzx0c3",
          "author": "None",
          "body": "[deleted]",
          "score": 21,
          "created_utc": 1748089185.0,
          "replies": [
            {
              "id": "mtzxo2d",
              "author": "Most_Technology557",
              "body": "Not to mention the impact on workers, the economy, and the fact that it specifically blames tariffs.",
              "score": 7,
              "created_utc": 1748089469.0,
              "replies": []
            },
            {
              "id": "mtzym2n",
              "author": "texasconnection",
              "body": "This showed up In my feed, so I responded, if it didn’t I would not have know or cared.\n\nBut I do understand that yes prices will increase with tariffs, I don’t need to see an article for every company or product that going to raise prices.",
              "score": -27,
              "created_utc": 1748089867.0,
              "replies": [
                {
                  "id": "mu01pvi",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 9,
                  "created_utc": 1748091107.0,
                  "replies": [
                    {
                      "id": "mu0kwmx",
                      "author": "AutistcCuttlefish",
                      "body": ">A large portion of the country doesn't believe it. The reminder is necessary.\n\nThe portion of the country that doesn't believe it is either never gonna see these reminders or will refuse to believe them and instead make up some persecution complex conspiracy theory as an alternative explanation and dismiss the reminders entirely.",
                      "score": 0,
                      "created_utc": 1748097826.0,
                      "replies": [
                        {
                          "id": "mu0m37p",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 2,
                          "created_utc": 1748098204.0,
                          "replies": [
                            {
                              "id": "mu0o1to",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 0,
                              "created_utc": 1748098821.0,
                              "replies": [
                                {
                                  "id": "mu0q9jt",
                                  "author": "None",
                                  "body": "[deleted]",
                                  "score": 0,
                                  "created_utc": 1748099516.0,
                                  "replies": [
                                    {
                                      "id": "mu0r6ek",
                                      "author": "None",
                                      "body": "[deleted]",
                                      "score": 0,
                                      "created_utc": 1748099802.0,
                                      "replies": [
                                        {
                                          "id": "mu0utvm",
                                          "author": "None",
                                          "body": "[deleted]",
                                          "score": 0,
                                          "created_utc": 1748100944.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mtzy71m",
          "author": "ThisTookSomeTime",
          "body": "Also a bunch of microscopes, industrial imaging tech, robotics and even metal 3D printing. You might not be buying anything from them but they’re still a part of domestic healthcare, industry and manufacturing.",
          "score": 6,
          "created_utc": 1748089692.0,
          "replies": []
        },
        {
          "id": "mtzxxxm",
          "author": "Mister_Eyebrows",
          "body": "Wedding and graduation photographers, media journalists, or even hobbyists. Y’know, people who use high-quality cameras daily.",
          "score": 4,
          "created_utc": 1748089585.0,
          "replies": []
        },
        {
          "id": "mu0b9cd",
          "author": "LostTheGameOfThrones",
          "body": "\"It doesn't impact me so it doesn't matter.\"\n\nPhotography is still a massive hobby that tonnes of people still love.",
          "score": 3,
          "created_utc": 1748094631.0,
          "replies": []
        },
        {
          "id": "mu0aqk9",
          "author": "bi7worker",
          "body": "“It doesn’t affect me directly so I don’t care”. The new American way.",
          "score": 2,
          "created_utc": 1748094450.0,
          "replies": []
        },
        {
          "id": "mu07mgj",
          "author": "No-Bother6856",
          "body": "Cell phone cameras are convenient but they are not a replacement for an actual camera. The performance difference is still enormous",
          "score": 1,
          "created_utc": 1748093334.0,
          "replies": []
        },
        {
          "id": "mu410y8",
          "author": "wkw3",
          "body": "I certainly don't care that you haven't recently purchased a camera.",
          "score": 1,
          "created_utc": 1748141311.0,
          "replies": []
        }
      ]
    }
  ]
}