{
  "post": {
    "title": "Google Unveils Mixed-Reality Headset With Samsung, Taking on Apple and Meta",
    "author": "DarthBuzzard",
    "id": "1hcprif",
    "score": 246,
    "created_utc": 1734023157.0,
    "selftext": "",
    "num_comments": 62,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hcprif/google_unveils_mixedreality_headset_with_samsung/"
  },
  "comments": [
    {
      "id": "m1px8bz",
      "author": "Patrickk_Batmann",
      "body": "8 months from now, “Google ends AR headset partnership with Samsung, discontinues hardware and software support”",
      "score": 360,
      "created_utc": 1734023806.0,
      "replies": [
        {
          "id": "m1r31zb",
          "author": "pafrac",
          "body": "8 months? Seems a bit hopeful ... In Google time that's a product lifecycle and a half.",
          "score": 21,
          "created_utc": 1734036737.0,
          "replies": []
        },
        {
          "id": "m1pxfqr",
          "author": "New_Edens_last_pilot",
          "body": "I still miss project ara.",
          "score": 34,
          "created_utc": 1734023870.0,
          "replies": [
            {
              "id": "m1qlet2",
              "author": "boobyginga22",
              "body": "I still think about that all the time too. Maybe Framework will recreate it someday… ):",
              "score": 10,
              "created_utc": 1734031239.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1rax3j",
          "author": "MrFIXXX",
          "body": "This. 98% certainty and maybe later than months - up to 2 years.",
          "score": 13,
          "created_utc": 1734039156.0,
          "replies": []
        },
        {
          "id": "m1rv8rf",
          "author": "correctingStupid",
          "body": "Yeah I'm not buying a single fucking thing Google anymore",
          "score": 14,
          "created_utc": 1734045965.0,
          "replies": [
            {
              "id": "m1tlq4g",
              "author": "Navetoor",
              "body": "This will be the best AR/VR headset when it releases.",
              "score": 3,
              "created_utc": 1734070868.0,
              "replies": [
                {
                  "id": "m1trwot",
                  "author": "speculatrix",
                  "body": "It's potentially the best, but it might be short lived, if Google abandon it. Remember their game streaming service? \n\nAnd more. https://killedbygoogle.com/",
                  "score": 9,
                  "created_utc": 1734074512.0,
                  "replies": [
                    {
                      "id": "m1ts6pv",
                      "author": "Navetoor",
                      "body": "I’ve never used a Google product that got “killed” so I couldn’t care less.",
                      "score": -10,
                      "created_utc": 1734074685.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m1qtp12",
          "author": "charlesdarwinandroid",
          "body": "Samsung ships more android devices than any other company.  It's in both of their best interests to work together and to get this right.",
          "score": 12,
          "created_utc": 1734033814.0,
          "replies": [
            {
              "id": "m1sd21s",
              "author": "Far-in-a-car",
              "body": "Yeah and Samsung is really killing it right now 🙄",
              "score": 3,
              "created_utc": 1734052449.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1xzf7f",
          "author": "2001zhaozhao",
          "body": "This is too real. After killing their Android tablet line they immediately announce new Android VR project lol",
          "score": 2,
          "created_utc": 1734135127.0,
          "replies": []
        },
        {
          "id": "m1s3s4m",
          "author": "FungZhi",
          "body": "Every idea or prototype from google",
          "score": 4,
          "created_utc": 1734049053.0,
          "replies": []
        },
        {
          "id": "m1tlrtn",
          "author": "Navetoor",
          "body": "Dang this is so original",
          "score": -1,
          "created_utc": 1734070893.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1qaxpi",
      "author": "rabbi_glitter",
      "body": "There is absolutely no reason for me to be interested in this, as googles track record of product support is terrible.",
      "score": 76,
      "created_utc": 1734028023.0,
      "replies": []
    },
    {
      "id": "m1qdswd",
      "author": "MadOrange64",
      "body": "*Google after two days of support*\n\n![gif](giphy|VtrpaXoiJH8xPtok2P|downsized)",
      "score": 84,
      "created_utc": 1734028899.0,
      "replies": []
    },
    {
      "id": "m1qtzpg",
      "author": "None",
      "body": "Taking on Meta, that has mixed reality and whole ass VR, with only mixed reality? Good fucking luck.\n\nEdit; my app has a fucking meta quest 3 ad pinned to the top of this. Google ain’t competing with shit lmao",
      "score": 22,
      "created_utc": 1734033910.0,
      "replies": [
        {
          "id": "m1r7y4j",
          "author": "Atoning_Unifex",
          "body": "The ironic part... Who's API do you think sourced and displayed that ad?",
          "score": 7,
          "created_utc": 1734038231.0,
          "replies": []
        },
        {
          "id": "m20satk",
          "author": "googler_ooeric",
          "body": "XR = VR and AR. AndroidXR supports tracked controllers, and ggodin is already working on Virtual Desktop for it. I think it's safe to say that it's gonna support VR gaming",
          "score": 1,
          "created_utc": 1734187892.0,
          "replies": [
            {
              "id": "m20z8e3",
              "author": "None",
              "body": "It doesn’t sound like that safe of a thing to assume. Or at least, it depends how you define “supporting VR”. \n\nMy assumption is it will be similar to Apple Vision. Sure, it *supports* VR, the games will run, but it’s not designed for it so there’s no controllers for it. That’s gonna kill the actual practicality of playing. \n\nIf Google figures out how to make controllers that are good for gaming without being to scary or complicated for Sheryl in accounting to use for her virtual desktop, then they’ll be…exactly in the same place as Meta is with the Quest 3? \n\nThat is, it’s selling, but not at the rate it’s supposed to. And the people who buy it use it for a year or so and then there’s widespread user reports here on Reddit of the headsets collecting dust.\n\nGoogle has a lot of work to do that so far several other companies have tried and are failing to get it off the ground level.",
              "score": 1,
              "created_utc": 1734190495.0,
              "replies": [
                {
                  "id": "m226f8d",
                  "author": "DesomorphineTears",
                  "body": "Google isn't shipping first party hardware, they want other companies to use Android on their headset.\n\n\nThis Samsung headset will have controllers, it is for gaming as well.",
                  "score": 3,
                  "created_utc": 1734205271.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m1tlyiy",
          "author": "Navetoor",
          "body": "The OS is already more feature rich than Meta’s lol",
          "score": -1,
          "created_utc": 1734071000.0,
          "replies": [
            {
              "id": "m1tq675",
              "author": "None",
              "body": "Who gives a fuck about OS when you can use Steamlink to play your entire VR library from your PC? You think anyone cares about the shitty free apps that come pre installed on *any* device? \n\nDon’t get me wrong, I know the Quest isn’t the best headset on the market, but anyone developing on mixed only is developing a product that has no market of value. They’re making a novelty device that will be scrapped. Companies can’t even get gamers onboard with VR, how the hell are they going to build an entire consumer base for an uncomfortable mask that does half the shit your phone does?",
              "score": 8,
              "created_utc": 1734073452.0,
              "replies": [
                {
                  "id": "m1tr9ls",
                  "author": "Navetoor",
                  "body": "Gaming is not the VR killer app lol that’s also not how you win mainstream.",
                  "score": 1,
                  "created_utc": 1734074117.0,
                  "replies": [
                    {
                      "id": "m1uoow1",
                      "author": "None",
                      "body": "It’s everyone’s foot in the door and it’s what will drive the technology the fastest. The fact that they’re developing AR instead of VR does kinda show they’ve failed to tap into the segmented market of gamers.\n\nIt’s not that I think gamers are the key to mainstream, because you’re right; they’re not. It’s that gamers, as a community, are not shy of new tech, and are very often early adopters. They’re the most easy to sell on new shit, and they can’t even tap *that* market. Even now that Quest is the cost of a Switch, no one cares about VR/AR - the quest does both, and not very many people know how the OS feels, because not very many people bought it, or any other headset for that matter.\n\nIf they can’t get tech savvy, early adopters to get onboard, how are they gonna sell it to Cheryl down the street? There’s no practical use. \n\nThe absolute best they can hope for is the same direction Meta is now leaning with their quest - after failing to capture gamers/actual users - “enterprise app suites”, business-friendly apps that somehow try and make augmented or virtual reality meetings desirable, even tho still to date no company makes a headset that’s comfortable to wear for 60min at a time, let alone a full day of meetings.\n\nA laptop does everything a business meeting needs. Can be projected or streamed to be viewed easily and comfortably by everyone.\n\nI bring up gaming so much because it’s the niche market for the niche product. Businesses don’t need power point to be a fully immersive experience in order to better enjoy the actuarial graphs that Steve made. So what’s the niche that makes AR even remotely appetizing to buy into when Office 365 already has so many competing products that are more accessible and significantly more practical on a computer than a headset?",
                      "score": 1,
                      "created_utc": 1734094669.0,
                      "replies": [
                        {
                          "id": "m1yxyzn",
                          "author": "pahamack",
                          "body": "I'm not sure if any of what you said is true about \"gamers are very often the early adopters\".\n\nWas it gamers who bought the first smartphones?\n\nI'd argue it was business users who drove sales of those old Nokia phones that ran on Symbian and, especially all those Blackberrys.\n\nYou scoff at the business use case but we don't actually know that until the product becomes good enough for that use case. Those early smartphones were pretty shitty too. You're on the right track with what are essentially zoom calls, but imagine being able to put up a whole trade show or showroom in a virtual space, with live vendors all using glasses that are just a little bigger than some ray-bans.\n\nThat's the future these guys think they'll be able to deliver on. Meta isn't a gaming company. What they are foreseeing are tools for connecting people, especially people that want to sell stuff.",
                          "score": 1,
                          "created_utc": 1734149465.0,
                          "replies": [
                            {
                              "id": "m1zcxi9",
                              "author": "None",
                              "body": "Sorry, I guess maybe it’s not clear, I meant in gaming. Gamers are early adopter in gaming-tech, because that’s their market. This is evidenced by the volume of preorder sales. Additionally, the gaming market buys into the latest and greatest pc components and monitors and TVs and sound systems.\n\nSo I’m not talking about smartphones. I’m talking about who is interested in immersive experiences, and that’s gamers. There isn’t any other large scale market I can think of that is so digitally plugged in and ready to be immersed in digital-living, which is the aim of mixed reality.\n\nGamers are blood thirst for new tech. They crave immersion and highly palpable experiences that feel tangential. They should have been easily sold on VR and mixed reality. But Google canceled Google glasses nearly 10 years ago because mixed reality didn’t grasp a wide audience. And, again, meta is now leaning heavily into business suite products because their first attempt at gamers also isn’t panning out like they hoped when they bought out oculus in the first place.",
                              "score": 1,
                              "created_utc": 1734157384.0,
                              "replies": [
                                {
                                  "id": "m218j8j",
                                  "author": "pahamack",
                                  "body": "i'd argue that business and social use is always the endgame for meta, and going into games is just something to justify keeping on throwing money at oculus and VR tech in general.\n\n  \nsome years ago Meta threw a bunch of money to buy a company developing lifelike, realistic avatars. i'm sure the use case for games is there but even more so for social and business use.\n\n  \nThey're not a gaming company. The business is built around connecting people and exploiting user data in a variety of ways.",
                                  "score": 1,
                                  "created_utc": 1734193748.0,
                                  "replies": [
                                    {
                                      "id": "m21wldv",
                                      "author": "None",
                                      "body": "I agree completely and will piggy back by saying, Google and Samsung are also not gaming companies. Which is why I don’t think VR is their focus. Because it isn’t. It’s not trying to be. I just think that VR and gaming is the only way to get that tech off the ground in order to make it more accessible to a wider audience. I truly feel that gamers *should* be the market for R&D. I just don’t see any practical use for business suite apps that will result in a sustainable product for longer than 2 years, just like many of Googles other scrapped innovations. They couldn’t even get AR eye glasses off the ground and they think people will want a whole ass mask?\n\nIt’s just silly. The only people asking for full immersion are gamers, and no serious contender is pumping into that on the scale required to get it off the ground. Meta has done the best so far, but it seems like they’re waning now.",
                                      "score": 1,
                                      "created_utc": 1734201904.0,
                                      "replies": [
                                        {
                                          "id": "m21xnbi",
                                          "author": "pahamack",
                                          "body": "The whole ass mask is not the final form.\n\nThese are intermediary products. That’s why these companies are focusing on AR rather than VR. The goal is to make them look like a pair of shades or glasses.\n\nIMO it’s going to take a long time but they’ll eventually get there. It’s inevitable: more jobs are being done from home. More shopping is being done from home. Lots of blue collar jobs are going to be taken over by robots.\n\nThings like meetings, but also things like art galleries, trade shows, museums, markets will start having virtual versions when these things get the actually good version just like the first iphone, just like how smartphones were kind of a niche thing then blew up.\n\nTechnically speaking, maybe cloud computing is the answer. Get all the heavy workload out of the device and just hook it up to the internet.",
                                          "score": 1,
                                          "created_utc": 1734202263.0,
                                          "replies": [
                                            {
                                              "id": "m21z1ma",
                                              "author": "None",
                                              "body": "I’m all for the tech, don’t get me wrong, it just seems to me to have been shown over the last 10 years that the general public are not quick to jump onboard with augmented reality stuff, stemming back from the Google glasses flop.\n\nMeanwhile you have a market that’s itching to buy products that would further the research they need to accomplish in order to achieve mass market appeal for things like Google glasses, and all that market wants is games to look more like Half Life Alyx. Instead, they keep getting shitty ports like Skyrim that have so much aliasing it’s unplayable without mods. \n\nBut if they produced more high fidelity, high performing gaming experiences, they’d have a market ready and willing to buy every game released at full price and preordered (I’m not a preorderer, but again, this market speaks for itself). They could develop everything they want to accomplish for business suites by implanting and testing new designs in games.\n\nInstead, they seem to be trying to make another thing that does exactly what the Quest or Vive can already do, without really furthering how the apps are gonna function on it.\n\nI’ll be happy if this pans out, I’ll even buy one, but I’m just predicting this is gonna flop.",
                                              "score": 0,
                                              "created_utc": 1734202742.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1rrbuc",
      "author": "Agomir",
      "body": "I get the impression a lot of other commenters didn't really read the article. So Google is making an Android XR operating system, and a modern version of the Google glasses. As per Google's hack record, I wouldn't be surprised if the glasses didn't last long before being pulled. \n\nThe actual XR headset is made by Samsung, so that's a completely different kettle of fish. I guess the lifespan of Android XR will depend a lot on the success of this headset. But don't forget the Quest headsets also run on a version of Android. So we could see more collaboration between Meta and Google, and maybe both OSs will end up merging. That is basically part of Meta's long term vision for the metaverse (and no, the metaverse isn't that failed app, and it hasn't been abandoned).",
      "score": 8,
      "created_utc": 1734044558.0,
      "replies": [
        {
          "id": "m1tmdf2",
          "author": "Navetoor",
          "body": "Based on demos and first hand experiences Android XR is already better than Meta’s. There’s zero chance Meta and Google collaborate, that ship has long sailed. In 5 years I think Android XR is the market share leader.",
          "score": 3,
          "created_utc": 1734071233.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1q4ncy",
      "author": "Shapes_in_Clouds",
      "body": "Design looks awesome to me.  Best news is the resurrection of Google Earth VR, which is basically one of the coolest experiences I ever had.",
      "score": 20,
      "created_utc": 1734026096.0,
      "replies": [
        {
          "id": "m1rgoqt",
          "author": "iTwango",
          "body": "Was it not maintained? I use it fairly frequently.",
          "score": 8,
          "created_utc": 1734040973.0,
          "replies": [
            {
              "id": "m1sa5xi",
              "author": "orangpelupa",
              "body": "It's been stuck in a stasis ",
              "score": 5,
              "created_utc": 1734051374.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1u3ux6",
          "author": "andynormancx",
          "body": "It would be lovely if they updated the Steam version too, I guess that isn’t guaranteed or even likely 😕",
          "score": 3,
          "created_utc": 1734082542.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1qr5us",
      "author": "BSamG",
      "body": "![gif](giphy|WRRIEjIXvWFUlOIFi0)\n\nClose enough, welcome back google glass.",
      "score": 8,
      "created_utc": 1734033019.0,
      "replies": [
        {
          "id": "m1qxhs0",
          "author": "froo",
          "body": "**a few minutes later**\n\nGood bye google glass, you will be missed",
          "score": 5,
          "created_utc": 1734035019.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1rlban",
      "author": "Remic75",
      "body": "Google’s gonna pull the plug in 3 years. I’m calling it.",
      "score": 4,
      "created_utc": 1734042512.0,
      "replies": []
    },
    {
      "id": "m1r6fpy",
      "author": "Brother_Clovis",
      "body": "I don't trust Google to support anything. Got my fingers burned a few times with them.",
      "score": 6,
      "created_utc": 1734037765.0,
      "replies": []
    },
    {
      "id": "m1ruusk",
      "author": "Consistent-Poem7462",
      "body": "These tech companies are fighting fiercely to corner the market, which is worth like $150 from what I can tell",
      "score": 4,
      "created_utc": 1734045825.0,
      "replies": []
    },
    {
      "id": "m1vxuuk",
      "author": "ssuuh",
      "body": "For the upcoming VR boom?\n\n\nOr is it now time for VR porn explosion?",
      "score": 1,
      "created_utc": 1734110480.0,
      "replies": []
    },
    {
      "id": "m1y1upd",
      "author": "fsfaith",
      "body": "This will either take off or it'll disappear into the Google graveyard. There is no middle ground.",
      "score": 1,
      "created_utc": 1734136047.0,
      "replies": []
    },
    {
      "id": "m1yd2jd",
      "author": "FancyWindow",
      "body": "Clearly they’re marketing it hard. I mean, I’ve seen this whole Reddit post about it.",
      "score": 1,
      "created_utc": 1734140452.0,
      "replies": []
    },
    {
      "id": "m1zt1my",
      "author": "mfreverton",
      "body": "Get a pair of the new xreal one. They are amazing, all in one headset.",
      "score": 1,
      "created_utc": 1734168177.0,
      "replies": []
    },
    {
      "id": "m21oec4",
      "author": "phnx0023",
      "body": "A company that force feeds us ads and a company whose products contain large amounts of unnecessary bloat ware are teaming up. Pass.",
      "score": 1,
      "created_utc": 1734199103.0,
      "replies": []
    },
    {
      "id": "m23gxx2",
      "author": "Lelandt50",
      "body": "Yawn.",
      "score": 1,
      "created_utc": 1734222305.0,
      "replies": []
    },
    {
      "id": "m1qe8dz",
      "author": "alkrk",
      "body": "Everything Google... sucks.",
      "score": -5,
      "created_utc": 1734029031.0,
      "replies": []
    },
    {
      "id": "m1riilz",
      "author": "cannaeoflife",
      "body": "Taking on apple? Apple released another newton, they’re not competing with meta. I’m typing this on an iPad, and apple needs to get its software together for these devices powered by mind bogglingly good chips.",
      "score": 1,
      "created_utc": 1734041574.0,
      "replies": [
        {
          "id": "m1rlhvh",
          "author": "danielv123",
          "body": "It's incredible how big their hardware lead is and how much the software let's it down in so many stupid ways",
          "score": 9,
          "created_utc": 1734042573.0,
          "replies": [
            {
              "id": "m1ruup0",
              "author": "cannaeoflife",
              "body": "It’s a huge reversal from the early 2000’s, when OS X came out and the OS was better than the hardware.",
              "score": 4,
              "created_utc": 1734045824.0,
              "replies": []
            },
            {
              "id": "m20slia",
              "author": "googler_ooeric",
              "body": "And it's completely intentional, too. They could've made an AR Mac but they made an AR iPad instead because they didn't want to give consumers too much freedom since they want us to buy both a Mac and a Vision.",
              "score": 2,
              "created_utc": 1734188008.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1pxtfg",
      "author": "jordan1978",
      "body": "I think they just bought all the leftover Apple Vision ones for dirt cheap and slapped a Google sticker on the side.",
      "score": -16,
      "created_utc": 1734023989.0,
      "replies": []
    },
    {
      "id": "m1pztdw",
      "author": "None",
      "body": "[deleted]",
      "score": -17,
      "created_utc": 1734024609.0,
      "replies": [
        {
          "id": "m1q0stn",
          "author": "DarthBuzzard",
          "body": "Hands-on impressions suggests this has a similar visual clarity to Vision Pro.",
          "score": 4,
          "created_utc": 1734024917.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1pvzal",
      "author": "None",
      "body": "[deleted]",
      "score": -10,
      "created_utc": 1734023415.0,
      "replies": [
        {
          "id": "m1pxotb",
          "author": "DarthBuzzard",
          "body": "Samsung is making the headset in collaboration with Google. Together they are making headsets and glasses. \n\nHeadsets for indoors, where it doesn't matter so much how you look but rather the concern is more around weight and size, and glasses for outdoors.",
          "score": 4,
          "created_utc": 1734023949.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1q7u4y",
      "author": "RedditCollabs",
      "body": "Once again google copies Apple",
      "score": -19,
      "created_utc": 1734027076.0,
      "replies": [
        {
          "id": "m1qdvna",
          "author": "charlesdarwinandroid",
          "body": "Google released Mirage Solo  (a standalone headset with Lenovo) a year before Quest\n\nEdit: my point being they have been working on VR for likely longer than Apple.",
          "score": 8,
          "created_utc": 1734028922.0,
          "replies": [
            {
              "id": "m1qhjqv",
              "author": "None",
              "body": "[removed]",
              "score": -9,
              "created_utc": 1734030043.0,
              "replies": [
                {
                  "id": "m1qmoxs",
                  "author": "charlesdarwinandroid",
                  "body": "Apple working on technology that ended up in AVP, sure, like display technology or 6Dof, sure.  They weren't working on headsets in 08.",
                  "score": 5,
                  "created_utc": 1734031635.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}