{
  "post": {
    "title": "Nvidia's Project Digits desktop AI supercomputer fits in the palm of your hand | Nvidia announced the \"world's smallest AI supercomputer\" at CES with Project Digits, a 1 PFLOPS machine to handle the entire Nvidia enterprise software stack.",
    "author": "chrisdh79",
    "id": "1hvo0ja",
    "score": 464,
    "created_utc": 1736243260.0,
    "selftext": "",
    "num_comments": 64,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hvo0ja/nvidias_project_digits_desktop_ai_supercomputer/"
  },
  "comments": [
    {
      "id": "m5uksqh",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736243261.0,
      "replies": []
    },
    {
      "id": "m5uryb2",
      "author": "Saotik",
      "body": "If Nvidia isn't going to make any new Shield devices, I kind of want to go competely overkill with one of these.",
      "score": 84,
      "created_utc": 1736247834.0,
      "replies": [
        {
          "id": "m5xmou6",
          "author": "BrassBahalls",
          "body": "Jfc please make a new shield",
          "score": 13,
          "created_utc": 1736282628.0,
          "replies": [
            {
              "id": "m5zf0tp",
              "author": "_RADIANTSUN_",
              "body": "They have all the tools they need basically... Shield Pro 2 could literally be same thing but with modern chipset, even more comprehensive modern codec support, maybe actually good (specially for gaming) AI motion interpolation and even better AI upscaling. And it would be the best thing on the market.",
              "score": 3,
              "created_utc": 1736302960.0,
              "replies": []
            },
            {
              "id": "m63m7rd",
              "author": "TeutonJon78",
              "body": "If they do, it will just after the new Switch comes out, since they use the same chipsets. \n\nBut likely, they will decide that market isn't worth the silicon allotment which could be spent on printing money with AI focused stuff.",
              "score": 1,
              "created_utc": 1736364995.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5vldfh",
          "author": "maniacreturns",
          "body": "If they don't make a new Shield they may as well go out of business because they are USELESS to me.",
          "score": 16,
          "created_utc": 1736260887.0,
          "replies": [
            {
              "id": "m5w74l3",
              "author": "None",
              "body": "[deleted]",
              "score": -5,
              "created_utc": 1736267671.0,
              "replies": [
                {
                  "id": "m5x9esx",
                  "author": "maniacreturns",
                  "body": "I know and it hurts!",
                  "score": 11,
                  "created_utc": 1736278788.0,
                  "replies": [
                    {
                      "id": "m5y5ewr",
                      "author": "OtterishDreams",
                      "body": "we all hate rejection!",
                      "score": 6,
                      "created_utc": 1736288027.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m5ung0x",
      "author": "shofmon88",
      "body": "This is an interesting bit of hardware. It’s tuned for AI, but it will be interesting to see how useful it if for other GPU-optimised workloads, like Bayesian phylogenetic inferences. I would certainly love to get my hands on one of these to handle bioinformatics workloads. ",
      "score": 91,
      "created_utc": 1736245002.0,
      "replies": [
        {
          "id": "m5unlg9",
          "author": "Drizznarte",
          "body": "But can it run crysis.",
          "score": 68,
          "created_utc": 1736245101.0,
          "replies": [
            {
              "id": "m5unw0s",
              "author": "shofmon88",
              "body": "If a tech youtuber doesn’t do a video testing that I will be sorely disappointed ",
              "score": 29,
              "created_utc": 1736245288.0,
              "replies": [
                {
                  "id": "m5v4gv7",
                  "author": "Triaspia2",
                  "body": "Id also like to see Doom run on it.\n\nDoom runs on everything but can this do generative Doom?",
                  "score": 11,
                  "created_utc": 1736254357.0,
                  "replies": [
                    {
                      "id": "m5xpldf",
                      "author": "NeverLookBothWays",
                      "body": "Generative Doom sounds simultaneously awesome and terrifying",
                      "score": 1,
                      "created_utc": 1736283447.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5w65br",
                  "author": "Vydra-",
                  "body": "Coming to a Bringus Studio near you (if he can afford it lmao)",
                  "score": 4,
                  "created_utc": 1736267381.0,
                  "replies": [
                    {
                      "id": "m5yl2s6",
                      "author": "CommodoreAxis",
                      "body": "I’m sure he will get around to it. I give it like 3-5 years before they’re popping up at e-waste recyclers.",
                      "score": 2,
                      "created_utc": 1736292959.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5zjuf1",
                  "author": "NorCalAthlete",
                  "body": "It got a 5.3 Weismann score compressing 3d video",
                  "score": 0,
                  "created_utc": 1736304639.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5wgbne",
              "author": "Whosephonebedis",
              "body": "Asking the real questions right here",
              "score": 3,
              "created_utc": 1736270372.0,
              "replies": []
            },
            {
              "id": "m69arqo",
              "author": "FUTURE10S",
              "body": "AI cores are matrix multiplying monsters, I really don't see why not. It's all just data, and then we do a little software rendering to output the result as an image.",
              "score": 2,
              "created_utc": 1736444515.0,
              "replies": [
                {
                  "id": "m69fcv8",
                  "author": "Drizznarte",
                  "body": "I think there might be an interesting change in gaming coming up due to AI, in the next decade.  One where instead of an image being stored as 3d data / textures and rendered. , instead every frame is hulcinated by generative AI. This could lead to a revolutionary change. It fixes a bandwidth problem with large games , at some point the model to create the game world generativly will be smaller than the data needed to store the same world.",
                  "score": 0,
                  "created_utc": 1736445831.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5x7i48",
              "author": "Farewel_Welfare",
              "body": "\"only gamers will get that joke\"",
              "score": -1,
              "created_utc": 1736278235.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5zchxf",
          "author": "PineappleLemur",
          "body": "Also if it this small and low power... Can they make something desktop case size to run something much more beefy?\n\nPrice aside...",
          "score": 2,
          "created_utc": 1736302076.0,
          "replies": []
        },
        {
          "id": "m64cdrv",
          "author": "tecedu",
          "body": "Honestly yeah I want one as well for other work, wish they would make something like grace hopper but at l40s level instead",
          "score": 1,
          "created_utc": 1736372597.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5uxchr",
      "author": "LSeww",
      "body": "There are almost no details on the hardware though.",
      "score": 39,
      "created_utc": 1736250891.0,
      "replies": [
        {
          "id": "m5v3tia",
          "author": "johansugarev",
          "body": "Operation pump the stock.",
          "score": 74,
          "created_utc": 1736254069.0,
          "replies": []
        },
        {
          "id": "m5vthvz",
          "author": "kbn_",
          "body": "Sounded to me like a GB200 with only a single Blackwell rather than two.",
          "score": 5,
          "created_utc": 1736263554.0,
          "replies": [
            {
              "id": "m60ndpr",
              "author": "Elon61",
              "body": "GB200 for 4000$? No way.",
              "score": 1,
              "created_utc": 1736322880.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m5windv",
      "author": "Artistic-Teaching395",
      "body": "Rabbit M1 but actually works.",
      "score": 4,
      "created_utc": 1736271051.0,
      "replies": [
        {
          "id": "m68gf0w",
          "author": "None",
          "body": "![gif](giphy|LSKVmdIwZFeNEBKBxZ)",
          "score": 1,
          "created_utc": 1736435507.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5y5nxo",
      "author": "duke_skytalker",
      "body": "Can some explain what would use of this for a casual pc user?",
      "score": 4,
      "created_utc": 1736288104.0,
      "replies": [
        {
          "id": "m5zlha2",
          "author": "shofmon88",
          "body": "Paperweight. It's a specialised device not meant for your average user.",
          "score": 11,
          "created_utc": 1736305206.0,
          "replies": []
        },
        {
          "id": "m60lwy0",
          "author": "None",
          "body": "simplistic important wakeful tub touch deer memory physical combative work\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 3,
          "created_utc": 1736321991.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5umc5t",
      "author": "nickcdll",
      "body": "Oh great, an additional and pocket size way to contribute to the enshittification of the Internet. So now we can have more images of dogs with human hands, AI artwork that when you look closely at it makes you think you're on acid, and answers on AI Google search that tell you the best way to give birth to a baby is shoot it out of a canon\n\nAI was supposed to make things better, now when you search for images half of them are fake, asking AI a question gives you a crazy answer, and artists are out of work so cheap companies can have pictures where half the peoples bodies disappear into the either. Thanks Nvidia",
      "score": 15,
      "created_utc": 1736244282.0,
      "replies": [
        {
          "id": "m5vd2z2",
          "author": "Muggaraffin",
          "body": "I used Google last week and (since I have no choice apparently) the AI suggestions were at the top, and literally both questions were as wrong as possible. It was hilarious. \n\n\nI was looking for a new phone SIM and I googled whether the SIM deal includes international minutes. The AI suggestion stated \"This SIM deal does include international minutes.\"\n\n\nBut just to double check, I went to the providers website and literally the top line (even with the same formatting - the AI suggestion was literally the same layout and format) stated \"This SIM deal does NOT include international minutes.\"\n\n\nIt wasn't like I was asking for it to devise a life plan for me or to cure world hunger. It literally got the most basic question wrong, from a website that was the top link and the text was the top line\n\n\nAnd it did the exact same thing for something else I googled later that day, can't remember what it was. But something equally as basic ",
          "score": 27,
          "created_utc": 1736257877.0,
          "replies": [
            {
              "id": "m6w1wix",
              "author": "None",
              "body": "Google's AI is awful. Gemini is so hilariously, confidently wrong.",
              "score": 2,
              "created_utc": 1736755411.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5upx7t",
          "author": "Whisker_plait",
          "body": "It's not Nvidia's fault that AI is currently over-hyped, they're just making good hardware and software that enables large GPU workloads",
          "score": 36,
          "created_utc": 1736246583.0,
          "replies": [
            {
              "id": "m5v8fs8",
              "author": "Terrible_Yak_4890",
              "body": "Jensen Huang and Nvidia are every bit as much at fault for the hype as Sam Altman, Eric Schmidt, Mustafa Sulaymen, Musk….\n\nHe’s hyping his hardware as being the best for running AI. This is the second (that I’ve seen) CES where he appeared on stage with a bunch of robots (as props that do nothing) and talking about how fantastic this year’s Nvidia products are and often in a language that is absolutely obscure to me given the jargon. He’s got the trademark look that he’s adopted for himself, all black with a black leather jacket (a riff on Jobs’ outfits).\n\nNvidia is riding everyone else’s hype as well.",
              "score": 4,
              "created_utc": 1736256048.0,
              "replies": [
                {
                  "id": "m5xnat4",
                  "author": "Sunny-Chameleon",
                  "body": "Is their hardware NOT the best to run AI? I am not interested either way but I haven't seen Intel or anyone else dominating all areas as completely as Nvidia.",
                  "score": 11,
                  "created_utc": 1736282802.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5vx9hv",
              "author": "No_more_head_trips",
              "body": "This guy gets it.",
              "score": 1,
              "created_utc": 1736264723.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5utroi",
          "author": "parks387",
          "body": "I saw this coming in the 90s, so I’ve been on acid since then in prep. It all just seems normal now.\n\n![gif](giphy|4NgwwfVfvlHUWUwBvr)",
          "score": 18,
          "created_utc": 1736248912.0,
          "replies": [
            {
              "id": "m5uwdzc",
              "author": "teodorfon",
              "body": ":-)",
              "score": 1,
              "created_utc": 1736250383.0,
              "replies": []
            },
            {
              "id": "m5vhxb4",
              "author": "youshouldn-ofdunthat",
              "body": "Well played",
              "score": 1,
              "created_utc": 1736259670.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5xt136",
          "author": "compound-interest",
          "body": "If we keep letting AI make blobby SpongeBob art FOR US our economy will collapse!",
          "score": 2,
          "created_utc": 1736284430.0,
          "replies": []
        },
        {
          "id": "m5xc1ea",
          "author": "dorakus",
          "body": "Honestly, by now I'm more tired about everyone's \"hot take\" on how shitty AI is that about AI itself.",
          "score": 1,
          "created_utc": 1736279541.0,
          "replies": []
        },
        {
          "id": "m5umxrj",
          "author": "Sunflier",
          "body": "r/FuckAI/",
          "score": -7,
          "created_utc": 1736244672.0,
          "replies": []
        },
        {
          "id": "m5utdeo",
          "author": "FUThead2016",
          "body": "You must be fun at parties",
          "score": -10,
          "created_utc": 1736248681.0,
          "replies": [
            {
              "id": "m5uwuno",
              "author": "mcdithers",
              "body": "He’s not wrong.  The current state of AI is artificial, but hardly intelligent.  It’s basically a souped up google search, and companies are using it to make life altering decisions for the masses.  See: health insurance, grading college papers, mortgage/credit decisions, insurance underwriting, and scamming CEOs into thinking it’s actually useful.  I could go on, but I think I’ve made my point.\n\nEdit:  I forgot the most important reason it sucks.  It gives CEOs a scapegoat when shit hits the fan.  “No human in this company made the decision. It was the algorithm, so we can’t be held accountable.”",
              "score": 15,
              "created_utc": 1736250632.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5v3ea2",
          "author": "drae-",
          "body": "![gif](giphy|fqtyYcXoDV0X6ss8Mf)",
          "score": -7,
          "created_utc": 1736253876.0,
          "replies": [
            {
              "id": "m5vdbs6",
              "author": "Muggaraffin",
              "body": "This is ironically a fitting analogy since AI rains on everyone's parade and makes everything shit ",
              "score": 3,
              "created_utc": 1736257969.0,
              "replies": [
                {
                  "id": "m5vgoec",
                  "author": "drae-",
                  "body": "Lol I never expected luddites on reddit.\n\nBut I guess this ain't the place it was 15 years ago.",
                  "score": -9,
                  "created_utc": 1736259219.0,
                  "replies": [
                    {
                      "id": "m5wev1o",
                      "author": "Fredasa",
                      "body": "It's because the tech has political baggage.  Take the billionaires out of the equation and people would be nodding sagely at the halfway point AI has reached, remembering that it was just three or four years ago when AI's baby steps weren't really good for much of anything.",
                      "score": 1,
                      "created_utc": 1736269944.0,
                      "replies": [
                        {
                          "id": "m5wk3fr",
                          "author": "drae-",
                          "body": "Nah, reddit echo chamber in action is all. Amplified by people's fear of the unknown.\n\nAi is just the printing press, steam engine, electric lightbulb, factory assembly line, silicon microchip, personal computer, world wide web, or smartphone of our time. It's impact and disruption will be similar and humanity will adapt and move on as it always has. \n\nI lived through the last few of those. It was disruptive each time for sure. But the doom and gloom then wasn't reflective of the outcome, and I doubt it will be here either. All sorts of new horizons opened up each time, and each time people moved fluidly over those horizons and we experienced a boom in quality of life increase in the process.\n\nIn 15 years we will be taking ai for granted the same way we do smart phones today.",
                          "score": 0,
                          "created_utc": 1736271473.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m5uyt11",
          "author": "rotzak",
          "body": "Airliners had a penitent for exploding in the 1950s and 1960s. Should they have just stopped development and gone home?\n\nI understand your grievance here; however, in 20 years you’re going to look back at this post and think of how silly you sound.",
          "score": -11,
          "created_utc": 1736251656.0,
          "replies": [
            {
              "id": "m5v32be",
              "author": "Felosele",
              "body": "penchant",
              "score": 9,
              "created_utc": 1736253723.0,
              "replies": []
            },
            {
              "id": "m5w1f3x",
              "author": "Tek_Freek",
              "body": "Apples and oranges.",
              "score": 0,
              "created_utc": 1736265974.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m5w4nao",
      "author": "Inevitable_Pea_6798",
      "body": "Does it come witj solitaire though",
      "score": 1,
      "created_utc": 1736266936.0,
      "replies": []
    },
    {
      "id": "m5yzyet",
      "author": "DumpsterFireCEO",
      "body": "Gonna pflop my balls the table",
      "score": 1,
      "created_utc": 1736297840.0,
      "replies": []
    },
    {
      "id": "m602j2n",
      "author": "PhillNeRD",
      "body": "RIP Intel",
      "score": 1,
      "created_utc": 1736311891.0,
      "replies": []
    },
    {
      "id": "m5w417w",
      "author": "RiderLibertas",
      "body": "Any computer I can't upgrade myself is not \"super\" as far as I'm concerned.",
      "score": 0,
      "created_utc": 1736266756.0,
      "replies": []
    },
    {
      "id": "m5uyvy5",
      "author": "spif",
      "body": "Now I'm wondering if I should run streamdiffusion on this with USB camera input and use NDI to feed the output to Touchdesigner for a portable realtime visuals setup, or just get a 5090 laptop.",
      "score": -2,
      "created_utc": 1736251698.0,
      "replies": []
    },
    {
      "id": "m5vhcu3",
      "author": "BatPsychological1803",
      "body": "How. Much. VRAM.",
      "score": 0,
      "created_utc": 1736259465.0,
      "replies": [
        {
          "id": "m5zlrdh",
          "author": "shofmon88",
          "body": "It isn't really VRAM since it isn't a dedicated video device, but it looks like the 128Gb of RAM on the device is system-unified, much like Apple's M-chips.",
          "score": 3,
          "created_utc": 1736305303.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5vxcln",
      "author": "No_more_head_trips",
      "body": "![gif](giphy|sDcfxFDozb3bO)",
      "score": -2,
      "created_utc": 1736264749.0,
      "replies": []
    },
    {
      "id": "m5y6y5v",
      "author": "N3utro",
      "body": "Nice, soon we'll hear about people in ER having AI supercomputers taken out from their asses",
      "score": 0,
      "created_utc": 1736288493.0,
      "replies": []
    },
    {
      "id": "m5weoo5",
      "author": "None",
      "body": "That looks slightly larger than the palm",
      "score": -1,
      "created_utc": 1736269893.0,
      "replies": []
    }
  ]
}