{
  "post": {
    "title": "Samsung's Super Thin 'Galaxy S25 Edge' Will Debut Next Week, Beating iPhone 17 Air.",
    "author": "Valinaut",
    "id": "1khcwhx",
    "score": 416,
    "created_utc": 1746663661.0,
    "selftext": "",
    "num_comments": 279,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1khcwhx/samsungs_super_thin_galaxy_s25_edge_will_debut/"
  },
  "comments": [
    {
      "id": "mr5z9wi",
      "author": "golddilockk",
      "body": "who in this market is asking for this? who in this market is asking anything from smartphones these days apart from more battery and maybe more privacy?",
      "score": 213,
      "created_utc": 1746665204.0,
      "replies": [
        {
          "id": "mr69vyp",
          "author": "annoyed__renter",
          "body": "No one. Especially not with a battery tradeoff.\n\nPhone improvement is plateauing.",
          "score": 89,
          "created_utc": 1746668819.0,
          "replies": [
            {
              "id": "mr9xshj",
              "author": "kermityfrog2",
              "body": "I want a thinner and smaller Apple watch with 4 hour battery life. Oh wait, no I don't. I want a $50 small smart watch with [1 week battery life](https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/18329291/ngarun_190723_3562_1749.jpg?quality=90&strip=all&crop=0,0,100,100).",
              "score": 29,
              "created_utc": 1746724084.0,
              "replies": [
                {
                  "id": "mrboxks",
                  "author": "alidan",
                  "body": "I hate the way those things look enough to buy a watch from elsewhere",
                  "score": 14,
                  "created_utc": 1746743079.0,
                  "replies": []
                },
                {
                  "id": "mrgopjy",
                  "author": "juh4z",
                  "body": "That's not a smart watch.",
                  "score": 2,
                  "created_utc": 1746816001.0,
                  "replies": [
                    {
                      "id": "mroewds",
                      "author": "RhetoricalOrator",
                      "body": "It looks really similar to Samsung's \"Fit\" line. I've had a few of the 1st gen of Galaxy Fit. They did practically everything you could think of that would qualify as a smart watch: heart rate, stress, quick reply texts, check calls and decline, weather widget, social media notifications, music controls, news headlines...they even told me when someone (and who) unlocks my door. \n\nThe referenced photo may not be a Galaxy Fit, but a similar form factor isn't probative of them being a smart watch. I actually really enjoyed how lightweight and feature-rich mine were for 10-20% of the price of full-sized watches. \n\nEdit: I think that's a Xiaomi Mi Smart Band 4. Definitely a smartwatch.",
                      "score": 1,
                      "created_utc": 1746925464.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mro4oz9",
              "author": "kungfungus",
              "body": "Samsung phones are also so fkn slippery, it's pure voodoo how it just fucking gets up up and away.",
              "score": 3,
              "created_utc": 1746921435.0,
              "replies": [
                {
                  "id": "ms1uma5",
                  "author": "KanedaSyndrome",
                  "body": "You have to put a rubber case around it, because yes, they will slip and head for the floor otherwise",
                  "score": 1,
                  "created_utc": 1747119076.0,
                  "replies": [
                    {
                      "id": "msabjck",
                      "author": "kungfungus",
                      "body": "I know, and all that expensive design is unnecessary cost for me. I hate it. Make a grip friendly phone. It's literally the most important thing - holding it, so I can use it.",
                      "score": 1,
                      "created_utc": 1747236961.0,
                      "replies": [
                        {
                          "id": "msbso4q",
                          "author": "KanedaSyndrome",
                          "body": "yeh lol agree completely.",
                          "score": 2,
                          "created_utc": 1747252224.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mripf8v",
              "author": "Duckgoesmoomoo",
              "body": "Phone, cpu, gpu, lot of stuff is hitting diminishing returns hard",
              "score": 1,
              "created_utc": 1746840738.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr8c6wg",
          "author": "marxcom",
          "body": "Typical Samsung move, releasing a product just to be “first”. This one is based purely on Apple rumors. While Apple users may buy HomePod, Samsung users may not be interested in a bixby speaker. You don’t need to react to every product your competitors make.",
          "score": 17,
          "created_utc": 1746706030.0,
          "replies": []
        },
        {
          "id": "mr6j1fo",
          "author": "TingusPingus_6969",
          "body": "well, it's not about people asking, it's about samsung just always releases stuff just for the sake of beating apple on what they're gonna release. \n\nSamsung didnt even think why apple is doing this thin line up, which is a gradual transition to a foldable phone that's not as thick.",
          "score": 8,
          "created_utc": 1746672100.0,
          "replies": []
        },
        {
          "id": "mr8ta5i",
          "author": "zhephyx",
          "body": "Who are these people who kill phone batteries in one day? My phone is 2 years old, if I am at the airport all day I can maybe kill it in 7 hours. If that's your regular SOT then you might have a problem",
          "score": 3,
          "created_utc": 1746712118.0,
          "replies": [
            {
              "id": "mrb8rys",
              "author": "elmo-slayer",
              "body": "I’m in and out of reception all day, my 16e rarely lasts the full day",
              "score": 8,
              "created_utc": 1746737834.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr64ldx",
          "author": "boyyouguysaredumb",
          "body": "I’d love if my phone was lighter",
          "score": 5,
          "created_utc": 1746667053.0,
          "replies": [
            {
              "id": "mr6rf2j",
              "author": "None",
              "body": "[removed]",
              "score": -48,
              "created_utc": 1746675462.0,
              "replies": [
                {
                  "id": "mr73ylz",
                  "author": "SwornHeresy",
                  "body": "Judging by your tantrum, you must have noodle arms that get hurt by 8 ounce phones. People have different wants and needs, and a lot of us can deal with thick and \"heavy\" just fine. If I'm using a phone for 4-5 years, I'm going to want a larger battery so that its still useable when the battery capacity is reduced.",
                  "score": 13,
                  "created_utc": 1746681381.0,
                  "replies": [
                    {
                      "id": "mr9fy9x",
                      "author": "None",
                      "body": "[removed]",
                      "score": -10,
                      "created_utc": 1746718883.0,
                      "replies": [
                        {
                          "id": "mrcrtj2",
                          "author": "Schubert125",
                          "body": "Good job bud, you sure showed them!",
                          "score": 5,
                          "created_utc": 1746757297.0,
                          "replies": [
                            {
                              "id": "mrdbij3",
                              "author": "gadgetluva",
                              "body": "Fuck yea I did",
                              "score": 0,
                              "created_utc": 1746765872.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mr7npnb",
                  "author": "Green_Palpitation_26",
                  "body": "Projecting much maybe you don't need a bigger battery since you're the one begging for a thin phone that'll snap when you're out and about with it in your pocket.",
                  "score": 4,
                  "created_utc": 1746693164.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mrcj0xg",
          "author": "crymachine",
          "body": "Lost the headphone jack, lost the ad card slot, welcome to the monopoly.",
          "score": 1,
          "created_utc": 1746754015.0,
          "replies": []
        },
        {
          "id": "mrdohbf",
          "author": "Mikeg216",
          "body": "No one we just want a modern top of the line phone that has an SD card reader.",
          "score": 1,
          "created_utc": 1746772920.0,
          "replies": []
        },
        {
          "id": "mrp3gv6",
          "author": "Blindman2k17",
          "body": "The only logic I can come up here is folks that make the decisions are trying to appease the stockholders",
          "score": 1,
          "created_utc": 1746935543.0,
          "replies": []
        },
        {
          "id": "mrpv05w",
          "author": "blisstaker",
          "body": "really thin phones are necessary for thin foldables, and the companies feel they might as well release them. that and they will be “stylish”. that and they have been running out of things to really differentiate from prior models",
          "score": 1,
          "created_utc": 1746950803.0,
          "replies": []
        },
        {
          "id": "ms1uj7o",
          "author": "KanedaSyndrome",
          "body": "Yeh I don't think I find something this thin attractive. To me S20 FE is still the best phone I've had and I love it's size, weight etc.",
          "score": 1,
          "created_utc": 1747119027.0,
          "replies": []
        },
        {
          "id": "mr7xj37",
          "author": "JamesHeckfield",
          "body": "Who was asking for a sequel to Avatar? \n\nReddit doesn’t represent reality. Samsung and Apple know better than some random wanker on the internet.",
          "score": -3,
          "created_utc": 1746699232.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr5yo4b",
      "author": "Djghost1133",
      "body": "Guys i just want a bigger battery, a headphone jack, and removal storage. Stop making shit thinner",
      "score": 691,
      "created_utc": 1746664992.0,
      "replies": [
        {
          "id": "mr5zzd5",
          "author": "sexaddic",
          "body": "Removable storage is gone forever so is the headphone jack. Bigger battery would be nice though",
          "score": 210,
          "created_utc": 1746665448.0,
          "replies": [
            {
              "id": "mr64wqj",
              "author": "Djghost1133",
              "body": "Actually both of those features still exist in low-end phones. Motorola g series for example has both expandable storage, a headphone jack, and a 5000mah battery. You just give up as nice of a screen, high end processor, and good cameras.",
              "score": 91,
              "created_utc": 1746667161.0,
              "replies": [
                {
                  "id": "mr9k4bd",
                  "author": "Crusty_Pancakes",
                  "body": "I just want these basic fucking things in a phone that isn't also a shit tier low end model. \n\n\nWhy the FUCK is tech in phones moving BACKWARDS. I don't even really give a shit if the battery isn't easily replaceable as I would rather have the water resistance and paying a store to drop a new battery in is usually only around $100 anyway. \n\n\nBut God for fucking bid I want a high end processor along with all the other bells and whistles AND a Goddamn headphone jack/SD card slot. Nope, fuck me, doesn't exist.\n\n\nMakes no sense. ",
                  "score": 19,
                  "created_utc": 1746720084.0,
                  "replies": [
                    {
                      "id": "mrg90bv",
                      "author": "SsooooOriginal",
                      "body": "Lol, there was water resistance and water proof with removeable batts.\n\n\nThere also used to be waterproof cases.",
                      "score": 3,
                      "created_utc": 1746811276.0,
                      "replies": [
                        {
                          "id": "mrhj1bf",
                          "author": "mailslot",
                          "body": "They were all terrible as I remember. The last one I had, the Samsung Galaxy S5, had gaskets that would misalign so it was rarely even water resistant. The USB cover would fall out easily and get lost. Also, the back cover would pop off of the phone constantly, even just setting it down on a pillow. Then Samsung pushed an update nagging me to check the seals every single day.\n\nI had all of the inconveniences of a water proof phone, that wasn’t great at water proofing, so I could have a replaceable battery that never needed replacing.\n\nI was stoked when I replaced the phone with the completely sealed S7. I was seriously tired of the battery falling out all of the time.",
                          "score": 2,
                          "created_utc": 1746825410.0,
                          "replies": [
                            {
                              "id": "mrhr3yu",
                              "author": "SsooooOriginal",
                              "body": "Maligning a whole category of phones when you only talk about one is no credible anecdote.\n\n\nShould have gone Moto.",
                              "score": 1,
                              "created_utc": 1746828108.0,
                              "replies": [
                                {
                                  "id": "mrhvm6p",
                                  "author": "mailslot",
                                  "body": "I’ve had motos. I like them. I use a G series for dev testing & QA.\n\nI mentioned the S5 because it’s often cited as the last waterproof flagship, despite being a fairly awful and inconsistent experience to use.",
                                  "score": 1,
                                  "created_utc": 1746829685.0,
                                  "replies": [
                                    {
                                      "id": "mrhxtc6",
                                      "author": "SsooooOriginal",
                                      "body": "Last waterproof flagship?\n\n\nWhat?\n\n\nAnd I knew plenty of people more than happy with their S5s. It helped cement samsungs place in the phone heirarchy.",
                                      "score": 1,
                                      "created_utc": 1746830478.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mr6rg96",
                  "author": "ryapeter",
                  "body": "Chinese brand still have he features even on higher end.",
                  "score": 6,
                  "created_utc": 1746675476.0,
                  "replies": [
                    {
                      "id": "mr7jd27",
                      "author": "external72",
                      "body": "Which ones?? Because I don’t think Xiaomi 15 ultra or oneplus 13 do. They’re pretty high end",
                      "score": 2,
                      "created_utc": 1746690377.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr65656",
                  "author": "sexaddic",
                  "body": "Android as a whole is dropping support for removable storage. That’s why it’s gone forever. Eventually the headphone jack on smaller devices will go away.",
                  "score": 20,
                  "created_utc": 1746667251.0,
                  "replies": [
                    {
                      "id": "mr6bwom",
                      "author": "wirelessfingers",
                      "body": "Do you have a source on this because I can't find anything about expandable/removable storage support ending? Android is also open source, so if a manufacturer wanted to add that functionality back in, I'm sure they could find a way.",
                      "score": 41,
                      "created_utc": 1746669515.0,
                      "replies": [
                        {
                          "id": "mr6g2yb",
                          "author": "sexaddic",
                          "body": "Access to app-specific directories on external storage\n\nOn Android 11, apps can no longer access files in any other app's dedicated, app-specific directory within external storage.\n\n\nhttps://developer.android.com/about/versions/11/privacy/storage",
                          "score": -12,
                          "created_utc": 1746670999.0,
                          "replies": [
                            {
                              "id": "mr6juhx",
                              "author": "DanNeely",
                              "body": "Aren't they doing the same restrictions with onboard storage?\n\nIt's been a few years since I've done any Android dev; but each new version of the OS when I was came with additional restrictions on direct file access outside of your apps directory.  Instead you had to send the user through file picker APIs that returned abstract IDs (don't recall the name) instead of file paths.  (Those were always awful to deal with so the first thing we always did was copy the file into the app directory for future use.)  In theory, forcing apps to use that approach should have been an improvement since it was the only way to reach files in cloud storage; but every provider we tested ended up needing slightly different code to get a local copy of the file so it still didn't just work.",
                              "score": 27,
                              "created_utc": 1746672409.0,
                              "replies": [
                                {
                                  "id": "mr6m9qj",
                                  "author": "sexaddic",
                                  "body": "Yeah but they’re overall slow walking external storage to its death.",
                                  "score": -15,
                                  "created_utc": 1746673354.0,
                                  "replies": [
                                    {
                                      "id": "mr7boap",
                                      "author": "katefreeze",
                                      "body": "Why would they ever get rid the ability to use external storage? I use USBs to transfer files from my phone, wouldnt that be considered 'external storage' just as much as an SD card? (In terms of how thet are used)",
                                      "score": 12,
                                      "created_utc": 1746685688.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mr7aduk",
                              "author": "ItchyJam",
                              "body": "Pretty sure this is to stop Apps farming your data, not to reduce the usability of storage generally. The article is about privacy. Your personal access to data remains afaik.",
                              "score": 14,
                              "created_utc": 1746684936.0,
                              "replies": [
                                {
                                  "id": "mr7ag5f",
                                  "author": "sexaddic",
                                  "body": "The pixel phones don’t come with external storage either",
                                  "score": -13,
                                  "created_utc": 1746684974.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mr6gll1",
                          "author": "OperatorJo_",
                          "body": "As I wrote elsewhere, Android hasn't liked removable storage for awhile now. YEARS now after the Material days. Apps don't like being on external storage. They don't play nice so all an sd card is for is photos, music and files. \n\nSure, that's convenient but the real reason people would like more storage is more large apps and that's not happening with an SD card.",
                          "score": -18,
                          "created_utc": 1746671191.0,
                          "replies": [
                            {
                              "id": "mr6n8ki",
                              "author": "SpeedflyChris",
                              "body": "I'm not sure I buy that the main driver is large apps.\n\nWhenever I run low on space it's because of a large amount of photos/video. A microSD card slot would make that much easier to deal with.",
                              "score": 25,
                              "created_utc": 1746673744.0,
                              "replies": [
                                {
                                  "id": "mr707wz",
                                  "author": "HuntingForSanity",
                                  "body": "But a micro sd card doesn’t make you spend more money on the higher storage device that they are selling. So they stop adding SD card slots so you pay more money for higher storage.",
                                  "score": 8,
                                  "created_utc": 1746679457.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mr6z7tp",
                              "author": "h3rpad3rp",
                              "body": ">all an sd card is for is photos, music and files. \n\nYeah, that is why I want it.\n\nAnd besides that, if I put all my photos, videos, music, and files on the SD card I'd have more room on the internal storage for large apps.",
                              "score": 17,
                              "created_utc": 1746678968.0,
                              "replies": []
                            },
                            {
                              "id": "mr72rpa",
                              "author": "drfsupercenter",
                              "body": "I mean, that's exactly what I use it for. Storing all those videos I film on the phone. Who said anything about apps?",
                              "score": 10,
                              "created_utc": 1746680753.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mr68vqn",
                  "author": "JDBCool",
                  "body": "Went from Samsung Note 8 to A15 5G\n\nDidn't care if it was a semi-downgrade to a midrange phone.\n\nAll I need is a headphone jack and removable storage.\n\nKinda sad I've lost the S-pen as I've used my Note 8 as a notepad to jot quick notes throughout the day....",
                  "score": 3,
                  "created_utc": 1746668471.0,
                  "replies": []
                },
                {
                  "id": "mraow2y",
                  "author": "popornrm",
                  "body": "Hardly anyone uses these features anymore or cares to want them. Meanwhile everyone wants better battery life.",
                  "score": -1,
                  "created_utc": 1746731964.0,
                  "replies": []
                },
                {
                  "id": "mr6nko8",
                  "author": "A_Typicalperson",
                  "body": "Nobody wants low end phones, and  with cloud storage these days nobody needs expandable storage",
                  "score": -16,
                  "created_utc": 1746673881.0,
                  "replies": [
                    {
                      "id": "mr6zhqa",
                      "author": "h3rpad3rp",
                      "body": "Yeah, cloud storage is great when you are in an area with bad or no reception.\n\n/s\n\nEven when my samsung has 4 bars but says 5G instead of 5G+, the internet runs like absolute garbage.",
                      "score": 9,
                      "created_utc": 1746679101.0,
                      "replies": [
                        {
                          "id": "mr7p1sw",
                          "author": "A_Typicalperson",
                          "body": "why do you have such bad reception? the features you want are no longer needed no one downloads shit anymore, everything is streamed",
                          "score": -7,
                          "created_utc": 1746694026.0,
                          "replies": [
                            {
                              "id": "mrbqohf",
                              "author": "h3rpad3rp",
                              "body": "New communities on the edge of the city, road trips out in the country, being out in the mountains, in a basement, or just in an area with poor service. I live in Canada. This place is big and empty, as I'm sure most of middle America is. Just because you don't leave downtown in your city doesn't mean no one else does. Seems like people on here agree with me.\n\nMaybe the Spotify servers go down and I still want to listen to music? The cloud is certainly convenient, but it is garbage for reliability. \n\nMeanwhile you can fit a TB of storage on a chip the size of your finger nail, so why wouldn't you want the option?",
                              "score": 2,
                              "created_utc": 1746743692.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr66dv4",
              "author": "267aa37673a9fa659490",
              "body": "The Xperia still has a headphone jack ",
              "score": 18,
              "created_utc": 1746667643.0,
              "replies": [
                {
                  "id": "mr68ubt",
                  "author": "sexaddic",
                  "body": "Yes and it’s going away",
                  "score": 2,
                  "created_utc": 1746668458.0,
                  "replies": [
                    {
                      "id": "mr7ueju",
                      "author": "caster201pm",
                      "body": "nah, they're announcing new phones this month (theres a teaser page up already), if you're talking about the jack though, its unlikely they'll drop it as they dropped em once before and apologized and re-added and kept it since for several generations now but we'll see when they do announce em.",
                      "score": 3,
                      "created_utc": 1746697406.0,
                      "replies": []
                    },
                    {
                      "id": "mretvzz",
                      "author": "AzKondor",
                      "body": "???",
                      "score": 1,
                      "created_utc": 1746795119.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr9nbns",
              "author": "zooberwask",
              "body": "You won't get a bigger battery either because then you'll upgrade when the battery life falls less than a day. ",
              "score": 3,
              "created_utc": 1746721035.0,
              "replies": []
            },
            {
              "id": "mr7apz7",
              "author": "Jericho-X",
              "body": "Not in Sony phones",
              "score": 3,
              "created_utc": 1746685130.0,
              "replies": []
            },
            {
              "id": "mreu045",
              "author": "AzKondor",
              "body": "Just bought HMD Fusion. Removable storage, removable battery, headphone jack.",
              "score": 1,
              "created_utc": 1746795160.0,
              "replies": [
                {
                  "id": "mreuamm",
                  "author": "sexaddic",
                  "body": "Yes but no mainstream phone are adding those back",
                  "score": 1,
                  "created_utc": 1746795267.0,
                  "replies": [
                    {
                      "id": "mrevylc",
                      "author": "AzKondor",
                      "body": "Still not dead. For more mainstream check Galaxy XCover, I think they have all those features.",
                      "score": 0,
                      "created_utc": 1746795870.0,
                      "replies": [
                        {
                          "id": "mrfkvdh",
                          "author": "sexaddic",
                          "body": "Yall are digging reallll deep to try to counter my point.\n\n![gif](giphy|tMuTXPEnsnM2dOHFMH)",
                          "score": 1,
                          "created_utc": 1746803936.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mr76q4n",
          "author": "SheepNation",
          "body": "I recently purchased a 2024 Moto G Stylus as a media device. I like it so much, its replaced my s22 Ultra. \n\nStylus, headphone jack, micro SD slot, and insane battery life. I took it off the charger 3 days ago at 6am. I am finally going to charge it tonight at 10:30pm. It is still at 22%. Three full days!\n\nI also like how light it is compared to the Galaxy.\n\nThe cameras are a downgrade compared to the Galaxy, but that isn't important to me.",
          "score": 6,
          "created_utc": 1746682876.0,
          "replies": []
        },
        {
          "id": "mr6at0m",
          "author": "namerankserial",
          "body": "Yes, but do people that don't write about cell phones on Reddit want that? Two large companies are betting this sells well.",
          "score": 16,
          "created_utc": 1746669134.0,
          "replies": [
            {
              "id": "mr7x8f9",
              "author": "ArdiMaster",
              "body": "Yeah, if you went by Reddit opinions you’d think the iPhone Mini should have been a smash hit, but no. Rather the opposite.",
              "score": 8,
              "created_utc": 1746699065.0,
              "replies": [
                {
                  "id": "mr8ph8g",
                  "author": "Abigail716",
                  "body": "Also Samsung makes a rugged line of phones that are extra waterproof, user replaceable battery, removable storage, and significantly improved ruggedness. It's also cheaper than the normal flagship phones. \n\nIt sells terribly with only commercial clients typically having any interest in it. If you listened to Reddit you would think it would be the best selling cell phone on the planet.",
                  "score": 7,
                  "created_utc": 1746710880.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr6h92x",
          "author": "edvurdsd",
          "body": "And no camera bump please",
          "score": 8,
          "created_utc": 1746671434.0,
          "replies": [
            {
              "id": "mr9ya8k",
              "author": "Stingray88",
              "body": "This annoyed me at first, but I’ve had bumps for 5-6 years now and I don’t even notice it anymore. And I don’t use a case either.",
              "score": 1,
              "created_utc": 1746724226.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr7p0km",
          "author": "Obyson",
          "body": "Replaceable battery please!",
          "score": 3,
          "created_utc": 1746694005.0,
          "replies": []
        },
        {
          "id": "mr7pp6c",
          "author": "unematti",
          "body": "I think xperia is the next phone I'll get. Flagship has all those(unsure about the battery)",
          "score": 3,
          "created_utc": 1746694433.0,
          "replies": [
            {
              "id": "mr7ukf4",
              "author": "caster201pm",
              "body": "you're correct, no removable battery but has a headphone jack and removable sd card!",
              "score": 1,
              "created_utc": 1746697502.0,
              "replies": [
                {
                  "id": "mr8cp5z",
                  "author": "unematti",
                  "body": "I meant big battery in not sure of. Definitely not easily removable\n\nAlso some models rumored to get 4k screen... I'm not sure if that's a plus or a minus",
                  "score": 1,
                  "created_utc": 1746706232.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr69v0h",
          "author": "got-trunks",
          "body": "*Removeable* battery too. \n\nI've been lucky but I know lots of people end up charging like more than once a day which is wild. \n\nMy phone turned 7 last month and is still getting more than a day, I can stretch it to 3 if I'm not using the screen a ton. \n\nIt's not like there's a pocket tax that I'm aware of, not on my clothes at least.",
          "score": 7,
          "created_utc": 1746668810.0,
          "replies": []
        },
        {
          "id": "mr6frp0",
          "author": "jblessing",
          "body": "Seriously this is all I want. I haven't cared about the thickness of my phone in over a decade.",
          "score": 6,
          "created_utc": 1746670884.0,
          "replies": []
        },
        {
          "id": "mr6e4u7",
          "author": "thisischemistry",
          "body": "Hopefully this one fails so hard that companies stop with this nonsense of phones so thin they have no battery life. Give me a smaller, thicker phone please!",
          "score": 4,
          "created_utc": 1746670296.0,
          "replies": []
        },
        {
          "id": "mr6so1s",
          "author": "None",
          "body": "[removed]",
          "score": 1,
          "created_utc": 1746675988.0,
          "replies": [
            {
              "id": "mr6so3s",
              "author": "AutoModerator",
              "body": "Hello, /u/TheRealMisterd! Thanks for contributing. However, your comment has been automatically removed. techradar.com is banned from /r/gadgets due to placement of malicious advertising.\n\n\"Malicious advertisments\" include, but are not limited to:\n\n* Unexpected redirection to other sites, or unexpected opening of additional background tabs\n\n* Ads for scams or malware, such as \"you've won the lottery\" or \"virus detected\".\n\n* Advertisements that run malicious script.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": 1746675989.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr6wx35",
          "author": "culb77",
          "body": "Zoolander went the wrong way. Instead of just making everything smaller, they should’ve made everything flatter.\n\n*Zoolander picks up a 4x6 note card painted to look like a phone. \n\nMore realistic in retrospect.",
          "score": 1,
          "created_utc": 1746677894.0,
          "replies": []
        },
        {
          "id": "mr7a7ho",
          "author": "Gentrified_Tramp",
          "body": "Yes but remember when they got them so thin they would break if you sat on them? Imagine how much money they have been missing out on since they moved away from that",
          "score": 1,
          "created_utc": 1746684833.0,
          "replies": []
        },
        {
          "id": "mr9ojjf",
          "author": "mrheosuper",
          "body": "Redmagic 10 pro fits all of that",
          "score": 1,
          "created_utc": 1746721394.0,
          "replies": []
        },
        {
          "id": "mraabp8",
          "author": "tnnrk",
          "body": "Yeah but this is an echo chamber that doesn’t matter. The general population want thin and light and flashy (If the price is right anyway).",
          "score": 1,
          "created_utc": 1746727679.0,
          "replies": []
        },
        {
          "id": "mrds8ms",
          "author": "Alukrad",
          "body": "I want to honestly buy an mp3 player and fill it up with all my music I have on my PC....\n\nAny recommendations? One with a damn headphone jack? \n\nI had one Chinese mp3 player but the damn thing died on me after a few years of using it.",
          "score": 1,
          "created_utc": 1746775215.0,
          "replies": []
        },
        {
          "id": "mr6ql6e",
          "author": "Don_Pickleball",
          "body": "Why do so many people want a headphone jack?  The thought of going back to wired headphones stresses me out.\n\nThe battery though,  is the thing I have screamed about for years.",
          "score": -4,
          "created_utc": 1746675112.0,
          "replies": [
            {
              "id": "mr7mji3",
              "author": "patstew",
              "body": "Because I don't want to carry an extra box that I need to keep charged up, is expensive, sounds worse, is easier to lose and more attractive to steal. I don't find having a wire from my ear to my pocket particularly annoying at all.",
              "score": 11,
              "created_utc": 1746692398.0,
              "replies": [
                {
                  "id": "mr8iqr0",
                  "author": "Don_Pickleball",
                  "body": "I haven't bought wired headphones in years, are there not USB-C headphones of the same quality? Is there something about a headphone jack that makes it superior to a a USB-C jack?  Would having 2 USB-C jacks be a solution?",
                  "score": 0,
                  "created_utc": 1746708529.0,
                  "replies": [
                    {
                      "id": "mr8jcym",
                      "author": "patstew",
                      "body": "I have several pairs of decent wired headphones already, the adapters are bulky and annoying. Also, I'd be concerned about the port breaking, I've had several devices break due to the usb port failing, and that's just from charging not from being repeatedly bent in your pocket while walking. 3.5mm is much simpler and more robust than usb.",
                      "score": 4,
                      "created_utc": 1746708751.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr9w3sy",
              "author": "kermityfrog2",
              "body": "Because there are still things called audiophile headphones that cost up to thousands of dollars and they still use wires. Wired headphones also just work, and can be \"paired\" with infinite number of devices. They work on planes if you want to watch a movie from the plane entertainment system. If you only have wireless headphones, you have to watch your own media. Having a headphone port on a phone doesn't mean you can't use wireless headphones. However removing the port means you are stuck with wireless only (unless you carry a dongle).\n\nIt's also backwards compatible with a zillion devices. My gym has a speaker system that the instructor needs to plug in a device so that they can pipe in music (relaxing music for yoga and trademarked Les Mills music for other classes). The stereo system uses a standard 3.5mm jack for audio-in. Instructors have to bring their own dongle (because people would lose or steal the dongle if the gym provides it). The 3.5mm cable is zip-tied to the stereo. Instructors have been bringing in their own iPods or dongles.",
              "score": 3,
              "created_utc": 1746723599.0,
              "replies": []
            },
            {
              "id": "mr6zej9",
              "author": "Miraclefish",
              "body": "Personally because I'd like to plug my phone into my car stereo without having to buy a USB C audio adaptor, and sometimes my Sony headphones run out of battery but can work over 3.5mm jack.\n\nI don't see why me having that option makes your phone owning experience worse?",
              "score": 9,
              "created_utc": 1746679057.0,
              "replies": []
            },
            {
              "id": "mraq3l0",
              "author": "JayKay8787",
              "body": "Your getting downvoted, but 95% of people agree with you. It's simply not necessary anymore, and requires way too much internal space when audio can also play through the USB port anyway. I was annoyed when Apple and Samsung got rid of them at first, but wireless headphones have gotten so much better pretty quickly. Idk anyone who would prefer to go back to wired at this point.",
              "score": 1,
              "created_utc": 1746732326.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr6xi58",
          "author": "randologin",
          "body": "Seriously, I already have trouble holding this slippery nonsense. WHO IS ASKING FOR THIS?!",
          "score": 1,
          "created_utc": 1746678162.0,
          "replies": [
            {
              "id": "mr9yeag",
              "author": "Stingray88",
              "body": "I’m asking for it. I never have issues holding my phone, and I don’t use cases.",
              "score": 4,
              "created_utc": 1746724259.0,
              "replies": [
                {
                  "id": "mrea1au",
                  "author": "None",
                  "body": "[removed]",
                  "score": -1,
                  "created_utc": 1746786377.0,
                  "replies": [
                    {
                      "id": "mrfcehe",
                      "author": "Stingray88",
                      "body": "It’s almost like different people have different wants and needs and there’s nothing weird at all about it.",
                      "score": 1,
                      "created_utc": 1746801349.0,
                      "replies": [
                        {
                          "id": "mrfv0fa",
                          "author": "None",
                          "body": "[removed]",
                          "score": 0,
                          "created_utc": 1746807018.0,
                          "replies": [
                            {
                              "id": "mrfw9tk",
                              "author": "Stingray88",
                              "body": "My original comment has more upvotes than yours. Who’s the weirdo here again?",
                              "score": 1,
                              "created_utc": 1746807406.0,
                              "replies": [
                                {
                                  "id": "mrfyb4l",
                                  "author": "randologin",
                                  "body": "4 people... In case you're interested in an honest discussion,  what difference is 1mm thickness going to make? Do you wear skin tight pants or something? Also, the parent comment complaining about the thinness has over 600 likes, so your take is still the outlier.",
                                  "score": 0,
                                  "created_utc": 1746808032.0,
                                  "replies": [
                                    {
                                      "id": "mrg1f81",
                                      "author": "Stingray88",
                                      "body": "> 4 people...\n\n4 more than you.\n\n>In case you're interested in an honest discussion\n\nThat's pretty rich coming from the guy who asked \"WHO IS ASKING FOR THIS?!\" and then when someone gives you an answer, you call them a weirdo.\n\nI was always interested in having an honest discussion. You are not.\n\n> what difference is 1mm thickness going to make?\n\nYou are asking this as if it's a completely negligible difference. My phone today is only 8mm thick, so 1mm is 12.5% of the total, that's not insignificant.\n\nNow, would I be fine if my phone was 1mm thicker? Of course. But how about 2mm? Or 3mm? Where does it end? I've had like a dozen smartphones of various thickness, I survived through all of them. The point is I just prefer thinner/lighter over thicker/heavier, and I don't particularly have any need for what thicker/heavier would gain us... like more battery life, I'm fine with my battery life as is.\n\nThat's my opinion. You have your own opinion. Neither of us are weird for these opinions. Grow up.\n\n>Do you wear skin tight pants or something?\n\nNo, I just don't like thick/heavy shit in my pockets, and there's nothing weird about that.\n\n>Also, the parent comment complaining about the thinness has over 600 likes, so your take is still the outlier.\n\nLet's take it a step further... this comment is on an article about this product existing in the first place. They wouldn't be making these if there wasn't any market for it. I'm not an outlier in the slightest.",
                                      "score": 1,
                                      "created_utc": 1746808983.0,
                                      "replies": [
                                        {
                                          "id": "mrg299n",
                                          "author": "randologin",
                                          "body": "Or maybe it's just cheaper to sell you on novelty than doing anything to increase performance.",
                                          "score": 0,
                                          "created_utc": 1746809237.0,
                                          "replies": [
                                            {
                                              "id": "mrg3y93",
                                              "author": "Stingray88",
                                              "body": "...the hell are you even talking about? This reply doesn't make an ounce of sense.\n\nShrinking electronics is not cheaper, if it were, laptops would be cheaper than desktops of the same performance... and yet they're very much not.\n\nShrinking electronics is also not a novelty, if it were, we'd all be lugging around briefcase phones like it was no big deal.\n\nAnd just how much more performance do you need in your smartphone? Seriously, I haven't had performance issues on a smartphone in getting close to a decade probably. If you had said battery... yeah fair enough... While I don't need more battery life, I can understand why someone else might... but performance? Nah man.",
                                              "score": 1,
                                              "created_utc": 1746809748.0,
                                              "replies": [
                                                {
                                                  "id": "mrh52w5",
                                                  "author": "None",
                                                  "body": "[removed]",
                                                  "score": 0,
                                                  "created_utc": 1746821060.0,
                                                  "replies": [
                                                    {
                                                      "id": "mrh9c9c",
                                                      "author": "Stingray88",
                                                      "body": ">Says the guy that's so hard for a phone that's nearly imperceptibly thinner.\n\nIt's not imperceptible at all. My iPhone 11 Pro and 15 Pro are literally 1mm thicker than my iPhone 7, and the difference was immediately apparent when I first got my 11 Pro.\n\n>I was using performance as a catch all. I mostly meant battery.\n\nOK? Those two things aren't the same thing.\n\n>I'm just annoyed that they're already so thin you can't lay them flat without a case on them because of the cameras.\n\nOK... but you don't seem to have any issue with the phone being bulkier, so just use a case and problem solved? My wife has a case for her phone specifically so it can lay flat. Solved issue.\n\n> I say it's a novelty because you failed to articulate any reason why you NEED it to be even thinner than it already is.\n\nNo, I didn't fail to articulate my opinion at all, actually. Just because you don't agree with my point of view doesn't mean you just get to arbitrarily invalidate it.\n\nWhy do you need more battery life? Because you want it. That's it. That's all the explanation needed. And I'm not questioning you and calling you a weirdo for wanting something I don't want/need.\n\nWhy do I want my phone to be thinner/lighter? Because I want it. That's it. That's all the explanation needed. Why is it so hard for you to accept that I want something that you don't?\n\n>There's a mountain of difference between the added utility of not having a briefcase to hold your phone you can now fit in your pocket and shrinking making something a hair smaller.\n\nSo the point just went completely over your head, huh?\n\nWhere is the line with you? I asked this question and you never answered. Just 1mm thicker is no big deal, you say... right? Well if 1mm thicker isn't a big deal, what about 2mm? What about 3mm? Where's the line? Where is the limit? No really, give me a real answer.\n\nI'll give you a preview of my response... whatever you think is a fine size, I want it thinner/lighter. Imagine that, people have different opinions. I don't have a problem respecting yours... what's so hard for you about respecting mine?\n\n>Clearly you have the soft skinned type of job that likes razor thin bendable phones\n\nHey look, more baseless insults from the guy who claimed he was the one interested in having an honest discussion. What a surprise.\n\nI worked on TV sets carrying heavy equipment around all day when the iPhone 6 came out, the thinnest model iPhone there ever was. I never had a case on it, and never once had an issue with bending. Imagine that.\n\n>with no battery life \n\nThis is objectively false. Like what phone are you even using today that this is such a problem for you? It's not 2012 anymore. Most people today do not struggle with battery life like you seem to be.\n\n>and companies prioritize your wants and needs \n\nDude there are sooooooo many phone models available today. If one model doesn't meet your needs, don't get so bent out of shape about it. Just go buy a different one. This is an absolutely insane take you've got going on here.\n\n>because you can afford such novelties\n\nSo do you not own a smartphone or something? Most people can afford phones. I get that some people can't, but me being able to afford a smartphone doesn't put me in some elite class... the vast majority of people have them.\n\n> It's just annoying for those of us that work for a living.\n\nUh.... I do work for a living. Thanks. I don't know where you are getting the idea I'm some rich person without a job.",
                                                      "score": 1,
                                                      "created_utc": 1746822372.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr823jd",
              "author": "jaweinre",
              "body": "Fucking focus groups maybe lol.\nAll I want is a new pixel 5 sized phone with a plastic non slippery back.",
              "score": 3,
              "created_utc": 1746701620.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr9wvq1",
          "author": "Stingray88",
          "body": "Meanwhile I could give or take all those things, and would love my phone to be thinner/lighter.\n\nHeadphone jack and removable storage I wouldn’t even use. Of course it doesn’t hurt to have them, but I legitimately would not use them. Bigger battery of course I would use… but would I rather that than a size reduction? No. I’m good with my current battery life.",
          "score": 1,
          "created_utc": 1746723823.0,
          "replies": []
        },
        {
          "id": "mr87flm",
          "author": "OkDragonfruit9026",
          "body": "And I want a 17 mini. We are a minority that gets ignored.\n\nEdit: and downvoted, apparently!",
          "score": 0,
          "created_utc": 1746704054.0,
          "replies": [
            {
              "id": "mr9x79b",
              "author": "kermityfrog2",
              "body": "Why downvotes? Sure demand is low and Apple may never make a mini again, but he can't be wrong for having an opinion.",
              "score": 1,
              "created_utc": 1746723915.0,
              "replies": [
                {
                  "id": "mragg1f",
                  "author": "OkDragonfruit9026",
                  "body": "Exactly. It’s “she” though. \n\nI get it, not everybody wants a small phone, but Apple could make one. It would be profitable. I guess there’s just not enough demand to make it VERY profitable. It’s not a 10k Mac Pro.",
                  "score": 2,
                  "created_utc": 1746729469.0,
                  "replies": [
                    {
                      "id": "mramir5",
                      "author": "kermityfrog2",
                      "body": "Well, there you go. Makes even more sense. Women want small phones that can fit in their purse or whatnot.",
                      "score": 1,
                      "created_utc": 1746731261.0,
                      "replies": [
                        {
                          "id": "mrarwd0",
                          "author": "OkDragonfruit9026",
                          "body": "Ehhhh, not really. I’ve got a 16 after 12 and 13 mini, I mostly just prefer something that is manageable in one hand. I know it’s a long-gone era. I miss it.",
                          "score": 1,
                          "created_utc": 1746732863.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mr6wbeg",
          "author": "stannisbaratheonn",
          "body": "Bro these phones are heavy AF. Lighter weight is worth it",
          "score": -3,
          "created_utc": 1746677620.0,
          "replies": [
            {
              "id": "mrca62e",
              "author": "The_Lapsed_Pacifist",
              "body": "Need to get to the gym champ.",
              "score": 1,
              "created_utc": 1746750740.0,
              "replies": [
                {
                  "id": "mrnh6o4",
                  "author": "stannisbaratheonn",
                  "body": "Going to the gym to improve phone holding strength is a very nerd point of view. Nice one",
                  "score": 0,
                  "created_utc": 1746912629.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr8aw01",
          "author": "Syrairc",
          "body": "If you really cared you'd buy the significantly less popular brands that still have some or all of these features.",
          "score": 0,
          "created_utc": 1746705498.0,
          "replies": [
            {
              "id": "mr8dl82",
              "author": "Djghost1133",
              "body": "I do buy those brands, doesn't mean I don't want the higher end phones to have those features as well. It's crazy to me to pay more money for less features",
              "score": 2,
              "created_utc": 1746706582.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr6g7e4",
          "author": "OperatorJo_",
          "body": "Removable storage was removed because apps don't like it. \n\nSure, you could expand your 128gb device to 640 gb but the only thing that will use that storage is music, photos and files. \n\nIf people want more space it's to have more large apps primarily. There's not THAT much benefit to an SD card anymore.",
          "score": -11,
          "created_utc": 1746671044.0,
          "replies": [
            {
              "id": "mr79fdg",
              "author": "Doctor_Philgood",
              "body": "Removable storage was removed because a large number of people just buy a new phone when they run out of space",
              "score": 3,
              "created_utc": 1746684384.0,
              "replies": [
                {
                  "id": "mr8pz20",
                  "author": "Abigail716",
                  "body": "The person you're responding to is not completely right but basically. \n\nOne of the main reasons they got rid of removable storage was people kept buying really cheap low grade microSD cards that had terrible performance. \n\nPeople then associated the terrible performance of this garbage tier Temu Micro SD card with the performance of their actual phone. This is one of the key reasons why so many people used to talk about switching from Android to iPhone and being blown away by how much faster it was.",
                  "score": 2,
                  "created_utc": 1746711045.0,
                  "replies": [
                    {
                      "id": "mr9y0fp",
                      "author": "Doctor_Philgood",
                      "body": "Then wouldnt the obvious solution be to not allow apps to play on them? Picture and video storage should be fine",
                      "score": 1,
                      "created_utc": 1746724147.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mrcmpzv",
              "author": "Neo_Techni",
              "body": "Apps don't need to like it, as Android virtualized the file system in a way allowing apps to be anywhere it wants",
              "score": 1,
              "created_utc": 1746755388.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr9pibz",
          "author": "Napoleon_B",
          "body": "A male USB C to a female USB A adapter allows file transfer to/from thumb drives. I hooked up an external hard drive too. On Apple, the native files app works great for this.",
          "score": 0,
          "created_utc": 1746721680.0,
          "replies": []
        },
        {
          "id": "mrr1rl8",
          "author": "sioux612",
          "body": "Back in the days of 16gb phones I was with you on removable storage. Mainly for expandable storage.\n\n\nBut nowadays phones have such large storage available from the get go and most stuff on my phone already gets backed up to other places so if anything, nowadays I could probably live with a 32gb device much easier than I could years ago.\n\n\nAnd those 32gb would mainly be used for the days when I actually take longer videos.",
          "score": 0,
          "created_utc": 1746972568.0,
          "replies": []
        },
        {
          "id": "mr7znqz",
          "author": "Rakn",
          "body": "Who cares about a headphone jack. Bluetooth is superior. But please give me an SD card slot. That's not so easily replaceable.",
          "score": -6,
          "created_utc": 1746700391.0,
          "replies": [
            {
              "id": "mrbjbhy",
              "author": "eVaan13",
              "body": "Bluetooth is absolutely not superior. Convenient, yes. Superior, nowhere near.",
              "score": 4,
              "created_utc": 1746741170.0,
              "replies": [
                {
                  "id": "mrbnja4",
                  "author": "Rakn",
                  "body": "That depends on how you look at it. Convenience can absolutely make it superior. You are likely talking about audio quality? I wasn't. I don't use my phone to listen to high quality audio. But I use it to take a ton of pictures and store a lot of media.\n\nEdit: if audio quality is important to someone they might want to consider adding a USB-C DAC instead of using the built-in converter for their way too expensive headphones.\n\nAt least if we are talking about audio quality. Otherwise I'm not super sure what the headphone jack is superior at. Once I,be made the switch I've never looked back.",
                  "score": -1,
                  "created_utc": 1746742598.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr6dk6b",
          "author": "TheMacMan",
          "body": "Then buy a different phone. I don't complain that the Toyota Camry doesn't have enough horsepower or enough seats. I just buy something else that fits my needs.",
          "score": -18,
          "created_utc": 1746670093.0,
          "replies": [
            {
              "id": "mr6dy4e",
              "author": "Djghost1133",
              "body": "No phone in the high end market exists with those features.",
              "score": 15,
              "created_utc": 1746670229.0,
              "replies": [
                {
                  "id": "mr6isha",
                  "author": "TheMacMan",
                  "body": "Clearly you aren't the target market for high-end phones.",
                  "score": -19,
                  "created_utc": 1746672005.0,
                  "replies": [
                    {
                      "id": "mr6pqro",
                      "author": "Djghost1133",
                      "body": "That's right, i should keep my expectations low when shelling out good money. This is the same energy as oh you want your xbox one to be offline, well you should just buy the xbox 360 comment",
                      "score": 11,
                      "created_utc": 1746674764.0,
                      "replies": [
                        {
                          "id": "mr6rcx0",
                          "author": "TheMacMan",
                          "body": "You're right, keep crying about it. I'm sure they'll see your tears and completely change their products for one guy who wants something different.",
                          "score": -19,
                          "created_utc": 1746675436.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr6zi33",
              "author": "Miraclefish",
              "body": "Which phone do you suggest they buy with those features exactly? It doesn't exist, cars aren't phones.",
              "score": 1,
              "created_utc": 1746679106.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr6tiy5",
          "author": "DeusSpaghetti",
          "body": "2 out of 3 of those things have gone because of better waterproofing and form factor.",
          "score": -4,
          "created_utc": 1746676365.0,
          "replies": []
        },
        {
          "id": "mr75tdr",
          "author": "BellerophonM",
          "body": "The fact that they're specifically making the iPhone Air and Galaxy S Edge is good news for you, then, since it removes a bit of pressure from the non-Air/Edge phones to push the limits of getting thin.",
          "score": -1,
          "created_utc": 1746682379.0,
          "replies": []
        },
        {
          "id": "mraqyeh",
          "author": "AgencyBasic3003",
          "body": "Go away grandpa. The battery is already lasting more than one day, even if you are permanently doom scrolling. There are so many top of the line Bluetooth Headphpones and removable storage hasn’t been a thing for over a decade.\nThinner devices are pushing company for more efficient technologies (battery density, thinner and more efficient screens, more robust materials). If people like you would dictate the market, we would still use phones that need to be transported in a suitcase.",
          "score": -2,
          "created_utc": 1746732581.0,
          "replies": [
            {
              "id": "mrawclq",
              "author": "Djghost1133",
              "body": "What a great way to show you have no idea what you're talking about",
              "score": 2,
              "created_utc": 1746734174.0,
              "replies": [
                {
                  "id": "ms71a10",
                  "author": "AgencyBasic3003",
                  "body": "Luckily people like you have no say in the market, otherwise we would still stuck in the Middle Ages.",
                  "score": 0,
                  "created_utc": 1747185667.0,
                  "replies": [
                    {
                      "id": "ms72f9q",
                      "author": "Djghost1133",
                      "body": "Oh god people having options! What dark times we used to live in!",
                      "score": 0,
                      "created_utc": 1747186076.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mr7qaod",
          "author": "MulderXF",
          "body": "Eww headphone jack",
          "score": -3,
          "created_utc": 1746694814.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr5vsbm",
      "author": "hiphoptomato",
      "body": "Why are thinner and thinner phones a thing? Is anyone actually asking for this?",
      "score": 177,
      "created_utc": 1746663983.0,
      "replies": [
        {
          "id": "mr5wv1n",
          "author": "Mildly_Irritated_Max",
          "body": "It's 2005's smallest phone contest all over again \nExcept thin.",
          "score": 83,
          "created_utc": 1746664359.0,
          "replies": [
            {
              "id": "mr5zlpb",
              "author": "HobbesNJ",
              "body": "![gif](giphy|l0MYLoXAw7JSyHiZG)",
              "score": 66,
              "created_utc": 1746665316.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr673bo",
          "author": "squidwardsir",
          "body": "We will see soon from the sales. I’m guessing they have pretty extensive analytics that show they will sell good enough surely",
          "score": 11,
          "created_utc": 1746667868.0,
          "replies": []
        },
        {
          "id": "mr60h9i",
          "author": "chronicnerv",
          "body": "Reasons to keep the upgrade cycle going since phones hit their final form factor in 2017. Thinner and lighter screens mean better material efficiency for the manufacturer and more repair revenue from fixing broken screens = more profit. \n\nCustomers want more reliable sturdier phones without the loss of function. Manufactures are still operating on planned obsolescence for more profit.",
          "score": 4,
          "created_utc": 1746665622.0,
          "replies": []
        },
        {
          "id": "mr5vzib",
          "author": "iampuh",
          "body": "Not really",
          "score": 25,
          "created_utc": 1746664053.0,
          "replies": [
            {
              "id": "mr5wbxk",
              "author": "paraxio",
              "body": "They're at the point where innovations are few and far between so they tout things like this as cutting edge, as if anyone is using it without a case anyway",
              "score": 24,
              "created_utc": 1746664173.0,
              "replies": [
                {
                  "id": "mr5wut1",
                  "author": "hiphoptomato",
                  "body": "Wouldn’t a thinner phone at this point just mean less battery and making the phone more fragile overall? I think my iPhone 14 is plenty thin. I have no issues with the size of my phone. It’s like tech companies don’t care what anyone actually wants they just push crap at us and call it “better”.",
                  "score": 21,
                  "created_utc": 1746664357.0,
                  "replies": [
                    {
                      "id": "mr5ziv0",
                      "author": "CamiloArturo",
                      "body": "“I have no issues with the size of my phone” is the main issue.  No one is complaining about the thickness, no one. Maybe someone people about the size (some loved the Mini for example) but no one ever about the thickness",
                      "score": 10,
                      "created_utc": 1746665289.0,
                      "replies": [
                        {
                          "id": "mrbeeby",
                          "author": "zzazzzz",
                          "body": "i am complaining about the thickness of every brands fucking camera tumor. thats an area where pretty much everyone is still failng yet no progress or even a hint of interest in progressing..",
                          "score": 1,
                          "created_utc": 1746739579.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mr5zvk4",
                      "author": "paraxio",
                      "body": "100%",
                      "score": 0,
                      "created_utc": 1746665411.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr5xgih",
                  "author": "Deadz315",
                  "body": "Let's make a phone super slim and make the edges slippery glass like the front and back of the phones. That'll be slick.",
                  "score": 4,
                  "created_utc": 1746664568.0,
                  "replies": []
                },
                {
                  "id": "mr6s8se",
                  "author": "TheBelgianDuck",
                  "body": "All I want is high end Oled phones with SD card reader and removable battery.\n\nI never asked or needed a water resistant phone and where I live and work there are quite a bit of white spots in the network. So having enough local storage is my #1 criteria.",
                  "score": 2,
                  "created_utc": 1746675810.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mr7xvl0",
              "author": "ArdiMaster",
              "body": "Not *on Reddit*, but Reddit isn’t representative.",
              "score": 1,
              "created_utc": 1746699424.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr63yge",
          "author": "guyfrom7up",
          "body": "In these thinness debates, people never mention weight. If a thinner phone is lighter, I’d gladly welcome it.",
          "score": 9,
          "created_utc": 1746666834.0,
          "replies": [
            {
              "id": "mr6a558",
              "author": "schmidtyb43",
              "body": "Not saying lighter wouldn’t be better but I have no issues with the weight of my iPhone 14 pro max so definitely nowhere close to a priority for me",
              "score": 3,
              "created_utc": 1746668907.0,
              "replies": [
                {
                  "id": "mr7hya7",
                  "author": "Green-Salmon",
                  "body": "That’s fine, you’re not the market for a thinner, lighter phone. But I am. I think the current non-max pros are too heavy and would never consider a max. Big ass phones are already the default option, why so much hate because some people don’t want to lug around a brick?",
                  "score": 6,
                  "created_utc": 1746689484.0,
                  "replies": [
                    {
                      "id": "mraif4d",
                      "author": "GrayDaysGoAway",
                      "body": "Brick? Lmao get real, the iphone 16 pro max doesn't even weigh eight ounces. And the hate is because this WILL trickle down and we'll all end up with flimsy phones with shitty battery life.",
                      "score": 1,
                      "created_utc": 1746730048.0,
                      "replies": [
                        {
                          "id": "mrajnum",
                          "author": "Green-Salmon",
                          "body": "Why do you think it’ll trickle down? The opposite has happened: big and thick became the default offering because it’s what people wanted. But there’s still a market for thinner, Lighter phones. \n\nThe iPhone 6 was 4.6 oz, btw. And I could easily use it with just one hand. I don’t need a mini tablet, I’d never “watch content” on a phone. \n\nYou’re scare is going to get smaller and thinner? Did that happen with the iPhone mini?",
                          "score": 1,
                          "created_utc": 1746730412.0,
                          "replies": [
                            {
                              "id": "mras3xa",
                              "author": "GrayDaysGoAway",
                              "body": "It's really ironic you hold up the iphone 6 as some shining example. That piece of shit was so flimsy it was bending in people's pockets. Anybody who worked at an apple store during that era remembers having to post guards by the phone displays because kids kept coming in and bending them all by hand.\n\nThe iphone SE isn't a flagship. We've already seen numerous times that what Apple does with their flagship iphones is copied soon after by every other major manufacturer. Bigger screens, multiple models, notches, headphone jack removal, lopsided camera clusters, etc etc etc.\n\nI'm all for smaller screens but going thinner is just fucking stupid and will have horrible effects on both durability and battery life.",
                              "score": 1,
                              "created_utc": 1746732925.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mr7x460",
                      "author": "None",
                      "body": "[removed]",
                      "score": -1,
                      "created_utc": 1746698997.0,
                      "replies": [
                        {
                          "id": "mr88wwl",
                          "author": "Green-Salmon",
                          "body": "Ah, to be young again. You’ll understand in time.",
                          "score": 1,
                          "created_utc": 1746704682.0,
                          "replies": [
                            {
                              "id": "mr8sqwi",
                              "author": "ultimatefreeboy",
                              "body": "Old people can still lift more than a kg unless they had no exercise at all.",
                              "score": 0,
                              "created_utc": 1746711949.0,
                              "replies": [
                                {
                                  "id": "mragflj",
                                  "author": "Green-Salmon",
                                  "body": "You’re missing the point. It’s not a lack of strength training. A lighter phone just feels better for me, I don’t need a thick and heavy phone just so I can go to bed with 65% battery left.",
                                  "score": 2,
                                  "created_utc": 1746729466.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mr6r39n",
          "author": "gadgetluva",
          "body": "I am. I don’t need a brick. I want a thin, light phone with a high quality display. A single camera is fine for my use case. I can charge during the day and always charge overnight. \n\nI’m tired of carrying bricks in my pocket. And I know I’m not alone. \n\nAnd to the people clamoring for a Mini - no. A small screen is ineffective for the majority of users today.",
          "score": 9,
          "created_utc": 1746675324.0,
          "replies": [
            {
              "id": "mr7guvn",
              "author": "Green-Salmon",
              "body": "I’m with you. I can charge wirelessly at work and in my car. What’s the point of having 65% battery life when I go to bed? I want a lighter phone that doesn’t put a strain on my hand, specially my pinky.\n\nWe’re not all spending the whole day outside, if you work on a desk then you can top off that battery effortlessly. Id rather have the option to carry extra battery capacity when I actually need it (travels). I don’t need it built into the phone, I don’t want a brick that can last two days on a charge.\n\nI don’t get why people get so pissy over having the option. Big ass phones with huge batteries is already the default option.",
              "score": 6,
              "created_utc": 1746688797.0,
              "replies": [
                {
                  "id": "mr7wzez",
                  "author": "ultimatefreeboy",
                  "body": "Don't you put your phone in a case?",
                  "score": 2,
                  "created_utc": 1746698923.0,
                  "replies": [
                    {
                      "id": "mr89kq5",
                      "author": "Green-Salmon",
                      "body": "I like clear tpu cases because they are light and still protect. I specially hate those leather/silicone cases from Apple because they add a lot of bulk and are heavy. I’d never use a battery case, I have thin portable batteries and I don’t mind using that when traveling. \n\nCases will always add bulk and weight. But a thin phone’s case will be lighter than a big ass phone’s case.",
                      "score": 3,
                      "created_utc": 1746704957.0,
                      "replies": []
                    },
                    {
                      "id": "mr9fnym",
                      "author": "gadgetluva",
                      "body": "Dumb argument is dumb. \n\nA thin phone with a case is still thinner than a thick phone with a case. Someone who uses cases on their phones will use a case regardless of form factor.",
                      "score": 2,
                      "created_utc": 1746718801.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr8tvmd",
                  "author": "CakeBakeMaker",
                  "body": "Thin phones don't hurt your fingers trying to hold the thing face wise? I need girth to hold onto.",
                  "score": 1,
                  "created_utc": 1746712308.0,
                  "replies": [
                    {
                      "id": "mr9032m",
                      "author": "Green-Salmon",
                      "body": "That was never an issue before for me, I always use a case  so there always enough girth. The opposite happened: as they got bigger and heavier it became slightly more uncomfortable. With my last 2 phones I immediately noticed they were bigger and heavier. Going from the 6 to the X was specially shocking. I had buyers remorse for a week because of how much thicker and heavier it was",
                      "score": 3,
                      "created_utc": 1746714219.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr6tv8k",
              "author": "hiphoptomato",
              "body": "You consider 6 ounces to be a “brick”?",
              "score": 7,
              "created_utc": 1746676516.0,
              "replies": [
                {
                  "id": "mr6ynoq",
                  "author": "gadgetluva",
                  "body": "The Pro Max weighs 8oz. Add a thicker battery that fills out the camera bump like half of the commenters are asking for and that becomes a brick. \n\nBut if a thin and light phone isn’t for you, then that’s fine. Apple still makes the Pro Max for you. Just get that.",
                  "score": 3,
                  "created_utc": 1746678700.0,
                  "replies": [
                    {
                      "id": "mr7xbvv",
                      "author": "JamesHeckfield",
                      "body": "No.\n \nApple and Samsung need to stop making things I don’t want. Because if I don’t want something, then surely everyone else feels the same way.\n\nRight?",
                      "score": 1,
                      "created_utc": 1746699119.0,
                      "replies": [
                        {
                          "id": "mr9fdek",
                          "author": "gadgetluva",
                          "body": "Sadly, that’s exactly how these smooth melons think about these products, even though most of them are probably using a hand-me-down iPhone 11 with a case that looks like a biological weapon.",
                          "score": 1,
                          "created_utc": 1746718717.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mr5y3gj",
          "author": "WorkO0",
          "body": "It's for the people who hate battery life. Niche market, but there are dozens of us.",
          "score": 6,
          "created_utc": 1746664791.0,
          "replies": []
        },
        {
          "id": "mr5xxrh",
          "author": "slick2hold",
          "body": "They know more than what consumers know.  No one asked for curved screens either but samsung kept shoving it down our throats.   External storage gone.  Removable battery gone.",
          "score": 7,
          "created_utc": 1746664735.0,
          "replies": [
            {
              "id": "mr6scfp",
              "author": "fluteofski-",
              "body": "Years ago I was working lead global procurement for a leading brand in a different industry. And I’ve been in a handful of meetings with the C-suite. One time I asked “why this direction? Are consumers even asking for this?”\n\nAnd the head of product said “the consumer has no idea what they want.” And the head of marketing chimed in “it’s our job to tell them what they want.”\n\nI sat back and pondered that for a minute. Year after year the company would push new cool shit, and consumers would absolutely eat it up. It was wild how good the marketing team was at what they did. \n\nBut here’s the thing. At the end of the day when you take into consideration a development cycle, which can be something like 3 years from idea to production…. If you’re just responding to consumers today, you’re gonna be 3 years too late when the product hits the market. So there’s some merit to what they do when designing the next generation of product.\n\nAll that said…. Sometimes products totally flop. Just the way it is… product development cycles and marketing is absolutely fascinating sometimes.",
              "score": 8,
              "created_utc": 1746675852.0,
              "replies": []
            },
            {
              "id": "mr5z3j1",
              "author": "garbagegoat",
              "body": "External storage is a hill I'll die on. Hell take the audio jack but I absolutely need an sd slot. I just got a One+ after my beloved LG died simply because it still had that feature.",
              "score": 4,
              "created_utc": 1746665144.0,
              "replies": []
            },
            {
              "id": "mr6b3rk",
              "author": "anonymousbopper767",
              "body": "Samsung keeps doing folding bullshit because they have nothing else going on to differentiate themselves with.",
              "score": -2,
              "created_utc": 1746669237.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr5zsc7",
          "author": "Fractoos",
          "body": "Especially when you just end up getting some extra thick armored case to protect it",
          "score": 4,
          "created_utc": 1746665380.0,
          "replies": []
        },
        {
          "id": "mr6afel",
          "author": "BitterUchujin",
          "body": "Right?!? I PROMISE you I am putting my phone in a case that weighs three times as much as the device itself. I don’t care if I have to deadlift the phone if I don’t have to charge the phone every day and sometimes twice a day.",
          "score": 3,
          "created_utc": 1746669005.0,
          "replies": []
        },
        {
          "id": "mr5wngl",
          "author": "octoreadit",
          "body": "The thinnest dick measuring contest. And yes, the results will be the same, no winners 😂",
          "score": 2,
          "created_utc": 1746664287.0,
          "replies": [
            {
              "id": "mr5wxos",
              "author": "hiphoptomato",
              "body": "DM me to get your ass beat",
              "score": 8,
              "created_utc": 1746664384.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr5y43c",
          "author": "ricktor67",
          "body": "They have maxxed out on phone features and are desperate for gimmicks.",
          "score": 1,
          "created_utc": 1746664797.0,
          "replies": []
        },
        {
          "id": "mr61opg",
          "author": "RODjij",
          "body": "Because cellphones are a mature technology that can't advance much more with that we can do currently. \n\nNot much changes between major phones so they go for bigger, foldable screens & thinner devices.",
          "score": 1,
          "created_utc": 1746666047.0,
          "replies": []
        },
        {
          "id": "mr7dgn9",
          "author": "peakedtooearly",
          "body": "Marketing is asking for it.\n\nIt's the equivalent of the wide jeans / skinny jeans cycle for phones.",
          "score": 1,
          "created_utc": 1746686752.0,
          "replies": []
        },
        {
          "id": "mr83zfw",
          "author": "Jazzlike-Spare3425",
          "body": "Well, I assume Apple does it to prototype their foldable iPhone, except just one half of it for now and Samsung does it so they can say they did it before Apple.",
          "score": 1,
          "created_utc": 1746702510.0,
          "replies": []
        },
        {
          "id": "mr5x995",
          "author": "drmirage809",
          "body": "From my experience working in an electronics store: not really. Most people find the thickness and size of their phones to be just fine. A couple people grumble about camera bumps, but that goes away once your phone is in a case anyway.",
          "score": 0,
          "created_utc": 1746664496.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr67p2n",
      "author": "gldoorii",
      "body": "Makes thinner phone, sells additional battery pack that makes the phone the previous thickness.",
      "score": 27,
      "created_utc": 1746668070.0,
      "replies": []
    },
    {
      "id": "mr5wlv5",
      "author": "None",
      "body": "[deleted]",
      "score": 56,
      "created_utc": 1746664271.0,
      "replies": [
        {
          "id": "mr5x2mr",
          "author": "duderguy91",
          "body": "Wait, Samsung won’t let you uninstall a 3rd party app?",
          "score": 16,
          "created_utc": 1746664433.0,
          "replies": [
            {
              "id": "mr60bqh",
              "author": "Lmoneyfresh",
              "body": "My s24 ultra let me uninstall preloaded apps just fine.",
              "score": 24,
              "created_utc": 1746665567.0,
              "replies": []
            },
            {
              "id": "mr6is91",
              "author": "Twombls",
              "body": "You certainly can on my s20 something",
              "score": 2,
              "created_utc": 1746672003.0,
              "replies": []
            },
            {
              "id": "mr5zw15",
              "author": "Fractoos",
              "body": "Only disable stuff that's pre-installed for money",
              "score": 4,
              "created_utc": 1746665416.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr5zutr",
          "author": "sexaddic",
          "body": "Buy a phone that doesn’t have system level 3rd party apps. Vote with your wallet.",
          "score": 11,
          "created_utc": 1746665404.0,
          "replies": [
            {
              "id": "mr69iwq",
              "author": "None",
              "body": "[deleted]",
              "score": 5,
              "created_utc": 1746668695.0,
              "replies": [
                {
                  "id": "mr6amp1",
                  "author": "sexaddic",
                  "body": "Yup! It’s sad because they used to be so good.",
                  "score": 2,
                  "created_utc": 1746669074.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr5xezh",
          "author": "Capitol62",
          "body": "Sure thing! Do you have more money than Facebook? \n\nIf not, then no. They won't do that.",
          "score": 7,
          "created_utc": 1746664553.0,
          "replies": []
        },
        {
          "id": "mr64l5a",
          "author": "magnetar_industries",
          "body": "You can put your phone into developer mode and use ADB to uninstall all the bloatware on your android phone. Maybe not the \"simple option\" but gets the job done.",
          "score": 5,
          "created_utc": 1746667050.0,
          "replies": [
            {
              "id": "mr68pw2",
              "author": "Alternative-Sock-444",
              "body": "Yep. That's what I did with my Galaxy phones before I switched to Pixel",
              "score": 2,
              "created_utc": 1746668415.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr68i5s",
          "author": "Ryujin_707",
          "body": "2 min in ADB uninstaller gets that done. But you guys likes complaining when fixes exist.\n\n\nZero thoughts and zero work to even try and fix it yourself.",
          "score": -7,
          "created_utc": 1746668342.0,
          "replies": [
            {
              "id": "mr72gwf",
              "author": "Miraclefish",
              "body": "You shouldn't have to hack your phone to uninstall a spyware level app, and normalising that isn't great.\n\nYeah you can do that but you absolutely shouldn't have to.",
              "score": 1,
              "created_utc": 1746680596.0,
              "replies": [
                {
                  "id": "mr7twmf",
                  "author": "Ryujin_707",
                  "body": "Lmao this is not hacked phone. It's the bootloader.\n\nSamsung is one of the best companies because it's got an unlocked one. We ask for this because it gives you a control over the hardwere you have. That you bought with your money. \n\nIt's a nice and an amazing thing. You guys can't be please. It's literally a consumer friendly thing. But can't fix dumbass.",
                  "score": 0,
                  "created_utc": 1746697105.0,
                  "replies": [
                    {
                      "id": "mr7w7lj",
                      "author": "Miraclefish",
                      "body": "You've missed my point. \n\nADB is a power user feature that most customers have no idea about.\n\nYou should not have to hack into your phone to uninstall an app you don't want and defending that is shitty.\n\nI should be able to delete Facebook on the phone I spend a thousand pounds on without having to ADB into it.",
                      "score": 1,
                      "created_utc": 1746698477.0,
                      "replies": [
                        {
                          "id": "mr7x0ny",
                          "author": "Ryujin_707",
                          "body": "It's would be nice if it's an as easy as a button press. I do agree but,\n\nNo idea about it = Your problem. I told you it's a simple 2 min work.\n\nTry having a problem on and iPhone for being locked piece of shit. Yeah I can't do anything and got zero fixes. Must be so awesome and consumer friendly.\n\nHell even now Chinese android phone are adopting this locked stuff. You are stuck with Spyware pos.\n\n\nI will not accept the slander against Samsung software. Because by far with Google pixel and oneplus. It's the most friendly and consumer friendly on the market by far.",
                          "score": 0,
                          "created_utc": 1746698943.0,
                          "replies": [
                            {
                              "id": "mr7xpw0",
                              "author": "Miraclefish",
                              "body": "It's not slander if it's true.",
                              "score": 0,
                              "created_utc": 1746699336.0,
                              "replies": [
                                {
                                  "id": "mr7xudg",
                                  "author": "Ryujin_707",
                                  "body": "It's not a true issue if it got a fix. Period.",
                                  "score": 0,
                                  "created_utc": 1746699405.0,
                                  "replies": [
                                    {
                                      "id": "mr7zb0g",
                                      "author": "Miraclefish",
                                      "body": "It's not a fix if it requires owning a PC and learning to ADB into your phone. \n\nIf you could delete it on the phone you'd have a point.",
                                      "score": 0,
                                      "created_utc": 1746700202.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mr5wuh3",
      "author": "PhotoSpike",
      "body": "Can’t wait to see Samsungs new foldable.",
      "score": 21,
      "created_utc": 1746664354.0,
      "replies": []
    },
    {
      "id": "mr6lgfy",
      "author": "Neo_Techni",
      "body": "Please triple it's thickness and fill the entire new space with a battery.",
      "score": 21,
      "created_utc": 1746673031.0,
      "replies": []
    },
    {
      "id": "mr7jfk1",
      "author": "fire2day",
      "body": "Reusing a product name is a choice.",
      "score": 5,
      "created_utc": 1746690421.0,
      "replies": [
        {
          "id": "mr7p2sp",
          "author": "SigmaLance",
          "body": "I was disappointed that it wouldn’t have the side display like the original Edge had.",
          "score": 1,
          "created_utc": 1746694044.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrdeqo6",
      "author": "fedoraislife",
      "body": "Who's the market for this? Reviewers? \n\nThe first thing any normal user does for their $1000+ phone is slap a case on it to protect it, thereby losing any aesthetic benefit a thin phone had. \n\nThey're more prone to breaking, have less battery capacity, less external features and probably run hotter. \n\nI'm sick of phone companies moving backwards with each successive generation.",
      "score": 3,
      "created_utc": 1746767508.0,
      "replies": []
    },
    {
      "id": "mr63i43",
      "author": "blue0231",
      "body": "lol Redditors won’t be happy till we have heavy brick sized phones with unlimited battery.",
      "score": 17,
      "created_utc": 1746666679.0,
      "replies": [
        {
          "id": "mr6iwct",
          "author": "Twombls",
          "body": "They hate you for telling the truth.\n\nTbf most people just want a day out of their phones. As long as it lasts the day they won't care",
          "score": 13,
          "created_utc": 1746672047.0,
          "replies": [
            {
              "id": "mrf59rr",
              "author": "akc250",
              "body": "Except phones that last a day end up not, after the battery degrades in a few years. Maybe it's by design, to force you to upgrade.",
              "score": 0,
              "created_utc": 1746799063.0,
              "replies": [
                {
                  "id": "mrf847k",
                  "author": "Twombls",
                  "body": "Most consumers aren't that forward thinking",
                  "score": 0,
                  "created_utc": 1746799995.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr6rg6d",
          "author": "themadpooper",
          "body": "I get why they want it. I just wish Redditors understood that they are enthusiasts and thus a small minority with a very different viewpoint than most people. I suspect there are a lot of people out there who would love a thinner phone. We’ll see though. I will also be interested to see if any of them are Samsung users. My gut feeling is they’re almost all iPhone users, at least in the US, though I could be wrong.",
          "score": 3,
          "created_utc": 1746675475.0,
          "replies": []
        },
        {
          "id": "mr64ksy",
          "author": "None",
          "body": "I put an extended battery in my Galaxy S2 way back when. I could easily get like a week out of one charge, but goddamn was that phone unwieldy",
          "score": 4,
          "created_utc": 1746667047.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr7d4pv",
      "author": "bbaasbb",
      "body": "So, what if they make very slim phones, but add double the size batteries so the phone has normal thickness? 🤯🤯",
      "score": 2,
      "created_utc": 1746686555.0,
      "replies": []
    },
    {
      "id": "mr67229",
      "author": "ggouge",
      "body": "It want a thicccc phone with long battery life with thick glass and a strong frame. Not a thin phone that dies before noon.",
      "score": 6,
      "created_utc": 1746667856.0,
      "replies": []
    },
    {
      "id": "mr6pau9",
      "author": "carverboy",
      "body": "Meanwhile no one is asking for a thinner phone.",
      "score": 4,
      "created_utc": 1746674585.0,
      "replies": [
        {
          "id": "mr6zuhb",
          "author": "thoreau_away_acct",
          "body": "Just like nobody asked Motorola for rounded screens",
          "score": 2,
          "created_utc": 1746679275.0,
          "replies": []
        },
        {
          "id": "mredamt",
          "author": "BennyboyzNZ",
          "body": "i am",
          "score": 1,
          "created_utc": 1746788076.0,
          "replies": [
            {
              "id": "mregkrs",
              "author": "carverboy",
              "body": "Already forgotten about those bending phones?",
              "score": 1,
              "created_utc": 1746789638.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mr67kjm",
      "author": "VincentNacon",
      "body": "I'm just waiting for the part where we can just plug the device inside our head and never have to recharge it.\n\nJust straight up connect the nerves to the brain and give me the ability to speak all languages and recite all the important data on command. Forget the popup notification, just let me know mentally when I need to drink water and stop me from eating junk that will make me fatter.\n\nDon't need another fancier phone when my old phone is still working fine after dropping it ~~34~~ 35 times so far.\n\n^(EDIT: had to update my drop count.)",
      "score": 1,
      "created_utc": 1746668028.0,
      "replies": []
    },
    {
      "id": "mr6s5jd",
      "author": "hitmonng",
      "body": "It would be hilarious if Apple was trolling everyone with the idea of a thin iPhone Air, and it turned out to be just a prototype for its foldable coming the following year.",
      "score": 1,
      "created_utc": 1746675772.0,
      "replies": []
    },
    {
      "id": "mr6zx0f",
      "author": "TheBaneEffect",
      "body": "“Beating” is a stretch. They’re always first to market but lack in power, every time.",
      "score": 1,
      "created_utc": 1746679309.0,
      "replies": []
    },
    {
      "id": "mr7600k",
      "author": "BellerophonM",
      "body": "People seem to be taking this the wrong way. If they're making a Galaxy Edge and iPhone Air, it means that the regular Galaxy and iPhone won't have to be *quite* as over the top about being as thin as possible.",
      "score": 1,
      "created_utc": 1746682479.0,
      "replies": []
    },
    {
      "id": "mr7cl2l",
      "author": "SSG_Vegeta",
      "body": "I’m in the minority of commenters, where my battery is more than enough on my phones (work and personal). I could stand to lose a bit, but not a major amount. \n\nWhat I want, is an overall smaller phone. \n\nFigure out an iPhone Mini sized phone, somehow thinner and a solid camera like the flagship Androids and iPhone pro’s and I’d immediately grab it. \n\nIt don’t need to be faster, have magical AI or any of that. Just make it far better to carry in my pocket everyday.",
      "score": 1,
      "created_utc": 1746686233.0,
      "replies": []
    },
    {
      "id": "mr7la83",
      "author": "speedyforasloth",
      "body": "\nThen everyone adds a bulky case to not it. Maybe go back to making phones that don’t require cases. Make them tough enough to not need a case.",
      "score": 1,
      "created_utc": 1746691591.0,
      "replies": []
    },
    {
      "id": "mr7o08b",
      "author": "NuclearReactions",
      "body": "Does someone really want it? I want phones to stop growing and to get a proper battery. Until then I'm so done with flagships",
      "score": 1,
      "created_utc": 1746693358.0,
      "replies": []
    },
    {
      "id": "mr7p554",
      "author": "Obyson",
      "body": "I thought we been over this we don't want a phone that's insanely thin it's just awkward to hold, guess I'll be skipping the s25",
      "score": 1,
      "created_utc": 1746694085.0,
      "replies": []
    },
    {
      "id": "mr7qxzv",
      "author": "BigBootyGothKing",
      "body": "Can’t wait to see the camera bump on these",
      "score": 1,
      "created_utc": 1746695232.0,
      "replies": []
    },
    {
      "id": "mr7rba9",
      "author": "Confidentium",
      "body": "I don’t want thin. I want small!!!",
      "score": 1,
      "created_utc": 1746695469.0,
      "replies": []
    },
    {
      "id": "mr818lx",
      "author": "PaulR79",
      "body": "Oh dear are we really back to \"thinnest ever\" crap again? Apple started it in the past and now they've started it back up after a few years of larger batteries.",
      "score": 1,
      "created_utc": 1746701201.0,
      "replies": []
    },
    {
      "id": "mr823pu",
      "author": "PrinceCastanzaCapone",
      "body": "We don’t want less durable phones…",
      "score": 1,
      "created_utc": 1746701622.0,
      "replies": []
    },
    {
      "id": "mr8x7ap",
      "author": "MeBeEric",
      "body": ">beating iPhone 17 Air\n\nIt’s funny how Samsung likes highlighting being “first” like it matters when iPhone 17 Air is nothing but speculation",
      "score": 1,
      "created_utc": 1746713353.0,
      "replies": []
    },
    {
      "id": "mr9c1ud",
      "author": "Nail_Biterr",
      "body": "So, I'm really cool with my Galaxy 23 Ultra.  I still use it and still love it.  But.. can it just have a better battery?  and  why can I buy an SD card with like 1000 TB of data for $4 but it adds another $500 to the phone to get just 1TB? \n\nthat's it.  that's all I want.  a batter that will last 2 days with use (yeah, it's great when they say 'it will last 1 week in stand by mode.  but who uses a phone like that?) and has like 2TB of internal storage.  My HD photos and videos take up a lot of space. \n\nI don't need it any thinner.  I don't need it any faster.  I don't need the screen any clearer.",
      "score": 1,
      "created_utc": 1746717752.0,
      "replies": []
    },
    {
      "id": "mrcdyep",
      "author": "dstarr3",
      "body": "No MicroSD slot, no buy",
      "score": 1,
      "created_utc": 1746752141.0,
      "replies": []
    },
    {
      "id": "mrdu307",
      "author": "albastine",
      "body": "Am I the only one who dislikes thin phones? \n\nI miss my Galaxy S8 active. No case required.",
      "score": 1,
      "created_utc": 1746776400.0,
      "replies": []
    },
    {
      "id": "mre10k6",
      "author": "Jujubatron",
      "body": "Nah I will pass. Not the features I was looking for.",
      "score": 1,
      "created_utc": 1746780859.0,
      "replies": []
    },
    {
      "id": "mrexlfx",
      "author": "Randactbjthroaway",
      "body": "If it was strong, had a good battery equal or better than a normal phone, and didn't have AI bs, then I'd consider it.",
      "score": 1,
      "created_utc": 1746796453.0,
      "replies": []
    },
    {
      "id": "mr779bq",
      "author": "ecleipsis",
      "body": "Does it need a battery pack?",
      "score": 1,
      "created_utc": 1746683169.0,
      "replies": []
    },
    {
      "id": "mr62sv5",
      "author": "AntipodesIntel",
      "body": "It needs to be thinner WITH a user replaceable case. Whoever can give me that actually has a good selling point. No point giving me a phone that doubles in width and doesn't feel as slick once the case is on it.",
      "score": 1,
      "created_utc": 1746666436.0,
      "replies": []
    },
    {
      "id": "mr72mcy",
      "author": "HealthWealthFoodie",
      "body": "But it still won’t fit in 90% of my pockets…",
      "score": 1,
      "created_utc": 1746680675.0,
      "replies": []
    },
    {
      "id": "mr8k0ez",
      "author": "Hikashuri",
      "body": "But it won’t be as thin as the iPhone air so it will lose.",
      "score": 1,
      "created_utc": 1746708984.0,
      "replies": []
    },
    {
      "id": "mr63o6d",
      "author": "OCDGrammarNazi",
      "body": "Nobody wants this. We have been crying out for years for better battery life but they keep saying \"battery life is cool  but not as cool as 'AI, foldable screens, etc', but obviously they know better than us. Why give is better battery life when they can give us a smaller battery but give us mot power hungry apps.\" but it's a small price to look at for cutting edge tech.\".\nWhat marketing research group told these companies that we want smaller batteries with power hungry spps, in a form factor that will bend and break in next to no time\n\nThis is how you alienate your fanbase. Phones that are less convenient and break in no time.\n\nPlanned obselescence. Make shit easier to break so people have to buy a new one under the guise of wear and tear.",
      "score": -5,
      "created_utc": 1746666736.0,
      "replies": []
    },
    {
      "id": "mr7b99p",
      "author": "Theres3ofMe",
      "body": "Just make phones smaller ffs!!! 🤣",
      "score": 0,
      "created_utc": 1746685441.0,
      "replies": [
        {
          "id": "mr9oiqk",
          "author": "ARGHETH",
          "body": "Apple tried, it sold like shit",
          "score": 5,
          "created_utc": 1746721387.0,
          "replies": [
            {
              "id": "mraencb",
              "author": "ant1992",
              "body": "But but but the 100 people on Reddit who purchased the mini said it sold like hotcakes!!",
              "score": 6,
              "created_utc": 1746728936.0,
              "replies": []
            },
            {
              "id": "mrjshi3",
              "author": "Theres3ofMe",
              "body": "Don't get how people qre happy with mini laptops for mobiles.\n\nAs a woman,  it's ridiculously difficult to handle when one handed.",
              "score": 1,
              "created_utc": 1746858660.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mra3rv3",
      "author": "Zapador",
      "body": "I don't get the idea of a really slim phone, how exactly does it matter? It's the width and height that you really feel in the pocket, it doesn't matter much if it is a little thicker or thinner. If anything a very thin phone seems much more likely to break than a thicker one and I can't imagine they managed to fit a typical sized battery.",
      "score": 0,
      "created_utc": 1746725813.0,
      "replies": [
        {
          "id": "mrcc8gt",
          "author": "Shmogt",
          "body": "I agree. They tried this with the s6 and s6 edge back in the day. It was very thin and light. Everyone hated it because it was too thin to hold and the battery life wasn't good. They made all the phones a but thicker with a bigger battery and everyone loved them. Making a super thin phone makes no sense UNLESS it folds. That way it would be as thick as a normal phone when in your pocket but be able to expand into a much larger phone",
          "score": 2,
          "created_utc": 1746751507.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr8onmd",
      "author": "littlethrowawaybaby",
      "body": "We don’t care.",
      "score": 0,
      "created_utc": 1746710600.0,
      "replies": []
    },
    {
      "id": "mru2ok8",
      "author": "hkvincentlee",
      "body": "What the fuck are these companies doing man",
      "score": 0,
      "created_utc": 1747009103.0,
      "replies": []
    },
    {
      "id": "mr8otjy",
      "author": "epidemica",
      "body": "Who is asking for these phones?\n\nThe last time I cared about how thin my phone is was...never.\n\nI would like more battery life, better cell reception, an ergonomic shape, expandable storage space, a headphone jack, durability...",
      "score": -1,
      "created_utc": 1746710656.0,
      "replies": []
    },
    {
      "id": "mr93blc",
      "author": "NotAnotherBlingBlop",
      "body": "Who TF is even asking for thinner phones",
      "score": -1,
      "created_utc": 1746715184.0,
      "replies": []
    },
    {
      "id": "mr9n9uf",
      "author": "geek_fit",
      "body": "Who is the market asking for a thinner for in exchange for worse battery life?",
      "score": -1,
      "created_utc": 1746721019.0,
      "replies": []
    },
    {
      "id": "mr9z7p0",
      "author": "RodneyRuxin18",
      "body": "Who is asking for mega thin phones that will snap like a cracker? Seriously who wants this?",
      "score": -1,
      "created_utc": 1746724498.0,
      "replies": []
    },
    {
      "id": "mra2g1i",
      "author": "pataconconqueso",
      "body": "I dont think anyone is askinf for thinner phones, the batteries are getting worse and worse wirh each model",
      "score": -1,
      "created_utc": 1746725435.0,
      "replies": [
        {
          "id": "mrdu6jp",
          "author": "albastine",
          "body": "Planned obsolescence",
          "score": 1,
          "created_utc": 1746776463.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr9mlyv",
      "author": "Straight-Rule3264",
      "body": "Reusing the 'S25' and 'EDGE' naming scheme is also crazy, but so is making thinner phones that no one is asking for, so...",
      "score": -2,
      "created_utc": 1746720819.0,
      "replies": []
    },
    {
      "id": "mr6jlw9",
      "author": "shugo7",
      "body": "Because we want a thinner smart phone am I right?",
      "score": -4,
      "created_utc": 1746672318.0,
      "replies": []
    },
    {
      "id": "mr74a8l",
      "author": "Alloy202",
      "body": "There is no reason at all to make phones even thinner other than to sell more expensive ridged cases to protect them just adding the thickness back with no benefits. Phones should be getting thicker to increase battery and improve thermals. \n\nVote with your wallets",
      "score": -3,
      "created_utc": 1746681554.0,
      "replies": []
    }
  ]
}