{
  "post": {
    "title": "Nintendo Breaks Silence On Switch 2 Rumors | “The gaming hardware that Genki is claiming to be Nintendo hardware at CES is unofficial and was not provided to the company by Nintendo.”",
    "author": "a_Ninja_b0y",
    "id": "1hy5zf0",
    "score": 1022,
    "created_utc": 1736520434.0,
    "selftext": "",
    "num_comments": 77,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hy5zf0/nintendo_breaks_silence_on_switch_2_rumors_the/"
  },
  "comments": [
    {
      "id": "m6eqe55",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736520434.0,
      "replies": []
    },
    {
      "id": "m6eqy2p",
      "author": "Phx86",
      "body": "That doesn't mean it isn't right, just that they didn't want them to have it...",
      "score": 399,
      "created_utc": 1736520617.0,
      "replies": []
    },
    {
      "id": "m6esdv5",
      "author": "klorophane",
      "body": "Wasn't this already widely known? AFAIK they were pretty upfront in saying it was an in-house model of the switch 2, not an actual switch 2.",
      "score": 210,
      "created_utc": 1736521079.0,
      "replies": [
        {
          "id": "m6ex6r6",
          "author": "blacksoxing",
          "body": "I'll admit that I was never informed of that. I think though I can easily pinpoint what has happened:\n\n- \"Leak\" happened\n\n- Genki goes \"whoa, this is unofficial!!!\"\n\n- You comprehend that \n\n- Millions of blog posts come across my Google News + the flood of social media posts, which never imply this news\n\n- I read this article and find out that this was unofficial and not provided by Nintendo\n\n- I then read your comment and go \"....how the hell you already know this?!?!?\" \n\nAnd this is how information passes through on the net where it's old news to you and others, but new news to me and others",
          "score": 62,
          "created_utc": 1736522594.0,
          "replies": [
            {
              "id": "m6h20z9",
              "author": "AuroraFinem",
              "body": "It’s rare that any early test devices are directly given by the manufacturers other than specific circumstances. Nintendo likely provided spec sheets so that developers and 3rd party accessory providers can begin design around the performance and form factor. It’s not like they hand them an actual prototype, those are usually made in-house.\n\nMost of this is speculation, but the chances of anyone having an actual official pre-release version of the switch 2, outside a very select few instances, is very slim. This is pretty standard for devices in general unless they’re a brand new line of devices where there’s no previous context to go off of. Like the original switch probably had more prototype devices because it was a completely new device with new form factor and new internals, everything. The switch 2 is a modular update with better specs, modified form factor but that’s about it.",
              "score": 9,
              "created_utc": 1736545057.0,
              "replies": [
                {
                  "id": "m6uj744",
                  "author": "ArtOfWarfare",
                  "body": "I’m under the impression Nintendo is already well into mass production of the Switch 2. They’ve said on several occasions that millions of units will be available on launch day.",
                  "score": 2,
                  "created_utc": 1736731495.0,
                  "replies": [
                    {
                      "id": "m6v57an",
                      "author": "AuroraFinem",
                      "body": "True, but the model was not from mass production and you could tell. It wasn’t even properly serialized iirc. It was either early commercial copy for 3rd party creators or an inhouse one of those",
                      "score": 1,
                      "created_utc": 1736739284.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m6q7fxj",
              "author": "oomfaloomfa",
              "body": "Galaxy brain over here",
              "score": 0,
              "created_utc": 1736679485.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m6etc4n",
      "author": "Joshawott27",
      "body": "Remember when Nintendo said there were no plans for a 3DS XL, only to announce it less than a month or so later?",
      "score": 98,
      "created_utc": 1736521386.0,
      "replies": [
        {
          "id": "m6gzdvf",
          "author": "Dairunt",
          "body": "Or how there was a GBA emulator online even before the GBA launched.",
          "score": 35,
          "created_utc": 1736544265.0,
          "replies": [
            {
              "id": "m6izlxu",
              "author": "ShiaLabeoufsNipples",
              "body": "I didn’t know that, that’s hilarious!",
              "score": 14,
              "created_utc": 1736568930.0,
              "replies": []
            },
            {
              "id": "m6ktgse",
              "author": "Fit_Specific8276",
              "body": "before it launched in north america* it was out in japan which is how it leaked",
              "score": 10,
              "created_utc": 1736605034.0,
              "replies": [
                {
                  "id": "m6ln2rj",
                  "author": "DuckDatum",
                  "body": "This is wild to me. I remember playing GBA, the SP, and the GBC back when I was a wee one. I also remember from that time frame, internet was slow as shit and viruses were inside everything you clicked on. How the hell was there a functional GBA emulator so soon? It seems like an incredible feat, actually.",
                  "score": 7,
                  "created_utc": 1736615034.0,
                  "replies": [
                    {
                      "id": "m6o5swo",
                      "author": "Fit_Specific8276",
                      "body": "the GBA being somewhat similar to the original helped that process A LOt",
                      "score": 3,
                      "created_utc": 1736644139.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m6et4po",
      "author": "Granum22",
      "body": "Yeah the assumption is they got the specs from the factory manufacturing it, not Nintendo themselves.",
      "score": 41,
      "created_utc": 1736521319.0,
      "replies": []
    },
    {
      "id": "m6gvodz",
      "author": "DankDefusion",
      "body": "Nintendo also has a proven track record of lying through their teeth.",
      "score": 23,
      "created_utc": 1736543154.0,
      "replies": []
    },
    {
      "id": "m6essri",
      "author": "None",
      "body": "Uh, no shit?",
      "score": 20,
      "created_utc": 1736521211.0,
      "replies": []
    },
    {
      "id": "m6klprp",
      "author": "heatedhammer",
      "body": "They never said it wasn't real.........",
      "score": 5,
      "created_utc": 1736601847.0,
      "replies": []
    },
    {
      "id": "m6nmp5u",
      "author": "akgis",
      "body": "Nintendo: The hardware will be actualy worst than that!",
      "score": 4,
      "created_utc": 1736637828.0,
      "replies": []
    },
    {
      "id": "m6lfxc2",
      "author": "vincec36",
      "body": "They should call it the Super Nintendo Switch",
      "score": 6,
      "created_utc": 1736612806.0,
      "replies": []
    },
    {
      "id": "m6f5v1w",
      "author": "drc84",
      "body": "More brilliant reporting from Kotaku. What else would you expect.",
      "score": 9,
      "created_utc": 1736525212.0,
      "replies": [
        {
          "id": "m6ffzrs",
          "author": "Huntguy",
          "body": "They’re a shell of their former self, used to be my go to website for gaming news, now you couldn’t pay me to read an entire kotaku article. Always seems like they’re whining or complaining about something for clicks. Dog trash.",
          "score": 14,
          "created_utc": 1736528151.0,
          "replies": [
            {
              "id": "m6hbat7",
              "author": "TitleVisual6666",
              "body": "When was “their former self” a thing for you because around 2012 was when I dropped them for the same reason",
              "score": 7,
              "created_utc": 1736547921.0,
              "replies": [
                {
                  "id": "m6hbnw2",
                  "author": "Huntguy",
                  "body": "Honestly probably around then. It’s definitely over 10 years ago I couldn’t pinpoint the exact date. Don’t get me wrong. I’m pretty left leaning but, Jesus man.",
                  "score": 3,
                  "created_utc": 1736548037.0,
                  "replies": [
                    {
                      "id": "m6hnyed",
                      "author": "TitleVisual6666",
                      "body": "Yep, same. For me it was their [grade-A journalism on Bayonetta 2](https://kotaku.com/actually-it-is-kinda-b-s-that-bayonetta-2-is-a-wii-u-5945445), there used to be several more but I swear they’ve deleted them (or I can’t find them, maybe it was the writer’s personal blogs or something). \n\nThen of course they published the article claiming a Persona 5 song contains a slur, and when corrected by the voice actors of Persona 5, they doubled down and did not correct the article before eventually apologizing. \n\nJust sloppy, baiting journalism all around.",
                      "score": 5,
                      "created_utc": 1736552077.0,
                      "replies": [
                        {
                          "id": "m6u8frg",
                          "author": "NeverComments",
                          "body": "Kotaku started under Gawker Media, so they were a clickbait rag from the offset. The couple years where they managed to appear credible was an anomaly in their overall history. ",
                          "score": 2,
                          "created_utc": 1736727995.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m6g36cj",
              "author": "MR1120",
              "body": "Every article reads like AI clickbait",
              "score": 2,
              "created_utc": 1736534820.0,
              "replies": [
                {
                  "id": "m6guscs",
                  "author": "Huntguy",
                  "body": "And did before the prominence of ai too. Their writers are just, really, really bad.",
                  "score": 2,
                  "created_utc": 1736542883.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m6gb6qs",
              "author": "None",
              "body": "Everything G/O owns that used to be worth a fuck is no longer.",
              "score": 5,
              "created_utc": 1736537142.0,
              "replies": []
            },
            {
              "id": "m6hhjmv",
              "author": "Gram64",
              "body": "Fun fact, Nintendo has completely blacklisted kotaku, because they wrote an article about Metroid Dread getting leaked early on emulators, and the original article was very pro leaking and emulating their games.",
              "score": 2,
              "created_utc": 1736549923.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m6g6jq5",
      "author": "Top5hottest",
      "body": "We are pretty much done with the switch. At least 10 different controller breaks at 70 bucks a pop. That is just extortion. Shame on Nintendo.",
      "score": 6,
      "created_utc": 1736535782.0,
      "replies": [
        {
          "id": "m6gxf9c",
          "author": "TotoCocoAndBeaks",
          "body": "I got lucky, after three sets of drifting cons i switched to pro controller and it hasnt drifted in years. I know many peoples pros do drift",
          "score": 10,
          "created_utc": 1736543677.0,
          "replies": []
        },
        {
          "id": "m6iprjs",
          "author": "Estrava",
          "body": "I’ve had two controllers break out of 8, and I sent them into Nintendo out of warranty and they return a new one… how was your warranty experience and what do you do with them…",
          "score": 4,
          "created_utc": 1736565167.0,
          "replies": [
            {
              "id": "m6j049a",
              "author": "Blightious",
              "body": "Yeah well if you send in a switch lite for drift they wipe it.  Which sucks and is understandable but Make sure you have your saves and videos backed up to another switch or cloud.",
              "score": 1,
              "created_utc": 1736569144.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m6i3kdt",
          "author": "bbob_robb",
          "body": "I thought Nintendo repairs joycons for free?",
          "score": 6,
          "created_utc": 1736557390.0,
          "replies": [
            {
              "id": "m6os81v",
              "author": "AKaeruKing",
              "body": "What are you asking?",
              "score": -6,
              "created_utc": 1736652027.0,
              "replies": [
                {
                  "id": "m6ov81o",
                  "author": "bbob_robb",
                  "body": "I was surprised that the person I was responding to spent $700 on broken switch controllers and called it extortion.  I have heard that Nintendo will replace joycons for free. I was wondering if they were unable to get free repairs.",
                  "score": 3,
                  "created_utc": 1736653181.0,
                  "replies": [
                    {
                      "id": "m6p1o4n",
                      "author": "AKaeruKing",
                      "body": "*I thought Nintendo repairs Joy-Cons for free.",
                      "score": -6,
                      "created_utc": 1736655789.0,
                      "replies": [
                        {
                          "id": "m6p4wqe",
                          "author": "bbob_robb",
                          "body": "I'm dyslexic, was there something other than spelling \"Joy-Con\" as \"joycon\" that was confusing?",
                          "score": 3,
                          "created_utc": 1736657203.0,
                          "replies": [
                            {
                              "id": "m6pf0u5",
                              "author": "None",
                              "body": "[removed]",
                              "score": -4,
                              "created_utc": 1736662124.0,
                              "replies": [
                                {
                                  "id": "m6rx67a",
                                  "author": "bbob_robb",
                                  "body": "Conversationally, it's entirely acceptable to frame a question as an uncertain declaration.  When writing that statement, there should be a question mark at the end.\n\nThe question in that situation must be derived from context. Asking a question in this way is often more efficient as it is open ended.\n\nIn this particular case, it was faster and more efficient than trying to make assumptions by asking a series of follow up questions.\n\nIf someone says they had to \"go feed the dog.\" I might respond:\n\n\"You have a dog?\"\n\nThis both shows that I didn't know that they had a dog and also asks for some context.  \"You have a dog\" is a statement, not a question.   Writing it without a question mark would be grammatically incorrect.\n\nYou properly inferred that I was asking a question, perhaps only because you saw my question mark.  The question mark was clearly important.  \n\nI hope that this exchange helps you figure out if uncertain declarations are a question in future conversations.\n\nBest of luck!",
                                  "score": 1,
                                  "created_utc": 1736703434.0,
                                  "replies": [
                                    {
                                      "id": "m6s5iux",
                                      "author": "AKaeruKing",
                                      "body": "Nope. Question marks are only for questions.\n\nI wonder…\nI think…\n\nAnd so on, are statements.",
                                      "score": 1,
                                      "created_utc": 1736705775.0,
                                      "replies": [
                                        {
                                          "id": "m6wo6bg",
                                          "author": "Standard-Peach-6494",
                                          "body": "And yet everyone else, other than you, knew what op was getting at and no one else had an issue with it. Self reflection?",
                                          "score": 1,
                                          "created_utc": 1736769419.0,
                                          "replies": [
                                            {
                                              "id": "m6wvm7c",
                                              "author": "AKaeruKing",
                                              "body": "Bruv, I’m not having an issue. I’m being purposefully obtuse because I can’t believe question mark usage is actually that complicated.",
                                              "score": 1,
                                              "created_utc": 1736772963.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m6thxwa",
          "author": "Jonny511",
          "body": "I ended up buying 3rd party joysticks that use magnets instead of mechanical connections. That solves the problem of any future drift problems. It cost about $20 and took maybe 20 minutes to swap them in.",
          "score": 1,
          "created_utc": 1736719645.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m6ffszh",
      "author": "narwhal_breeder",
      "body": "in other words: \"its real and they are never getting early access for accessory design ever again\"",
      "score": 3,
      "created_utc": 1736528097.0,
      "replies": []
    },
    {
      "id": "m6etndk",
      "author": "Thrillhouse74",
      "body": "These feels like that whole iPhone leak years ago...",
      "score": 1,
      "created_utc": 1736521486.0,
      "replies": []
    },
    {
      "id": "m6g1nbz",
      "author": "GeorgeStamper",
      "body": "1080p!",
      "score": 1,
      "created_utc": 1736534381.0,
      "replies": []
    },
    {
      "id": "m6o1hjm",
      "author": "AfroSamuraii_",
      "body": "Literally anything that doesn’t come from Nintendo is unofficial. Doesn’t mean it isn’t true.",
      "score": 1,
      "created_utc": 1736642697.0,
      "replies": []
    },
    {
      "id": "m6ftnbl",
      "author": "parker1019",
      "body": "So why did the serial number supposedly register correctly within the Nintendo registration portal…..????",
      "score": 1,
      "created_utc": 1736532081.0,
      "replies": [
        {
          "id": "m6g7cwc",
          "author": "ScurryScout",
          "body": "“Not official” and “not provided by Nintendo” don’t mean the same thing as “fraudulent”. \n\nMy guess is the joycons in the photo are real but the photo wasn’t supposed to have been taken and the hardware Genki has was 3d printed by them but matches the Switch 2’s shape.",
          "score": 6,
          "created_utc": 1736536017.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m6lw7oq",
      "author": "CluelessSage",
      "body": "I’m getting tired of Nintendo being SOOOO hush hush about the switch 2. Give us some details you fucking cowards, what are you afraid of?",
      "score": 1,
      "created_utc": 1736617887.0,
      "replies": []
    },
    {
      "id": "m6fezy5",
      "author": "Fredasa",
      "body": "Are people mostly just excited at the prospect of potentially playing Nintendo games in 4K without having to emulate them, albeit through the use of DLSS-equivalent?  I feel like most Nintendo owners actually don't really care if the Switch itself is upgraded or not.",
      "score": 0,
      "created_utc": 1736527868.0,
      "replies": [
        {
          "id": "m6fp718",
          "author": "konnichi1wa",
          "body": "We’re just sick of everything being blurry and at 10 fps if they try and be ‘open world’",
          "score": 3,
          "created_utc": 1736530811.0,
          "replies": [
            {
              "id": "m6fq7k8",
              "author": "Fredasa",
              "body": "I think that'll work out well as long as we're talking about the system's actual screen resolution (1080p?).  And you're not picky about antialiasing.\n\nPersonally, I've been sitting on the latest Zelda all this time because I'm waiting until I can reasonably add a raytracing layer to it.  Sunk cost at this point.  May as well go for broke.",
              "score": 1,
              "created_utc": 1736531101.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m6g3ifk",
      "author": "Discobastard",
      "body": "No interest tbt PS5 and Portal is just too fucking good and all you do is recycle the same crap and exploit your fan base.",
      "score": -3,
      "created_utc": 1736534916.0,
      "replies": []
    },
    {
      "id": "m6esx56",
      "author": "CappuccinoCincao",
      "body": "Because you Nintendo Fucks won't release it already, it's been what is it, 8 years since Switch 1?\nAlways late to release something, and always with an outdated hardware!",
      "score": -41,
      "created_utc": 1736521251.0,
      "replies": [
        {
          "id": "m6etjng",
          "author": "byOlaf",
          "body": "Yeah and all it gets them is the biggest selling video game console of all time. Stupid jerks!",
          "score": 39,
          "created_utc": 1736521453.0,
          "replies": [
            {
              "id": "m6kj7zb",
              "author": "LadyLibertea",
              "body": "With profit per sale! How dare!",
              "score": 3,
              "created_utc": 1736600708.0,
              "replies": []
            },
            {
              "id": "m6ewzxd",
              "author": "Jeremy64vg",
              "body": "PS2 still outsold switch, but I get ur point",
              "score": -9,
              "created_utc": 1736522535.0,
              "replies": [
                {
                  "id": "m6fau8l",
                  "author": "byOlaf",
                  "body": "As a dvd player, sure. But as a pure games console the switch is tops.",
                  "score": 3,
                  "created_utc": 1736526664.0,
                  "replies": [
                    {
                      "id": "m6jbjax",
                      "author": "Jeremy64vg",
                      "body": "I mean, yea... it sold well cause of its capabilities at the time, it still outsold Switch and so did the DS. I am not saying the switch wasnt wildly successful.\n\nCrazy to get downvoted for saying a verifiable fact lol.",
                      "score": 3,
                      "created_utc": 1736574461.0,
                      "replies": [
                        {
                          "id": "m6kzmcm",
                          "author": "byOlaf",
                          "body": "Yeah, ignore the downvotes. You are correct, the switch won’t outsell the ps2 for another year or so in absolute units. But there were a lot of ps2’s that were sold mainly or exclusively as a dvd player since it was the cheapest dvd player at the time. So in terms of gamers the switch is ahead.\n\nIn reality the iPhone is the biggest selling gaming device of all time no contest…",
                          "score": 2,
                          "created_utc": 1736607362.0,
                          "replies": [
                            {
                              "id": "m6l0yws",
                              "author": "Jeremy64vg",
                              "body": "Thats entirely fair.",
                              "score": 2,
                              "created_utc": 1736607845.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m6ev9n2",
              "author": "thefpspower",
              "body": "So the objective it to not change anything until people lose interest, got it.\n\nTrue Nokia moment right there.\n\nMaybe they should wait for the Steam Deck to take over, that way they don't have to bother doing anything.",
              "score": -19,
              "created_utc": 1736521996.0,
              "replies": [
                {
                  "id": "m6expt2",
                  "author": "Suired",
                  "body": "Until the steam deck has new Nintendo IPs, won't happen. You don't buy a Nintendo because it is the latest and greatest in tech, you buy it for Mario, zelda, Samus, and others that only exist on that platform and have highly polished games using the hardware.",
                  "score": 18,
                  "created_utc": 1736522759.0,
                  "replies": [
                    {
                      "id": "m6f03yx",
                      "author": "neonlights326",
                      "body": "Yeah, remember how well the GameCube and the Wii U sold because of those great Nintendo IPs?",
                      "score": -9,
                      "created_utc": 1736523491.0,
                      "replies": [
                        {
                          "id": "m6f7f6f",
                          "author": "Suired",
                          "body": "Remember how poorly the Wii and DS sold because their tech was behind their competitors?",
                          "score": 11,
                          "created_utc": 1736525673.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m6euxkg",
              "author": "CappuccinoCincao",
              "body": "[There you are](https://i.kym-cdn.com/photos/images/original/002/192/415/fe9.jpg)",
              "score": -18,
              "created_utc": 1736521891.0,
              "replies": [
                {
                  "id": "m6fakzk",
                  "author": "byOlaf",
                  "body": "I wasn’t defending the company, I was pointing out how stupid your argument is.",
                  "score": 8,
                  "created_utc": 1736526590.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m6fdxau",
          "author": "thatguywithawatch",
          "body": "They should hire you on as a consultant to help get them out of their dire financial straits",
          "score": 6,
          "created_utc": 1736527558.0,
          "replies": []
        },
        {
          "id": "m6ewrps",
          "author": "other_usernames_gone",
          "body": "Better than releasing a new one with minor changes every year (like every phone company).\n\nOutdated hardware is fair but its meant for casual play. Older hardware makes it cheaper.",
          "score": 2,
          "created_utc": 1736522464.0,
          "replies": []
        },
        {
          "id": "m6f5raj",
          "author": "gman5852",
          "body": "No. Leaks actually happen regardless of how long the previous product was released.\n\nCommon sense man, use it.",
          "score": 0,
          "created_utc": 1736525181.0,
          "replies": [
            {
              "id": "m6f8mv7",
              "author": "CappuccinoCincao",
              "body": "There's never a leak case as egregious as this whereas a 3rd party company made a mock model of it and show it in a convention, ever.\n\nCommon sense man, use it.",
              "score": -3,
              "created_utc": 1736526026.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}