{
  "post": {
    "title": "Researchers have developed a handheld device that could potentially replace stethoscopes as a tool for detecting certain types of heart disease.",
    "author": "chrisdh79",
    "id": "1juamzd",
    "score": 1257,
    "created_utc": 1744109471.0,
    "selftext": "",
    "num_comments": 63,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1juamzd/researchers_have_developed_a_handheld_device_that/"
  },
  "comments": [
    {
      "id": "mm2vmi3",
      "author": "Emademademad",
      "body": "Nobody uses a stethoscope to detect heart disease. \n\nIt's at most a crude tool to exclude heart disease. \n\nNo one actually listens to the heart with their stethoscope and thinks, \"ah hah a systolic midejection murmur with radiation to the carotids - no need for confirmatory echocardiogram just move directly to the trans catheter aortic valve replacement!\"\n\nFucking dumb ass article.",
      "score": 56,
      "created_utc": 1744137692.0,
      "replies": [
        {
          "id": "mm3tnik",
          "author": "S_A_N_D_",
          "body": "This was my thought. Not to mention there are already handheld EKG's the size of a credit card capable of giving 6 lead data. In other words, there is already a handheld device that exceeds this one. \n\nhttps://kardiamobile.ca/products/kardiamobile6l\n\nNow, I'd love for an expert to chime in here to give their opinion on whether there sounds that don't translate to an EKG, because unless there is something that sound gives that an EKG doesn't, this device is already obsolete.",
          "score": 16,
          "created_utc": 1744147618.0,
          "replies": [
            {
              "id": "mm5zuaz",
              "author": "pairoflytics",
              "body": "You’re looking at two related but very different things with a stethoscope and an EKG. The EKG shows electrical conduction of the heart. The stethoscope listens to the closure of the valves. You can have a relatively normal EKG with absent heart tones and absent pulse - it’s called PEA, or pulseless electrical activity. An EKG tells us very little about how well the heart is mechanically functioning.",
              "score": 3,
              "created_utc": 1744176902.0,
              "replies": [
                {
                  "id": "mm7qruz",
                  "author": "S_A_N_D_",
                  "body": "OK, this is the reply I was looking for. I figured if it was apparent by sound it would be apparent electrically, but I'm also not an expert. Thanks for the correction.",
                  "score": 2,
                  "created_utc": 1744207975.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mm5lims",
          "author": "DanielCA77",
          "body": "It’s not uncommon for primary care doctors to detect a murmur on exam with a stethoscope and then order an echo which leads to the diagnosis of severe valvular heart disease.  Stethoscopes are still useful.",
          "score": 3,
          "created_utc": 1744170049.0,
          "replies": []
        },
        {
          "id": "mm3slcr",
          "author": "nomjs",
          "body": "Those 80+ year old cardiologists definitely still declare shit like this with their stethoscopes lol; but the confirmatory tests are also ordered",
          "score": 4,
          "created_utc": 1744147286.0,
          "replies": []
        },
        {
          "id": "mm4bs25",
          "author": "Dedb4dawn",
          "body": "Was having chest pains about a month back. Went into A&E (UK) where they took my pulse, BP, did an EKG and blood tests. \n\nAt no point did anyone even wave a stethoscope in my general direction. Can’t remember the last time I actually saw one in use. Thankfully turned out to be a really bad anxiety attack rather than anything more serious.",
          "score": 2,
          "created_utc": 1744153591.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm0j7ix",
      "author": "Oiggamed",
      "body": "Was there something wrong with the stethoscope?",
      "score": 78,
      "created_utc": 1744110129.0,
      "replies": [
        {
          "id": "mm0lgy0",
          "author": "dstevens25",
          "body": "Requires training to use. \n\nAlot of user to user intervariability\n\nSounds are still muffled at times and when you move the tubing itninterferes with the sound \n\nPatient boby habitus impacts sounds\n\nA cardiologist vs a family doctor listening to your heart.... the cardiologist will hear things that the family doc may miss. \n\nSource : nurse who uses a stethoscope multiple times a day",
          "score": 101,
          "created_utc": 1744111237.0,
          "replies": [
            {
              "id": "mm1f5t9",
              "author": "Honest-Layer9318",
              "body": "My GP asked if I had a murmur because of a heart valve issue he saw in my notes.  I said no, I have a systolic click. His response was “I won’t hear that so I’ll take your word for it”.  I appreciated his honesty. A cardiologist diagnosed my issue with only a stethoscope.",
              "score": 22,
              "created_utc": 1744122359.0,
              "replies": [
                {
                  "id": "mm1ysk0",
                  "author": "IlGssm",
                  "body": "In fairness, cardiologists usually have significantly better stethoscopes than the average GP. It’s not just a difference in skill (though obviously that’s part of it) but also equipment.",
                  "score": 24,
                  "created_utc": 1744128214.0,
                  "replies": [
                    {
                      "id": "mm42q16",
                      "author": "ThunderDungeon02",
                      "body": "No it's definitely skill. Anybody can buy a cardiology scope. Maybe a nurse is using your basic littmann, but no GP is. The difference is training. A cardiologist has 4 years of medical school, 3-4 year residency in internal medicine, and then at least a three year fellowship in cardiology. General MD/DO has everything but the three years of cardiology. Then your NPs have two years of training outside of a four year nursing degree(however heart sounds are never really taught outside of personal experience/what type of nursing you are in). Finally PAs with two years of training.",
                      "score": 7,
                      "created_utc": 1744150518.0,
                      "replies": [
                        {
                          "id": "mm4otiw",
                          "author": "JstVisitingThsPlanet",
                          "body": "I’m an NP and heart sounds were taught in both my under grad and grad programs. Nursing education varies widely.",
                          "score": 5,
                          "created_utc": 1744158071.0,
                          "replies": []
                        },
                        {
                          "id": "mm56mhy",
                          "author": "Inner-Bread",
                          "body": "Cardiologist also benefits from having a large sample size of data to train their ear on over their career too. Basically all of their patients have heart issues. While for a GP it will be rarer but they are looking for early signs of tons of other things.",
                          "score": 5,
                          "created_utc": 1744164354.0,
                          "replies": [
                            {
                              "id": "mm5oivq",
                              "author": "ThunderDungeon02",
                              "body": "Yes, this too",
                              "score": 1,
                              "created_utc": 1744171355.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mm2negy",
              "author": "ChiefStrongbones",
              "body": "Also an electronic device can (theoretically) store a baseline rhythm for your heart and detect changes over time.",
              "score": 16,
              "created_utc": 1744135294.0,
              "replies": []
            },
            {
              "id": "mm3bxjp",
              "author": "Western-Purpose4939",
              "body": "As a nurse myself can I add they hurt your neck.",
              "score": 3,
              "created_utc": 1744142493.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm1bxow",
          "author": "binarygoober",
          "body": "\"Unlike a stethoscope, the device works well even if it’s not placed precisely on the chest: its larger, flexible sensing area helps capture clearer heart sounds than traditional stethoscopes.\"",
          "score": 13,
          "created_utc": 1744121342.0,
          "replies": [
            {
              "id": "mm247ws",
              "author": "drdrero",
              "body": "Let’s create an ultra big stethoscope then, like elephant ear sized",
              "score": 3,
              "created_utc": 1744129842.0,
              "replies": [
                {
                  "id": "mm3c4zz",
                  "author": "Western-Purpose4939",
                  "body": "My husband could be that stethoscope.",
                  "score": 3,
                  "created_utc": 1744142552.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm1pd9x",
              "author": "Leafington42",
              "body": "Yeah this is sorta like the difference between a regular tape measurer for building stuff and using a laser distance dete- ah my stoned ass got through so much bs before giving up",
              "score": 8,
              "created_utc": 1744125426.0,
              "replies": []
            },
            {
              "id": "mm1yh5o",
              "author": "Toomanydamnfandoms",
              "body": "Oh that’s awesome. It would be nice to get a similar  device for lungs too, as body shape and weight can make differentiating some lung noises difficult at times as well.",
              "score": 2,
              "created_utc": 1744128118.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm2jbxr",
          "author": "drpacz",
          "body": "This reminds me of the quote in 1834 (London Times) about the stethoscope: “That it will ever come into general use, notwithstanding its value, is extremely doubtful; because its beneficial application requires much time and gives a good bit of trouble both to the patient and the practitioner; because its hue and character are foreign and opposed to all our habits and associations.”",
          "score": 4,
          "created_utc": 1744134182.0,
          "replies": []
        },
        {
          "id": "mm41to5",
          "author": "Patient_Signal_1172",
          "body": "So you *don't* want tricorders to become a thing?",
          "score": 2,
          "created_utc": 1744150219.0,
          "replies": []
        },
        {
          "id": "mm5g0zw",
          "author": "Kookycranium",
          "body": "No. Like anything it takes practice. Lung sounds (rales, rhonchi, wheezing, stridor), bowel sounds (hypo/hyperactive), cardiac heart tones (S1, S2, S3, S4, Bruits, gallops, thrills). Not to be that guy, if it’s difficult for a certain provider to distinguish. Then they need to practice and study more.\n\nEDIT: source, Flight paramedic/Flight nurse.",
          "score": 1,
          "created_utc": 1744167779.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm3enwl",
      "author": "Minimum_Aioli1102",
      "body": "> just 38% of patients who present to their GP with symptoms of valve disease receive an examination with a stethoscope\n\nMaybe things are different in the UK, but in the US someone could come in with a stubbed toe and we still listen to their heart and lungs. I find it hard to believe this statistic. And I don't think an engineer is the most qualified to do that research or comment on reasons behind it.",
      "score": 7,
      "created_utc": 1744143281.0,
      "replies": [
        {
          "id": "mm48r8w",
          "author": "crank_pedal",
          "body": "Symptoms of valve disease? \nGet an echo…",
          "score": 3,
          "created_utc": 1744152577.0,
          "replies": [
            {
              "id": "mm4tsc4",
              "author": "vlolligagging",
              "body": "There are engineers who specialize in Engineering in Medicine. They’re called biomedical engineers.",
              "score": 1,
              "created_utc": 1744159822.0,
              "replies": [
                {
                  "id": "mm53cxy",
                  "author": "crank_pedal",
                  "body": "Yeah that’s great but a device to replace a stethoscope is an ultrasound",
                  "score": 2,
                  "created_utc": 1744163214.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mm0nft0",
      "author": "thesweeterpeter",
      "body": "But how does it look wearing it with a lab coat?",
      "score": 15,
      "created_utc": 1744112155.0,
      "replies": [
        {
          "id": "mm0s6br",
          "author": "arthurdentstowels",
          "body": "They'll have to implement the device into a stethoscope or we'll never be able to know who's a doctor.",
          "score": 10,
          "created_utc": 1744114205.0,
          "replies": []
        },
        {
          "id": "mm31ol0",
          "author": "TeaEarlGreyHotti",
          "body": "It will replace the little round part on the stethoscope and the drs can wear this like a medal. 🏅 \n\nAnd still put the things in their ears so they can also hear what the lil machine hears",
          "score": 2,
          "created_utc": 1744139498.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm67w9s",
      "author": "None",
      "body": "A device that is made in China presumably.",
      "score": 2,
      "created_utc": 1744181587.0,
      "replies": []
    },
    {
      "id": "mm0ufga",
      "author": "Porthos1984",
      "body": "I wonder if they are going to expand it to not just detect valve disease? Maybe just normal and abnormal rhythms as well.",
      "score": 1,
      "created_utc": 1744115130.0,
      "replies": []
    },
    {
      "id": "mm4ffjh",
      "author": "CaptRon25",
      "body": ">echocardiogram, but this can only be done in a hospital and NHS waiting lists are extremely long – between six to nine months at many hospitals.\n\n6 to 9 months??  Thats crazy. There's an EKG machine in just about every Cardiologist office in the country, and multiple machines in most hospitals and testing centers in the US\n\n>ECG machines can be found in medical offices, hospitals, operating rooms and ambulances. \n\n[Mayo Clinic](https://www.mayoclinic.org/tests-procedures/ekg/about/pac-20384983)",
      "score": 1,
      "created_utc": 1744154829.0,
      "replies": [
        {
          "id": "mm5x46b",
          "author": "_LarryM_",
          "body": "I'm in the US and it would probably take me 6 months to get one too. 3 months to get into normal doc to have him refer me to a cardiologist so my insurance doesn't get pissy than another 3+ before cardiologist will see me. Yes 3 months for normal doctor I checked a few weeks ago for heart issues and then just realized I'm fine with a massive heart attack when I saw 3 months away for a 7am appointment.",
          "score": 1,
          "created_utc": 1744175475.0,
          "replies": [
            {
              "id": "mm61nzn",
              "author": "CaptRon25",
              "body": "The reason I said what I said was, my brother suspected he was having cardiac problems.  Called his primary and got in the next day.  He was refereed to a Cardiologist, who prescribed an EKG (ECG) later that day at the hospital. It took 1 full day. EKG showed signs that suggested a possible blockage. He went back early the next morning for a Cardiac CT Angiography procedure. Later that day he was in the Cath lab where the Doctor implanted a coronary stent.   Total time was 2 full days.",
              "score": 1,
              "created_utc": 1744177896.0,
              "replies": [
                {
                  "id": "mm8cxd5",
                  "author": "_LarryM_",
                  "body": "Oh wow that's quick",
                  "score": 1,
                  "created_utc": 1744214560.0,
                  "replies": [
                    {
                      "id": "mm9i9jp",
                      "author": "CaptRon25",
                      "body": "Another one.  My mom was married to guy from England. They had houses in Chipping Campden England and Michigan.  He was in CC for a few months and had numbness in his extremities.  They scheduled him for a MRI (or CT, can't remember which) in 9 months... My mom called his physician in the US and they flew him back the next day.  He was having emergency cervical surgery at University of Michigan hospital the day after that.",
                      "score": 1,
                      "created_utc": 1744226514.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mm6lijw",
          "author": "Rhone33",
          "body": "It sounds like you're confusing *echo*cardiogram with *electro*cardiogram (ECG/EKG).\n\nThe latter is a quick and easy display of the heart's electrical activity, and should be done within minutes after arrival if you show up to a hospital with any cardiac or respiratory symptoms. \n\nThe former is a specialized cardiac ultrasound, and is far less quick and routine.",
          "score": 1,
          "created_utc": 1744190393.0,
          "replies": [
            {
              "id": "mm9ggzp",
              "author": "CaptRon25",
              "body": "Which ever one they did at the primary doctor's office, he ended up at the hospital Cath lab, and it didn't take 6 months. It took 2 days.",
              "score": 1,
              "created_utc": 1744225982.0,
              "replies": [
                {
                  "id": "mm9pvsg",
                  "author": "Rhone33",
                  "body": "Yes, that's an *electro*cardiogram/EKG.  Hospitals are swarming with EKG machines and an EKG can be performed in a couple minutes by any nurse or underpaid tech.  A hospital might have *one* machine for echocardiograms and it could take up to an hour per patient.\n\nEKGs are great for helping to diagnose *emergent* heart issues, like a myocardial infarction that would require a trip to the cath lab.  Echocardiograms are good for diagnosing some less immediately life-threatening heart issues that don't always show up on an initial cardiac workup.\n\nI agree it shouldn't take months to schedule an outpatient echocardiogram, but that's an entirely separate issue from how quick it is to do an EKG.  And if you're having any cardiac symptoms like chest pain or difficulty breathing, you shouldn't be scheduling an outpatient echo to begin with, you should be going to an ER.  At that point, if the initial cardiac workup (EKG, bloodwork, chest X-ray) doesn't show anything emergent but your symptoms and risk factors warrant further investigation, you should be getting an echocardiogram and/or a stress test no later than the next day.",
                  "score": 1,
                  "created_utc": 1744228726.0,
                  "replies": [
                    {
                      "id": "mm9x45j",
                      "author": "CaptRon25",
                      "body": "> you shouldn't be scheduling an outpatient echo to begin with, you should be going to an ER.\n\nMy brother's primary thought the same thing, which is why he ended up in the Cath lab the next day getting a stent.. \n\nApparently [Mayo Clinic](https://www.mayoclinic.org/tests-procedures/ekg/about/pac-20384983) considers ECG and EKG to be the same thing. [Echocardiogram](https://www.mayoclinic.org/tests-procedures/echocardiogram/about/pac-20393856) is ultrasound.\n\nThe original issue I was responding to was, in the UK it takes 6 to 8 months like the article was saying. I said that was crazy since every hospital and cardiac testing clinic in the US has at least one machine, and you could be dead by then if you had wait 6 months \n\nThe article said...\n>The ‘gold standard’ for diagnosing heart valve disease is an echocardiogram, but this can only be done in a hospital and NHS waiting lists are extremely long – between six to nine months at many hospitals.",
                      "score": 1,
                      "created_utc": 1744230817.0,
                      "replies": [
                        {
                          "id": "mm9yfty",
                          "author": "Rhone33",
                          "body": "Yeah, ECG and EKG are used interchangeably to abbreviate electrocardiogram. I think the K in EKG comes from the German term (kardio instead of cardio).",
                          "score": 1,
                          "created_utc": 1744231204.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mm6htij",
      "author": "GlumTowel672",
      "body": "“ it outperforms GPs at detecting valvular heart disease “ but how good is it at excluding it? I could listen to 100 people and say they all have valvular heart disease and need to be sent for an echo and then you could also say I outperformed GPs at detecting valvular heart disease.",
      "score": 1,
      "created_utc": 1744187983.0,
      "replies": []
    },
    {
      "id": "mm7c77j",
      "author": "jonny_vegas",
      "body": "Dr.McCoy always used a tricorder an it worked just fine, duh....",
      "score": 1,
      "created_utc": 1744203137.0,
      "replies": []
    },
    {
      "id": "mm17zro",
      "author": "None",
      "body": "Is the stethoscope…..not…..handheld? What?",
      "score": -2,
      "created_utc": 1744120061.0,
      "replies": [
        {
          "id": "mm32199",
          "author": "TeaEarlGreyHotti",
          "body": "Opposed to a large ekg machine that you have to get hooked up to. \n\nThe Dr uses it in their hand… stethoscope has a lot of user error",
          "score": 1,
          "created_utc": 1744139602.0,
          "replies": []
        },
        {
          "id": "mm4248w",
          "author": "Patient_Signal_1172",
          "body": "Did the headline say that stethoscopes *weren't* used by your hands? No. It said that the new device was handheld. Learn to read.",
          "score": 1,
          "created_utc": 1744150316.0,
          "replies": [
            {
              "id": "mm5ciqk",
              "author": "Inmytanks",
              "body": "The headline is bad because it doesn’t describe or hint anything unique about the device or why it’s different & exciting. The title only describes it as a “handheld” device which the stethoscope is also.",
              "score": 2,
              "created_utc": 1744166432.0,
              "replies": [
                {
                  "id": "mm5dcqv",
                  "author": "Patient_Signal_1172",
                  "body": "Okay? I never said the headline was good, I just said it didn't say that the stethoscope isn't handheld. Yet another example of people not being able to read.",
                  "score": 1,
                  "created_utc": 1744166741.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm46tm6",
              "author": "None",
              "body": "You should look up the definition of the word implication.",
              "score": -1,
              "created_utc": 1744151914.0,
              "replies": [
                {
                  "id": "mm4u43r",
                  "author": "PistachioNSFW",
                  "body": "The headline is not implying stethoscopes are not handheld. I think you meant look up the definition of assumption.",
                  "score": 1,
                  "created_utc": 1744159938.0,
                  "replies": []
                },
                {
                  "id": "mm598wv",
                  "author": "Patient_Signal_1172",
                  "body": "It's hilarious when stupid people think they're intelligent.\n\nThe title never implied that the stethoscope wasn't \"handheld.\" There's no word that links the two ideas. Surely English must be your second language, so I'll give you a pass on this one.",
                  "score": 1,
                  "created_utc": 1744165267.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mm17dvo",
      "author": "EthanPrisonMike",
      "body": "It’s handheld ? Like, you mean, a stethoscope ?",
      "score": -3,
      "created_utc": 1744119857.0,
      "replies": [
        {
          "id": "mm423sl",
          "author": "Patient_Signal_1172",
          "body": "Did the headline say that stethoscopes *weren't* used by your hands? No. It said that the new device was handheld. Learn to read.",
          "score": 2,
          "created_utc": 1744150312.0,
          "replies": [
            {
              "id": "mm48hf1",
              "author": "EthanPrisonMike",
              "body": "Thanks Professor",
              "score": -2,
              "created_utc": 1744152484.0,
              "replies": [
                {
                  "id": "mm59ieq",
                  "author": "Patient_Signal_1172",
                  "body": "It's sad that you believe that professors are the only people capable of understanding how the English language works. Then again, I suppose that half of people are dumber than the average person, so I shouldn't be surprised when I find someone on the left side of that curve.",
                  "score": 1,
                  "created_utc": 1744165362.0,
                  "replies": [
                    {
                      "id": "mm5a2up",
                      "author": "EthanPrisonMike",
                      "body": "Sounds good professor",
                      "score": 0,
                      "created_utc": 1744165562.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mm4l2to",
      "author": "got_knee_gas_enit",
      "body": "AI to the rescue...coming soon.",
      "score": 0,
      "created_utc": 1744156752.0,
      "replies": []
    },
    {
      "id": "mm2jqti",
      "author": "han_jobs5",
      "body": "So I can cancel my health insurance now?",
      "score": -1,
      "created_utc": 1744134293.0,
      "replies": []
    }
  ]
}