{
  "post": {
    "title": "Cableless GPU design supports backward compatibility and up to 1,000W | New GPUs would include motherboard power connectors and conventional 12V-2x6 connectors",
    "author": "chrisdh79",
    "id": "1i2me2a",
    "score": 442,
    "created_utc": 1737024977.0,
    "selftext": "",
    "num_comments": 85,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i2me2a/cableless_gpu_design_supports_backward/"
  },
  "comments": [
    {
      "id": "m7fjssd",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1737024978.0,
      "replies": []
    },
    {
      "id": "m7fo1cl",
      "author": "roiki11",
      "body": "Great, now the mobo can catch fire.",
      "score": 213,
      "created_utc": 1737027372.0,
      "replies": [
        {
          "id": "m7funx7",
          "author": "TheStoicNihilist",
          "body": "Yo dawg\n\n![gif](giphy|ToMjGpBGgDijEba1Te8|downsized)",
          "score": 29,
          "created_utc": 1737030614.0,
          "replies": []
        },
        {
          "id": "m7gbwdi",
          "author": "dead_fritz",
          "body": "*Asus has reentered the chat*\n\nThey have got a few months now without a new PR disaster. Seems they're due for a new shit show.",
          "score": 19,
          "created_utc": 1737037189.0,
          "replies": [
            {
              "id": "m7md90c",
              "author": "S0M3D1CK",
              "body": "This reminds me of my Asus laptop that caught fire 3 times",
              "score": 1,
              "created_utc": 1737118831.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7g0s97",
          "author": "SonoftheK1ng",
          "body": "Exactly what I was thinking haha. None of this fixes the 12vHP connector issues. Just make a connector that's more robust dang it. \n\nThat aside, I would love to see this standardized for cable management purposes.",
          "score": 12,
          "created_utc": 1737033169.0,
          "replies": [
            {
              "id": "m7g1bul",
              "author": "roiki11",
              "body": "Yea it would be great. But seeing as you'll have to pass 500+ watts to modern high end gpus, I don't see it ever working out properly. The board space and terminal size  requirements are just too big. Just like the 12vHP.",
              "score": 5,
              "created_utc": 1737033379.0,
              "replies": [
                {
                  "id": "m7g1qwl",
                  "author": "wkavinsky",
                  "body": "500w on a 12v supply, for a round trip of 2m (typical cable length) would be 8awg on a single cable.\n\nThe connector needs to be better, and the wires need to be *much* thicker.",
                  "score": 5,
                  "created_utc": 1737033537.0,
                  "replies": [
                    {
                      "id": "m7g34a2",
                      "author": "roiki11",
                      "body": "That's why they use 8 or more cables. And where did you get the 2m from? The pcie cables are usually 50cm or less.",
                      "score": 7,
                      "created_utc": 1737034053.0,
                      "replies": [
                        {
                          "id": "m7gc5tn",
                          "author": "wkavinsky",
                          "body": "Round trip distance is the important one - so double the cable length.\n\nCalculators for wire sizing don't go down to 1.2m (they start at 0-1.8m)\n\nAll 8x16awg is *barely* the same current carrying capability as 1x8awg - which is why you see fires and scorching as soon as there's an issue with one of the 8 positive wires.",
                          "score": 3,
                          "created_utc": 1737037277.0,
                          "replies": [
                            {
                              "id": "m7gdzxo",
                              "author": "roiki11",
                              "body": "Right.",
                              "score": 0,
                              "created_utc": 1737037898.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m7fsmrr",
          "author": "jacobthellamer",
          "body": "I have experienced that before. MSI didn't make the board powerful enough for a 1090t.",
          "score": 3,
          "created_utc": 1737029676.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7fl1f1",
      "author": "itzBT",
      "body": "Nvidia needs this",
      "score": 39,
      "created_utc": 1737025705.0,
      "replies": [
        {
          "id": "m7fmtim",
          "author": "scr33ner",
          "body": "So they can sell the 90 series for 3k?",
          "score": 27,
          "created_utc": 1737026712.0,
          "replies": [
            {
              "id": "m7fn96r",
              "author": "La_mer_noire",
              "body": "You misspelled 60 series",
              "score": 15,
              "created_utc": 1737026950.0,
              "replies": [
                {
                  "id": "m7gcpjo",
                  "author": "I_Stabbed_Jon_Snow",
                  "body": "There will undoubtedly be hybrid cooled 50-series cards going for $3k+, at this point I’d say the 60-series will push $4k at the high end.",
                  "score": 4,
                  "created_utc": 1737037463.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7k2ohr",
              "author": "Juub1990",
              "body": "Considering the 90 series might be a decade from now, NVIDIA won’t need this to charge $3K",
              "score": 1,
              "created_utc": 1737078083.0,
              "replies": []
            },
            {
              "id": "m7ih6z9",
              "author": "ealgron",
              "body": "Accounting for inflation over 12 years, a 9090 for 3k doesn’t sound too bad.",
              "score": 0,
              "created_utc": 1737059974.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m7g1h63",
      "author": "mixmastersang",
      "body": "Aren’t wall power limits still the gating factor? Even if GPUs go up to 1000W",
      "score": 38,
      "created_utc": 1737033435.0,
      "replies": [
        {
          "id": "m7g3ikc",
          "author": "zekromNLR",
          "body": "At least in north america yeah, gamers gonna need a 240 V hookup for their PC\n\nOfc in Europe you can draw 3.6 kW from a normal outlet no probblem",
          "score": 54,
          "created_utc": 1737034201.0,
          "replies": [
            {
              "id": "m7hb7xd",
              "author": "terrany",
              "body": "You can always hire an illegal contractor and risk a house fire so you can push 300 FPS in Apex",
              "score": 23,
              "created_utc": 1737047865.0,
              "replies": [
                {
                  "id": "m7ibc26",
                  "author": "pragmatic84",
                  "body": "Pro gamer move right there",
                  "score": 8,
                  "created_utc": 1737058258.0,
                  "replies": [
                    {
                      "id": "m7lmzox",
                      "author": "sadcheeseballs",
                      "body": "Nah pro gamers turn their graphics to absolute shit to move faster. Would be boring AF for me to play with shit graphics.",
                      "score": 2,
                      "created_utc": 1737104041.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m7iz6cq",
                  "author": "rpkarma",
                  "body": "Worth it",
                  "score": 1,
                  "created_utc": 1737065150.0,
                  "replies": []
                },
                {
                  "id": "m7izz4a",
                  "author": "TooStrangeForWeird",
                  "body": "If your power supply has the little switch on the back to change between voltages you can just replace the breaker with a 220/240v breaker. Just gotta make sure not to plug anything else into the same breaker. And make sure it's not the same breaker for your lights in the same room. \n\nIs it a good idea? Probably not. Would it work? Well, I *could* get it to work. Idk about most people. I wouldn't recommend it.",
                  "score": -5,
                  "created_utc": 1737065389.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7gff8r",
          "author": "None",
          "body": "1000w is 8amps. On a 15 amp breaker you can safely use 12. Which means we can go up to about 1440w before we start needing to discuss 30 amp breakers becoming a standard in NA homes for the office lol",
          "score": 18,
          "created_utc": 1737038379.0,
          "replies": [
            {
              "id": "m7gotuj",
              "author": "trainbrain27",
              "body": "The CPU (and friends) would like a little power too.\n\nSpace heaters regularly have a 1500w mode, and that shouldn't fluctuate nearly as much as a computer.\n\nAll our breakers at work are 20 amp, but I've never seen a PC with a 20A plug, much less 30.",
              "score": 13,
              "created_utc": 1737041345.0,
              "replies": [
                {
                  "id": "m7huo93",
                  "author": "xantec15",
                  "body": "20A should be sufficient for at least a couple more years. At least until the 80-series release.",
                  "score": 6,
                  "created_utc": 1737053423.0,
                  "replies": []
                },
                {
                  "id": "m7gsfp7",
                  "author": "None",
                  "body": "what do you mean? The plugs are all still 120v, so a 30amp breaker works just fine for a PC. You just have more headroom.\n\nI agree though maybe 30 is too extreme because you then move to 10-2 cable which is a lot more expensive than 14-2",
                  "score": 4,
                  "created_utc": 1737042427.0,
                  "replies": [
                    {
                      "id": "m7gxxd1",
                      "author": "trainbrain27",
                      "body": "20 and 30 amp plugs and outlets are different shapes.  You can plug a 15 amp cord into a 20 amp outlet (or put a 15 amp outlet on a 20 amp breaker), but a cord designed for 20 amps has a rotated pin that won't fit in a 15 amp socket, and neither fits in a 30 amp socket.  Adapters are available, it's perfectly safe to plug a 15 into a 30, but if you go the other way and demand more current, things can go poorly.\n\n[https://en.wikipedia.org/wiki/NEMA\\_connector#/media/File:NEMA\\_simplified\\_pins.svg](https://en.wikipedia.org/wiki/NEMA_connector#/media/File:NEMA_simplified_pins.svg)",
                      "score": 7,
                      "created_utc": 1737044026.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m7idxxs",
                  "author": "dan-theman",
                  "body": "I’ve seen 20A on a number of servers but the average person wouldn’t be spending as much on computing as they would a car.",
                  "score": 2,
                  "created_utc": 1737059020.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7hanbo",
              "author": "Roadside_Prophet",
              "body": "You've also got the cpu, hdd(s), ram, fans, and rgb all drawing power on that same plug through the motherboard.\n\nThen you've got monitor(s), speakers, keyboards, mice,  network switches, modem/router and anything else you might need drawing power on that outlet.  \n\nYou could maybe use other outlets, but most homes in the US share circuits across multiple outlets, especially in the same room. That could include other draws like lighting, televisions, and other things. Were getting VERY close to having constant \"why does my circuit breaker trip everytime I load a new map\" questions popping up on the daily.",
              "score": 9,
              "created_utc": 1737047702.0,
              "replies": [
                {
                  "id": "m7kf1zs",
                  "author": "seiggy",
                  "body": "My problem is my UPS. I have a 1500VA/1000W UPS, and there’s a couple games that will trigger over volt protection if I don’t cut off my secondary monitor. And finding a 2000VA UPS that’s not $1500+ is practically impossible. Really frustrating. Likely what I’ll have to do is buy a second 1000VA UPS and move everything but my tower over to the second UPS. Still cheaper than buying a 2kVA system.",
                  "score": 2,
                  "created_utc": 1737082483.0,
                  "replies": [
                    {
                      "id": "m7kyv2n",
                      "author": "natty_overlord",
                      "body": "I just got APC BGM2200-msx for $430. 2.2kVA line interactive pure sine wave UPS.",
                      "score": 2,
                      "created_utc": 1737090374.0,
                      "replies": [
                        {
                          "id": "m7mc066",
                          "author": "seiggy",
                          "body": "Ugh, 230V. Sadly won’t work for those of us in the land of freedumb electricity.",
                          "score": 2,
                          "created_utc": 1737118316.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m7hsk0g",
          "author": "RoboErectus",
          "body": "What's coming in 10 years for gaming pc:\n\n1) electricians installing 240v lines and outlets like your dryer or electric oven use. And/or\n\n2) \"gaming\" extension cords, 12 or god forbid even 10 gauge, with accessories for safely routing them through your house, making sure they're on separate breakers, etc. Or\n\n3) grid tie Lithium battery setups that charge overnight to give you some hours of extra amps for gaming. Maybe this gets built into your PC case.\n\nIn any case, lots of accessories are going to start coming when there's simply no more juice to pull.\n\nEven if things get, let's say, 50% more efficient yoy, historically as we get more power efficient we still use more power. An example would be lighting: we use far more electricity to light our homes with LED than we did with Incandescent. The lights themselves use less power, but we use more of them.\n\nI can't wait for all the shenanigans as people discover just how fucked the wiring in their walls has been this whole time. Between multi-million dollar houses and wwii-era homes, I have never lived in a place that didn't have some really tucked electrical, nearly always as a result of handyman types over the years. And somebow, on a new build, I discovered armored cable going directly into a pvc box.",
          "score": 6,
          "created_utc": 1737052819.0,
          "replies": [
            {
              "id": "m7j0vs2",
              "author": "TooStrangeForWeird",
              "body": ">An example would be lighting: we use far more electricity to light our homes with LED than we did with Incandescent. The lights themselves use less power, but we use more of them.\n\nThis isn't even close. Most of my bulbs are 5-12 watts. It's not like I went and added a bunch of new fixtures when I switched over. I could see some new builds adding more lights than usual, but not like 5x as many. For regular homes with a bathroom vanity (like mine with 6 bulbs in it) I dropped from 240W to 30W.",
              "score": 8,
              "created_utc": 1737065657.0,
              "replies": []
            },
            {
              "id": "m7jv1k0",
              "author": "kaleidoleaf",
              "body": "Lol no we do not use more power with LEDs. They pull 10% of the wattage and people did not install 10x the lights. ",
              "score": 7,
              "created_utc": 1737075459.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7j683p",
          "author": "ThePretzul",
          "body": "Not really. \n\nYou can have a 120V circuit rated for 20 amps pretty easy. That’s 2400 Watts, with monitors and accessories taking 400 or less and the rest of the PC being maybe 400 combined at most.",
          "score": 2,
          "created_utc": 1737067275.0,
          "replies": [
            {
              "id": "m7jbiba",
              "author": "MeeMeeGod",
              "body": "A circuit breaker cannot carry more than 80% of its rating. 20 amp breaker would be 16 amps which is 1920 watts",
              "score": 3,
              "created_utc": 1737068954.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7krrpm",
          "author": "loogie97",
          "body": "Typical wall outlet is 15 amps. On the low end you get 80% of 15amps at 120volts. 1440 watts. On a 20amp circuit you can get that up to 1920 watts. That all depends on the pc being the only thing on the circuit. Someone could fire up a vacuum and knock out the pc.",
          "score": 2,
          "created_utc": 1737087303.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7gfbag",
      "author": "itsprincebaby",
      "body": "Yeah, lets make motherboards the thickness of a dictionary",
      "score": 6,
      "created_utc": 1737038342.0,
      "replies": []
    },
    {
      "id": "m7fsv2x",
      "author": "chwastox",
      "body": "All what we need is 24 or even 36V power cable for the GPU that would be compatible to it. It could solve all the issues.",
      "score": 16,
      "created_utc": 1737029784.0,
      "replies": [
        {
          "id": "m7g0lsp",
          "author": "mattcraft",
          "body": "I hear what you're saying, but then additional power conversion will happen on the graphics card, taking up real estate and causing it to dissipate more heat.\n\nThere's tradeoffs.",
          "score": 14,
          "created_utc": 1737033099.0,
          "replies": [
            {
              "id": "m7p2i5x",
              "author": "nullstring",
              "body": "You sure about that? I don't think the graphics cards run off 12v anyway so there would need to be the same conversion going on. \n\nInstead of 12v to whatever it would be 36v to whatever. I think it'd be fine.",
              "score": 1,
              "created_utc": 1737148490.0,
              "replies": [
                {
                  "id": "m7pf2eg",
                  "author": "mattcraft",
                  "body": "Yes I'm sure. The stated goal here is to move more power, and the method they chose to do it was to use a higher voltage. If more power is moved, then more heat will need to be dissipated.\n\nThere are other factors such as.. the power supply system doesn't exist and would be incompatible with all previous PSUs so all purchasers would need an additional component to use their GPU.  A standards shift is possible, but unlikely.\n\nYou are right - nVidia GPUs are running the CPU around 1.05~ volts and the memory around 1.35 volts if I recall correctly.  There is already power conditioning that happens on the board and there are a lot of implications if you change the input voltage from 12 to 36v.  If anything, 24v makes a lot of sense because many off-the-shelve components are available for this type of power.\n\nnVidia has had very little incentive to reduce power consumption, but a lot of incentive to increase performance.  Their design has focused on brute power instead of efficiency.  Question is, how far will they take it?",
                  "score": 1,
                  "created_utc": 1737152299.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7g2rw7",
              "author": "None",
              "body": "I hear what you’re saying so we invented a liquid cooler from Corsair for 459.99 that covers the entire graphics card in liquid nitrogen to offset the heat. Also, you can’t touch the liquid and there’s a risk it could explode and set your home on fire if you play more than 45ish minutes. Tradeoffs",
              "score": -1,
              "created_utc": 1737033925.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7h4ynw",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1737046067.0,
          "replies": [
            {
              "id": "m7iie7c",
              "author": "AuryGlenz",
              "body": "Saying what GPU do is “displaying a video signal” is ridiculously reductive.",
              "score": 2,
              "created_utc": 1737060318.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m7hy2mt",
      "author": "K_astle",
      "body": "Never asus",
      "score": 2,
      "created_utc": 1737054395.0,
      "replies": []
    },
    {
      "id": "m7i17a3",
      "author": "Magiwarriorx",
      "body": "If it was from any other company I'd be hype, but given Asus's QA and history of frying electronics, a fully Asus designed 1000W standard is just asking for trouble.",
      "score": 2,
      "created_utc": 1737055310.0,
      "replies": []
    },
    {
      "id": "m7i8z1o",
      "author": "zirky",
      "body": "3dfx solved this problem in the dumbest, not dumb in hindsight, fashion",
      "score": 2,
      "created_utc": 1737057560.0,
      "replies": []
    },
    {
      "id": "m7j70st",
      "author": "xGHOSTRAGEx",
      "body": "Why can't we just have a gpu with a kettle plug port lol at this point the looks just don't matter no more",
      "score": 1,
      "created_utc": 1737067526.0,
      "replies": []
    },
    {
      "id": "m7j87jv",
      "author": "3600CCH6WRX",
      "body": "Apple has similar stuff on their Mac Pro motherboard. I hope one can be an industry standard, it’s much better than all the cabling.",
      "score": 1,
      "created_utc": 1737067901.0,
      "replies": []
    },
    {
      "id": "m7jc0fv",
      "author": "robotokenshi",
      "body": "Forgot flux capacitor connection",
      "score": 1,
      "created_utc": 1737069119.0,
      "replies": []
    },
    {
      "id": "m7kr4ec",
      "author": "SweatyAd9240",
      "body": "Tubberville was a piece of shit when he bailed on a recruit dinner at Texas Tech and he’s a piece of shit now",
      "score": 1,
      "created_utc": 1737087041.0,
      "replies": []
    },
    {
      "id": "m7kw5x7",
      "author": "imakesawdust",
      "body": "Soon we'll need to run dedicated 220V circuits to our home offices.",
      "score": 1,
      "created_utc": 1737089175.0,
      "replies": []
    },
    {
      "id": "m7h16v7",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1737044974.0,
      "replies": [
        {
          "id": "m7h8trb",
          "author": "G8M8N8",
          "body": "What?",
          "score": 1,
          "created_utc": 1737047173.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7fnc74",
      "author": "Durahl",
      "body": "Backwards Compatible my ass... Unless the Power Connector is removable from the GPU and the GPU comes with an alternative Wires Connection Method there'll be next to no Backwards Compatibility between any GPU using this feature and a Motherboard not supporting it because in 99% of the cases the area next to the PCIe Slot used for the new Connector will not be vacant but populated with other stuff ( Capacitors, Heat Sinks, a Cover, etc... ) barring the GPU from being slotted into it - ***UNLESS*** the Connector can be removed from GPU side ***AND*** the GPU comes with a classic *Wired* Power Delivers Method which I ***HIGHLY*** doubt it would.\n\nAlso ***FUCK*** *~~ASUS~~*, after seeing myself how they only demand an Apple TAX without backing it up with appropriate support I'll never buy from them again.",
      "score": -9,
      "created_utc": 1737026996.0,
      "replies": [
        {
          "id": "m7fwnym",
          "author": "Drizznarte",
          "body": "I completely agree ,  I have had to repair those cables before  what they are doing is a bespoke solution to force you to use there products . F Asus we should have the right to repair. Not to mention the current solution is working fine for  tens of million of pc 's.",
          "score": 3,
          "created_utc": 1737031500.0,
          "replies": []
        },
        {
          "id": "m7fob6o",
          "author": "Keening99",
          "body": "Why are you so angry? Have a nice day mate.",
          "score": 14,
          "created_utc": 1737027519.0,
          "replies": [
            {
              "id": "m7fyuc3",
              "author": "Fredasa",
              "body": "I can see where he's coming from.  Asus is in the doghouse for their legendarily poor (nonexistent) customer service.  (Google around for that rabbit hole.)  Now imagine a future apocalypse where a motherboard company who conspicuously doesn't give a flying f--- about their customers ends up holding sway over the design trajectory of many/most GPUs.",
              "score": 6,
              "created_utc": 1737032401.0,
              "replies": []
            },
            {
              "id": "m7fqu15",
              "author": "reper3000",
              "body": "Dont tell him what to do",
              "score": 3,
              "created_utc": 1737028806.0,
              "replies": [
                {
                  "id": "m7fujjr",
                  "author": "TheStoicNihilist",
                  "body": "Don’t tell him to not tell him what to do.",
                  "score": 5,
                  "created_utc": 1737030560.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7ggl9d",
          "author": "ArseBurner",
          "body": "Did you read the article? It has everything you just mentioned. The board power plug is retracted and you plug an extension into the board if you want to use it. If you prefer not to the there's a standard 12V2x6 connector at the top.",
          "score": 2,
          "created_utc": 1737038767.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7gl0m1",
      "author": "tastyratz",
      "body": "The 3.0 design with giant high-power exposed pins seems incredibly dangerous. Imagine dropping a screw during assembly on a thousand watts of oops.\n\nIt really feels like the PCIEx16 slot is forced these days which is weird with FATX phasing for mini more and more.\n\nI want to be LESS married to the motherboard. If new cards need 1000watts install them Parallel in a case, not perpendicular.\n\nLet's get away from pcie slots entirely and go all in thunderbolt.\n\nMake high end cards just run on 4x thunderbolt cables and give them the bolt pattern for FATX screws so they can mount to a case right next to a mini motherboard.\nLet me mount the video card to the top of the case where a radiator would go if I want.\n\nAnything but this airflow seal we go with today.\n\nThen toss in dedicated power cables that maybe don't melt because they are specced correctly.",
      "score": -5,
      "created_utc": 1737040174.0,
      "replies": [
        {
          "id": "m7gqv8p",
          "author": "Sure-Temperature",
          "body": "> dropping a screw during assembly\n\nThat's why you don't work on electronics when they're connected to power",
          "score": 11,
          "created_utc": 1737041962.0,
          "replies": [
            {
              "id": "m7hcdhq",
              "author": "tastyratz",
              "body": "-That's why you don't work on electronics when they're connected to power\n\nThat's a lot of power that can still exist in capacitors even if you unplug things in big exposed metal. \n\nDo you unplug your psu from the motherboard every time you insert a PCI card? You can say yes, or you can be honest.\n\nThe point is more that this should be shielded given the amount of power it's carrying just like we overmold the ATX power connectors.",
              "score": -1,
              "created_utc": 1737048195.0,
              "replies": [
                {
                  "id": "m7henwq",
                  "author": "Sure-Temperature",
                  "body": "Fair enough, I wasn't considering the capacitors. Having worked as a smart home installer, the amount of people working on live shit is far too high",
                  "score": 2,
                  "created_utc": 1737048852.0,
                  "replies": []
                },
                {
                  "id": "m7hgxrj",
                  "author": "inglouriouswoof",
                  "body": "I switch off the PSU, and hold down the case power button to drain any residual energy from the system. Could go a step further and pull the cord from the PSU, but I haven’t seen a situation where that’s been necessary as long as the main switch is off.",
                  "score": 2,
                  "created_utc": 1737049506.0,
                  "replies": [
                    {
                      "id": "m7hk4kr",
                      "author": "tastyratz",
                      "body": "And that is great and something I am sure you never skip even once when making quick changes.\n\nPretend we put our static guard wrist bands down and be real about the kids assembling pc's at times. \n\nI know my post is getting downvote blasted but I don't understand the negative position around actually covering and shielding very high power live wires that have the ability to kill you. 1000w for a split second of 12v dc can stop your heart. Maybe that should be covered at a minimum.",
                      "score": 1,
                      "created_utc": 1737050409.0,
                      "replies": [
                        {
                          "id": "m7hl5me",
                          "author": "inglouriouswoof",
                          "body": "I’ve been building PCs for almost 20 years, and I have always discharged PC power after I learned it from working at a data center. Sure, the masses may not know or learn to do this, but you can’t protect everyone from everything. Lol I’ve also never used a static guard wristband neither.",
                          "score": 2,
                          "created_utc": 1737050706.0,
                          "replies": [
                            {
                              "id": "m7hmko8",
                              "author": "tastyratz",
                              "body": "You can recognize that you're the minority there though, yeah? If we're knowing our audience exposure to that much amperage could be fatal to a 17 year old installing their new GPU.\n\nIt shouldn't be controversial to have insulated jackets on wire and overmolded connectors over bare wire when that much potential is involved.",
                              "score": 5,
                              "created_utc": 1737051112.0,
                              "replies": [
                                {
                                  "id": "m7hr2ql",
                                  "author": "I_T_Gamer",
                                  "body": "Should be zero debate here.   At voltage that high it may as well be a handgun....",
                                  "score": 1,
                                  "created_utc": 1737052393.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m7j1u97",
                          "author": "TooStrangeForWeird",
                          "body": "12V won't even break the skin....",
                          "score": 1,
                          "created_utc": 1737065941.0,
                          "replies": [
                            {
                              "id": "m7jne3x",
                              "author": "tastyratz",
                              "body": "We're still talking almost a hundred amps. You're not likely, but, that's a lot of exposed juice that can still bite you.",
                              "score": 1,
                              "created_utc": 1737072904.0,
                              "replies": [
                                {
                                  "id": "m7jtje4",
                                  "author": "TooStrangeForWeird",
                                  "body": "But it can't really, which is my point. I guess if you soaked your hands in saltwater for a while maybe you'd get through, or stabbed yourself with it (that would definitely kill you). \n\nMy concern would be destroying the electronics. I've barely handed a few hundred potential amps on 12V before. Just recently, actually. It's really not a concern.",
                                  "score": 2,
                                  "created_utc": 1737074950.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m7g5uut",
      "author": "None",
      "body": "Motherboards are going to be obsolete in the future I think. I imagine most components will utilize a wireless communication system and be highly modular and not in the form factor of a flat pcb board components stacked vertically but more of block like objects that connect together like legos in a sense. Instead of external wires it’ll be chunks and bands of copper threaded throughout etc to handle the high electrical needs as well as heat management. I expect certain components to either be combined with others or gotten rid of completely. I saw the Gpus being the first thing to start the changes but I didn’t think it would happen this fast without other components beginning to change as well.",
      "score": -16,
      "created_utc": 1737035058.0,
      "replies": [
        {
          "id": "m7gdfju",
          "author": "dead_fritz",
          "body": "Buddy what are you talking about? This is completely insane. Wireless communication for computer components is a terrible idea, there's a reason RAM is as physically close to the CPU as possible. Copper threaded through a vertical stack of components? You mean wiring? What are you on about.",
          "score": 8,
          "created_utc": 1737037708.0,
          "replies": [
            {
              "id": "m7hnq52",
              "author": "None",
              "body": "Look at the article posted in /tech or whatever it was that talks about using wireless communications in new chip designs. Just because you don’t understand it doesn’t mean it’s not real. \n\nWhat the difference between a copper wire and a copper bus bar? They serve the same function but they’re drastically different in form and language used to describe it. I come from construction and from a hobbyist perspective on tech. I was taking broken windows 95 machines as a kid and building working computers without any help. So I’m not educated but I’m not inexperienced. I’m also relatively knowledgeable on hardware design because of my interests in electrical engineering. \n\nWe can have a pissing contest but what’s the point?",
              "score": -4,
              "created_utc": 1737051441.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7gy5q5",
          "author": "pulseout",
          "body": "This just in: Person who has no idea how electronics work makes a ridiculous comment about electronics.",
          "score": 6,
          "created_utc": 1737044095.0,
          "replies": [
            {
              "id": "m7hmk6z",
              "author": "None",
              "body": "Yup! Sometimes I’m right on the money (like sulfur compounds being a driving component of cannabis’s distinctive skunky smell and it not being a terpenoid or sequesterpene), most times I’m a laughing stock. And that’s okay :) having a wrong opinion or idea like this isn’t bad. People just want to point and laugh at others to make them selves feel better. \n\nDo you feel like you’re having a better day now?",
              "score": -5,
              "created_utc": 1737051109.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7jm8kd",
          "author": "Bacon_Techie",
          "body": "Wireless communication introduces significantly more latency. Because of that, it will never happen. One thing that limits a lot of stuff is simply how fast data can be pushed through a connection and wireless communication simply does not allow that at a fundamental level. And this has already happened, components get combined and shrunk down. All the parts are necessary, and taking them away just means building them into another component somewhere else. (Take away the GPU, you put it into the CPU or solder it to the motherboard). Boards are used because they are the most space efficient and cost effective to produce.",
          "score": 2,
          "created_utc": 1737072521.0,
          "replies": []
        },
        {
          "id": "m7lpgna",
          "author": "narkotikahaj",
          "body": "That's like saying that you hate doing things the most efficient way and you'd really like more overhead with wireless protocols and hardware. Not to mention the clusterfuck of EMI this would bring...\n\nSincerely, an actual electronics engineer.",
          "score": 1,
          "created_utc": 1737105711.0,
          "replies": []
        }
      ]
    }
  ]
}