{
  "post": {
    "title": "The PlayStation 5 laptop is a 9.5 pound portable gaming monster | Includes a massive 17.3-inch 4K display and a full-sized keyboard",
    "author": "chrisdh79",
    "id": "1hexmdr",
    "score": 1506,
    "created_utc": 1734283966.0,
    "selftext": "",
    "num_comments": 174,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hexmdr/the_playstation_5_laptop_is_a_95_pound_portable/"
  },
  "comments": [
    {
      "id": "m275wsk",
      "author": "HallowedError",
      "body": "I think I'd have to be looking to tell the difference between 1440 and 4k at that display size",
      "score": 459,
      "created_utc": 1734285462.0,
      "replies": [
        {
          "id": "m27k06n",
          "author": "antara33",
          "body": "Yeah, at that size even 1080p to 1440p would be hard to tell without comparing directly.\n\n\nThe DPI of a 4k 17.3 inch display its absurd, but I guess one can make the argument that having more pixels to draw the upscaled games would make the image look crisp vs a lower res display, even if the image is not native 4k.",
          "score": 117,
          "created_utc": 1734289868.0,
          "replies": [
            {
              "id": "m28t8uy",
              "author": "QuickQuirk",
              "body": "1080 to 1440 is easy to spot. But 1440 to 4k is definitely a lot harder to see, especially if it's fast paced action game.\n\nAlso depends on your eyesight. With my glasses on, it's a lot easier to spot the 4k quality.",
              "score": 72,
              "created_utc": 1734304536.0,
              "replies": [
                {
                  "id": "m2904so",
                  "author": "antara33",
                  "body": "I agree with you, but take size into consideration here, we are talking about a really small display, at 24\" yeah, there is no way to not notice it, but at the size of this thing? And during gameplay? Really hard to tell I guess",
                  "score": 13,
                  "created_utc": 1734306931.0,
                  "replies": [
                    {
                      "id": "m2938rm",
                      "author": "QuickQuirk",
                      "body": "Don't forget that when it's a laptop formfactor, you're sitting a lot closer.\n\nI find it easier to spot 3k or 4k on a laptop screen than I do on a 75\" monster at normal room viewing distances.\n\nLets put it this way: 17\" display is just under quarter of the linear size of a 75\" TV.\n\nBut my laptop screen is only about 2 feet from my eyes, whereas the TV is more than 8 feet away. ie, more than the 1/4 difference.",
                      "score": 18,
                      "created_utc": 1734308015.0,
                      "replies": [
                        {
                          "id": "m2969k2",
                          "author": "antara33",
                          "body": "Oh yeah, youre close to it, thats true, but its still a really high DPI on a screen that size, unless youre reading, during gameplay I guess most people wont be able to tell the difference between 1440p and 2160p.\n\nStill image clarity should be better, even if pixel picking gets impossible.",
                          "score": 3,
                          "created_utc": 1734309065.0,
                          "replies": [
                            {
                              "id": "m29ntlt",
                              "author": "QuickQuirk",
                              "body": "yeah, as I said earlier, it's hard to spot in a fast paced action game.",
                              "score": 1,
                              "created_utc": 1734315576.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m2bx1f7",
                          "author": "erictho77",
                          "body": "I get what you’re saying but you’re comparing diagonal length when the actual size (area) is more like 19 times, not 4 times. The same pixel on a TV covers 19 times the area, not 4 times the area…",
                          "score": 1,
                          "created_utc": 1734358391.0,
                          "replies": [
                            {
                              "id": "m2d1kjl",
                              "author": "QuickQuirk",
                              "body": "Sure - but what you're missing is that the 'sqaure area' our vision is encompassing has also increased by the same function.\n\nie; A TV, twice the linear resolution at twice the linear distance takes up the *same* percentage of our vision.\n\nOtherwise, by your logic, the moon would appear much bigger in the sky :D",
                              "score": 1,
                              "created_utc": 1734371905.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m29meq5",
                      "author": "DuckDatum",
                      "body": "Smaller display for 4k, meaning more DPI, sounds awesome to me. I feel like it would look like 8k because it would be so much harder to notice any issues with the quality.",
                      "score": 3,
                      "created_utc": 1734315029.0,
                      "replies": []
                    },
                    {
                      "id": "m2ar6xj",
                      "author": "davemoedee",
                      "body": "You will be sitting right in front of it. If you can tell on a 55” TV across a living room, you can definitely tell sitting in front of this screen.",
                      "score": 2,
                      "created_utc": 1734334441.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m2a1o1n",
                  "author": "alidan",
                  "body": "depends on the aa at 1080p, console 4k usually looks worse than 1080p with good aa",
                  "score": 1,
                  "created_utc": 1734321092.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2aw0xd",
              "author": "lagerea",
              "body": "I have a 17.3\" 4k, it looks amazing over any 1080 or 2k I've had. I know it sounds dumb but you can absolutely tell the difference and 4k density should be on every screen.",
              "score": 6,
              "created_utc": 1734337641.0,
              "replies": [
                {
                  "id": "m2bjuth",
                  "author": "antara33",
                  "body": "I can imagine that even if youre not able to tell the difference by pixel picking, the added pixel density must produce a fantastic image, kinda like phone's screens do, even if we cant tell exactly WHAT changes, we feel the difference somehow.",
                  "score": 1,
                  "created_utc": 1734352742.0,
                  "replies": [
                    {
                      "id": "m2ci4i8",
                      "author": "lagerea",
                      "body": "It's just unbelievably crisp and somehow smooth at the same time.",
                      "score": 1,
                      "created_utc": 1734365754.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2bt8sg",
              "author": "None",
              "body": "1440 from 1080 is a pretty big difference even on a small screen.",
              "score": 3,
              "created_utc": 1734356879.0,
              "replies": [
                {
                  "id": "m2cwate",
                  "author": "Lied-",
                  "body": "I will always advocate for 4K though so you can do up scaling from 1080p. I have 2x27inch 1440p monitors with my MacBook Pro and it is a nightmare to try to program :/",
                  "score": 1,
                  "created_utc": 1734370260.0,
                  "replies": []
                },
                {
                  "id": "m2wyknt",
                  "author": "ghost_of_mr_chicken",
                  "body": "Damn near a VCR's worth of extra resolution ",
                  "score": 1,
                  "created_utc": 1734657654.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m28ta0p",
          "author": "ShadowfaxSTF",
          "body": "I have an HP laptop with a 15.6” 4K OLED screen ([link](https://www.hp.com/us-en/shop/pdp/hp-spectre-x360-laptop-15t-eb100-touch-3r480av-1)). I know you can only take my word for it, but it is insane how good 4K looks over regular HD. It’s like I’m looking through a window. \n\nAfter all, we’re not talking about a TV sitting 5-15 feet away… laptops are right there, only a couple feet from your face. 4K has four times the quality of 1440 and it’s easily noticeable imho.",
          "score": 12,
          "created_utc": 1734304547.0,
          "replies": [
            {
              "id": "m29c6fb",
              "author": "rachnar",
              "body": "Just to correct you, 4k is 4 times 1080p, not 1440p, which is itself 4 720p (where it gets it name qhd, quad hd). A 4k screen has roughly 8 billion pixels and a 1440p one has roughly 4 billion, and 1080p roughly 2 .",
              "score": 18,
              "created_utc": 1734311189.0,
              "replies": [
                {
                  "id": "m29vomq",
                  "author": "zulu10",
                  "body": "million, not billion.",
                  "score": 7,
                  "created_utc": 1734318659.0,
                  "replies": [
                    {
                      "id": "m2aqyp2",
                      "author": "rachnar",
                      "body": "Yeah my bad! The scale is right though. Man imagine if we did have billions of pixels on a display, you would never even be able to see them unless it was enormous.",
                      "score": 1,
                      "created_utc": 1734334288.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2amjad",
              "author": "sh-run",
              "body": "I have a 2.8k laptop (2880x1800) 14\" laptop. The display is gorgeous and much better than my old 1080p 14\" laptop. I have to set scaling to 150% for it to be useful. Not sure I've seen a 4k laptop in person, but I'd be curious to see if the difference between 4k and 2.8k is noticeable.",
              "score": 2,
              "created_utc": 1734331514.0,
              "replies": []
            },
            {
              "id": "m2b3y7r",
              "author": "oshinbruce",
              "body": "I went from a 4k laptop with 14\" to a qhd at 32\" and boy can I see the difference",
              "score": 1,
              "created_utc": 1734343182.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m27pwef",
          "author": "None",
          "body": "You mean the massive 17\" screen?",
          "score": 4,
          "created_utc": 1734291718.0,
          "replies": []
        },
        {
          "id": "m2arhdw",
          "author": "Eurynom0s",
          "body": "I think the argument for a 4K screen here isn't that you need 4K on a 17\" screen but that 4K is not an integer multiple of 1440p, it's 2.25x as many pixels. So there'd be weird scaling issues.",
          "score": 1,
          "created_utc": 1734334630.0,
          "replies": []
        },
        {
          "id": "m2bllc9",
          "author": "GoBBLeS-666",
          "body": "What else would you be doing? It’s a screen 😏",
          "score": 1,
          "created_utc": 1734353556.0,
          "replies": []
        },
        {
          "id": "m29km0e",
          "author": "4a4a",
          "body": "I have a 15.4\" 4k monitor on one of my laptops. It's indistinguishable from 1080p, but you know in your heart you know it's 4k. Ha ha.",
          "score": 1,
          "created_utc": 1734314335.0,
          "replies": []
        },
        {
          "id": "m276y7h",
          "author": "None",
          "body": "As opposed to NOT looking at your screen while playing a game? KO derf.",
          "score": -37,
          "created_utc": 1734285795.0,
          "replies": [
            {
              "id": "m27a6wv",
              "author": "Themadreposter",
              "body": "I think he means actively comparing a 4k screen to a 1440 screen against each other.",
              "score": 14,
              "created_utc": 1734286827.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m27m32n",
      "author": "Maravilla_23",
      "body": "The new portable PlayStation 5 **mod from China** is so chunky that gaming laptops suddenly seem sleek in comparison. \n\nMade by a group called BBook AI, and **Weighing in at a whopping 9.5 pounds for the laptop alone**– plus an **additional pound for the power brick **– you could practically get a workout just carrying the “BBook AI Original Edition” around.\n\n**Hard pass for me**",
      "score": 102,
      "created_utc": 1734290516.0,
      "replies": [
        {
          "id": "m2c05tu",
          "author": "x925",
          "body": "For someone like me that works away, it would make sense to throw it in the suitcase and forget about it till i get to the hotel.  But thats why i bought a laptop.",
          "score": 8,
          "created_utc": 1734359583.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2782l4",
      "author": "None",
      "body": "Neat job... but without a battery, it's kind of missing the point of jamming something into a \"laptop\" form factor IMO... also as much noise as a \"hairdryer\"? LOL.   \nFun DIY challenge though, and it looks clean in a shot. should get then whatever attention they were seeking i guess.",
      "score": 362,
      "created_utc": 1734286155.0,
      "replies": [
        {
          "id": "m28c3un",
          "author": "CorruptedArcher",
          "body": "most gaming laptops barely play for more than an hour or two without the battery its barely a negative having to plug it in. Also not requiring a monitor of tv is a huge plus.",
          "score": 108,
          "created_utc": 1734298822.0,
          "replies": [
            {
              "id": "m28mj3t",
              "author": "Lurking_like_Cthulhu",
              "body": "Even within that 1-2 hour of game time I rarely see it mentioned that the performance also tanks while on battery power. Even the high end laptops will struggle to get acceptable performance unless they’re plugged in all the time.",
              "score": 75,
              "created_utc": 1734302218.0,
              "replies": [
                {
                  "id": "m28qd3z",
                  "author": "CorruptedArcher",
                  "body": "and the fans sounding like a hair dryer is also a gaming laptop experience. compromises are made for it to be portable. Nothing that noise canceling headphones cant deal with.",
                  "score": 29,
                  "created_utc": 1734303519.0,
                  "replies": [
                    {
                      "id": "m28ss7r",
                      "author": "VeganCanary",
                      "body": "True, and the other thing is the performance being drastically different in winter vs summer. \n\nI can play most games on mine in the winter, but if it’s a hot summer’s day I have no chance of playing something like Tarkov or Warzone - it gets too hot and caps the performance.\n\nI guess it’s not the biggest issue, as I’m unlikely to want to spend a nice day in summer gaming anyway.",
                      "score": 7,
                      "created_utc": 1734304376.0,
                      "replies": [
                        {
                          "id": "m28thpc",
                          "author": "QuickQuirk",
                          "body": "For me, summer isn't whether the GPU gets too hot - it's whether *I* get too hot. Those modern GPU/CPUs are full on 600watt heaters, and it's hard to keep the room cool enough!",
                          "score": 5,
                          "created_utc": 1734304620.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m2b8nzm",
                      "author": "NV-Nautilus",
                      "body": "Cries in Zephyrus G14. My little jet engine and it still runs at 90c lol.",
                      "score": 2,
                      "created_utc": 1734346374.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m2a4df8",
                  "author": "chainer3000",
                  "body": "Right, but it’s nice being able to disconnect from power without the entire station shutting down. Moving from one outlet to another elsewhere etc",
                  "score": 6,
                  "created_utc": 1734322237.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m29l548",
              "author": "iboughtarock",
              "body": "I mean I guess, but if you have integrated graphics you can still get 8-10 hours browsing or watching videos on a gaming laptop. Assuming the battery is around 90Wh.",
              "score": 4,
              "created_utc": 1734314539.0,
              "replies": [
                {
                  "id": "m29o396",
                  "author": "whyyy66",
                  "body": "Well yes, but that’s not really using the “gaming” part. You pay a very steep cost specifically for the ability to play higher end games, and if you’re mostly going to be browsing and playing low demand games a macbook is far better. 12+ hours easily",
                  "score": 2,
                  "created_utc": 1734315674.0,
                  "replies": [
                    {
                      "id": "m29p05x",
                      "author": "iboughtarock",
                      "body": "Sure but gaming is limited on any laptop because of airplanes. You can only have a 99Wh battery on an airplane so it will never get better than it presently is. Having the ability to browse and game on the same device is huge. Just plug it in and you can play forever.",
                      "score": 3,
                      "created_utc": 1734316025.0,
                      "replies": [
                        {
                          "id": "m29qqrd",
                          "author": "whyyy66",
                          "body": "Wonder if they’ll ever increase the amount allowed on planes, would be nice. But also it seems like gaming laptops have shit build quality on average",
                          "score": 2,
                          "created_utc": 1734316702.0,
                          "replies": [
                            {
                              "id": "m29rzh2",
                              "author": "iboughtarock",
                              "body": "Unlikely unless different battery components are used besides Li-ion. And it really depends on what you buy and who you buy from and what you want.\n\nFor me it has to have a numpad, backlit keyboard, metal shell, high NIT screen, 8 hour battery life, and good screen quality. MSI seems to consistently meet those requirements and for $600-1,500.\n\nI have been in the market recently for a laptop since I am going back to school and bought a 4070 MSI from bestbuy for $1000 last week and it was a beautiful computer, but the idiots at bestbuy sold it to me with a 45Wh battery when the MSI website has it speced for 90Wh so I had to return it. Also got a 4050 laptop from Walmart for $500 on black friday, but the battery can only get 2.5 hours so I have to return that too.",
                              "score": 2,
                              "created_utc": 1734317196.0,
                              "replies": [
                                {
                                  "id": "m29tv1f",
                                  "author": "whyyy66",
                                  "body": "That’s been my experience, they look and feel good externally but it’s a shot in the dark how they actually perform. I’ve heard good things about lenovo, just avoid acer. For school personally i’d get a mac, unless I absolutely had to have windows and didn’t want to mess with wine. The M chips are insanely good, and the build quality is the best by a long shot",
                                  "score": 2,
                                  "created_utc": 1734317937.0,
                                  "replies": [
                                    {
                                      "id": "m29uqmj",
                                      "author": "iboughtarock",
                                      "body": "Yeah I ended up going with a [Lenovo Yogi](https://www.bestbuy.com/site/lenovo-yoga-7i-2-in-1-16-2k-touchscreen-laptop-intel-core-ultra-7-155u-with-16gb-memory-1tb-ssd-storm-grey/6571369.p?skuId=6571369) for $650 you really cannot beat it. I don't need any crazy GPU power since I have a rig at home, but that MSI I found would have been great except I was unable to find an 90Wh battery online for sale otherwise it really would have been the perfect laptop for me. MSI doesn't sell batteries new or used and eBay I couldn't find any either.",
                                      "score": 1,
                                      "created_utc": 1734318284.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m29wnci",
                          "author": "neonmantis",
                          "body": "> You can only have a 99Wh battery on an airplane so it will never get better than it presently is.\n\nSome planes have plugs. It is a real game changer.",
                          "score": 1,
                          "created_utc": 1734319040.0,
                          "replies": [
                            {
                              "id": "m29ye65",
                              "author": "iboughtarock",
                              "body": "Yeah that really is huge, but I was more saying that laptop manufacturers will not go over 99Wh due to that reason so it hampers people who will never fly with the laptop not having more battery ability without an at home power station battery solution.",
                              "score": 3,
                              "created_utc": 1734319745.0,
                              "replies": [
                                {
                                  "id": "m2ahupo",
                                  "author": "neonmantis",
                                  "body": "Going back like a decade ago I used to get more life out of my laptops on a plane as it had a removable battery and could take a couple of spares with me. The EU has a new law that from 2027 or something will force some personal devices like phones to have a replaceable battery but don't know if that extends to laptops.",
                                  "score": 2,
                                  "created_utc": 1734328804.0,
                                  "replies": [
                                    {
                                      "id": "m2cm4qx",
                                      "author": "iboughtarock",
                                      "body": "Easily removable batteries are honestly not something that ever crossed my mind, but that really might solve the whole issue. Especially if you had another really small battery you could keep on device so you can just temporarily shut down and not lose RAM or have tabs close and such.",
                                      "score": 2,
                                      "created_utc": 1734367041.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m29v0ws",
                  "author": "CorruptedArcher",
                  "body": "yeah but I bought it for gaming",
                  "score": 2,
                  "created_utc": 1734318397.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m27jghf",
          "author": "antara33",
          "body": "The sound thing is indeed an issue, but the battery one? Maybe not that much.\n\n\nAs someone that have a notebook for work stuff that mainly connect to remote servers and rendering farms, my device is 100% time connected to the charger.\n\n\nAnd that is the same for any notebook I ever used (at home, that is).\n\n\nFor traveling, car usage, etc, yeah, I can totally see the battery as being an issue, but for home usage with all the outlets at home, I can see value on having a playstation 5 that can be moved along its display from room to room with just the need of an electrical outlet.\n\n\nNot saying its perfect, its not, but I guess it can work I guess.",
          "score": 27,
          "created_utc": 1734289694.0,
          "replies": [
            {
              "id": "m28omda",
              "author": "suicidaleggroll",
              "body": "I’ll never understand people that buy a laptop and then leave it plugged into a docking station on their desk and never move it.  Just buy a desktop.  It’s half the price, twice as powerful, and will last twice as long.",
              "score": 17,
              "created_utc": 1734302913.0,
              "replies": [
                {
                  "id": "m297681",
                  "author": "hanlonmj",
                  "body": "Honestly, I can’t think of any OEM that markets an Optiplex-like system for consumers. It’s always huge, RGB-infested, DIY gaming setups that most people aren’t going to want to deal with just to check email and access Sharepoint or whatever.\n\nIt’s not nearly as easy to “just buy a desktop” as it probably should be these days",
                  "score": 3,
                  "created_utc": 1734309387.0,
                  "replies": []
                },
                {
                  "id": "m294skm",
                  "author": "antara33",
                  "body": "I can only speak for myself here, but in my case at least, its a need.\n\nI need to have a laptop in order to being able to meet with clients in person from time to time, and moving all my work related stuff from a desktop to a laptop over and over is simply cumbersome.\n\nIts not about economics, its about having the ability to either use it \"desktop like\" or take it away to another place if I need to.\n\nAnd from what I know, that is why a lot of people do that. They have a laptop entirely in order to have freedom of qhere they want to use it/take it.",
                  "score": 5,
                  "created_utc": 1734308548.0,
                  "replies": [
                    {
                      "id": "m295ai9",
                      "author": "JustAnotherSuit96",
                      "body": "> I’ll never understand people that buy a laptop and then leave it plugged into a docking station on their desk and **never move it**",
                      "score": 2,
                      "created_utc": 1734308723.0,
                      "replies": [
                        {
                          "id": "m295ppe",
                          "author": "antara33",
                          "body": "Most people move it indeed, even a little.\n\nNobody really leaves it plugged 100% of the time, even if taking it to bed to see a movie, they move it.",
                          "score": 2,
                          "created_utc": 1734308870.0,
                          "replies": [
                            {
                              "id": "m2axzst",
                              "author": "ooohexplode",
                              "body": "Yeah mine rarely leaves the house, but today alone I've watched football while cooking dinner, plugged it into my 4k TV to play Spider-Man, then moved it to my desk for web browsing. I'd rather pay a slight premium to have the portability.",
                              "score": 1,
                              "created_utc": 1734339016.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m27mmtp",
              "author": "None",
              "body": "[removed]",
              "score": -44,
              "created_utc": 1734290686.0,
              "replies": [
                {
                  "id": "m27t2nr",
                  "author": "sharpshooter999",
                  "body": "I only have a laptop, and it gets used for gaming and work. If im gaming, the battery doesn't last long, so it's always plugged in. If im using it for work, it lasts way longer. Sometimes, I play while sitting on the couch, and I have a universal dock with dual monitors in my office. If it's hooked to the dock, it's on a cooler pad and plugged in to power. \n\nMy biggest wish is that it had an easily removable battery like my old HP had, just a couple of spring loaded slide latches. Then, I'd rig up some kind of a PSU/battery type thing that always plugged in so I could save my battery for traveling. Right now my battery has 35% wear on it",
                  "score": 6,
                  "created_utc": 1734292719.0,
                  "replies": [
                    {
                      "id": "m27wv38",
                      "author": "ehxy",
                      "body": "Yeah, my buddy picked up the asus flow laptop/tablet.  games when he's at home and plugs in the xg mobile 4090.  he's happy.  honestly if it isn't bottle necked which I suspect it is, it's probabliy the ideal solution for laptop that's for gaming/working",
                      "score": 4,
                      "created_utc": 1734293938.0,
                      "replies": [
                        {
                          "id": "m2825ph",
                          "author": "trumpsucks12354",
                          "body": "Those things have overkill top end i9s and Ryzen 9s so a bottleneck won’t be an issue. Its a mobile 4090 which isn’t as powerful as the big boy 4090s",
                          "score": 1,
                          "created_utc": 1734295636.0,
                          "replies": [
                            {
                              "id": "m282muz",
                              "author": "ehxy",
                              "body": "yeah but if it still does the job who cares, it under-runs while not in gaming mode so not as bad as expected when out in the field.  probably revisit how he likes it after a year but he's a site inspector and travels around a lot in all kinds of weather so I'm interested to know how he feels about it after some use",
                              "score": 2,
                              "created_utc": 1734295783.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m2882zt",
                  "author": "blazelet",
                  "body": "You should feature this on your law blog.",
                  "score": 2,
                  "created_utc": 1734297517.0,
                  "replies": []
                },
                {
                  "id": "m282y8z",
                  "author": "TheGreatDuv",
                  "body": "The majority of people aren't using laptops \"on the go\" unless you're support or on a flight/in a car as a passenger.\n\nMajority of the time you're somewhere with a power socket, at a coffee shop, at college/university, at work, at someone elses house. You get outlets on trains nowadays as well.",
                  "score": 1,
                  "created_utc": 1734295885.0,
                  "replies": []
                },
                {
                  "id": "m28ez57",
                  "author": "None",
                  "body": "Looking a little lonely there, stupid.",
                  "score": 1,
                  "created_utc": 1734299728.0,
                  "replies": [
                    {
                      "id": "m3kk52j",
                      "author": "MrBobLoblaw",
                      "body": "You really think smart people are the popular ones?",
                      "score": 1,
                      "created_utc": 1735031762.0,
                      "replies": [
                        {
                          "id": "m3kv587",
                          "author": "None",
                          "body": "On reddit? Yes, absolutely.",
                          "score": 1,
                          "created_utc": 1735039175.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m28iq6y",
                  "author": "robitussinlatte4life",
                  "body": "Dude I don't know why anybody is downvoting you. You are absolutely right, and this is one of the most logical conclusions being reached on this specific thread. Dude thinks his anecdotal bullshit matters, when in reality laptops were made to be mobile, not tethered down every time they're opened. Bunch of people feeling personally attacked, that's how it always is. No criticism is constructive to those types of people.",
                  "score": -1,
                  "created_utc": 1734300957.0,
                  "replies": [
                    {
                      "id": "m295i7w",
                      "author": "antara33",
                      "body": "Maybe because he was despective/patronizing and doing jackass remarks?\n\nAlso, its not my experience alone. A lot of people use their laptop like that.\n\nSome of us simply need the ability to take it away if needed, but dont need to have it being moved away every single day every single time.\n\nWhy the heck would I be unplugging/plugging in it instead of simply leaving it plugged in until I need to move with it to meet with a client, work from another place, etc?\n\nEvery user have its own reasons to purchase what they purchase, I have a desktop for personal use, but work? Laptop. I simply need to being able to take it with me on demand without messing with moving stuff from one system to another, period.",
                      "score": 2,
                      "created_utc": 1734308798.0,
                      "replies": [
                        {
                          "id": "m2964az",
                          "author": "robitussinlatte4life",
                          "body": "Eh whatever dude, I don't care *that* much.",
                          "score": 1,
                          "created_utc": 1734309012.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m3khuz2",
                      "author": "MrBobLoblaw",
                      "body": "People are fucking stupid man.  They can't think outside of their own little dumbfuck mental holes they've dug themselves into.  I wear the down votes like a badge of honor.  Dipshits.",
                      "score": 1,
                      "created_utc": 1735030189.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m2auag2",
          "author": "Raznilof",
          "body": "Agreed - I wonder if perhaps a point to this is less the direct functionality compared to “a tv + console” and more that it allows playing in a compact setting: Smaller house, shared screen, kids desk. Probably  better use cases than PS5 on the go, which a steamdeck does better (as an overall experience and software availability).",
          "score": 1,
          "created_utc": 1734336466.0,
          "replies": []
        },
        {
          "id": "m2853lw",
          "author": "Swineservant",
          "body": "Plug n' Lug...",
          "score": 1,
          "created_utc": 1734296566.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m28kzxc",
      "author": "Optimesh",
      "body": "DIYPerks did it [better](https://youtu.be/W4PHhurAhwc)!",
      "score": 33,
      "created_utc": 1734301708.0,
      "replies": [
        {
          "id": "m2az7ba",
          "author": "balazs955",
          "body": "No shit, a hand-made, one-man project have a better result than a line produced chinese pile of shit?  \nHow  can this be?",
          "score": -19,
          "created_utc": 1734339865.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m274aff",
      "author": "None",
      "body": "Buy a 4070 laptop and call it a day. Buy a 4080 and you're good for a long ass time.",
      "score": 76,
      "created_utc": 1734284939.0,
      "replies": [
        {
          "id": "m2756cp",
          "author": "RepulsiveResource624",
          "body": "Whats the cheapest 4080?",
          "score": 12,
          "created_utc": 1734285226.0,
          "replies": [
            {
              "id": "m27epck",
              "author": "None",
              "body": "Lenovo has some nice customizable builds on their website. I plan on getting a laptop at some point soon, just not right now. I built myself a Legion i7 laptop there and they give you the option to not include Windows. For the amount I saved by choosing that, I could double the RAM from 16 to 32 GB and also double the SSD from 1TB to 2 TB. With the Black Friday/Cyber Monday discounts they had it was honestly such a nice laptop, but I'm waiting a little bit further before jumping the gun.\n\nWindows keys can easily be bought for like 2-10 dollars or so, no reason to buy the ones for 100-200 dollars with the laptops.",
              "score": 17,
              "created_utc": 1734288209.0,
              "replies": [
                {
                  "id": "m284005",
                  "author": "IcodyI",
                  "body": "You should just run a windows activator script instead of buying stolen $5 keys lol",
                  "score": 18,
                  "created_utc": 1734296215.0,
                  "replies": [
                    {
                      "id": "m28twhc",
                      "author": "None",
                      "body": "I guess, I didn't know it existed and/or ran just as fine as bought keys until recently.",
                      "score": 3,
                      "created_utc": 1734304761.0,
                      "replies": []
                    },
                    {
                      "id": "m2an2fk",
                      "author": "VirtuousVice",
                      "body": "Please tell me more.",
                      "score": 1,
                      "created_utc": 1734331836.0,
                      "replies": [
                        {
                          "id": "m2c0kas",
                          "author": "IcodyI",
                          "body": "https://github.com/massgravel/Microsoft-Activation-Scripts",
                          "score": 1,
                          "created_utc": 1734359734.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m284otk",
              "author": "alex_Bellddc",
              "body": "Probably about $1500",
              "score": 3,
              "created_utc": 1734296435.0,
              "replies": []
            },
            {
              "id": "m27d1y1",
              "author": "kfmush",
              "body": "I paid $1900 USD for an Alienware M16 with a 4080 and a Ryzen 7840u around the holidays last year. It only has 16 GB of RAM though.\n\nEdit: it was an M16, not 18",
              "score": 6,
              "created_utc": 1734287698.0,
              "replies": [
                {
                  "id": "m29lhxn",
                  "author": "iboughtarock",
                  "body": "Probably can be upgraded to 64GB ram for cheap. If you wanna find max capacity:  \n  \n`wmic memphysical get maxcapacityEx`\n\nThe capacity is shown as Kilobytes, so you have to convert it to Gigabytes by dividing the number provided in the report by 1,048,576.",
                  "score": 2,
                  "created_utc": 1734314676.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2bivkh",
              "author": "tqmirza",
              "body": "I don’t know how cheap it is, but last year I tested almost every 4080 laptop on the entire market for work etc. The two best ones in my opinion? The ASUS G14 with the 4080, absolute performance BEAST for its size.",
              "score": 2,
              "created_utc": 1734352260.0,
              "replies": [
                {
                  "id": "m2bmot9",
                  "author": "OldTimez",
                  "body": "Wait you only mentioned one laptop not two. D:",
                  "score": 2,
                  "created_utc": 1734354056.0,
                  "replies": [
                    {
                      "id": "m2bmvk0",
                      "author": "tqmirza",
                      "body": "Oh I realised the second one is one of the more expensive ones on the market but the best one out there. Strix Scar 16.",
                      "score": 2,
                      "created_utc": 1734354141.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m275k30",
              "author": "None",
              "body": "I bought my 4080 laptop for 2700 CAD last year in february. Helios predator",
              "score": 1,
              "created_utc": 1734285349.0,
              "replies": [
                {
                  "id": "m29os32",
                  "author": "whyyy66",
                  "body": "How’s the cooling? Returned an acer because the i9 would thermal throttle constantly, couldn’t even under volt with their shitty bios either",
                  "score": 1,
                  "created_utc": 1734315939.0,
                  "replies": [
                    {
                      "id": "m29qqsp",
                      "author": "None",
                      "body": "Ive had no issue. But i dont push 4k only 2k. Space marine 2/cyber punk maxed out no problem. Though the fans are pretty loud.",
                      "score": 2,
                      "created_utc": 1734316703.0,
                      "replies": [
                        {
                          "id": "m29rhtq",
                          "author": "whyyy66",
                          "body": "I’d get a hardware monitor if you don’t already, I wouldn’t have been able to tell the cpu was spiking to 105+ without it lol. Doubt it’s a problem with AMD versions though",
                          "score": 2,
                          "created_utc": 1734317001.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m28i7us",
              "author": "friskerson",
              "body": "Saw a 4080 laptop on buildapcsales for $1000 within this past couple weeks. They’re rare tho.",
              "score": 0,
              "created_utc": 1734300788.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m28ynxl",
          "author": "Lia_Llama",
          "body": "It’s a diy build just buying a laptop isn’t really fun",
          "score": 2,
          "created_utc": 1734306420.0,
          "replies": [
            {
              "id": "m28ywfb",
              "author": "None",
              "body": "You could also build your own TV. Must be fun.",
              "score": 3,
              "created_utc": 1734306502.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2asrbe",
          "author": "BringBackSoule",
          "body": "cant wait to play gta 6 on my 4070 laptop in 2025\n\n\noh wait...",
          "score": -2,
          "created_utc": 1734335462.0,
          "replies": [
            {
              "id": "m2bnwtc",
              "author": "None",
              "body": "?",
              "score": 1,
              "created_utc": 1734354612.0,
              "replies": [
                {
                  "id": "m2bzqcr",
                  "author": "BringBackSoule",
                  "body": "you know its only releasing at first on consoles right?",
                  "score": -1,
                  "created_utc": 1734359418.0,
                  "replies": [
                    {
                      "id": "m2c3bwd",
                      "author": "None",
                      "body": "And? What does it have to do with anything. If you are a pc gamer with a 2k+ pc you probably have a 500$ console too.",
                      "score": 1,
                      "created_utc": 1734360745.0,
                      "replies": [
                        {
                          "id": "m2c3r9s",
                          "author": "BringBackSoule",
                          "body": "lol why, it's peasant shit.",
                          "score": 0,
                          "created_utc": 1734360899.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m27jmzw",
      "author": "adamdoesmusic",
      "body": "The commenters here seem to be competing in the Missing the Point Olympics.",
      "score": 12,
      "created_utc": 1734289752.0,
      "replies": []
    },
    {
      "id": "m273gbj",
      "author": "BenjiSBRK",
      "body": "![gif](giphy|s239QJIh56sRW|downsized)",
      "score": 34,
      "created_utc": 1734284667.0,
      "replies": [
        {
          "id": "m27cizt",
          "author": "junttiana",
          "body": "Because its fun, people have done stuff like this with consoles forever, turning them into laptops and handhelds just to show they can do it lol",
          "score": 13,
          "created_utc": 1734287537.0,
          "replies": [
            {
              "id": "m282m55",
              "author": "AtsignAmpersat",
              "body": "Yeah. It’s basically just a project to see if you can. I just spend the last day and half setting up and old PC on windows 98 complete with an Internet museum and working AIM with a proxy server. Why? Because I’m slowly mentally returning to the 90s.",
              "score": 5,
              "created_utc": 1734295777.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m29bz1a",
      "author": "AliveAndNotForgotten",
      "body": "Weighs almost twice my 4080 laptop",
      "score": 4,
      "created_utc": 1734311114.0,
      "replies": []
    },
    {
      "id": "m27z9zg",
      "author": "SteakandTrach",
      "body": "Those leds on the front running cattywampus  bugs me more than it should.",
      "score": 6,
      "created_utc": 1734294723.0,
      "replies": [
        {
          "id": "m281sy3",
          "author": "groovehouse",
          "body": "It's homemade hopefully that helps you settle.",
          "score": 3,
          "created_utc": 1734295522.0,
          "replies": [
            {
              "id": "m288ds3",
              "author": "SteakandTrach",
              "body": "I build stuff a lot. I still would have bothered to drill holes in a straight line, even if no one was going to look at it but me.",
              "score": 2,
              "created_utc": 1734297616.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m2bxepl",
      "author": "Kalisho",
      "body": "And limited by being a console and not an actual laptop.. and can't even run latest titles in 120 FPS.",
      "score": 3,
      "created_utc": 1734358534.0,
      "replies": []
    },
    {
      "id": "m2d928k",
      "author": "MarkusRight",
      "body": "$2,750 BTW, For that price you can quite literally buy a gaming laptop thats slimmer and has twice the performance. In what world is that price worth it just for a hacked up PS5 with a screen and an internal battery?",
      "score": 3,
      "created_utc": 1734374237.0,
      "replies": []
    },
    {
      "id": "m27tga3",
      "author": "TenorHorn",
      "body": "I too love my legs being melted",
      "score": 2,
      "created_utc": 1734292837.0,
      "replies": [
        {
          "id": "m29pz75",
          "author": "bonesnaps",
          "body": "I hope you never planned on having children. Lol",
          "score": 1,
          "created_utc": 1734316402.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m27wisb",
      "author": "jjamesr539",
      "body": "Seems like you could just buy a gaming laptop with a battery and pretty much equivalent display for 500$ less that’ll run all the same shit except PlayStation exclusives",
      "score": 2,
      "created_utc": 1734293827.0,
      "replies": [
        {
          "id": "m281e7m",
          "author": "chrisagiddings",
          "body": "What fun is that?\n\nWhy poo poo something you’ve clearly not gonna buy instead of just letting others smile a bit?",
          "score": -1,
          "created_utc": 1734295390.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m29xdk4",
      "author": "Wiggles69",
      "body": "'Portable' is doing a lot of heavy lifting in that sentence.\n\nPun intended, obv",
      "score": 2,
      "created_utc": 1734319332.0,
      "replies": []
    },
    {
      "id": "m2a0d0z",
      "author": "bloodknife92",
      "body": "17 inches and 4k resolution? That pixel density is just unrealistic. No one would see the difference between 4k and 1080p on just 17 inches... That just sounds like sacrificing performance in the name of flex.",
      "score": 2,
      "created_utc": 1734320555.0,
      "replies": []
    },
    {
      "id": "m2a7utp",
      "author": "Realmofthehappygod",
      "body": "\"73.1decibles, as a loud a sports car.\"\n\nPerfect for your morning commute on the train.",
      "score": 2,
      "created_utc": 1734323792.0,
      "replies": [
        {
          "id": "m2a9gle",
          "author": "ZaDu25",
          "body": "Can't even use it on a train. It doesn't have a battery and needs to be plugged in to be used just like a regular PS5 lol. It's just a substantially more expensive PS5 with a screen attached to it.",
          "score": 3,
          "created_utc": 1734324543.0,
          "replies": [
            {
              "id": "m2aab5h",
              "author": "Realmofthehappygod",
              "body": "Lotta trains have outlets to be fair, but yea.\n\nJust bring a gad generator along side it.",
              "score": 2,
              "created_utc": 1734324943.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2adwbx",
          "author": "HeatherReadsReddit",
          "body": "That’s loud enough to cause permanent hearing loss.",
          "score": 1,
          "created_utc": 1734326704.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2adhqm",
      "author": "oledayhda",
      "body": "Better than my CyberPower laptop with a 4090, water cooler, top of the line SSD & DDR5 memory haha, yeah right. My gaming laptop crushes everything I play with no issues & the water cooler fixes all gaming laptop heating issues you will encounter. \n\nThis can only be a powerhouse if it is in a good price range & delivers a great experience.\n\nEdit: annnnnd what do you know, for the price it is a complete failure because you are capped at 60mhz. Oofffffff. Paid 1k more for mine with 244mhz getting 100-140fps every game.",
      "score": 2,
      "created_utc": 1734326497.0,
      "replies": []
    },
    {
      "id": "m2aiz9x",
      "author": "ladyfumiko",
      "body": "Does anyone know if it can be hooked to an external monitor as well? \n\nIk ik that may defeat the purpose. Legit just curious.",
      "score": 2,
      "created_utc": 1734329432.0,
      "replies": []
    },
    {
      "id": "m2ajmd7",
      "author": "FlappyPosterior",
      "body": "Does it come with the PS5 game?",
      "score": 2,
      "created_utc": 1734329795.0,
      "replies": []
    },
    {
      "id": "m2bgs5u",
      "author": "Zieprus_",
      "body": "Umm why does this exist?",
      "score": 2,
      "created_utc": 1734351188.0,
      "replies": []
    },
    {
      "id": "m2775fn",
      "author": "ShitImBadAtThis",
      "body": "Oh my lord. The price tag is ridiculous. And 99% of ps5 games won't use 4k resolution. And it's 9.5 pounds, that's massive. This one is definitely a rich person buy or just a singular, custom mod that they don't expect anyone to actually buy.",
      "score": 5,
      "created_utc": 1734285861.0,
      "replies": [
        {
          "id": "m28zc7s",
          "author": "Lia_Llama",
          "body": "Wait ps5 doesn’t run at 4k? I’m a pc gamer but why are gaming TVs advertised as 4k if consoles can’t do that what’s it for lol",
          "score": 1,
          "created_utc": 1734306656.0,
          "replies": [
            {
              "id": "m29jezu",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1734313884.0,
              "replies": [
                {
                  "id": "m29nj5m",
                  "author": "Xetanees",
                  "body": "Some games definitely do run 4k native… lmao.  Of course there are going to be titles that upscale, but not EVERY single one does.",
                  "score": 3,
                  "created_utc": 1734315463.0,
                  "replies": []
                },
                {
                  "id": "m2a7sk5",
                  "author": "Lia_Llama",
                  "body": "I have a fairly powerful PC but I have been playing 4k for like… years and years it’s not new.\n\nPC Monitors almost always come in lower resolutions like 1440p but since TVs seem to be universally 4k I figured consoles were too",
                  "score": 2,
                  "created_utc": 1734323763.0,
                  "replies": [
                    {
                      "id": "m2aafbj",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1734324999.0,
                      "replies": [
                        {
                          "id": "m2abl0s",
                          "author": "Lia_Llama",
                          "body": "The 4090 can do ultra settings at native 4k60 with ray tracing just fine, you need upscaling for 4k60 path tracing and psycho ray tracing though",
                          "score": 2,
                          "created_utc": 1734325557.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m28mt09",
      "author": "cat_prophecy",
      "body": "Anyone remember the guy who put a PS2, XBOX, GameCube, and gaming PC into one case?",
      "score": 1,
      "created_utc": 1734302312.0,
      "replies": [
        {
          "id": "m2dmrn7",
          "author": "whatsupbrosky",
          "body": "In the clear case?",
          "score": 1,
          "created_utc": 1734378456.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m29i389",
      "author": "JerryLZ",
      "body": "😆",
      "score": 1,
      "created_utc": 1734313391.0,
      "replies": []
    },
    {
      "id": "m29lcgj",
      "author": "Nodak1979",
      "body": "Damn, I'd think they'd want to make it a little more travel friendly than that....it looks like it'd be a monstrosity to lug around.",
      "score": 1,
      "created_utc": 1734314617.0,
      "replies": []
    },
    {
      "id": "m29qiwt",
      "author": "TechGoat",
      "body": "\"BBook AI Original Edition\"\n\nYou idiots, this doesn't even have anything to do with \"AI\"!\n\nYou made a cool product/mod, come up with an at least semi interesting name for it!",
      "score": 1,
      "created_utc": 1734316616.0,
      "replies": []
    },
    {
      "id": "m29vbyp",
      "author": "Its_Number_Wang",
      "body": "This is what my uncle's 386-based, 4-color screen laptop looked like in the early 90s. lol.",
      "score": 1,
      "created_utc": 1734318519.0,
      "replies": []
    },
    {
      "id": "m2a199p",
      "author": "MetzgerBoys",
      "body": "Why though?",
      "score": 1,
      "created_utc": 1734320923.0,
      "replies": []
    },
    {
      "id": "m2a4tmz",
      "author": "J10Blandi",
      "body": "I feel like 4K is a waste at that screen size",
      "score": 1,
      "created_utc": 1734322431.0,
      "replies": []
    },
    {
      "id": "m2ah3gn",
      "author": "TheReligiousSpaniard",
      "body": "*will set you back $2,750*",
      "score": 1,
      "created_utc": 1734328392.0,
      "replies": []
    },
    {
      "id": "m2akq9r",
      "author": "LowConclusion3901",
      "body": "Screen so small they’re trying to prey on kids and tech illiterate bros. So to no ones surprise the wallpaper on first pic is mandarin.",
      "score": 1,
      "created_utc": 1734330437.0,
      "replies": []
    },
    {
      "id": "m2al1ym",
      "author": "None",
      "body": "N…. No",
      "score": 1,
      "created_utc": 1734330629.0,
      "replies": []
    },
    {
      "id": "m2b63pr",
      "author": "ishamm",
      "body": "Ok but... why?",
      "score": 1,
      "created_utc": 1734344650.0,
      "replies": []
    },
    {
      "id": "m2bk98u",
      "author": "Ashencroix",
      "body": "I don't think weighing 9.5 lbs is anywhere near the realm of \"portable\".",
      "score": 1,
      "created_utc": 1734352932.0,
      "replies": []
    },
    {
      "id": "m2bqk4x",
      "author": "Spare_Temporary_2964",
      "body": "2500$",
      "score": 1,
      "created_utc": 1734355760.0,
      "replies": []
    },
    {
      "id": "m2btczc",
      "author": "Maguire_018",
      "body": "But why?",
      "score": 1,
      "created_utc": 1734356926.0,
      "replies": []
    },
    {
      "id": "m2bvecn",
      "author": "Best-Theory-330",
      "body": "What’s it cost?",
      "score": 1,
      "created_utc": 1734357742.0,
      "replies": []
    },
    {
      "id": "m278swu",
      "author": "None",
      "body": "Reminds me of some of the stuff Ben Hecks used to make (probably still does)\n\nIt's extremely impractical but still a cool concept and fairly well executed. But I will say that the noise levels alone prevent this from ever seeing a production run",
      "score": 1,
      "created_utc": 1734286385.0,
      "replies": [
        {
          "id": "m27pi78",
          "author": "None",
          "body": "What?  I’m sorry I can’t hear you over the fan noise?  It sounds like it’s about to fucking fly off into space!",
          "score": 3,
          "created_utc": 1734291592.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m28zo04",
      "author": "Sam_nick",
      "body": "Or buy a gaming desktop like a normal person",
      "score": 1,
      "created_utc": 1734306768.0,
      "replies": [
        {
          "id": "m2aowf8",
          "author": "inqs",
          "body": "Google \"Hobby\"",
          "score": 0,
          "created_utc": 1734332965.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m273eh7",
      "author": "blackout-loud",
      "body": "Meh, would rather buy the portable and call it a day.",
      "score": 0,
      "created_utc": 1734284650.0,
      "replies": []
    },
    {
      "id": "m284i1u",
      "author": "alex_Bellddc",
      "body": "If only there were another kind of laptop, with a battery, that can play all the steam games as well, for 1/4th the cost or something 🤔……",
      "score": 0,
      "created_utc": 1734296374.0,
      "replies": []
    },
    {
      "id": "m2drtnp",
      "author": "BbyJ39",
      "body": "17” screen isn’t massive under any circumstances.",
      "score": 0,
      "created_utc": 1734380036.0,
      "replies": []
    },
    {
      "id": "m27nacj",
      "author": "brokenmessiah",
      "body": "It doesnt matter if its got the same specs as a PS5 if it can't play Astro Bot.",
      "score": -1,
      "created_utc": 1734290890.0,
      "replies": []
    },
    {
      "id": "m276eil",
      "author": "StuffinYrMuffinR",
      "body": "Haha what is this 2005? 17in is not a massive display",
      "score": -12,
      "created_utc": 1734285618.0,
      "replies": [
        {
          "id": "m2777f9",
          "author": "None",
          "body": "It is for the average ***laptop***. Which... in-case it escaped your notice, is KINDA the fucking gimmick here champ.",
          "score": 5,
          "created_utc": 1734285878.0,
          "replies": [
            {
              "id": "m27880l",
              "author": "StuffinYrMuffinR",
              "body": "17in is just on the higher size of normal, champ. If you wanna call it massive then it should be over 20",
              "score": -5,
              "created_utc": 1734286203.0,
              "replies": [
                {
                  "id": "m29notj",
                  "author": "Xetanees",
                  "body": "Most laptops have 14”/13.5” displays",
                  "score": 1,
                  "created_utc": 1734315524.0,
                  "replies": []
                },
                {
                  "id": "m27bzw8",
                  "author": "RegularVega",
                  "body": "Define your “massive”.",
                  "score": -1,
                  "created_utc": 1734287372.0,
                  "replies": [
                    {
                      "id": "m288xq9",
                      "author": "StuffinYrMuffinR",
                      "body": "I literally did",
                      "score": 2,
                      "created_utc": 1734297798.0,
                      "replies": [
                        {
                          "id": "m29b9wt",
                          "author": "RegularVega",
                          "body": "🙃",
                          "score": 1,
                          "created_utc": 1734310858.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m276o1k",
      "author": "XBA40",
      "body": "It sounds totally lame. Like another cheap trick to get you on the crappy PlayStation platform. I say this as someone who was a PlayStation fanboy back in the day.",
      "score": -14,
      "created_utc": 1734285704.0,
      "replies": [
        {
          "id": "m277k0x",
          "author": "None",
          "body": "It's a one off custom job you dingus, it's a stunt, not a new product from Sony to somehow \"trick\" you into play playstation games like you BAFFELINGLY seem to think it is. LOL",
          "score": 14,
          "created_utc": 1734285993.0,
          "replies": [
            {
              "id": "m278jsy",
              "author": "XBA40",
              "body": "Oh damn, I didn’t give it its due attention. I don’t give a shit. Why did you respond to me so idiotically?",
              "score": -15,
              "created_utc": 1734286307.0,
              "replies": [
                {
                  "id": "m27m5j8",
                  "author": "Kresche",
                  "body": "I think he was just trying to speak in your language?",
                  "score": 3,
                  "created_utc": 1734290538.0,
                  "replies": [
                    {
                      "id": "m27o8de",
                      "author": "XBA40",
                      "body": "Holy shit, please watch the psychology of getting tempted into writing a dumb comment because you see votes. You have to be mindful of how you use this crappy website.",
                      "score": -2,
                      "created_utc": 1734291186.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m27vevv",
      "author": "None",
      "body": "Consoles, where gaming goes to die.",
      "score": -5,
      "created_utc": 1734293468.0,
      "replies": [
        {
          "id": "m2a9s7u",
          "author": "ZaDu25",
          "body": "I hope you realize that if consoles didn't exist, most gamers would be buying the cheapest pre-built PCs available that have like half the power of a current gen console and developers would start making games for even worse specs than what consoles offer. Consoles offering decent hardware at cheaper prices are actually making games better for PC.",
          "score": 1,
          "created_utc": 1734324693.0,
          "replies": [
            {
              "id": "m2agi1h",
              "author": "None",
              "body": "I hope you realize that by making my initial comment, I don’t care about consoles, or even gaming for that matter.",
              "score": 1,
              "created_utc": 1734328070.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}