{
  "post": {
    "title": "13-inch Microsoft Surface Laptop review: A slightly worse version of a year-old PC",
    "author": "a_Ninja_b0y",
    "id": "1ll8pli",
    "score": 405,
    "created_utc": 1750964851.0,
    "selftext": "",
    "num_comments": 23,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ll8pli/13inch_microsoft_surface_laptop_review_a_slightly/"
  },
  "comments": [
    {
      "id": "mzxpy9h",
      "author": "Deflated_Hive",
      "body": "I was gifted an ARM PC a few years ago and I have no qualms. I have resorted to it as web browsers because that's all I use it for and the Microsoft Office suite. They're very good at that. Especially with the battery life.\n\nWith Xbox Game Pass I can stream games so I always have that need satisfied (I don't because getting older with responsibilities sucks)\n\nI couldn't say the same if I paid the full original price. But once this stuff gets more affordable I'd encourage anyone to give ARM PCs a shot.",
      "score": 63,
      "created_utc": 1750965467.0,
      "replies": [
        {
          "id": "mzxtqer",
          "author": "Icy-Comfortable-714",
          "body": "I know we are talking about PCs here, but I just switched from an Intel Mac to an arm Mac and it’s night and day. If work didn’t sponsor it I’d run an arm laptop and the latest version of Ubuntu",
          "score": 24,
          "created_utc": 1750966588.0,
          "replies": [
            {
              "id": "mzxzznh",
              "author": "User9705",
              "body": "Dude, ARM was so night and day that on 2020, I traded my i9 Mac for an M1 air and no longer struggled with beat and battery life. My M3 Pro is all I use.",
              "score": 10,
              "created_utc": 1750968492.0,
              "replies": [
                {
                  "id": "n00pfl1",
                  "author": "Icy-Comfortable-714",
                  "body": "Intel are toast. AMD are slowly eating their lunch in the server space and ARM are taking over consumer devices.",
                  "score": 7,
                  "created_utc": 1751004173.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n02xlhu",
              "author": "eat_a_burrito",
              "body": "I’m on a 2018 MBP.  Thinking of moving to arm Mac.  You guys make me want to go out today.",
              "score": 1,
              "created_utc": 1751038384.0,
              "replies": [
                {
                  "id": "n03zsx1",
                  "author": "Iron_Burnside",
                  "body": "Get a base model Air and be blown away.  I'm running am M1, and it's the first computer I've ever owned where I didn't want to upgrade after a couple of years.",
                  "score": 3,
                  "created_utc": 1751049106.0,
                  "replies": [
                    {
                      "id": "n045dt4",
                      "author": "eat_a_burrito",
                      "body": "My intel has 32 GB of ram and it’s always hot on the bottom with just Firefox open.  I w looked at FF’s built in process management and it’s not using much.  \n\nI think when Apple ends OS upgrades on the intel based systems I’ll move.",
                      "score": 2,
                      "created_utc": 1751050727.0,
                      "replies": [
                        {
                          "id": "n06837h",
                          "author": "Iron_Burnside",
                          "body": "I have 16 gigs on the M1 Air.  The M4 can be optioned up to 32.   Currently at 26 degree CPU temps, and palm rests cool to the touch. The Intel chips use so much power at single digit loads. \n\nThat's a fair plan.",
                          "score": 1,
                          "created_utc": 1751075618.0,
                          "replies": [
                            {
                              "id": "n06bb6i",
                              "author": "eat_a_burrito",
                              "body": "All my cores are 51+ C.  Intel sucks.",
                              "score": -1,
                              "created_utc": 1751076850.0,
                              "replies": [
                                {
                                  "id": "n06e9x2",
                                  "author": "Iron_Burnside",
                                  "body": "Oof. I'm at \\~60C when playing Minecraft.",
                                  "score": 1,
                                  "created_utc": 1751078006.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "n0e1s0z",
                          "author": "the_fr33z33",
                          "body": "macOS 26 (this year) is ending intel support for any model but the Mac Pro.",
                          "score": 1,
                          "created_utc": 1751195364.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n04ji9z",
                  "author": "Even_Reception8876",
                  "body": "Ya I got the M2 pro max and it is an absolute hog. Highly recommend it",
                  "score": 2,
                  "created_utc": 1751054963.0,
                  "replies": [
                    {
                      "id": "n04s3jk",
                      "author": "eat_a_burrito",
                      "body": "I think I need to upgrade.",
                      "score": 1,
                      "created_utc": 1751057557.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n05s7pv",
                  "author": "bbqsox",
                  "body": "Make sure you get at least 512 GB of storage. They finally increased the ram, but these new M chips are so powerful that you won’t need to upgrade for years. My M1 Air with 256 GB is constantly full just a few years later.",
                  "score": 2,
                  "created_utc": 1751069685.0,
                  "replies": [
                    {
                      "id": "n066y27",
                      "author": "eat_a_burrito",
                      "body": "I keep hearing apple silicon is amazing. And so battery efficient.  You guys are going to kill my wallet.",
                      "score": 1,
                      "created_utc": 1751075184.0,
                      "replies": [
                        {
                          "id": "n06d1pv",
                          "author": "bbqsox",
                          "body": "It’s ARM in general. The windows machines running snapdragon processors have incredible battery life as well from my understanding. The issue you run into there is compatibility with all the legacy programs.",
                          "score": 2,
                          "created_utc": 1751077524.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n034f0z",
                  "author": "Kdetr4128",
                  "body": "It’s like an alien",
                  "score": 1,
                  "created_utc": 1751040287.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mzy1667",
          "author": "Atilim87",
          "body": "Sounds like a Mac tbh",
          "score": 1,
          "created_utc": 1750968851.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n01fgmm",
      "author": "aftenbladet",
      "body": "Too bad, I love my old surface tablet but its definetly a bit on the slow side",
      "score": 5,
      "created_utc": 1751019038.0,
      "replies": []
    },
    {
      "id": "n03x1dp",
      "author": "upsoutfit",
      "body": "I bought a Surface Laptop Go a couple of years ago. I was in Micro Center, and they had an open box one for under $400. It's light, fast, has a bright screen, and it has a touch screen. It's a very nice bargain laptop. The only downside is poor battery life.\n\nApple now prices that machine the same as a MacBook Air. That's insane, because it's overall quality is nowhere near a MacBook Air.",
      "score": 10,
      "created_utc": 1751048315.0,
      "replies": [
        {
          "id": "n07jy4x",
          "author": "CptUnderpants-",
          "body": ">The only downside is poor battery life.\n\nI manage a fleet of them for a school, battery life is fine for us. The real downside of them is the touchscreen is just that. Can't use Surface pens on them. It isn't a digitiser.",
          "score": 5,
          "created_utc": 1751098754.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0k6bah",
      "author": "5etho101",
      "body": "Arm is bullshit, heavy fake marketing on reddit I can see, it's all lies unfortunately, also usefull apple iDiots -n00bs\n\nOlder apps don't work on them, don't ever think about it of you are not corporate",
      "score": -2,
      "created_utc": 1751283089.0,
      "replies": []
    }
  ]
}