{
  "post": {
    "title": "Apple Smart Glasses Launching in 2026",
    "author": "BlueLightStruct",
    "id": "1kt799s",
    "score": 591,
    "created_utc": 1747962849.0,
    "selftext": "",
    "num_comments": 268,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kt799s/apple_smart_glasses_launching_in_2026/"
  },
  "comments": [
    {
      "id": "mtrcadm",
      "author": "SQL617",
      "body": "No details of any value nor speculative pricing, saved you a click.",
      "score": 722,
      "created_utc": 1747963263.0,
      "replies": [
        {
          "id": "mtrdb9h",
          "author": "spaceocean99",
          "body": "Start around $2k is my guess.",
          "score": 146,
          "created_utc": 1747963637.0,
          "replies": [
            {
              "id": "mtrf8o7",
              "author": "SQL617",
              "body": "It’ll be interesting considering the monumental failure of public opinion that the Apple Vision Pro was.",
              "score": 116,
              "created_utc": 1747964334.0,
              "replies": [
                {
                  "id": "mtt07lf",
                  "author": "AuroraFinem",
                  "body": "It’s a completely different market demographic. They tried to do VR when it’s a niche use case without supporting anything the people currently using VR platforms actually use VR for and without adopting the already existing VR standard for interoperability. I knew that would be DOA from the moment it was announced without any support for steam VR or any existing VR infrastructure.\n\nIf they can make good form factor AR glasses? They’d be one of the first to market and knowing Apple, they wouldn’t take this to market unless they actually had a platform designed whereas the handful of AR glasses on the market are extremely limited and have almost no functionality beyond like 1-2 features. If they could partner with prescription glass makers and qualify for a discount with insurance they’d have a very large market who’d probably spend the extra money for apple glasses.",
                  "score": 61,
                  "created_utc": 1747991947.0,
                  "replies": [
                    {
                      "id": "mtuf77b",
                      "author": "wimbs27",
                      "body": "Even better if they create a software and architecture for Apple smart glasses and give it to eyewear manufacturers.",
                      "score": 12,
                      "created_utc": 1748011911.0,
                      "replies": [
                        {
                          "id": "mtukotw",
                          "author": "alyimfyjvz",
                          "body": "Yeah they won’t do that, Apple will, at best, partner with specific manufacturer. There is a zero percent chance they’ll outsource only the software, especially considering how Apple is considering making all the chips in house",
                          "score": 29,
                          "created_utc": 1748013468.0,
                          "replies": [
                            {
                              "id": "mtvr8e4",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 8,
                              "created_utc": 1748025576.0,
                              "replies": [
                                {
                                  "id": "mtxkdcd",
                                  "author": "LunDeus",
                                  "body": "You’d think they would make their own frames and cut Lux profits out.",
                                  "score": 5,
                                  "created_utc": 1748047078.0,
                                  "replies": []
                                },
                                {
                                  "id": "mu5j5yu",
                                  "author": "annoyed__renter",
                                  "body": "You think they can make all the components of their various devices but struggle with plastic lenses and resin frames? They will easily create their own supply chain for this. Zero reason to sell through Lux.",
                                  "score": 1,
                                  "created_utc": 1748171266.0,
                                  "replies": []
                                },
                                {
                                  "id": "mu1uc91",
                                  "author": "bigwebs",
                                  "body": "100% luxotica.",
                                  "score": 1,
                                  "created_utc": 1748112286.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mtx0ctr",
                      "author": "_LarryM_",
                      "body": "Yea no one wants to see your eyes while you are watching VR porn",
                      "score": 4,
                      "created_utc": 1748039825.0,
                      "replies": [
                        {
                          "id": "mtxni24",
                          "author": "kyredemain",
                          "body": "Yeah, that was one feature that sounded good on paper, but really didn't work in practice. Turns out the fake eyes are considerably creepier than just looking like a Maelstrom gangoon.",
                          "score": 5,
                          "created_utc": 1748048271.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mtx2wx3",
                      "author": "Aware_Tree1",
                      "body": "If they can let me read in public without anyone seeing it and without having a phone in my hand, I’ll be a day one purchaser",
                      "score": 1,
                      "created_utc": 1748040714.0,
                      "replies": [
                        {
                          "id": "mtxkj24",
                          "author": "LunDeus",
                          "body": "I’m hesitant to think “novel reading” will be comfortable with these. Texts, article summaries, email summaries yeah sure. Full blown novels? Eh…",
                          "score": 1,
                          "created_utc": 1748047140.0,
                          "replies": [
                            {
                              "id": "mtxnbep",
                              "author": "Aware_Tree1",
                              "body": "Brother I’m reading 300,000 word fanfics on my phone and that’s certainly uncomfortable on my neck already with how I have to look down at my phone already when I’m in public",
                              "score": 1,
                              "created_utc": 1748048201.0,
                              "replies": [
                                {
                                  "id": "mtyxs53",
                                  "author": "LunDeus",
                                  "body": "I think I’d rather take neck strain over eye strain but I guess that’s a personal choice.",
                                  "score": 1,
                                  "created_utc": 1748069229.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mtxm9do",
                      "author": "doctormink",
                      "body": "My meta glasses were totally free with my insurance, which was nice.",
                      "score": 1,
                      "created_utc": 1748047801.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mtrsfxs",
                  "author": "versusgorilla",
                  "body": "I like searching for Vision Pros on Facebook Marketplace just to see how many people are trying to unload their pair for like 90% of the initial purpose price.",
                  "score": 10,
                  "created_utc": 1747969181.0,
                  "replies": [
                    {
                      "id": "mtujsmk",
                      "author": "Bristmo",
                      "body": "The used market went full regarded during the pandemic, and people never learned how to sell properly again.",
                      "score": 6,
                      "created_utc": 1748013216.0,
                      "replies": []
                    },
                    {
                      "id": "mts115j",
                      "author": "permanentmarker1",
                      "body": "Yeah nobody is doing that.",
                      "score": 1,
                      "created_utc": 1747972761.0,
                      "replies": []
                    },
                    {
                      "id": "mtsj2eg",
                      "author": "AtariAtari",
                      "body": "Updated: 10% off is typical for used electronics",
                      "score": -36,
                      "created_utc": 1747981768.0,
                      "replies": [
                        {
                          "id": "mtsm7rg",
                          "author": "SolidOshawott",
                          "body": "90% of 3500 is 3150",
                          "score": 30,
                          "created_utc": 1747983516.0,
                          "replies": [
                            {
                              "id": "mttpoy7",
                              "author": "versusgorilla",
                              "body": "Lol yeah, this. No one is selling them for like any good discounts because they were so expensive. They're useless but they're so expensive that even buying one that's all sweaty and disgusting isn't viable.",
                              "score": 6,
                              "created_utc": 1748003881.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mttbj16",
                          "author": "happy-gofuckyourself",
                          "body": "90% of the full price, not 90% off",
                          "score": 9,
                          "created_utc": 1747998094.0,
                          "replies": [
                            {
                              "id": "mttk0vu",
                              "author": "Shrouds_",
                              "body": "Reading comprehension is so bad here",
                              "score": 6,
                              "created_utc": 1748001756.0,
                              "replies": [
                                {
                                  "id": "mtujzcp",
                                  "author": "Bristmo",
                                  "body": "Not just here, but most young people under 35 are like this",
                                  "score": 4,
                                  "created_utc": 1748013268.0,
                                  "replies": []
                                },
                                {
                                  "id": "mtw2r9h",
                                  "author": "Cowicidal",
                                  "body": "To be fair, sales are never listed that way in stores so I can understand where people got confused at least at first glance.  It's always 10% off, not the other way around saying the price is 90% of the original price.\n\nEdit: lol at the downvote.  Sorry to offend you by reality.",
                                  "score": 2,
                                  "created_utc": 1748029081.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mtuxxje",
                  "author": "whopperlover17",
                  "body": "I absolutely love my Vision Pro, use it multiple times a week.",
                  "score": 5,
                  "created_utc": 1748017199.0,
                  "replies": [
                    {
                      "id": "mtwpj6k",
                      "author": "Singing_Shibboleth",
                      "body": "Me too.  I have to travel a ton - I use it so I have a decent sized monitor for my laptop at the hotel, and so I have a good place to watch movies/TV that's a f of a lot better than the 5 year old LG on the wall.\n\nNow, if I wasn't traveling for work so much?  yeah might be a different story.  But for my use case, it's great.\n\n(btw, try doing a YouTube video of POV driving classic cars.... almost like being in one when the sound's good)",
                      "score": 5,
                      "created_utc": 1748036121.0,
                      "replies": [
                        {
                          "id": "mtwpy3c",
                          "author": "whopperlover17",
                          "body": "Have you tried that Apple immersive girl racing to the top of the mountain one? Dude those interior shots were crazy.\n\nAlso I thought I would be traveling a lot more but things have changed. However using it at night to unwind and just watch a show or YouTube or something for a bit just makes it all worth it for me.",
                          "score": 1,
                          "created_utc": 1748036260.0,
                          "replies": [
                            {
                              "id": "mtwux2c",
                              "author": "Singing_Shibboleth",
                              "body": "yeah absolutely.  Also try that immersive WWII short film about being in a submarine... Uncanny how realistic it was.",
                              "score": 1,
                              "created_utc": 1748037931.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mtuyyt9",
                      "author": "SQL617",
                      "body": "That’s awesome, I’m glad you don’t regret the purchase. I don’t however think that reflects public opinion as a whole, quite the opposite.",
                      "score": 3,
                      "created_utc": 1748017493.0,
                      "replies": [
                        {
                          "id": "mtuz8mc",
                          "author": "whopperlover17",
                          "body": "Idk that’s now what I see or hear. You’ll get clickbaity articles about its “colossal failure” or whatever. The main issue is the price tag. The people on r/AppleVisionPro talk about their experiences with it and discuss this topic lots if you wanted to see what users say.",
                          "score": 0,
                          "created_utc": 1748017571.0,
                          "replies": [
                            {
                              "id": "mtv5pvn",
                              "author": "SQL617",
                              "body": "We can agree to disagree, I don’t think there’s a right or wrong answer here. I’ve personally read far more “I’ve used it a handful of times, it made me sick, now it’s collecting dust” than people that regard it as a well-worth purchase. \n\nAs a dev and overall tech-y person it’s right up my alley if I was in the IOS echo system at all. I’ve certainly spent that kind of money on toys that many would regard as frivolous.",
                              "score": 4,
                              "created_utc": 1748019421.0,
                              "replies": [
                                {
                                  "id": "mtw0on4",
                                  "author": "banalhemorrhage",
                                  "body": "I tested it and it remains my favorite version of the tech so far. Just great implementation all around. Couldn't sell myself on the price tag though.",
                                  "score": 2,
                                  "created_utc": 1748028447.0,
                                  "replies": [
                                    {
                                      "id": "mtw97xu",
                                      "author": "whopperlover17",
                                      "body": "I got mine used from eBay. If you really do like it I’d recommend going that route because I couldn’t sell myself on the full price either. It’s fantastic though mate, I only use it for an hour or couple at night when I lay in bed. It’s so awesome.",
                                      "score": 1,
                                      "created_utc": 1748031044.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "mtv5vqw",
                                  "author": "whopperlover17",
                                  "body": "Yeah no I’m not trying to convince you otherwise. Have you ever tried it? If you haven’t, I highly recommend!",
                                  "score": 1,
                                  "created_utc": 1748019467.0,
                                  "replies": [
                                    {
                                      "id": "mtxr5w1",
                                      "author": "SQL617",
                                      "body": "I haven’t actually which is pretty funny because I apparently have a strong opinion 🤣 I’ll look into booking one of those walk-in tests if they’re still doing them.",
                                      "score": 1,
                                      "created_utc": 1748049681.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mtvpanj",
                              "author": "haarschmuck",
                              "body": "The AVP will always be a failure because Apple gimped it so hard with their walled garden that you can't even play games or watch youtube on it.",
                              "score": 0,
                              "created_utc": 1748024990.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mtwjqaz",
                  "author": "AddisonFlowstate",
                  "body": "Which really is a shame. The Vision Pro is an outstanding, steller piece of tech. Obviously way too expensive and dead in the water from day one because of it.",
                  "score": 2,
                  "created_utc": 1748034253.0,
                  "replies": []
                },
                {
                  "id": "mtwr0xo",
                  "author": "PushTheTrigger",
                  "body": "They’re going to attempt to make their own version of Meta glasses.",
                  "score": 1,
                  "created_utc": 1748036619.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mtry2rw",
              "author": "aluminumnek",
              "body": "$2001, Bob",
              "score": 5,
              "created_utc": 1747971481.0,
              "replies": []
            },
            {
              "id": "mttkr1z",
              "author": "D-Rich-88",
              "body": "Per eye?",
              "score": 4,
              "created_utc": 1748002044.0,
              "replies": [
                {
                  "id": "mttsemv",
                  "author": "spaceocean99",
                  "body": "Of course. And they’ll only last 2 hours without a charger. Charger cord costs $200. Doesn’t include the plug to the wall. That’s another $50.",
                  "score": 0,
                  "created_utc": 1748004818.0,
                  "replies": [
                    {
                      "id": "mtu164o",
                      "author": "D-Rich-88",
                      "body": "But it will come with a free year of Apple TV",
                      "score": 4,
                      "created_utc": 1748007726.0,
                      "replies": [
                        {
                          "id": "mtufipz",
                          "author": "spaceocean99",
                          "body": "*3 months",
                          "score": 4,
                          "created_utc": 1748012002.0,
                          "replies": [
                            {
                              "id": "mtxadmf",
                              "author": "noydbshield",
                              "body": "Not including Severance.  That's extra.",
                              "score": 1,
                              "created_utc": 1748043345.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mtvvdsz",
              "author": "FBI-INTERROGATION",
              "body": "Its not AR. Wont pass $1000.",
              "score": 3,
              "created_utc": 1748026832.0,
              "replies": []
            },
            {
              "id": "mtx67u1",
              "author": "Swamy_ji",
              "body": "Is this with or without the 25% tariff?",
              "score": 2,
              "created_utc": 1748041864.0,
              "replies": [
                {
                  "id": "mtxlxqr",
                  "author": "spaceocean99",
                  "body": "Without. Probably closer to $2500",
                  "score": 2,
                  "created_utc": 1748047676.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mu1blb3",
              "author": "aidanpryde98",
              "body": "You left out the part where they don’t support it at all. Just take the money and run.",
              "score": 2,
              "created_utc": 1748106295.0,
              "replies": []
            },
            {
              "id": "mtwhshh",
              "author": "Troll_Enthusiast",
              "body": "Probably not",
              "score": 1,
              "created_utc": 1748033650.0,
              "replies": []
            },
            {
              "id": "mtzwf3i",
              "author": "Pool_Shark",
              "body": "No way. Meta Ray bans are around $300 and they will want to compete with that",
              "score": 1,
              "created_utc": 1748088929.0,
              "replies": [
                {
                  "id": "mtzxi3b",
                  "author": "spaceocean99",
                  "body": "lol, no chance they are anywhere close to that price. They’ll throw a couple features out there that ray bans don’t have and make it seem like it’s revolutionary. People will gobble it up and fork out the $2k",
                  "score": 1,
                  "created_utc": 1748089398.0,
                  "replies": [
                    {
                      "id": "mu0hbfz",
                      "author": "Pool_Shark",
                      "body": "There is no market for $2K glasses. Look what happens to Vision Pro. \n\nThis product is meant to be more consumer friendly and won’t be anywhere close to $2K",
                      "score": 1,
                      "created_utc": 1748096683.0,
                      "replies": [
                        {
                          "id": "mu0o7na",
                          "author": "spaceocean99",
                          "body": "No shit. That won’t stop them from trying. Just like they did with the VR headset. The hardcore Apple fans will make the plunge, no matter what.",
                          "score": 1,
                          "created_utc": 1748098872.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mu3uojz",
              "author": "Kindly_Education_517",
              "body": "sooo Tim Cook aint learn shit from Vision Pro sales? forgot this America",
              "score": 1,
              "created_utc": 1748138726.0,
              "replies": []
            },
            {
              "id": "mtsi18k",
              "author": "ryapeter",
              "body": "If the lens can shapeshift and zoom I’m ok with it\n\nAnd change colour.",
              "score": 1,
              "created_utc": 1747981198.0,
              "replies": [
                {
                  "id": "mttfb37",
                  "author": "radgepack",
                  "body": "Zoom would be actually amazing",
                  "score": 2,
                  "created_utc": 1747999803.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mtrjw4o",
              "author": "FacepalmFullONapalm",
              "body": "Definitely more than 3.50",
              "score": -2,
              "created_utc": 1747965995.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mtriqdf",
          "author": "TheMacMan",
          "body": "They just made this one up. AVP was rumored for 5+ years before its release. These glasses suddenly rumored less than a year before release.",
          "score": 12,
          "created_utc": 1747965572.0,
          "replies": []
        },
        {
          "id": "mtw0trn",
          "author": "CrazyLlama71",
          "body": "Because it isn’t happening",
          "score": 3,
          "created_utc": 1748028491.0,
          "replies": []
        },
        {
          "id": "mtvn8z5",
          "author": "No-Translator-6577",
          "body": "No augmented reality… saved you another click.",
          "score": 1,
          "created_utc": 1748024381.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtrhm2k",
      "author": "__-_-_--_--_-_---___",
      "body": ">no augmented reality \n\nThen what’s the point?",
      "score": 188,
      "created_utc": 1747965173.0,
      "replies": [
        {
          "id": "mtu561d",
          "author": "Millennial-Mason",
          "body": "My fiancé is deaf. If they include real time subtitles for when someone is speaking, I’d buy them for her",
          "score": 77,
          "created_utc": 1748008974.0,
          "replies": [
            {
              "id": "mtuv6gq",
              "author": "__-_-_--_--_-_---___",
              "body": "That would be extremely useful. Translation would be great too",
              "score": 43,
              "created_utc": 1748016407.0,
              "replies": [
                {
                  "id": "mtux7le",
                  "author": "Manaray13",
                  "body": "Translation would be a game changer for traveling",
                  "score": 27,
                  "created_utc": 1748016990.0,
                  "replies": [
                    {
                      "id": "mtybu8r",
                      "author": "GentrifiedSocks",
                      "body": "Meta Raybans can do this today for $299.",
                      "score": 6,
                      "created_utc": 1748057888.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mtvbahu",
                  "author": "TheBoggart",
                  "body": "URGYNOS?",
                  "score": 2,
                  "created_utc": 1748020988.0,
                  "replies": [
                    {
                      "id": "mtw0uo5",
                      "author": "Smartnership",
                      "body": "I’m whatnow?",
                      "score": 3,
                      "created_utc": 1748028499.0,
                      "replies": [
                        {
                          "id": "mtxua4i",
                          "author": "TheBoggart",
                          "body": "Haha, OP’s username looked like Morse Code.  If it is, that’s what it translates to.",
                          "score": 4,
                          "created_utc": 1748050891.0,
                          "replies": [
                            {
                              "id": "mtyqef1",
                              "author": "Smartnership",
                              "body": "UR DASHING",
                              "score": 2,
                              "created_utc": 1748064988.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mtwkbdd",
              "author": "sawbladex",
              "body": "... isn't that augmented reality?\n\n... it's debatable at the least.\n\nedit: the article at most says that it provides translations, but that just might be it can see what you see, and translate written language into a different spoken language.,",
              "score": 14,
              "created_utc": 1748034438.0,
              "replies": [
                {
                  "id": "mtxdp41",
                  "author": "_RADIANTSUN_",
                  "body": "This whole thread is overestimating with wishful thinking IMO, it will be like the Meta Raybans and either have no display or there will be a token crap little window display like Google Glass was supposed to be.",
                  "score": -4,
                  "created_utc": 1748044556.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mtybqng",
              "author": "GentrifiedSocks",
              "body": "Meta Raybans can do it for $299 today. I imagine apples will be anywhere from $799-$1999",
              "score": 4,
              "created_utc": 1748057844.0,
              "replies": [
                {
                  "id": "mtzsn5k",
                  "author": "Millennial-Mason",
                  "body": "Source? I’ve seen multiple posts, even some from yesterday, stating Meta raybans cannot do this",
                  "score": 2,
                  "created_utc": 1748087222.0,
                  "replies": [
                    {
                      "id": "mtzumlc",
                      "author": "GentrifiedSocks",
                      "body": "Here’s some articles. It can also real time translate foreign languages. Again, today, for $299\n\nhttps://www.uploadvr.com/ray-ban-meta-glasses-live-translation-meta-ai-europe/\n\nhttps://www.meta.com/help/ai-glasses/955732293123641/?srsltid=AfmBOopiX1DLaaA4UVJuPtRwQAFop0cnaARJ5TnX8Z_MQjMr79dUTAMN",
                      "score": 2,
                      "created_utc": 1748088138.0,
                      "replies": [
                        {
                          "id": "mtzx4bh",
                          "author": "Millennial-Mason",
                          "body": "I think you misunderstood what I said. I’m looking for glasses that provide subtitles, those links you posted show that all they do is play a translation in the wearers ear. My deaf fiancé cannot hear that.\n\nWhile the app that shows what they said is nice on the phone is nice, she already has that for free",
                          "score": 1,
                          "created_utc": 1748089234.0,
                          "replies": [
                            {
                              "id": "mtzxckd",
                              "author": "GentrifiedSocks",
                              "body": "The words also appear written in the Meta AI app.\n\n\nLater this year they are dropping a pair with a HUD, curious if it’ll even be “on screen” then. For reference, the apple glasses with not have a HUD and any translations/transcribing will be via audio or written in an app, as well.",
                              "score": 2,
                              "created_utc": 1748089332.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mu4qrzn",
                  "author": "SandwichBitter1337",
                  "body": "I would rather pay double than give suckerberg my personal data",
                  "score": 1,
                  "created_utc": 1748154274.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mtwtrn4",
              "author": "BIZLfoRIZL",
              "body": "Sounds like there’s no screen in these. Only audio?",
              "score": 2,
              "created_utc": 1748037537.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mtrkqbi",
          "author": "ShutterBun",
          "body": "I want facial recognition to tell me when I run into an acquaintance and can’t remember their name.  I’d happily pay for that feature alone.",
          "score": 46,
          "created_utc": 1747966306.0,
          "replies": [
            {
              "id": "mtrxw6f",
              "author": "MyVoiceIsElevating",
              "body": "That is a shit ton of facial data to collect. No thank you!",
              "score": 79,
              "created_utc": 1747971403.0,
              "replies": [
                {
                  "id": "mts3bpy",
                  "author": "ShutterBun",
                  "body": "We crossed the Rubicon for that a LONG time ago.",
                  "score": 29,
                  "created_utc": 1747973792.0,
                  "replies": [
                    {
                      "id": "mtsej5x",
                      "author": "NervousSubjectsWife",
                      "body": "That jeep has sailed",
                      "score": 24,
                      "created_utc": 1747979314.0,
                      "replies": [
                        {
                          "id": "mtsuvxd",
                          "author": "ED4050",
                          "body": "I’m not the smartest piano in the ocean, but that made me laugh!",
                          "score": 9,
                          "created_utc": 1747988678.0,
                          "replies": [
                            {
                              "id": "mtt62pq",
                              "author": "ShutterBun",
                              "body": "Ocean pianos must remember: you can tune a piano, but you can't tuna fish!",
                              "score": 8,
                              "created_utc": 1747995318.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mtxh1pz",
                          "author": "thelangosta",
                          "body": "If it’s a Jeep thing then I’ll never understand",
                          "score": 1,
                          "created_utc": 1748045815.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mtw3fec",
                      "author": "sm753",
                      "body": "These are the same people who carry a smartphone around with them 24/7 but don't want Amazon/Google \"spying\" on them via smart home devices because \"they have microphones in them\".",
                      "score": 1,
                      "created_utc": 1748029285.0,
                      "replies": [
                        {
                          "id": "mtw3qhk",
                          "author": "ShutterBun",
                          "body": "Or use Face ID to unlock a phone, but don’t trust facial recognition.\n\nOr rely on traffic info from their navigation apps but don’t want their location tracked.",
                          "score": 4,
                          "created_utc": 1748029380.0,
                          "replies": []
                        },
                        {
                          "id": "mty58iu",
                          "author": "QuieroLaSeptima",
                          "body": "There is a pretty big difference between an iPhone with decent security features and an Amazon smart home device to be fair.",
                          "score": 0,
                          "created_utc": 1748055069.0,
                          "replies": [
                            {
                              "id": "mty5s2n",
                              "author": "sm753",
                              "body": "Is there? Please explain the difference in security features terms of the hardware, firmware, and software.\n\nYou think a corporation the size of Amazon (a company that owns/runs AWS - including GovCloud btw) takes security any less seriously than Apple? You clearly don't work in tech and you clearly have no clue what you're talking about.",
                              "score": -1,
                              "created_utc": 1748055287.0,
                              "replies": [
                                {
                                  "id": "mty6hyi",
                                  "author": "QuieroLaSeptima",
                                  "body": "On-device processing - one of the best privacy features in the market???\n\nEdit: I realize I said security features in my first comment, but meant privacy features. Even then, Apple’s OS is WAY less vulnerable than Amazon’s fire OS.\n\nApple devices are definitely more secure than Amazon devices, without a doubt.",
                                  "score": 2,
                                  "created_utc": 1748055581.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mtwkyed",
                  "author": "xenonnsmb",
                  "body": "Apple already builds a database of your contacts' faces on-device if you use their Photos app. Kinda scary but I trust them more with that data than Google or Microsoft...",
                  "score": 2,
                  "created_utc": 1748034641.0,
                  "replies": [
                    {
                      "id": "mtwv4ia",
                      "author": "MyVoiceIsElevating",
                      "body": "Yes understood; I’m referring to walking around in the wild allowing capture of unconsenting people.\n\nI’m old enough to remember when we called them Glassholes for walking around with cameras on their face.",
                      "score": 4,
                      "created_utc": 1748038002.0,
                      "replies": [
                        {
                          "id": "mu0lnrk",
                          "author": "xenonnsmb",
                          "body": "Ah I see. Yeahh I don't think the state of law in the US concerning recording in public is ready for the next wave of tech companies trying to make AR glasses a thing again...",
                          "score": 1,
                          "created_utc": 1748098066.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mtxzgaq",
                  "author": "komark-",
                  "body": "What if the tech wasn’t facial recognition but rather device recognition? I can see an integration with like the find my network to basically accomplish the same thing",
                  "score": 1,
                  "created_utc": 1748052839.0,
                  "replies": []
                },
                {
                  "id": "mtss8j4",
                  "author": "IT_techsupport",
                  "body": "You being on reddit already gives corporation way more information than just your face.",
                  "score": 0,
                  "created_utc": 1747987060.0,
                  "replies": [
                    {
                      "id": "mtth2vo",
                      "author": "MyVoiceIsElevating",
                      "body": "Purchase interests is not equal to biometrics.",
                      "score": 6,
                      "created_utc": 1748000566.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mttlrno",
              "author": "SkyRepresentative309",
              "body": "oh hi mark! \n\nhow is your doggy",
              "score": 3,
              "created_utc": 1748002435.0,
              "replies": [
                {
                  "id": "mtto4wd",
                  "author": "ShutterBun",
                  "body": "Hehe, what a story!",
                  "score": 1,
                  "created_utc": 1748003322.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mtrq8gh",
              "author": "stacecom",
              "body": "Dear lord, I so relate to this. I have so many people where I see their face, and I know I know them.  In fact, I know I **like** them.  And yet I cannot call their name to my brain.",
              "score": 2,
              "created_utc": 1747968336.0,
              "replies": [
                {
                  "id": "mts3llb",
                  "author": "ShutterBun",
                  "body": "Would be great to see a little heads-up display like:  \nNAME: David  \nMet at: Boardner's  \nMost recent interaction: Sent pictures of his new car.\n\nSomething like that.",
                  "score": 9,
                  "created_utc": 1747973918.0,
                  "replies": [
                    {
                      "id": "mtt9i2h",
                      "author": "__-_-_--_--_-_---___",
                      "body": "I want mine to look exactly like the Terminator’s",
                      "score": 7,
                      "created_utc": 1747997123.0,
                      "replies": [
                        {
                          "id": "mtuics1",
                          "author": "FuckThatIKeepsItReal",
                          "body": "Me too \n\nI wanna know if people are distressed or threatening, and if they need to be terminated",
                          "score": 6,
                          "created_utc": 1748012807.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mtwp671",
                  "author": "3-DMan",
                  "body": "Dammit, it's gonna be like GPS where we depend on it so much we're worthless without it!\n\n\"I'm sorry, I can't talk to you until I've found my glasses.\"",
                  "score": 2,
                  "created_utc": 1748036003.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mtuxa4u",
              "author": "Forsaken-Pigeon",
              "body": "Or point them out in a crowd so I can avoid them",
              "score": 1,
              "created_utc": 1748017011.0,
              "replies": []
            },
            {
              "id": "mtwtwfe",
              "author": "BIZLfoRIZL",
              "body": "I want this too, but I feel like it’s a privacy nightmare. It will happen eventually though.",
              "score": 1,
              "created_utc": 1748037582.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mtzwl8g",
          "author": "Pool_Shark",
          "body": "You can talk to Siri, call people, listen to music, snap photos and videos",
          "score": 2,
          "created_utc": 1748089004.0,
          "replies": []
        },
        {
          "id": "mtriet0",
          "author": "PutBeansOnThemBeans",
          "body": "Ask ai about anything I’m looking at, for starters?\n\nDIY projects while ai walks me through, with full visual context for what I’m doing with my hands?\n\nAt least Apple cares more about privacy than Meta who offers the only competition.\n\nBut if you can’t imagine use cases that’s on your imagination.\n\nI’d love not to fumble with my phone to take a picture or video of what I’m seeing, I’d likely document more",
          "score": -17,
          "created_utc": 1747965458.0,
          "replies": [
            {
              "id": "mtrw8oa",
              "author": "Cthulhar",
              "body": "Apple spent like a year talking about the new Apple phone coming with apples new ai and they still have released it lmao.",
              "score": 15,
              "created_utc": 1747970707.0,
              "replies": [
                {
                  "id": "mtrwo0t",
                  "author": "PutBeansOnThemBeans",
                  "body": "You’re right bro everything sucks!",
                  "score": -21,
                  "created_utc": 1747970883.0,
                  "replies": [
                    {
                      "id": "mtrxuo1",
                      "author": "Cthulhar",
                      "body": "Huh? What are you talking about??\n\nAre You ok? Having a crisis or something?",
                      "score": 10,
                      "created_utc": 1747971385.0,
                      "replies": [
                        {
                          "id": "mtrz523",
                          "author": "AmericanRampager",
                          "body": "They were just trying to be positive and you responded with a bland, nearly unrelated comment. In response to you they just sarcastically matched energy.",
                          "score": -11,
                          "created_utc": 1747971939.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mtrm4zv",
              "author": "wholewheatwithPB",
              "body": "lol if you think Apple actually cares about privacy",
              "score": 11,
              "created_utc": 1747966828.0,
              "replies": [
                {
                  "id": "mtrmcvq",
                  "author": "PutBeansOnThemBeans",
                  "body": "I believe if you read the comment you’ll see I said they care MORE.",
                  "score": -9,
                  "created_utc": 1747966907.0,
                  "replies": [
                    {
                      "id": "mtsv3rg",
                      "author": "Userybx2",
                      "body": "You my friend fell for marketing.\n\nThe only thing a multi billion dollar corporation cares is your money, they get more money if you think they care about your privacy. They have no reason to actually care about your privacy.",
                      "score": 5,
                      "created_utc": 1747988813.0,
                      "replies": [
                        {
                          "id": "mtsvo3s",
                          "author": "PutBeansOnThemBeans",
                          "body": "1. Business Models and Incentives\n\nMeta (Facebook/Instagram/WhatsApp):\n\t•\tAd-driven model; core revenue from personal data profiling for targeted ads.\n\t•\tIncentivized to collect extensive behavioral data across platforms and third-party apps.\n\nApple:\n\t•\tPrimarily hardware and services-driven revenue.\n\t•\tIncentivized to use privacy as a product differentiator, not to monetize user data.\n\nVerdict: Apple’s incentives align more directly with privacy preservation.\n\n⸻\n\n2. Policy and Infrastructure\n\nMeta:\n\t•\tHistorically reactive, not proactive.\n\t•\tBuilt infrastructure (e.g. Facebook Pixel, SDKs) that enabled widespread third-party tracking.\n\t•\tShifted toward more encrypted and “privacy-focused” messaging, but only after intense scrutiny.\n\nApple:\n\t•\tRolled out privacy-enhancing features: App Tracking Transparency (ATT), Mail Privacy Protection, on-device processing.\n\t•\tLimited third-party data access at OS level, often without warning to advertisers/developers.\n\nVerdict: Apple has consistently built infrastructure for privacy. Meta often adapted under pressure.\n\n⸻\n\n3. Transparency and Control\n\nMeta:\n\t•\tOften buried controls in obscure menus.\n\t•\tPrivacy dashboard improvements came post-2018 (Cambridge Analytica).\n\t•\tUsers given more controls now, but complexity still favors data retention.\n\nApple:\n\t•\tCreated clear, prominent privacy labels on the App Store.\n\t•\tProvided per-app data controls, microphone/camera indicators, and location access limits.\n\nVerdict: Apple prioritized user clarity and control; Meta improved post-crisis but remains less intuitive.\n\n⸻\n\n4. Public Scandals and Regulatory Fines\n\nMeta:\n\t•\tMajor incidents: Cambridge Analytica (2018), $5B FTC fine (2019), ongoing antitrust and data privacy investigations in EU and US.\n\t•\tRegular exposure of lapses in consent and security (e.g. WhatsApp metadata sharing with Facebook).\n\nApple:\n\t•\tFar fewer data privacy scandals.\n\t•\tCriticized for compliance with authoritarian regimes (e.g. China) and for restricting third-party ads (seen as self-serving).\n\t•\tRegulatory scrutiny around anti-competitive behavior, not misuse of user data.\n\nVerdict: Meta has a deep track record of privacy violations; Apple’s issues lie more in market power than privacy breaches.\n\n⸻\n\n5. Outcomes and Reputation\n\nMeta:\n\t•\tOngoing trust deficit with users and regulators.\n\t•\tPrivacy measures seen as PR or reactive (e.g. pivot to encrypted messaging).\n\t•\tStill central to surveillance advertising infrastructure.\n\nApple:\n\t•\tViewed by most consumers and privacy advocates as a privacy leader.\n\t•\tATT led to measurable disruptions in the ad industry and major revenue shifts away from companies like Meta.\n\nVerdict: Apple reshaped the privacy landscape; Meta was mostly shaped by it.\n\nFinal Assessment\n\nApple has consistently outperformed Meta on privacy across infrastructure, policy, transparency, and public outcomes.\nMeta’s trajectory improved post-2018, but remains structurally constrained by its surveillance-driven business model. Apple’s privacy leadership is partly self-serving (anti-ad competition), but the net effect has been consumer-beneficial and industry-shaping.\n\nThere’s AI’s take, champ.\n\nIt’s not marketing, it’s having an opinion founded on reality and not being a groaning malcontent.",
                          "score": -1,
                          "created_utc": 1747989163.0,
                          "replies": []
                        },
                        {
                          "id": "mtsve5o",
                          "author": "PutBeansOnThemBeans",
                          "body": "Are you unfamiliar with Apple?\n\nPart of their brand value is privacy.\n\nI’m under no illusions it’s perfect. Can you please help me find comparable data leaks, or deliberate data harvesting and trading Apple has done compared to Meta?\n\nI don’t even like Apple, this is just reality. I compared two things and one is objectively better on this front and one is objectively worse based on available knowledge.",
                          "score": -4,
                          "created_utc": 1747988992.0,
                          "replies": [
                            {
                              "id": "mttf4ms",
                              "author": "knottheone",
                              "body": "Apple Search Ads. They sell access to your app store behavior to third parties. Where you tap on store pages, your Apple profile information like demographics, your current location for some apps for targeted geo ads, your app purchase history, your in-app purchase history, and all sorts of other stuff.\n\nThey make a measly $5 billion from it when their market cap is trillions of dollars. Why would they do that if their primary concern is user privacy? It isn't, that's just their very successful marketing hoodwinking all of their users.",
                              "score": 4,
                              "created_utc": 1747999724.0,
                              "replies": [
                                {
                                  "id": "mtulnyz",
                                  "author": "PutBeansOnThemBeans",
                                  "body": "Ooh fun, can you point out where I said Apple’s primary concern was privacy?",
                                  "score": 2,
                                  "created_utc": 1748013740.0,
                                  "replies": [
                                    {
                                      "id": "mtuxhth",
                                      "author": "knottheone",
                                      "body": "It doesn't need to be their primary concern. If they value user privacy so much, why would they sell access to their user data for $5 billion? That's about 1% of their 2024 total revenue. Their users' privacy is only worth that much when they campaign on being so privacy conscious?}\n\nYou also said:\n\n> deliberate data harvesting and trading Apple has done\n\nand to walk that back so quickly is pretty weird for someone who \"doesn't even like Apple.\" You have a very weird narrative here.",
                                      "score": 1,
                                      "created_utc": 1748017073.0,
                                      "replies": [
                                        {
                                          "id": "mtvua4s",
                                          "author": "PutBeansOnThemBeans",
                                          "body": "My weird narrative is I said one thing is less bad than another and all of you haters got so wound up you’re arguing against points I never made and stances I never took.",
                                          "score": 1,
                                          "created_utc": 1748026498.0,
                                          "replies": [
                                            {
                                              "id": "mtvzi2g",
                                              "author": "knottheone",
                                              "body": "You said \"objectively\" when Apple does the same thing you are dunking on Facebook and Google for doing. It's worse that Apple is doing it because they say they \"care about privacy\" yet are selling access to your data for a pittance. $5 billion is a rounding error for them.",
                                              "score": 1,
                                              "created_utc": 1748028088.0,
                                              "replies": [
                                                {
                                                  "id": "mtw2uiv",
                                                  "author": "PutBeansOnThemBeans",
                                                  "body": "Here you go champ, in case you missed it. “Objectively better” does not mean “nothing like” or “has none of the same practices”\n\nYou’ll see here Apple issues as well, and the same result I’ve stated: Apple is BETTER. Not perfect. Not good.\n\nBetter.\n\nOr would you rather keep debating points I’m not making?\n\n\n\n1.\t⁠ Business Models and Incentives\n\nMeta (Facebook/Instagram/WhatsApp): •\tAd-driven model; core revenue from personal data profiling for targeted ads. •\tIncentivized to collect extensive behavioral data across platforms and third-party apps.\n\nApple: •\tPrimarily hardware and services-driven revenue. •\tIncentivized to use privacy as a product differentiator, not to monetize user data.\n\nVerdict: Apple’s incentives align more directly with privacy preservation.\n\n⸻\n\n2. Policy and Infrastructure\n\nMeta: •\tHistorically reactive, not proactive. •\tBuilt infrastructure (e.g. Facebook Pixel, SDKs) that enabled widespread third-party tracking. •\tShifted toward more encrypted and “privacy-focused” messaging, but only after intense scrutiny.\n\nApple: •\tRolled out privacy-enhancing features: App Tracking Transparency (ATT), Mail Privacy Protection, on-device processing. •\tLimited third-party data access at OS level, often without warning to advertisers/developers.\n\nVerdict: Apple has consistently built infrastructure for privacy. Meta often adapted under pressure.\n\n⸻\n\n3. Transparency and Control\n\nMeta: •\tOften buried controls in obscure menus. •\tPrivacy dashboard improvements came post-2018 (Cambridge Analytica). •\tUsers given more controls now, but complexity still favors data retention.\n\nApple: •\tCreated clear, prominent privacy labels on the App Store. •\tProvided per-app data controls, microphone/camera indicators, and location access limits.\n\nVerdict: Apple prioritized user clarity and control; Meta improved post-crisis but remains less intuitive.\n\n⸻\n\n4. Public Scandals and Regulatory Fines\n\nMeta: •\tMajor incidents: Cambridge Analytica (2018), $5B FTC fine (2019), ongoing antitrust and data privacy investigations in EU and US. •\tRegular exposure of lapses in consent and security (e.g. WhatsApp metadata sharing with Facebook).\n\nApple: •\tFar fewer data privacy scandals. •\tCriticized for compliance with authoritarian regimes (e.g. China) and for restricting third-party ads (seen as self-serving). •\tRegulatory scrutiny around anti-competitive behavior, not misuse of user data.\n\nVerdict: Meta has a deep track record of privacy violations; Apple’s issues lie more in market power than privacy breaches.\n\n⸻\n\n5. Outcomes and Reputation\n\nMeta: •\tOngoing trust deficit with users and regulators. •\tPrivacy measures seen as PR or reactive (e.g. pivot to encrypted messaging). •\tStill central to surveillance advertising infrastructure.\n\nApple: •\tViewed by most consumers and privacy advocates as a privacy leader. •\tATT led to measurable disruptions in the ad industry and major revenue shifts away from companies like Meta.\n\nVerdict: Apple reshaped the privacy landscape; Meta was mostly shaped by it.\n\nFinal Assessment\n\nApple has consistently outperformed Meta on privacy across infrastructure, policy, transparency, and public outcomes. Meta’s trajectory improved post-2018, but remains structurally constrained by its surveillance-driven business model. Apple’s privacy leadership is partly self-serving (anti-ad competition), but the net effect has been consumer-beneficial and industry-shaping.",
                                                  "score": 0,
                                                  "created_utc": 1748029109.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mtsvuhx",
                              "author": "Userybx2",
                              "body": "Yes, part of their marketing strategy is privacy. \n\n>I’m under no illusions it’s perfect. Can you please help me find comparable data leaks, or deliberate data harvesting and trading Apple has done compared to Meta?\n\nNo because I don't care tbh. \n\nI will never trust a public traded company with their closed source data that they care about my privacy. If they made their whole system open source and could show that they store everything you do in encrypted files that they can't even access themselves, like some cloud providers do, then I will trust them.",
                              "score": 2,
                              "created_utc": 1747989273.0,
                              "replies": [
                                {
                                  "id": "mtsw3sd",
                                  "author": "PutBeansOnThemBeans",
                                  "body": "It’s obvious you don’t care and wanted to arrive at your conclusion and had no real interest in good faith, quit trying to pretend now.\n\nDid I say to trust them? Did I say I trust them?\n\nOr did I say they care more about privacy than meta?",
                                  "score": 1,
                                  "created_utc": 1747989428.0,
                                  "replies": [
                                    {
                                      "id": "mtsw5iw",
                                      "author": "Userybx2",
                                      "body": "Chill dude.",
                                      "score": 2,
                                      "created_utc": 1747989457.0,
                                      "replies": [
                                        {
                                          "id": "mtsw6ms",
                                          "author": "PutBeansOnThemBeans",
                                          "body": "😂",
                                          "score": 0,
                                          "created_utc": 1747989476.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mtv85gs",
                              "author": "wholewheatwithPB",
                              "body": "Bro Apple literally had a bug where someone could call you, quickly hang up, and your microphone would stay live and they could hear everything around you.    \n    \nApple also does zero, nada, nothing to TelCo companies who actually sell your personal data. Their privacy is all PR and marketing. You could argue that Meta is better for privacy given end to end encryption for WhatsApp / messaging. Both care about $$ though don’t let the PR fool you.",
                              "score": 1,
                              "created_utc": 1748020106.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mts3hx4",
      "author": "Pisstoffo",
      "body": "…Siri?? It’ll literally be: “Hey, Siri…what am I looking at?” “Let me Google that for you…here’s what I found: What am I looking at is a popular phrase said by those in the TV show Lost.” “…thanks, Siri…”",
      "score": 151,
      "created_utc": 1747973871.0,
      "replies": [
        {
          "id": "mtspckz",
          "author": "None",
          "body": "[deleted]",
          "score": 34,
          "created_utc": 1747985340.0,
          "replies": [
            {
              "id": "mtv4and",
              "author": "goodnames679",
              "body": "“Hey siri, [very simple and easy to look up question]”\n\n“Sorry, I can’t get the answer to that on iGlass.”\n\nIt blows my mind because Apple voice recognition is (in my experience) leagues better than I’ve ever experienced with Android / Amazon products. If they put some effort into it Siri could be by far the best virtual assistant… and yet they don’t, and it continues to suck.",
              "score": 7,
              "created_utc": 1748019020.0,
              "replies": [
                {
                  "id": "mtvkcxo",
                  "author": "Xendrus",
                  "body": "I have literally never seen siri work correctly even ONCE in my life. I use an android but any time I see siri being used by other people, or by someone in a youtube video or show/movie it has never once worked the first try. It is truly an amazingly consistent piece of utter dogshit.",
                  "score": 6,
                  "created_utc": 1748023532.0,
                  "replies": []
                },
                {
                  "id": "mtzj810",
                  "author": "newoneagain25",
                  "body": "Gemini on android is amazing and currently leads ai charts.",
                  "score": 1,
                  "created_utc": 1748082326.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mtut3qm",
              "author": "ToMorrowsEnd",
              "body": "but it will be better than the current rayban metas when you do the same thing.",
              "score": 2,
              "created_utc": 1748015813.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mtsgr6n",
          "author": "jjstiles2",
          "body": "Uff accurate",
          "score": 4,
          "created_utc": 1747980504.0,
          "replies": []
        },
        {
          "id": "mtvbz2c",
          "author": "malledtodeath",
          "body": "siri keeps getting worse, I don’t understand",
          "score": 2,
          "created_utc": 1748021180.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtrr6es",
      "author": "National-Law-458",
      "body": "Yea…… relying on Siri. Hard pass.  Siri is shit.",
      "score": 62,
      "created_utc": 1747968693.0,
      "replies": []
    },
    {
      "id": "mtre8ix",
      "author": "punchdrunkskunk",
      "body": ">\"Siri will be a key part of the glasses experience\"\n\nSo, they'll be garbage.",
      "score": 147,
      "created_utc": 1747963973.0,
      "replies": [
        {
          "id": "mtrgpdb",
          "author": "tu_tu_tu",
          "body": "This just means \"we can't come up with better contol method than voice commands\"",
          "score": 27,
          "created_utc": 1747964855.0,
          "replies": []
        },
        {
          "id": "mtri488",
          "author": "None",
          "body": "Do they want the glasses to not do well?",
          "score": 9,
          "created_utc": 1747965352.0,
          "replies": []
        },
        {
          "id": "mtsciuv",
          "author": "UnemployedAtype",
          "body": "It's super sad. They trashed Siri when promising Apple intelligence, failed to deliver, and now they're trying to hype up other related products?\n\nThis is a new level of disappointing.\n\nSure Apple loves diminishing product quality prior to launching a subsequent gen to make it look THAT MUCH MORE REVOLUTIONARY! \n\nExcept when they don't do that.\n\nAnd they just diminish the quality of a great product and fail to improve.\n\nI just wish they stopped the hype bandwagon and fixed all of their core stuff :/\n\n\n(From knowing people in Apple R&D, this stuff has a long development cycle which, unfortunately, locks Apple into their course of action...)",
          "score": 8,
          "created_utc": 1747978261.0,
          "replies": [
            {
              "id": "mtsshb3",
              "author": "Edward_TH",
              "body": "Apple *IS* the hype bandwagon. They've been like that since its infancy because they've been shaped to rely on hype and fomo as a company, they wouldn't work otherwise.",
              "score": -4,
              "created_utc": 1747987207.0,
              "replies": [
                {
                  "id": "mtstka7",
                  "author": "UnemployedAtype",
                  "body": "They used to build great products with deserved hype.\n\nIt's been a while since that was true.",
                  "score": 7,
                  "created_utc": 1747987865.0,
                  "replies": [
                    {
                      "id": "mtsu82g",
                      "author": "Edward_TH",
                      "body": "Well, they sure did. But that's not enough of itself to keep the success apple have: you need to have a great marketing strategy, and they have one carefully crafted in decades and that's their actual main product. If they stopped with that, they'd go the way of Yahoo.",
                      "score": -1,
                      "created_utc": 1747988269.0,
                      "replies": [
                        {
                          "id": "mtsv1m1",
                          "author": "UnemployedAtype",
                          "body": "True.\n\nActually, I'm currently watching and mapping something incredibly fascinating that Apple is doing -\n\nThey're slowly taking away parts of the offline portion of their music app, making it harder and harder to access your downloaded/synced music and podcasts. At the moment, both apps complain if you have cellular data off, even if everything is stored locally. I guarantee you that they're continuing to push towards forcing subscriptions, but in a way that they just push enough with each update that those who simply go along with it to keep things working don't realize what they're doing.\n\nI've also publicly documented it and flagged it as an issue for them, in a good faith gesture hoping that it's a \"bug\" instead of a feature (pretty sure it's intentional...)\n\nBut, Apple also wields blind astroturfing fans, in a painfully obnoxious way, such that I'd never try to engage  like this in any of their subs.",
                          "score": -2,
                          "created_utc": 1747988776.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mtspel5",
              "author": "andynator1000",
              "body": "You wrote so many words without saying anything.",
              "score": -6,
              "created_utc": 1747985373.0,
              "replies": [
                {
                  "id": "mtsth5g",
                  "author": "UnemployedAtype",
                  "body": "Why thank you! I aspire to be the next apple keynote speaker.\n\nWhile we're at it, you don't seem to mind reading much, do you.",
                  "score": 4,
                  "created_utc": 1747987811.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mtwrhh6",
      "author": "chaoderr",
      "body": "They will over promise and under deliver",
      "score": 6,
      "created_utc": 1748036771.0,
      "replies": []
    },
    {
      "id": "mtrdaa6",
      "author": "skettibutter",
      "body": "They'll be overpriced as hell, people will still buy them, and then they will sit on a shelf.",
      "score": 33,
      "created_utc": 1747963627.0,
      "replies": [
        {
          "id": "mtrfwm9",
          "author": "xplodia",
          "body": "Catching dust and useless.",
          "score": 3,
          "created_utc": 1747964573.0,
          "replies": []
        },
        {
          "id": "mtsk441",
          "author": "FlorydaMan",
          "body": "*very few people\n\nI lost conficende in the brand after Siri and the Vision Pro. They were on a streak of great products, and their MacBooks and chips are peak today, but they seem to lack the true \"it\" factor for new shit.",
          "score": 0,
          "created_utc": 1747982349.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtrk3b0",
      "author": "EWintereye",
      "body": "I'll believe it when I see it in store",
      "score": 5,
      "created_utc": 1747966069.0,
      "replies": []
    },
    {
      "id": "mtva0qc",
      "author": "compasrc",
      "body": "Consumerism final bosses walking around with AirPods, MacBook, Apple Watch, air tags, and now Apple glasses",
      "score": 4,
      "created_utc": 1748020632.0,
      "replies": [
        {
          "id": "mu0u84f",
          "author": "CeramicCastle49",
          "body": "Everyone knows that one guy who is appled up the wazoo",
          "score": 1,
          "created_utc": 1748100756.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtx7pqf",
      "author": "fuzzypetiolesguy",
      "body": "iGlass",
      "score": 4,
      "created_utc": 1748042393.0,
      "replies": [
        {
          "id": "mtyupvb",
          "author": "actual1",
          "body": "For $7,000  a pair",
          "score": 1,
          "created_utc": 1748067447.0,
          "replies": []
        },
        {
          "id": "mu0tvem",
          "author": "CeramicCastle49",
          "body": "Why did apple stopp the i naming convention? I still think the apple watch should've been called the iWatch\n\nI wonder what the latest \"i\" branded product is that's still sold today.",
          "score": 1,
          "created_utc": 1748100644.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtsc9ny",
      "author": "Mirikado",
      "body": "The comments here are incredibly out of touch and don’t understand the smart glasses market at all. Plenty of comments saying the Meta Ray-Bans are a failure, which is the furthest thing from reality. \n\nNo matter how you feel about Zuck, the Meta Ray-Bans are a HUGE success. They have already sold 2m pairs, being the top selling item at every Ray-Ban store and Meta is looking to increase production to 10m pairs/year. The market for smart glasses is expanding quickly and it’s just getting started. There is going to be a race between every big tech along with startups to capture the market. \n\nhttps://www.theverge.com/news/613292/meta-ray-ban-2-million-10-million-capacity-subscription-essilor-luxottica-earnings\n\nClassic Redditors being bitter and cynical about every new tech product. I guess most Redditors don’t need sunglasses cause they never go outside anyway.",
      "score": 29,
      "created_utc": 1747978128.0,
      "replies": [
        {
          "id": "mtzwvcd",
          "author": "Pool_Shark",
          "body": "Thank you! I thought I was losing my mind for a second, it’s clear they are getting in the market to compete with Meta here and if they do it right can absolutely make a huge splash.",
          "score": 5,
          "created_utc": 1748089124.0,
          "replies": []
        },
        {
          "id": "mtutfp9",
          "author": "ToMorrowsEnd",
          "body": "It's because most of them that post here complaining are 13 year olds that cant even buy things as they have no money.",
          "score": 7,
          "created_utc": 1748015907.0,
          "replies": [
            {
              "id": "mtycecv",
              "author": "None",
              "body": "Facts except I’m 34 and have no money",
              "score": 4,
              "created_utc": 1748058137.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mtvpvsk",
          "author": "haarschmuck",
          "body": "Yeah I mean the Quest 3 is basically the best VR headset ever made in terms of functionality/price/etc. \n\nThey know what they're doing but reddit still has a hate boner for anything zuck related.",
          "score": 4,
          "created_utc": 1748025166.0,
          "replies": []
        },
        {
          "id": "mtuqyjc",
          "author": "None",
          "body": "[deleted]",
          "score": -2,
          "created_utc": 1748015219.0,
          "replies": [
            {
              "id": "mtxlua0",
              "author": "Mirikado",
              "body": "People can wear them like regular glasses, they can take photos and videos without reaching for their phone. The glasses also work as earphones. You seriously can’t think of glasses, camera and earphones in one having a use case? Like seriously? 3 different things that you take  with you when you go out. In one. But you somehow don’t see a use case? Convenience. That’s the use case.\n\nAlso who the Hell say you can’t wear these while driving? That makes no sense. They work just like regular sunglasses, which you wear while driving. These glasses even work as a pseudo-dash cam. \n\nThe price isn’t not even bad. Hate to break it to you but plenty of people don’t have a problem dropping a few hundreds for a nice pair of sunglasses. A regular pair of Ray-ban is already $150-$200. Sales numbers don’t lie\n\nAgain, Redditor proving they don’t touch grass if the best example they can give of doing something fun outdoors is “walking on the sidewalk.” You can’t imagine people going on vacations, traveling overseas, going on hikes, going to concerts or conventions… where they want to take a lot of photos, but don’t want to constantly reach for their phones or carrying a camera around? \n\nConvenience is key. People are lazy. If your product makes people’s life easier, it will sell.",
              "score": 1,
              "created_utc": 1748047639.0,
              "replies": [
                {
                  "id": "mtxv2c9",
                  "author": "eventhorizon82",
                  "body": "Can we please stop building the torment nexus? Let's not have everyone with a hidden camera going please?",
                  "score": 1,
                  "created_utc": 1748051185.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mtvv033",
              "author": "MajorMathematician20",
              "body": "They’re for recording people inconspicuously basically",
              "score": -3,
              "created_utc": 1748026717.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mtz92an",
          "author": "Fullonski",
          "body": "I'm bitter and cynical about a lot of tech products because most of them seem to be solutions looking for a problem. If smart glasses are selling a shitload, that is a triumph of marketing more than anything else.",
          "score": 0,
          "created_utc": 1748076029.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtrmeqe",
      "author": "blackicebaby",
      "body": "just wait till wwdc.",
      "score": 2,
      "created_utc": 1747966926.0,
      "replies": []
    },
    {
      "id": "mtxog3r",
      "author": "TotallyTardigrade",
      "body": "I paid so much money to get lasik so I didn’t have to wear glasses or contacts. Why would I want to pay MORE money to wear glasses again?",
      "score": 2,
      "created_utc": 1748048634.0,
      "replies": [
        {
          "id": "mtylq7s",
          "author": "EvoLuvEz",
          "body": "Same boat",
          "score": 1,
          "created_utc": 1748062514.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtu9kvl",
      "author": "u700MHz",
      "body": "Pros\n\n- good for crime \n- good to record Karen’s \n- good for car accidents might kill dash cam business \n\nCons \n- how to keep pervs from using \n- how to keep credit card fraud people away from - and protect your privacy more \nEtc",
      "score": 4,
      "created_utc": 1748010292.0,
      "replies": [
        {
          "id": "mtvrakg",
          "author": "CV514",
          "body": "In order to kill dash cams, the price should be so low that it's unheard of for Apple.",
          "score": 3,
          "created_utc": 1748025595.0,
          "replies": []
        },
        {
          "id": "mtw1697",
          "author": "Smartnership",
          "body": "> Pros\n\n> Karen’s\n\n> accidents\n\nI’m a free speech guy, but pick a lane howboutit",
          "score": 2,
          "created_utc": 1748028598.0,
          "replies": []
        },
        {
          "id": "mtzx3u4",
          "author": "Pool_Shark",
          "body": "The Meta Raybans have a sensor that lights up whenever the camera is in use and I’m sure they would have a similar function. \n\nOf course I’m sure some pervs will find a way around that which is concerning",
          "score": 1,
          "created_utc": 1748089228.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtrv3se",
      "author": "D-inventa",
      "body": "here we go guys, look forward to 1 release a year, and then 2 releases, and then 3 releases eventually with a basic, mid-tier, and premium level from all companies involved. Consumerism must continue!!!",
      "score": 2,
      "created_utc": 1747970244.0,
      "replies": []
    },
    {
      "id": "mtrlf3w",
      "author": "TheSpatulaOfLove",
      "body": "I briefly considered the Meta Ray Bans, then I said ‘Zuck that’.    I’d give the Apple ones a shot if they do similar functions as the Meta version.",
      "score": 4,
      "created_utc": 1747966561.0,
      "replies": [
        {
          "id": "mtvpns0",
          "author": "haarschmuck",
          "body": "I mean the Quest 3 is probably the best VR headset ever produced so it's not like the company doesn't know what they're doing. \n\nKind of a weird comment but ok.",
          "score": 3,
          "created_utc": 1748025099.0,
          "replies": [
            {
              "id": "mtvuylz",
              "author": "TheSpatulaOfLove",
              "body": "Hardware may be excellent, but trust of what they do with data is broken.",
              "score": 4,
              "created_utc": 1748026705.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mtsk4zb",
          "author": "seanchappelle",
          "body": "Did you actually say that though? Did you actually use your mouth and said “zuck that”?",
          "score": -6,
          "created_utc": 1747982363.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtw9b2u",
      "author": "TheQuadBlazer",
      "body": "During a week where I saw multiple articles on Apple VR goggles collecting dust. That was smart.",
      "score": 2,
      "created_utc": 1748031071.0,
      "replies": []
    },
    {
      "id": "mtrlg2i",
      "author": "BedditTedditReddit",
      "body": "Good news - you don’t have to speak to anyone wearing these or the ray-bans.",
      "score": 1,
      "created_utc": 1747966571.0,
      "replies": []
    },
    {
      "id": "mtru1vm",
      "author": "kc_______",
      "body": "Here we go again, more techno garbage that will be unsupported 8 months after its release.",
      "score": 1,
      "created_utc": 1747969820.0,
      "replies": [
        {
          "id": "mtuhkgl",
          "author": "idontwanttofthisup",
          "body": "Not with Apple. Their lifecycle is 7 years.",
          "score": 5,
          "created_utc": 1748012584.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtuxlfu",
      "author": "Livid-Switch4040",
      "body": "lol. Did anyone else get a Ray-Ban Meta ad right below that title?",
      "score": 1,
      "created_utc": 1748017102.0,
      "replies": []
    },
    {
      "id": "mtvhyjf",
      "author": "No-Beginning4027",
      "body": "For only 2499.00",
      "score": 1,
      "created_utc": 1748022850.0,
      "replies": []
    },
    {
      "id": "mtvkyjz",
      "author": "OneOrangeOwl",
      "body": "What happened to that big goggle?",
      "score": 1,
      "created_utc": 1748023706.0,
      "replies": []
    },
    {
      "id": "mtwgte3",
      "author": "FallenBleak5",
      "body": "No thanks. I lad lasik eye surgery so I didn’t have to wear glasses.",
      "score": 1,
      "created_utc": 1748033353.0,
      "replies": []
    },
    {
      "id": "mtwn7gl",
      "author": "dannydiggz",
      "body": "Brotha eughhhh",
      "score": 1,
      "created_utc": 1748035362.0,
      "replies": []
    },
    {
      "id": "mtwti0a",
      "author": "jeedaiaaron",
      "body": "Ok..",
      "score": 1,
      "created_utc": 1748037447.0,
      "replies": []
    },
    {
      "id": "mtwwoe4",
      "author": "maliflow",
      "body": "No they ain’t",
      "score": 1,
      "created_utc": 1748038538.0,
      "replies": []
    },
    {
      "id": "mtxe0eo",
      "author": "astronomicalburnout",
      "body": "I will want a pair solely for the Find My feature :(",
      "score": 1,
      "created_utc": 1748044672.0,
      "replies": []
    },
    {
      "id": "mty5y57",
      "author": "benthic_vents",
      "body": "These are gonna be a smash hit!",
      "score": 1,
      "created_utc": 1748055355.0,
      "replies": []
    },
    {
      "id": "mu0t765",
      "author": "hagamablabla",
      "body": "Welcome back Google Glass.",
      "score": 1,
      "created_utc": 1748100433.0,
      "replies": []
    },
    {
      "id": "mu0tntt",
      "author": "CeramicCastle49",
      "body": "Welcome back google glass",
      "score": 1,
      "created_utc": 1748100578.0,
      "replies": []
    },
    {
      "id": "mu3iheu",
      "author": "eggflip1020",
      "body": "Clickbait.",
      "score": 1,
      "created_utc": 1748133951.0,
      "replies": []
    },
    {
      "id": "mu4chsh",
      "author": "None",
      "body": "I like the idea of these but the frame choices have to be broader and the technology more inconspicuous. \n\nHonestly I would take a cord going down from behind my ear for lighter frames but they won’t do that because it would be “inelegant”",
      "score": 1,
      "created_utc": 1748146566.0,
      "replies": []
    },
    {
      "id": "mu4n92p",
      "author": "Unasked_for_advice",
      "body": "They keep making the same mistake , IS there a demand for this product? Does the product make enough of a splash to create its own demand? Answer , is no so this will fail just like the others before it.",
      "score": 1,
      "created_utc": 1748152243.0,
      "replies": []
    },
    {
      "id": "mu4r3k8",
      "author": "Grzegorxz",
      "body": "Oh boy, Cuckle Glass is back to ease the hiding of pictures being taken of minors!",
      "score": 1,
      "created_utc": 1748154466.0,
      "replies": []
    },
    {
      "id": "mtrj710",
      "author": "norseeyaa",
      "body": "do not even look at me if you are wearing these",
      "score": 1,
      "created_utc": 1747965737.0,
      "replies": []
    },
    {
      "id": "mtvnq8p",
      "author": "Taint_Liquor",
      "body": "Do people really want this shit? Maybe I'm just a crusty old man, but ew.",
      "score": 1,
      "created_utc": 1748024524.0,
      "replies": []
    },
    {
      "id": "mtvozm2",
      "author": "haarschmuck",
      "body": "Starting at only $2,999.99\n\n*Must own iPhone 16 Pro or higher to purchase\n\n**Est. Battery ~ 1.5 hr",
      "score": 1,
      "created_utc": 1748024898.0,
      "replies": []
    },
    {
      "id": "mtw3368",
      "author": "sm753",
      "body": "Uh...did they not learn their lesson from the Apple Vision Pro? Aside from influencers and content creators, regular consumers don't want these expensive gimmicky but otherwise useless gadgets.",
      "score": 1,
      "created_utc": 1748029183.0,
      "replies": []
    },
    {
      "id": "mtwbz5g",
      "author": "JaJ_Judy",
      "body": "What the fuck for? What fucking purpose do we need these pieces of shit for?",
      "score": 1,
      "created_utc": 1748031876.0,
      "replies": []
    },
    {
      "id": "mtx2971",
      "author": "LikeHemlock",
      "body": "they are developing awful products, Newton era 2.0",
      "score": 1,
      "created_utc": 1748040487.0,
      "replies": []
    },
    {
      "id": "mtrejye",
      "author": "RaphaelUrbino",
      "body": "*Sigh*",
      "score": 1,
      "created_utc": 1747964087.0,
      "replies": []
    },
    {
      "id": "mtykjg3",
      "author": "LetsJerkCircular",
      "body": "Maybe it’s vaporware, but the broke haters are in full force.\n\nI rock Raybans, but I don’t fuck with Facebook/Meta\n\nI want camera glasses, and I really only trust Apple.\n\nIt’s ok to have money to blow, if you make money and save and aren’t taking advantage of people to have that excess. \n\nIt’s ok to buy things that you want and can afford.\n\nFuck Meta.",
      "score": 1,
      "created_utc": 1748061925.0,
      "replies": []
    },
    {
      "id": "mtrsfd5",
      "author": "drc84",
      "body": "It’s been long enough that even other tech companies forgot how bad Google Glass did?",
      "score": -2,
      "created_utc": 1747969175.0,
      "replies": [
        {
          "id": "mtsjjhm",
          "author": "fusionsofwonder",
          "body": "Google Glass launched 12 years ago, so yeah. Plus Meta Ray Bans haven't had nearly the pushback that Google Glass had.\n\nMixed reality is coming, and the big tech companies will keep exploring it until it becomes standard. Which won't be in 2026, but that doesn't stop Apple from getting their foot in the door.",
          "score": 5,
          "created_utc": 1747982032.0,
          "replies": [
            {
              "id": "mtu3gm2",
              "author": "im_Kendr1ck_Llama",
              "body": "12 years ago… wow we’re getting old.",
              "score": 3,
              "created_utc": 1748008446.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mtu98l7",
      "author": "jcoddinc",
      "body": "![gif](giphy|vP38v614UOzbq|downsized)\n\nGuess they're just ignoring the Google glass failing",
      "score": 0,
      "created_utc": 1748010192.0,
      "replies": [
        {
          "id": "mtvrsf9",
          "author": "JarrettR",
          "body": "Google glass was using tech from a decade ago and was ugly as hell\n\nNot really relevant",
          "score": 6,
          "created_utc": 1748025747.0,
          "replies": []
        },
        {
          "id": "mtxthe6",
          "author": "chth",
          "body": "MKBHD really changed over the years",
          "score": 1,
          "created_utc": 1748050588.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtww8r0",
      "author": "TobiasReaperB",
      "body": "Meh, seems like it’ll be expensive and flop like the Vision Pro did.",
      "score": 0,
      "created_utc": 1748038388.0,
      "replies": []
    },
    {
      "id": "mts2evh",
      "author": "DrMcJedi",
      "body": "As a wearer of glasses…they’re expensive enough, I don’t need to include quickly obsolete shit that requires charging into them...",
      "score": 0,
      "created_utc": 1747973378.0,
      "replies": []
    },
    {
      "id": "mtt99ib",
      "author": "TheZombiFlanders",
      "body": "But can they read people’s power levels?",
      "score": 0,
      "created_utc": 1747997004.0,
      "replies": []
    },
    {
      "id": "mttabnd",
      "author": "theprofessor1985",
      "body": "I’d rather have a new SE model with a finger print button than another probably failed smart tech to Wear on your face.",
      "score": 0,
      "created_utc": 1747997527.0,
      "replies": []
    },
    {
      "id": "mtumx4f",
      "author": "BLU3SKU1L",
      "body": "At the low low price of $10,000\n\n(Kidding, but seriously)",
      "score": 0,
      "created_utc": 1748014095.0,
      "replies": []
    },
    {
      "id": "mtvj6d5",
      "author": "Grady300",
      "body": "Google Glass, welcome back",
      "score": 0,
      "created_utc": 1748023191.0,
      "replies": []
    },
    {
      "id": "mtxvgsg",
      "author": "IveKnownItAll",
      "body": "So, it's Apples turn to fail at Google Glass?",
      "score": 0,
      "created_utc": 1748051336.0,
      "replies": []
    },
    {
      "id": "mtrfcul",
      "author": "pbrslayer",
      "body": "Can’t wait to see the dashcam footage of the car accidents these inevitably cause",
      "score": -1,
      "created_utc": 1747964376.0,
      "replies": []
    },
    {
      "id": "mtrq1v2",
      "author": "-idigthis-",
      "body": "Future flop. Just like the Apple Vision.",
      "score": -1,
      "created_utc": 1747968268.0,
      "replies": []
    },
    {
      "id": "mtrr5ad",
      "author": "Brick_Lab",
      "body": "Sure they are",
      "score": 0,
      "created_utc": 1747968681.0,
      "replies": []
    },
    {
      "id": "mtrxxv0",
      "author": "Fit-Significance-436",
      "body": "Asking real questions, can I use them for Pickle ball line call challenges?",
      "score": 0,
      "created_utc": 1747971423.0,
      "replies": []
    },
    {
      "id": "mts0xt1",
      "author": "aji23",
      "body": "Are these my subtitle glasses as a HOH person?",
      "score": 0,
      "created_utc": 1747972720.0,
      "replies": []
    },
    {
      "id": "mttbuio",
      "author": "johnyeros",
      "body": "Hopefully for 1k and have shitty ai",
      "score": 0,
      "created_utc": 1747998246.0,
      "replies": []
    },
    {
      "id": "mttrpnz",
      "author": "Imswim80",
      "body": "It'll be called the i^2, because iEyes brought too many seamen.",
      "score": 0,
      "created_utc": 1748004581.0,
      "replies": []
    },
    {
      "id": "mttvar3",
      "author": "tomassko",
      "body": "Im going to use them while driving my apple car.",
      "score": 0,
      "created_utc": 1748005805.0,
      "replies": []
    },
    {
      "id": "mtubcyr",
      "author": "JerryAldinii",
      "body": "Oh cool another apple flop.",
      "score": 0,
      "created_utc": 1748010807.0,
      "replies": [
        {
          "id": "mtvwtsl",
          "author": "SUPRVLLAN",
          "body": "Literally half the planet wears a form of corrective vision. Putting *any* tech features in a pair of glasses from Apple is absolutely going to be extremely successful.",
          "score": 0,
          "created_utc": 1748027277.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtuce96",
      "author": "None",
      "body": "Can we have it where it can auto translate a foreign movie I’m watching?",
      "score": 0,
      "created_utc": 1748011107.0,
      "replies": []
    },
    {
      "id": "mtuyler",
      "author": "thereverendpuck",
      "body": "A decade late",
      "score": 0,
      "created_utc": 1748017388.0,
      "replies": []
    },
    {
      "id": "mtw68u2",
      "author": "tun3man",
      "body": "another scam",
      "score": 0,
      "created_utc": 1748030140.0,
      "replies": []
    },
    {
      "id": "mtwd5ni",
      "author": "Taki_Minase",
      "body": "Like AirPower",
      "score": 0,
      "created_utc": 1748032232.0,
      "replies": []
    },
    {
      "id": "mtwtm5a",
      "author": "BIZLfoRIZL",
      "body": "Non-starter without AR now that Google XR has been announced.",
      "score": 0,
      "created_utc": 1748037485.0,
      "replies": []
    },
    {
      "id": "mtru67h",
      "author": "LateralEntry",
      "body": "All this AR gadgets seem so promising, but none of the companies have figured out how to do much with them - MS HoloLens, google glass, Apple vision, meta quest. I think these glasses will be more of the same.",
      "score": -2,
      "created_utc": 1747969869.0,
      "replies": [
        {
          "id": "mtw1m30",
          "author": "Smartnership",
          "body": "> All this AR gadgets seem so promising, \n\n\nHow is that related to this product?",
          "score": 1,
          "created_utc": 1748028733.0,
          "replies": [
            {
              "id": "mtw28aa",
              "author": "LateralEntry",
              "body": "This is an AR Gadget…",
              "score": 0,
              "created_utc": 1748028921.0,
              "replies": [
                {
                  "id": "mtw2u00",
                  "author": "Smartnership",
                  "body": "You read the same linked article we did.\n\nWhy would they specifically say it is not AR?\n\n> The glasses will be able to take photos, record video, provide translations, give turn-by-turn directions, play music, facilitate phone calls, offer feedback on what the wearer is seeing, and answer queries, **but there won't be augmented reality capabilities included.**",
                  "score": 2,
                  "created_utc": 1748029105.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mtsv5ar",
      "author": "_Soup_R_Man_",
      "body": "Waiting on holographic projections via glasses.",
      "score": -2,
      "created_utc": 1747988839.0,
      "replies": []
    },
    {
      "id": "mts5igp",
      "author": "Malodoror",
      "body": "Tech isn’t old enough for the Apple “innovation” treatment.",
      "score": -1,
      "created_utc": 1747974810.0,
      "replies": []
    },
    {
      "id": "mts6u80",
      "author": "parker1019",
      "body": "With all their financial resource and PD talent… Steve’s rolling over in his grave….",
      "score": -1,
      "created_utc": 1747975440.0,
      "replies": []
    },
    {
      "id": "mtt3ayl",
      "author": "uwu_vanya",
      "body": "Didn’t Google do this like a decade ago",
      "score": -1,
      "created_utc": 1747993778.0,
      "replies": []
    },
    {
      "id": "mtt6nh4",
      "author": "GlxxmySvndxy",
      "body": "More junk nobody wants",
      "score": -1,
      "created_utc": 1747995626.0,
      "replies": []
    },
    {
      "id": "mttn027",
      "author": "Zerocoolx1",
      "body": "I wonder if they’ll be as successful as their VR headsets?",
      "score": -1,
      "created_utc": 1748002901.0,
      "replies": []
    },
    {
      "id": "mttwm6v",
      "author": "sky_6",
      "body": "Tired of feeling compelled to to stare at a screen all day? Well what if we just attached it to your face?!!!",
      "score": -1,
      "created_utc": 1748006243.0,
      "replies": []
    },
    {
      "id": "mtug1bx",
      "author": "ramdom-ink",
      "body": "Wonder if they’re going to actually magnify or make you see better or more clearly: like, *glasses.*",
      "score": -1,
      "created_utc": 1748012147.0,
      "replies": []
    },
    {
      "id": "mtuxh4d",
      "author": "Coheed2000",
      "body": "Yawn another apple product looking for an application.",
      "score": -1,
      "created_utc": 1748017067.0,
      "replies": []
    },
    {
      "id": "mts8tne",
      "author": "arismoramen",
      "body": "This will sell less that the Meta Ray Band which don’t sell well",
      "score": -5,
      "created_utc": 1747976402.0,
      "replies": []
    },
    {
      "id": "mtscbg6",
      "author": "Mercurial8",
      "body": "How much more will they cost in the US because of the new tariffs?",
      "score": -2,
      "created_utc": 1747978153.0,
      "replies": []
    },
    {
      "id": "mtu8k0e",
      "author": "joxx67",
      "body": "Will people who have prescription glasses be able to use them?? If not, that’s a huge segment of the market.",
      "score": -2,
      "created_utc": 1748009992.0,
      "replies": []
    },
    {
      "id": "mttwefm",
      "author": "axelalva8703",
      "body": "Guess they didn’t learn with the disastrous Apple Vision Pro… \n\nLet me guess, MSRP $6,999.99",
      "score": -4,
      "created_utc": 1748006170.0,
      "replies": []
    }
  ]
}