{
  "post": {
    "title": "VanMoof’s new S6 e-bikes fix everything but trust",
    "author": "dapperlemon",
    "id": "1la8rsy",
    "score": 250,
    "created_utc": 1749795229.0,
    "selftext": "",
    "num_comments": 74,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1la8rsy/vanmoofs_new_s6_ebikes_fix_everything_but_trust/"
  },
  "comments": [
    {
      "id": "mxiqdel",
      "author": "ralphonsob",
      "body": "Picture 12/12:\n\n> Even the breaks are easier to service.\n\nBrakes, FFS. Journalists nowadays, eh?",
      "score": 151,
      "created_utc": 1749796130.0,
      "replies": [
        {
          "id": "mxiwl1p",
          "author": "tj-horner",
          "body": "It’s such a common mistake and it annoys me to no end!",
          "score": 30,
          "created_utc": 1749799674.0,
          "replies": [
            {
              "id": "mxj66pe",
              "author": "fucayama",
              "body": "It really brakes my heart when I see this",
              "score": 23,
              "created_utc": 1749805461.0,
              "replies": []
            },
            {
              "id": "mxj5owi",
              "author": "Westerdutch",
              "body": "Luckily writing isn't their day job or this would be **really** embarrassing.",
              "score": 13,
              "created_utc": 1749805160.0,
              "replies": []
            },
            {
              "id": "mxmk4ek",
              "author": "polarbear128",
              "body": ">...  to no end!\n\nI hope you're making a grammar joke there.",
              "score": 0,
              "created_utc": 1749846353.0,
              "replies": []
            },
            {
              "id": "mxo8qxx",
              "author": "ROARfeo",
              "body": "You should give them a brake",
              "score": 0,
              "created_utc": 1749866864.0,
              "replies": [
                {
                  "id": "myc7mda",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 2,
                  "created_utc": 1750196062.0,
                  "replies": [
                    {
                      "id": "myc8uoy",
                      "author": "ROARfeo",
                      "body": "Uuh it's hurting my brain lol",
                      "score": 1,
                      "created_utc": 1750196437.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mxjva9q",
          "author": "sorrylilsis",
          "body": "Eh typos are a thing. Some of the best journalists I've ever worked with would produce error ladden texts every single time. \n\nThat's why we (usually) have spellcheckers in house. The added value in a good journalist is not the perfect spelling. \n\nThat said Thomas Ricker is one of the worst people I've seen write about bikes in general. It's depressing.",
          "score": 7,
          "created_utc": 1749817548.0,
          "replies": []
        },
        {
          "id": "mxurozo",
          "author": "grammar_nazi_zombie",
          "body": "Hey maybe they snapped the frame on each of them and had fewer problems welding the newer model back together?",
          "score": 1,
          "created_utc": 1749959354.0,
          "replies": []
        },
        {
          "id": "mxit26e",
          "author": "unematti",
          "body": "I believe the writer thinks he is correct. It does \"break\" your speed, doesn't it? Lol",
          "score": -10,
          "created_utc": 1749797634.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mxite0b",
      "author": "unematti",
      "body": "\"the new suspension seatpost... Works on older vanmoofs\" that's used to be standard. 3 sizes of standard pipes, work in all bikes. Even bike shops can give you an adapter. People are really brainwashed, where this is a feature.",
      "score": 56,
      "created_utc": 1749797816.0,
      "replies": [
        {
          "id": "mxt1a5t",
          "author": "Fit_Temporary3923",
          "body": "Hiii\nCould u draw my attention toward a seat post which matches the style of the bike instead of the one Vanmoof is selling?",
          "score": 3,
          "created_utc": 1749936152.0,
          "replies": [
            {
              "id": "mxvs5ad",
              "author": "Beekatiebee",
              "body": "I think the closest you’re going to get is the Ergon CF Allroad Pro. It’s a very sleek carbon leaf spring design. \n\nIt’s also like $200USD.",
              "score": 1,
              "created_utc": 1749979053.0,
              "replies": [
                {
                  "id": "mxvvxn6",
                  "author": "Fit_Temporary3923",
                  "body": "Guess I will buy vanmoofs then..",
                  "score": 2,
                  "created_utc": 1749981361.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mxpnsjo",
          "author": "ianpaschal",
          "body": "While I agree with your point, [there absolutely were (are?) more than just 3 sizes of seatpost](https://www.sheldonbrown.com/seatpost-sizes.html).",
          "score": 3,
          "created_utc": 1749891735.0,
          "replies": [
            {
              "id": "mxpopq8",
              "author": "unematti",
              "body": "Hah lol. Yeah I guess there is... Tho I see most are about 26-27mm. So it makes sense the bike shop would just get a sleeve to fit the new post, back in the day...",
              "score": 2,
              "created_utc": 1749892298.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mxipjsy",
      "author": "FoxMcClaud",
      "body": "Paywalled article",
      "score": 12,
      "created_utc": 1749795672.0,
      "replies": [
        {
          "id": "mxitvca",
          "author": "Real_Establishment56",
          "body": "Ok I fed the site to ChatGPT and this was the answer\n\nHere’s a clear summary of “VanMoof’s new S6 e‑bikes fix everything but trust” (published June 10, 2025):\n\n⸻\n\n🚲 Key Points\n\n1. Relaunch under new management\n\t•\tThe S6 and S6 Open mark VanMoof’s first e‑bike models since its 2023 bankruptcy and acquisition by McLaren Applied. They cost €3,298 and are available to pre‑order now (with an €150 refundable deposit), shipping expected in August in Europe, and rolling out to the UK and US later  ￼.\n\n2. Mission: fix past issues\n\t•\tVanMoof aims to rebuild trust by improving reliability, ride quality, and ease of repair. A three-year warranty backs that promise  ￼.\n\n3. Smooth mechanical upgrades\n\t•\tThe bikes include a fully mechanical 3-speed AutoShift hub (no electronics), bright battery indicators, modular wiring for simpler servicing, quieter audio alerts, and core VanMoof perks like the Boost button, Kick Lock, and integrated lighting  ￼.\n\n4. Custom accessories & ride comfort\n\t•\tEach bike includes a Slimlink phone mount by Peak Design, with an optional 30 mm-travel suspension seatpost (also retrofittable on older models)  ￼.\n\n5. Enhanced anti-theft protection\n\t•\tThe updated anti-theft system offers finer-grained tracking and includes a free year of recovery subscription (“bike hunter” program) that recovers or replaces stolen bikes within 14 days  ￼.\n\n6. Battery and weight details\n\t•\tBoth bikes feature a non-removable (but serviceable) 487 Wh Panasonic battery integrated into the frame. Charging from 25–100 % takes about four hours. The S6 weighs ~23.5 kg with 27.5″ wheels; the lower-step S6 Open weighs ~22.5 kg with 24″ wheels  ￼.\n\n7. Availability & support\n\t•\tLaunching in the Netherlands, Germany, France, and Belgium—with UK later—VanMoof supports these models through 250+ bike shops and 130 sales partners across 13 countries. UK and U.S. service and sales rollouts are planned  ￼.\n\n⸻\n\n🧠 Verdict\n\nThe S6 series fixes almost all past technical and usability issues, delivering a smoother, quieter, more user-friendly ride. But the central challenge remains: can VanMoof win back consumer trust, especially at a premium price point? The extended warranty, improved service structure, and strong new lineup indicate they’re making all the right moves—but time will tell.",
          "score": 5,
          "created_utc": 1749798087.0,
          "replies": [
            {
              "id": "mxlh8ie",
              "author": "ni____kita",
              "body": "I appreciated this summary!\n\nI personally don’t have an issue with AI-generated content when it’s clearly marked as such and serves a purpose.",
              "score": 9,
              "created_utc": 1749835037.0,
              "replies": []
            },
            {
              "id": "mxkmo5n",
              "author": "Nacho_Dan677",
              "body": "Wtf why are you being downvoted for posting the article from a paywalled website???",
              "score": 7,
              "created_utc": 1749826395.0,
              "replies": [
                {
                  "id": "mxkr121",
                  "author": "K4105",
                  "body": "ai",
                  "score": 5,
                  "created_utc": 1749827634.0,
                  "replies": [
                    {
                      "id": "mxkz4pp",
                      "author": "Real_Establishment56",
                      "body": "Im not AI, just helping out a fellow redditor 😕",
                      "score": 3,
                      "created_utc": 1749829901.0,
                      "replies": [
                        {
                          "id": "mxllz27",
                          "author": "Solastor",
                          "body": "\"I fed the article into ChatGPT\"\n\n\"I am not AI\"",
                          "score": -2,
                          "created_utc": 1749836347.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mxkrvdo",
                      "author": "Nacho_Dan677",
                      "body": "Fair",
                      "score": 1,
                      "created_utc": 1749827868.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mxn5ax4",
                  "author": "AccountantOver4088",
                  "body": "Because you can easily circumvent the paywall via various means without asking a language model to read it for you.",
                  "score": 0,
                  "created_utc": 1749852916.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mxj6x8m",
      "author": "SarcoZQ",
      "body": "Imagine paying over €3k for an ebike with a front wheel engine. You can get better built bikes, with better technology for less. \n\n\"But they look so nice\". Well yeah, but the custom parts, bankruptcy and looking like the second least respected\\* ebike rider don't make up for that. \n\n  \n\\*It's the manchildren on their fatbikes that take the top spot for anyone wondering.",
      "score": 45,
      "created_utc": 1749805911.0,
      "replies": [
        {
          "id": "mxjfisj",
          "author": "SllortEvac",
          "body": "Yikes, front wheel motor? There’s a reason why there’s no consumer FWD motorcycles and certainly a reason why VanMoof when bankrupt in the first place. I’ll stick to my creaky Aventon.",
          "score": 8,
          "created_utc": 1749810735.0,
          "replies": [
            {
              "id": "mxjnhi1",
              "author": "Moccasinos",
              "body": "Can you help me understand what FWD is not recommended for biking?",
              "score": 6,
              "created_utc": 1749814409.0,
              "replies": [
                {
                  "id": "mxkt598",
                  "author": "SllortEvac",
                  "body": "There’s a lot of reasons why front wheel drive didn’t catch on for motorcycles. The most damning one being that the drive train would need to be connected to the wheel that steers the bike. That takes a hell of a lot more engineering than slapping a sprocket on the back wheel and using a chain. \n\nThe power ratio issue between front and rear is very different between an e-bike and a motorcycle, so the primary problem a front wheel motor poses on an e-bike is control. Electric motors have exceptional acceleration. When that acceleration hits on the back wheel, you have more control over the bike. When it hits on the front, you have less control as that wheel will want to go the direction it’s headed, rather than being led by a different force (I.e. a different wheel that gets steered). \n\nIt’s one of those things that most people wouldn’t think about unless they spent 30 minutes on one and then 30 minutes on the other. VanMoof putting a motor on the front wheel and divorcing the electric motor from the chain drive shows they’ve spent 0 minutes on either.",
                  "score": 6,
                  "created_utc": 1749828225.0,
                  "replies": [
                    {
                      "id": "mxllkag",
                      "author": "Rhywden",
                      "body": "The newer ones have momentum meters in the pedals. There's no \"acceleration hitting the wheels\" as your natural biking motion is assisted.\n\nI've ridden VanMoof bikes (and Brompton, also with FWD) and your downsides do not exist outside your own mind, let alone reality.",
                      "score": 8,
                      "created_utc": 1749836234.0,
                      "replies": [
                        {
                          "id": "mxqvnj8",
                          "author": "proudcanadianeh",
                          "body": "So is it just a standard pedal assist ebike with a torque sensor over cadence and a front hub motor?",
                          "score": 2,
                          "created_utc": 1749911522.0,
                          "replies": [
                            {
                              "id": "mxrllpr",
                              "author": "Rhywden",
                              "body": "Both the Brompton (with cadence) and VanMoof (with torque) have a front hub and show none of the problems described above. And I've been driving both for a long time. Never had any problem with losing control, even on highest assist (and using Boost on the VM).",
                              "score": 2,
                              "created_utc": 1749919696.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mxvexcv",
                          "author": "MrOaiki",
                          "body": "I was blown away by VanMoof S3. The best way I can describe it is that while my other e-bike felt like it was helping me pedal, Vanmoof felt like it was helping me move forward while the pedaling felt ”normal”. I haven’t found any equivalence of the boost button. Setting my Bosch to ”Super” for full power just feels like I’m getting more help to pedal. It doesn’t really pull me up the hill.",
                          "score": 2,
                          "created_utc": 1749971150.0,
                          "replies": []
                        },
                        {
                          "id": "mxsz9o4",
                          "author": "iwanderlostandfound",
                          "body": "Yeah I got 5k miles on my VanMoof and it rides great. Never had any sense of not being in control.",
                          "score": 1,
                          "created_utc": 1749935492.0,
                          "replies": [
                            {
                              "id": "mxwsc5g",
                              "author": "tkl-reader",
                              "body": "Exactly. I am at over 6000km with my S3 and never had any issues with the motor in the front. Actually love to have an all wheel drive.",
                              "score": 1,
                              "created_utc": 1749996259.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mxvdx1o",
                      "author": "MrOaiki",
                      "body": "I really enjoyed my old VanMoof S3 until it was stolen a few weeks ago. Everything you say might be true from a technical standpoint, but I haven’t found any e-bike that comes even close to the feeling of a VanMoof. My other bike (an Urban Arrow) has a motor at the crankset that helps you pedal. That feels like something is helping you pedal. The VanMoof feels more like something is slightly pushing you or pulling you while the pedaling feel ”normal”. That’s the best way I can explain it. And while it is frustrating when things break, I think engineering hard things propels innovation.",
                      "score": 1,
                      "created_utc": 1749970574.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mxll6xa",
                  "author": "Rhywden",
                  "body": "Don't listen to those guys. Plenty of ebikes out there with FWD.\n\nBrompton also has them, by the way.",
                  "score": 3,
                  "created_utc": 1749836129.0,
                  "replies": []
                },
                {
                  "id": "mxjowgk",
                  "author": "Mikerosoft925",
                  "body": "Slips out easier when turning or when quickly cycling away, in my experience",
                  "score": 2,
                  "created_utc": 1749815008.0,
                  "replies": []
                },
                {
                  "id": "mxmzg5y",
                  "author": "RamBamTyfus",
                  "body": "Not recommended goes too far, it's a feasible option.  It's generally done to ensure the rear can be fitted with a gear hub without running into space issues.  \n  \nBut it does have some drawbacks:  \n  \n1. It feels like you are being pulled, a rear wheel engine feels like being pushed which is a more natural feeling, as that is similar to having the wind in your back.\n  \n2. Higher chance of slip in corners, which can make you lose grip in turns and fall, especially on wet roads. \n  \n3. More vibrations in the front make for a less comfortable ride.  \n  \n4. Worse EMC behavior and some efficiency losses as there need to be long motor cables running through your frame.  \n  \n  \nSome advantages these front/rear hub motors have over mid engines (Bosch et cetera) is that they are quiet, cheap, look slick,  deliver power independent of the users' gear settings and can do recuperation in some cases.",
                  "score": 1,
                  "created_utc": 1749851010.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mxixnle",
      "author": "Natural-Ad-2596",
      "body": "Don’t buy this rubbish product. I was one of the first time investors, Van Moof being still a Dutch company, with a good looking product. But then all issues started, bikes were faulty, service was far below standard and you could not repair the bike at a third party, issues with parts. They received a big investment in 2021, got in trouble in 2022 and went bankrupt in 2023. Now a restart, same rubbish product.",
      "score": 18,
      "created_utc": 1749800316.0,
      "replies": [
        {
          "id": "mxj2ume",
          "author": "joeshmoe9898",
          "body": "I was an early adopter and had every headache imaginable, something like 10 service appointments and repairs in 18 months. I ended up returning it for a refund under EU buyer protection rules. That said, when it was working it was an ideal urban e-bike. I’ve owned the Veloretti Ace (also returned after immediate issues) and the Cowboy e-bike. I always preferred the van moof, but their quality control and reliability made it a non option. \n\nThis is completely new ownership and leadership, and supposedly new components focused on reliability. There’s no reason to assume it will have the same quality control issues, you can effectively treat this as a new e-bike startup that has purchased the IP and brand of a failed e-bike company. I wouldn’t be any more skeptical of this than any other new e-bike coming to market. I would still expect some “growing pains” but McLaren Applied will be trying to minimize any issues given the reputational recovery they are hoping to execute.",
          "score": 6,
          "created_utc": 1749803433.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mxj7rru",
      "author": "aitorbk",
      "body": "I used to service a friend's s2.\nShortcuts were taken.\nFront motor.  Not good.\nIntegrated battery and electronics.  Not my preference, both good and bad.  But it made third party repair non viable for the electric part.\nOld school bottom bracket.Square for an expensive bike?\nCrap pedals.  Yes, everyone changes brake pedals in expensive bikes, but these were really placeholders, plastic BSO quality. She wore them out completely to a dangerous state in under 1000km.\nGear system.  The S2 was reliable but bad. The S3 was.. appalling.\nAn enviolo hub would have fixed the issue.\n\nThen of course, all the non standard parts.\n\nFinally, the authentication servers...\n\nI hope the best for them, particularly they should just use more standard parts.\n\nI had a look, £120 for a S5 bottom bracket.  It is a square taper with a strain gauge for the torque sensing.  I am gonna pass.",
      "score": 4,
      "created_utc": 1749806424.0,
      "replies": [
        {
          "id": "my2aizh",
          "author": "pppjurac",
          "body": "> I had a look, £120 for a S5 bottom bracket. It is a square taper with a strain gauge for the torque sensing. I am gonna pass.\n\n\"Look at that crap of engineering marvel produced by turds at VanMoo. Expect nothing but finest mechanical and design bullshit the only equivalent is BB90 Trek bottom bracket. \n\nRevieved by Hamooo, aged 4 and half. \"",
          "score": 2,
          "created_utc": 1750073621.0,
          "replies": [
            {
              "id": "my3hlc4",
              "author": "aitorbk",
              "body": "Cmon, say at least aged 5 like the horijinal.\nI don't think it is terrible, I just find it proprietary and expensive.\nI will go now to get my hair cut.",
              "score": 1,
              "created_utc": 1750088196.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mxiqh86",
      "author": "tignasse",
      "body": "I thought the brand died years ago ?",
      "score": 8,
      "created_utc": 1749796188.0,
      "replies": [
        {
          "id": "mxiwoy2",
          "author": "tj-horner",
          "body": "The brand was bought by McLaren Applied after bankruptcy",
          "score": 7,
          "created_utc": 1749799738.0,
          "replies": [
            {
              "id": "mxj5tsn",
              "author": "tignasse",
              "body": "oh okay, thank you for ur answer, I didnt know that.",
              "score": 2,
              "created_utc": 1749805243.0,
              "replies": [
                {
                  "id": "mxjmon5",
                  "author": "BJozi",
                  "body": "It's in the article, first sentence.",
                  "score": 0,
                  "created_utc": 1749814060.0,
                  "replies": [
                    {
                      "id": "mxjsgzf",
                      "author": "tignasse",
                      "body": "Yeah yeah I've seen that later :)",
                      "score": 1,
                      "created_utc": 1749816455.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mxj7xou",
      "author": "hotweiss",
      "body": "Minus the motor being in the wheel, which will fail...",
      "score": 1,
      "created_utc": 1749806523.0,
      "replies": []
    },
    {
      "id": "mxjac1h",
      "author": "notyourvader",
      "body": "Warranty means jack shit if they fold again in a year or so. VanMoof was a company operating on a vendor lock-in businessplan, selling you a nice looking design, but all the parts unique, meaning you could only get them at VanMoof. \n\nOver € 3.000 for a front-engine ebike is ridiculous, so it's apparently still a businessplan of extracting every Euro from their customers for mediocre products. \n\nJust a comparison: Bixbi sells a rear engine 100km range ebike with built-in GPS tracking for € 1.000 less.",
      "score": 1,
      "created_utc": 1749807930.0,
      "replies": []
    },
    {
      "id": "mxjh4ra",
      "author": "Medium_Banana4074",
      "body": "They still don't have any suspension and are still built of lots of non-standard parts. And rely on an app. Also potentially dangerous front-wheel drive.  \nAll complete no-go's for me.",
      "score": 1,
      "created_utc": 1749811538.0,
      "replies": []
    },
    {
      "id": "mxjpf2b",
      "author": "llehsadam",
      "body": "With the mess their bankruptcy caused for clients, Van Moof demonstrated how not to make bicycles. The moment they shut down, a lot of the features you paid a big premium for were gone, in some scenarios the bike was even useless.\n\nA bike is a symbol of freedom, not just because it easily brings you from point A to point B, but also because it is a universal machine that is easy to fix. They screwed up the first part through server/cloud-software dependencies and the second part through proprietary parts.",
      "score": 1,
      "created_utc": 1749815222.0,
      "replies": []
    },
    {
      "id": "mxjrhvi",
      "author": "SERVEDwellButNoTips",
      "body": "VanMoof Milker",
      "score": 1,
      "created_utc": 1749816062.0,
      "replies": []
    },
    {
      "id": "myungf7",
      "author": "southcookexplore",
      "body": "My S3 has been useless for a few years after maybe six weeks of use. This company is miserable to deal with.",
      "score": 1,
      "created_utc": 1750442213.0,
      "replies": []
    },
    {
      "id": "mxjukoo",
      "author": "mf-TOM-HANK",
      "body": "The biggest problem with e bikes is that they go just about as fast as the old 2 cycle mopeds but now they're so widely available that every 10 year old kid has access to them.  So you have kids who are not particularly well equipped for good decision making on public roads at speeds that will inevitably be a substantial problem for local authorities",
      "score": 1,
      "created_utc": 1749817275.0,
      "replies": []
    },
    {
      "id": "mxip5jv",
      "author": "R-K-Tekt",
      "body": "A $3,300 electric bike, for fucks sake we have just gotten used to paying ridiculous prices for things haven’t we.\n\nEdit: I understand ‘that’s just the price’ and because I’m not an e-bike enthusiast I just don’t really get it.",
      "score": -12,
      "created_utc": 1749795456.0,
      "replies": [
        {
          "id": "mxiqg9n",
          "author": "drmanhattanmar",
          "body": "That’s a normal price for an e-bike and pretty „cheap“ too. I mean: It’s a lot of money, I know that. But here in Germany this is also a rather mild price. Most of the E-Bikes in the stores range around that pricing. There are of course some for, let’s say, 2.500€ but they’re normally small, just tiny city bikes. If you want a bigger bike with more battery capacity or more features you easily pay around 4-5.000€",
          "score": 7,
          "created_utc": 1749796174.0,
          "replies": [
            {
              "id": "mxiwwbe",
              "author": "Pluckytoon",
              "body": "There’s 500 bucks e-bikes, but they really can’t be compared to how high-end ones feel. Top quality e-bikes really is a unique cycling experience, esp on distance trips",
              "score": 2,
              "created_utc": 1749799863.0,
              "replies": [
                {
                  "id": "mxj0jlt",
                  "author": "drmanhattanmar",
                  "body": "I have a Cube E-Bike, 800Wh battery, mudguards, front and rear lights including a brake light, preparation for pannier rack or saddlebags, large brake discs... the whole thing for 3500€ is really good. You can easily pay more for other manufacturers (Riese&Müller, Haibike etc.).",
                  "score": 2,
                  "created_utc": 1749802056.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mxir8ce",
          "author": "MaximumManagement",
          "body": "Ebikes are available in a wide range of prices.  Anywhere from $400-$6000 is plausible.",
          "score": 3,
          "created_utc": 1749796611.0,
          "replies": []
        },
        {
          "id": "mxiqyli",
          "author": "stahpstaring",
          "body": "Lol? That’s cheap for this kind of bike actually.\n\nMy NORMAL bike was this much.",
          "score": 1,
          "created_utc": 1749796459.0,
          "replies": [
            {
              "id": "mxivkdp",
              "author": "DaveTheGay",
              "body": "\"Normal\"? I think the word you're looking for is \"acoustic\".",
              "score": 5,
              "created_utc": 1749799077.0,
              "replies": []
            },
            {
              "id": "mxitdes",
              "author": "ILikeEverybodyEvenU",
              "body": "It's not cheap lol Especially if you look at specs, you pay premium for design",
              "score": -1,
              "created_utc": 1749797807.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mxipk2w",
          "author": "spdorsey",
          "body": "That's cheap for an E bike!",
          "score": 0,
          "created_utc": 1749795677.0,
          "replies": [
            {
              "id": "mxisi1k",
              "author": "OverSoft",
              "body": "No, it’s not. You can get e-bikes for a third of that price. It’s in the upper part of the spectrum for normal road bikes.",
              "score": -1,
              "created_utc": 1749797321.0,
              "replies": [
                {
                  "id": "mxismv4",
                  "author": "spdorsey",
                  "body": "Not ones worth having. Cheap e-bikes are crap. Many bike shops won't fix them. They are disposable and a waste of money and materials. Yuck!",
                  "score": 3,
                  "created_utc": 1749797396.0,
                  "replies": [
                    {
                      "id": "mxiunko",
                      "author": "OverSoft",
                      "body": "LOL, VanMoof is famous for being unfixable with proprietary parts that only VanMoof can fix.\n\nA simple thousand euro Decathlon e-bike can be fixed in any shop and is good quality.",
                      "score": 3,
                      "created_utc": 1749798540.0,
                      "replies": []
                    },
                    {
                      "id": "mxitkcf",
                      "author": "unematti",
                      "body": "Many bike shops sell them. Those will also fix them. If course shops won't bother with it if they didn't sell it to you, unless they got nothing else going on",
                      "score": 1,
                      "created_utc": 1749797915.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mxmhheb",
                  "author": "IHkumicho",
                  "body": "This is just about all wrong. You can't get a decent ebike in Europe for $1k. They have anti-dumping laws so no bikes can really be made in China, so you're talking higher manufacturers costs compared to ones you can buy in the US. They're also sold through bike shops, which have higher margins than internet sales here. The entry level Trek Verve+ is 1850£, or $2,500 in the UK, for example.\n\n$3k also isn't anywhere near the \"upper part of the spectrum\" for road bikes, either. You can't even get the base level carbon road bike from Trek for that price.",
                  "score": 0,
                  "created_utc": 1749845563.0,
                  "replies": [
                    {
                      "id": "mxndowe",
                      "author": "OverSoft",
                      "body": "Yes you can. Stop spouting this bullshit.\n\nYou can get a decent, repairable e-bike for less than a €1000.\n\nhttps://www.bol.com/nl/nl/p/hillmiles-milecity-1-elektrische-fiets-actieradius-80km-verwijderbare-batterij-48v13ah-motor-250w-shimano-7-versnellingen-26-inch-city-commuter-ebike-grijs/9300000198767058/?cid=1749855740851-1401620626931&bltgh=ib6Gepx4guzUQl0lf2ZIdw.4_38.39.ProductImage (€599)\n\nhttps://www.matrabike.nl/product/7438/stokvis-e-trento-s7-a-360-wh (€899)\n\nhttps://www.bol.com/nl/nl/p/amigo-e-faro-s2-elektrische-fiets-e-bike-28-inch-herenfiets-53-cm-7-versnellingen-rollerbrake-536-wh-accu-matzwart/9300000231315617/?bltgh=jh5qiRvZdGP7EF-eZ1ZMwQ.4_8.9.ProductImage (€999)\n\nAnd are you fucking seriously comparing a carbon fiber bike with cheap e-bikes? Fuck right off.",
                      "score": 1,
                      "created_utc": 1749855805.0,
                      "replies": [
                        {
                          "id": "mxqvfhi",
                          "author": "IHkumicho",
                          "body": "Aaaaahahahaahaha. Thanks for proving my point with those links. Those are the shittiest pieces of garbage that I'd hesitate to even call a \"bicycle\" let alone actually trust to get me from point A to point B. Rack mounted battery?? Shimano Tourney? **V-brakes**??? Lol....\n\nPlus, I specifically mentioned that VanMoof is going to be more expensive than an internet-shipped bike. So what do you do? Post a bunch of links to internet-only brands.\n\nAs for the road bike, you said $3,000 was in the upper limits of road bikes which is.... demonstrably false. Go back and reread everything you wrote, then I wrote.\n\nSeriously.",
                          "score": 0,
                          "created_utc": 1749911450.0,
                          "replies": [
                            {
                              "id": "mxrmxuj",
                              "author": "OverSoft",
                              "body": "Half of the Netherlands rides those bikes and they’re fine. Get off of your high horse man…\nMatra is sold in normal bike shops, you don’t have a fucking clue what you’re talking about.\n\nIn the upper part is not a $3k limit. Learn how to fucking read man.",
                              "score": 1,
                              "created_utc": 1749920111.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}