{
  "post": {
    "title": "Switch 2 could make Joy-Con drift a thing of the past as Hall effect stick leaks gain credibility ",
    "author": "a_Ninja_b0y",
    "id": "1i5qkmv",
    "score": 6789,
    "created_utc": 1737381072.0,
    "selftext": "",
    "num_comments": 528,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i5qkmv/switch_2_could_make_joycon_drift_a_thing_of_the/"
  },
  "comments": [
    {
      "id": "m85r99o",
      "author": "TheSlothOfSteel",
      "body": "I'll believe it when I see it",
      "score": 2452,
      "created_utc": 1737381227.0,
      "replies": [
        {
          "id": "m85u011",
          "author": "Specialist-Rope-9760",
          "body": "It’s possible. Nintendo would have been close to a class action on the last joycons and did their best to ignore it\n\nSame as ASUS did with their original Rog Ally destroying itself. Ignore the issue and pretend it doesn’t exist to avoid liability then quietly reengineer a fix for the next version",
          "score": 986,
          "created_utc": 1737382231.0,
          "replies": [
            {
              "id": "m85ujnu",
              "author": "iwantcookie258",
              "body": "Didn't Nintendo let you send in Joycons with drift for free repair? Or do you just mean more that they never fixed them in the design for the lifetime of the switch",
              "score": 346,
              "created_utc": 1737382427.0,
              "replies": [
                {
                  "id": "m85v8y8",
                  "author": "starcoder",
                  "body": "They did, which was just enough to avoid the lawsuit iirc. You still had to pay for shipping, and it took something like 4-6 weeks to get them back.",
                  "score": 436,
                  "created_utc": 1737382675.0,
                  "replies": [
                    {
                      "id": "m85w96l",
                      "author": "themaninthehightower",
                      "body": "When a company inadvertently caused a generation of 10-year olds to discuss the Hall effect, it's a good sign that that company has to fix it with the following model.",
                      "score": 314,
                      "created_utc": 1737383030.0,
                      "replies": [
                        {
                          "id": "m87111q",
                          "author": "audigex",
                          "body": "I've been a gamer for nearly 30 years and had never experienced stick drift before the Switch, so even for us older folk it brought stick drift and hall effect sticks into the conversation",
                          "score": 129,
                          "created_utc": 1737394900.0,
                          "replies": [
                            {
                              "id": "m878vuc",
                              "author": "-Memnarch-",
                              "body": "N64 Controllers. You can only play so many games of Mario Party before it deconstructs itself. But with the OG XBox it felt like a thing fo the past.",
                              "score": 50,
                              "created_utc": 1737396982.0,
                              "replies": [
                                {
                                  "id": "m87owkv",
                                  "author": "audigex",
                                  "body": "That isn’t stick drift, the stick itself just became loose\n\nAlthough I still have two of my OG N64 controllers so I think that’s a bit overblown",
                                  "score": 42,
                                  "created_utc": 1737401278.0,
                                  "replies": [
                                    {
                                      "id": "m87y4s3",
                                      "author": "Rok-SFG",
                                      "body": "I knew people who gave themselves blisters on their palms playing n64 mario party. They'd push down and turn the stick as fast as they could with their palm/hand instead of using their thumbs. \n\nThose are the type of people that complain that n64 controllers aren't good.",
                                      "score": 27,
                                      "created_utc": 1737403793.0,
                                      "replies": [
                                        {
                                          "id": "m88cm3c",
                                          "author": "SuperMcRad",
                                          "body": "How dare you insult my technique!",
                                          "score": 8,
                                          "created_utc": 1737407678.0,
                                          "replies": []
                                        },
                                        {
                                          "id": "m88pxs5",
                                          "author": "punktual",
                                          "body": "> They'd push down and turn the stick as fast as they could with their palm/hand instead of using their thumbs. \n\nI see you lost at Mario Party a lot...\nWinners had palm blisters!",
                                          "score": 24,
                                          "created_utc": 1737411257.0,
                                          "replies": [
                                            {
                                              "id": "m8cltw5",
                                              "author": "Jamooser",
                                              "body": "Dude, if your parents weren't asking you why your palms were absolutely shredded, the  you didn't play Mario Party!",
                                              "score": 2,
                                              "created_utc": 1737468625.0,
                                              "replies": []
                                            },
                                            {
                                              "id": "m8bpldc",
                                              "author": "alidan",
                                              "body": "if you flex your thumb, press your thumb into your pointer and push, the right hand is nearly twice the size of my left, and I credit a lot of that to mario party, this isn't track and field where a ruler was needed, granted I always held the controller by the sides so my positioning of the controller was worlds better than people who gripped the center.",
                                              "score": 1,
                                              "created_utc": 1737453468.0,
                                              "replies": []
                                            }
                                          ]
                                        },
                                        {
                                          "id": "m88e06i",
                                          "author": "audigex",
                                          "body": "Ah yeah there was that specific stupid mechanic with that game\n\nI never really played it, so that’s probably why I never murdered an N64 controller",
                                          "score": 1,
                                          "created_utc": 1737408045.0,
                                          "replies": [
                                            {
                                              "id": "m8akxtp",
                                              "author": "thjth",
                                              "body": "I tore little bloody circles in my palms that became raw because the need for dominance was so great in Mario Party. We would eventually reach a point where we had to quit and let let the skin regrow. It’s really bizarre looking back on it.",
                                              "score": 1,
                                              "created_utc": 1737432420.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "m8ana54",
                                      "author": "Kepabar",
                                      "body": "The hell it's overblown. I remember two of my five controllers becoming unusable with their joysticks just laying on the side of the pit.\n\nLikely yours didn't get played enough. Mine got played daily, often in 4 player games.",
                                      "score": 1,
                                      "created_utc": 1737433294.0,
                                      "replies": [
                                        {
                                          "id": "m8bpr84",
                                          "author": "alidan",
                                          "body": "my player 1 controller was the same till the day I retired the n64, and that thing was my best friend up till I got a pc and roller coaster tycoon. \n\nGRANTED the damn thing is no longer center but its still a useable controller.",
                                          "score": 1,
                                          "created_utc": 1737453570.0,
                                          "replies": []
                                        },
                                        {
                                          "id": "m8bsrgc",
                                          "author": "audigex",
                                          "body": "Did you play Mario party? That seems to be the game that murdered the joysticks",
                                          "score": 1,
                                          "created_utc": 1737455422.0,
                                          "replies": [
                                            {
                                              "id": "m8da6e7",
                                              "author": "Kepabar",
                                              "body": "Not in the N64 age I don't think. \n\nGoldeneye, Mario Kart, Smash Brothers were the big multiplayer ones.\n\nGoldeneye I would have people pay me to unlock cheats on their cart, so a lot of hours playing that solo as well.",
                                              "score": 1,
                                              "created_utc": 1737476084.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "m87o4j8",
                                  "author": "JoeyBigtimes",
                                  "body": "Not anywhere near the same thing. The N64’s stick used optical encoders for the analog input. It was the plastic on plastic grinding that eventually made the sticks loose, the optical encoders still worked fine. No other console has used this technology.",
                                  "score": 22,
                                  "created_utc": 1737401064.0,
                                  "replies": []
                                },
                                {
                                  "id": "m87z1h2",
                                  "author": "nullstring",
                                  "body": "And all of mine are still working from the 90s and like most kids I was not gentle with them.\n\nI think you're conflating the issue. Stick drift became a thing almost instantly. It wasn't until years and years later that people started having issues with N64 controllers.",
                                  "score": 4,
                                  "created_utc": 1737404045.0,
                                  "replies": []
                                },
                                {
                                  "id": "m88akvx",
                                  "author": "SirLocke13",
                                  "body": "We all know the one Mario Party 2 Mini-Game...the Tug-of-War...\n\nAs soon as the mini-game got picked, you assume the position.\n\nPalm ready.",
                                  "score": 1,
                                  "created_utc": 1737407141.0,
                                  "replies": []
                                },
                                {
                                  "id": "m88x0pd",
                                  "author": "Hatweed",
                                  "body": "N64 sticks got loose, but there was never any drift. My old controllers still don’t do that.",
                                  "score": 1,
                                  "created_utc": 1737413274.0,
                                  "replies": []
                                },
                                {
                                  "id": "m89b5fp",
                                  "author": "FireLucid",
                                  "body": "After I heard that I never purchased a Mario Party game despite owning an N64 and each console released afterwards. Finally broke the streak with Jamboree for the kids.",
                                  "score": 1,
                                  "created_utc": 1737417620.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m87ancg",
                              "author": "GuardiaNIsBae",
                              "body": "Yep, ps2, Xbox, 360, GameCube, Wii nunchuck/pro controller, Wii U. Never had a single problem with the sticks on any of them. I still use my OG 360 wired controller on PC. had a switch for like 3 weeks and the joycon got stick drift, sent it in for repair, came back and month later got stick drift again. Bought a second set assuming I just got unlucky the first time and within 2 months stick drift again. My friends had Xbone and PS4 controllers and I don’t remember any of them complaining about the sticks (a few have mentioned the buttons and triggers breaking easily on the Xbox controllers)",
                              "score": 4,
                              "created_utc": 1737397452.0,
                              "replies": [
                                {
                                  "id": "m88omiu",
                                  "author": "HeftyArgument",
                                  "body": "Either you’re unlucky or I’m lucky; I don’t have drift on my 5 year old joy cons that came with the switch.",
                                  "score": 3,
                                  "created_utc": 1737410897.0,
                                  "replies": [
                                    {
                                      "id": "m8bslcw",
                                      "author": "DinoHunter064",
                                      "body": "Joycon stick drift has been a major issue that's been widely reported for years now. I think it's safe to say you're very lucky.",
                                      "score": 2,
                                      "created_utc": 1737455318.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "m88rds5",
                                      "author": "GuardiaNIsBae",
                                      "body": "I think you're lucky lol, I do admit I was probably rougher on them than I should've been but also they break super easy, most of my friends who still play on switch dropped the joycons altogether after a few replacements and just went with pro controllers or the adapter to use Xbox controllers with it",
                                      "score": 3,
                                      "created_utc": 1737411662.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m89dyii",
                              "author": "Goddamn_Grongigas",
                              "body": "Every controller I have ever owned since the PS1 controller with analog sticks developed drift except the Duke xbox controller and the newest Xbox controller. And funny enough, my launch Switch joycons do not drift. But my kids' Lites do. YMMV\n\n  Gamecube sticks were some of the worst with it.",
                              "score": 2,
                              "created_utc": 1737418508.0,
                              "replies": [
                                {
                                  "id": "m89gqgl",
                                  "author": "audigex",
                                  "body": "I've got no idea what we're doing differently\n\nIn my house right now I have the original controllers for my N64, PS1-PS4, PSP, and Switch\n\nPlus a couple of Xbox 360 controllers (not my originals, but they didn't die due to stick drift), a knock-off 360 controller used for my PC, an 8bitdo controller, Steam Deck, and Retroid Pocket 4\n\nThe only one of that list to have ever had analog stick problems for me is the switch, plus one knock-off controller for the PS1 or PS2 (I'm pretty sure PS2) that I threw away at the time",
                                  "score": 3,
                                  "created_utc": 1737419372.0,
                                  "replies": [
                                    {
                                      "id": "m8afodn",
                                      "author": "Goddamn_Grongigas",
                                      "body": "It's a crapshoot. The reason why we hear so much about controller drift now is because of internet forums. Fact of the matter is there has never been enough of this happening to really put a dent in anything, it just seems like a lot because of loud echochambers in places like reddit we frequent.\n\n  Hell, sticks on arcades even fail after too much use/being too rough with them. But it really isn't as widespread as people here claim.",
                                      "score": 0,
                                      "created_utc": 1737430572.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m877bxl",
                              "author": "sprinklerarms",
                              "body": "I haven’t experienced it on the switch but constantly with Xbox controllers. Which sucks because I prefer their shape but I gave up on them.",
                              "score": 3,
                              "created_utc": 1737396563.0,
                              "replies": []
                            },
                            {
                              "id": "m898tvl",
                              "author": "I_am_darkness",
                              "body": "This dude doesn't n64",
                              "score": 1,
                              "created_utc": 1737416880.0,
                              "replies": [
                                {
                                  "id": "m89cahq",
                                  "author": "audigex",
                                  "body": "On the contrary I still have my original N64 from the mid-1990s, it's literally 4ft from me as I type this\n\nI just happened not to play the games that really destroy them, apparently... plus I tend not to be super rough with my electronics",
                                  "score": 0,
                                  "created_utc": 1737417982.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m8b6e2c",
                              "author": "ThenIcouldsee",
                              "body": "Imagine nes controller drift..",
                              "score": 1,
                              "created_utc": 1737441996.0,
                              "replies": []
                            },
                            {
                              "id": "mehgo68",
                              "author": "Jealous_Wafer7777",
                              "body": "40 years old and experienced stick drift on PS4 and PS5 but like not as bad as the switch. At least on a PS4 or PS5 controller like 2.5 to 3 years down the line. Swtich 1 year junk. 30 minutes for me to replace 6 joysticks on the switch with lighter play...The thing pisses me off so bad that when I do out of town work I take the 3DS instead...",
                              "score": 1,
                              "created_utc": 1740383264.0,
                              "replies": []
                            },
                            {
                              "id": "m879xrx",
                              "author": "AnInfiniteArc",
                              "body": "I think I’ve gotten lucky. To this day I’ve only ever had stick drift on my Amazon Basics Xbox gamepad (which was otherwise a very good gamepad). The only issue I’ve had with my joycons has been the buttons sticking for not apparent reason (no spills or whatnot).",
                              "score": 0,
                              "created_utc": 1737397264.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m866j13",
                          "author": "GoneSuddenly",
                          "body": "When a noname chinese company release a fix and started a trend for \"new\" product. Lmao",
                          "score": 7,
                          "created_utc": 1737386341.0,
                          "replies": [
                            {
                              "id": "m872j3t",
                              "author": "elMurpherino",
                              "body": "Gulikit? lol two of my pairs of joy cons have their replacement sticks in them still going strong.",
                              "score": 2,
                              "created_utc": 1737395298.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m88t3f1",
                          "author": "betelgeuse_boom_boom",
                          "body": "Especially if it's the same company that introduced hall effect joysticks in consoles with N64.\n\nI don't understand how they missed the mark in the switch.",
                          "score": 1,
                          "created_utc": 1737412153.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m86bhma",
                      "author": "Jose_Canseco_Jr",
                      "body": "I didn't pay for shipping, and it was less than two weeks for me - but I can accept my experience wasn't everyone's",
                      "score": 20,
                      "created_utc": 1737387796.0,
                      "replies": [
                        {
                          "id": "m86fu70",
                          "author": "None",
                          "body": "[removed]",
                          "score": 15,
                          "created_utc": 1737389041.0,
                          "replies": [
                            {
                              "id": "m86n17d",
                              "author": "Jose_Canseco_Jr",
                              "body": "speaking of - im getting some drift again... are they still doing this?",
                              "score": 5,
                              "created_utc": 1737391063.0,
                              "replies": [
                                {
                                  "id": "m86vw3u",
                                  "author": "tricheb0ars",
                                  "body": "They are",
                                  "score": 9,
                                  "created_utc": 1737393507.0,
                                  "replies": [
                                    {
                                      "id": "m870zja",
                                      "author": "Jose_Canseco_Jr",
                                      "body": "thanks! shall look into it",
                                      "score": 3,
                                      "created_utc": 1737394889.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m86835x",
                      "author": "goozy1",
                      "body": "Shipping was free, at least in Canada. I sent 4 joy cons for the repair. The turnaround time was less than a week.",
                      "score": 14,
                      "created_utc": 1737386802.0,
                      "replies": [
                        {
                          "id": "m86pp48",
                          "author": "Xiknail",
                          "body": "Same to both in Germany.",
                          "score": 6,
                          "created_utc": 1737391806.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m868c3n",
                      "author": "HuskyLemons",
                      "body": "I’m in the US. I had mine repaired last year, on a switch that I didn’t buy and that was several years old. Nintendo emailed me a free shipping label, and I had the repaired joycons back within 10 days of shipping them out. Totally free and no hassle",
                      "score": 25,
                      "created_utc": 1737386876.0,
                      "replies": [
                        {
                          "id": "m8b7f69",
                          "author": "stellvia2016",
                          "body": "Did they actually send you the same ones back, or simply cross-ship refurbed ones of the same color?",
                          "score": 1,
                          "created_utc": 1737442541.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m85w6c1",
                      "author": "Voxbury",
                      "body": "And during those 4-6 weeks you’re at least somewhat likely, they figure, to buy a spare set to use until yours come back. Wins for Nintendo all around.",
                      "score": 44,
                      "created_utc": 1737383002.0,
                      "replies": [
                        {
                          "id": "m86ffgf",
                          "author": "tricheb0ars",
                          "body": "I got my joy con pairs repaired twice and they were gone for about one week each time. Did you have this experience where they are gone for 4-6 weeks or are you just parroting something you heard?",
                          "score": 15,
                          "created_utc": 1737388925.0,
                          "replies": [
                            {
                              "id": "m86zktu",
                              "author": "getdowngoblins",
                              "body": "Mine also had a very quick turnaround- I sent them in for repair 3 times, and they were back within a week",
                              "score": 9,
                              "created_utc": 1737394514.0,
                              "replies": [
                                {
                                  "id": "m885ibf",
                                  "author": "The_Answer_Man",
                                  "body": "5 pairs sent out at this point, maybe 1 took close to 2 weeks. The rest were all a week or so. No cost anytime either, Nintendo paid for and sent shipping labels",
                                  "score": 7,
                                  "created_utc": 1737405808.0,
                                  "replies": [
                                    {
                                      "id": "m8b7mc3",
                                      "author": "stellvia2016",
                                      "body": "Why didn't you just buy 3rd party controllers then at that point instead of buying more sets?\n\n8bitdo makes quality 3rd party ones for a reasonable price, or they have a BT dongle that lets you sync PS5 and Xbox controllers to the Switch as well.",
                                      "score": 1,
                                      "created_utc": 1737442649.0,
                                      "replies": [
                                        {
                                          "id": "m8bix3q",
                                          "author": "The_Answer_Man",
                                          "body": "I have 3 non-nintendo pro controllers, 1 legit pro controller, 2 sets of Nyxi controllers...5 players in the house gets a bit demanding for controllers haha",
                                          "score": 1,
                                          "created_utc": 1737449282.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m886tcw",
                              "author": "CantFindMyWallet",
                              "body": "You know the answer.",
                              "score": 1,
                              "created_utc": 1737406155.0,
                              "replies": []
                            },
                            {
                              "id": "m86l3mh",
                              "author": "starcoder",
                              "body": "I am speaking from past experience with my pile of unusable joycons. Probably back when they finally started doing it – because they were faced with a massive lawsuit. It wasn’t even worth my time then. I just bought contact cleaner, canned air, tools, and learned how to take them apart and clean them myself. Weeks of wait and paying for shipping was why I didn’t do it. It honestly was better for me at the time to just spend a few bucks on Amazon and a Saturday afternoon than bother with it – it didn’t ever fix the problem, but it helped for a short time. \n\nMy experience was a while ago – bottom line is that it wasn’t even worth it at that point. They were denying that it was a problem right up until they started the offer to fix them.",
                              "score": -4,
                              "created_utc": 1737390525.0,
                              "replies": [
                                {
                                  "id": "m880py3",
                                  "author": "mylanscott",
                                  "body": "The shipping is free, and it doesn’t take weeks.",
                                  "score": 2,
                                  "created_utc": 1737404509.0,
                                  "replies": []
                                },
                                {
                                  "id": "m86mbif",
                                  "author": "tricheb0ars",
                                  "body": "I’ve gotten my joycons replaced twice. You can get them replaced. I did this first time like 5 years ago. \n\nIt’s super easy and free to get them replaced. Why haven’t you?\n\nThe time it took me to fill out the paperwork to get them fixed was like 2 minutes each time. They send a box and I put them in them and done.\n\nLiterally taking the joycons apart is 10x the effort. You make no sense at all",
                                  "score": 2,
                                  "created_utc": 1737390866.0,
                                  "replies": [
                                    {
                                      "id": "m86tyje",
                                      "author": "Decent_Commercial381",
                                      "body": "The problem is you had to get them replaced twice and the likely scenario is they will start drifting again anyway? You just gonna mail them back and forth forever?",
                                      "score": 0,
                                      "created_utc": 1737392976.0,
                                      "replies": [
                                        {
                                          "id": "m86vokh",
                                          "author": "tricheb0ars",
                                          "body": "It’s free. I have to do it once maybe every 4 years or so? \n\nMy Xbox controllers and PS5 controllers break and there is no free repair. I have a lot more broken controllers than I have joycons that’s for sure. \n\nAre you going to pretend Xbox and ps5 don’t have drift too? \n\nCome on.",
                                          "score": 5,
                                          "created_utc": 1737393450.0,
                                          "replies": [
                                            {
                                              "id": "m86w79g",
                                              "author": "Decent_Commercial381",
                                              "body": "I am. Every switch controller I have experiences drift like clockwork and my other controllers do not. I have never needed to repair a PS4 controller",
                                              "score": 0,
                                              "created_utc": 1737393591.0,
                                              "replies": [
                                                {
                                                  "id": "m87ifvv",
                                                  "author": "tricheb0ars",
                                                  "body": "Bullshit. Then the hours aren’t the same. \n\nXbox and PS5 are known to have the exact same issues yet don’t have a repair program. \n\nYour single experience means fucking nothing anyway. A simple google search will result tons of results about drifting Xbox and PS5 controllers. Don’t believe me? Google it yourself",
                                                  "score": 2,
                                                  "created_utc": 1737399522.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "m86s9y8",
                                  "author": "madartist2670",
                                  "body": "Skill issue, you can buy replacement sticks for like 10 dollars and fix them yourself",
                                  "score": -2,
                                  "created_utc": 1737392509.0,
                                  "replies": [
                                    {
                                      "id": "m86umpo",
                                      "author": "starcoder",
                                      "body": "I didn’t go as far as that. But you’re definitely right about that opinion.",
                                      "score": 0,
                                      "created_utc": 1737393161.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m8pza3y",
                              "author": "Voxbury",
                              "body": "I’m going on what their official quoted time was when they started offering free repair. I’m glad that time was super conservative but I know people who waited longer than 1 week turnaround, yes.",
                              "score": 0,
                              "created_utc": 1737639618.0,
                              "replies": [
                                {
                                  "id": "m8q4ds0",
                                  "author": "tricheb0ars",
                                  "body": "So you’ve never done the repair yourself???  Yet you want to comment like an authority on the matter? Get the fuck outta this convo bro",
                                  "score": 1,
                                  "created_utc": 1737641378.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m88lqdy",
                          "author": "Dick_Lazer",
                          "body": "It doesn’t take anywhere close to 4-6 weeks.",
                          "score": 2,
                          "created_utc": 1737410104.0,
                          "replies": []
                        },
                        {
                          "id": "m89n99h",
                          "author": "Jonaldys",
                          "body": "Or a Reddit comment lied about wait times. That doesn't match experiences in North America.",
                          "score": 1,
                          "created_utc": 1737421413.0,
                          "replies": []
                        },
                        {
                          "id": "m867ur4",
                          "author": "ForceItDeeper",
                          "body": "fuck nintendo",
                          "score": -3,
                          "created_utc": 1737386734.0,
                          "replies": []
                        },
                        {
                          "id": "m87rrck",
                          "author": "sprucenoose",
                          "body": "Except for their costs at having tons of bad PR and a furious gamer customer base that resulted in lots of lost sales and revenue with fallout continuing to this day during the lead up to the release of its next gen console, having to pay lawyers tons of money to defend the various litigation (some of which continued into last year) and having to pay tons of money to implement the massive repair/replacement program to fix all of their millions of defective joycons, yes, maybe some folks would get bored waiting for the fixed joycons and buy another pair and wins all around for Nintendo.",
                          "score": 0,
                          "created_utc": 1737402052.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m86hx93",
                      "author": "The_Retro_Bandit",
                      "body": "At least for me in the US, nintendo covered shipping. Just like when a console is under warranty.",
                      "score": 5,
                      "created_utc": 1737389630.0,
                      "replies": []
                    },
                    {
                      "id": "m876dz9",
                      "author": "Nephyte89",
                      "body": "I have never paid for shipping to fix my joycons. They sent me UPS labels.",
                      "score": 6,
                      "created_utc": 1737396310.0,
                      "replies": []
                    },
                    {
                      "id": "m879t8y",
                      "author": "Arabiantacofarmer",
                      "body": "Ive never had to pay for shipping. Got 6 joycons repaired for free",
                      "score": 6,
                      "created_utc": 1737397230.0,
                      "replies": []
                    },
                    {
                      "id": "m87i5k8",
                      "author": "AllegroDigital",
                      "body": "I sent my joycons for repair 4 times. Didn't pay any shipping",
                      "score": 6,
                      "created_utc": 1737399444.0,
                      "replies": []
                    },
                    {
                      "id": "m85wp6n",
                      "author": "alexanderpas",
                      "body": "> You still had to pay for shipping\n\n\nOver here, they even paid for shipping with tracking, as that is an option our postal service offers.",
                      "score": 17,
                      "created_utc": 1737383182.0,
                      "replies": [
                        {
                          "id": "m86365n",
                          "author": "datspookyghost",
                          "body": "Where is \"here\"?",
                          "score": 5,
                          "created_utc": 1737385312.0,
                          "replies": [
                            {
                              "id": "m8648mo",
                              "author": "PurplePickleParadise",
                              "body": "I didn't have to pay here in Quebec.",
                              "score": 6,
                              "created_utc": 1737385646.0,
                              "replies": []
                            },
                            {
                              "id": "m866d1v",
                              "author": "alexanderpas",
                              "body": "Netherlands.\n\n\nIn the US, Business Reply Mail is the USPS variant of FreePost, and requires a specially formatted address label.\n\n\nIn the Netherlands, Our postal service (PostNL) offers FreePost as a service using a special addressing scheme, and there are no difference in requirement on the label compared to regular mail, just a different type of address, which allows anyone to send anything to those FreePost adresses. (Also known as \"Antwoordnummer\" in Dutch)\n\n\nThe Nintendo Repair Center in the Netherlands has an FreePost Address (\"Antwoordnummer\") for their incoming packages, meaning you can send the packages to them without having to pay postage. (Nintendo pays the postage instead of you)\n\n\nhttps://en.wikipedia.org/wiki/Freepost",
                              "score": 5,
                              "created_utc": 1737386291.0,
                              "replies": []
                            },
                            {
                              "id": "m86qh99",
                              "author": "Happy-go-lucky-37",
                              "body": "Well, “there”\nobviously.",
                              "score": 1,
                              "created_utc": 1737392020.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m86f7gb",
                      "author": "tricheb0ars",
                      "body": "I got my two pairs repaired twice and they were gone for like a week each time and shipping was free. \n\nYou paid for shipping?",
                      "score": 5,
                      "created_utc": 1737388862.0,
                      "replies": []
                    },
                    {
                      "id": "m86ou5p",
                      "author": "slapshots1515",
                      "body": "You don’t have to pay for shipping. I currently have two in for repair. One of which is an original launch Joy-Con.",
                      "score": 2,
                      "created_utc": 1737391568.0,
                      "replies": []
                    },
                    {
                      "id": "m88015m",
                      "author": "mylanscott",
                      "body": "I’ve done it twice this year with both my pairs of joycons, shipping label was provided and paid for by Nintendo and I got my joycons back in less than 10 days. It was incredibly fast and easy. I’m in LA, so if you’re in another country or not a major city near the service center it may take longer but it was very quick for me",
                      "score": 2,
                      "created_utc": 1737404320.0,
                      "replies": []
                    },
                    {
                      "id": "m886xki",
                      "author": "CantFindMyWallet",
                      "body": "None of this is true. They sent a shipping label, and it only took about a week to get them back.",
                      "score": 2,
                      "created_utc": 1737406186.0,
                      "replies": []
                    },
                    {
                      "id": "m88fabg",
                      "author": "libzhark",
                      "body": "I had 3 repairs done on 2 controllers, never paid shipping, and all were fixed in about a week",
                      "score": 2,
                      "created_utc": 1737408386.0,
                      "replies": []
                    },
                    {
                      "id": "m86cxo6",
                      "author": "round-earth-theory",
                      "body": "They didn't necessarily fix and return yours though. Lots of stories of getting two right side joycons or people with limited editions getting something else in return.",
                      "score": 2,
                      "created_utc": 1737388216.0,
                      "replies": []
                    },
                    {
                      "id": "m86cu67",
                      "author": "kobemustard",
                      "body": "I just did this a couple of weeks ago! Shipping was free and I got it back in 2 weeks.  Overall pretty good service (Toronto area).",
                      "score": 1,
                      "created_utc": 1737388188.0,
                      "replies": []
                    },
                    {
                      "id": "m86jx7n",
                      "author": "kurisu7885",
                      "body": "yeah, that was a big reason I kinda just lived with it until I picked up a pro controller.",
                      "score": 1,
                      "created_utc": 1737390195.0,
                      "replies": []
                    },
                    {
                      "id": "m87v17x",
                      "author": "Unknwn_Ent",
                      "body": "Made worse by the fact you also weren't guaranteed the same joycons back.                  \n\nSo you could send in 'rare'/limited edition joycons; all to get back a basic set of blue and red that'd still have the same issue after some play time :/       \n\nIt's why I never sent mine in (cause I bought the animal crossing edition SPECIFICALLY for the colors of the joycons), so I just learned to repair em. Which is shitty cause now their design flaw was coming directly out of my pocket even more so.       \n\nThe only benefit is you can replace OG joycon joysticks with hall effect sensors. So if you don't mind the cost; you coulda had this functionality a while ago.",
                      "score": 1,
                      "created_utc": 1737402938.0,
                      "replies": []
                    },
                    {
                      "id": "m88lei6",
                      "author": "Dick_Lazer",
                      "body": "I just sent mine back in December. Only took a week or two (in the middle of the busiest shipping season of the year) and shipping was 100% free both ways.",
                      "score": 1,
                      "created_utc": 1737410017.0,
                      "replies": []
                    },
                    {
                      "id": "m89vxqw",
                      "author": "Kaellian",
                      "body": "I've exchanged about 10 controllers. Shipping was free (in Canada), and it never took more than 3 weeks (usually 2).  Can't really complains.",
                      "score": 1,
                      "created_utc": 1737424134.0,
                      "replies": []
                    },
                    {
                      "id": "m8a02f3",
                      "author": "Rudy69",
                      "body": "In Canada they pay for shipping. I’ve done it twice so far",
                      "score": 1,
                      "created_utc": 1737425442.0,
                      "replies": []
                    },
                    {
                      "id": "m8a1he1",
                      "author": "Noctolus",
                      "body": "I did this several times you didn't have to pay for shipping",
                      "score": 1,
                      "created_utc": 1737425890.0,
                      "replies": []
                    },
                    {
                      "id": "m8a528o",
                      "author": "DripDropFaucet",
                      "body": "I did this twice and never paid for shipping, totally free. They repaired drift in 2 pairs of my joycons no questions asked\n\nAlso- it took 3 weeks max, which SUCKED at the time but not 4-6 weeks at all. Not saying it doesn’t happen but nothing close to my experience in northeast US",
                      "score": 1,
                      "created_utc": 1737427042.0,
                      "replies": []
                    },
                    {
                      "id": "m8au2d5",
                      "author": "crypticsage",
                      "body": "I sent in some joy cons two months ago. Didn’t even pay for that.",
                      "score": 1,
                      "created_utc": 1737436055.0,
                      "replies": []
                    },
                    {
                      "id": "m8cd15l",
                      "author": "dmc2008",
                      "body": "I did not have to pay for shipping, they provided a prepaid UPS label.\n\nI received my replacement joy cons in a little over a week.",
                      "score": 1,
                      "created_utc": 1737465414.0,
                      "replies": []
                    },
                    {
                      "id": "m8dzoq2",
                      "author": "Flames99Fuse",
                      "body": "My shipping was free. The note I got back said they couldn't find any issue and they sent me a brand new pair instead. Whole process was pretty quick, don't remember exact dates but it wasn't any more than 3 weeks.",
                      "score": 1,
                      "created_utc": 1737483104.0,
                      "replies": []
                    },
                    {
                      "id": "m8eb0yf",
                      "author": "Kamakaziturtle",
                      "body": "When are they going to start requiring this from Microsoft and Sony?  Their controllers are just as bad if not worse, and you gotta pay a fee if not under their warranty.",
                      "score": 1,
                      "created_utc": 1737486179.0,
                      "replies": []
                    },
                    {
                      "id": "mehew86",
                      "author": "Jealous_Wafer7777",
                      "body": "Replacing 6 times those dumb joysticks... Like takes me 20 to 30 mins to fix one. At least I can. PS4/PS5 controllers not happening but the way Joycons are set up like fits together better. No day one purchase maybe 1.5 to 2 years once Nintendo can prove they fixed this issue. Main reason I use my 3DS more than my switch becasuse of that.",
                      "score": 1,
                      "created_utc": 1740382200.0,
                      "replies": []
                    },
                    {
                      "id": "m86fdsk",
                      "author": "Ornery-Addendum5031",
                      "body": "No they avoided the lawsuit because they have an arbitration clause — you can’t bring a class action in arbitration",
                      "score": 0,
                      "created_utc": 1737388912.0,
                      "replies": []
                    },
                    {
                      "id": "m86k641",
                      "author": "GGNash",
                      "body": "Yeah I did this three times and guess what happened to each replacement. I haven’t touched my Switch in a few years and will probably avoid the S2.",
                      "score": -1,
                      "created_utc": 1737390265.0,
                      "replies": []
                    },
                    {
                      "id": "m87e7kb",
                      "author": "PmMe_Your_Perky_Nips",
                      "body": "If I remember correctly they wouldn't even send you back your joy cons. If you sent in special edition ones you weren't getting them back. Multiple people lost special joy cons to it.",
                      "score": -1,
                      "created_utc": 1737398400.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m860p2h",
                  "author": "steinrrr",
                  "body": "I sent my joycons for repair, got them back with the same exact drift and disconnection problem. I only use the pro controller ever since. Which is a shame since some minigames in Mario party require the joycons",
                  "score": 21,
                  "created_utc": 1737384529.0,
                  "replies": [
                    {
                      "id": "m86egb1",
                      "author": "WereAllThrowaways",
                      "body": "I have no idea how I've managed to avoid stick drift on my joycons. I've got 3 pairs, and even the original ones that came with my switch don't have it. Seems like that's a huge outlier, especially since I've had the thing for probably 6 or 7 years. \n\nNow my Xbox controllers? They get stick drift after like a year. I opened my most recent one up to try and fix it but the carbon track had clearly had grooves worn in it. There was no fixing it without replacing the whole potentiometer.",
                      "score": 6,
                      "created_utc": 1737388648.0,
                      "replies": [
                        {
                          "id": "m88mv7s",
                          "author": "Dick_Lazer",
                          "body": "I’ve only had the joycons that came with the console I bought on launch day, I just finally had to send them in for repair in December.",
                          "score": 1,
                          "created_utc": 1737410411.0,
                          "replies": []
                        },
                        {
                          "id": "m8bp6kq",
                          "author": "bankyll",
                          "body": "I've got two pairs myself, no drift. I've never had drift on any controller, I have dualsense, dualshock 4, xbox etc. Never had drift before.\n\nI think it comes down to three things.\n\n1. The type of games you play: I don't play any sweaty FPS or fighting games, mostly adventure, platformers and a few sports games.\n2. The fact that you (and I) have multiple pairs, I have Two pairs of joycons + One Pro Controller. Since we have multiple, we swap them time to time which reduces the wear on each controller's sticks.\n3. Time: due to reasons 1 & 2, we extended their lifespan, but we might be just a short while away from developing drift but aren't aware of it yet.",
                          "score": 1,
                          "created_utc": 1737453212.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m89ucbd",
                      "author": "SupremeDictatorPaul",
                      "body": "I bought Hall effect replacement joysticks and replaced four myself. It wasn’t that had.",
                      "score": 1,
                      "created_utc": 1737423636.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m85vwhp",
                  "author": "Revolutionary--man",
                  "body": "Nintendo decided it was cheaper to fix Joycons for free as compensation and live with the problem than it was to invest in the R&D needed to fix the actual problem to begin with.\n\nI imagine the arithmetic changed on this when planning for the Switch 2 if they're making the claim this headline suggests, but i still doubt it.",
                  "score": 20,
                  "created_utc": 1737382906.0,
                  "replies": [
                    {
                      "id": "m86tdjh",
                      "author": "staatsclaas",
                      "body": "This is the only way they could avoid doing a complete recall and replacement of every. single. joycon. produced. \n\nI’m fairly confident they want to avoid the issue entirely this time around.",
                      "score": 4,
                      "created_utc": 1737392815.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m865ote",
                  "author": "Specialist-Rope-9760",
                  "body": "They probably repaired them to avoid bigger legal trouble. But they never attempted to fix the issue that caused it",
                  "score": 4,
                  "created_utc": 1737386088.0,
                  "replies": []
                },
                {
                  "id": "m875rut",
                  "author": "serialchillin",
                  "body": "I was able to send mine in, no charge and no shipping fee with their label, and I got them back in about 3 weeks. They noted they couldn’t replicate the issue but still did fixes for my noted drift issues. \n\nIt’s been like a year and a half and still no issues since that fix. Sucked to send them off for so long but I really appreciated that they were willing to fix it on their dime. \n\nHowever, it’s not free to get a pro controller fixed which is annoying.",
                  "score": 2,
                  "created_utc": 1737396144.0,
                  "replies": [
                    {
                      "id": "m8a5mtj",
                      "author": "DripDropFaucet",
                      "body": "Same exact experience here, I’m half convinced they sent me new ones but regardless I’ve had 0 issues since",
                      "score": 1,
                      "created_utc": 1737427226.0,
                      "replies": [
                        {
                          "id": "m8ads9q",
                          "author": "serialchillin",
                          "body": "I kind of thought they might send me brand new ones as well but mine had skins on them when I sent them in. I included a note that said something like “hey, if you have to take these off I understand, but if it’s possible to work around them I would appreciate it!” I got the same joycons back with only a few cuts in the skin to access screws and whatnot.",
                          "score": 2,
                          "created_utc": 1737429929.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m86ato2",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1737387604.0,
                  "replies": [
                    {
                      "id": "m86g3sk",
                      "author": "haniblecter",
                      "body": "you have it, you just never noticed it",
                      "score": 0,
                      "created_utc": 1737389115.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m87rr9g",
                  "author": "Speak_To_Wuk_Lamat",
                  "body": "Sometimes you sent in your limited edition cons and got back standard ones. \n\n\nWomp",
                  "score": 1,
                  "created_utc": 1737402051.0,
                  "replies": []
                },
                {
                  "id": "m87v120",
                  "author": "Totnfish",
                  "body": "Just in the US right? Due to the class action lawsuit they previously lost.",
                  "score": 1,
                  "created_utc": 1737402937.0,
                  "replies": []
                },
                {
                  "id": "m883xa2",
                  "author": "nero40",
                  "body": "Only in places where there is a Nintendo service center available.",
                  "score": 1,
                  "created_utc": 1737405385.0,
                  "replies": []
                },
                {
                  "id": "m890iru",
                  "author": "MexGrow",
                  "body": "They only did this in VERY select regions. They essentially only allowed a lesser fraction of defective controllers to be repaired under warranty.",
                  "score": 1,
                  "created_utc": 1737414304.0,
                  "replies": []
                },
                {
                  "id": "m89afy4",
                  "author": "Gaulwa",
                  "body": "Not in every country. Smaller countries like the Nordics get charged full price for the repair. Around $40.",
                  "score": 1,
                  "created_utc": 1737417395.0,
                  "replies": []
                },
                {
                  "id": "m8a9y0w",
                  "author": "Background-Zombie-20",
                  "body": "Yes and announced, because of the potential lawsuit. They didn’t avoid the issue.",
                  "score": 1,
                  "created_utc": 1737428627.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m85wj3b",
              "author": "planetofthemushrooms",
              "body": "Same thing Gigabyte did with their laptop motherboards that failed after a year. ",
              "score": 6,
              "created_utc": 1737383124.0,
              "replies": []
            },
            {
              "id": "m86o8bh",
              "author": "keosen",
              "body": "And we will teach them a lesson by hyping and  buying their new product en masse.",
              "score": 2,
              "created_utc": 1737391398.0,
              "replies": []
            },
            {
              "id": "m8704i0",
              "author": "Megamoss",
              "body": "Honestly, the Switch has been the most unreliable piece of technology I've ever owned.\n\n Both joycons have needed their sticks replaced as well as the little bar at the top that allows the console to detect them and one is still intermittently bad, I've had to replace the game card reader twice, clean out the fan/heatsink and reapply thermal paste on multiple occasions due to overheating and replace the USB C port.\n\n I'm  not even a heavy user and take good care  of my electronics.  Never had such extensive  issues with other bits of tech.",
              "score": 3,
              "created_utc": 1737394661.0,
              "replies": []
            },
            {
              "id": "m866ja0",
              "author": "abarrelofmankeys",
              "body": "Like sandisk with ssds!",
              "score": 1,
              "created_utc": 1737386343.0,
              "replies": []
            },
            {
              "id": "m86ulv5",
              "author": "ablackcloudupahead",
              "body": "It's so weird, I have had my switch since launch and no drift. My Xbox elite and elite S2 both got drift, and those are generally considered to be the most well made controllers",
              "score": 1,
              "created_utc": 1737393155.0,
              "replies": []
            },
            {
              "id": "m87zzqp",
              "author": "Calophon",
              "body": "What’s wild to me is that even if your joycon  is out of warranty they will fix it if you mail it in, and the toggle sticks are easy to replace yourself due to the ribbon connectors.\n\nBy contrast my Xbox controller got even worse stick drift than I have ever experienced with a switch joycon and Xbox refused to service it. Just flat out said no. When I called customer service they basically told me to get fucked and take it to a repair shop. Fixing an Xbox controller is not as easy because the toggles are soldered on.",
              "score": 1,
              "created_utc": 1737404309.0,
              "replies": []
            },
            {
              "id": "m89zvta",
              "author": "Rudy69",
              "body": "I’d be curious how much it cost them in free replacements. I know I’ve sent 5 myself so far",
              "score": 1,
              "created_utc": 1737425384.0,
              "replies": []
            },
            {
              "id": "m8bg78b",
              "author": "XuX24",
              "body": "Where is the lawsuit against Sony and Microsoft? Hall effect exists and aren't expensive they should all be common.",
              "score": 1,
              "created_utc": 1737447606.0,
              "replies": []
            },
            {
              "id": "m86oj5u",
              "author": "homer_3",
              "body": "Everyone had the same sticks. Why would Nintendo be close to a suit and not Sony and Microsoft?\n\nIt's not like it was worse with Nintendo either. I played my PS4 less than my Switch and my PS4 got drift and my Switch is fine.",
              "score": -1,
              "created_utc": 1737391482.0,
              "replies": [
                {
                  "id": "m86pt9t",
                  "author": "Specialist-Rope-9760",
                  "body": "I’m not sure what you’re saying. Nintendo joycons aren’t the same as a PS5 or Xbox controller. There were far more reported issues with joycons than any other controller.",
                  "score": 5,
                  "created_utc": 1737391837.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m85zrm9",
          "author": "Dhiox",
          "body": "I mean, its pretty believable. Joh con drift was a major headache for Nintendo, they're not gonna want a repeat of it.",
          "score": 38,
          "created_utc": 1737384227.0,
          "replies": [
            {
              "id": "m86cgks",
              "author": "Key_Dish_good",
              "body": "Lol",
              "score": 11,
              "created_utc": 1737388078.0,
              "replies": [
                {
                  "id": "m86t76w",
                  "author": "FlorydaMan",
                  "body": "Sign me up for that lol",
                  "score": 0,
                  "created_utc": 1737392767.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m86x0s4",
              "author": "PowerScreamingASMR",
              "body": "How was it a headache for them? The reason none of the consoles make their controllers with hall effect sticks is because they *want* you to get stick drift and buy a new one.",
              "score": -7,
              "created_utc": 1737393816.0,
              "replies": [
                {
                  "id": "m86xwud",
                  "author": "Dhiox",
                  "body": "Yeah, no, that's simply made up. Nintendo spent thousands if not millions on shipping and repairs for joycons with drift. They paid for the whole process to get a joycon repaired, no questions asked. On top of that, they faced reputational damage regarding build quality due to this defect.\n\nOn top of that, Nintendo is historically extremely prideful, to a ridiculous degree. Their devs legit got angry with Reggie when he told them they should package wii sports for free with the wii instead of selling it separately, because the devs saw it as an insult to their work. There's no way a company as prideful as Nintendo would introduce an intentional defect into their hardware.",
                  "score": 15,
                  "created_utc": 1737394058.0,
                  "replies": [
                    {
                      "id": "m86z3xg",
                      "author": "PowerScreamingASMR",
                      "body": ">They paid for the whole process to get a joycon repaired, no questions asked\n\nI dont own any nintendo console but if thats true then I'll give them the benefit of the doubt. Cant say the same for any other console though.",
                      "score": 2,
                      "created_utc": 1737394386.0,
                      "replies": [
                        {
                          "id": "m86zm7v",
                          "author": "Dhiox",
                          "body": "I did it myself, had a joycon that was drifting badly, and I called them up and they sent me a shipping label at no cost. Only real issue is you have to wait for it to come back, but it wasn't an issue for me as I had an extra pair.",
                          "score": 5,
                          "created_utc": 1737394524.0,
                          "replies": []
                        },
                        {
                          "id": "m871om0",
                          "author": "Edmundyoulittle",
                          "body": "I replaced multiple joycon through Nintendo for free due to joycon drift.\n\nIirc they didn't have an official policy for it, but at least in the US we're doing it anyway",
                          "score": 2,
                          "created_utc": 1737395077.0,
                          "replies": []
                        },
                        {
                          "id": "m8952sh",
                          "author": "Western-Dig-6843",
                          "body": "I sent them six joycons for free drift repair. Two of those were the same damn joycon.",
                          "score": 1,
                          "created_utc": 1737415695.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m88n8so",
                  "author": "Dick_Lazer",
                  "body": "To this day Nintendo will still replace the joycons for free, that’s nothing but a money losing proposition for them.",
                  "score": 2,
                  "created_utc": 1737410513.0,
                  "replies": []
                },
                {
                  "id": "m87ojg7",
                  "author": "_RADIANTSUN_",
                  "body": "> The reason none of the consoles make their controllers with hall effect sticks is because they want you to get stick drift and buy a new one.\n\nThis is actually completely false and made up because there is a totally different reason all the console manufacturers use potentiometers instead: it's that potentiometers can vary and degrade in quality, meanwhile Hall sensors break all at once if something is wrong. So when anticipating across shippings dozens of millions of units, with potentiometers there is very low chance someone opens up their new Xbox and finds the controller has no analogue input. Whereas many players might just never even notice with a slightly shitty potentiometer analogue.",
                  "score": 3,
                  "created_utc": 1737401178.0,
                  "replies": [
                    {
                      "id": "m88020q",
                      "author": "PowerScreamingASMR",
                      "body": "Unless you have a credible source for any of this you also just made it up. \n\nAnd frankly I dont buy this reasoning because faulty hardware can and will happen if you're shipping millions of units, no matter what kind of sticks you have. Do you have a source that would verify your claim that hall effect sticks are more prone to being faulty on arrival? And if companies are only considering hardware condition on arrival, then it doesnt exactly refute my comment that companies are intentionally using shitty hardware that will break after some time.\n\nPlanned obsolescence is rampant across all tech. There is no reason to assume consoles are exempt from this.",
                      "score": 1,
                      "created_utc": 1737404327.0,
                      "replies": [
                        {
                          "id": "m88d7wr",
                          "author": "_RADIANTSUN_",
                          "body": "There seems to be some miscommunication.\n\nI am not saying \"Hall Effect Sticks are more prone (than potentiometers) to be faulty on arrival\".\n\nI am saying Hall effect sticks go from tracking fine to no-tracking in one go. They don't degrade over time or perform slightly poorly like pots can, they function fine until they fail all at once. \n\nSince they are not a magic defect free technology that never fails, there will always be some % defect rate. Same as with pots. Probably across millions of units there will be some thousands of defective units which do inevitably end up going out, across either type of stick.\n\nBut on potentiometer sticks most people who do receive a defective one will never notice they didn't get a perfect analogue stick vs they will notice if the analogue stick is nonfunctional... vs on Hall Effect sticks the people with defective sticks actually will notice because they will have zero tracking.\n\nThat's why pots were the better choice for the scale that consoles and their pack in controllers are moving on.",
                          "score": 2,
                          "created_utc": 1737407839.0,
                          "replies": [
                            {
                              "id": "m88m8dn",
                              "author": "PowerScreamingASMR",
                              "body": "I really dont understand what point you are trying to make here. What does it matter that many people wont notice their potentiometer sticks arent perfect? Is the argument you're going for that they are minimising the amount of refunded controllers by using potentiometer sticks? Thats not mutually exclusive with planned obsolescence.\n\nThe fact is that potentiometer sticks degrade over time and are known to develop stick drift, whereas hall effect sticks dont. If their goal was to deliver a durable product, they would use hall effect.",
                              "score": 1,
                              "created_utc": 1737410239.0,
                              "replies": [
                                {
                                  "id": "m89aaj6",
                                  "author": "_RADIANTSUN_",
                                  "body": "Idk why you are so heated. I'm just saying the real reason all console manufacturers have made this choice in the past for their main controller is because potentiometers have a gradual, more acceptable failure mode for a large rollout. It has nothing to do with wanting people to buy more controllers because their previous one'e analogue stick degraded lol.",
                                  "score": 2,
                                  "created_utc": 1737417347.0,
                                  "replies": [
                                    {
                                      "id": "m8atd9y",
                                      "author": "amperor",
                                      "body": "That's not right at all. I'm not gonna point out the flaws, but tell the real reason why. Money. They were cheaper. Hall-effect sticks weren't mass-produced in China for cheap until recently.",
                                      "score": 1,
                                      "created_utc": 1737435756.0,
                                      "replies": [
                                        {
                                          "id": "m8avre3",
                                          "author": "_RADIANTSUN_",
                                          "body": "Nah they have been produced economically for well over a decade, plenty of time to have switched but they haven't because the failure mode is different and the consumer experience is very different when conceivably little Timmy can play his Christmas PS5 for years not realizing he has an underperforming pot analogue stick whereas he would be real mad right away if his HE stick is completely non-functional.\n\nIt's certainly not because they want you to buy another one.",
                                          "score": 1,
                                          "created_utc": 1737436795.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "m8bamlv",
                                      "author": "PowerScreamingASMR",
                                      "body": "I'm not heated at all, I'm just trying to understand where you're coming from.\n\n>It has nothing to do with wanting people to buy more controllers because their previous one'e analogue stick degraded lol.\n\nI just dont know how you can claim that so confidently. How could you possibly know that? \n\n>potentiometers have a gradual, more acceptable failure mode for a large rollout. \n\nThis is kind of assuming both of them fail at similar rates isnt it? Again, how do you know that? And if nintendo can opt for hall effect sticks then clearly it shows that these arent unsuitable for large scale rollouts.",
                                      "score": 1,
                                      "created_utc": 1737444333.0,
                                      "replies": [
                                        {
                                          "id": "m8gfwno",
                                          "author": "_RADIANTSUN_",
                                          "body": "> I just dont know how you can claim that so confidently. How could you possibly know that?\n\nIt is just a hilariously contrived explanation for all companies supposedly undermining their own products in tandem when the obviously straightforward explanation for why they all do it is readily available.\n\nE.g. if that was their priority, why would Nintendo switch to (pun intended) Hall Effect sticks as per these rumors? They just decide to stop making phat bank on selling new controllers because the bad PR was hurting the Switch (the best selling system) so much or it was too legally risky? \n\n> This is kind of assuming both of them fail at similar rates isnt it? Again, how do you know that?\n\nThe industry standard for electronics is around 2.5% across the board, the reason has nothing to do withinherent robustness of the technologies involved always happens to be the same by chance or that it's impossible to ship e.g. potentiometer sticks with near 0% failure... it's because that is an efficient threshold items commonly converge to due to the way batch testing is conducted statistically, it becomes more expensive with more and more complex items down the chain where these error rates compound and design margins get smaller. Due to supply chain complexity, process variations/yield rates almost never being 100%, basic scale QA testing strategy and engineering markups at every step this is just a general effective threshold most items converge to for mass manufacturing. Fun side point: this kind of QA thresholding is also the exact reason behind the \"$1000 mil-spec screwdriver\" meme.\n\n> And if nintendo can opt for hall effect sticks then clearly it shows that these arent unsuitable for large scale rollouts.\n\nI was only discussing why it has been the case so far, we don't even know for sure if Nintendo is using HE sticks let alone what might have changed their mind on that e.g. maybe they decided that spending more money on HE sticks + more WA is worth it because the PR hit really is worth it anyway since there are no counterbalancing benefits of selling a bunch of pot sticks controllers on degrading pot controllers being considered. Lol.",
                                          "score": 1,
                                          "created_utc": 1737508268.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8aq5z3",
                  "author": "VenomsViper",
                  "body": "That idea is just one of those middle schooler logic thing where some kid thinks they figured something out because it is feasibly possible then passes it around like fact.",
                  "score": 1,
                  "created_utc": 1737434436.0,
                  "replies": [
                    {
                      "id": "m8bbw2d",
                      "author": "PowerScreamingASMR",
                      "body": "Planned obsolescence isnt a conspiracy, its literally  common practice in tech. So much so that EU has repeatedly tried to tackle this with stricter legislation. Its naive to think consoles are any different.",
                      "score": 1,
                      "created_utc": 1737445066.0,
                      "replies": [
                        {
                          "id": "m8cpalc",
                          "author": "VenomsViper",
                          "body": "I know what it is and it is real. But it's not the case here. It has cost Nintendo millions.",
                          "score": 1,
                          "created_utc": 1737469793.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m85t8zo",
          "author": "joeChump",
          "body": "Are you going to take it apart?",
          "score": 4,
          "created_utc": 1737381958.0,
          "replies": [
            {
              "id": "m85tv0b",
              "author": "cinnamonface9",
              "body": "No but first I rage quit and throw it across room. \n\nThen I check inside",
              "score": 10,
              "created_utc": 1737382182.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m86amy6",
          "author": "deformo",
          "body": "This already exists. You can already replace current potentiometer assemblies with Hall effect assemblies.",
          "score": 1,
          "created_utc": 1737387551.0,
          "replies": []
        },
        {
          "id": "m87078n",
          "author": "None",
          "body": "By then it’ll be too late",
          "score": 1,
          "created_utc": 1737394681.0,
          "replies": []
        },
        {
          "id": "m88gvv5",
          "author": "GrynaiTaip",
          "body": "Hall sensors have been a thing on RC remotes for quite some time.",
          "score": 1,
          "created_utc": 1737408811.0,
          "replies": []
        },
        {
          "id": "m8jc5x8",
          "author": "TheMelv",
          "body": "I've sent joycons in for free repairs multiple times. I'm sure some accountant somewhere realized that over the course of their lifetime, it was more profitable to just make better thumbsiticks.",
          "score": 1,
          "created_utc": 1737554652.0,
          "replies": []
        },
        {
          "id": "m870qei",
          "author": "None",
          "body": "[deleted]",
          "score": -1,
          "created_utc": 1737394821.0,
          "replies": [
            {
              "id": "m871wsi",
              "author": "Edmundyoulittle",
              "body": "You're of the opinion that the launch video for their new product would spend time talking about the engineering of a control stick? Lol",
              "score": 6,
              "created_utc": 1737395136.0,
              "replies": [
                {
                  "id": "m872e6z",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1737395263.0,
                  "replies": [
                    {
                      "id": "m877slt",
                      "author": "Edmundyoulittle",
                      "body": "From a marketing perspective it's just not something you would do.\n\nYou don't want the first impression of your product to be \"hey guys, remember when we fucked up last time?\"\n\nI'm not saying this means they changed it though. Just that I don't think their launch video is indicative of anything",
                      "score": 6,
                      "created_utc": 1737396689.0,
                      "replies": []
                    },
                    {
                      "id": "m87rllb",
                      "author": "weirdgumball",
                      "body": "They haven’t made a good reliable controller since Gamecube",
                      "score": 0,
                      "created_utc": 1737402009.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m87jf3h",
              "author": "DukeFlipside",
              "body": ">If they had fixed the joycon design flaw they would have led with that claim, so they probably didn't.\n\n*\"Buy our new product; our old one was broken but this one isn't, honest!\"* - Yeah, no company is ever going to say that in their product launch announcement.",
              "score": 4,
              "created_utc": 1737399783.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m866xhg",
          "author": "Juststandupbro",
          "body": "Are you somehow doubtful that Nintendo would try and engineer a solution to the drift issue or doubtful on their ability to do so?",
          "score": -1,
          "created_utc": 1737386461.0,
          "replies": [
            {
              "id": "m86nne5",
              "author": "CumStayneBlayne",
              "body": "Idk, the OLED came out in 2021, and Nintendo had yet to produce a working controller at that time, despite knowing they were producing shit controllers for several years prior.",
              "score": 3,
              "created_utc": 1737391236.0,
              "replies": [
                {
                  "id": "m8azvww",
                  "author": "a_moniker",
                  "body": "The OLED used the exact same controllers though, didn’t it? It makes more sense for them to switch to Hall effect when redesigning the joycons from the ground up, like they did with the Switch2",
                  "score": 1,
                  "created_utc": 1737438686.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m88zzw0",
              "author": "SuperBackup9000",
              "body": "Well the thing is, they don’t have to engineer a solution. I’m sure every older gamer has controllers that still work fine that are over a decade old, because mechanical sticks aren’t the problem. It’s the quality of the mechanical sticks. It’s a quality issue with the joycons (and PS5/newer Xbox controllers)\n\nIf Nintendo hasn’t upped their quality in the 7 years it’s been an issue, are we really going to pretend that it would be impossible for them to use low quality material for hall effect sticks, where all it takes is one spring to be broken for the stick to be off?\n\nYes, I’m doubtful Nintendo will finally update their quality, and even if they do, it’s nonsense that they haven’t yet.",
              "score": 1,
              "created_utc": 1737414148.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m85ufvg",
      "author": "ThePreciseClimber",
      "body": "It should have been fixed in the OLED model. Maybe even earlier.",
      "score": 561,
      "created_utc": 1737382389.0,
      "replies": [
        {
          "id": "m85zblc",
          "author": "joestaff",
          "body": "In the Lite at least.",
          "score": 167,
          "created_utc": 1737384080.0,
          "replies": [
            {
              "id": "m862j51",
              "author": "clay_perview",
              "body": "Especially since you can’t just buy new joycons for the lite",
              "score": 134,
              "created_utc": 1737385114.0,
              "replies": [
                {
                  "id": "m89odbo",
                  "author": "ASCII_Princess",
                  "body": "You can get aftermarket hall effect sticks though if you're brave enough to take the shell off.",
                  "score": 4,
                  "created_utc": 1737421755.0,
                  "replies": [
                    {
                      "id": "m8i7p0m",
                      "author": "Luvz2Spooje",
                      "body": "Just did this. Wasn't hard at all. ",
                      "score": 1,
                      "created_utc": 1737534540.0,
                      "replies": [
                        {
                          "id": "m8i8wpl",
                          "author": "ASCII_Princess",
                          "body": "I was considering doing a shell swap for my OG switch controllers to a transparent purple. Wonder if it'd be easier or harder than the Lite.\n\nI'll need to do both sooner or later and the kits are discounted for two.",
                          "score": 1,
                          "created_utc": 1737535290.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8ao3mn",
                  "author": "_RADIANTSUN_",
                  "body": "You can but just can't clip them on or remove the built in ones, not that it makes the underlying core issue much better.",
                  "score": 3,
                  "created_utc": 1737433613.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m863bbg",
          "author": "Photo_Synthetic",
          "body": "I'd have settled for a \"pro\" Joycon set for a bit more money that won't drift and maybe have some ergonomic shape. Keep the drifty stock controllers for multi-player situations and have a reliable set for regular use. Can't believe it took them this long to make these unless they decided a long time ago to roll with it planning to fix it in the next generation.",
          "score": 21,
          "created_utc": 1737385358.0,
          "replies": [
            {
              "id": "m883pax",
              "author": "Professional-Ad380",
              "body": "The hori “joycons” are worth the money. Thats what i use",
              "score": 7,
              "created_utc": 1737405324.0,
              "replies": [
                {
                  "id": "m8bsdbt",
                  "author": "Embarrassed-Back1894",
                  "body": "I got a pair of the Hori Joycons and they developed bad drift in a fairly short amount of time. It was probably just a bad luck of the draw because I haven’t seen others have that similar problem. For the time I used it though it was great.",
                  "score": 2,
                  "created_utc": 1737455183.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m886eta",
              "author": "worldspawn00",
              "body": "The Dreamcast and Saturn stock controllers used Hall Effect sensors in the sticks, there's no excuse for a modern controller to still use resistive contacts if Sega managed to make the switch 25 years ago.",
              "score": 1,
              "created_utc": 1737406048.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8611px",
          "author": "Dhiox",
          "body": "I mean, the Oled model had identical controllers, it was only the co sole itself that changed.",
          "score": -6,
          "created_utc": 1737384644.0,
          "replies": [
            {
              "id": "m86b1nr",
              "author": "kurttheflirt",
              "body": "Yes, that was the problem…",
              "score": 31,
              "created_utc": 1737387667.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m85rrsm",
      "author": "drmirage809",
      "body": "That would be great. And hopefully Nintendo set a trend here. Hall effect sticks are only a little more expensive than the regular ones we see in a controllers currently, but they will never drift.",
      "score": 552,
      "created_utc": 1737381415.0,
      "replies": [
        {
          "id": "m85um0o",
          "author": "ThePreciseClimber",
          "body": "Hall Effect sticks are already a trend. Just in the 3rd party controllers, not in the official Nintendo/Sony/Microsoft pads.",
          "score": 249,
          "created_utc": 1737382450.0,
          "replies": [
            {
              "id": "m868peb",
              "author": "goodnames679",
              "body": "Correct, but I think they're implying that hopefully the major console manufacturers will all adopt hall-effect sticks in the near future. This would be the first official controller for a major console to use Hall Effect since the Dreamcast, and the Saturn before it.\n\nSony did have some pretty advanced controllers in the PS3 era that used MR/TMR, but they scrapped it for the dual-purpose of lowering cost and maintaining controller sales.",
              "score": 78,
              "created_utc": 1737386983.0,
              "replies": [
                {
                  "id": "m86j6hj",
                  "author": "bigjoe980",
                  "body": "\"But how will we save 6 cents per controller if we don't use the design that fails relatively quickly?!\"",
                  "score": 29,
                  "created_utc": 1737389985.0,
                  "replies": [
                    {
                      "id": "m89kv62",
                      "author": "Rdubya44",
                      "body": "By selling them new controllers every 6 months! Muahahaha",
                      "score": 7,
                      "created_utc": 1737420663.0,
                      "replies": []
                    },
                    {
                      "id": "m8bqbo4",
                      "author": "alidan",
                      "body": "I have 8bit do ultimate c2 with hall effect, they have lower latency than xbox and better sticks than anything I have tried first party to date in feel (metal shafter with very slippery plastic ring) and that thing was 30$, why the fuck is xbox official 60$",
                      "score": 1,
                      "created_utc": 1737453924.0,
                      "replies": [
                        {
                          "id": "m8d3qx8",
                          "author": "bigjoe980",
                          "body": "Yeeeeaaaah. I want to change my ps5 controllers over to hall effect (well..TMR i guess, since gullikit only does tmr for them) but I'm terrible at soldering. Lol",
                          "score": 1,
                          "created_utc": 1737474243.0,
                          "replies": [
                            {
                              "id": "m8f91e5",
                              "author": "alidan",
                              "body": "its less soldering skill that you would need and just how much of a pain in the ass it would be to put back together. \n\nI did a mod for my little brother a while back where I took a ruined controller and refurb'ed it with a different shell and leds, getting the thing to go back together was painful even with some of the thinnest wires I ever used at the time, and I know that playstation was even worth with how compact everything is, and I can only imagine its gotten worse over the years. \n\njust looked up what would need to be done, it seems like while its an upgrade, its one of those things that's not worth doing unless you have a bad controller, easy enough to replace the old one with the new, I personally have experience with surface mount and microchip soldering but this looks FAR more accessible than most of the smaller crap I did, as long as you have a steady hand and know how to tell a good solder joint from a bad, it should be easily doable, make sure you have some flux if you do it, don't rely on flux in the solder itself that crap almost never works.",
                              "score": 1,
                              "created_utc": 1737495417.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m86kgnb",
                  "author": "Schakarus",
                  "body": "Sony used Hall Effect sticks in the PS Vita 1000 but switched to regular ones in the 2k and 3k models.",
                  "score": 19,
                  "created_utc": 1737390347.0,
                  "replies": []
                },
                {
                  "id": "m869e5k",
                  "author": "drmirage809",
                  "body": "Yep. I'm hoping to see the PS6 controller have them for example.",
                  "score": 7,
                  "created_utc": 1737387186.0,
                  "replies": [
                    {
                      "id": "m86dag4",
                      "author": "RabidSeason",
                      "body": "Well in 15 years anything's possible.",
                      "score": 8,
                      "created_utc": 1737388319.0,
                      "replies": [
                        {
                          "id": "m88j6ex",
                          "author": "KDW3",
                          "body": "15? PS6 drops in 3-4 years going by Sony trends.",
                          "score": 0,
                          "created_utc": 1737409422.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m881y3s",
                  "author": "bardicjourney",
                  "body": "I have an original release ps3 controller that has been beat to shit, probably well past 10,000 hours at this point. The sticks and triggers are squishy as hell and sort of pop out of socket occasionally, and yet are as precise as the day I bought them.\n\nMy switch pro controller got unrecoverable drift in 8 months. Plus, a bunch of the first party titles like Switch sports and Mario party emphasize button actions that wear the controllers out faster.",
                  "score": 3,
                  "created_utc": 1737404847.0,
                  "replies": []
                },
                {
                  "id": "m86r1ga",
                  "author": "userpay",
                  "body": "I mean, once one of the big three does it most likely the other two will follow suit to stay \"competitive\".",
                  "score": 2,
                  "created_utc": 1737392171.0,
                  "replies": [
                    {
                      "id": "m86rtkj",
                      "author": "goodnames679",
                      "body": "If Sony or MS had done it, I’m sure the other would follow suit. I’m not as sure about Nintendo doing it, they barely “compete” with the other two. \n\nMost people who own a Nintendo system also own one of the big consoles or a PC as their primary.",
                      "score": 3,
                      "created_utc": 1737392384.0,
                      "replies": []
                    },
                    {
                      "id": "m8aumau",
                      "author": "Buttersaucewac",
                      "body": "Sega did it 27 years ago and Sony did it in the Vita 14 years ago, but it didn’t lead to anyone else copying it.",
                      "score": 1,
                      "created_utc": 1737436296.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8aw445",
                  "author": "volcia",
                  "body": "Controller sales should be no problem for Nintendo since people will buy joycons for their designs anyway. So, I think there’s a higher chance the rumor will be true.",
                  "score": 1,
                  "created_utc": 1737436954.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m86a69t",
              "author": "no_infringe_me",
              "body": "I remember when third party controllers were almost always garbage. Good times",
              "score": 13,
              "created_utc": 1737387415.0,
              "replies": [
                {
                  "id": "m88wfc6",
                  "author": "Nozinger",
                  "body": "they still mostly are. That's why they go for gimmicks like hall effect sticks. It's the snakeoil salesman of the gaming world.",
                  "score": 1,
                  "created_utc": 1737413102.0,
                  "replies": [
                    {
                      "id": "m8938uk",
                      "author": "Appropriate_Lack_727",
                      "body": "8bitdo’s controllers have Hall effect sensors and they’re excellent quality. The price is right, too.",
                      "score": 10,
                      "created_utc": 1737415132.0,
                      "replies": []
                    },
                    {
                      "id": "m8azp2y",
                      "author": "Kered13",
                      "body": "There are still garbage third party controllers out there, but there are a lot of third party controllers right now that are clearly superior to first party \"pro\" controllers and at half the price.",
                      "score": 3,
                      "created_utc": 1737438593.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m87nz5j",
              "author": "rucksacksepp",
              "body": "I sent my stick drift controller to a small repair shop and got it replaced with hall effect sticks and so far I haven't had any issues with stick drift after a year playing daily. It's great",
              "score": 2,
              "created_utc": 1737401023.0,
              "replies": []
            },
            {
              "id": "m886kk4",
              "author": "worldspawn00",
              "body": "Sega put them in the stock Dreamcast and Saturn controllers 25 years ago.",
              "score": 1,
              "created_utc": 1737406090.0,
              "replies": []
            },
            {
              "id": "m88pl5u",
              "author": "PBR_King",
              "body": "Got any recs? I'd kinda like to try this out.",
              "score": 1,
              "created_utc": 1737411158.0,
              "replies": []
            },
            {
              "id": "m892x3b",
              "author": "Appropriate_Lack_727",
              "body": "Yeah, you can buy a very high quality 3rd party Hall Effect equipped Xbox controller for cheaper than the standard Microsoft controller. There’s no defensible reason the OEMs couldn’t make these a standard feature.",
              "score": 1,
              "created_utc": 1737415032.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m85u35e",
          "author": "danielv123",
          "body": "Funny how that works - I know a company that ships joysticks to oil rigs. Their new models has a lot larger deadzone in the center position than the old potentiometer based ones. Turns out they use 2 hall effect sensors on each axis, with one end of the sensor in the middle position, meaning the sensor gives out 0v when it's close to the center.\n\nSo apparently it is possible to screw up hall effect joysticks too.",
          "score": 60,
          "created_utc": 1737382263.0,
          "replies": [
            {
              "id": "m85ybzx",
              "author": "MeatisOmalley",
              "body": "Possible, but you can make a very small deadzone with Hall effect",
              "score": 30,
              "created_utc": 1737383745.0,
              "replies": [
                {
                  "id": "m863qpb",
                  "author": "danielv123",
                  "body": "Yes, as long as you don't mount it so the deadzone is precisely in the location where you need accuracy the most...",
                  "score": 26,
                  "created_utc": 1737385492.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m85tdmj",
          "author": "joeChump",
          "body": "This is why Vin Diesel hates them.",
          "score": 125,
          "created_utc": 1737382005.0,
          "replies": [
            {
              "id": "m85vi0d",
              "author": "OnboardG1",
              "body": "Underrated joke",
              "score": -31,
              "created_utc": 1737382764.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m86j5a5",
          "author": "overtired27",
          "body": "Hall effect sticks can still drift. Source: my hall effect stick drifts. To quote someone else on a different thread: \n\n“Hall sensors don’t fail like potentiometers do when they’re worn down, so you won’t get any drift from the values outputting incorrectly. They’re still prone to how well the physical springs center the stick. That will never be perfect.”\n\nMuch better though. The drift I’ve got isn’t as bad as it was on the stick I replaced.",
          "score": 23,
          "created_utc": 1737389976.0,
          "replies": []
        },
        {
          "id": "m85xzfd",
          "author": "secretqwerty10",
          "body": ">a little more expensive than the regular ones\n\nthis alone will be enough for nintendo to justify them being 100 for a pair",
          "score": 13,
          "created_utc": 1737383625.0,
          "replies": [
            {
              "id": "m863tn4",
              "author": "Theprefs",
              "body": "They already are....oh wait. \\*cries in Canadian\\*",
              "score": 8,
              "created_utc": 1737385519.0,
              "replies": [
                {
                  "id": "m8cs7uy",
                  "author": "ItsColorNotColour",
                  "body": "100 cad is 69,38 usd\n\nCad is not worth the same",
                  "score": 3,
                  "created_utc": 1737470750.0,
                  "replies": [
                    {
                      "id": "m8cxzny",
                      "author": "Theprefs",
                      "body": "Yes, as someone living in Canada I am fully aware Hahaha. I was doing what's called \"a joke\"\n\nBut yeah if they sell SW2 joycons for $100 usd, then we'll be paying $145-150ish for them, so they fuckin better be indestructible at that price. Dual Sense controllers are $80-90 cad",
                      "score": 1,
                      "created_utc": 1737472538.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8bll44",
              "author": "Actual_Specific_476",
              "body": "The fact they were £60 without hall effect already annoys me. Same for all Sony and Xbox.",
              "score": 1,
              "created_utc": 1737450937.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m86d28n",
          "author": "dunno0019",
          "body": "Dude, I've spent the last few months looking at controllers. Since I got into emulation this summer. \n\nHall effects are everywhere. \n\nAnd as the months went by: it's just more and more. \n\nAt this point most 8bitdos are HE. Most Gamesirs are HE. There's just piles and piles of $30-60 options. \n\nAnd often the HE trollers are the same prices as the non-HE. Sometimes cheaper.",
          "score": 14,
          "created_utc": 1737388253.0,
          "replies": [
            {
              "id": "m8a9zbx",
              "author": "not_an_island",
              "body": "Which models would you recommend?",
              "score": 1,
              "created_utc": 1737428639.0,
              "replies": [
                {
                  "id": "m8ac3je",
                  "author": "dunno0019",
                  "body": "Well... in all that shopping Ive only actually bought 2. And 1 wasnt even hall effect lol. But mostly because I didnt know about HE, and I just really needed something smaller than a ds4.\n\nThat was the 8bitdo Lite 2. It is a really great little troller. And I am highly impressed with everything 8bitdo. And Ive been kicking myself ever since because there are a few of their models that are were only like $5 more with HE... but I got stuck on wanting  \"smaller\".\n\nMeanwhile I only got my Gamesir X2s like a week ago. This thing is pretty impressive so far. If you are looking for a discount Backbone, this thing is great. Half the price of a Backbone, w/HE joysticks and triggers.\n\nAnd the only reason I got the X2s was because the 8bitdo Backbone-style troller is (for some reason) only for Android (so far). I really like 8bitdo products lol.\n\nIVe heard great things about their SN30, Pro 2, and Ultimate lines of trollers. Just gotta make sure you grab a hall effect version when you are shopping. They have a lot of very similar models, that each have their own little differences.",
                  "score": 2,
                  "created_utc": 1737429351.0,
                  "replies": []
                },
                {
                  "id": "m8by68t",
                  "author": "ChocoJesus",
                  "body": "I just got a mag-res TMR controller yesterday. Gamesir Cyclone 2\n\nTMR is supposed to be more precise and less perceptible to stick drift then Hall effect. I was considering a Scuf or Xbox elite but they all had Hall effect. Across the board, stick drift after 1-2 years seems like a regular problem with every controller. \n\nI’m still putting the controller through its paces but getting a mag-res TMR controller over Hall effect seemed worth trying. Like it so far but a time well time situation. Only seen TMR sticks in Chinese controllers so far but hopefully if they are better, we’ll see them more, soon",
                  "score": 2,
                  "created_utc": 1737458564.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m86g6fz",
          "author": "ChangeVivid2964",
          "body": "They will very quickly become cheaper if there's enough market demand for them.\n\nPotentiometers are bigger, heavier, and have more moving parts.  Hall effect should be easier to manufacture at scale since they look like basically a transistor.  The same way LEDs became cheaper than glass incandescent bulbs, even though the technology to make them is more complex.",
          "score": 2,
          "created_utc": 1737389136.0,
          "replies": [
            {
              "id": "m886wng",
              "author": "worldspawn00",
              "body": "Sega put them in the stock Dreamcast and Saturn controllers 25 years ago.",
              "score": 2,
              "created_utc": 1737406179.0,
              "replies": [
                {
                  "id": "m888vh5",
                  "author": "ChangeVivid2964",
                  "body": "Yeah and I had a Microsoft joystick that used optical encoders, it was awesome.",
                  "score": 1,
                  "created_utc": 1737406693.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m868hyj",
          "author": "LivermoreP1",
          "body": "Our month old Joycons all have drift.",
          "score": 2,
          "created_utc": 1737386923.0,
          "replies": []
        },
        {
          "id": "m87mck4",
          "author": "JoeFilms",
          "body": "This. I buy them and add them to most of my retro handhelds and they only cost about £2 for a pair. I assume buying in bulk from the factory they would be pennies? It will be ridiculous if they don't have them in 2025.",
          "score": 1,
          "created_utc": 1737400578.0,
          "replies": []
        },
        {
          "id": "m88r8l0",
          "author": "Rackarunge",
          "body": "They are a lot less profit since it will reduce controller sales.",
          "score": 1,
          "created_utc": 1737411621.0,
          "replies": []
        },
        {
          "id": "m892jp1",
          "author": "ClemClamcumber",
          "body": "The trend is already there, but I wouldn't hold my breath with how often Nintendo just willingly sits behind the times. I'm honestly hoping for a regular internet infrastructure that could compete with 2003 Xbox, but here we are.\n\nI'll bet my left nut that all first party PS6 controllers will be hall effect and we might still not see them natively until Switch 3.",
          "score": 1,
          "created_utc": 1737414919.0,
          "replies": []
        },
        {
          "id": "m876ig3",
          "author": "ISB-Dev",
          "body": "quaint humorous ad hoc waiting snails sparkle skirt alive quiet dog\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 0,
          "created_utc": 1737396343.0,
          "replies": [
            {
              "id": "m87ltdu",
              "author": "None",
              "body": "[deleted]",
              "score": 2,
              "created_utc": 1737400434.0,
              "replies": [
                {
                  "id": "m87r5yn",
                  "author": "ISB-Dev",
                  "body": "steer memory serious rich thumb soup screw cautious abounding apparatus\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                  "score": -1,
                  "created_utc": 1737401892.0,
                  "replies": [
                    {
                      "id": "m87vzvw",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 2,
                      "created_utc": 1737403201.0,
                      "replies": [
                        {
                          "id": "m87y8yh",
                          "author": "ISB-Dev",
                          "body": "act coherent quickest label heavy sophisticated juggle bag familiar placid\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                          "score": 0,
                          "created_utc": 1737403825.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m85vrmy",
      "author": "unematti",
      "body": "Hall effect should've been standard 5 years ago. Now, you could have keyboards with full array hall effect switches for the same price as relatively good value mechanicals, so it's quite an old and reliable tech",
      "score": 117,
      "created_utc": 1737382857.0,
      "replies": [
        {
          "id": "m8714ts",
          "author": "FishieUwU",
          "body": "The Dreamcast had Hall effect sticks...",
          "score": 50,
          "created_utc": 1737394929.0,
          "replies": [
            {
              "id": "m8870qc",
              "author": "worldspawn00",
              "body": "Yep, it and the Saturn factory controllers used hall effect sticks.",
              "score": 14,
              "created_utc": 1737406210.0,
              "replies": []
            },
            {
              "id": "m873s1f",
              "author": "unematti",
              "body": "Well there you go then.\n\nI never had one of those so I didn't know",
              "score": 3,
              "created_utc": 1737395622.0,
              "replies": []
            },
            {
              "id": "m8e5379",
              "author": "Glo_Biden",
              "body": "TIL",
              "score": 1,
              "created_utc": 1737484570.0,
              "replies": []
            },
            {
              "id": "m8erks9",
              "author": "jimmykup",
              "body": "Say whaaaaa",
              "score": 1,
              "created_utc": 1737490697.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m86gr3c",
          "author": "ChangeVivid2964",
          "body": "It should be cheaper than mechanicals.  Less metal, fewer moving parts.",
          "score": 12,
          "created_utc": 1737389299.0,
          "replies": [
            {
              "id": "m87rec7",
              "author": "artikiller",
              "body": "Except the metal used in mechanical switches is very minor while having a hall effect sensor on every key (and a mcu that's fast enough to process data from 80+ sensors at one) is fairly expensive",
              "score": 17,
              "created_utc": 1737401955.0,
              "replies": [
                {
                  "id": "m8a26ht",
                  "author": "maniaq",
                  "body": "you would not necessarily need a sensor on every key\n\nin fact, when it comes to magnetic fields, the more you optimise the number of the sensors you use – between 1 and, say, 50 – the more reliable your data is going to be\n\nbeing able to process minor variations (due to keys being pressed) of magnetic field strength across an entire keyboard should not be particularly hard to do - and should be achievable with relatively \"dumb\" circuitry, rather than trying to involve a whole microcontroller apparatus\n\nI would guess the shielding is most likely to be where the hardware starts to get expensive\n\nit's already _very_ easy to mess with modern electronics by placing them close to, say a speaker magnet...",
                  "score": 0,
                  "created_utc": 1737426109.0,
                  "replies": [
                    {
                      "id": "ml40dxd",
                      "author": "ILikeYourBigButt",
                      "body": "ah yes, in head assumptions equal real world costs.",
                      "score": 0,
                      "created_utc": 1743635994.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m89vbbz",
              "author": "None",
              "body": "Valve commented that they tried Hall effect sticks but weren’t impressed with the performance of them.  So it seems like there are reasons other than cost that they aren’t standard. ",
              "score": 1,
              "created_utc": 1737423940.0,
              "replies": [
                {
                  "id": "m8bqira",
                  "author": "alidan",
                  "body": "considering they have hall effect upgrade kits for steamdeck, they were looking at some profoundly shit options.",
                  "score": 1,
                  "created_utc": 1737454048.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m86k9pk",
              "author": "unematti",
              "body": "It is full addressable rgb and every key can be programmed as analog axes. I'm guessing it's the driving software and the microcontroller being more complicated that makes it v relatively expensive. It was the wooting he60, costed 189 euro plus 29 for the carrying case(very sturdy, it's worth it I think!)\n\nActually I remembered 280,and every since my expensiveness-sense changed, because now looking back at it... Very reasonable price and very good quality typing experience...",
              "score": -2,
              "created_utc": 1737390294.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m86iumn",
      "author": "HeyBoone",
      "body": "With HE being magnetic based wonder how the magnetic controller attachment would affect their function.",
      "score": 17,
      "created_utc": 1737389892.0,
      "replies": [
        {
          "id": "m87a7td",
          "author": "bsmitty358",
          "body": "Not an expert but assume it was just be a constant offset to be ignored",
          "score": 6,
          "created_utc": 1737397337.0,
          "replies": [
            {
              "id": "m887i6g",
              "author": "worldspawn00",
              "body": "They calibrate at startup, and the sensors require very close proximity to the magnets.  It won't be an issue.",
              "score": 9,
              "created_utc": 1737406337.0,
              "replies": [
                {
                  "id": "m88xt3u",
                  "author": "HeyBoone",
                  "body": "Good to know!",
                  "score": 1,
                  "created_utc": 1737413504.0,
                  "replies": []
                },
                {
                  "id": "m8bqtd4",
                  "author": "alidan",
                  "body": "they don't need close proximity, the sensors sense magnetic fields, that said, calibration at start calibrates any interfering magnetic field as normal.",
                  "score": 1,
                  "created_utc": 1737454228.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m890ls7",
          "author": "CosmicCreeperz",
          "body": "Good question!  Though mine is more wondering how strong the magnets are… my biggest issue with the joycons wasn’t the drift but that the stupid plastic sliders connecting them to the Switch would let them come off after they got worn. I had to stick a bunch of duct tape on them to keep them connected to the main console.",
          "score": 1,
          "created_utc": 1737414330.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m85s4u1",
      "author": "w1n5t0nM1k3y",
      "body": "Why did drift exist in the first place? I have GameCube controllers from sometime around 2004-2005 and none of them have drift. They sure don't use Hall effect, so what changed between then and now that we all of a sudden need Hall effect to have thumbsticks that don't drift?  And it's not just the Switch. drift affects most controllers now, although Switch was particularly bad for it.",
      "score": 151,
      "created_utc": 1737381547.0,
      "replies": [
        {
          "id": "m85tih8",
          "author": "hyrumwhite",
          "body": "It was definitely a thing on N64 controllers. It’s always going to develop on analog joysticks because they use the resistance between two contacting pieces of metal to determine joystick position. The metal wears down eventually. ",
          "score": 117,
          "created_utc": 1737382055.0,
          "replies": [
            {
              "id": "m869h5q",
              "author": "SirEarlOfAngusLee",
              "body": "N64 controllers had a different issue, the plastic grinds overtime and wears down; causing the drift and looseness. Mario party 1 is famous for causing so many issues by having repetitive motions that destroyed the plastic super fast.",
              "score": 62,
              "created_utc": 1737387210.0,
              "replies": [
                {
                  "id": "m86au7q",
                  "author": "TheCrimsonChin-ger",
                  "body": "Mario party 2 also had a ton of games that required rotating and back and forth motions on the joystick too. You can probably blame 3 as well but I didn't play much 3.",
                  "score": 14,
                  "created_utc": 1737387608.0,
                  "replies": []
                },
                {
                  "id": "m8762f2",
                  "author": "TheSonOfDisaster",
                  "body": "I remember there just being like grey dust in the joystick well after some group sessions of Mario party",
                  "score": 4,
                  "created_utc": 1737396223.0,
                  "replies": []
                },
                {
                  "id": "m87tyt3",
                  "author": "bitches_love_pooh",
                  "body": "It also lead to a weird but distinct blister on your palm",
                  "score": 3,
                  "created_utc": 1737402651.0,
                  "replies": [
                    {
                      "id": "m87zqr7",
                      "author": "SirEarlOfAngusLee",
                      "body": "and you could get free gloves if you mailed it and asked for some lol!",
                      "score": 1,
                      "created_utc": 1737404240.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m874rrh",
                  "author": "QueezyF",
                  "body": "Yep, which is why steel parts became really popular for people rebuilding N64 controllers.",
                  "score": 1,
                  "created_utc": 1737395878.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m85wik8",
              "author": "Fakeduhakkount",
              "body": "That’s for sure. One official and one unofficial had the drift. Though I could save money and the fancy controlled tricks too but ended up being trash. My middle stick got ruined since the Mario64 and some games the joystick need to be spund in a full circle multiple times to toss Bower! I would see plastic shavings at base of stick!",
              "score": 15,
              "created_utc": 1737383119.0,
              "replies": [
                {
                  "id": "m86c4zj",
                  "author": "ScoobyDeezy",
                  "body": "The original Mario Party has entered the chat.",
                  "score": 8,
                  "created_utc": 1737387985.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m86m7so",
              "author": "Nobody_1707",
              "body": "The N64 stick would break if you even looked at it funny. There was a time when I almost couldn't beat Great Bay Temple because the stick drift was ruining my jumps.",
              "score": 0,
              "created_utc": 1737390837.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m85ttoj",
          "author": "its_justme",
          "body": "GameCube controllers 100% do drift over time. I had a few back in the day that were basically limp. But it took a long time and quite a bit of use. I’m sure my friends and I were not kind to electronics back then either as kids.",
          "score": 38,
          "created_utc": 1737382168.0,
          "replies": [
            {
              "id": "m864mtj",
              "author": "Jiannies",
              "body": "I was about to say, I thought it was an official house rule that loser of the last game gets the shitty controller",
              "score": 13,
              "created_utc": 1737385768.0,
              "replies": [
                {
                  "id": "m865gtg",
                  "author": "powerof27",
                  "body": "The loser? I thought it was supposed to be the winner to balance it out",
                  "score": 10,
                  "created_utc": 1737386021.0,
                  "replies": [
                    {
                      "id": "m868sep",
                      "author": "Jiannies",
                      "body": "Yeah you would think. It was an unforgiving household",
                      "score": 9,
                      "created_utc": 1737387007.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m865fmu",
                  "author": "its_justme",
                  "body": "Or the least liked guest gets the Madcatz controller lol",
                  "score": 6,
                  "created_utc": 1737386011.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8750jw",
              "author": "QueezyF",
              "body": "I’ve got one right now that needs a replacement. Didn’t realize how bad it was until some friends came over to play Smash.",
              "score": 1,
              "created_utc": 1737395943.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m85tjon",
          "author": "Cookie_505",
          "body": "GameCube would zero out the sticks when the console started. That's the difference, if it's not perfect that will account for it unless it's really bad. Switch doesn't do that presumably because that would cause issues if you were holding the stick when it started.",
          "score": 99,
          "created_utc": 1737382066.0,
          "replies": [
            {
              "id": "m85ucqn",
              "author": "Specialist-Rope-9760",
              "body": "I forgot this was a thing. I remember back in the day there’d be times I accidentally held a stick down when powering on and everything went mad",
              "score": 79,
              "created_utc": 1737382357.0,
              "replies": [
                {
                  "id": "m85vnq0",
                  "author": "CosmicOwl47",
                  "body": "Or if a controller was getting old and the analog stick was loose, I’d have to make sure it wasn’t tilting when I turned on the console",
                  "score": 26,
                  "created_utc": 1737382820.0,
                  "replies": []
                },
                {
                  "id": "m85zntw",
                  "author": "None",
                  "body": "I definitely remember problems with controllers being stuck doing an up input and having to unplug/replug them until they stopped. It was like really common actually",
                  "score": 9,
                  "created_utc": 1737384193.0,
                  "replies": []
                },
                {
                  "id": "m85z8db",
                  "author": "L4t3xs",
                  "body": "X + Y + Start",
                  "score": 4,
                  "created_utc": 1737384051.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m860kzr",
              "author": "Tabelel",
              "body": "There’s option in the Switch settings to manually recalibrate the joysticks. But given that didn’t always fix the issue means there must be more to it than that.",
              "score": 33,
              "created_utc": 1737384492.0,
              "replies": []
            },
            {
              "id": "m868pt0",
              "author": "TotoCocoAndBeaks",
              "body": "Zeroing out wouldn't have any affect on the drift. It can be working perfectly fine, then you can be running in a direct, let go of the stick, and you continue running in that direction, then return to working normally for a while. That kind of intermittant issue can't be addressed by zeroing on connection, as it was callibrated just fine while it was not drifting, and once it stops drifting also.\n\nIf you use the callibration tool and witness it when it starts drifting, you see the 'sticks moving' substantially on their own, well outside any zero area.",
              "score": 15,
              "created_utc": 1737386986.0,
              "replies": []
            },
            {
              "id": "m86iepu",
              "author": "Stringsandattractors",
              "body": "Modern consoles don’t do this..?",
              "score": 2,
              "created_utc": 1737389767.0,
              "replies": []
            },
            {
              "id": "m878f6o",
              "author": "Killzone3265",
              "body": "there is also the button combo of holding X + Y + Z for a few seconds to recalibrate it. i don't think any other controller i know of has this feature",
              "score": 1,
              "created_utc": 1737396858.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m85tfiw",
          "author": "Awyls",
          "body": "They all drift, the difference is that now they are made by the cheapest factory in China you can find forcing you to buy a new one in a few years. Good quality joysticks will eventually drift, but not as fast as the shit they make now.",
          "score": 24,
          "created_utc": 1737382025.0,
          "replies": [
            {
              "id": "m8c4zjt",
              "author": "Inprobamur",
              "body": "Sega Saturn and Dreamcast don't. Because they used hall effect sensors.",
              "score": 1,
              "created_utc": 1737462033.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m85sw3n",
          "author": "Swizzy88",
          "body": "They made it worse by denying it was an issue for quite a while. Even then, spending that much on a console only to have to send your controller away for weeks just to replace a joystick worth a few cents sucks. I replaced 3 joysticks in 2 years. Meanwhile my PS2 controller works, my 6+ year old dualshock 4 works just fine.",
          "score": 19,
          "created_utc": 1737381826.0,
          "replies": [
            {
              "id": "m85tzd5",
              "author": "Sylvurphlame",
              "body": "What they should’ve done is replace drifting thumbsticks with Hall Effect ones in both manufacturing and replacements as soon as the drift was a known issue. After I noticed drift in my left thumbstick,  I just replaced them both with Hall Effect sticks from Amazon. I could’ve sent them off for repair/replacement but why hassle with the downtime.",
              "score": 5,
              "created_utc": 1737382224.0,
              "replies": [
                {
                  "id": "m85ub1e",
                  "author": "Swizzy88",
                  "body": "Yeah that would have been the best thing to do. Considering how expensive the controllers are they should have been HALL to begin with.",
                  "score": 2,
                  "created_utc": 1737382341.0,
                  "replies": [
                    {
                      "id": "m85uvun",
                      "author": "Sylvurphlame",
                      "body": "All about shaving off 5¢ a unit in manufacturing. Only semi-sarcastic when we’re talking about millions of units, but Nintendo *had* a reputation for durability to keep and should’ve done it on principle in my opinion.",
                      "score": 3,
                      "created_utc": 1737382546.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m85vgmb",
              "author": "BortGreen",
              "body": "I remember quite a few PS2 controllers drifting\n\nDS4 is great though, maybe my favorite controller alongside Switch Pro",
              "score": 1,
              "created_utc": 1737382751.0,
              "replies": []
            },
            {
              "id": "m88bqxu",
              "author": "gay_manta_ray",
              "body": "newer dualshock 4s are garbage unfortunately. my first one lasted almost a decade, and the one i bought after that developed awful drift in about six months.",
              "score": 1,
              "created_utc": 1737407451.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m85u3qm",
          "author": "Suprehombre",
          "body": "In my overall experience I've had many controllers over several console generations experience analog issues. I've also had some that are rock solid after decades of use. Couldn't really tell you the science. \n\nUsually when I talk to anyone, since analog was introduced in N64, my controllers have either had analog issues or bumper issues.",
          "score": 6,
          "created_utc": 1737382269.0,
          "replies": [
            {
              "id": "m85w4n5",
              "author": "OnboardG1",
              "body": "My battered old Xbox controller I use with my PC is fine after years of use. The one I bought my Dad for Christmas a couple of years ago had drift issues inside 18 months. It’s just going to depend on so many things that it’s hard to pin down one in particular. Temperature, manufacturing tolerance, the material batch used to make the potentiometer, mechanical load over time and how well the solder machine was working that day will all contribute.",
              "score": 2,
              "created_utc": 1737382985.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m869b36",
          "author": "Nickoten",
          "body": "I have noticed this too, I got a little drift on one of my ps5 controllers within a few months. A couple of my GameCube controllers also had drift but this was after years of Smash brothers.",
          "score": 5,
          "created_utc": 1737387161.0,
          "replies": []
        },
        {
          "id": "m880kfy",
          "author": "Jimbo_The_Prince",
          "body": "Real answer? The factory that made the \"indestructi-pots\" in your GameCube was shut down decades ago and modern factories **won't** spend the $0.00000001/unit to make theirs comparable (cuz they totally **could** make them that good if they cared enough.)",
          "score": 4,
          "created_utc": 1737404467.0,
          "replies": [
            {
              "id": "m8b0fkw",
              "author": "Kered13",
              "body": "Gamecube pots were never indestructible, as any competitive Melee player can tell you, and the pots on the modern GC controllers are just as good as the originals, and they very rarely experience drift. In addition to using better pots than the Switch, I believe software calibration and dead zones also contribute to preventing drift.\n\nThat said Hall Effect is still better and is the standard for high level Melee these days (this requires modifying the controller).",
              "score": 2,
              "created_utc": 1737438950.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m86231p",
          "author": "Racheakt",
          "body": "I have an OG Xbox (dukes) that I still use the launch day controllers on with zero issue, also still use my launch day Xbox 360 controllers zero issues.\n\nI have drift on one of my Xbox One controllers and at one point all my switch joycons \n\nI think companies are cheating out on the quality.",
          "score": 2,
          "created_utc": 1737384972.0,
          "replies": [
            {
              "id": "m86gnzf",
              "author": "ChangeVivid2964",
              "body": "> still use my launch day Xbox 360 controllers zero issues.\n\nSame.  Still using it as my daily pc controller over a decade later.\n\nI buy every Xbox 360 gamepad I see now because of how they were built to last decades.  Saw one in the thrift shop the other day for $10, bought it, cleaned it, don't use it, but now I have 4.",
              "score": 2,
              "created_utc": 1737389274.0,
              "replies": [
                {
                  "id": "m86r0mj",
                  "author": "homer_3",
                  "body": "> I buy every Xbox 360 gamepad I see now because of how they were built to last decades\n\nMan, that sounds like a joke to me. 360 controllers literally fall apart in my hands. Particularly the joysticks. The circle at the top tends to just crumble after a few years. Their sticks drift like crazy too.",
                  "score": 4,
                  "created_utc": 1737392166.0,
                  "replies": []
                },
                {
                  "id": "m86n754",
                  "author": "sakatan",
                  "body": "You can always sell them to the US Navy for an... appropriate markup 😃",
                  "score": 1,
                  "created_utc": 1737391109.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m86qzws",
          "author": "esperlihn",
          "body": "That's the craziest thing. Apparently this has alwwys been an issue but I only ever noticed it in the switch. \n\nMaybe with the older consoles I was too much of a dumb kid to notice. But in my memories it was always only the third party controllers that would drift.",
          "score": 1,
          "created_utc": 1737392160.0,
          "replies": []
        },
        {
          "id": "m878miu",
          "author": "Killzone3265",
          "body": "i've had my main controller since gamecube released, it only started drifting the other year. *but*, the console and controllers have failsafes that allow for on the spot calibration and it has tamed the issue almost every time.",
          "score": 1,
          "created_utc": 1737396913.0,
          "replies": []
        },
        {
          "id": "m87x49t",
          "author": "Huemun",
          "body": "every joystick will drift as the plastic degrades and the components fail. The point is extending that time to years instead of months of use.",
          "score": 1,
          "created_utc": 1737403512.0,
          "replies": []
        },
        {
          "id": "m88g1p0",
          "author": "NizarNoor",
          "body": "Yeah I was gonna say the same. I have all PlayStation consoles since the first one. I've never experienced drift until PS5, and it was only a year old.",
          "score": 1,
          "created_utc": 1737408588.0,
          "replies": []
        },
        {
          "id": "m88z8hd",
          "author": "Nozinger",
          "body": "So the way this works is that all sticks generate bad readings over time.  \nWhat changed was not our sticks getting worse and all of that but the other way round: out sticks got more precise.  \nDeadzones shrank and even miniscule movements are picked up by modern sticks without any issue. On older systems you might have to move the stick a lot more for the same change.\n\nThe problem with higher precision is that if you get a bad reading that is also picked up more easily. That is where the stickdrift issue comes from. Theoretically you can solve that in software enough to at least make these issues manageable but for some reason the industry decided to dumb down the controller interface so hard that at most you get a sensitivity slider.  \nPeopel see these controllers as plug and play hardware you just put in and they have to work without settng up, maintenance or anyy customisation but that is jsut not how precision hardware works.  \nYou sometimes need to set new parameters so that the hardware keeps working perfectly.  \nIt's not difficult to include a short sticks setup guide in your system software. We had that. Not even that long ago i think i saw something like that on the xbox one.\n\nNowadays on the ps5 you can decide how bright the light on the controller is....",
          "score": 1,
          "created_utc": 1737413921.0,
          "replies": []
        },
        {
          "id": "m8azw11",
          "author": "I_Was_Fox",
          "body": "Bro what? All of my old GameCube controllers had drift. Not just the sensor wear kind either. The joysticks would just straight up start sagging to one side or the other like they got loose in their seating.",
          "score": 1,
          "created_utc": 1737438687.0,
          "replies": []
        },
        {
          "id": "m8bqnpi",
          "author": "alidan",
          "body": "the smaller the potentiometers the sooner it will happen, why they dont let you recalibrate or hell just set a larger deadzone is beyond me as it would solve the issue.",
          "score": 1,
          "created_utc": 1737454132.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m86bs6z",
      "author": "BluDYT",
      "body": "With how cheap it is to use these days there's absolutely no good reason any of the major 3 players shouldn't be using hall effect.",
      "score": 13,
      "created_utc": 1737387881.0,
      "replies": [
        {
          "id": "m86nt7c",
          "author": "DragonSlayerC",
          "body": "Power consumption would be a reason. Hall Effect joysticks consume a lot more power than regular joysticks. TMR joysticks solve this problem and are also more precise than hall effect.",
          "score": 6,
          "created_utc": 1737391280.0,
          "replies": [
            {
              "id": "m86sm24",
              "author": "BluDYT",
              "body": "Maybe but it really does seem like my 8bitdo ult 2c lasts noticably longer then a dualsense controller and that was like $20",
              "score": 8,
              "created_utc": 1737392601.0,
              "replies": [
                {
                  "id": "m86vsjf",
                  "author": "DragonSlayerC",
                  "body": "I also have a 2C and agree that the battery life is wild, even when using the USB dongle for 1000hz polling. But power consumption is still technically an advantage of older style and new TMR over hall effect, which may be even more important for a really tiny controller like the joycons.",
                  "score": 1,
                  "created_utc": 1737393480.0,
                  "replies": [
                    {
                      "id": "m8bqyvi",
                      "author": "alidan",
                      "body": "there are hall effect replacements for switch controllers, could look those up and see if there is a noteable battery use increase.",
                      "score": 1,
                      "created_utc": 1737454322.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m86h701",
      "author": "LoL_is_pepega_BIA",
      "body": "Hall effect sticks should be standard issue on every single joystick. \n\nThey last a lot longer and are more accurate.\n\nThe only people who'd hate it are those in favor of planned obsolescence",
      "score": 25,
      "created_utc": 1737389423.0,
      "replies": [
        {
          "id": "m87sbf9",
          "author": "artikiller",
          "body": "> hall effect sticks\n\n\nNo, hall effect encoders for everything. Most mice still use regular mechanical encoders that are extremely prone to wear related issues and i'm sick of it",
          "score": 1,
          "created_utc": 1737402202.0,
          "replies": [
            {
              "id": "m887vcm",
              "author": "worldspawn00",
              "body": "? most mice use optical sensors for both movement and scroll.",
              "score": 5,
              "created_utc": 1737406431.0,
              "replies": [
                {
                  "id": "m88ax0n",
                  "author": "artikiller",
                  "body": "They use optical sensors for movement yes. Scroll wheels in 90% of mice are still mechanical wheels",
                  "score": 4,
                  "created_utc": 1737407229.0,
                  "replies": [
                    {
                      "id": "m895cab",
                      "author": "worldspawn00",
                      "body": "It's a mechanical wheel with slots, that's read with an optical sensor. It's not a resistive element or switch. Usually they start not reading right, it's just junk in the slots on the inner wheel which can be cleared with compressed air, the sensor element rarely goes bad.",
                      "score": 2,
                      "created_utc": 1737415776.0,
                      "replies": [
                        {
                          "id": "m896ib0",
                          "author": "artikiller",
                          "body": "It's not. It's a mechanical encoded that uses mechanical contacts. Optical encoders are still extremely rare in mice",
                          "score": 1,
                          "created_utc": 1737416146.0,
                          "replies": [
                            {
                              "id": "m897qkl",
                              "author": "worldspawn00",
                              "body": "I guess I'm buying better mice, every one I've had for the past decade+ has been optical. Similar to this: https://superuser.com/questions/1271240/how-does-a-logitech-scroll-wheel-detect-movement\n\nThat's a 7 year old post, they're not new tech.",
                              "score": 2,
                              "created_utc": 1737416536.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m88ehwc",
                      "author": "triadwarfare",
                      "body": "True. I replaced my Logitech G102's scroll wheel encoder thrice. Other people would just throw the mice in the trash. I've also replaced my mouse's Omron switches from the Chinese variant to Japanese. They're stiffer but at least they don't suffer from double click failures",
                      "score": 1,
                      "created_utc": 1737408176.0,
                      "replies": [
                        {
                          "id": "m88shs7",
                          "author": "artikiller",
                          "body": "The op1 8k/op1w 4k might be interesting for you to look into",
                          "score": 1,
                          "created_utc": 1737411979.0,
                          "replies": [
                            {
                              "id": "m8b11av",
                              "author": "triadwarfare",
                              "body": "I checked the price and sorry no thanks, especially if you have a double whammy of a global recession and live in a third world country.",
                              "score": 1,
                              "created_utc": 1737439245.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m8b0okv",
                      "author": "Kered13",
                      "body": "Don't they use an optical sensor to measure the wheel, and the mechanics are just for creating the notched feel?",
                      "score": 1,
                      "created_utc": 1737439071.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8br7j5",
              "author": "alidan",
              "body": "you would want laser sensors in a mouse, like laser switches for keyboards, they go up and down mechanically but the press is registered when a laser hits an optical sensor. \n\nthat would be the idea for everything in a mouse if you could make everything feel normal.",
              "score": 1,
              "created_utc": 1737454468.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8880vn",
          "author": "worldspawn00",
          "body": "Sega used them in the Dreamcast and Saturn controllers 25 years ago.",
          "score": 1,
          "created_utc": 1737406471.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m869bdz",
      "author": "None",
      "body": "[removed]",
      "score": 38,
      "created_utc": 1737387163.0,
      "replies": [
        {
          "id": "m86lifp",
          "author": "Neo_Techni",
          "body": "You're lucky they don't have right angles like the NES controller",
          "score": 22,
          "created_utc": 1737390639.0,
          "replies": [
            {
              "id": "m86wlas",
              "author": "coalForXmas",
              "body": "They’ll just put needles on the corners so it stays in your hands",
              "score": 13,
              "created_utc": 1737393698.0,
              "replies": [
                {
                  "id": "m87433n",
                  "author": "Neo_Techni",
                  "body": "can't have any drift if you don't have any blood!",
                  "score": 5,
                  "created_utc": 1737395701.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m87expn",
          "author": "Pepperh4m",
          "body": "That's what I was thinking. If they're gonna make it bigger anyway, might as well add some heft to the back of the joycon so it doesn't feel like you're holding a flat slab.",
          "score": 4,
          "created_utc": 1737398594.0,
          "replies": [
            {
              "id": "m891juv",
              "author": "CosmicCreeperz",
              "body": "Argh, no, I don’t want the whole thing to be heavier.  I want a comfortable console with great control like the SteamDeck, and if I want to plug it into a PC I’m happy to buy another controller.  But the detachable bit is the product gimmick Nintendo just won’t let go of…",
              "score": 1,
              "created_utc": 1737414615.0,
              "replies": [
                {
                  "id": "m8j9gj6",
                  "author": "None",
                  "body": "Detachable is a good gimmick here I think. You can basically get the controller that fits your hands best. The Steam Deck is comfy if you have big hands, but I’m not giving that thing to a kid lol.\n\nInterchangeable controllers is an all sizes answer.",
                  "score": 1,
                  "created_utc": 1737553721.0,
                  "replies": [
                    {
                      "id": "m8k6e1w",
                      "author": "CosmicCreeperz",
                      "body": "Wait, does Nintendo make different size joycons?  I haven’t seen that.",
                      "score": 1,
                      "created_utc": 1737563574.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m87z0zn",
          "author": "ClassicHat",
          "body": "I’ll probably end up buying a third party controller pad that’s basically a pro controller split in half like I did for my switch 1. You need quite a bit of thickness for ergonomics, but Nintendo will likely want to keep the switch somewhat thin even though they’re already making it bigger and it was never meant to fit in you pocket anyway",
          "score": 3,
          "created_utc": 1737404041.0,
          "replies": []
        },
        {
          "id": "m8917rs",
          "author": "CosmicCreeperz",
          "body": "Seriously, bothering to make them detachable is a bit of a gimmick.  \n\nUseless unless it’s plugged into a TV, in which case the only use is casual multiplayer gaming… as you’d have to be insane to play a serious single player game with them.  Pro controller for Zelda etc on my TV was an essential accessory.",
          "score": 2,
          "created_utc": 1737414515.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m860z2l",
      "author": "violetfoxy",
      "body": "Finally bringing back that 90s tech that so many ignored to save a little money",
      "score": 10,
      "created_utc": 1737384619.0,
      "replies": []
    },
    {
      "id": "m86euww",
      "author": "Lunarcomplex",
      "body": "I'll still never see myself using joycon, but good on em if true",
      "score": 4,
      "created_utc": 1737388764.0,
      "replies": []
    },
    {
      "id": "m864phg",
      "author": "wjean",
      "body": "Anyone want to bet that the small male contact blade that connects to the joycons will be Nintendos next headache?",
      "score": 22,
      "created_utc": 1737385791.0,
      "replies": [
        {
          "id": "m86xo7s",
          "author": "rexx2l",
          "body": "im surprised they didn't use a MagSafe-like connector, nothing to break off and if the connections got dirty a q-tip and isopropyl alcohol would be all you need",
          "score": 16,
          "created_utc": 1737393993.0,
          "replies": [
            {
              "id": "m86ybgl",
              "author": "wjean",
              "body": "Me too. Was the most surprising design change.",
              "score": 7,
              "created_utc": 1737394170.0,
              "replies": []
            },
            {
              "id": "m87s0n6",
              "author": "artikiller",
              "body": "Probably because there's a non zero chance that some piece of metal (a paperclip or something) can short the charging pin.",
              "score": 3,
              "created_utc": 1737402121.0,
              "replies": [
                {
                  "id": "m8aozsa",
                  "author": "_RADIANTSUN_",
                  "body": "Yeah but that is literally just completely stupid engineering in 2025 when we have many ways to prevent exactly such risks... Exactly something I wouldn't out it beyond Nintendo do anyway.",
                  "score": 1,
                  "created_utc": 1737433968.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m887n3q",
              "author": "worldspawn00",
              "body": "Could have just used USBC ports too.",
              "score": 1,
              "created_utc": 1737406372.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m87k9dg",
          "author": "None",
          "body": "[deleted]",
          "score": 9,
          "created_utc": 1737400010.0,
          "replies": [
            {
              "id": "m88nes4",
              "author": "LionIV",
              "body": "There are people who forcibly slid the joycons on the switch from *the bottom up*. Never underestimate the stupidity of humans.",
              "score": 7,
              "created_utc": 1737410559.0,
              "replies": [
                {
                  "id": "m8baakx",
                  "author": "iiiinthecomputer",
                  "body": "Ah you met my children then?\n\nThe joycons really needed to have better keying to prevent that. But it's still dumb.",
                  "score": 2,
                  "created_utc": 1737444140.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m86lmjm",
          "author": "Neo_Techni",
          "body": "It should have been on the joycon side since that's easier to replace than an entire console...",
          "score": 0,
          "created_utc": 1737390672.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8640bz",
      "author": "NoOneCallsMeChicken",
      "body": "Whats drift and hall effect? Not a Nintendo guy.",
      "score": 9,
      "created_utc": 1737385577.0,
      "replies": [
        {
          "id": "m86dqln",
          "author": "RedTalon19",
          "body": "This is not a Nintendo specific issue. Its a \"cheap\" joystick issue that's easily avoidable by using Hall Effect style joysticks.\n\nNormal joysticks work by having 2 physical pieces touch each other, and over time the friction will wear them down and eventually the joystick inputs will become less precise and may even produce erratic inputs unintended by the user. This decrease in accuracy and reliability is dubbed joystick drift, stick drift, or simply drift.\n\nThe \"Hall Effect\" was discovered by a physicist named Hall, who proved that a conductor placed between 2 magnets will produce an electrical current. The important fact here is that none of these components need to touch each other in order to work. Joysticks based on this \"Hall Effect\" technology suffer no stick drift because there is nothing to wear down.\n\nThe only downside? They are more expensive to make (and I believe slightly heavier, but that is very marginal at most. Don't quote me on this.)",
          "score": 26,
          "created_utc": 1737388447.0,
          "replies": []
        },
        {
          "id": "m86asqz",
          "author": "jstnryan",
          "body": "Drift is when a joystick doesn’t self-center or causes in-game movement when not touched. \n\nHall Effect is a physical property used in electronic sensors where a magnet causes an electric field in a sensor that is used to determine the position of the magnet.",
          "score": 9,
          "created_utc": 1737387597.0,
          "replies": [
            {
              "id": "m86i0n0",
              "author": "TheOneWhoDings",
              "body": "Would be awesome if someone could explain the relationship between those. Hopefully someone shows up.",
              "score": -1,
              "created_utc": 1737389658.0,
              "replies": [
                {
                  "id": "m86kptn",
                  "author": "tchikboom",
                  "body": "Drift is usually caused by wearing the joystick and/or dirt, which are not an issue with magnets",
                  "score": 1,
                  "created_utc": 1737390418.0,
                  "replies": []
                },
                {
                  "id": "m86l5vz",
                  "author": "Nobody_1707",
                  "body": "Joysticks that don't use hall effect sensors naturally have wear and tear due to friction which eventually causes drift (or quickly causes drift in the case of JoyCons). As no piece ever touches another using a Hall effect sensor, there is no friction, and the stick will continue to work drift-free indefinitely.",
                  "score": 1,
                  "created_utc": 1737390542.0,
                  "replies": []
                },
                {
                  "id": "m86mdz3",
                  "author": "jstnryan",
                  "body": "I am not completely knowledgeable about Switch-specifics on this, but it’s clear that the original JoyCon used a different type of sensor that was possibly prone to interference (by dirt, for example) or that degraded in performance quickly. \n\nHall Effect sensors on the other hand are an old, “tried and tested” technology that are really only susceptible to magnetic interference (high levels, or at very close range), or physical interference (if something breaks or gets misaligned). Hall Effect is commonly used in industrial machines and robotic equipment (think anywhere a servo motor exists) to track or index (“center”) motor movements. Magnets attached to moving parts (on a wheel, gear, or belt) are used as reference points, which are used to calculate distance, angle, or to calibrate center as they pass over or by the Hall sensor.\n\nIn the case of the new Switch, I’m imagining that there are one or two (at 90° to each other) magnets attached to the bottom of the joystick, and two or four (for error correction or redundancy) Hall sensors very close to those magnets to detect the position of the joystick. The magnets induce a varying electrical field in the sensor as they move near it, so in this way, as the joystick is moved around, the position can be calculated by combining the X- and Y-offsets.",
                  "score": 1,
                  "created_utc": 1737390884.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m86kv6b",
      "author": "FlunkedWhale",
      "body": "Hope they fix it. Mine had bad drift problems though any time it happens I use electrical contact cleaner which fixes the issue but it's always temporary so every few months I need to clean them.",
      "score": 3,
      "created_utc": 1737390459.0,
      "replies": []
    },
    {
      "id": "m85rup7",
      "author": "Cactuszach",
      "body": "Nintendo shouldn’t get any praise for doing the thing they should have done years ago.",
      "score": 62,
      "created_utc": 1737381443.0,
      "replies": [
        {
          "id": "m85sf8j",
          "author": "FerricDonkey",
          "body": "Nah, people should always get praise for doing the right thing. \n\n\nPhilosophically, because they did a good thing and because changing from doing the wrong thing to the right thing takes work. \n\n\nPractically, because if you don't recognize changes from the wrong thing to the right thing, you don't give anyone any reason to do the right thing. ",
          "score": 185,
          "created_utc": 1737381653.0,
          "replies": [
            {
              "id": "m85u55d",
              "author": "None",
              "body": "[removed]",
              "score": 45,
              "created_utc": 1737382283.0,
              "replies": [
                {
                  "id": "m85wwh6",
                  "author": "VeracityMD",
                  "body": "Journey before destination Radiants",
                  "score": 7,
                  "created_utc": 1737383251.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m85uv1x",
              "author": "throwaway_xmr",
              "body": "Excellently worded, will take that view with me. Thx.",
              "score": 7,
              "created_utc": 1737382538.0,
              "replies": []
            },
            {
              "id": "m85u36y",
              "author": "Specialist-Rope-9760",
              "body": "The right thing would have been to do a redesign years ago when they were aware it was an issue. Not ignore it",
              "score": -13,
              "created_utc": 1737382264.0,
              "replies": [
                {
                  "id": "m85whhx",
                  "author": "Revolutionary--man",
                  "body": "Potentially, but it's not like they haven't offered free repairs for faulty joycons, which is fair compensation.\n\nThey decided the repair scheme cost them less than the R&D costs of fixing stick drift, and if we're honest we have no idea how sound of a decision that actually was because we don't know what that cost would be at the time.",
                  "score": 12,
                  "created_utc": 1737383109.0,
                  "replies": []
                },
                {
                  "id": "m86dxrg",
                  "author": "trixtah",
                  "body": "You replied to his comment by saying the exact thing the person he responded to said, did you even bother reading the response? Or just hurr durr Nintendo bad?",
                  "score": 3,
                  "created_utc": 1737388503.0,
                  "replies": [
                    {
                      "id": "m86fhse",
                      "author": "Specialist-Rope-9760",
                      "body": "Did you read it?\n\n1 - The original comment was saying Nintendo shouldn’t get praise for taking so long to do the right thing\n\n2 - The next person is saying they should get praise for eventually doing the right thing\n\n3 - I’m saying the right thing would have been to react quickly rather than waiting for their next console revision \n\nSpelt it out for you clearer",
                      "score": -4,
                      "created_utc": 1737388943.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m85v0fu",
                  "author": "MobileVortex",
                  "body": "lol",
                  "score": -2,
                  "created_utc": 1737382592.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m85smto",
              "author": "Stuntz-X",
              "body": "That is deep,  Makes me think you are AI.   I agree with that concise statement though",
              "score": -26,
              "created_utc": 1737381730.0,
              "replies": [
                {
                  "id": "m85tvla",
                  "author": "FerricDonkey",
                  "body": "Not an AI, just a grumpy old man who is tired of people searching for excuses to stay angry at each other. ",
                  "score": 26,
                  "created_utc": 1737382188.0,
                  "replies": [
                    {
                      "id": "m870x0g",
                      "author": "Stuntz-X",
                      "body": "yeah i agree,  Seems the entire internet and media is about getting one group to hate another group.",
                      "score": 1,
                      "created_utc": 1737394871.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m872r8e",
              "author": "Top5hottest",
              "body": "Meh. Maybe when they do it in a timely fashion and not after their fourth version of release. They “maybe” are doing it now because it’s affecting their reach of the new console.. obviously not because they care.",
              "score": -2,
              "created_utc": 1737395357.0,
              "replies": []
            },
            {
              "id": "m87i3jz",
              "author": "AllomancerJack",
              "body": "It’s a company mate wtf are you on about",
              "score": -3,
              "created_utc": 1737399429.0,
              "replies": []
            },
            {
              "id": "m85tn8t",
              "author": "None",
              "body": "Delayed virtue is malicious. So no",
              "score": -30,
              "created_utc": 1737382101.0,
              "replies": [
                {
                  "id": "m85uc0j",
                  "author": "Charizarlslie",
                  "body": "It would only be malicious if they purposely did the wrong thing so that they get praise for doing the right thing later; considering standard joint sticks were the norm for literal decades before, them going with them for the Switch certainly wasn't an intentional \"Oh nice we're gonna pick the bad options so we can change this for the next console and they'll love it\" thing.",
                  "score": 19,
                  "created_utc": 1737382351.0,
                  "replies": [
                    {
                      "id": "m85v095",
                      "author": "None",
                      "body": "Being lazy is wrong also. They knew it was a problem but never fixed it and were able to ",
                      "score": -12,
                      "created_utc": 1737382590.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m85vdbr",
                  "author": "MobileVortex",
                  "body": "What an incredibly stupid thing to say lol",
                  "score": 6,
                  "created_utc": 1737382718.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m85szve",
          "author": "Siyuen_Tea",
          "body": "Considering no one else is doing it, they definitely deserve some for that",
          "score": 25,
          "created_utc": 1737381864.0,
          "replies": []
        },
        {
          "id": "m85vcwr",
          "author": "PaddiM8",
          "body": "I don't understand people who respond to good changes with negativity because \"they should've done it before\" or that it's not perfect so therefore everything sucks. If everyone had this mindset they wouldn't even bother to make good changes because it would only lead to bad PR haha",
          "score": 6,
          "created_utc": 1737382714.0,
          "replies": []
        },
        {
          "id": "m85twce",
          "author": "bungojot",
          "body": "To be fair, they do apparently replace joycons that drift. \n\nBut yes, glad they're doing it right this time around.",
          "score": 3,
          "created_utc": 1737382195.0,
          "replies": []
        },
        {
          "id": "m86gcs6",
          "author": "Arctiiq",
          "body": "The only time anyone has used hall-effects officially was the dreamcast, so yes they deserve some praise",
          "score": 1,
          "created_utc": 1737389186.0,
          "replies": []
        },
        {
          "id": "m87pve3",
          "author": "DarkStarStorm",
          "body": "If it ain't broke. And I know that you aren't criticizing Microsoft and Sony for completely reinventing their consoles every generation. This is the first time Nintendo hasn't done a 180 on their console in their history.\n\nYour high horse is made of paper and elmer's glue.",
          "score": 1,
          "created_utc": 1737401541.0,
          "replies": []
        },
        {
          "id": "m85wv51",
          "author": "gman5852",
          "body": "I'd normally agree but given their competition also isn't using hall effect sticks, I'll be happy at what is hopefully the start of a positive trend.",
          "score": 1,
          "created_utc": 1737383238.0,
          "replies": []
        },
        {
          "id": "m85v769",
          "author": "Sauerkraut1321",
          "body": "Bare-minimum ass company.",
          "score": -5,
          "created_utc": 1737382658.0,
          "replies": [
            {
              "id": "m85x2kn",
              "author": "gman5852",
              "body": "...is not the insult you use when they're the (allegedly) first of the big three to switch to hall effect sticks.\n\nBut you did the bare minimum of research so checks out why you'd say that.",
              "score": 6,
              "created_utc": 1737383308.0,
              "replies": []
            },
            {
              "id": "m8edkpa",
              "author": "Kamakaziturtle",
              "body": "Nintendo at least replaces joycons that have drift no questions asked, all you gotta do is pay shipping.  Compared to Sony and Microsoft which if it's not under warranty will charge you rather ridiculous fees.\n\nSo funnily enough, Nintendo is going the extra mile by industry standards, and if they switch to the new sticks they are leaving the other two in their dust.",
              "score": 1,
              "created_utc": 1737486880.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8606uq",
      "author": "SuperPapernick",
      "body": "Please, yes. And the other consoles, too. The cost increase is really negligible and the benefit is huge.",
      "score": 2,
      "created_utc": 1737384365.0,
      "replies": []
    },
    {
      "id": "m864plb",
      "author": "Onion_Cutter_ninja",
      "body": "Gamesir 25€ controllers have hall effect, no reason for future controllers not to have it.",
      "score": 2,
      "created_utc": 1737385792.0,
      "replies": []
    },
    {
      "id": "m86hrab",
      "author": "None",
      "body": "COULD?! seriously?? Yeesh.",
      "score": 2,
      "created_utc": 1737389584.0,
      "replies": []
    },
    {
      "id": "m86ua17",
      "author": "Woodwardg",
      "body": "switch 1 joycons were of unacceptable quality period. when you factor in their price, it was doubly unacceptable. at least they're (allegedly) making an effort to sell a quality product this time.\n\nif your little pieces of plastic are going to run at 70$ they sure as hell better work properly for a long period of time.\n\nmy joycons barely got any use whatsoever (used GameCube controller for most things) and lo and behold when tears of the kingdom came out they somehow had drift anyways.",
      "score": 2,
      "created_utc": 1737393064.0,
      "replies": []
    },
    {
      "id": "m87b9de",
      "author": "HappenedOnceBefore",
      "body": "Should have worked in the first place",
      "score": 2,
      "created_utc": 1737397616.0,
      "replies": []
    },
    {
      "id": "m88h9ga",
      "author": "Projectonyx",
      "body": "they are gonna fix something that shouldn't have been an issue to begin with? WOAH",
      "score": 2,
      "created_utc": 1737408912.0,
      "replies": []
    },
    {
      "id": "m88xqh7",
      "author": "IllustriousSimple297",
      "body": "*Laughs in Sega Dreamcast*",
      "score": 2,
      "created_utc": 1737413483.0,
      "replies": []
    },
    {
      "id": "m89wzek",
      "author": "Additional_Entry_517",
      "body": "Will Nintendo sports ever come back if not don't talk to me",
      "score": 2,
      "created_utc": 1737424462.0,
      "replies": []
    },
    {
      "id": "m8607ma",
      "author": "NSMike",
      "body": "Honestly, stick drift has been part of the Switch conversation since like... maybe a year post release until now?  I don't understand why they didn't just say, \"Yes, we're using hall effect sticks\" immediately.",
      "score": 4,
      "created_utc": 1737384372.0,
      "replies": [
        {
          "id": "m8fa0qj",
          "author": "madmofo145",
          "body": "Because that would be admitting there was an issue. I 100% believe they've gone Hall effect for the 2, but I don't think they'll ever publicly say that, we likely won't know for sure tell there is a teardown.",
          "score": 1,
          "created_utc": 1737495683.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m85z19c",
      "author": "kevthewev",
      "body": "I have the $30 CandyCon controller from GameStop that has the Hall effect triggers and sticks. I use it exclusively for rocket league and previously bought 2-3 controllers/year from stick drift, but this one has lasted me the whole year so far and is going strong. Hall effect is NUTS in how much better they are.",
      "score": 2,
      "created_utc": 1737383983.0,
      "replies": []
    },
    {
      "id": "m8629fm",
      "author": "Lasborg",
      "body": "If 3rd party controller manufactures can make 25 dollar controllers with Hall Effect sticks there are no excuse for 1st party controllers to not have them.",
      "score": 2,
      "created_utc": 1737385029.0,
      "replies": []
    },
    {
      "id": "m869gcb",
      "author": "RealCreativeFun",
      "body": "Hall effect sticks. Like the one on my P.S vita 1000-model. 🙂",
      "score": 2,
      "created_utc": 1737387203.0,
      "replies": []
    },
    {
      "id": "m86dc0r",
      "author": "None",
      "body": "[deleted]",
      "score": 2,
      "created_utc": 1737388331.0,
      "replies": []
    },
    {
      "id": "m87863s",
      "author": "made_of_salt",
      "body": "Nintendo and broken joysticks. Name a more iconic duo. \n\nI'll believe the problem is solved when I see it. \n\nI had joycon drift with my switch earlier in the lifecycle of the console and they wouldn't fix it and I had to buy new controllers. Then a year later they were fixing them for free, but by then I had already thrown away the old ones and paid full price for new ones. \n\nAs it is, I expect those idiotically designed connectors on the switch 2 to break early and often. But that's not a flaw, that's a feature to force users to have to buy more consoles.",
      "score": 2,
      "created_utc": 1737396791.0,
      "replies": []
    },
    {
      "id": "m85y4bl",
      "author": "prick-in-the-wall",
      "body": "Well of course they are gonna be fucking hall effect.",
      "score": 1,
      "created_utc": 1737383671.0,
      "replies": []
    },
    {
      "id": "m8614vd",
      "author": "Racheakt",
      "body": "The joycon bs is why I will wait; I had two sets; 100% failure rate within months. \n\nI finally just broke down and replaced them with Hall effect sticks, been a year without issues.",
      "score": 3,
      "created_utc": 1737384672.0,
      "replies": [
        {
          "id": "m868hqf",
          "author": "Old-Rhubarb-97",
          "body": "Mine took years to break.\n\nMy ps5 controller started having issues within a year.",
          "score": 2,
          "created_utc": 1737386922.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m871xjl",
      "author": "Top5hottest",
      "body": "I used to think of Nintendo as a company who put the games and experience first. Now I think of them as a soulless profit machine like every other crap mega corp. I won’t buy anything that looks like the Nintendo switch controllers ever again. Shame on them.",
      "score": 3,
      "created_utc": 1737395141.0,
      "replies": [
        {
          "id": "m8ee25o",
          "author": "Kamakaziturtle",
          "body": "Avoid controllers in general then I guess, because Nintendo isn't alone in having this issue.  At least Nintendo will fix controllers that have drift without charging you anything extra, thats better than the rest of the industry.",
          "score": 1,
          "created_utc": 1737487012.0,
          "replies": [
            {
              "id": "m8eleeh",
              "author": "Top5hottest",
              "body": "Not even close to the same rate. We play our PlayStation remotes at ten times the rate and have had maybe 1 break.. not to mention they are a million times more complex and provide actual feedback and actual joy.",
              "score": 0,
              "created_utc": 1737489005.0,
              "replies": [
                {
                  "id": "m8eqmop",
                  "author": "Kamakaziturtle",
                  "body": "And I've gone through two PlayStation Controllers despite it being my least played console.  You just got lucky my guy.  And they joysticks aren't anymore complex, both use the same potentiometers josysticks made of cheap plastic parts.  They have the same issue, and even try to profit off of it, charging 200 bucks for a controller where being able to easily replace the joysticks is a major feature.\n\nMicrosoft isn't any better either, same parts, same plastic, I've cracked open both PlayStation and Xbox controllers and they are pretty much identical in terms of the joysticks.  First party controllers are cheap shit these days and you are better off going third party and making sure they use good hardware, or get good at replacing them with better stuff yourself (the route I went with, funnily enough after the second PS5 controller).  Or at the very least make sure they have a good replacement plan, for all their faults at least Nintendo will fix their controllers for free, Sony and Microsoft will charge you an arm and a leg if it's past their warranty (1 year for Sony,and only *90 days* for Microsoft...)",
                  "score": 1,
                  "created_utc": 1737490436.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m85vzd8",
      "author": "Andrige3",
      "body": "The toy like feeling of the initial joycons and the subsequent drift was the worst part of the original shift. I’m praying the rumors are true!",
      "score": 1,
      "created_utc": 1737382933.0,
      "replies": []
    },
    {
      "id": "m85wu49",
      "author": "Time2Explain",
      "body": "If the new switch can use a camera for dance dance for my family I will upgrade",
      "score": 1,
      "created_utc": 1737383228.0,
      "replies": []
    },
    {
      "id": "m8616zb",
      "author": "BenjiSBRK",
      "body": "Aren't hall effect joysticks also prone to drift ?",
      "score": 1,
      "created_utc": 1737384690.0,
      "replies": [
        {
          "id": "m86m1t4",
          "author": "Neo_Techni",
          "body": "yes, but after much longer time",
          "score": 1,
          "created_utc": 1737390792.0,
          "replies": []
        },
        {
          "id": "m8ct53j",
          "author": "ItsColorNotColour",
          "body": "Literally everything in this universe is prone to breaking eventually. What makes the difference is when.",
          "score": 1,
          "created_utc": 1737471042.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m86tc8a",
      "author": "None",
      "body": "I put Hall effects in my OLED Joy-Cons and I couldn’t be happier. No drift and amazing control. I hope they are in the new one but if not I’m sure Gulikit will eventually.",
      "score": 1,
      "created_utc": 1737392805.0,
      "replies": []
    },
    {
      "id": "m86z1is",
      "author": "LanaDelHeeey",
      "body": "I should hope so after the shitshow that were the original joycons",
      "score": 1,
      "created_utc": 1737394368.0,
      "replies": []
    },
    {
      "id": "m873ql4",
      "author": "Darklord_Bravo",
      "body": "I replaced the ones on mine with Hall effect ones about a year after I got it. Was super easy, and very cheap. There's no reason for them not to upgrade them to hall effect for Switch 2.",
      "score": 1,
      "created_utc": 1737395611.0,
      "replies": []
    },
    {
      "id": "m87610j",
      "author": "Fungidude",
      "body": "Hall effect sensor gain credibility? I have a HOTAS and a Xbox style controller in front of me with Hall effect that works flawlessly. These are just about entry level in price also. Who is questioning Hall effect??!",
      "score": 1,
      "created_utc": 1737396213.0,
      "replies": []
    },
    {
      "id": "m878zlv",
      "author": "img_tiff",
      "body": "If they're Hall effect it's a day one purchase for me",
      "score": 1,
      "created_utc": 1737397010.0,
      "replies": []
    },
    {
      "id": "m87be9g",
      "author": "Sassy-irish-lassy",
      "body": "Thanks after ten years",
      "score": 1,
      "created_utc": 1737397653.0,
      "replies": []
    },
    {
      "id": "m87en1b",
      "author": "Kruxf",
      "body": "Yeah now the breakable part (tabbed connector) will require the whole console to be replaced. Thanks for the Hal effect sticks tho…",
      "score": 1,
      "created_utc": 1737398516.0,
      "replies": []
    },
    {
      "id": "m87gsvw",
      "author": "Invader_Skooge22",
      "body": "I mean, Hall effects have been around for a while. There’s no reason why every controller shouldn’t have them unless the companies are trying to save a dime and know the ones they use currently aren’t as good, and just don’t care enough to change them.",
      "score": 1,
      "created_utc": 1737399087.0,
      "replies": []
    },
    {
      "id": "m87hwu4",
      "author": "Fordalla",
      "body": "I wonder how that will affect the battery life of the joycons?",
      "score": 1,
      "created_utc": 1737399381.0,
      "replies": []
    },
    {
      "id": "m87ntlw",
      "author": "Fredasa",
      "body": "The best news here is that it will force the other platforms to stop dragging their heels.  End of an era.",
      "score": 1,
      "created_utc": 1737400981.0,
      "replies": []
    },
    {
      "id": "m87pvfd",
      "author": "xamott",
      "body": "Hall effect stick leaks gain - is that English",
      "score": 1,
      "created_utc": 1737401541.0,
      "replies": []
    },
    {
      "id": "m87s6kq",
      "author": "Jeanlucpuffhard",
      "body": "So they could have fixed it but didn’t",
      "score": 1,
      "created_utc": 1737402165.0,
      "replies": []
    },
    {
      "id": "m87spz4",
      "author": "crimxxx",
      "body": "At the very least o expect better then the og joycons, it’s doesn’t take a genius to know having to do free replacements for years is just not a good thing from both a customer and company repetitional stand point. It could be okay financially, but Nintendo generally does not seem like a company that wants to be associated with low quality.",
      "score": 1,
      "created_utc": 1737402313.0,
      "replies": []
    },
    {
      "id": "m87ubqj",
      "author": "CrustyBappen",
      "body": "I have a fairly new switch and one of the joycons had a tendency to pull left sometimes. Is this the issue? Keep meaning to return it but it’s my loss Xmas gift and we’re only in Jan!",
      "score": 1,
      "created_utc": 1737402748.0,
      "replies": []
    },
    {
      "id": "m87uo4g",
      "author": "Speculatiion",
      "body": "Is that what they meant when the joycons were drifting??",
      "score": 1,
      "created_utc": 1737402842.0,
      "replies": []
    },
    {
      "id": "m8858ck",
      "author": "M0ndmann",
      "body": "Most important Upgrade",
      "score": 1,
      "created_utc": 1737405734.0,
      "replies": []
    },
    {
      "id": "m889f5q",
      "author": "Zylpherenuis",
      "body": "Nintendo is going to release the Switch 2 with faults including stick drift and this time they will firmly tell consumers that their 3 month warranty on their system is not possible because of Trump's tariffs rules and regulations.\n\n\nConsumers are fucked.",
      "score": 1,
      "created_utc": 1737406835.0,
      "replies": []
    },
    {
      "id": "m88gx9w",
      "author": "triadwarfare",
      "body": "Console makers probably worried they have no more \"lightbulbs\" to sell, hence, the big three (or 4 if we include Valve and their vague reasoning why they were against putting hall effect on their OLED revision) are hesitating to put Hall effect or TMR as the default option even if it doesn't really add much on the overall unit's cost.",
      "score": 1,
      "created_utc": 1737408822.0,
      "replies": []
    },
    {
      "id": "m88hcgc",
      "author": "deltashmelta",
      "body": "How would they offset the magnet field from the joycon docking, if the analog stick uses hal sensors?\n\n\nUnless it's not strong enough, or they add mu-metal, for an auto-cal to adjust when docking the joycons.\n\n\nSuspect they'll still go with something resistive, like past analog sticks.\n\n\nMaybe something with more robust circular potentiometers like older analog sticks that held up, over the PCB-carbon slides.",
      "score": 1,
      "created_utc": 1737408934.0,
      "replies": []
    },
    {
      "id": "m88kg81",
      "author": "Blu3fin",
      "body": "zephyr outgoing worry resolute whistle late boast act sink lip\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "score": 1,
      "created_utc": 1737409763.0,
      "replies": []
    },
    {
      "id": "m88luo7",
      "author": "alex_dlc",
      "body": "It would be pretty messed up if they had the ability to end joystick drift but chose not to",
      "score": 1,
      "created_utc": 1737410136.0,
      "replies": []
    },
    {
      "id": "m88m5d8",
      "author": "Dracogame",
      "body": "I would say fixing the drift is the bare minimum, and yet I do not trust Nintendo to do so. \n\nWe’ll see",
      "score": 1,
      "created_utc": 1737410216.0,
      "replies": []
    },
    {
      "id": "m88m8b0",
      "author": "domigraygan",
      "body": "I’m lucky I don’t have any stick drift issues with my joycons lol my brother and sister have run them RAGGED playing Hades non-stop for years between them both, and yet I have no noticeable drift. \n\nExcited to move onto the next console clean and easy",
      "score": 1,
      "created_utc": 1737410238.0,
      "replies": []
    },
    {
      "id": "m88oyaq",
      "author": "hurtingwallet",
      "body": "Even then, ergonomics are still cramped with those. I just got my mobapad M6-HD, and it's a world of a difference. It's a console i like holding now. It feels like a console.\n\nI can't see why they can't officially design something specifically for big hands. They know their market, and for sure they'll sell, so why not?",
      "score": 1,
      "created_utc": 1737410986.0,
      "replies": []
    },
    {
      "id": "m88rbg4",
      "author": "kaishinovus",
      "body": "The fact that this is a \"could\" and not a \"will\" says everything.",
      "score": 1,
      "created_utc": 1737411643.0,
      "replies": []
    },
    {
      "id": "m88thev",
      "author": "Tired8281",
      "body": "They spent so much fixing stick drift, if I was a shareholder, I'd sue them if they didn't use Halls.",
      "score": 1,
      "created_utc": 1737412264.0,
      "replies": []
    },
    {
      "id": "m88zzny",
      "author": "Coccolillo",
      "body": "Is there a market where I can bet against?",
      "score": 1,
      "created_utc": 1737414146.0,
      "replies": []
    },
    {
      "id": "m892rvo",
      "author": "StinkySmellyMods",
      "body": "Would be nice. I put them in my OLED and they don't feel too different, but they will last the life of the console.",
      "score": 1,
      "created_utc": 1737414988.0,
      "replies": []
    },
    {
      "id": "m89425t",
      "author": "boothjop",
      "body": "There is no excuse for them not to.",
      "score": 1,
      "created_utc": 1737415381.0,
      "replies": []
    },
    {
      "id": "m896q02",
      "author": "Lagviper",
      "body": "No\n\n  \nIf the Nintendo patent they refer to is legit, its much more than hall effect sticks, much more. \n\n  \nIts a force feedback system that with magnetic coils affect the viscosity of a magneto rheological fluid contained inside. \n\n  \nThey can oscillates independently the X & Y axis at up to 200Hz. Giving rumble like feedback but with more precision. They can lock the viscosity in an axis to the point where say, they force you to use the X-Axis\n\n\n\nThey can make  moving an object or a character in the world react accordingly to the medium they are in, such as a block in water, or a character in deep snow / mud. Creating  more resistivity to move the analog stick. \n\n  \nThey can make the stick not recenter, meaning for games this could be a fun way of expressing a character slides on ice and the input for example as to be compensated for, not just leaving the stick to recenter itself.\n\n  \nIts all here\n\n  \n[https://image-ppubs.uspto.gov/dirsearch-public/print/downloadPdf/20230280850](https://image-ppubs.uspto.gov/dirsearch-public/print/downloadPdf/20230280850)\n\n  \nNintendo would be replacing HD rumble, stick drifting problems and have an innovative new controller invention in one sweep.",
      "score": 1,
      "created_utc": 1737416214.0,
      "replies": []
    },
    {
      "id": "m89g0q1",
      "author": "Hank_moody71",
      "body": "No stick drift but the connection point…. That’ll be the next thing that needs to be addressed",
      "score": 1,
      "created_utc": 1737419151.0,
      "replies": []
    },
    {
      "id": "m89hm6s",
      "author": "aliveasghosts47",
      "body": "I own a Duel Sense Edge and I swear it'd be the best controller ever if they had Hall effect sticks instead of replaceable ones. It just seems like a joystick selling scheme at this point bc I've gone through 3-4 in the year I've had it",
      "score": 1,
      "created_utc": 1737419647.0,
      "replies": []
    },
    {
      "id": "m89p4jd",
      "author": "peter9811",
      "body": "No OLED, ain't not buying",
      "score": 1,
      "created_utc": 1737421997.0,
      "replies": []
    },
    {
      "id": "m89xmh1",
      "author": "Maple-Sizzurp",
      "body": "Dreamcast did it 25 years ago",
      "score": 1,
      "created_utc": 1737424666.0,
      "replies": []
    },
    {
      "id": "m8a49z3",
      "author": "Tr33Bl00d",
      "body": "I hate the joycons. I never use them, unless I have too. It’s a gimmick sold as a feature ",
      "score": 1,
      "created_utc": 1737426788.0,
      "replies": []
    },
    {
      "id": "m8a8tok",
      "author": "SolidContribution688",
      "body": "Considering all the shit they went through, it’ll be dumb if they didn’t go with Hall effect",
      "score": 1,
      "created_utc": 1737428256.0,
      "replies": []
    },
    {
      "id": "m8a9cmz",
      "author": "stere0man",
      "body": "Hardly anything spectacular I mean you can already buy third party joycons with Hall effect sticks for Switch and barring hardware limitations it's honestly ridiculous at this point that every controller doesn't come with Hall effect, I'm looking at you Sony!",
      "score": 1,
      "created_utc": 1737428430.0,
      "replies": []
    },
    {
      "id": "m8aer01",
      "author": "CharlesIngalls_Pubes",
      "body": "Fuck these influencers that get the latest and greatest for a shout-out. I've been playing Nintendo since the drop. Let me test out some new shit.",
      "score": 1,
      "created_utc": 1737430255.0,
      "replies": []
    },
    {
      "id": "m8agv51",
      "author": "None",
      "body": "Thanks for reminding me I need to get hall effect sticks put into my dualsense controller lol",
      "score": 1,
      "created_utc": 1737430983.0,
      "replies": []
    },
    {
      "id": "m8aj3i6",
      "author": "boksinx",
      "body": "Third party controllers already solved the drifting issue for years now. If the drifting issue still exist in switch 2, I mean wtf nintendo, you hard headed fuck face.",
      "score": 1,
      "created_utc": 1737431760.0,
      "replies": []
    },
    {
      "id": "m8aplp9",
      "author": "EndStorm",
      "body": "Was it a certain game that made it worse?  Or game type?  I hadn't experienced the issue with my Switch and I've only had the one.  Mostly played Mario Odyssey, BOTW, and Mario Kart.",
      "score": 1,
      "created_utc": 1737434211.0,
      "replies": []
    },
    {
      "id": "m8apuw5",
      "author": "_half_real_",
      "body": "i don't play nintendo but i still want to believe.",
      "score": 1,
      "created_utc": 1737434312.0,
      "replies": []
    },
    {
      "id": "m8axhv5",
      "author": "Noctudeit",
      "body": "Love the hall effect sticks on my 8BitDo Pro 2. I'll probably stick with it regardless.",
      "score": 1,
      "created_utc": 1737437570.0,
      "replies": []
    },
    {
      "id": "m8azl7y",
      "author": "foofyschmoofer8",
      "body": "Wouldn’t they have advertised this if it were true? They would’ve plastered this all over their videos since it costs extra for them to include. I don’t buy it. I literally have Hall effect joycons in my Amazon cart, ready to make my gen 1 switch last another 7 years.",
      "score": 1,
      "created_utc": 1737438540.0,
      "replies": []
    },
    {
      "id": "m8b1kmt",
      "author": "CMC_Conman",
      "body": "If it doesn't drift I'll buy it 100% but it won't be same day purchase I'll need proof",
      "score": 1,
      "created_utc": 1737439514.0,
      "replies": []
    },
    {
      "id": "m8b3o1r",
      "author": "deze_moltisanti",
      "body": "This whole generation of controllers have blown donkey balls. Between Joy-con drift and the D-Pad on the Switch Pro controller not being accurate, having to buy more and more Xbox Series controllers because they keep crapping out on me, to my buddy having to rebuy controllers for his PS5.",
      "score": 1,
      "created_utc": 1737440571.0,
      "replies": []
    },
    {
      "id": "m8b6a8q",
      "author": "Metroid413",
      "body": "I’m surprised this wasn’t fixed in the OLED version to be honest. This is a long time coming.",
      "score": 1,
      "created_utc": 1737441940.0,
      "replies": [
        {
          "id": "m8brodj",
          "author": "tiger331",
          "body": "In order to sell more of the JoyCons",
          "score": 2,
          "created_utc": 1737454756.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8boi2s",
      "author": "jk441",
      "body": "Please let this be true....",
      "score": 1,
      "created_utc": 1737452786.0,
      "replies": []
    },
    {
      "id": "m8chnzc",
      "author": "ProvocateurMaximus",
      "body": "Not buying Switch 2 for the first full year explicitly because of how garbage the original Joy-Cons were. Not interested in buying controllers that can't even last 6 months",
      "score": 1,
      "created_utc": 1737467156.0,
      "replies": []
    },
    {
      "id": "m8d2suk",
      "author": "SacredDarksoul",
      "body": "The big companies are scummy for continuing to use the inferior sticks.",
      "score": 1,
      "created_utc": 1737473968.0,
      "replies": []
    },
    {
      "id": "m8gnfp0",
      "author": "Rockm_Sockm",
      "body": "They are too small to be usable anyways, I will stick to my third party controller.",
      "score": 1,
      "created_utc": 1737510651.0,
      "replies": []
    },
    {
      "id": "m8haw6t",
      "author": "WhalesLoveSmashBros",
      "body": "Doubt.",
      "score": 1,
      "created_utc": 1737518602.0,
      "replies": []
    },
    {
      "id": "m9cksxp",
      "author": "happyslappypappydee",
      "body": "We fixed the thing we never wanted to fix!   Trust us",
      "score": 1,
      "created_utc": 1737931279.0,
      "replies": []
    },
    {
      "id": "mehen5w",
      "author": "Jealous_Wafer7777",
      "body": "I may have to wait 1.5 to 2 years to hear from others first. Replacing 6 joycon joysticks so far and slight play does not count for a day one perchase.",
      "score": 1,
      "created_utc": 1740382052.0,
      "replies": []
    },
    {
      "id": "m85t48i",
      "author": "halfbeerhalfhuman",
      "body": "Could",
      "score": 1,
      "created_utc": 1737381910.0,
      "replies": []
    },
    {
      "id": "m85yfqj",
      "author": "batmonkey7",
      "body": "Hall effect joysticks can still get drift...",
      "score": 1,
      "created_utc": 1737383781.0,
      "replies": [
        {
          "id": "m862tf1",
          "author": "RollUpTheRimJob",
          "body": "It’s about longevity. They last longer, something like 3-5x as many cycles",
          "score": 8,
          "created_utc": 1737385202.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m86fvxs",
      "author": "ChangeVivid2964",
      "body": "Why, did someone sue them?  There's no motive for any company to do this other than lawsuits.",
      "score": 1,
      "created_utc": 1737389055.0,
      "replies": [
        {
          "id": "m86kh6k",
          "author": "Neo_Techni",
          "body": "> did someone sue them? \n\nyes",
          "score": 3,
          "created_utc": 1737390351.0,
          "replies": []
        },
        {
          "id": "m8fcuz0",
          "author": "madmofo145",
          "body": "They did free repairs to avoid a lawsuit, and they know there is a problem they'd rather not repeat (but aren't going to admit to). Hall effects are dirt cheap now, so swapping things and avoiding future bad PR makes perfect sense. They won't admit to why they changed things, but no one wants to put out something they are constantly repairing under warranty.",
          "score": 1,
          "created_utc": 1737496448.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8718ps",
      "author": "St_Beetnik_2",
      "body": "So fucking what.\n\nI had to deal with shit controllers for 7 years. Never a permanent fix, just a send it back to them bullshit.\n\nNever buying Nintendo again",
      "score": 0,
      "created_utc": 1737394958.0,
      "replies": [
        {
          "id": "m87g12r",
          "author": "RinRinDoof",
          "body": "To my knowledge all first party console controllers have this problem. Only 3rd party controllers use Hall-Effect as of now.",
          "score": 5,
          "created_utc": 1737398882.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m85wm5b",
      "author": "FoolOnDaHill365",
      "body": "I fucking hope so I’ve spent more on my Joycons thanks to dark souls games.",
      "score": 1,
      "created_utc": 1737383153.0,
      "replies": [
        {
          "id": "m86otn2",
          "author": "Magnetobama",
          "body": "I know you shouldn’t have to in the first place but you can buy a Joycon fixing kit for a few bucks online and change the sticks out by yourself. Takes just a few minutes and is really easy.",
          "score": 1,
          "created_utc": 1737391564.0,
          "replies": [
            {
              "id": "m86xwm6",
              "author": "FoolOnDaHill365",
              "body": "Good to know! TY!",
              "score": 2,
              "created_utc": 1737394056.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8601bm",
      "author": "Trick_Albatross_4200",
      "body": "So that’s why the connections between the joycon and screen are so flimsy. They just chose a different failure point, but this time you’ll have to replace the console",
      "score": 1,
      "created_utc": 1737384315.0,
      "replies": []
    },
    {
      "id": "m864vbc",
      "author": "d_chs",
      "body": "All we need now is an upgrade system where we can trade in the old switch in place of a 2 for a smaller fee",
      "score": 1,
      "created_utc": 1737385839.0,
      "replies": []
    },
    {
      "id": "m86kp5t",
      "author": "None",
      "body": "Ngl my joycon never drifted. Not my pro controller. I’ve been through 5 ps5 controllers in 2 years though",
      "score": 1,
      "created_utc": 1737390413.0,
      "replies": []
    },
    {
      "id": "m89fihf",
      "author": "jwrice",
      "body": "It's simple for me. If the sticks still suffer from the same stick drift problems then I will not buy any more Nintendo consoles.\n\nSame goes for Sony and their future consoles.\n\nWe're supposed to be buying games and not having to replace our controllers every year because they're defective and not built to last.\n\nNever had issues with my PS1 or PS2 controllers.",
      "score": 1,
      "created_utc": 1737418994.0,
      "replies": [
        {
          "id": "m8cefgy",
          "author": "Thedarkb",
          "body": "The PS1 and PS2 both filter out drift with software, if you hold a stick in a direction while you boot up the system it'll cause drift until you reset because the algorithm will think that the position you started it in is zero.",
          "score": 2,
          "created_utc": 1737465955.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8bylnj",
      "author": "None",
      "body": "Switch didn’t invent Hall effect sticks. Been around for a while",
      "score": 1,
      "created_utc": 1737458801.0,
      "replies": []
    },
    {
      "id": "m85wm7g",
      "author": "blacksoxing",
      "body": "Will it fix the issue? Highly likely. \n\nWill there be another issue that pops up that gains momentum as something that upsets the online community? YESSSSSSSS",
      "score": 1,
      "created_utc": 1737383153.0,
      "replies": [
        {
          "id": "m8fcjsu",
          "author": "madmofo145",
          "body": "I'd say maybe? \n\nMy general guess is that the Switch 2 will have gone through a more vigorous round of QA then the Switch did, which I'm sure Nintendo wanted on the market ASAP. I doubt we see issues like the nearly forgotten launch era Joycon range issue, fixed by adding some non conductive foam.",
          "score": 1,
          "created_utc": 1737496365.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m86b9cs",
      "author": "None",
      "body": "Can’t think of a console coming out with less hype than this in a long time",
      "score": 0,
      "created_utc": 1737387729.0,
      "replies": [
        {
          "id": "m86d0sl",
          "author": "Elastichedgehog",
          "body": "Well, there's not really much to go on until April.",
          "score": 2,
          "created_utc": 1737388242.0,
          "replies": [
            {
              "id": "m86h7kw",
              "author": "None",
              "body": "Hype has nothing to do with April",
              "score": 0,
              "created_utc": 1737389428.0,
              "replies": [
                {
                  "id": "m86pqla",
                  "author": "Elastichedgehog",
                  "body": "It does when we have no idea what this thing is launching with (which will most likely be announced in April), MK9 aside.\n\nI'm just saying people won't get that excited until Nintendo ramps up their ad campaign.",
                  "score": 2,
                  "created_utc": 1737391817.0,
                  "replies": [
                    {
                      "id": "m86ucv0",
                      "author": "None",
                      "body": "More hype about PS6 than this but ok",
                      "score": 0,
                      "created_utc": 1737393086.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m85rwyq",
      "author": "iamnotexactlywhite",
      "body": "yeah right",
      "score": -2,
      "created_utc": 1737381466.0,
      "replies": []
    },
    {
      "id": "m85verf",
      "author": "freedoomed",
      "body": "Do hall effect sticks have springs to center them?  What happens when the springs weaken?",
      "score": 0,
      "created_utc": 1737382733.0,
      "replies": [
        {
          "id": "m864mdq",
          "author": "RedScaledOne",
          "body": "they have.. magnets no springs.. \\^\\^",
          "score": 2,
          "created_utc": 1737385764.0,
          "replies": [
            {
              "id": "m86cvld",
              "author": "freedoomed",
              "body": "i know the sensor uses magnets, i didn't realize they used magnets to recenter the sticks too.",
              "score": 1,
              "created_utc": 1737388199.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m86fjul",
          "author": "hanlonmj",
          "body": "Stick drift is not due to weakening springs. It’s due to the potentiometers wearing each other down with use. Most drifting sticks likely still have perfectly good springs",
          "score": 2,
          "created_utc": 1737388959.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m85ydq5",
      "author": "kavOclock",
      "body": "I mean both my joycons had drifting problems and Nintendo repaired them for me out of warranty, all I had to do was ask and they paid for shipping and everything.  Haven’t had drift issues since",
      "score": 0,
      "created_utc": 1737383761.0,
      "replies": [
        {
          "id": "m86024g",
          "author": "dantheriver",
          "body": "Not being able to play Nintendo for a few weeks is a deal breaker for a lot of the people who make it seem like they MUST buy new controllers multiple times per year.",
          "score": 3,
          "created_utc": 1737384323.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m89ck9k",
      "author": "bluedevilb17",
      "body": "It will probably be the cheapest bargain bin sticks they can buy",
      "score": 0,
      "created_utc": 1737418069.0,
      "replies": []
    },
    {
      "id": "m85xblc",
      "author": "glytxh",
      "body": "The drift is real, but the two times I’ve experienced it, I managed to repair the sticks by spraying contact cleaner under the little plastic skirts. \n\nDid this about 2 years ago, and no drift since. \n\nIt’s not as catastrophically fatal a failure people make it out to be.",
      "score": -5,
      "created_utc": 1737383396.0,
      "replies": [
        {
          "id": "m866bc2",
          "author": "alexthegreat63",
          "body": "I think there are two different types of drift: the drift from the sticks physically getting stuck/the springs not returning the stick to the center, and then there’s drift from the sensors failing.",
          "score": 4,
          "created_utc": 1737386277.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m85tbtb",
      "author": "IdealIdeas",
      "body": "But then how will they make their money?",
      "score": -3,
      "created_utc": 1737381987.0,
      "replies": []
    },
    {
      "id": "m8621oh",
      "author": "idetectanerd",
      "body": "In the past, there were almost no such thing as drifting joystick.\n\nIt only happened when switch came along I heard about this crap. Maybe it’s just me.",
      "score": -4,
      "created_utc": 1737384960.0,
      "replies": [
        {
          "id": "m86lzuf",
          "author": "Neo_Techni",
          "body": "I have a launch-day PS3 controller with no drift. And a 360 controller older than that without any. Hell, my PS1/PS2 controllers have no drift. But my PS5 controllers all have it, even the Edge. And wife's Switch lite got it months after the christmas she was gifted it",
          "score": 2,
          "created_utc": 1737390776.0,
          "replies": [
            {
              "id": "m8bhp1s",
              "author": "idetectanerd",
              "body": "This happen to me too, I only got drift from switch, I don’t own ps5. All ps1 and 2 perfect, they still run perfect now.",
              "score": 2,
              "created_utc": 1737448526.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m866tt5",
          "author": "natefrogg1",
          "body": "It is happening on one of my Xbox controllers",
          "score": 1,
          "created_utc": 1737386430.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m86mab6",
      "author": "cavegoatlove",
      "body": "too late, just bought a new joicon set for totk, which also btw, i would lose my file using the 2 and their no drift.",
      "score": -1,
      "created_utc": 1737390857.0,
      "replies": []
    },
    {
      "id": "m85slhv",
      "author": "deejeycris",
      "body": "why would they do that? it doesn't make any sense. They can milk and milk with all those defective joycons. I bet when accounting for returns under warranty they still make a hefty net profit from their trash controllers.",
      "score": -12,
      "created_utc": 1737381716.0,
      "replies": [
        {
          "id": "m85x9mh",
          "author": "gman5852",
          "body": "They got class actioned last time.\n\nI'm also guessing those controllers aren't selling at a profit. Consoles usually don't.",
          "score": 3,
          "created_utc": 1737383377.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m85ssmg",
      "author": "shpydar",
      "body": "Sure,  now let’s talk about how that single piece of plastic the controllers connect to will be a point of failure.  Especially with players torquing and twisting the controllers during an intense play session.",
      "score": -15,
      "created_utc": 1737381790.0,
      "replies": [
        {
          "id": "m85tg7v",
          "author": "Suprehombre",
          "body": "Going strictly off the images, which we're both doing, that single plug is not how it's connected to the body. It looks like the surrounding color plastic is what actually locks it in.",
          "score": 17,
          "created_utc": 1737382032.0,
          "replies": [
            {
              "id": "m85ufyg",
              "author": "None",
              "body": "[deleted]",
              "score": 7,
              "created_utc": 1737382390.0,
              "replies": [
                {
                  "id": "m85vak4",
                  "author": "Suprehombre",
                  "body": "I remember reading they'd use magnets. Thanks!",
                  "score": 2,
                  "created_utc": 1737382691.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m85uhcc",
              "author": "Sylvurphlame",
              "body": "I agree. The images I’ve seen of the Switch 2 in handheld mode don’t show that colored top. So that implies it’s completely within the frame of the body. That should be reasonably resistant to torque. I’m just curious as to why the connection isn’t a USB-C form factor which would make the connector tab itself more secure in general. I presume either magnets or locking tabs hold the Joy Con in place when it’s attached to the body.",
              "score": 3,
              "created_utc": 1737382404.0,
              "replies": [
                {
                  "id": "m85vnog",
                  "author": "Suprehombre",
                  "body": "They probably created their own port for two reasons. First, is probably a speed thing. Charging and reporting. \n\nThe second would be to restrict third party production. You'd have to get the license from Nintendo to produce a controller. They'd have it patented to restrict any unauthorized reproductions.",
                  "score": 3,
                  "created_utc": 1737382819.0,
                  "replies": [
                    {
                      "id": "m85wzwk",
                      "author": "Sylvurphlame",
                      "body": "Speed and charging could be more than handled by even the minimum USB-C/USB2 specs.\n\nYou do have a point about licensing and unauthorized accessories.",
                      "score": 3,
                      "created_utc": 1737383283.0,
                      "replies": [
                        {
                          "id": "m8ea3ii",
                          "author": "Suprehombre",
                          "body": "The speed probably isn't the biggest factor, but propriety definitely is. \n\nMicrosoft and Sony use a closed system with their wireless, which they both use Bluetooth now but have it restricted.",
                          "score": 1,
                          "created_utc": 1737485925.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m85uyw5",
              "author": "jmhumr",
              "body": "Agreed.  I feel like a bot started this bogus narrative about the connection and people latched on and keep talking out of their butts about it.  I mean what a dumb thing to take away from the reveal video, haha.",
              "score": 5,
              "created_utc": 1737382576.0,
              "replies": [
                {
                  "id": "m86d99v",
                  "author": "Elastichedgehog",
                  "body": "People had similar concerns about the rail connection on the Switch 1. Turned out to be nothing, unsurprisingly.",
                  "score": 1,
                  "created_utc": 1737388310.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m85y2cw",
          "author": "Reasonable-Depth22",
          "body": ">> Especially with players torquing and twisting the controllers during an intense play session. \n\nWhat the fuck are you people doing to your controllers?? I’ve been a pretty active gamer for decades now and have never felt the need to “torque or twist” ANY of my controllers no matter what is happening in the game. Are these the same Mensa members who chucked their Wii controllers through their televisions?",
          "score": 1,
          "created_utc": 1737383652.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m85y8fr",
      "author": "deathbunnyy",
      "body": "People will still complain even though it doesn't exist anymore, just like OLED burn in. Nonstop victim mentality.",
      "score": -5,
      "created_utc": 1737383710.0,
      "replies": [
        {
          "id": "m860b7r",
          "author": "dantheriver",
          "body": "I just assume anyone still talking about oled burn in is just hating bc they can’t afford it. I’d be mad too if I was living in an all lcd world.",
          "score": -1,
          "created_utc": 1737384404.0,
          "replies": []
        }
      ]
    }
  ]
}