{
  "post": {
    "title": "Decades-old Windows systems are still running trains, printers, and hospitals | You've probably used Windows XP without even knowing it",
    "author": "chrisdh79",
    "id": "1kpvjxh",
    "score": 5106,
    "created_utc": 1747605268.0,
    "selftext": "",
    "num_comments": 382,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kpvjxh/decadesold_windows_systems_are_still_running/"
  },
  "comments": [
    {
      "id": "mt0wsdl",
      "author": "Right_Hour",
      "body": "Wait till you find out about what embedded OS versions are running in vast majority of industrial automation LOL.",
      "score": 522,
      "created_utc": 1747605754.0,
      "replies": [
        {
          "id": "mt0z9ry",
          "author": "Snoo-7986",
          "body": "I was not long in a key shop, and they get the pinouts for the key on this pc with (what I thought, which turned out that it was, a dos gui wrapper).  I commented on it as I have a big mouth, and it turned out that it runs a bit of kit (never asked what) and it needs to run dos 6.2.\n \nThe PC was modern, but they virtualised the original machine which I thought was funky",
          "score": 164,
          "created_utc": 1747606607.0,
          "replies": [
            {
              "id": "mt10kyh",
              "author": "Tithis",
              "body": "Back when I worked at a small computer shop we had a customer that ran his landscaping business off of a old DOS program like that. I suggested that we look into virtualizing it rather than trying to keep a 25 year old computer running.\n\n\nThey chose you just keep using paperclips and bubblegum. I wonder how that's going a decade later...",
              "score": 85,
              "created_utc": 1747607065.0,
              "replies": [
                {
                  "id": "mt12qlc",
                  "author": "kc5ods",
                  "body": "probably pretty well. those old systems are damn near bulletproof as long as you replace caps as needed",
                  "score": 52,
                  "created_utc": 1747607835.0,
                  "replies": [
                    {
                      "id": "mt41o2a",
                      "author": "Aimhere2k",
                      "body": "But how many end users know how to replace a soldered capacitor?",
                      "score": 8,
                      "created_utc": 1747658241.0,
                      "replies": [
                        {
                          "id": "mt46fs9",
                          "author": "kc5ods",
                          "body": "Probably zero, but that has not nor will it ever be an end user thing. That is why you call your friendly neighborhood IT guy. Any IT guy with his salt knows about Thomas Andrews and Amiga of Rochester.",
                          "score": 2,
                          "created_utc": 1747660031.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mt14z87",
                  "author": "CocodaMonkey",
                  "body": "Honestly it's likely just fine. There's virtually no advantage to switching to a vitualized environment for DOS if you already have a working DOS computer. Just make sure you have backups so you can switch when it fails.\n\nIn theory the virtualized machine is more power efficient but in practice it's not because it has so much more over head. Not much reason to switch until the old machine dies and setting up a virtual DOS system only takes a few minutes.",
                  "score": 31,
                  "created_utc": 1747608649.0,
                  "replies": [
                    {
                      "id": "mt1fhd4",
                      "author": "Tithis",
                      "body": "It's been a decade so the details are hazy, but I brought it up as a possibility because the senior tech said it had already been in several times for issues.\n\n\nOld hardware can work for ages, but I think relying on it with no game plan for dealing with a failure is stupid.",
                      "score": 24,
                      "created_utc": 1747612476.0,
                      "replies": [
                        {
                          "id": "mt1zsph",
                          "author": "CocodaMonkey",
                          "body": "The game plan would be to virtualize it. DOS runs just fine in virtualized environments. My only concern would be making sure you have proper backups. Switching to virtualized isn't really a big deal and can be done quickly.",
                          "score": -1,
                          "created_utc": 1747620090.0,
                          "replies": [
                            {
                              "id": "mt2xwir",
                              "author": "System0verlord",
                              "body": "The time to do that is when you have working hardware on hand to verify functionality against. Not once it’s gone.",
                              "score": 9,
                              "created_utc": 1747636348.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mt1fn39",
                      "author": "Ajreil",
                      "body": "Both options are pretty cheap once set up, but I'd be worried about not being able to secure replacement parts on an ancient system.",
                      "score": 8,
                      "created_utc": 1747612536.0,
                      "replies": [
                        {
                          "id": "mt2x2kk",
                          "author": "cgaWolf",
                          "body": "This would be my biggest worry as well. 25ish years ago, i was hired as part of a team to replace a QA system that had been running since the early 80ies, and the reason was literally that they couldn't source replacement hardware anymore.",
                          "score": 3,
                          "created_utc": 1747635854.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mt1gdwa",
                      "author": "Znuffie",
                      "body": "> In theory the virtualized machine is more power efficient but in practice it's not because it has so much more over head.\n\nImagine getting Windows updates and automatically getting the vm host rebooted, when that controller should be running 24/7 for production...",
                      "score": 10,
                      "created_utc": 1747612810.0,
                      "replies": [
                        {
                          "id": "mt1zjqu",
                          "author": "DJ_Micoh",
                          "body": "Yeah modern computers are way more up in your business.",
                          "score": 9,
                          "created_utc": 1747620000.0,
                          "replies": [
                            {
                              "id": "mt3faak",
                              "author": "luke10050",
                              "body": "The real scary thing is a lot of windows based PLC's use custom black magic to steal a CPU core from the OS and run real time tasks on it.",
                              "score": 2,
                              "created_utc": 1747647288.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mt2325x",
                          "author": "DoingCharleyWork",
                          "body": "With ltsc that wouldn't be a problem. Even Enterprise allows you to disable updates.",
                          "score": 2,
                          "created_utc": 1747621296.0,
                          "replies": [
                            {
                              "id": "mt23ehk",
                              "author": "Znuffie",
                              "body": "You can do it with Pro, too, with GPO, but not everyone has techs that are aware of doing this. This is especially true for factories and/or other similar places that would require such antique software.",
                              "score": 3,
                              "created_utc": 1747621425.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mt45dxd",
                          "author": "HashedEgg",
                          "body": "The solution for that scenario is easy, don't use windows",
                          "score": 1,
                          "created_utc": 1747659638.0,
                          "replies": []
                        },
                        {
                          "id": "mt7etrv",
                          "author": "yokoshima_hitotsu",
                          "body": "Yeah so don't run the hypervisor as windows then. Use Linux Kvm.",
                          "score": 1,
                          "created_utc": 1747695864.0,
                          "replies": [
                            {
                              "id": "mt7w4ns",
                              "author": "Znuffie",
                              "body": "Easy to say. Hard to do for the average tech that is employed in a factory.\n\nSource: I provide remote tech support to such factories.\n\nYes, I could be setting stuff up for the techs to use, but they also need to be able to do surf themselves.",
                              "score": 1,
                              "created_utc": 1747702054.0,
                              "replies": [
                                {
                                  "id": "mt7zcre",
                                  "author": "yokoshima_hitotsu",
                                  "body": "Your average help desk tech isn't going to be able to service ms-dos either though. \n\nHyper-V is a bit more approachable however really still should be using Windows Server for that on production for that exact reason to control updates and consolidate machines. \n\nIt'd actually be way easier to troubleshoot, backup, restore, rebuild if it was on a server with out of band management like idrac or ilo with any hypervisor. Kvm is but one example given for cost and simplicity reason.\n\nIt might even be possible to replace many legacy machines this way depending on their connections to the equipment you could just run a longer cable to the server room and use usb/pci/e passthrough to the virtual machines.",
                                  "score": 1,
                                  "created_utc": 1747703246.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mt2acbz",
                      "author": "iMadrid11",
                      "body": "The only issue would be the computer hardware.  As old computers age.  It would be more difficult to find replacement hardware for it.  So you better have stockpiles of the same computer hardware available ready to swap when they fail.  \n\nOr you can use virtualization using new computers to achieve the same functionality.  The new computer doesn’t even need to powerful. Since it’s running old software.",
                      "score": 1,
                      "created_utc": 1747624259.0,
                      "replies": [
                        {
                          "id": "mt31tbp",
                          "author": "Killbot_Wants_Hug",
                          "body": "You can run DOS on a modern computer, on bare metal even.\n\nI think the real problem is IO. The computer is probably controlling something, and if so it's sending the message out over some IO, and it isn't going to be USB.\n\nBest case scenario is it's via a serial port. You'll need to get an adapter and hope it doesn't introduce any issues. But there are other more obscure obsolete ports and you'd need to source adaptors for those, and since they're obsolete the adapters will get more scarce over time.\n\nWorse case scenario, you've got some kind of custom controller card. Then you've got to source a motherboard with compatible expansion slot. And good luck finding a new board with something like an ISA slot.",
                          "score": 1,
                          "created_utc": 1747638703.0,
                          "replies": [
                            {
                              "id": "mt3br5u",
                              "author": "fullmetaljackass",
                              "body": ">Worse case scenario, you've got some kind of custom controller card. Then you've got to source a motherboard with compatible expansion slot. And good luck finding a new board with something like an ISA slot.\n\nThere are companies that are still making new motherboards that support modern-ish CPUs with ISA slots and legacy IO for the industrial market \n\nhttps://adek.com/product/MS-98A9",
                              "score": 2,
                              "created_utc": 1747645037.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mt311mv",
                      "author": "Killbot_Wants_Hug",
                      "body": "Yeah, unless you're leaving the INTEL/AMD world, all the instructions sets that DOS uses are still there.\n\nI might be remembering this wrong, but I feel like Microsoft didn't implement the kernel issuing HLT's when idle until XP (maybe it was 98SE though), which was after the underlying DOS environment was removed. So I would sort of expected if they're running an old DOS system it's not properly issuing HLT's. This means the CPU effectively doesn't get to idle which would drive power usage up significantly on modern hardware. Virtualization might help resolve that since you to throttle down the virtual CPU speed.",
                      "score": 1,
                      "created_utc": 1747638226.0,
                      "replies": []
                    },
                    {
                      "id": "mt5jcsw",
                      "author": "Netmantis",
                      "body": "There are advantages to virtualization, however it not only depends on the application but the hardware involved.\n\nTo give an example, an old customer of mine used a stenography machine that outputted on 3.5\" floppy disc's. The software to output transcripts only ran in DOS, nothing else. The key dongle demanded serial and output was txt files or parallel port postscript printer. Finding a serial, parallel, and ps/2 ports on a modern board is asking a lot. Then you have getting the files off that computer and onto something with internet access as most clients are now asking for digital files. Virtualization means USB is translated before DOS sees it. Making using a modern machine a lot easier and cheaper. Pass through folders mounted as drives means you can pass files to the host which is on the internet. This application demanded virtualization as the old hardware was going extinct.\n\nIn other cases an \"upgrade\" actually reduces features or gets rid of something a shop actually needs. So you maintain old software in virtual machines that fit on a USB key and replacement  just involves installing the virtualization software on the new machine.",
                      "score": 1,
                      "created_utc": 1747675161.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mtgdt4a",
                  "author": "Oodlemeister",
                  "body": "Similar story here when I was working for a small IT company. A local hotel had been running a very old computer for years on Windows XP. Their booking software was custom built on DOS. Original dev long gone. \n\nThe computer finally shit itself and they had to upgrade. I had to go through the (very basic) code and figure out how to get it running on the new machine. Ended up just using DOSBox to run it and built a batch file to launch it with all the settings they needed. \n\nIt was really fun figuring out how it all worked from knowing nothing about it.",
                  "score": 1,
                  "created_utc": 1747826534.0,
                  "replies": []
                },
                {
                  "id": "mt120ha",
                  "author": "Leafington42",
                  "body": "I think now they have the tech equivalent of bubblegum guns so they can shoot bubblegum on the bubblegum and tape foundation",
                  "score": 1,
                  "created_utc": 1747607573.0,
                  "replies": []
                },
                {
                  "id": "mt13ius",
                  "author": "CreaminFreeman",
                  "body": "We’re in the process of building a new software system for such a client",
                  "score": 1,
                  "created_utc": 1747608119.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mt1obn5",
              "author": "silentcrs",
              "body": ">The PC was modern, but they virtualised the original machine which I thought was funky\n\nNot uncommon. Some enterprises even do this and then lock off the VM from most of the network. If you do it right, the risk is (relatively) controlled.",
              "score": 9,
              "created_utc": 1747615790.0,
              "replies": [
                {
                  "id": "mt2avsz",
                  "author": "Raider2747",
                  "body": "IMAX 70mm projectors used to run off a Palm Pilot. Nowadays, many of them use a tablet with a Palm Pilot emulator.",
                  "score": 11,
                  "created_utc": 1747624493.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mt11uan",
              "author": "Leafington42",
              "body": "My sales terminal at a Fred Meyers actually runs dos on the boot and simply puts a gui over it",
              "score": 3,
              "created_utc": 1747607512.0,
              "replies": []
            },
            {
              "id": "mt1kiqn",
              "author": "Chrisfindlay",
              "body": "I've seen similar. I used a point of sale system that was DOS based running in a virtual machine on a windows 7 pc in 2017.",
              "score": 1,
              "created_utc": 1747614358.0,
              "replies": []
            },
            {
              "id": "mt30d62",
              "author": "Killbot_Wants_Hug",
              "body": "There's a surprising number of companies that use systems that look like DOS applications (may not actually be DOS though).\n\nLike I work for a company with about 10k employees and billions in revenue. One of our core systems is a COBOL mainframe system. The application that accesses it got a face life so it no longer looks like a green screen terminal interface. But that was only a couple years ago.\n\nAnd our company has a legion of programmers as well, it's just a system considered so big, so complex, and so core to the operation they don't want to move it.",
              "score": 1,
              "created_utc": 1747637815.0,
              "replies": [
                {
                  "id": "mt32aj6",
                  "author": "Annon201",
                  "body": "Running UNISYS OS2200.. Its very special, and first debut'd in 1967, for a mainframe that came out in 1962.. A huge amount of core finance and govt operates with it.",
                  "score": 1,
                  "created_utc": 1747638999.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mt3xvah",
              "author": "NyxbornShitposter",
              "body": "they do a similar thing for IMAX where the controls for the reel system is run on a [Palm Pilot emulator on a modern tablet](https://www.vice.com/en/article/88x5gb/imax-still-runs-on-palmpilot-operating-system)",
              "score": 1,
              "created_utc": 1747656709.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt14w6h",
          "author": "GregLittlefield",
          "body": "If it works don't fix it.\n\nTil the day it no longer works, and then shits really hit the fan.",
          "score": 35,
          "created_utc": 1747608618.0,
          "replies": [
            {
              "id": "mt1ptf2",
              "author": "Vox-Machi-Buddies",
              "body": "Yep, a lot of our \"need\" to constantly update OSes comes from three or so things:\n * Desire for new features\n * Being connected to the Internet\n * Hardware changes\n\nA system that's offline (or on a highly-controlled network) and does what you need? The OS will probably be able to keep working until hardware breaks and replacements are no longer sold, forcing you to upgrade to something the OS doesn't support.",
              "score": 28,
              "created_utc": 1747616341.0,
              "replies": []
            },
            {
              "id": "mt1oubi",
              "author": "BrokenAstraea",
              "body": "Does it really still work if it stopped getting regular security updates? \n\nI don't think many realize Windows is constantly updated against new vulnerabilities very often",
              "score": 1,
              "created_utc": 1747615983.0,
              "replies": [
                {
                  "id": "mt2zoq3",
                  "author": "Reviever",
                  "body": "often these systems aren't connected to the network or the Internet.",
                  "score": 12,
                  "created_utc": 1747637411.0,
                  "replies": [
                    {
                      "id": "mt47dqi",
                      "author": "friedrice5005",
                      "body": "[Well good thing they're completely safe from being infected then! /s](https://en.wikipedia.org/wiki/Stuxnet)",
                      "score": -1,
                      "created_utc": 1747660377.0,
                      "replies": [
                        {
                          "id": "mt4ftue",
                          "author": "Reviever",
                          "body": "if u got physical access already, then there's not much u can do.",
                          "score": 4,
                          "created_utc": 1747663270.0,
                          "replies": []
                        },
                        {
                          "id": "mt5u128",
                          "author": "qtx",
                          "body": "Stuxnet still relied on human error.\n\nIt needed someone to physically insert an USB stick in the device to transfer the 'worm'.\n\nThe level of detail needed to make Stuxnet is impressive but it still replied 100% on human error to cross the air gap.",
                          "score": 1,
                          "created_utc": 1747678212.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mt18k5a",
          "author": "blanczak",
          "body": "Yeah this will be fun when 2038 rolls around 😀\n\nThe \"end\" of 32-bit Unix time occurs on January 19, 2038, at 03:14:07 UTC. This is when a 32-bit signed integer, commonly used to store Unix timestamps, will overflow, meaning it will no longer be able to accurately represent time.",
          "score": 26,
          "created_utc": 1747609958.0,
          "replies": [
            {
              "id": "mt19aq6",
              "author": "NorysStorys",
              "body": "Old industrial machines like CNCs and stuff will keep trucking on, they don’t require dates for the work they do and you would be amazed how resilient those old boards and chips are if you replace the caps every decade or two.",
              "score": 25,
              "created_utc": 1747610228.0,
              "replies": [
                {
                  "id": "mt19yw4",
                  "author": "blanczak",
                  "body": "For sure. My concern lies with PLCs and such used for a lot of industrial controls, many of which rely heavily on a correlated time reference. I suppose maybe if we correlate against an internal clock and go back to 1985 or something we could buy some time per se. 🙂",
                  "score": 13,
                  "created_utc": 1747610474.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mt19wkp",
              "author": "Right_Hour",
              "body": "Just do what we did with Y2K - roll back and run all your shit in 1900 :-)",
              "score": 15,
              "created_utc": 1747610450.0,
              "replies": [
                {
                  "id": "mt1kxr8",
                  "author": "PuppetPal_Clem",
                  "body": "I'm personally hoping to be making some good money around when this happens as a guy whose primary hobby is older computing platforms and programming languages.",
                  "score": 8,
                  "created_utc": 1747614515.0,
                  "replies": [
                    {
                      "id": "mt2y1e9",
                      "author": "System0verlord",
                      "body": "That’s… not a bad idea actually.",
                      "score": 3,
                      "created_utc": 1747636431.0,
                      "replies": []
                    },
                    {
                      "id": "mtfvlrn",
                      "author": "dsnineteen",
                      "body": "Cyberspace Cowboys!",
                      "score": 1,
                      "created_utc": 1747816235.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mtb4hmj",
                  "author": "notyouravgredditor",
                  "body": "Except the Unix epoch is 1/1/1970....",
                  "score": 1,
                  "created_utc": 1747754215.0,
                  "replies": []
                },
                {
                  "id": "mt1a4zs",
                  "author": "blanczak",
                  "body": "lol yup. Ahh the good old days 😀🫡",
                  "score": 0,
                  "created_utc": 1747610535.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mt48xvu",
              "author": "BaconSoul",
              "body": "It will have been a good 2,147,483,647 seconds.",
              "score": 2,
              "created_utc": 1747660935.0,
              "replies": []
            },
            {
              "id": "mt3b96b",
              "author": "giobs111",
              "body": "That's Unix problem not Windows. Windows use 64 bit floating-point for date",
              "score": 1,
              "created_utc": 1747644719.0,
              "replies": []
            },
            {
              "id": "mt41va1",
              "author": "Aimhere2k",
              "body": "It'll be Y2K all over again... only maybe an actual problem this time.",
              "score": 1,
              "created_utc": 1747658318.0,
              "replies": [
                {
                  "id": "mt4ohk3",
                  "author": "stellvia2016",
                  "body": "It was a problem, but they knew they couldn't avoid it, so most companies simply mitigated it ahead of time.",
                  "score": 1,
                  "created_utc": 1747665981.0,
                  "replies": []
                },
                {
                  "id": "mt5uipe",
                  "author": "qtx",
                  "body": "I hate people downplaying y2k because they didn't see any major problems because of it. Well guess what, that's because thousands of people worked to mitigate any problems for months prior.",
                  "score": 1,
                  "created_utc": 1747678354.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mt1bwx3",
          "author": "Royal_Acanthisitta51",
          "body": "Thank god for virtualization. We couldn’t keep DOS and Windows XP running without it! And Industrial Control System Manufacturers are making new industrial operator terminals with Windows CE.",
          "score": 5,
          "created_utc": 1747611172.0,
          "replies": []
        },
        {
          "id": "mt1832m",
          "author": "canyoudiggitman",
          "body": "I have old automation systems running DOS and the only difference now is booting from an SD card on a tiny computer vs. booting from a tower and a floppy.",
          "score": 3,
          "created_utc": 1747609785.0,
          "replies": []
        },
        {
          "id": "mt1h1nz",
          "author": "RobertABooey",
          "body": "Or even older aircraft lol.\n\nThere are likely airplanes flying around with passengers on it right now running Windows XP.",
          "score": 3,
          "created_utc": 1747613057.0,
          "replies": [
            {
              "id": "mt2zx69",
              "author": "moon__lander",
              "body": "XP? Older Boeing hulls receive updates on floppys",
              "score": 1,
              "created_utc": 1747637552.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt1wn9a",
          "author": "i_suckatjavascript",
          "body": "My old workspace has a solder machine that still runs on Windows XP. That machine would be fucked if they updated the OS. It doesn’t need to be connected to the internet to run as it’s run by an offline program. If it ain’t broke, don’t fix it.",
          "score": 1,
          "created_utc": 1747618914.0,
          "replies": []
        },
        {
          "id": "mt1zkru",
          "author": "MrDLTE3",
          "body": "I used to operate the fuel stations in a military facility. \n\nThe OS was win2000. It was bonkers.",
          "score": 1,
          "created_utc": 1747620010.0,
          "replies": []
        },
        {
          "id": "mt2jlen",
          "author": "0utlook",
          "body": "Boeing keeping ahold of some older 486 machines for testing software... I think it was used for Gunship?",
          "score": 1,
          "created_utc": 1747628537.0,
          "replies": []
        },
        {
          "id": "mt2vvbo",
          "author": "cgaWolf",
          "body": "The trinity of OSes that have been running the world for the past 25 years: Windows CEMENT",
          "score": 1,
          "created_utc": 1747635147.0,
          "replies": []
        },
        {
          "id": "mt2x6li",
          "author": "nicman24",
          "body": "what do you mean there are no motherboards with ISA slots?",
          "score": 1,
          "created_utc": 1747635920.0,
          "replies": []
        },
        {
          "id": "mt307u8",
          "author": "JimmyKillsAlot",
          "body": "Three different employers I have had in the last decade all had vital parts of their systems still relying on legacy DOS programs that required knowing how to navigate intricate menus.",
          "score": 1,
          "created_utc": 1747637727.0,
          "replies": []
        },
        {
          "id": "mt3f4sq",
          "author": "luke10050",
          "body": "INB4 codesys based PLC's",
          "score": 1,
          "created_utc": 1747647192.0,
          "replies": []
        },
        {
          "id": "mt4nuz2",
          "author": "bjcworth",
          "body": "Aren't all of these prone to security vulnerabilities at this point?",
          "score": 1,
          "created_utc": 1747665788.0,
          "replies": []
        },
        {
          "id": "mt730kx",
          "author": "strange-brew",
          "body": "I’m using c++ 11 right now because of the costs (time and money) associated with upgrading to a newer version.",
          "score": 1,
          "created_utc": 1747691777.0,
          "replies": []
        },
        {
          "id": "mt0yb6v",
          "author": "JustAnother4848",
          "body": "I came here to say the same thing.",
          "score": 1,
          "created_utc": 1747606274.0,
          "replies": []
        },
        {
          "id": "mt4b52w",
          "author": "FordicusMaximus",
          "body": "Multi billion dollar machine that is integral to daily operations...? Windows 97. And that was in 2022. 🙃",
          "score": 0,
          "created_utc": 1747661715.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mt0z15r",
      "author": "gameguy600",
      "body": "In industrial settings it is quite common to still see DOS and Win 95/98 machines in daily use. The machines they control were built to be used for around 40-70 years so many will continue to soldier on for many decades still.",
      "score": 221,
      "created_utc": 1747606523.0,
      "replies": [
        {
          "id": "mt10yox",
          "author": "NonSequiturSage",
          "body": "They are never allow to talk to strange computers without IT present.",
          "score": 79,
          "created_utc": 1747607199.0,
          "replies": [
            {
              "id": "mt1266d",
              "author": "Lint_baby_uvulla",
              "body": "Hah.  AI turned IT into tech chaperones.  \n\n“And what, RansonHub, are your intentions towards my sweet innocent industrial control system?”",
              "score": 45,
              "created_utc": 1747607629.0,
              "replies": [
                {
                  "id": "mt2xb18",
                  "author": "nicman24",
                  "body": "drilling mostly",
                  "score": 11,
                  "created_utc": 1747635994.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mt13ofo",
          "author": "AvonMustang",
          "body": "There is a reason companies like NIXSYS still sell brand new DOS, Windows 9x, NT, etc computers...\n\n[https://nixsys.com/](https://nixsys.com/)",
          "score": 42,
          "created_utc": 1747608175.0,
          "replies": [
            {
              "id": "mt3oszm",
              "author": "this-guy1979",
              "body": "My former job had computers that monitored each cycle of certain machines, roughly 180 machines cycling every 12 minutes on average.  They monitored time, temperature, and pressure, saving a snapshot of each cycle for quality purposes.  They ran windows NT, they were the most stable machines in the plant.  They would get shutdown for maintenance every six months and it would take half an hour to count RAM during POST.  It was wild, we had new computers to update the processes and do production changes sitting right next to the ancient ones keeping an eye on things.",
              "score": 6,
              "created_utc": 1747652612.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt19bxr",
          "author": "None",
          "body": "It isn’t just industrial settings. In 2010 I worked for a large US retailer that still ran the majority of its Point of Sale systems on Windows 95. The “new” registers in newly opened stores ran Windows 98.",
          "score": 22,
          "created_utc": 1747610240.0,
          "replies": [
            {
              "id": "mt315v7",
              "author": "somesketchykid",
              "body": "Medical too unfortunately.",
              "score": 3,
              "created_utc": 1747638299.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt1rff1",
          "author": "tgwill",
          "body": "And the cost to replace the highly specialized software is more than the entire IT team budget.",
          "score": 16,
          "created_utc": 1747616935.0,
          "replies": [
            {
              "id": "mt1u45p",
              "author": "the_cardfather",
              "body": "So true story. I used to work at the largest regional brokerage in the United States. They were well known as the second largest employer of COBOL programmers since the entire back office of this multi-billion dollar (31B as of Friday) operation ran on a 40 year old Tandem mainframes. \n\nThe cost to replace the servers was estimated at over a billion dollars which is one of the reasons they were waiting for the CEO to retire to pull the trigger on the switch. \n\nThere were a whole series of sql servers whose sole job was to process & archive the data dumps from those machines so they could be accessed by modern front ends.",
              "score": 19,
              "created_utc": 1747617948.0,
              "replies": [
                {
                  "id": "mt2n9ig",
                  "author": "kevnuke",
                  "body": "I wonder how much it cost to repair them when things inevitably fried",
                  "score": 3,
                  "created_utc": 1747630399.0,
                  "replies": [
                    {
                      "id": "mt31ai3",
                      "author": "somesketchykid",
                      "body": "As much as it takes, but its spread out over each year and some years are better than others and its not an upfront big shock cost\n\nBusiness x_x",
                      "score": 5,
                      "created_utc": 1747638379.0,
                      "replies": []
                    },
                    {
                      "id": "mt9oddj",
                      "author": "th3davinci",
                      "body": "Let's just say that it's very profitable to be a COBOL fin tech programmer in retirement.",
                      "score": 4,
                      "created_utc": 1747733876.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mt2ndhq",
              "author": "kevnuke",
              "body": "This. This is what AI will eventually be used to do. Rewrite legacy software",
              "score": -2,
              "created_utc": 1747630457.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt1z22y",
          "author": "cmdr_suds",
          "body": "In many industrial applications, the real work is being done by PLCs.  Some of which came out in the 80s.  (I’m looking at you, Mr. PLC-2) the windows 98 machine is typically only a GUI and doesn’t even know what a USB stick is.",
          "score": 8,
          "created_utc": 1747619824.0,
          "replies": [
            {
              "id": "mt35m4p",
              "author": "pelrun",
              "body": "That would be an ideal situation, since it's mostly straightforward to port the ladder logic from an end-of-life PLC to a newly purchased one.\n\nBig machine tools that have complex PC software which is dongle locked invariably seem to end up where the company has gone out of business/been bought/decided to stop supporting that configuration two decades ago and insists that you completely discard the tool and buy a new one at list price instead of just repairing the PC.",
              "score": 4,
              "created_utc": 1747641090.0,
              "replies": [
                {
                  "id": "mt9m7wc",
                  "author": "123_fake_name",
                  "body": "Up until 2000 we had a lot of equipment running off cam timers, why change what works until you have to.",
                  "score": 1,
                  "created_utc": 1747732508.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mt2ngyi",
              "author": "kevnuke",
              "body": "Hopefully not the ones in the Iranian nuclear reactors.",
              "score": 2,
              "created_utc": 1747630507.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt3lrov",
          "author": "GreyGoosey",
          "body": "An agricultural firm some friends and families work at is almost entirely DOS besides the end user's PC. However, they pretty much just use that PC to work on the DOS systems and MS Office. Pretty wild, but the firm doesn't seem a reason to upgrade as it all just works despite being old as shit.",
          "score": 2,
          "created_utc": 1747651066.0,
          "replies": []
        },
        {
          "id": "mt2s49n",
          "author": "Cake-Over",
          "body": "I've worked in warehouses that still use DOS. It's like seeing someone I knew in middle school again.",
          "score": 1,
          "created_utc": 1747633014.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mt1kzek",
      "author": "bert93",
      "body": "Doesn't really matter as long at they are kept offline and air gapped from other networks.\n\nJust treat it like a standalone OS running a piece of hardware, which is what it is.",
      "score": 161,
      "created_utc": 1747614532.0,
      "replies": [
        {
          "id": "mt1q2xi",
          "author": "jestermax22",
          "body": "The glory days when not everything had to be networked. Maybe Battlestar Galactica was onto something…",
          "score": 65,
          "created_utc": 1747616439.0,
          "replies": [
            {
              "id": "mt1x6w9",
              "author": "i_suckatjavascript",
              "body": "Still don’t understand why single player games need internet connection to play. Only logical explanation is to sell you more shit. I can run CS2 offline if I only want to play with bots or practice in workshops.",
              "score": 42,
              "created_utc": 1747619118.0,
              "replies": [
                {
                  "id": "mt244w9",
                  "author": "monsantobreath",
                  "body": "To sell you stuff and satisfy the execs who care about DRM.",
                  "score": 14,
                  "created_utc": 1747621710.0,
                  "replies": []
                },
                {
                  "id": "mt23w5k",
                  "author": "throwaway09827472",
                  "body": "It’s an anti-piracy measure. Money over everything else. Praise Gaben.",
                  "score": 15,
                  "created_utc": 1747621615.0,
                  "replies": []
                },
                {
                  "id": "mt4o88c",
                  "author": "THEdoomslayer94",
                  "body": "The very minimum is that they collect player data for stats that some games do agate a few months to show how many enemies killed or what kind of character players make. And to also see where their game has issues regarding difficultly spikes or places where people just flat out stop playing.\n\nAnd THEN everything else is built on top of that to sell shit and what not, forcing multiplayer into games that didn’t really need it and what not. DRM and all that as well",
                  "score": 1,
                  "created_utc": 1747665901.0,
                  "replies": []
                },
                {
                  "id": "mt636xn",
                  "author": "Main_Enthusiasm4796",
                  "body": "Bc the my sell un finished projects that need major patches to fix it",
                  "score": 1,
                  "created_utc": 1747680903.0,
                  "replies": []
                },
                {
                  "id": "mtf8bd4",
                  "author": "Kellic",
                  "body": "Authentication to make sure you aren't one of those dirty, dirty pirates....ARRRRRGH!!",
                  "score": 1,
                  "created_utc": 1747802816.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mt21rfb",
          "author": "blazze_eternal",
          "body": "Even then, there are relatively safe ways to proxy their access.",
          "score": 10,
          "created_utc": 1747620814.0,
          "replies": []
        },
        {
          "id": "mt996ts",
          "author": "SirVezaTheBrave",
          "body": "This is how nuclear plants are run. I mean, that should be a given. Air gapped and away from other networks is standard for a lot of highly important infrastructure. ",
          "score": 1,
          "created_utc": 1747724216.0,
          "replies": []
        },
        {
          "id": "mtf87cg",
          "author": "Kellic",
          "body": "I came here for this comment.  As long as it isn't networked it can run a Windows NT 4.0 Workstation.  Just don't expect support when something breaks and it WILL break at some point.",
          "score": 1,
          "created_utc": 1747802761.0,
          "replies": []
        },
        {
          "id": "mt3undj",
          "author": "teem",
          "body": "~~Laughs~~ \\*cries in cybersecurity",
          "score": 1,
          "created_utc": 1747655328.0,
          "replies": [
            {
              "id": "mt45sgn",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1747659789.0,
              "replies": [
                {
                  "id": "mt46k2i",
                  "author": "teem",
                  "body": "I was more laughing at trying to protect them, even offline. People seem to have a knack for connecting \"air-gapped\" networks to the web, then running ancient and outdated operating systems.",
                  "score": 1,
                  "created_utc": 1747660076.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mt5i2o3",
              "author": "marcin_dot_h",
              "body": "They're gonna do what, hack into my perfectly fine CNC mills?\n\nOne is running xp, two are on 2000 and last one is running NT4.0",
              "score": 1,
              "created_utc": 1747674792.0,
              "replies": [
                {
                  "id": "mt5ih89",
                  "author": "teem",
                  "body": "Probably not, but you'd be terrified to know how many hospitals, prisons, nuclear facilities, chemical manufacturing, etc have the same set up.",
                  "score": 2,
                  "created_utc": 1747674909.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mt0y0pu",
      "author": "jeepfail",
      "body": "Windows XP isn’t even the oldest OS I’ve used in manufacturing and I recall when they tried to update one from XP to 10. It took days to quickly go back. So many things operate on the ever reliable “if it’s not broke don’t fix it” mantra and it helps the world go round.",
      "score": 136,
      "created_utc": 1747606175.0,
      "replies": [
        {
          "id": "mt2gil1",
          "author": "beardicusmaximus8",
          "body": "Nuclear power plants still run on Windows 3.0 and the control rooms look like the original Star Trek bridge set",
          "score": 40,
          "created_utc": 1747627046.0,
          "replies": [
            {
              "id": "mt3jcex",
              "author": "Edward_TH",
              "body": "There is a second reason why they look like that: to be absolutely sure that they work as intended, control elements tends to be both shielded AND radiation hardened. Certified and tested hardened hardware takes time to reach the market, generally 10+ years, so once it gets to actual costumers it's already outdated compared to similar, not hardened hardware.\n\nFor example, Perseverance launched in 2020: it's CPU is a radiation hardened, underpowered version of a PowerPC G3 processor that was launched in *1997*. The radiation hardened version launched in 2001 but the first time it flown was 2005, 8 years after the launch. Ingenuity, that landed with it, was a revolutionary and very experimental probe in that sense because it didn't use radiation hardened electronic but only shielding and indeed used an off the shelf 2014 SoC and so it was much, much more powerful than Perseverance.",
              "score": 26,
              "created_utc": 1747649711.0,
              "replies": [
                {
                  "id": "mt8zeoq",
                  "author": "dragon_stryker",
                  "body": "What does it mean to be radiation hardened?",
                  "score": 1,
                  "created_utc": 1747718682.0,
                  "replies": [
                    {
                      "id": "mt9l6kt",
                      "author": "Edward_TH",
                      "body": "It's a bunch of techniques that have the purpose of ensuring that electronics are much, much less susceptible to radiation. Some involves physically altering the manufacturing process (eg. using much larger transistors size to increase the gap), some involve increasing redundancy (eg. putting spare cache or cores in the die in case radiation destroys one of the main part) and some involve running code that accounts for error and corrects them (eg. ECC ram).",
                      "score": 2,
                      "created_utc": 1747731835.0,
                      "replies": []
                    },
                    {
                      "id": "mtaqxe0",
                      "author": "robs104",
                      "body": "The radiation, very basically, can either make the part operate differently electrically. Like it makes voltages screwy. It can also physically damage a CPU. Imagine super tiny little bullets going a percentage of the speed of light knocking things around in the silicon. Hardened means it’s was less susceptible to those things. Again, very basically. I’m far from a physicist.",
                      "score": 1,
                      "created_utc": 1747750191.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mt329i9",
          "author": "Pifflebushhh",
          "body": "I’m sure I recently saw an ATM reboot and it was running windows 2000, this is in the UK, could be misremembering though",
          "score": 5,
          "created_utc": 1747638981.0,
          "replies": [
            {
              "id": "mt438kx",
              "author": "Milnoc",
              "body": "Chances are you're not.",
              "score": 2,
              "created_utc": 1747658841.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt2ps60",
          "author": "proverbialbunny",
          "body": "It's fine if it doesn't touch the internet.  Big if.  The problem with these old operating systems is they get viruses really easily if anything on the system touches the net.",
          "score": 16,
          "created_utc": 1747631737.0,
          "replies": [
            {
              "id": "mt3n0u0",
              "author": "jeepfail",
              "body": "The machines I’ve used you would have to try daily hard for it to even touch the internet since many of them weren’t designed for it anyways.",
              "score": 3,
              "created_utc": 1747651722.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt4lt4g",
          "author": "HubrisOfApollo",
          "body": "A few years ago I was doing tech contract work for a asphalt hot mix plant and the telemetry computer software ran only in a pure DOS mode. They kept on using really dated hardware (because they didn't know better) and I virtualized it for them. As far as I know, its still chugging along running DOS 6.2",
          "score": 1,
          "created_utc": 1747665154.0,
          "replies": [
            {
              "id": "mt4npgd",
              "author": "jeepfail",
              "body": "Okay, that’s got mine beat. The oldest I’ve had was windows 95 and last I heard that machine was just decommissioned last year.",
              "score": 1,
              "created_utc": 1747665742.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mt0xipt",
      "author": "stanley_leverlock",
      "body": "You'd be shocked and horrified at the number of end-of-life-as-we-know-it weapons systems that rely on much older operating systems and software and hardware. ",
      "score": 196,
      "created_utc": 1747606004.0,
      "replies": [
        {
          "id": "mt101gw",
          "author": "CeldonShooper",
          "body": "Also: nuclear reactor computer technology from the 1970s still kept alive to keep the reactor running",
          "score": 76,
          "created_utc": 1747606876.0,
          "replies": [
            {
              "id": "mt12xa0",
              "author": "Gnomio1",
              "body": "The good news is that the physics behind the reactor hasn’t changed in 50 years, and that software is simple and bulletproof.",
              "score": 78,
              "created_utc": 1747607902.0,
              "replies": [
                {
                  "id": "mt31n77",
                  "author": "Ernost",
                  "body": ">and that software is simple and bulletproof. \n\nUnless some dumb fuck decides to plug in a USB stick they found in the parking lot...",
                  "score": 14,
                  "created_utc": 1747638598.0,
                  "replies": [
                    {
                      "id": "mt33hoa",
                      "author": "gamageeknerd",
                      "body": "So this is less of an issue that you’d think. In higher security areas it’s incredibly difficult to get unauthorized storage devices like usb sticks into a facility like that. You’d go through a few checks before getting access to a computer that isn’t connected to an outside network so worst they get is access to non critical infrastructure like payment processing and security systems. \n\nI’ve had to go through a few checks when accessing data centers and it’s not as easy as walking in with something you picked up off the street. Most cases like the one you are describing are bad actors with access already like employees and then that’s a whole other issue.",
                      "score": 8,
                      "created_utc": 1747639745.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mt43tug",
                  "author": "renrutal",
                  "body": "It's fine as long as a year 2k38 bug or something like doesn't hit them.",
                  "score": 1,
                  "created_utc": 1747659061.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mt149m9",
          "author": "SSLByron",
          "body": "It's less horrifying when you consider that they're perpetually air-gapped by virtue of generally being older than Al Gore himself.",
          "score": 48,
          "created_utc": 1747608390.0,
          "replies": [
            {
              "id": "mt1idpe",
              "author": "stanley_leverlock",
              "body": "Yep. Minor consolation. ",
              "score": 8,
              "created_utc": 1747613550.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt28w2d",
          "author": "BadNewsBearzzz",
          "body": "Yup it’s a great security measure, I remember learning something like the nuclear keys are still stored and used on floppy discs with those types of government programs running on DOS, why? Because they are secure, viruses are wrote for like newer windows OS’s, those old systems only need to run one or a few functions so they’re perfect\n\nPlenty of times you’ll see government or military computers with the old blue screen and old text on theme for the most basic things. They don’t need to run any type of modern software",
          "score": 16,
          "created_utc": 1747623644.0,
          "replies": []
        },
        {
          "id": "mt1qy19",
          "author": "JimsonWeeder",
          "body": "Defense systems running on DOS and 70s tech that could launch apocalyptic scenarios. Terrifying when you realize our nuclear arsenal runs on tech older than most people operating it.",
          "score": 8,
          "created_utc": 1747616756.0,
          "replies": [
            {
              "id": "mt2ka1o",
              "author": "Reiep",
              "body": "Why is it terrifying if it's reliable as in bug proof software after tens of years of usage, and bug fixes. Don't look at all the banking systems still relying on AS/400 and COBOL to handle your accounts then.\n\nThe only real downside is hardware availability for what's not repairable.",
              "score": 15,
              "created_utc": 1747628877.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mt0yjjp",
      "author": "texaspoontappa93",
      "body": "One of the ultrasound machines that we use to place IV catheters uses some version of windows vista. The little blue loading circle gives me some nice nostalgia",
      "score": 93,
      "created_utc": 1747606354.0,
      "replies": []
    },
    {
      "id": "mt0xk24",
      "author": "Jindujun",
      "body": "Boy oh boy have I.\n\nI've even used Windows XP WHILE knowing it! A nice little piece of system software.",
      "score": 237,
      "created_utc": 1747606017.0,
      "replies": [
        {
          "id": "mt15vry",
          "author": "stellvia2016",
          "body": "XP was widely regarded as bloated for it's time, and rather unstable until SP2. Win2K by comparison, would boot fully functional at half the ram usage. (75mb vs 150mb when most systems only had 256mb installed)",
          "score": 70,
          "created_utc": 1747608979.0,
          "replies": [
            {
              "id": "mt1v8ge",
              "author": "the_cardfather",
              "body": "Win2k Server was incredibly stable. I considered installing it on my desktop PCs. Win 95/97 was still crashing and burning and a lot of people didn't want to upgrade off of XP.\n\nIf I'm not mistaken didn't they release a late version of XP That was supposed to be more resource friendly.",
              "score": 13,
              "created_utc": 1747618376.0,
              "replies": [
                {
                  "id": "mt2l75j",
                  "author": "stellvia2016",
                  "body": "I'm not sure, but that's exactly what I did: You could install standard GPU drivers like XP used, so there was no reason for me not to use 2K bc it was simply better across the board than XP.",
                  "score": 3,
                  "created_utc": 1747629343.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mt19p6w",
              "author": "Jindujun",
              "body": "Agreed, XP was a nice system, especially with SP2.\n\nSame with Win98SE",
              "score": 20,
              "created_utc": 1747610374.0,
              "replies": [
                {
                  "id": "mt2niif",
                  "author": "Vinyl-addict",
                  "body": "XP is still my favorite iteration of windows I’ve ever worked with and I’m only 25 😅",
                  "score": 13,
                  "created_utc": 1747630531.0,
                  "replies": [
                    {
                      "id": "mt493pc",
                      "author": "virtuousvoice",
                      "body": "Same and in my late 20s. I honestly loved the way things were laid out in XP as far as UI goes. It wasn’t laid out like an App Store yet.",
                      "score": 2,
                      "created_utc": 1747660991.0,
                      "replies": [
                        {
                          "id": "mt8gd0u",
                          "author": "Strictly_Baked",
                          "body": "I use classic shell on my PC so the UI works and looks just like XP. I have no idea how to navigate 10/11.\n\nMe was shit, XP was the best, Vista was shit, 7 was really solid 8 and 8.5 were fucking atrocious and 10/11 is alright.",
                          "score": 1,
                          "created_utc": 1747709752.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mt1spbu",
              "author": "Throwaway-tan",
              "body": "At least it improved with time. Unlike Windows 11 which seems to be getting worse with time.",
              "score": 15,
              "created_utc": 1747617414.0,
              "replies": [
                {
                  "id": "mt2lf19",
                  "author": "stellvia2016",
                  "body": "ngl I froze my feature version at 23H2 still, but outside of that I've had very few complaints with W11 with the way I use the OS. I quite like the quick menu and the improved virtual desktop support is nice. Only annoyance is how the search doesn't work for certain common tasks like changing display refresh rate or what are the active monitors etc. Or certain network adapter related tasks are simply easier bringing up the classic control panel/settings menus.",
                  "score": 1,
                  "created_utc": 1747629456.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mt1kk96",
              "author": "akgis",
              "body": "Win2k couldnt run alot of games for example. WinXP had to be a general purpose machines.\n\nBut I agree WinXP was a mess at start but yeh new codebase that was made for reliability now need to be compatible with alot of stuff so alot of hacks where done,\n\n I knew alot of ppl that stayed on 98SE for a while",
              "score": 10,
              "created_utc": 1747614373.0,
              "replies": [
                {
                  "id": "mt29gdy",
                  "author": "Kepabar",
                  "body": "Yeah,  2k didn't have the direct x or driver support for it since it was supposed to be for businesses only.",
                  "score": 4,
                  "created_utc": 1747623882.0,
                  "replies": [
                    {
                      "id": "mt4226h",
                      "author": "Master_chan",
                      "body": "You could still install DirectX 9 on it and game without problems. Same with Windows 2003 (which was XP but for servers)",
                      "score": 3,
                      "created_utc": 1747658391.0,
                      "replies": [
                        {
                          "id": "mt481ah",
                          "author": "Kepabar",
                          "body": "Yes, I used to play Unreal Tournament and Neverwinter Nights on Win2k all the time.\n\nBut once XP launched support for future updates for 2K for drivers and the like dropped off.",
                          "score": 2,
                          "created_utc": 1747660612.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mt2m7kg",
              "author": "fire2day",
              "body": "I just remember telling me there was an [estimated 45 minutes remaining](https://i.imgur.com/pXlSj7h.png) on the install. Now I download an ISO, create an installer USB, and install Windows in a span of like 15 minutes.",
              "score": 1,
              "created_utc": 1747629856.0,
              "replies": []
            },
            {
              "id": "mt2x8wf",
              "author": "nicman24",
              "body": "hell 64 bit was trash before sp3",
              "score": 1,
              "created_utc": 1747635959.0,
              "replies": []
            },
            {
              "id": "mt3x8eo",
              "author": "jrcomputing",
              "body": "2k was NT5 without all of the extra code necessary to run windows 95/98 programs not built for NT. XP (NT5.1) brought all of that extra stuff along for the ride.",
              "score": 1,
              "created_utc": 1747656442.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt1oyvo",
          "author": "silentcrs",
          "body": "Windows XP seems to have a warm, nostalgic following, but at the time it was considered candy-colored, bloated crap.\n\nIf you look at the pro OS during that time, Windows 2000, now THAT was a nice OS. Slow to load but super efficient once it got going. And no extraneous bloat. I have fond memories of that OS.",
          "score": 26,
          "created_utc": 1747616030.0,
          "replies": [
            {
              "id": "mt2641t",
              "author": "aj_thenoob2",
              "body": "It's looked upon that way because its service life has basically been double its intention, systems got way faster in that timeframe. Early XP machines were slow as fuck.",
              "score": 6,
              "created_utc": 1747622497.0,
              "replies": []
            },
            {
              "id": "mt3zopd",
              "author": "pentamethylCP",
              "body": "> Windows XP seems to have a warm, nostalgic following, but at the time it was considered candy-colored, bloated crap.\n> \n> \n\nIf I recall correctly, it had a lot to do with how much RAM was common in PCs at the time. The minimum system requirements were a Pentium 233 with 64 MB of ram which would have been a very fast windows 95 PC. \n\nBy the end of XP's regular use, it was very common to have 1GB of ram or more with a 3 GHz CPU, so it isn't surprising that people remember it as being fast and lean.",
              "score": 1,
              "created_utc": 1747657454.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt12m7o",
          "author": "Harry_Iconic_Jr",
          "body": "same here.",
          "score": 2,
          "created_utc": 1747607791.0,
          "replies": []
        },
        {
          "id": "mt41rzj",
          "author": "STRATEGO-LV",
          "body": "Having worked with pretty much all Windows since 3.1, XP definitely is the nicest little piece of OS.  \nWith that being said, Windows 11 has become the worst in my list.",
          "score": 1,
          "created_utc": 1747658283.0,
          "replies": [
            {
              "id": "mt49zno",
              "author": "Jindujun",
              "body": "Windows 11 makes me cry. I hate Microsoft for forcing me to switch!",
              "score": 2,
              "created_utc": 1747661307.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mt0xkb2",
      "author": "None",
      "body": "[deleted]",
      "score": 155,
      "created_utc": 1747606019.0,
      "replies": [
        {
          "id": "mt11gy1",
          "author": "YouToot",
          "body": "How could you know? \n\nIt is beyond science.",
          "score": 31,
          "created_utc": 1747607380.0,
          "replies": [
            {
              "id": "mt176ge",
              "author": "zernoc56",
              "body": "It is known",
              "score": 17,
              "created_utc": 1747609452.0,
              "replies": []
            },
            {
              "id": "mt1dqml",
              "author": "DetroitArtDude",
              "body": "Sometimes you can recognize the old Windows XP style GUI elements that are running on the underlying system. I've suspected this sort of thing a few times as well.",
              "score": 11,
              "created_utc": 1747611837.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt18ctp",
          "author": "deejay_harry1",
          "body": "Mine was on an ATM machine. Thing just crashed and rebooted, the whole window XP boot up thing.",
          "score": 5,
          "created_utc": 1747609883.0,
          "replies": [
            {
              "id": "mt2nakl",
              "author": "Vinyl-addict",
              "body": "You would be surprised how antiquated a lot of the back end in banking is. Fortran is still somewhat common in certain applications because it just fuckin works, is still really good at what it does, and is still fast to boot.",
              "score": 5,
              "created_utc": 1747630414.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt1nhjv",
          "author": "FrighteningJibber",
          "body": "Self checkout at Walmart?",
          "score": 3,
          "created_utc": 1747615475.0,
          "replies": []
        },
        {
          "id": "mt115qs",
          "author": "MyVoiceIsElevating",
          "body": "Calm down grandpa",
          "score": 0,
          "created_utc": 1747607269.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mt16iyx",
      "author": "GrynaiTaip",
      "body": "This title is funny. I've used WinXP knowingly, I remember debating with a classmate whether it's better than Win95.",
      "score": 78,
      "created_utc": 1747609213.0,
      "replies": [
        {
          "id": "mt1pwnk",
          "author": "jestermax22",
          "body": "Windows 3.1.1 for Workgroups has entered the chat",
          "score": 21,
          "created_utc": 1747616374.0,
          "replies": [
            {
              "id": "mt25205",
              "author": "sin94",
              "body": "Heck I can recall using 32 floppy disks to install only to find out an error and reformat and reinstall. \n\nTo reformat you needed to know dos commands",
              "score": 5,
              "created_utc": 1747622070.0,
              "replies": [
                {
                  "id": "mt2c9et",
                  "author": "PlanitDuck",
                  "body": "I remember needing dos commands just to start the operating system haha",
                  "score": 1,
                  "created_utc": 1747625100.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mt3ygt6",
          "author": "Zaphod1620",
          "body": "Neither, Windows 2000 was the best.",
          "score": 3,
          "created_utc": 1747656957.0,
          "replies": [
            {
              "id": "mt9wnl2",
              "author": "max8126",
              "body": "Definitely not for retail. NT compatibilities are bad. Can't beat 9x. XP got better gradually.",
              "score": 1,
              "created_utc": 1747738481.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt4nwdd",
          "author": "nebur727",
          "body": "WinXP and age of empires were the good times",
          "score": 1,
          "created_utc": 1747665800.0,
          "replies": []
        },
        {
          "id": "mt9wtoi",
          "author": "max8126",
          "body": "I recall similar debates but wouldn't it have been XP vs 98SE?",
          "score": 1,
          "created_utc": 1747738563.0,
          "replies": [
            {
              "id": "mta0ly1",
              "author": "GrynaiTaip",
              "body": "Ah, you're right, it was 98.",
              "score": 2,
              "created_utc": 1747740349.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mt18u0g",
      "author": "Devils8539a",
      "body": "In the U.S banks were forced off of Windows XP. If they didn't the bank would lose their FDIC insurance. \n\nI did contract work to remove or upgrade XP systems with Windows 8 with a bank based in upstate NY.\n\n It was a pretty funny situation as the IT manager was trying to get with the bank president to move along on this. The president wouldn't give him the time of day until he got the notice that he would lose his insurance with the government. After that it was full steam ahead. Lol",
      "score": 74,
      "created_utc": 1747610058.0,
      "replies": []
    },
    {
      "id": "mt0xzdo",
      "author": "Suzuiscool",
      "body": "Our most useful program still runs in dos",
      "score": 79,
      "created_utc": 1747606162.0,
      "replies": [
        {
          "id": "mt31t71",
          "author": "Annon201",
          "body": "Our most useful programs run OS2200/Exec 8 and run on virtualised UNIVAC mainframe.. Exec 8 was first released in 1967, and the UNIVAC mainframe first came out in 1950 using vacuum tubes and drum memory. The UNIVAC 1107, their first silicon transistor based mainframe was released 1962.\n\nIt exists throughout finance and government doing its thing crunching important numbers that drive the world.\n\nAnd fun fact.. The operating system is fundamentally unhackable, but it also works very different to any general purpose operating system.",
          "score": 16,
          "created_utc": 1747638701.0,
          "replies": [
            {
              "id": "mt3jpmv",
              "author": "Grimnebulin68",
              "body": "Dear ChatGPT, please make this software work reliably and without any ambiguities in Windows 11. Then recommended a decent RRP in the millions 🤣",
              "score": 3,
              "created_utc": 1747649922.0,
              "replies": [
                {
                  "id": "mt3yw2w",
                  "author": "Annon201",
                  "body": "Not gunna happen.. \n\nIBM AS/400 i5/OS and UNISYS OS2200 do very very specific things and do them well..\n\n\ni5/OS is essentially a relational database as an operating system - with the filesystem being specifically designed for database queries and redundancy, and everything else designed around manipulation of large datasets. \nYou'll find almost every massive finance database that's been around since 80s or earlier is running on it. The 3270 terminal was also designed for building menus and grids, and minimising data transfer by being able to update individual areas of the terminal instead of the whole screen.\n\n\nAnd OS2200 is a transactional operating system. The whole purpose of the OS is to crunch numbers in real-time in a multiprocessor multi-user environment.  \nYou don't have programs or apps, you have tasks and activities. They are pushed to a queue with very limited ability to run persistant background processes - it has fine grained pre-emptive thread scheduling and enforces trust at a fundamental level, with every batch job compartmentalised and unable to manipulate data outside of its container. Your nuclear missile silos, weather observations, and pretty much the entire airline industry runs on this (United and Air Canada had a hand in its development in the late 60s).\n\n\n\nBoth are very very application specific, doing what they need to do fast and efficiently.",
                  "score": 7,
                  "created_utc": 1747657133.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mt320dm",
          "author": "PantherPL",
          "body": "This is my go-to optometrician chain. They literally open a grey-letters-on-black terminal in DOSBox and navigate it with keyboard shortcuts.",
          "score": 4,
          "created_utc": 1747638823.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mt0yint",
      "author": "quats555",
      "body": "Yep. In a private practice and just Friday we were looking at which computers we’ll be forced to upgrade by October, due to the Windows 10 support cutoff. \n\nThen one of us had to point out that several very expensive pieces of equipment are running on older versions of Windows. Our OCT is running Windows 10 and shows incompatible with 11. Our ultrasound is on Windows 7 and our old IT guy had horror stories of making it work with even just 7, there’s no chance of upgrading that one. He thinks our evoked potentials flash unit is also on 7.\n\nIt would be $50k to get a new OCT, $100k for a new ultrasound. It would take *years* of low health insurance reimbursements to finally pay back the cost, plus more for interest. Ugh.",
      "score": 84,
      "created_utc": 1747606346.0,
      "replies": [
        {
          "id": "mt13gao",
          "author": "DDFoster96",
          "body": "I'm an analytical chemist and most of the equipment in our lab is still hooked up to Windows XP machines. We even had a Windows 3 computer hanging around until a few years ago.\n\n\nEven for a £500,000 instrument we got in 2019 the cost to upgrade the software to run on Windows 11 and not Windows 10 is £100,000 (I think they're trying it on) so that's staying on 10. \n\n\nI suspect that for a lot of devices you could run the older OS, software and necessary drivers with virtualisation (vmware etc.), which brings security benefits. But who's going to want to qualify that setup or handle the downtime to implement it? ",
          "score": 21,
          "created_utc": 1747608094.0,
          "replies": []
        },
        {
          "id": "mt25up0",
          "author": "bcjgreen",
          "body": "100k for an ultrasound in private practice?  That makes no sense.  I work for one of the largest manufacturers of ultrasounds in the world, and 50k would be a very high end system for a private practice (unless it’s cardiology or OB).\n\nAlso… remember that the OS we use on these machines is NOT the desktop version.  For example, we currently ship with Windows 10, but it’s LTSC 21H2, which is supported by Microsoft until 2032 (the standard desktop version are already med of life).  Even if it’s legacy, there’s likely no need to upgrade the OS (unless you are using a machine well past its designed lifetime).",
          "score": 6,
          "created_utc": 1747622393.0,
          "replies": [
            {
              "id": "mt28rvq",
              "author": "quats555",
              "body": "Ophthalmology, with A-scan, B-scan, and UBM wands. Though UBM is financially stupid now since it costs more in materials than you get from insurance.\n\n$100k is what our ultrasound tech said the company quoted for a whole system replacement a few years ago when the UBM wand broke. Maybe it’s gotten cheaper since?",
              "score": 3,
              "created_utc": 1747623595.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt0z99n",
          "author": "firedrakes",
          "body": "then your going to have to silo them.",
          "score": 10,
          "created_utc": 1747606602.0,
          "replies": [
            {
              "id": "mt11jlf",
              "author": "Lint_baby_uvulla",
              "body": "“Silo them”\n\nLocal business farms out ATMs running XP.  \n\nATMs.  Money.  On stock Windows XP.  \n\nYeah.",
              "score": 16,
              "created_utc": 1747607406.0,
              "replies": [
                {
                  "id": "mt15pgn",
                  "author": "woodyshag",
                  "body": "I heard some of the ATMs used OS2/Warp.",
                  "score": 5,
                  "created_utc": 1747608914.0,
                  "replies": [
                    {
                      "id": "mt174hu",
                      "author": "RealTurbulentMoose",
                      "body": "Security through obscurity!",
                      "score": 3,
                      "created_utc": 1747609433.0,
                      "replies": [
                        {
                          "id": "mt1elta",
                          "author": "firedrakes",
                          "body": "or floppy security baby!",
                          "score": 1,
                          "created_utc": 1747612154.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mt44bjz",
                  "author": "taliesin-ds",
                  "body": "i used to run an atm version of win 10 on my main pc since last week lmao.",
                  "score": 1,
                  "created_utc": 1747659244.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mt2b5pb",
          "author": "Mr-Impressed",
          "body": "It makes me wonder if you can image the xp computers and run them as virtual machine inside a modern computer.",
          "score": 1,
          "created_utc": 1747624614.0,
          "replies": []
        },
        {
          "id": "mt2tij8",
          "author": "HideyoshiJP",
          "body": "The IT guy shouldn't have been upgrading the OS on the ultrasound. That should be a service call to the manufacturer.",
          "score": 1,
          "created_utc": 1747633792.0,
          "replies": [
            {
              "id": "mt2ujz0",
              "author": "quats555",
              "body": "They refused to service it themselves but did help him with getting it working by phone (interspersed with “better to buy a new one!”) He was also our ultrasound tech so had the best shot of anyone in the clinic.",
              "score": 1,
              "created_utc": 1747634384.0,
              "replies": [
                {
                  "id": "mt2wvka",
                  "author": "HideyoshiJP",
                  "body": "Oh, I wasn't questioning his ability. I was just thinking in terms of liability. I'm not surprised that the manufacturer wouldn't do it though. A new device makes more money than a $400/hr＋travel service call.",
                  "score": 1,
                  "created_utc": 1747635737.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mt178lb",
      "author": "squidvett",
      "body": "I mean eventually it’s like buying the new Madden every year.",
      "score": 18,
      "created_utc": 1747609474.0,
      "replies": []
    },
    {
      "id": "mt158b9",
      "author": "whjoyjr",
      "body": "Shoot, I know of systems still running WindowsNT in production.  It’s a totally isolated environment but they are hoarding hardware that runs NT until 2030 when they are scheduled to fly-out.",
      "score": 17,
      "created_utc": 1747608741.0,
      "replies": []
    },
    {
      "id": "mt16gk2",
      "author": "Yalkim",
      "body": "But I was told that if I dont update my windows 11 for 1 week it becomes full of security flaws and hackers will hack me and steal my data",
      "score": 36,
      "created_utc": 1747609188.0,
      "replies": [
        {
          "id": "mt2m4c5",
          "author": "CGB_Zach",
          "body": "That's a dumb comparison/joke. These older OS are airgapped and not connected to external networks.",
          "score": 28,
          "created_utc": 1747629810.0,
          "replies": [
            {
              "id": "mt2swoc",
              "author": "Yalkim",
              "body": "And the only data that my windows PC contains is my video game save files, which I am okay with being hacked (if any end user has ever been a target of a targeted hack in the past decade or two). But that doesn't stop the AkTsChuAlLy people (such as yourself, from what it looks like) from screaming \"SECURITY! SECURITY! SECURITY!\" as soon as anyone even dares remotely suggest the idea of not updating windows.",
              "score": -4,
              "created_utc": 1747633453.0,
              "replies": [
                {
                  "id": "mt2z74d",
                  "author": "Bdr1983",
                  "body": "Hey, you do you.\nBut there are other reasons why security updates are important.\nWhen vulnerabilities are not patched, you could become part of a botnet, for example.",
                  "score": 9,
                  "created_utc": 1747637121.0,
                  "replies": [
                    {
                      "id": "mt3dr4v",
                      "author": "AbhishMuk",
                      "body": "You’re technically right, but most botnets are poorly designed IOT devices and the likes, not windows PCs. Even on windows 10, defender is quite capable, and doubly so if you set it up properly.",
                      "score": 1,
                      "created_utc": 1747646319.0,
                      "replies": [
                        {
                          "id": "mt3dvw4",
                          "author": "Bdr1983",
                          "body": "If you update, defender will pick it up, yes. But this person is going on about not doing updates. Unlikely they'll have defender set up properly.",
                          "score": 3,
                          "created_utc": 1747646403.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mt3olvu",
                  "author": "bridgetroll2",
                  "body": "Do you use that computer on the same network as your phone or any other devices that you use to access email or sensitive data? \n\n If any end user has been hacked? Lol wut? Thousands upon thousands of end users are hacked every day.",
                  "score": 1,
                  "created_utc": 1747652514.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mt1a1yg",
      "author": "Radical_Unicorn",
      "body": "If not for the Y2K freakout back then and everyone upgrading everything, I’m 100% sure they would still be using DOS or some other pre-21st century os….",
      "score": 7,
      "created_utc": 1747610504.0,
      "replies": [
        {
          "id": "mt1bn45",
          "author": "DrSheetzMTO",
          "body": "I can, without question, tell you that some large employers are still using DOS.",
          "score": 5,
          "created_utc": 1747611074.0,
          "replies": []
        },
        {
          "id": "mt3q6hh",
          "author": "meistermichi",
          "body": "It wasn't a freakout, it was a serious issue that didn't end in a freakout exactly because of all the effort that was put into it to fix it before it happened.",
          "score": 1,
          "created_utc": 1747653284.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mt18o4u",
      "author": "RealTurbulentMoose",
      "body": "Vancouver’s Expo and Millennium SkyTrain Lines runs on [1992 software contained on floppy discs](https://vancouversun.com/news/metro/inside-the-skytrain-control-room), and even the \"new\" Compass card readers run on [14 year old Windows Mobile.](https://www.reddit.com/r/vancouver/comments/d775ho/til_compass_card_readers_run_on_a_9_year_old/)",
      "score": 6,
      "created_utc": 1747609998.0,
      "replies": []
    },
    {
      "id": "mt4ezl4",
      "author": "JudgmentHaunting3544",
      "body": "At my current job, almost all the ‘network’ computers run on some old OS, possibly Windows XP, but the scary thing is we make state-of-the-art, very expensive and complicated equipment used by Space X and lots of other advanced companies. The operation is literally run on pencil, paper, and Excel.\n\nWhen I interviewed for the position, one of the managers told me to be ready to go ‘back in time.’ I thought he was just kidding but nope, the company is set in its ways but then again, I guess you don’t fix what isn’t broken. Company is crazy profitable and literally has zero competition.",
      "score": 6,
      "created_utc": 1747662997.0,
      "replies": []
    },
    {
      "id": "mt0y2x1",
      "author": "Oil_slick941611",
      "body": "And even older systems are still in use as well in retail and tech running everything behind the scenes",
      "score": 4,
      "created_utc": 1747606196.0,
      "replies": []
    },
    {
      "id": "mt12a4g",
      "author": "Lego_Blocks24",
      "body": "I remember a post about a campsite owner still running (I think) an old commodore with a custom application that they had made to manage site bookings - if it works, it works :)",
      "score": 4,
      "created_utc": 1747607668.0,
      "replies": []
    },
    {
      "id": "mt16ygn",
      "author": "GISP",
      "body": "**If its not broke, dont fix it!**  \nI used monochrome terminals that predates DOS.  \nIt does exactly what its suppose to do and nothing more. There is 0 risk of sudden software error, it just runs.  \nPunch cards and direct wire setup akin to old telephone-operator switchbourds have simelar electronic warfare or hacking protections. You cant remote hack a system where you manualy swap antenna connections and the wires are insulated from EM waves.  \nAlso theft protecion if your only option for data output is via printing on physical papir.  \nAnyone getting physical access woudnt be able to install malware via USP or stuff if there is no USB ports :D  \nAnyways, legacy hardware has its place and uses. Dont \"upgrade\" stuff just becouse its old.",
      "score": 5,
      "created_utc": 1747609371.0,
      "replies": []
    },
    {
      "id": "mt19c6t",
      "author": "Crosswire3",
      "body": "XP is still the best Windows.",
      "score": 5,
      "created_utc": 1747610243.0,
      "replies": []
    },
    {
      "id": "mt1cswi",
      "author": "UlteriorEggos",
      "body": "I was at a bank in 2018 and the banker.pulled.up.something that was clearly Windows 95. I made a comment and he got defensive. I get that security is important and that takes time...but yes...lots of key systems are still running on FUCKING old software.",
      "score": 4,
      "created_utc": 1747611496.0,
      "replies": []
    },
    {
      "id": "mt1katw",
      "author": "piceathespruce",
      "body": "I have never worked in a laboratory or scientific facility that didn't have some ancient tower with a sticky note saying you could never turn it off.",
      "score": 4,
      "created_utc": 1747614274.0,
      "replies": []
    },
    {
      "id": "mt1q7w5",
      "author": "gorcorps",
      "body": "Last year that faulty Crowdstrike update that crashed a ton of windows machines, including most airline systems, didn't affect Southwest because they're still using archaic windows systems.",
      "score": 3,
      "created_utc": 1747616490.0,
      "replies": []
    },
    {
      "id": "mt21s4t",
      "author": "LordSesshomaru82",
      "body": "The cutting lasers I operate at work run on XP. There's a mill that runs DOS. Legacy IT is practically a given in manufacturing.",
      "score": 5,
      "created_utc": 1747620821.0,
      "replies": [
        {
          "id": "mt3h2fd",
          "author": "imacmadman22",
          "body": "I used to work at a place that uses a sign engraving system that runs on a Windows 95 computer. It does what they need and it’s not complicated so they don’t see any reason to “upgrade” because it just works for them. It’s also not connected to their network, so they don’t bother to install updates.",
          "score": 1,
          "created_utc": 1747648377.0,
          "replies": [
            {
              "id": "mt7i7on",
              "author": "LordSesshomaru82",
              "body": "A good quote I once read somewhere says that a machine is only really obsolete when nobody can find a use for it anymore. Not to mention industrial equipment can be very costly, especially when the machine they have still works.",
              "score": 2,
              "created_utc": 1747697040.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mt2jxpg",
      "author": "strange_bike_guy",
      "body": "25 pin parallel port connectors don't work right about Windows XP. My CNC mill is still running XP and Mach3, I have small pile of old desktops accumulating when their capacitors eventually blow out. \n\nThe old stuff is interesting because back then the manufacturers spec'd really nice caps.",
      "score": 5,
      "created_utc": 1747628706.0,
      "replies": []
    },
    {
      "id": "mt143ik",
      "author": "Sir_Lanian",
      "body": "If it aint broke dont fix it.",
      "score": 10,
      "created_utc": 1747608327.0,
      "replies": [
        {
          "id": "mt3komh",
          "author": "Jubenheim",
          "body": "The only issue is the older an OS gets without security updates, the “broke-r” it will become.",
          "score": 1,
          "created_utc": 1747650470.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mt10tmw",
      "author": "haarschmuck",
      "body": "Windows XP Embedded is not the same as Windows XP.",
      "score": 8,
      "created_utc": 1747607149.0,
      "replies": []
    },
    {
      "id": "mt16j6z",
      "author": "shadowsipp",
      "body": "A lot of my retail jobs were using Windows XP for cash registers and all throughout the company for every computer task, up until basically the present.. it's really part of the reason it took so long to open the stores in the mornings.. the boot up process took forever.. some of the companies have moved on to using tablet style computers..",
      "score": 3,
      "created_utc": 1747609216.0,
      "replies": []
    },
    {
      "id": "mt1mopy",
      "author": "RussianTater",
      "body": "I work in a state of the art clinical reference lab the most recent version of windows we have on an analyzer is 7",
      "score": 3,
      "created_utc": 1747615173.0,
      "replies": []
    },
    {
      "id": "mt1y127",
      "author": "cvr24",
      "body": "Just cut a PO last week to have our public building's fire alarm PC replaced.  The old one is running Windows XP and if it conks out it's not like I can go to the local computer store and buy replacement parts or rebuild it from scratch. It's a listed device certified by UL and the replacement cost is insane.",
      "score": 3,
      "created_utc": 1747619435.0,
      "replies": []
    },
    {
      "id": "mt1zt9a",
      "author": "Blue-Thunder",
      "body": "Nevermind how many ATM's are still running OS/2.",
      "score": 3,
      "created_utc": 1747620095.0,
      "replies": []
    },
    {
      "id": "mt26805",
      "author": "None",
      "body": "It should terrify everyone how completely thoughtless and selfish and greedy Microsoft is. They put shareholder value above everything else, and lay off almost half of their software devs. Every product they have is in jeopardy of breaking and they are counting on AI to fix all of it now",
      "score": 3,
      "created_utc": 1747622541.0,
      "replies": []
    },
    {
      "id": "mt2jkg0",
      "author": "FuryxHD",
      "body": "Japan still uses floppy discs.",
      "score": 3,
      "created_utc": 1747628524.0,
      "replies": []
    },
    {
      "id": "mt3jw7z",
      "author": "imacmadman22",
      "body": "When I first started working in IT my workplace was still using its very first computer systems; one was DEC Vax system and the other was IBM AS/400. \n\nOne of my first jobs then was backing up those systems to tape drives, which I was familiar with from my earlier work in the military back in the early 1990’s when we were using a MS-DOS systems.\n\nIt’s all relative, my current workplace has a bunch of old servers running Windows Server 2003 in virtual machines because they have databases that they are required to maintain for legal reasons. \n\nThe data in those databases predates the entire IT organization at my workplace. It was migrated over from paper records that were entered by hand in the late 1980’s.",
      "score": 3,
      "created_utc": 1747650028.0,
      "replies": []
    },
    {
      "id": "mt3qzex",
      "author": "crimskies",
      "body": "My machine at work runs on Windows 2000!",
      "score": 3,
      "created_utc": 1747653662.0,
      "replies": []
    },
    {
      "id": "mt4gugk",
      "author": "hooplah_charcoal",
      "body": "I once (somehow) crashed the Transformers shooting game at a Chuck E Cheese and when it rebooted, I saw it was running windows XP from the loading screen. Pretty hilarious",
      "score": 3,
      "created_utc": 1747663603.0,
      "replies": []
    },
    {
      "id": "mt4oqg7",
      "author": "eruditeimbecile",
      "body": "I would still be running Windows XP if I could.",
      "score": 3,
      "created_utc": 1747666058.0,
      "replies": []
    },
    {
      "id": "mt0xi2a",
      "author": "Bohottie",
      "body": "The goat. Of course it’s still being used.\n\nFun fact, I work in mortgage servicing, and the main servicing software, MSP, is a DOS based system that hadn’t changed since the 80s, I’m guessing. It’s like going back in time, but it’s simple, reliable, and easy to use, which is why it’s still the standard in the industry.",
      "score": 4,
      "created_utc": 1747605998.0,
      "replies": []
    },
    {
      "id": "mt14oa5",
      "author": "crs100",
      "body": "Some of the computers in the kids area of my local museum are still running 95/98.\n\nIf it ain’t broke… don’t fix it.",
      "score": 4,
      "created_utc": 1747608537.0,
      "replies": []
    },
    {
      "id": "mt0xqhc",
      "author": "Watch_Andor",
      "body": "I wish my work was still using xp lol",
      "score": 2,
      "created_utc": 1747606078.0,
      "replies": []
    },
    {
      "id": "mt137j9",
      "author": "shortnun",
      "body": "Aerospace company I worked at 4 years ago was using Commodore 64 to run the production line testing for Air plane componets.. the production line has been using one since  1983/84 ..  before I left I qualified  a windows 2008 testing and data aquasition production line.\n\npreviously at my first engineering job the testing computer was running windows  3.11  for testing a critical electrical componet  for smart weaponz used by the US military.",
      "score": 2,
      "created_utc": 1747608006.0,
      "replies": []
    },
    {
      "id": "mt151hr",
      "author": "MyReddittName",
      "body": "If it works, why upgrade?",
      "score": 2,
      "created_utc": 1747608673.0,
      "replies": []
    },
    {
      "id": "mt1bhgf",
      "author": "Spagman_Aus",
      "body": "Let's talk about airport IT systems for a minute just to further horrify you.",
      "score": 2,
      "created_utc": 1747611018.0,
      "replies": []
    },
    {
      "id": "mt1fses",
      "author": "enki941",
      "body": "I'm not sure if they are still doing it, but I know that Microsoft was still providing security updates to Windows XP for special customers even years after it went EOL/EUS. \n\nThere is a good article about it here:\nhttps://www.howtogeek.com/186754/microsoft-is-still-making-security-updates-for-windows-xp-but-you-cant-have-them/\n\nTL;DR: If you are big enough and willing to shell out what could be millions of dollars a year for a \"custom support relationship\", then Microsoft will be more than happy to take your money.",
      "score": 2,
      "created_utc": 1747612591.0,
      "replies": []
    },
    {
      "id": "mt1j01h",
      "author": "upward_spiral17",
      "body": "I still use XP. I regularly receive a warning that support ceased in 2014.",
      "score": 2,
      "created_utc": 1747613783.0,
      "replies": []
    },
    {
      "id": "mt1jy81",
      "author": "SubwayHero4Ever",
      "body": "Such a great OS. Still have a desktop that runs it.",
      "score": 2,
      "created_utc": 1747614141.0,
      "replies": []
    },
    {
      "id": "mt1lmpo",
      "author": "IntergalacticPopTart",
      "body": "I swear I have heard a few ATM’s make windows XP sounds before.",
      "score": 2,
      "created_utc": 1747614775.0,
      "replies": []
    },
    {
      "id": "mt1zu4n",
      "author": "Coolbiker32",
      "body": "Not surprised. Am in Mumbai in India. The ATM near my home uses Win7  that's not activated. It had booted into the desktop instead of the ATM app one day and I noticed the Activation prompt at the bottom right.",
      "score": 2,
      "created_utc": 1747620104.0,
      "replies": []
    },
    {
      "id": "mt25giv",
      "author": "SundaySuffer",
      "body": "WinXp + botox = win11",
      "score": 2,
      "created_utc": 1747622231.0,
      "replies": []
    },
    {
      "id": "mt29nhk",
      "author": "Lakefish_",
      "body": "Hospitals and dentist offices both, that i've gone to, swapped from XP to 7.\n\nThen 10\n\nThe staff are begging to go back, instead of to 11 - half the programs take triple the time to load, some \"replacements\" for the old ones don't even pretend to function and the patient data had to be manually transferred, several times, because it refused to save.\n\nXP is going to be Linux's biggest competitor, soon.",
      "score": 2,
      "created_utc": 1747623964.0,
      "replies": []
    },
    {
      "id": "mt2sb53",
      "author": "SnooSquirrels5518",
      "body": "Used to reset train computers all the time when incurring certain situations and yes they run on old operating systems. For those applications it seems that they are doing the job just fine.",
      "score": 2,
      "created_utc": 1747633121.0,
      "replies": []
    },
    {
      "id": "mt2wepe",
      "author": "Left_Pool_5565",
      "body": "We used to call XP the “Last Known Good Operating System” 😂",
      "score": 2,
      "created_utc": 1747635462.0,
      "replies": []
    },
    {
      "id": "mt30n9n",
      "author": "OneUpAndOneDown",
      "body": "I never wanted to stop using XP. Screw Vista and Windows 10. Jumped the fence to Mac rather than put up with MS updates every 18 months. Only now ten years later am I backed into the corner and facing a compulsory upgrade.",
      "score": 2,
      "created_utc": 1747637983.0,
      "replies": []
    },
    {
      "id": "mt32lwn",
      "author": "howardhus",
      "body": "Headline:\n\n>**Decades-old Windows systems are still running [] hospitals**\n\nArticle:\n\n\n>One example is **a hospital elevator** in New York City, spotted this year, which still runs on Windows XP\n\nyea.. i am totally *shocked* that some random elevator that *runs the whole hospital* does not sport Windows11 pro...",
      "score": 2,
      "created_utc": 1747639192.0,
      "replies": [
        {
          "id": "mt3fbrx",
          "author": "Gecko99",
          "body": "I've actually been in a malfunctioning hospital elevator. The brakes kept randomly actuating unexpectedly and caused two phlebotomists to fall. Their injuries were minor, just twisted ankles I think, but could have been much worse. One was born with a back deformity and the other had just celebrated her third 75th birthday.\n\nThe hospital only had three floors at the time but the elevator came with buttons for four, so maybe it had been purchased used. Our pneumatic tube system was also second hand.\n\nThe software for the elevator is apparently designed for elevators of any length. After hitting the brakes it reboots and speaks all the floor numbers \"first floor, second floor,\" etc. But it actually says all the floor numbers in its programming. So it rapidly keeps counting upwards until I think 20th floor, then it counts off every tenth floor, I think until 100.\n\nThen the door opens and maybe it's between floors. \n\nManagement couldn't replicate the problem so the lab staff avoided that elevator, but it continued to be used by patients, nurses, doctors, and other staff.",
          "score": 0,
          "created_utc": 1747647314.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mt34vfr",
      "author": "Nilmerdrigor",
      "body": "I am decades-old and have used windows XP while knowing it. \n\nIt was awesome.",
      "score": 2,
      "created_utc": 1747640626.0,
      "replies": []
    },
    {
      "id": "mt3mej1",
      "author": "scuddlebud",
      "body": "Most banking software that handles all the money around the world are written in FORTRAN... Very few people can code FORTRAN these days.",
      "score": 2,
      "created_utc": 1747651402.0,
      "replies": []
    },
    {
      "id": "mt3o3b7",
      "author": "CubanLynx312",
      "body": "I work for the VA (largest healthcare system in the country) and I’m painfully aware it runs on DOS",
      "score": 2,
      "created_utc": 1747652258.0,
      "replies": []
    },
    {
      "id": "mt4aek7",
      "author": "Anubis17_76",
      "body": "My Coffeemachine at work does the WinXP error beet before it starts its cleaning process :D",
      "score": 2,
      "created_utc": 1747661455.0,
      "replies": []
    },
    {
      "id": "mt4emmi",
      "author": "DaBozz88",
      "body": "The field is not labeled as Operational Technology or OT and how it's almost combative with IT. OT requires the old shit to run, IT wants that patched now. Something's gotta give.",
      "score": 2,
      "created_utc": 1747662880.0,
      "replies": []
    },
    {
      "id": "mt57r5m",
      "author": "digrappa",
      "body": "Now do cobol.",
      "score": 2,
      "created_utc": 1747671765.0,
      "replies": []
    },
    {
      "id": "mt5kmk1",
      "author": "Elven_Groceries",
      "body": "AS400, anyone? Talk about old software. XP was the best.",
      "score": 2,
      "created_utc": 1747675522.0,
      "replies": []
    },
    {
      "id": "mt6poao",
      "author": "weeklygamingrecap",
      "body": "These stories pop up so often and everyone freaks out because people can't seem to fathom that there are a shit ton of computers not connected to the internet and are fully standalone or part of some internal network that'll also never touch the internet.\n\nOn top of that the cost to move some of these machines to newer hardware is insane. Even in just software you're talking programs decades old which sometimes can have thousands of templates. You'd need to pay a crazy amount of money for someone to not only convert but verify every single field and also validate any kind of edge cases the original program already does.",
      "score": 2,
      "created_utc": 1747687627.0,
      "replies": [
        {
          "id": "mt7kp2x",
          "author": "TheMountainLife",
          "body": "Yep. Lots of medical instruments and x-ray equipment are still used today run XP 32-bit. Annoying to deal with since Dr's with clinics of all sizes would have Pikachu shock face when I deny them remote access. But there's no upgrade path with those things, only full replacement which can easily exceed the annual operating cost of the entire business.",
          "score": 2,
          "created_utc": 1747697901.0,
          "replies": [
            {
              "id": "mtuzcgv",
              "author": "weeklygamingrecap",
              "body": "Yeah it's sad how priorities go. Some places are stingy and sometimes it makes sense. A huge multi-million dollar facility with a ton of equipment and there's like 7 Windows 2000 devices that see almost a full days work daily are stained and abused and have been there 30 years and clearly need an upgrade because they are limping along. \"Sorry, can't upgrade, to expensive.\" Yet there's a newer version the vendor has to sell that would actually make life better. But the latest AI enabled robot that ends up sitting in a corner most of the year, \"BUY! BUY! BUY! We need 2 of them tomorrow! Get the blank checkbook and make it happen!\"\n\nOther places it makes sense, bespoke, lots of unique customizations, rare usage, etc.",
              "score": 2,
              "created_utc": 1748017601.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mt12in4",
      "author": "Remoteatthebeach",
      "body": "Win XP was the best OS ever invented",
      "score": 3,
      "created_utc": 1747607755.0,
      "replies": [
        {
          "id": "mt2ul4k",
          "author": "sai-kiran",
          "body": "Until windows 14 comes out, when everyone will be praising how windows 10 was the best OS ever created XD.",
          "score": 2,
          "created_utc": 1747634403.0,
          "replies": [
            {
              "id": "mt3hjzo",
              "author": "Remoteatthebeach",
              "body": "Windows 10 was an attempt to go back to Windows XP after vista flopped",
              "score": 2,
              "created_utc": 1747648669.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt2754o",
          "author": "NVVV1",
          "body": "No. The Linux kernel is. 10 times more pervasive and supports x86, arm, ppc, mips, sparc, riscv, etc",
          "score": 3,
          "created_utc": 1747622914.0,
          "replies": [
            {
              "id": "mt3m494",
              "author": "Remoteatthebeach",
              "body": "But then it take 5 hours to hook up my printer",
              "score": 0,
              "created_utc": 1747651254.0,
              "replies": [
                {
                  "id": "mt4rmm8",
                  "author": "NVVV1",
                  "body": "Not really talking about Linux on desktop. More so about Linux on servers, phones, embedded systems, routers, switches, smart devices, cars, industrial applications and appliances, and literally everything else under the hood that runs this world that we live in. No version of Windows is even close in this regard and doesn’t support nearly the same number of architectures and platforms. Windows was designed for consumer desktop use and that alone",
                  "score": 1,
                  "created_utc": 1747666932.0,
                  "replies": [
                    {
                      "id": "mt63iat",
                      "author": "Remoteatthebeach",
                      "body": "But games were better on XP",
                      "score": 1,
                      "created_utc": 1747680995.0,
                      "replies": [
                        {
                          "id": "mt6si2z",
                          "author": "Caddy666",
                          "body": "wine runs pretty much all of them.",
                          "score": 1,
                          "created_utc": 1747688458.0,
                          "replies": [
                            {
                              "id": "mt73duk",
                              "author": "Remoteatthebeach",
                              "body": "Insufficient standardization",
                              "score": 1,
                              "created_utc": 1747691899.0,
                              "replies": [
                                {
                                  "id": "mt7y0rg",
                                  "author": "Caddy666",
                                  "body": "of what?\n\n\nhttps://lutris.net/",
                                  "score": 1,
                                  "created_utc": 1747702753.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mt6skq3",
                  "author": "Caddy666",
                  "body": "skill issue.",
                  "score": 1,
                  "created_utc": 1747688480.0,
                  "replies": [
                    {
                      "id": "mt736id",
                      "author": "Remoteatthebeach",
                      "body": "I like not having to develop skills for printer use",
                      "score": 1,
                      "created_utc": 1747691831.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mt19zob",
      "author": "NoCoffee6754",
      "body": "We are the land of “if it’s not broke don’t fix it (bc that will cost money” when nearly every other country is “if it’s not broke let’s keep it that way by upgrading it on a regular basis” \n\nIt’s embarrassing to go to other countries with less wealth who have infinitely better roads, airports, and transit systems than we do. Our country is falling apart and we claim to be “the best” in the world. We are a joke",
      "score": 2,
      "created_utc": 1747610481.0,
      "replies": []
    },
    {
      "id": "mt11b10",
      "author": "tetrahedronss",
      "body": "Lots of arcade machines are running XP.",
      "score": 1,
      "created_utc": 1747607321.0,
      "replies": []
    },
    {
      "id": "mt11m9z",
      "author": "iMogal",
      "body": "And yet I get every new verson shoved up my transistor.",
      "score": 1,
      "created_utc": 1747607431.0,
      "replies": []
    },
    {
      "id": "mt149ym",
      "author": "dakotanorth8",
      "body": "Yeah some stuff is rock solid.",
      "score": 1,
      "created_utc": 1747608394.0,
      "replies": []
    },
    {
      "id": "mt14paj",
      "author": "VarsH6",
      "body": "Oh I’m certain the EHR Meditech runs on DOS. It is ancient and so is the computer screen.\n\nBut I know CPRS is running on something archaic. The VA is truly ancient.",
      "score": 1,
      "created_utc": 1747608548.0,
      "replies": [
        {
          "id": "mt162io",
          "author": "Jim3001",
          "body": "You think the VA is ancient? DFAS runs on Fortran.",
          "score": 2,
          "created_utc": 1747609048.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mt14qoh",
      "author": "ReadingCorrectly",
      "body": "I’m old?",
      "score": 1,
      "created_utc": 1747608562.0,
      "replies": []
    },
    {
      "id": "mt152rf",
      "author": "theoceanmachine",
      "body": "Yup, same with scientific research in labs. For sea floor mapping, we still need to use XP for our programs. Although, I’ve also seen quite a few programs that require a Unix based OS instead.",
      "score": 1,
      "created_utc": 1747608685.0,
      "replies": []
    },
    {
      "id": "mt163aw",
      "author": "Fellwuckly",
      "body": "Power plants as well",
      "score": 1,
      "created_utc": 1747609055.0,
      "replies": []
    },
    {
      "id": "mt17u9g",
      "author": "pnut0027",
      "body": "Oh I know when I’m using them. Laggy, mistouching pieces of junk.",
      "score": 1,
      "created_utc": 1747609695.0,
      "replies": []
    },
    {
      "id": "mt1epf4",
      "author": "alsatian01",
      "body": "GOAT",
      "score": 1,
      "created_utc": 1747612190.0,
      "replies": []
    },
    {
      "id": "mt1ggy9",
      "author": "CMDR_omnicognate",
      "body": "Yeah seems likely. The wannacry randomware absolutely wrecked the NHS here in the UK because most of their equipment still ran on windows XP",
      "score": 1,
      "created_utc": 1747612841.0,
      "replies": []
    },
    {
      "id": "mt1hty0",
      "author": "Apart_Mood_8102",
      "body": "The computers at work still run of Windows 10.",
      "score": 1,
      "created_utc": 1747613347.0,
      "replies": []
    },
    {
      "id": "mt1jldz",
      "author": "Puma_Man_619",
      "body": "Who/what are they running the trains on?",
      "score": 1,
      "created_utc": 1747614006.0,
      "replies": []
    },
    {
      "id": "mt1p67w",
      "author": "WhiteKingBleach",
      "body": "My workplace still uses the Windows Embedded-equivalent of Windows 7 on all but one of its thin clients (which I set up with Ubuntu LTS).",
      "score": 1,
      "created_utc": 1747616107.0,
      "replies": []
    },
    {
      "id": "mt1pwjm",
      "author": "naterzgreen",
      "body": "My old factory used to do all the inventory on an old dust filled windows xp computer 😂took a minute for any click to go through",
      "score": 1,
      "created_utc": 1747616373.0,
      "replies": []
    },
    {
      "id": "mt1q9fc",
      "author": "TimLordOfBiscuits",
      "body": "Lol, well, I'm pretty sure most of the trains in Canada run on some kind of Linux framework.",
      "score": 1,
      "created_utc": 1747616505.0,
      "replies": []
    },
    {
      "id": "mt1qj1a",
      "author": "rquinn12",
      "body": "For a machine not connected to any network, what's the issue?",
      "score": 1,
      "created_utc": 1747616603.0,
      "replies": []
    },
    {
      "id": "mt1qsd4",
      "author": "popohum",
      "body": "Airline employee here. Wait until you learn what some airlines’ entire system runs off of 😂",
      "score": 1,
      "created_utc": 1747616698.0,
      "replies": []
    },
    {
      "id": "mt1uqo7",
      "author": "Zealousideal_Order_8",
      "body": "Many point of sales computers still use legacy Windows OS",
      "score": 1,
      "created_utc": 1747618189.0,
      "replies": []
    },
    {
      "id": "mt21zws",
      "author": "sicurri",
      "body": "Uh... considering windows xp is one of my absolute favorite operating systems, I'd definitely know if I was using it.",
      "score": 1,
      "created_utc": 1747620901.0,
      "replies": []
    },
    {
      "id": "mt226kv",
      "author": "VoidOmatic",
      "body": "Which is why people like me are still needed! I still have all these OS's listed on my resume.",
      "score": 1,
      "created_utc": 1747620970.0,
      "replies": []
    },
    {
      "id": "mt263g9",
      "author": "TraditionalLaw7763",
      "body": "Guys, I’m still running windows vista! Like a champ!",
      "score": 1,
      "created_utc": 1747622491.0,
      "replies": []
    },
    {
      "id": "mt2aflq",
      "author": "sonofgildorluthien",
      "body": "I remember going to a farm around 2003-2004 and he was running his feed system and milking machines as well as tracking herd data on some program in DOS on a Win 3.11 machine.",
      "score": 1,
      "created_utc": 1747624297.0,
      "replies": []
    },
    {
      "id": "mt2bauo",
      "author": "Remote_Cantaloupe",
      "body": "Windows XP has always been the best version of the OS.",
      "score": 1,
      "created_utc": 1747624679.0,
      "replies": []
    },
    {
      "id": "mt2g4xm",
      "author": "InteractiveSeal",
      "body": "What until you all find out what’s running your electrical grid, dmv, airlines, and missile systems lol",
      "score": 1,
      "created_utc": 1747626866.0,
      "replies": []
    },
    {
      "id": "mt2n3ou",
      "author": "ffsinffl",
      "body": "I said exactly this to a customer support rep at a company a few days ago in reference to their website’s payment processing functionality. Except I told them that it looked like it had been built using Windows 95. Which it does.",
      "score": 1,
      "created_utc": 1747630314.0,
      "replies": []
    },
    {
      "id": "mt2n5xx",
      "author": "None",
      "body": "Yep, military uses it since it’s encrypted. Used for predator drones I believe.",
      "score": 1,
      "created_utc": 1747630346.0,
      "replies": []
    },
    {
      "id": "mt2ruug",
      "author": "sbkg0002",
      "body": "Trains in The Netherlands run Kubernetes 🙂",
      "score": 1,
      "created_utc": 1747632868.0,
      "replies": []
    },
    {
      "id": "mt2v096",
      "author": "Elike09",
      "body": "Costco was still using dos until last year.",
      "score": 1,
      "created_utc": 1747634646.0,
      "replies": []
    },
    {
      "id": "mt30337",
      "author": "Agi7890",
      "body": "I worked in a lab where they were still running windows 3.1.",
      "score": 1,
      "created_utc": 1747637648.0,
      "replies": []
    },
    {
      "id": "mt30kch",
      "author": "darxide23",
      "body": "I used XP for the better part of a decade and by my own free will. So the fuck what?",
      "score": 1,
      "created_utc": 1747637934.0,
      "replies": []
    },
    {
      "id": "mt32nvb",
      "author": "Supersaiyans2022",
      "body": "Companies can also spin up Windows XP VMs in Azure. Not a big deal.",
      "score": 1,
      "created_utc": 1747639227.0,
      "replies": []
    },
    {
      "id": "mt356db",
      "author": "Burningman316",
      "body": "I use Windows 7 every day, works fine for the daily work I need to do in the office.",
      "score": 1,
      "created_utc": 1747640815.0,
      "replies": []
    },
    {
      "id": "mt37dhg",
      "author": "badula-yama-yama",
      "body": "Xp MEH give me NT ",
      "score": 1,
      "created_utc": 1747642209.0,
      "replies": []
    },
    {
      "id": "mt3ce77",
      "author": "Reddit_Devil666",
      "body": "My brother worked in an envelope warehouse recently that still uses Windows 98 🤣",
      "score": 1,
      "created_utc": 1747645444.0,
      "replies": []
    },
    {
      "id": "mt3ekma",
      "author": "Apart-Run5933",
      "body": "Xp is like your skeleton, it’s probably inside you RIGHT NOW",
      "score": 1,
      "created_utc": 1747646839.0,
      "replies": []
    },
    {
      "id": "mt3fvm8",
      "author": "PauloHeaven",
      "body": "And ATMs.",
      "score": 1,
      "created_utc": 1747647657.0,
      "replies": []
    },
    {
      "id": "mt3gqet",
      "author": "NamelessZ3RO",
      "body": "CNC Machines usually use even older windows versions",
      "score": 1,
      "created_utc": 1747648177.0,
      "replies": []
    },
    {
      "id": "mt3ickg",
      "author": "Dragoon_Raine",
      "body": "it was a damn shame having to let go of XP. Same with 7. 11 wont be missed though, too many headaches.",
      "score": 1,
      "created_utc": 1747649136.0,
      "replies": []
    },
    {
      "id": "mt3iv3g",
      "author": "aLittleDarkOne",
      "body": "My planetarium is still running windows 95 on their interactive gaming center",
      "score": 1,
      "created_utc": 1747649434.0,
      "replies": []
    },
    {
      "id": "mt3mebp",
      "author": "Logical_Willow",
      "body": "I worked for a decently large retail chain that used a dos based system until quite recently and “upgraded” to a win95 style system around 2010.",
      "score": 1,
      "created_utc": 1747651398.0,
      "replies": []
    },
    {
      "id": "mt3mqzk",
      "author": "jacobpederson",
      "body": "Marine fuel pumping station is that you?",
      "score": 1,
      "created_utc": 1747651581.0,
      "replies": []
    },
    {
      "id": "mt3n7kn",
      "author": "why_am_I_here_Trump",
      "body": "Years ago, the company I work for switched to Linux from Windows XP.",
      "score": 1,
      "created_utc": 1747651818.0,
      "replies": []
    },
    {
      "id": "mt3nmnx",
      "author": "cheflA1",
      "body": "The old tale of IT vs OT",
      "score": 1,
      "created_utc": 1747652031.0,
      "replies": []
    },
    {
      "id": "mt3pin1",
      "author": "TheAffinityBridge",
      "body": "I am sitting in front of an XP machine waiting for some software to install as I read this thread. It’s an embedded PC in an old bit of kit that is end of life and not possible to update to a newer OS without breaking it. I run into it quite often, sometimes I even see the generation of systems before this that are still clinging onto life running Windows 2K. It’s often the case that a company invested heavily in expensive equipment a few years ago and it still does the job for them.",
      "score": 1,
      "created_utc": 1747652964.0,
      "replies": []
    },
    {
      "id": "mt3ppy0",
      "author": "-DethLok-",
      "body": "Without knowing? Uh, no.... I deliberately bought it and installed it and the install disk is within 2 metres of me, probably on the shelf to my left - it's been a while since I've bothered to look at what's there.\n\nThe Win 95 3.5\" install floppies are on my right. I mean to frame them one day, will also frame my 3Dfx Voodoo card and put them up on the wall next to each other.",
      "score": 1,
      "created_utc": 1747653063.0,
      "replies": []
    },
    {
      "id": "mt3w490",
      "author": "ChipChester",
      "body": "In my business the primary computer is running a 1992 DOS program. The computer itself is from 2017, an industrial single-board computer using a DOS that is USB-aware for storage and keyboards. I stick with that program because it works, and I know it well. Only potential 'gotcha', which is a big one, is that it requires a parallel port security dongle that, so far, no dongle crew knows how to bypass.\n\nMy software license agreement grants me source code access upon the original (now long-gone) company's demise. Of course, they 'couldn't find it' upon their closing up shop, as they had migrated to Windows. But the Windows program doesn't do all that the DOS one does.  Anyone know Pascal?\n\nAnother video interface device I use is an XP computer with DSP cards. It's running the version used in point-of-sale computers, so it got updates for a while after standard XP left the chat.\n\nBoth of the above devices are never connected to the Internet, or even to a network. And all their USB file transfers are from well-protected Mac computers. Good so far...",
      "score": 1,
      "created_utc": 1747655963.0,
      "replies": []
    },
    {
      "id": "mt3we9j",
      "author": "FloydJam",
      "body": "Who's without knowing it? You?",
      "score": 1,
      "created_utc": 1747656083.0,
      "replies": []
    },
    {
      "id": "mt3x6c5",
      "author": "STierMansierre",
      "body": "Furry nation, how do you feel about this?",
      "score": 1,
      "created_utc": 1747656418.0,
      "replies": []
    },
    {
      "id": "mt3yekc",
      "author": "this-aint-Lisp",
      "body": "Windows XP could actually run without blue screening every other day, unlike my Windows 11, and without automatically rebooting for installing pointless updates.",
      "score": 1,
      "created_utc": 1747656931.0,
      "replies": []
    },
    {
      "id": "mt3yn34",
      "author": "Spazthing",
      "body": "Any COBOL programmers care to weigh in?",
      "score": 1,
      "created_utc": 1747657030.0,
      "replies": []
    },
    {
      "id": "mt3z137",
      "author": "miurabucho",
      "body": "I work for a National TV station and we are currently using this for a part of our graphics department.",
      "score": 1,
      "created_utc": 1747657190.0,
      "replies": []
    },
    {
      "id": "mt41hzl",
      "author": "thefiglord",
      "body": "back then - windows was trying to compete against linux and or posix as these machines dont need to email word etc - so they just sit there",
      "score": 1,
      "created_utc": 1747658175.0,
      "replies": []
    },
    {
      "id": "mt41vjt",
      "author": "Bikrdude",
      "body": "They work just a well as when they were released. If their function meets specs it’s fine.",
      "score": 1,
      "created_utc": 1747658321.0,
      "replies": []
    },
    {
      "id": "mt42v1l",
      "author": "GowWowGoliath",
      "body": "It’s the Reddit of operating systems. Even XP stands for xtra penis like most of the abominations that pass as women on this app.",
      "score": 1,
      "created_utc": 1747658696.0,
      "replies": []
    },
    {
      "id": "mt44mcu",
      "author": "Potential-Place7524",
      "body": "We use an XP machine where I work for large volume tank level measurement devices. The machine does not perform any control or safety functions but only our ability to configure and make changes to settings in the measurement device itself. \n\nApparently no one felt the need to update this very niche software to future OS.",
      "score": 1,
      "created_utc": 1747659357.0,
      "replies": []
    },
    {
      "id": "mt44yc9",
      "author": "Trance354",
      "body": "Damn, im old. \n\nWin95\n\nI know what cobol is, and have programmed in it.",
      "score": 1,
      "created_utc": 1747659480.0,
      "replies": []
    },
    {
      "id": "mt46ncw",
      "author": "wrightthomas05",
      "body": "My partner's laptop is still on 7.",
      "score": 1,
      "created_utc": 1747660109.0,
      "replies": []
    },
    {
      "id": "mt483b4",
      "author": "Owenarthur1",
      "body": "That’s what the 911 system in the province where I live runs off of, little bit of a shock seeing that the first time",
      "score": 1,
      "created_utc": 1747660632.0,
      "replies": []
    },
    {
      "id": "mt49ib2",
      "author": "TeaAndLifting",
      "body": "If you’ve ever used a self checkout machine in the UK, I’ve seen them running XP when they’ve crashed out",
      "score": 1,
      "created_utc": 1747661135.0,
      "replies": []
    },
    {
      "id": "mt4pm45",
      "author": "groenteman",
      "body": "I still have a old PC with windows xp, i use it to play old outdated games i can't seem to get working on windows 10",
      "score": 1,
      "created_utc": 1747666326.0,
      "replies": []
    },
    {
      "id": "mt4z0qb",
      "author": "nariofthewind",
      "body": "I’ve seen an ATM once opened and the service man was operating on the computer inside windows XP, lol",
      "score": 1,
      "created_utc": 1747669168.0,
      "replies": []
    },
    {
      "id": "mt57x50",
      "author": "gotothepark",
      "body": "And yet we’re supposed to be worried about AI taking all jobs?",
      "score": 1,
      "created_utc": 1747671814.0,
      "replies": []
    },
    {
      "id": "mt5lzwo",
      "author": "sissysera42",
      "body": "Ram the civilian air traffic control systems until the mid 2010s. Still running the AF air traffic control comm systems. If it ain’t broke, don’t fix it. When I was in, circa 2016, we were still using it with a NAVAID system, having to backdoor into our license expired version of XP via the accessibility mode to run diagnostics.",
      "score": 1,
      "created_utc": 1747675912.0,
      "replies": []
    },
    {
      "id": "mt5sr5w",
      "author": "Common-Ad6470",
      "body": "Heads up the original DOS with 5.25” paper floppies is running the US nuke missile system…🤫",
      "score": 1,
      "created_utc": 1747677840.0,
      "replies": []
    },
    {
      "id": "mt5uiax",
      "author": "madmanx33",
      "body": "I saw something interesting at Disneyland one time. Their computer was logged into a Windows XP VMware  virtual machine and that is what controlled the ride.",
      "score": 1,
      "created_utc": 1747678351.0,
      "replies": []
    },
    {
      "id": "mt606sh",
      "author": "i-sleep-well",
      "body": "I was still installing machines with embedded OS/2 Warp in them, early to mid 2000s, so this is totally believable.",
      "score": 1,
      "created_utc": 1747680024.0,
      "replies": []
    },
    {
      "id": "mt66t7k",
      "author": "Blackdoomax",
      "body": "I'm on Windows 7.",
      "score": 1,
      "created_utc": 1747681986.0,
      "replies": []
    },
    {
      "id": "mt6hwi2",
      "author": "m13s13s",
      "body": "VMS entered the chat.",
      "score": 1,
      "created_utc": 1747685330.0,
      "replies": []
    },
    {
      "id": "mt6k07c",
      "author": "Stilgrave",
      "body": "Costco is still running Windows NT on AS400 IBMs. Fun",
      "score": 1,
      "created_utc": 1747685958.0,
      "replies": []
    },
    {
      "id": "mt6mxt5",
      "author": "MouthfulOfWasps",
      "body": "I work in print and it's amazing the amount of companies that ask me to install print queues on old dusty Windows XP machines. They're usually running some old software thats pivotal for that company to run and I'm not sure they ever wonder what would happen if it died one day. I've also worryingly seen bank ATM's with windows XP error screens recently.",
      "score": 1,
      "created_utc": 1747686827.0,
      "replies": []
    },
    {
      "id": "mt70km3",
      "author": "NebulousNitrate",
      "body": "Back when I was on the Windows team, we had to continue to provide updates for Windows 2000 because a well known automaker still used it extensively across their factory. This was not that many years ago.",
      "score": 1,
      "created_utc": 1747690983.0,
      "replies": [
        {
          "id": "mt8ppbp",
          "author": "BendersCasino",
          "body": "Windows 2000 is nothing. We have a computer running 95 for dedicated software/test equipment. It's not on any network, though.\n\n Hell, We are using fortran77 programs still today... we are in panic mode to get them updated before the older guys retire, and we are screwed.",
          "score": 1,
          "created_utc": 1747713857.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mt7pv2e",
      "author": "New-Suit5141",
      "body": "Before fear mongers consume the comments, consumer versions are different from POS 2009 or LTSC versions",
      "score": 1,
      "created_utc": 1747699741.0,
      "replies": []
    },
    {
      "id": "mt80t6t",
      "author": "Bezos_Balls",
      "body": "At this point I feel like you could just drop the VM files into GPT and ask it to rewrite the code to run on W11",
      "score": 1,
      "created_utc": 1747703788.0,
      "replies": []
    },
    {
      "id": "mt8je61",
      "author": "BigFitMama",
      "body": "I know at least one red state was running MSDOS for all its social service funds transactions. It was on a XP emulator till 2013 then we jumped to Windows 7 with the emulator. 2020 rolls around and they and pay card company for UE, Snap, and benefits gets badly hacked by scammers.\n\nI'm pretty sure they paid for an upgrade then with pandemic funds or software that pulls from MSDOS?\n\nCurrently SNAP funds are still getting stolen USA wide due to things like this and third party apps that gets promoted in search results before the state card ap. \n\nThing is everyone is saying it's an inside job between skimmers on site, scammers and people on the inside exploiting old databases",
      "score": 1,
      "created_utc": 1747711030.0,
      "replies": []
    },
    {
      "id": "mt9n4g0",
      "author": "DrVagax",
      "body": "Been said a ton of times but if its offline/airgapped there is no need. Yes one tiny virus can cripple the entire systems, there are demo sites where you can download different types of virusses to play around with in a sandbox with explanation how they work and a few are on such levels it is impossible for anti virusses to capture them",
      "score": 1,
      "created_utc": 1747733086.0,
      "replies": []
    },
    {
      "id": "mt9wfln",
      "author": "kank84",
      "body": "I know of a multi national insurance company that still used an AS/400 system to manage their claims until earlier this year. I think the inability to hire IT people who know how to work with it is what finally convinced them to upgrade.",
      "score": 1,
      "created_utc": 1747738373.0,
      "replies": []
    },
    {
      "id": "mtag50y",
      "author": "ButterKnights2",
      "body": "Given that it is no longer supported and the source code has been leaked. I see this being America's biggest security risk.",
      "score": 1,
      "created_utc": 1747746579.0,
      "replies": []
    },
    {
      "id": "mtf3bbd",
      "author": "goldaxis",
      "body": "Operating systems that don't waste resources spying on you are surprisingly useful.",
      "score": 1,
      "created_utc": 1747800440.0,
      "replies": []
    },
    {
      "id": "mtjlmpd",
      "author": "hansonhols",
      "body": "The company i work for has around 1600 jukeboxes out in the field still running XP Embedded.\n\nWe're trying to phase them out for newer Win10 machines but many pubs and bars don't want to upgrade because thier XP machine still works fine. Many still connect to our servers for music updates.\n\nEventually we'll have to pull the plug, we had already seen some contactless payment vendors won't allow our NT based machines to share the network, we have to switch them to offline mode with manual USB music updates. XP uses SMB1 and doesn't play well with newer SMB2 capable devices.\n\nEdited to add, we use Win10 Enterprise LTSC on our current production Jukes, Microsoft will support until Jan 12th 2027.",
      "score": 1,
      "created_utc": 1747861815.0,
      "replies": []
    },
    {
      "id": "mtzwklq",
      "author": "kevin7eos",
      "body": "I’m in a lot of hospitals as my job as a legal investigator for Law Firm. A few months ago they were rebooting a diagnostic machine in a client‘s room.  in the splash screen was the windows 2000 logo. Good grief.",
      "score": 1,
      "created_utc": 1748088997.0,
      "replies": []
    },
    {
      "id": "mu1cnuj",
      "author": "None",
      "body": "Best OS Win XP, Win7, Win10 in that order",
      "score": 1,
      "created_utc": 1748106632.0,
      "replies": []
    },
    {
      "id": "mt13o3i",
      "author": "Majorjim_ksp",
      "body": "And this is why it’s so easy to hack most of the UKs public infrastructure….",
      "score": 1,
      "created_utc": 1747608172.0,
      "replies": []
    },
    {
      "id": "mt19nyp",
      "author": "InternationalDisk698",
      "body": "So what?\n\n\nIf it works it works.",
      "score": 1,
      "created_utc": 1747610362.0,
      "replies": []
    },
    {
      "id": "mt19wps",
      "author": "PariahSh",
      "body": "If it ain’t broke honestly",
      "score": 1,
      "created_utc": 1747610451.0,
      "replies": []
    },
    {
      "id": "mt2avnl",
      "author": "findingmike",
      "body": "Too bad they didn't go down the Linux path. Easy upgrades nowadays.",
      "score": 1,
      "created_utc": 1747624491.0,
      "replies": []
    },
    {
      "id": "mt2svy8",
      "author": "ToMorrowsEnd",
      "body": "TLDR companies and management of these places are cheap bastards and not updating shit when it should have and now they all have to pay the Technical Debt monster due to being mis-managed.  there is a reason why you migrate to new when your vendor goes out of business or ends support. it would have been cheaper back when it happened.  Now it's not.\n\nThat said, my wife makes a killing with this stuff.  She is one of the few people around that can do OS200 (OS/400) administration and a lot of businesses are still running AS200 (AS/400) miniframes.   they ask for help and she shoots back with. a $150 an hour rate.   they freak at that and within 2 weeks come crawling back as they can not find anyone else.  she works maybe 2 weeks a month pretty regularly and brings home a lot more than I do.  And she is thinking of raising her rates.\n\nEdit dont post on reddit groggy as hell in the middle of the night.",
      "score": 1,
      "created_utc": 1747633442.0,
      "replies": [
        {
          "id": "mt3frvh",
          "author": "Gecko99",
          "body": "What are OS200 and AS200? I'm getting varying results when searching, ranging from cloud services to truck hitches.",
          "score": 1,
          "created_utc": 1747647592.0,
          "replies": [
            {
              "id": "mt3j76y",
              "author": "ToMorrowsEnd",
              "body": "put IBM in front of that.  looks at post.  That will teach me to reply at 2am.   IBM AS/400  https://en.wikipedia.org/wiki/IBM_AS/400\n\nI'm an idiot for getting that wrong. she is going to mock me all day long for that.",
              "score": 1,
              "created_utc": 1747649627.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mt1lrxg",
      "author": "P0pu1arBr0ws3r",
      "body": "But fundamentally, why? Why haven't these systems updated? Why aren't they running a Unix based OS like BSD based (older or about as old as windows) or Linux (which was fairly new around 98/xp)?\n\nThere are many known vulnerabilities to old versions of windows and potential for more still up to win7 or even 8 at this point. However windows is known for excellent backwards compatibility. Why haven't companies invested in the resources to update these systems? A lot of them are running 24/7 but how many have actually been running nonstop for 20 years, without any power outage or downtime for maintnence?\n\nAt some point the computer hardware is going to die before the programs do, so why not update the OS as you replace the hardware?\n\nThe issue I see with these ancient systems is theyre all built around proprietary corporate structures. As a result, once the company said good enough, the contractor who set up thr software moved on, leaving no instructions on how to upgrade once things fail. Fast forward 20 years, now that software is the only thing keeping the system alive, with various tricks to fix whatever faults come up, ending up costing a lot to maintain thr system when at some point it must be cheaper to just redo it (at least in theory). But then its working with ancient hardware thats no longer compatible with modern hardware, not because its old but because its proprietary, closed source.\n\n\nOne example can be a train scheduling system- flipping track switches digitally to control the flows of trains, get them to leave on time, etc. I'm pretty sure theres transport tycoon games out that have turned that job into a game, which can run automated on a raspberry pi. A raspi (or if needed a larger dev board) can easily be adapted with some circuitry to work with any hardware interface, and running linux on an SD card or m.2 device, it can easily be swapped out for newer models over time. It can run an embedded version of linux to ensure constant uptime. It just needs someone to integrate the new hardware with the old, non replaceable one (in this case the signaling wire for the train tracks)- a step requiring companies to hire contractors for, and I dont think theyre willing to do that, probably not making enough income to pay contractors to replace the old system thats likely costing them to run.\n\nNow step back 20 years and assume thr company behind making the signaling system wanted their software to be essentially open source or open documentation. Now, over time, a community of developers who enjoy trains or signaling systems or what not can be fascinated by this old software, using it for their own model sets _and iterating off of it_. Over time when the old in production system starts to fail, now the company can hire a contractor, but at a cheaper rate because the contractor wouldnt have to start from scratch making the updated software.",
      "score": 0,
      "created_utc": 1747614829.0,
      "replies": [
        {
          "id": "mt1z4m7",
          "author": "Tiny_Cheetah_4231",
          "body": "> There are many known vulnerabilities to old versions of windows and potential for more still up to win7 or even 8 at this point. \n\nThere are many known vulnerabilities to old versions of linux and potential for more still up to lin5 or even 6 at this point.",
          "score": 2,
          "created_utc": 1747619850.0,
          "replies": [
            {
              "id": "mt1zcxc",
              "author": "P0pu1arBr0ws3r",
              "body": "And how many systems in the world run an outdated version of linux?",
              "score": 2,
              "created_utc": 1747619932.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt47v07",
          "author": "Jaxager",
          "body": "I used to work at the Jeep plant in Toledo. One of my jobs was maintaining test equipment used to test the electrical system in the vehicle as it goes down the line. One of the reasons they had us using Windows on our test equipment is because a big wig said he wanted our test equipment to be able to connect to the network. So, some people that make decisions about these things are fucking idiots.",
          "score": 2,
          "created_utc": 1747660549.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mt3bpzo",
      "author": "TooManySteves2",
      "body": "\"Decades old\" ...shows XP.",
      "score": 0,
      "created_utc": 1747645016.0,
      "replies": []
    },
    {
      "id": "mt1mhcs",
      "author": "JeNn_DeViLz",
      "body": "I never got more virus or malware than windows xp. What a “Gem”!",
      "score": -1,
      "created_utc": 1747615097.0,
      "replies": [
        {
          "id": "mt208q7",
          "author": "Coolbiker32",
          "body": "I have been dealing with xp and 7 for a long time. In my opinion they were good but security was shoddy. A properly hardened and secure (port blocked) win 7 machine is fast and reliable.",
          "score": 2,
          "created_utc": 1747620253.0,
          "replies": [
            {
              "id": "mt3w652",
              "author": "JeNn_DeViLz",
              "body": "When it worked it worked! When it didn’t man was I always in safe mode hahaha",
              "score": 1,
              "created_utc": 1747655985.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}