{
  "post": {
    "title": "USB 2.0 is 25 years old today — the interface standard that changed the world | USB 2.0 was the game-changer we needed to revolutionize data transfer between devices.",
    "author": "chrisdh79",
    "id": "1k95429",
    "score": 4211,
    "created_utc": 1745763809.0,
    "selftext": "",
    "num_comments": 345,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1k95429/usb_20_is_25_years_old_today_the_interface/"
  },
  "comments": [
    {
      "id": "mpbi0ax",
      "author": "jer007",
      "body": "I remember when USB 2.0 was released. It was mind blowing how fast it was. Today it’s a joke but was truly revelatory for its time.",
      "score": 449,
      "created_utc": 1745764820.0,
      "replies": [
        {
          "id": "mpbmabl",
          "author": "RaymondBeaumont",
          "body": "I had a USB 1 cable that could move files between computers. \n\nIt was amazing in 2001. We just had to make a night out of it when moving one album of mp3s between computers.",
          "score": 179,
          "created_utc": 1745766182.0,
          "replies": [
            {
              "id": "mpbwrq2",
              "author": "Hansmolemon",
              "body": "I remember starting to rip my cd collection to mp3 : copy single track to an external Zip disk, fire up mpecker encoder, have dinner, go to bed, wake up in the morning and start on track 2.",
              "score": 77,
              "created_utc": 1745769443.0,
              "replies": [
                {
                  "id": "mpczxgn",
                  "author": "yogopig",
                  "body": "What’s crazy is that I genuinely can’t tell if this is satire",
                  "score": 36,
                  "created_utc": 1745781398.0,
                  "replies": [
                    {
                      "id": "mpdmgf1",
                      "author": "jc-from-sin",
                      "body": "Fake. I had a zip drive as well, using a parallel port, which is much slower than usb. It would take a few minutes to an hour to write a 100mb disk.",
                      "score": 45,
                      "created_utc": 1745788366.0,
                      "replies": [
                        {
                          "id": "mpe1tli",
                          "author": "Hansmolemon",
                          "body": "Wasn’t the writing that took that long, it was the encoding and constantly having to swap memory to a RAM disk. Depending on the length of the song it took 3-7 hours.",
                          "score": 13,
                          "created_utc": 1745793393.0,
                          "replies": [
                            {
                              "id": "mpe71ir",
                              "author": "PMmeYourDunes",
                              "body": "But you could have downloaded the song off Napster and it would already have been encoded as an mp3 in significantly less time, if your memory of time is accurate. Lol. Maybe your computer labored a lot harder encoding, but it didn't take particularly long in my experience.\n\nMan I remember pre-napster days downloading literal pieces of mp3s and stitching them together with a tool. That was fucking crazy and so painfully time consuming. I also remember VoIP phone calling friends across the country when long distance rates threatened anyone who didn't phreak. It was like being a digital wizard.",
                              "score": 6,
                              "created_utc": 1745795155.0,
                              "replies": [
                                {
                                  "id": "mpe8tm9",
                                  "author": "Hansmolemon",
                                  "body": "Napster came about 2 years later. And it was faster, but still got a lot of partial or corrupted files. I was living in a pretty rural area at the time and the phone line quality was crap so I got a lot of dropped connections and could rarely negotiate a connection faster than 14.4k",
                                  "score": 10,
                                  "created_utc": 1745795777.0,
                                  "replies": [
                                    {
                                      "id": "mpef468",
                                      "author": "PMmeYourDunes",
                                      "body": "That's fair, I read later what you were working with and saw the timeline. It was definitely more rudimentary pre-napster. Getting a CD burner in 2000 was a game changer.",
                                      "score": 1,
                                      "created_utc": 1745797984.0,
                                      "replies": [
                                        {
                                          "id": "mpekb01",
                                          "author": "Hansmolemon",
                                          "body": "At that point it was really more of a novelty than anything else. Cheap/free encoders had just become a thing, previously it was expensive commercial software with little consumer use. I think I had like a 1 or 1.5 gig hard drive with about a hundred megs of free space. Mostly used it for photoshop, dreamweaver and pagemaker so most of the space was taken up with image files so even as mp3s I couldn’t store unlimited albums and there weren’t any portable players. It really did not offer any significant advantages over just playing cds on your computer. I will say that I still miss soundjam, to this day my favorite music player.",
                                          "score": 1,
                                          "created_utc": 1745799877.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mpjfbt1",
                              "author": "AnonymousMonk7",
                              "body": "Had a middle of the road Mac at the time, barely took longer than normal playback to encode. 1 hour album would take maybe 1:15 minutes.",
                              "score": 1,
                              "created_utc": 1745870307.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mpee0ap",
                          "author": "im_thatoneguy",
                          "body": "An mp3 was like 2-3MB back then.\n\nA 100MB Zip disk could hold 33 MP3s\n\nIf it took an hour to write a Zip disk then it would take 2 minutes to transfer a song, not 8 hours overnight.",
                          "score": 3,
                          "created_utc": 1745797596.0,
                          "replies": [
                            {
                              "id": "mpf62jz",
                              "author": "troyunrau",
                              "body": "The encoder took that long.",
                              "score": 1,
                              "created_utc": 1745808024.0,
                              "replies": [
                                {
                                  "id": "mpfg7rw",
                                  "author": "im_thatoneguy",
                                  "body": "Maybe on a 10 year old 286. But on a slightly modern 2001 era PC or even 1995 era PC it could just about encode in realtime.",
                                  "score": 3,
                                  "created_utc": 1745812273.0,
                                  "replies": [
                                    {
                                      "id": "mph2gxt",
                                      "author": "troyunrau",
                                      "body": "I had a Pentium 100 and it would take more than an hour to encode a four minute song on it. I basically didn't even bother on the 486. \n\nIt wasn't just the CPU time, it was also the encoders. If you take modern encoders and run them on old hardware, they are faster. But that is because the code in the encoders got faster.\n\nE: just had a random memory of overclocking my 486DX 33 with the motherboard jumpers just to get it to be able to decode an MP3 with a slightly higher bitrate without stuttering in real time. Decode!",
                                      "score": 1,
                                      "created_utc": 1745844144.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mpfhoar",
                              "author": "Hansmolemon",
                              "body": "Wasn’t copying mp3s to the Zip disk, was copying and converting tracks as uncompressed .aiff files (which took a while on its own) that ran about 30-50mb at 16 bit. Most songs at 24 bit wouldn’t even fit on a Zip disk. So you are dealing with a 40ish mb file that’s on an external drive while having to use part of the actual hard drive as a ram/swap disk because the computer only has 16mb of memory. Once the software was able to convert files directly from cds it sped up the process quite a bit but the process was still significantly slower than the cds read speed.",
                              "score": -1,
                              "created_utc": 1745812936.0,
                              "replies": [
                                {
                                  "id": "mpfpt6q",
                                  "author": "im_thatoneguy",
                                  "body": "You didn’t have 50MB of hard drive space free on a 1GB+ HDD?",
                                  "score": 1,
                                  "created_utc": 1745816913.0,
                                  "replies": [
                                    {
                                      "id": "mpfsfwe",
                                      "author": "Hansmolemon",
                                      "body": "Had about 100mb free because I did a lot of work on uncompressed image files with photoshop - hence why I also had a Zip disk. Ripping mp3s was a novelty thing. Either way the transferring to the Zip disk wasn’t the bottleneck in this process. The read/encode to .aiff took longer than copying to the zip disk which I ran on scsi rather than parallel. Not really sure what’s so hard to understand.",
                                      "score": 0,
                                      "created_utc": 1745818292.0,
                                      "replies": [
                                        {
                                          "id": "mpft1vx",
                                          "author": "im_thatoneguy",
                                          "body": "I guess I’m mostly struggling to understand where in 2001 USB 2.0 being faster than USB 1.0 fits into your situation.\n\nLike is this a random anecdote from 1995 about the limitations of the early PowerPc platform and experimental software running terribly slow on it?",
                                          "score": 1,
                                          "created_utc": 1745818628.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mpdo419",
                      "author": "Hansmolemon",
                      "body": "Not satire, this was on a Motorola starmax Mac clone with a 603e processor and if I remember correctly 16 megs (not gigs) of ram. There wasn’t enough space on the hard drive to copy the audio file and have space for a swap drive, which was necessary since it couldn’t hold the audio file all in ram to process it and it couldn’t rip directly from the audio disk. This was roundabouts 1997 and that was actually a pretty decent rig for the time. Though what I really wanted back then was a Mac 9600 with dual 604e processors and an ati rage 128 video card but that would have cost more than my car at the time.",
                      "score": 3,
                      "created_utc": 1745788898.0,
                      "replies": [
                        {
                          "id": "mpe6p7h",
                          "author": "baselinegrid",
                          "body": "This is absolutely plausible and damn you were committed to the plan",
                          "score": 1,
                          "created_utc": 1745795036.0,
                          "replies": []
                        },
                        {
                          "id": "mpeowp6",
                          "author": "cntmpltvno",
                          "body": "People talk today about how much you used to be able to do on a computer unrestricted, but what they always seem to fail to remember is that you basically had to beat these machines into submission because of their hardware restrictions",
                          "score": 1,
                          "created_utc": 1745801573.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpd2tji",
              "author": "retainftw",
              "body": "Yes! Still have mine somewhere. Needed special drivers to be loaded because nothing was universal.",
              "score": 8,
              "created_utc": 1745782315.0,
              "replies": [
                {
                  "id": "mpd4gbv",
                  "author": "RaymondBeaumont",
                  "body": "oh god yes. and the drivers were on the small cds that were created to go missing.",
                  "score": 15,
                  "created_utc": 1745782831.0,
                  "replies": [
                    {
                      "id": "mpdb0zf",
                      "author": "retainftw",
                      "body": "Yes! I swear mine were supplied on a 3.5 floppy!",
                      "score": 2,
                      "created_utc": 1745784867.0,
                      "replies": [
                        {
                          "id": "mpdc9z0",
                          "author": "RaymondBeaumont",
                          "body": "people complain about \"windows always updating at the worst time\" shit but fail to realize the hell hole that was computing before windows just kind of updated 99% of drivers.\n\noh, you just formatted your computer and want to use your scanner? sure you have your epson floppy disk but... do you have the driver for the scussi port you had to buy?\n\ninstall driver. error can't find d:\\\\winsetup\\\\drivers\\\\scsi\\\\win95\\\\\n\nwhat of these 83 scsi units are you using? remember, only the correct drive will work.\n\nalso, none of them will work because you bought a cheap scsi port and the only driver that works with it was programmed by hand on paper by a tibetan monk.\n\nthere is no such place as the internet yet, btw.\n\nalso, if you have the internet, good luck finding that driver on some random usenet forum!",
                          "score": 16,
                          "created_utc": 1745785250.0,
                          "replies": [
                            {
                              "id": "mpejuuf",
                              "author": "MithandirsGhost",
                              "body": "Then came driverguide (dot) com.  They made you sign up to download  drivers but gave everyone the same login.  Username: drivers Password: all.",
                              "score": 5,
                              "created_utc": 1745799715.0,
                              "replies": []
                            },
                            {
                              "id": "mpfkwt0",
                              "author": "CO_PC_Parts",
                              "body": "I formatted my computer so much back in the day when it was on NT,  98, 98 SE, ME and then much less on win 2000 that I built special driver CD for my current hardware.  Someone shared a program with me that would auto run a GUI and you selected which device to reinstall, it was truly way ahead of it's time.  I'd update and make a new one everytime I got new hardware.   \n\nThen with XP I had some random CD that had like 200,000 drivers on it, it was easier to keep around but every once in a while it'd install the wrong driver then you'd run into headaches.",
                              "score": 1,
                              "created_utc": 1745814449.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpec6zt",
              "author": "NeuHundred",
              "body": "I have a certain nostalgia for the era where computer functions took time.  I would sit in my dad's office for hours, loading programs from disk drives when we got a new computer, reading or watching TV between swaps and restarting.\n\nNeeding to watch the clock to sign off before spending too much time online, downloading the files/pages you want to read and maybe even printing them out b/c others needed to use the computer too.",
              "score": 9,
              "created_utc": 1745796958.0,
              "replies": [
                {
                  "id": "mpeckwp",
                  "author": "RaymondBeaumont",
                  "body": "putting your mouse over the place the setup/download bar was and then waiting to see if it was actually progressing or if it was stuck.",
                  "score": 14,
                  "created_utc": 1745797095.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mpdblw4",
              "author": "im_thatoneguy",
              "body": "Wut? That’s total nonsense. In 2001 I had SD card based mp3 players.\n\nUSB 1.0 was at worst 100KB/s. An MP3 was usually around 3,000KB. That would be like 30s per Mp3. An album would take at most 5 minutes or so to write.",
              "score": 6,
              "created_utc": 1745785044.0,
              "replies": [
                {
                  "id": "mpddko8",
                  "author": "RaymondBeaumont",
                  "body": "i shall invent a time machine and explain that to me who was actually using the device in question that it's much faster than what the passing of time is telling me.",
                  "score": 3,
                  "created_utc": 1745785648.0,
                  "replies": [
                    {
                      "id": "mpe77fn",
                      "author": "im_thatoneguy",
                      "body": "“Moving mp3s between computers” implies you weren’t using USB you were networking so that’s already suspect that something weird was happening. \n\nSo maybe you were using a 1KB/s Ethernet cable even though 10,000KB/s networking was pretty standard by that point. But the bottleneck would be the network connection not USB1. In 2001 we would have LAN parties and grab dozens of albums at a time.\n\nAlso moving a single album was less common in 2001 than grabbing an entire aformentioned mp3 collection. That’s the beginning of the first iPod era so taking hours to move a single album would be crazy when mp3 players  could hold 1,000 songs. That’s would take days to fill.\n\nI don’t know what you were doing in 2001 that was so slow but that was a “U” problem, not a U-S-B problem\n\nEdit: also a quick search doesn’t turn up any weird non standard ultra slow USB 1.0 network adapters which makes sense because why on earth would a business deploy some bizzaro token ring network or something when you could get 10/100 Ethernet usb adapters.",
                      "score": -1,
                      "created_utc": 1745795212.0,
                      "replies": [
                        {
                          "id": "mpe8kir",
                          "author": "RaymondBeaumont",
                          "body": "i was using a usb data transfer cable. it was, and still is, an alternative to networking.\n\nit would have taken you way less time to use google to find out what i said i was using was actually what i was using instead of all that. \n\nit's weird how invested you are in this, even going so far as thinking nobody would have albums, instead of just realizing that maybe things existed that weren't good. \n\nespecially since you didn't even know the thing described existed.",
                          "score": 5,
                          "created_utc": 1745795689.0,
                          "replies": [
                            {
                              "id": "mpe8pj5",
                              "author": "None",
                              "body": "[removed]",
                              "score": 1,
                              "created_utc": 1745795737.0,
                              "replies": [
                                {
                                  "id": "mpe919k",
                                  "author": "RaymondBeaumont",
                                  "body": "i'll find the link to this random item i owned 24 years ago when i go back in time to tell myself that some weirdo on reddit is heavily invested in this.",
                                  "score": 2,
                                  "created_utc": 1745795851.0,
                                  "replies": [
                                    {
                                      "id": "mpeaamg",
                                      "author": "im_thatoneguy",
                                      "body": "“The 90s were awful we had to stop every 50 miles down the interstate to shovel coal into our cars and they weren’t able to drive faster than 20mph.”",
                                      "score": 1,
                                      "created_utc": 1745796291.0,
                                      "replies": [
                                        {
                                          "id": "mpeaghh",
                                          "author": "RaymondBeaumont",
                                          "body": "2001 was in the 00s, not the 90s.",
                                          "score": 1,
                                          "created_utc": 1745796348.0,
                                          "replies": [
                                            {
                                              "id": "mpebk13",
                                              "author": "im_thatoneguy",
                                              "body": "Yeah you’re describing the 1980s technology not USB.\n\nRS232 serial cables were doing 14.4kbps in the 1980s.\n\n14.4kbps is 0.8MB/minute that would mean a 128kbps mp3 album would take like an hour even over 1980s old school 80s serial connections.",
                                              "score": 1,
                                              "created_utc": 1745796729.0,
                                              "replies": [
                                                {
                                                  "id": "mpecbbh",
                                                  "author": "RaymondBeaumont",
                                                  "body": "again, i will try to invent a time machine to tell myself that the passing of time i was feeling is incorrect. i will mention you by your username so you will get the credit and young me will know that somewhere out there, a totally cool and normal dude will one day be on reddit.\n\ndon't know what i can do until i get the time machine, really.",
                                                  "score": 1,
                                                  "created_utc": 1745797001.0,
                                                  "replies": [
                                                    {
                                                      "id": "mpecqgm",
                                                      "author": "im_thatoneguy",
                                                      "body": "Maybe you had the worst USB device in history and some guy scammed you. But don’t try convincing the youngins that it was typical of 2001. Because it’s not typical for USB 1.0 unless you put a 9600baud modem into the middle for no reason.",
                                                      "score": 0,
                                                      "created_utc": 1745797149.0,
                                                      "replies": [
                                                        {
                                                          "id": "mped8bv",
                                                          "author": "RaymondBeaumont",
                                                          "body": "Literally just talked about my experience with some shitty usb cable. If I had known a crazy person would implode because of it... well, I still would have said it because this is a funny Reddit story now.\n\nI have to applaud you, though.\n\nI don't think I've ever seen a reddit username more fitting for a person.\n\nNo, it would have been better if it had been \"im\\_thatguy.\"",
                                                          "score": -1,
                                                          "created_utc": 1745797322.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mpbrxdw",
          "author": "Macho_Chad",
          "body": "I remember when the battle was on between FireWire and USB. Vendors picked sides, FireWire lost. Good times.",
          "score": 48,
          "created_utc": 1745767955.0,
          "replies": [
            {
              "id": "mpbsmmj",
              "author": "flcinusa",
              "body": "I remember I had to buy a FireWire card for my PC after getting my 3rd gen iPod in 2003",
              "score": 20,
              "created_utc": 1745768172.0,
              "replies": [
                {
                  "id": "mpbxj9c",
                  "author": "Iamnotabothonestly",
                  "body": "I had to buy a PCIe firewire card for my PC this year, since I'm still using legacy hardware in my home studio. But my old PC dieded and I don't have regular PCI ports in the new one.",
                  "score": 7,
                  "created_utc": 1745769680.0,
                  "replies": [
                    {
                      "id": "mpcmnzh",
                      "author": "Kaptain_Napalm",
                      "body": "I ended up buying an old Mac Mini for my studio so I could keep using my FireWire interface. Had to install some obscure Russian drivers to make it run but now it's working like it's 2007 again.",
                      "score": 1,
                      "created_utc": 1745777287.0,
                      "replies": [
                        {
                          "id": "mpco3l3",
                          "author": "Iamnotabothonestly",
                          "body": "I've considered getting an old mac mini for the same purpose. It would sit quite neatly in my rats nest of cables. Would also be convenient to be able to gather all the external gear to a dedicated box. \n\nJust been too lazy to do something about the mess in the studio...",
                          "score": 1,
                          "created_utc": 1745777726.0,
                          "replies": [
                            {
                              "id": "mpd1vkg",
                              "author": "Kaptain_Napalm",
                              "body": "I've been really happy with it. It's definitely not a performance monster but it runs Live 10 and has a FireWire port which is pretty much all I need. And you can find them for dirt cheap second hand, I'm considering grabbing a spare next time I see one under 100€ around my ends.  \n\nPlus that desk footprint is hard to beat. That thing is so tiny you forget it's even here.",
                              "score": 1,
                              "created_utc": 1745782014.0,
                              "replies": []
                            },
                            {
                              "id": "mpdexgl",
                              "author": "Malawi_no",
                              "body": "There are Firewire to USB cables, but you loose some functionality.",
                              "score": 1,
                              "created_utc": 1745786056.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mpbxr4a",
                  "author": "Copel626",
                  "body": "when HDDs and cameras started using FW800 it was such a big deal and everyone would buy Mac BC they had FW400/800 ports on the standard build. Then esata....ahh the good ole days of stupid proprietary connectors that have copy rights, I think thunderbolt was the last one that data transfer/connection standard that had an exclusive license to Mac for the first few years of its life",
                  "score": 13,
                  "created_utc": 1745769748.0,
                  "replies": [
                    {
                      "id": "mpdrkxn",
                      "author": "cute_polarbear",
                      "body": "What happened to esata? I remember had a drive back then, esata was way faster than usb 2.0, but it had some plug and play issues. Once usb 3.0 become commonplace and much more stable, no one bothered with esata...",
                      "score": 2,
                      "created_utc": 1745790029.0,
                      "replies": [
                        {
                          "id": "mpdt2jx",
                          "author": "Copel626",
                          "body": "I'm not sure, I know Lacie supported it up to the mid 2010s I think?",
                          "score": 2,
                          "created_utc": 1745790513.0,
                          "replies": []
                        },
                        {
                          "id": "mpejua4",
                          "author": "Slight_Drop5482",
                          "body": "“Some plug and play issues” is putting it lightly.",
                          "score": 2,
                          "created_utc": 1745799709.0,
                          "replies": [
                            {
                              "id": "mpf1me8",
                              "author": "cute_polarbear",
                              "body": "Haha. That was so true. Esta adapter cards (when it works) often drives get dropped and I've seen many times device get corrupted... It's poor man's version of scsi I guess. It was also super finicky with hard drive brands / batches...",
                              "score": 2,
                              "created_utc": 1745806294.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mpg48t2",
                  "author": "NOTorAND",
                  "body": "Did you use Musicmatch software to manage the songs on your ipod too?",
                  "score": 1,
                  "created_utc": 1745825347.0,
                  "replies": [
                    {
                      "id": "mpgleqb",
                      "author": "flcinusa",
                      "body": "For the first few months until hell froze over",
                      "score": 1,
                      "created_utc": 1745836324.0,
                      "replies": [
                        {
                          "id": "mpglt8t",
                          "author": "NOTorAND",
                          "body": "Lol it wasn't THAT bad. I had the 2nd Gen ipod (10gb, $400) and if I recall, iTunes wasn't even an option when it released. \n\nI do specifically remember getting my parents to buy me a firewire pcie module for the pc.",
                          "score": 1,
                          "created_utc": 1745836552.0,
                          "replies": [
                            {
                              "id": "mpgnlh1",
                              "author": "flcinusa",
                              "body": "Yeah, iTunes didn't hit windows till around October 2003, I got my iPod in July or August, I think I loaded it up once and basically left it until then.",
                              "score": 1,
                              "created_utc": 1745837497.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpdbakd",
              "author": "amazinglover",
              "body": "Firewire was more expensive and had to be licensed from apple.\n\nWhich is why it lost apple has somewhat learned from that mistake by making certain things semi open license.",
              "score": 10,
              "created_utc": 1745784949.0,
              "replies": [
                {
                  "id": "mpdnsod",
                  "author": "Cozmo85",
                  "body": "License fees were paid to mpeg la which was a joint group by all the patent holders. While Apple was a member so were a bunch of other companies. Apple didn’t even own the most patents.",
                  "score": 3,
                  "created_utc": 1745788796.0,
                  "replies": []
                },
                {
                  "id": "mpebfwi",
                  "author": "InfernalCombustion",
                  "body": "After Firewire, they still pushed for Lightning and now that's dead too.",
                  "score": 3,
                  "created_utc": 1745796689.0,
                  "replies": [
                    {
                      "id": "mpfjk6i",
                      "author": "pandaSmore",
                      "body": "Thunderbolt superceded Firewire. Lightning supercede the 30 pin dock connector.",
                      "score": 4,
                      "created_utc": 1745813812.0,
                      "replies": []
                    },
                    {
                      "id": "mpzu2mz",
                      "author": "JamesHeckfield",
                      "body": "After 11 years and hundreds of millions of devices ",
                      "score": 0,
                      "created_utc": 1746095036.0,
                      "replies": []
                    },
                    {
                      "id": "mpjinyv",
                      "author": "AnonymousMonk7",
                      "body": "Apple contributed the thunderbolt and usb-c design as well. But sorry to interrupt your needless bitterness about a corporation for... making things. And being the first to popularize USB in the first place.",
                      "score": -1,
                      "created_utc": 1745871311.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpfifmj",
              "author": "clarinetJWD",
              "body": "Firewire was used for a long time in the professional audio world because while USB 2.0 was technically faster, Firewire had less variation in the rate at which data was transmitted, making it more reliable for lube audio recording.\n\nIt was a big deal when USB audio gear of that time (think Presonus 1818VSL) started to do high quality multi-channel audio over USB.",
              "score": 3,
              "created_utc": 1745813286.0,
              "replies": [
                {
                  "id": "mpz6kcs",
                  "author": "alidan",
                  "body": "if I remember right, it could send and receive at the same time, and generally had lower latency, fire wire was faster than usb 2, it was 3 that was faster than it, but it still had niche uses where it was better, just not better enough.",
                  "score": 1,
                  "created_utc": 1746080306.0,
                  "replies": [
                    {
                      "id": "mq0k2qa",
                      "author": "clarinetJWD",
                      "body": "Almost. USB 2 was technically faster: 480Mbps vs 400Mbps for Firewire 1, but the rest is right",
                      "score": 1,
                      "created_utc": 1746106050.0,
                      "replies": [
                        {
                          "id": "mq1pmsw",
                          "author": "alidan",
                          "body": "if I remember right, firewire was actually able to hit that speed, there there was firewire 800 and 1600 before usb 3 came around granted 1600 didn't see adoption\n\nI will give firewire one good point to this day, the standard didnt get completely fucked like usb currently is where there are so many different variants of the same damn thing you have no idea what you have by looking at it.",
                          "score": 1,
                          "created_utc": 1746118588.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpglt2l",
              "author": "Starfox-sf",
              "body": "FireWire is an Apple’s name for IEEE 1394.",
              "score": 3,
              "created_utc": 1745836549.0,
              "replies": [
                {
                  "id": "mpjomva",
                  "author": "coffeeshopslut",
                  "body": "Sony iLink",
                  "score": 2,
                  "created_utc": 1745873084.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mpd8364",
              "author": "retainftw",
              "body": "My old miniDV camcorder in the mid 2000s used it. Needed to keep a decade old PC with a Soundblaster card with firewire to pull old 720i video off of it! At least it was digital, making the most extraction easy.",
              "score": 2,
              "created_utc": 1745783953.0,
              "replies": []
            },
            {
              "id": "mpg3lc6",
              "author": "InternationalDisk698",
              "body": "Funnily enough, I just got a FireWire cable for my Mom's old camcorder ",
              "score": 1,
              "created_utc": 1745824930.0,
              "replies": []
            },
            {
              "id": "mpz6fey",
              "author": "alidan",
              "body": "fire wire was hands down better till usb 3, and even then had niches where it was still better but not by enough to justify its continued use.",
              "score": 1,
              "created_utc": 1746080226.0,
              "replies": [
                {
                  "id": "mpz7nn2",
                  "author": "Macho_Chad",
                  "body": "Yeah I remember it handled data differently. I’m more familiar with usb protocols, but the primary differentiator (iirc) was that FireWire was a stream of data, whereas usb was packet based. \n\nI could see that being a huge benefit in media workflows.",
                  "score": 1,
                  "created_utc": 1746080947.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mpccvmu",
          "author": "PancAshAsh",
          "body": ">Today it’s a joke\n\nIt's sufficient for the incredible vast majority of use cases, pretty much the only things that USB 2 supported that have gotten better with increased data rate are mass storage and some network interfaces.",
          "score": 36,
          "created_utc": 1745774398.0,
          "replies": [
            {
              "id": "mpejen2",
              "author": "kermityfrog2",
              "body": "Yeah, still have tons of devices that are still on USB 2.0\n\nWired mice/keyboards, printers, laptop coolers.",
              "score": 5,
              "created_utc": 1745799549.0,
              "replies": [
                {
                  "id": "mpet1zd",
                  "author": "MWink64",
                  "body": "Things like mice and keyboards usually aren't even linking at USB 2.0 speeds. They usually run as USB 1.1.",
                  "score": 8,
                  "created_utc": 1745803115.0,
                  "replies": [
                    {
                      "id": "mpet98x",
                      "author": "kermityfrog2",
                      "body": "Definitely for a keyboard, might not work for a high poll rate mouse.",
                      "score": 3,
                      "created_utc": 1745803189.0,
                      "replies": [
                        {
                          "id": "mpz72mm",
                          "author": "alidan",
                          "body": "1.1 speed would far surpass what even an 8000hz mouse (yes 8000hz not dpi) could send, however it requires a higher usb standard because 1 polls at 1000hz, and 2 can poll at 8000hz",
                          "score": 1,
                          "created_utc": 1746080604.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpflmx3",
              "author": "CO_PC_Parts",
              "body": "UNRAID, a major NAS operating system, recommends using USB 2.0 ports if you have them available for your boot drives.  But nowadays lots of systems don't even have them.",
              "score": 3,
              "created_utc": 1745814802.0,
              "replies": [
                {
                  "id": "mpz780q",
                  "author": "alidan",
                  "body": "thankfully a lot of current motherboards do specify what usb ports are bios addressable, I have a ps/2 keyboard specifically because of bios nightmares and usb",
                  "score": 1,
                  "created_utc": 1746080693.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mpfgqse",
              "author": "arahman81",
              "body": "\"Some\" as in any respecting ethernet adapter, like, why get slammed with 100Mbit cap.",
              "score": 1,
              "created_utc": 1745812512.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mpc8yod",
          "author": "FUTURE10S",
          "body": "Nah, I rarely, if ever, see a USB 2.0 device that takes advantage of its full speed. 60ish MB/s is nothing to sneeze at.",
          "score": 21,
          "created_utc": 1745773226.0,
          "replies": [
            {
              "id": "mpccla8",
              "author": "jer007",
              "body": "You clearly never moved a lot of data over USB 1.0. The speed difference was incredible.",
              "score": 8,
              "created_utc": 1745774313.0,
              "replies": [
                {
                  "id": "mpcyo4n",
                  "author": "FUTURE10S",
                  "body": "Oh, I know USB 2.0 was amazing especially compared to USB 1.1 (who the fuck had 1.0?), I'm just saying that I can't recall seeing a device that took advantage of USB 2.0's full capabilities. Even when I bought an expensive flash drive that was genuinely faster than the normal stuff, it was only like... 12MB/s? And I loved that thing, it was great, but still just under a quarter of USB 2.0's full potential.",
                  "score": 10,
                  "created_utc": 1745781000.0,
                  "replies": [
                    {
                      "id": "mpd9xz2",
                      "author": "BloodyLlama",
                      "body": "External HDDs used it for years.  Your alternative was firewire or eSATA.    Those hdds were totally bottlenecked hard when using usb 2.",
                      "score": 5,
                      "created_utc": 1745784534.0,
                      "replies": [
                        {
                          "id": "mpdr8g1",
                          "author": "FUTURE10S",
                          "body": "ah I never got external hard drives until eSATA and then USB 3.0 when the limiting factor became the drive itself rather than the bandwidth of the port, but yeah, if you had a USB 2.0 drive, it was limited by the port bandwidth",
                          "score": 0,
                          "created_utc": 1745789917.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpfgvci",
              "author": "arahman81",
              "body": "480Mbit is with the overhead.",
              "score": 1,
              "created_utc": 1745812569.0,
              "replies": [
                {
                  "id": "mpgm0wx",
                  "author": "Starfox-sf",
                  "body": "And very inefficient, which is why BOT was needed.\n\nhttps://www.diskmfr.com/what-is-bot-bulk-only-transport/",
                  "score": 2,
                  "created_utc": 1745836667.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mpz7m3e",
              "author": "alidan",
              "body": "usb2 would transfer 20mb per second, and techincally had bandwith for 480mbit, but never used it/could take advantage of it I beleive due to overhead, much like how usb3 can technically do 5gbit which is 625mb but I have never seen it do more than 450 even with a ssd being used both internally and externally, (ssds can at bare minimum go 20 seconds at full pcie speeds for transfer before they heat up enough to be throttled in a worst case)",
              "score": 1,
              "created_utc": 1746080920.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mpdnb8m",
          "author": "lingbabana",
          "body": "And yet, it comes with the new iphone 16",
          "score": 6,
          "created_utc": 1745788639.0,
          "replies": []
        },
        {
          "id": "mpdvzgh",
          "author": "dtwhitecp",
          "body": "My first job was working at Best Buy around that time. A few weeks ago I found an unopened USB 2.0 cable just like I used to sell in the work electronics recycling bin - had to keep it for the memories. It was a big deal.",
          "score": 3,
          "created_utc": 1745791474.0,
          "replies": []
        },
        {
          "id": "mpee880",
          "author": "bogglingsnog",
          "body": "I mean today we still sometimes plug in USB 3.0 devices but they get stuck at 2.0 speeds.",
          "score": 1,
          "created_utc": 1745797674.0,
          "replies": []
        },
        {
          "id": "mpel0yl",
          "author": "Killbot_Wants_Hug",
          "body": "I mean all old transfer speeds were painfully slow compared to modern ones.\n\nLike when 802.11b came out wifi became useful because it hit 11mbits/sec, which was super fast compared to the 2mbits/sec of the old standard. At that point 100mbit Ethernet was considered pretty good and people wondered if gigabit was even needed.\n\nBack when I was a nerdy kid on dial up I use to say I wanted to get OC-48c speeds but that I might have to launch my own satellite for that. I never imagined that I'd have 3gigbits running to my home, let alone the fact that I could upgrade to 5 or 10 gigbits if I really wanted.",
          "score": 1,
          "created_utc": 1745800137.0,
          "replies": []
        },
        {
          "id": "mphxard",
          "author": "None",
          "body": "It's a joke but it's still a standard for almost all phones nowadays.",
          "score": 1,
          "created_utc": 1745854292.0,
          "replies": []
        },
        {
          "id": "mpz6cfs",
          "author": "alidan",
          "body": "honestly its still not a joke, most things that use usb2 are peripherals that would never saturate a 2.0 data stream, for file transfer yes, it's not adequate anymore, but for nearly anything else it's more than enough.",
          "score": 1,
          "created_utc": 1746080178.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpbgbv8",
      "author": "f4546",
      "body": "It’s 25 years old and I still can’t figure out the right way to plug it in.",
      "score": 368,
      "created_utc": 1745764270.0,
      "replies": [
        {
          "id": "mpbhpsu",
          "author": "71fq23hlk159aa",
          "body": "Of the two orientations, it's whichever you try third.",
          "score": 177,
          "created_utc": 1745764725.0,
          "replies": [
            {
              "id": "mpdzflr",
              "author": "Stoned-hippie",
              "body": "Sometimes, I get unlucky and get it the fourth time",
              "score": 11,
              "created_utc": 1745792621.0,
              "replies": []
            },
            {
              "id": "mpgmajl",
              "author": "Starfox-sf",
              "body": "The USB Superposition theorem. Luckily USB-C solved that one but introduced another (USB Cable Supercapability theorem).",
              "score": 2,
              "created_utc": 1745836813.0,
              "replies": []
            },
            {
              "id": "mpg4jqt",
              "author": "Seagoingnote",
              "body": "Truer words have never been spoken",
              "score": 2,
              "created_utc": 1745825547.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mpbh8wo",
          "author": "trickman01",
          "body": "Always the third try.",
          "score": 133,
          "created_utc": 1745764571.0,
          "replies": [
            {
              "id": "mpclqv5",
              "author": "h0tel-rome0",
              "body": "It’s a fundamental rule to the universe at this point",
              "score": 12,
              "created_utc": 1745777008.0,
              "replies": []
            },
            {
              "id": "mpcw5yc",
              "author": "thisisawebsite",
              "body": "\"Third time, every time.\"",
              "score": 8,
              "created_utc": 1745780221.0,
              "replies": []
            },
            {
              "id": "mpdvawl",
              "author": "COC_410",
              "body": "I remember reading this joke the first time. \n\nNow every time I mess up and get it right the third time I get a chuckle out of it instead of getting irritated.\n\nOne of my favorite jokes for that reason.",
              "score": 3,
              "created_utc": 1745791249.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mpbhn1p",
          "author": "FinsToTheLeftTO",
          "body": "Pick one way, then try the other way, then back to the first way.",
          "score": 25,
          "created_utc": 1745764700.0,
          "replies": []
        },
        {
          "id": "mpbj3rd",
          "author": "SiscoSquared",
          "body": "USB c adoption can't move fast enough lol",
          "score": 29,
          "created_utc": 1745765172.0,
          "replies": [
            {
              "id": "mpcluvs",
              "author": "stellvia2016",
              "body": "Ironically enough, depending on a few factors, there are still situations where USB-C cables only work properly plugged in one way.",
              "score": 10,
              "created_utc": 1745777042.0,
              "replies": [
                {
                  "id": "mpcuavd",
                  "author": "MSgtGunny",
                  "body": "Can you give an example?",
                  "score": 5,
                  "created_utc": 1745779645.0,
                  "replies": [
                    {
                      "id": "mpcxnqo",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 4,
                      "created_utc": 1745780684.0,
                      "replies": [
                        {
                          "id": "mpda2kv",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 0,
                          "created_utc": 1745784572.0,
                          "replies": [
                            {
                              "id": "mpdj29l",
                              "author": "None",
                              "body": "[deleted]",
                              "score": -4,
                              "created_utc": 1745787326.0,
                              "replies": [
                                {
                                  "id": "mpdp8q7",
                                  "author": "MSgtGunny",
                                  "body": "You’re incorrect in just about everything you’ve said. No standard protocol supported over a usb-c cable is dependent on the plug orientation, not USB, DisplayPort, or Thunderbolt. \n\nLook up the wiring diagram of the port, it’s symmetrical in terms of which pins are power, ground, and data. Of the data pins, the usb 2.0 pins are actually symmetrical, the rest are different pairs of transmit and receiver, but still symmetrical in terms of which pins in each pair is + or - . \n\nIt’s not common at all for any function over USB C, since your mental model of how the specification works does not match reality.",
                                  "score": 2,
                                  "created_utc": 1745789265.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mpczxt4",
                      "author": "stellvia2016",
                      "body": "When the connectors get older, they can stop being able to properly flip the incoming signals, causing either PD or data to not work. Because AFAIK while the cable may be reversible, the USB hub expects the signals a certain way, so there is a \"true\" orientation and a \"reverse\" orientation that needs to be re-organized for things to work properly.\n\nI may have some of the terminology or what exactly is changing things up wrong, but my general explanation should be correct.",
                      "score": -2,
                      "created_utc": 1745781401.0,
                      "replies": [
                        {
                          "id": "mpdcdds",
                          "author": "MSgtGunny",
                          "body": "Ok, I think your comment was slightly misleading then. Having either the connector or port be broken causing it not to behave correctly is expected.  Based on the thread it seemed you were saying that in certain situations, a standard usb c cable/port needed to be oriented a specific way. All bets are off if things are broken. \n\nIf you look up a usb-c pinout wiring diagram, you’ll see that the ground and power pins are all symmetrical, so you would need both the port and the cable to be faulty in similar ways to cause it to not support power delivery (at least at the base 5v)",
                          "score": 5,
                          "created_utc": 1745785279.0,
                          "replies": []
                        },
                        {
                          "id": "mpd64c9",
                          "author": "Malawi_no",
                          "body": "Are the leads not the same on both sides, only in reverse order?",
                          "score": 2,
                          "created_utc": 1745783344.0,
                          "replies": [
                            {
                              "id": "mph8ngf",
                              "author": "mccoyn",
                              "body": "Not all of them.\n\nThe high speed data lines are not duplicated as this would cause reflections of the signal.  Instead, they are routed to a multiplexer in the host and another in the device to sort them out.  There isn't a \"true\" and \"reversed\" orientation.  There are two different orientation that are handled in the same way with the multiplexers.\n\nAlso, only one of the CC lines is routed from one end to the other, allowing the host and device to detect the orientation.",
                              "score": 2,
                              "created_utc": 1745846438.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mpdl26y",
                          "author": "Kills_Alone",
                          "body": "That is not certain factors, that is the cable being broken.",
                          "score": 1,
                          "created_utc": 1745787932.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpf133g",
              "author": "Azure-April",
              "body": "no thanks. usb c is great for devices that actually require something so small, but there is exactly zero reason to put such a tiny weak connector where a much more sturdy full size usb port could go.",
              "score": 7,
              "created_utc": 1745806093.0,
              "replies": []
            },
            {
              "id": "mpbpgi2",
              "author": "AlarmDozer",
              "body": "Ah, more e-waste. Gotta love it.",
              "score": -44,
              "created_utc": 1745767184.0,
              "replies": [
                {
                  "id": "mpc5z4o",
                  "author": "Electricengineer",
                  "body": "Baseless comment",
                  "score": 7,
                  "created_utc": 1745772323.0,
                  "replies": []
                },
                {
                  "id": "mpcg91e",
                  "author": "NickCharlesYT",
                  "body": "There's this thing called an \"adapter\" that lets you plug old things into new things. Try it sometime.",
                  "score": 3,
                  "created_utc": 1745775383.0,
                  "replies": []
                },
                {
                  "id": "mpbs6es",
                  "author": "Heteroimpersonator",
                  "body": "Welcome to reality, where obsolete items become waste and capitalism has prevented the full effectiveness of recycling.",
                  "score": -13,
                  "created_utc": 1745768032.0,
                  "replies": [
                    {
                      "id": "mpcqgls",
                      "author": "Jmeier021",
                      "body": "Those 8088s are really pushing DCs these days.",
                      "score": 1,
                      "created_utc": 1745778453.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mpbjjlc",
          "author": "AmNoSuperSand52",
          "body": "We could have solved this years ago if we just had part of the interior plastic exposed on the out side of the plug, maybe in the shape of an arrow or something. Just enough so there’d be a method of muscle memory",
          "score": 15,
          "created_utc": 1745765314.0,
          "replies": [
            {
              "id": "mpd5vov",
              "author": "Malawi_no",
              "body": "Or if it had the same shape as the mini.",
              "score": 6,
              "created_utc": 1745783270.0,
              "replies": []
            },
            {
              "id": "mped3pk",
              "author": "NeuHundred",
              "body": "There is that symbol on the top.",
              "score": 3,
              "created_utc": 1745797278.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mpbkrqr",
          "author": "justanaccountimade1",
          "body": "Holes on top.",
          "score": 12,
          "created_utc": 1745765705.0,
          "replies": [
            {
              "id": "mpbs538",
              "author": "flcinusa",
              "body": "USB logo on top is my method",
              "score": 12,
              "created_utc": 1745768021.0,
              "replies": []
            },
            {
              "id": "mpbsofz",
              "author": "hedoeswhathewants",
              "body": "And if the port is sideways or upside down?",
              "score": 7,
              "created_utc": 1745768188.0,
              "replies": [
                {
                  "id": "mpdsfv5",
                  "author": "BringBackSoule",
                  "body": "look  at port, it has a tongue\n\nlook at cable port, it has a tongue.\n\nplug it in so the tongues don't overlap",
                  "score": 3,
                  "created_utc": 1745790313.0,
                  "replies": []
                },
                {
                  "id": "mpbwj5b",
                  "author": "Jon2054",
                  "body": "Then you turn it sideways or upside down ☺️",
                  "score": 7,
                  "created_utc": 1745769370.0,
                  "replies": [
                    {
                      "id": "mpcboyt",
                      "author": "JukePlz",
                      "body": "yeah but plugging-in a cable while you hold your desktop computer upside down gets annoying after a while",
                      "score": 3,
                      "created_utc": 1745774046.0,
                      "replies": [
                        {
                          "id": "mpcdltf",
                          "author": "Jon2054",
                          "body": "Turn the desk instead",
                          "score": 2,
                          "created_utc": 1745774612.0,
                          "replies": []
                        },
                        {
                          "id": "mpcgiwl",
                          "author": "NickCharlesYT",
                          "body": "Just move to/from Australia and you're golden.",
                          "score": 1,
                          "created_utc": 1745775463.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mpccvwc",
                  "author": "Cloudeur",
                  "body": "USB logo towards you",
                  "score": 1,
                  "created_utc": 1745774400.0,
                  "replies": []
                },
                {
                  "id": "mpd66zh",
                  "author": "Malawi_no",
                  "body": "Towards center of mass.",
                  "score": 1,
                  "created_utc": 1745783367.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mpcm1gi",
          "author": "ExtremeCreamTeam",
          "body": "You're talking about the form factor, not the protocol. \n\nUSB 2.0 =\\\\= USB Type A",
          "score": 13,
          "created_utc": 1745777099.0,
          "replies": [
            {
              "id": "mpcvwtl",
              "author": "f4546",
              "body": "I knew there’d be at least one “well actually” reply. Tell me, what other form factor existed in 2000? Mini-USB had the same issue",
              "score": 7,
              "created_utc": 1745780142.0,
              "replies": [
                {
                  "id": "mpfb001",
                  "author": "ExtremeCreamTeam",
                  "body": "Mini USB can only go in one way and if you're having USB A problems with Mini USB then you're beyond help. \n\nBut really, I don't see your point because you were confusing the connector type with the protocol. They're different. \n\nAnd to actually answer your facetious question, in 2000 there was A, B, AB, and mini.",
                  "score": 4,
                  "created_utc": 1745810009.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mpblh8a",
          "author": "nicuramar",
          "body": "That would be USB A, not USB 2.",
          "score": 9,
          "created_utc": 1745765929.0,
          "replies": []
        },
        {
          "id": "mpbjqyt",
          "author": "Candle1ight",
          "body": "Praise be USBC\n\nI mean they've kind of screwed the pooch again but it's certainly better",
          "score": 7,
          "created_utc": 1745765381.0,
          "replies": [
            {
              "id": "mpblmae",
              "author": "nicuramar",
              "body": "Screwed it how? By continuously upgrading the standard to support faster speeds? What’s the alternative?",
              "score": 1,
              "created_utc": 1745765973.0,
              "replies": [
                {
                  "id": "mpbu2kf",
                  "author": "tuberosum",
                  "body": "By making it almost impossible to figure out what you’ll get when you plug in a USB C cable into an USB C port. \n\nWill it be only power? Will it be USB2.0 speeds? Will it be faster? Will it be Thunderbolt? Who knows, it depends on your port and the cable you plugged into it and all the varieties look the same!",
                  "score": 45,
                  "created_utc": 1745768616.0,
                  "replies": [
                    {
                      "id": "mpbwhpq",
                      "author": "MrSaucyAlfredo",
                      "body": "This is a frustratingly true point. I hate that shit",
                      "score": 14,
                      "created_utc": 1745769358.0,
                      "replies": [
                        {
                          "id": "mpczdch",
                          "author": "JasonDJ",
                          "body": "My kids found a small USB-C to USB-A cable that came with some cheap AliExpress thing.  They tried to charge their kindle with it.\n\nThe cable glowed red hot and then caught fire in less than a minute after they plugged it in.  Could have easily started a fire, since they left it on the couch.",
                          "score": 10,
                          "created_utc": 1745781220.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mpch1qx",
                      "author": "elsjpq",
                      "body": "Yep. The fact that you can easily plug two devices together is useless if the devices won't talk to each other. By trying to solve a first world problem, they've destroyed the main purpose of physical ports, which is an implicit guarantee that two devices have a compatible protocol",
                      "score": 7,
                      "created_utc": 1745775616.0,
                      "replies": []
                    },
                    {
                      "id": "mpc9hgx",
                      "author": "Kyrond",
                      "body": ">Will it be only power? Will it be USB2.0 speeds? Will it be faster?\n\nAll of these are also true of USB A, blue for USB3 has become quite unreliable with custom colors. \n\nI am happy that my headphones, earphones, keyboard, controller and phone can all charge by the same cable. Might not be the fastest, but they all charge and that is enough.",
                      "score": 6,
                      "created_utc": 1745773383.0,
                      "replies": [
                        {
                          "id": "mpcnjx8",
                          "author": "stellvia2016",
                          "body": "The point they're trying to make is USB-C was supposed to improve/solve those issues, but in many ways it's worse now.\n\nNot only do you need to deal with the capabilities of the connector, but also of the cable. As even if it supports PD, you then need to know if it supports 60W, 100W, 140W etc. And even if you know the watts, your device may not be able to negotiate a Volts/Amps combination that are supported by both the device and the power adapter, etc.",
                          "score": 12,
                          "created_utc": 1745777559.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mpc75es",
                      "author": "bd_one",
                      "body": "In their defense, I've had the same issue with older USB 2 cables",
                      "score": 0,
                      "created_utc": 1745772684.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mpbzyc6",
                  "author": "whistler1421",
                  "body": "It’s too easy for a consumer to buy the wrong usb-c cable for their device. or plug a device into the wrong usb-c port. just because it fits it doesn’t guarantee it will work. It’s still a shit show. Just slightly less stinky",
                  "score": 6,
                  "created_utc": 1745770433.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mpbrstw",
          "author": "DaracMarjal",
          "body": "Start with the seam in the plug facing downwards.",
          "score": 2,
          "created_utc": 1745767915.0,
          "replies": []
        },
        {
          "id": "mpc9faq",
          "author": "_still_truckin_",
          "body": "It’s the original quantum device.",
          "score": 1,
          "created_utc": 1745773365.0,
          "replies": []
        },
        {
          "id": "mpc9llo",
          "author": "formershitpeasant",
          "body": "Seam side down",
          "score": 1,
          "created_utc": 1745773418.0,
          "replies": []
        },
        {
          "id": "mpcbcf8",
          "author": "utupuv",
          "body": "Damn I would have given up by year 3 at least.",
          "score": 1,
          "created_utc": 1745773941.0,
          "replies": []
        },
        {
          "id": "mpcbt5f",
          "author": "NotYourGran",
          "body": "Are you sure it’s not 52?",
          "score": 1,
          "created_utc": 1745774080.0,
          "replies": []
        },
        {
          "id": "mpdh0s5",
          "author": "ultrahello",
          "body": "I’m 50/50 on the plug, 80% of the time.",
          "score": 1,
          "created_utc": 1745786693.0,
          "replies": []
        },
        {
          "id": "mpdlhcb",
          "author": "raobjcovtn",
          "body": "My favorite shower thought is that there's someone out there with the highest percentage success rate of plugging in a USB A on the first try. I think about that one a lot",
          "score": 1,
          "created_utc": 1745788062.0,
          "replies": []
        },
        {
          "id": "mpgys9a",
          "author": "anonanon1313",
          "body": "I curse the inventor every time I use it.",
          "score": 1,
          "created_utc": 1745842675.0,
          "replies": [
            {
              "id": "mph34t2",
              "author": "TheCrimsonDagger",
              "body": "Not their fault. The reason USB-A is this way is because it made the port significantly cheaper which was important when convincing the big computer manufacturers like Dell to include it. It’s a chicken vs egg problem where nobody wants to pay to put a port on a computer than doesn’t have any devices to use it with but also nobody wants to pay to have their device use a port that computers don’t have.",
              "score": 1,
              "created_utc": 1745844400.0,
              "replies": [
                {
                  "id": "mph8f4f",
                  "author": "anonanon1313",
                  "body": "I read an article where the inventor admitted it was a big mistake, I don't recall that he mentioned cost issues. Off the top of my head I'm not sure why it would be more expensive to polarize the connector.",
                  "score": 1,
                  "created_utc": 1745846356.0,
                  "replies": [
                    {
                      "id": "mpiov08",
                      "author": "TheCrimsonDagger",
                      "body": "Well it wasn’t the only reason, but it was a big one. The reason it costs more is because you have to double the number of pins, which also means double the number of wires. So not only the port itself, but also the cables become more expensive. If you don’t do this and have a symmetrical cable with more than 2 pins and plug it in the wrong way there’s a good chance you fry something. So you make an asymmetrical port that can’t be plugged in backwards. Another thing that increases cost is that by making the connectors double sided the manufacturing becomes more complicated with tighter tolerances required. You could make the port bigger to give more room for error but that’s going to increase material costs and take up more board real estate. \n\nThen after the standard becomes accepted and cost doesn’t matter as much nobody wants to switch to a different design because it breaks backwards compatibility. \n\nAnother reason it ended up this way is they just didn’t realize it would be such a big issue. At the time most connectors were trapezoidal in shape which made them easy to distinguish the correct orientation at a glance.",
                      "score": 1,
                      "created_utc": 1745862379.0,
                      "replies": [
                        {
                          "id": "mpxcs53",
                          "author": "anonanon1313",
                          "body": "I remember reading an interview with the designer, and he expressed extreme remorse at the decision to polarize. He sounded sincere and didn't mention economics. (Shrug)",
                          "score": 1,
                          "created_utc": 1746054372.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mph3njk",
          "author": "Justredditin",
          "body": "The inventor said the team would have loved to make it reversible, however it would have doubled the cost because they would have had to double the wires and connections. [Article](https://www.pcgamer.com/usb-inventor-explains-why-the-connector-was-not-designed-to-be-reversible/)",
          "score": 1,
          "created_utc": 1745844598.0,
          "replies": []
        },
        {
          "id": "mpbnc00",
          "author": "Syngene",
          "body": "Billions of hours lost to a faceplam oversight in engineering.",
          "score": -1,
          "created_utc": 1745766512.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpc5gfu",
      "author": "gloucma",
      "body": "I’m still holding out for SCSI to come back. I kept all my chain terminators and everything!",
      "score": 34,
      "created_utc": 1745772160.0,
      "replies": [
        {
          "id": "mpcjp5u",
          "author": "CeldonShooper",
          "body": "Like raptors became birds, SCSI morphed into SAS which to the layman looks like SATA.",
          "score": 17,
          "created_utc": 1745776392.0,
          "replies": [
            {
              "id": "mpcn46m",
              "author": "ChiefStrongbones",
              "body": "SAS is SATA without the notch",
              "score": 7,
              "created_utc": 1745777425.0,
              "replies": [
                {
                  "id": "mpco6o1",
                  "author": "CeldonShooper",
                  "body": "Now you've made SAS sad.",
                  "score": 7,
                  "created_utc": 1745777752.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mpcrw26",
              "author": "TenchuReddit",
              "body": "I still can’t hear SaaS without thinking about SAS. Life as a hardware nerd …",
              "score": 5,
              "created_utc": 1745778899.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mpcbvmi",
      "author": "wysiwywg",
      "body": "Fun fact!\n\nWhoever has the older Atari 8-bit generation, listen up!\n\nThe Atari Serial Input/Output (SIO) system, developed for the Atari 8-bit computers, is considered a precursor to USB. SIO’s design features, such as its ability to daisy-chain multiple devices and its plug-and-play functionality, laid the groundwork for the later Universal Serial Bus (USB) standard. One of SIO’s designers, Joe Decuir, is credited with contributing to the development of USB. \n\nHere is where it’s get funnier! \n\nEx-Atari engineer Joe Decuir co-developed USB (with dozens of others) while at Microsoft in the90s\n\nJoe told that when patent trolls tried to derail USB, he mentioned his Atari 800 SIO design as prior art, which was a precursor to USB. Atari saved USB!",
      "score": 27,
      "created_utc": 1745774101.0,
      "replies": [
        {
          "id": "mpcrq1v",
          "author": "TenchuReddit",
          "body": "Good enough to stream data to/from 5.25” floppy drives? I never realized that it was a serial interface. For some reason I thought it was an 8-bit parallel bus. Wow, that’s impressive given the technology of that era.",
          "score": 5,
          "created_utc": 1745778848.0,
          "replies": []
        },
        {
          "id": "mpf0k8r",
          "author": "None",
          "body": "[removed]",
          "score": 5,
          "created_utc": 1745805896.0,
          "replies": [
            {
              "id": "mpf1ngf",
              "author": "wysiwywg",
              "body": "Absolutely! Those are heroes without capes!",
              "score": 1,
              "created_utc": 1745806305.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mpbkdk8",
      "author": "AbhishMuk",
      "body": "And yet a modern phone like the (Oneplus 13t) still uses USB 2 instead of USB 3… \n\n(Not just Oneplus, I think quite a few other phones/companies still do it. I can’t imagine it’s anything more than trying to artificially gimp something to upsell something else at this point.)",
      "score": 81,
      "created_utc": 1745765581.0,
      "replies": [
        {
          "id": "mpbkoku",
          "author": "Gnochi",
          "body": "It saves about 35 cents per USB controller, if I remember correctly.",
          "score": 77,
          "created_utc": 1745765678.0,
          "replies": [
            {
              "id": "mpboa7k",
              "author": "nicman24",
              "body": "Probably saves more in the PCB design",
              "score": 34,
              "created_utc": 1745766812.0,
              "replies": [
                {
                  "id": "mpbumj9",
                  "author": "981032061",
                  "body": "Also takes less power. \n\nAnd they likely have years of user analytics showing that only like 2% of people ever plug their phone in for data transfer.",
                  "score": 52,
                  "created_utc": 1745768785.0,
                  "replies": [
                    {
                      "id": "mpbyxem",
                      "author": "itsalongwalkhome",
                      "body": "Yeah..... because the speeds are shit....",
                      "score": 32,
                      "created_utc": 1745770113.0,
                      "replies": [
                        {
                          "id": "mpc79i0",
                          "author": "nicman24",
                          "body": "that is mostly because mtp is shit",
                          "score": 22,
                          "created_utc": 1745772719.0,
                          "replies": [
                            {
                              "id": "mpd1yvy",
                              "author": "bert93",
                              "body": "True that. For android devices there's a better method. Enable USB Debugging then on your PC set up ADB Explorer or one of the alternatives:\n\nhttps://github.com/Alex4SSB/ADB-Explorer\n\nIt's a frontend to ADB and lets you transfer files using that rather than MTP. So much faster.\n\nYou might need the driver from here too:\n\nhttps://developer.android.com/studio/run/oem-usb\n\nThey've got a table for other manufacturers if you're not using a pixel.",
                              "score": 15,
                              "created_utc": 1745782043.0,
                              "replies": [
                                {
                                  "id": "mpd3w1i",
                                  "author": "nicman24",
                                  "body": "I just use `adb shell tar -cf - \\| zstd -1` lol \n\nYes the zstd is due to usb2",
                                  "score": 3,
                                  "created_utc": 1745782651.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mpca2ag",
                          "author": "Kyrond",
                          "body": "USB 2 speed is still very likely to be faster than their wireless. \n\nWhat big file would a regular person (who syncs photos/videos to cloud) transfer?",
                          "score": 11,
                          "created_utc": 1745773556.0,
                          "replies": [
                            {
                              "id": "mpe0ui5",
                              "author": "ComradeJohnS",
                              "body": "yeah businesses make what the market demands.",
                              "score": 5,
                              "created_utc": 1745793081.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mpc7jws",
                      "author": "nicman24",
                      "body": "yeah honestly there have been more times i that plug the phone to give internet to a desktop than to transfer files.\n\ni only mostly do it when i am upgrading (through adb and fastboot)",
                      "score": 4,
                      "created_utc": 1745772806.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpbmlm7",
              "author": "AbhishMuk",
              "body": "Which is almost criminal for a product costing hundreds of dollars. \n\nAnd folks like you and me actually *know* what this is. The average person likely won’t even know that there’s a difference. (For example video out pretty much requires USB 3)",
              "score": 14,
              "created_utc": 1745766282.0,
              "replies": [
                {
                  "id": "mpbwv9j",
                  "author": "Mean-Evening-7209",
                  "body": "USB 3 is much harder to lay out though FWIW. You'll most certainly require 2+ board spins before you get it right. Not including issues in production when you start trying to make a ton of boards. The non recurring costs are very high.",
                  "score": 13,
                  "created_utc": 1745769474.0,
                  "replies": [
                    {
                      "id": "mpc261w",
                      "author": "Furrealyo",
                      "body": "You don’t need more than one board spin unless you’re bad at high speed layout. It’s really not that hard **if** you follow the rules. \n\nMismatched via count? Bad time. \n\nBroken reference plane(s)? Bad time. \n\nMismatched trace length? Bad time. \n\nSharp trace turns? Bad time. \n\nNo stitching vias? Bad time. \n\nPoor impedance control? Bad time. \n\nUSB3 GEN1 has been shipping for over a decade. Tons of design resources on the web to help anyone be successful the first pass.",
                      "score": 8,
                      "created_utc": 1745771126.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpc7hql",
              "author": "MedonSirius",
              "body": "And only 5% uses it. So, as a producer i would also save money. I mean 35cents x Million of phones? That's alot of Pennies!",
              "score": 1,
              "created_utc": 1745772788.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mpe62px",
          "author": "LeCrushinator",
          "body": "The iPhone 16 (non-pro) still uses USB 2.0 (with a USB-C connector).",
          "score": 13,
          "created_utc": 1745794818.0,
          "replies": []
        },
        {
          "id": "mpbyeb2",
          "author": "ryapeter",
          "body": "Because people don’t care.\n\nEx1. Someone young. Ask me to backup his device. Told to bring storage medium. External drive or flash drive. Just copy eventually it will finish. Pretty much because its the same from outside must be same inside. Remember apple always have 1 new colour every year and it will outsold because if you buy last year colour its a last year phone. \n\nEx2. A photographer with latest camera. Know and spent on latest memory card because of speed. But when transferring to printer etc. same shit old usb2 flash drive. It works. And if its that bad why they still sell it.\n\nPeople don’t care. Thats why adoption slow. Apple push for usb2. Apple also stop pushing further. USB itself cannot promote. If they care they will be hard ass making sure C is not fucked this bad.\n\nWhy allow 2.0 C?",
          "score": 9,
          "created_utc": 1745769947.0,
          "replies": [
            {
              "id": "mpf9xzm",
              "author": "sarhoshamiral",
              "body": "People don't care in certain applications. For phones, I can't even remember the last time I connected it as storage device to anything.\n\nFor the photographer example, fast SD cards matter for burst shooting or 4k high quality video recording. But when transferring to PC, it really doesn't matter if it takes 20 seconds vs 2 minutes. Sure if I have a USB C 3.2 port and a reader I will use that but otherwise I may just connect the camera to my computer to get the job done.\n\nFor photos for example, I have to wait on Lightroom to finish preview processing which is the slower task.",
              "score": 2,
              "created_utc": 1745809575.0,
              "replies": []
            },
            {
              "id": "mpcyety",
              "author": "ThisIs_americunt",
              "body": "C is only becoming standard because of the EU pushing for it hard",
              "score": 1,
              "created_utc": 1745780919.0,
              "replies": [
                {
                  "id": "mpe4y60",
                  "author": "ryapeter",
                  "body": "EU only push for common charging. \n\nSplitting market again between data and charging cable. Same waste but pretend to reduce waste",
                  "score": 3,
                  "created_utc": 1745794433.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mpf9i7q",
              "author": "T3mporaryGold",
              "body": "The camera thing isn't a good example though, if you're shooting high resolution burst or raw video or something, you actually want the higher speed. They don't care about the file transfer to the computer, that's not why photographers buy those cards.",
              "score": 1,
              "created_utc": 1745809397.0,
              "replies": [
                {
                  "id": "mpfgtde",
                  "author": "ryapeter",
                  "body": "Current file size is over  50mb per photo. \n\nYou have all day",
                  "score": 0,
                  "created_utc": 1745812545.0,
                  "replies": [
                    {
                      "id": "mpghykg",
                      "author": "Darkskynet",
                      "body": "And here I am shooting 35mm waiting a few days to get my shots back from the lab lol",
                      "score": 1,
                      "created_utc": 1745834292.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mpghopf",
          "author": "Darkskynet",
          "body": "It’s probably a situation where they realize most of their customers are never plugging the device in via USB. Since if it has a fast enough wifi interface it may be faster than the USB2 anyways.",
          "score": 3,
          "created_utc": 1745834124.0,
          "replies": []
        },
        {
          "id": "mpfe8zz",
          "author": "zapporian",
          "body": "\\*gesticulates wildly\\* at apple and the f---ing iphone lightning cable / connector...\n\nAlso note that we (or rather, unfortunate electrical engineers) are apparently and probably forever still completely stuck with USB 2 - and for that matter all of the horrible batshit + totally proprietary / non-standard ad-hoc charging / power delivery industry specs that emerged on top of / out of that - thanks to backwards compatibility. lol\n\nUSB 3 / 4 / \"4 2.0\" (seriously, WTF is wrong with the USB consortium), and w/ all of the things that can run over it: thunderbolt / PCIe, displayport, etc etc. Quite literally is just 4 high speed, variable / high voltage USB serial data lanes / power delivery. Plus a USB 1/1.1/2 cable (used for device initialization, classic USB things, etc), duct-taped to it.\n\nThe chinese supposedly are further innovating, ish, with their GPMI thing. Which AFAIK is just USB-C with yet another alt-mode, backwards compatible with everything else. And a new optional, wider cable, that AFAIK is just the aforementioned type C / USB3 with an additional 4 lanes duct-taped to it.\n\nAlso still potentially running USB 2, simultaneously. Probably.\n\nThat backwards compatability is useful, to be clear. It probably is in pretty much all cases literally how your and nearly any wired mouse / keyboard still works. And a good dozen other things. And it’s a pretty important, critically stable part of making the horribly complex and ever evolving USB spec + cable standards work.",
          "score": 1,
          "created_utc": 1745811406.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpbkiu8",
      "author": "colorebel",
      "body": "Somewhere I’d like to think my UMAX SCSI scanner is still doing its thing.",
      "score": 21,
      "created_utc": 1745765627.0,
      "replies": [
        {
          "id": "mpbyd9y",
          "author": "Hansmolemon",
          "body": "I actually have one of those still hooked up to a G4 Mac. I use it to scan film negatives (for the kids out there that’s how we used to get pictures on the internet).",
          "score": 6,
          "created_utc": 1745769938.0,
          "replies": [
            {
              "id": "mpcdte2",
              "author": "Tasty-Traffic-680",
              "body": "Old scanners and printers are the best. You can still use them to counterfeit.",
              "score": 2,
              "created_utc": 1745774674.0,
              "replies": []
            },
            {
              "id": "mpc7flf",
              "author": "colorebel",
              "body": "Wow, didn’t know SCSI compatibility existed more recently. Nice!\n\nI should see if my Apple IIc will still boot up, it’s been about 5 years but loaded Apple Works just fine. Lost the cable to the ImageWriter II to really take it to the next level though.",
              "score": 1,
              "created_utc": 1745772771.0,
              "replies": [
                {
                  "id": "mpcdq4b",
                  "author": "Hansmolemon",
                  "body": "That’s a G4 not an M4 mind you. I keep a few legacy machines around for old games/peripherals. I’ve had that one since about 2000, keep it for os 9 compatibility (and to remind myself what a monumental step up OS X really was).",
                  "score": 4,
                  "created_utc": 1745774647.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mpblj2s",
      "author": "leedo8",
      "body": "Still a SCSI guy",
      "score": 13,
      "created_utc": 1745765945.0,
      "replies": [
        {
          "id": "mpbpag4",
          "author": "1sttimeverbaldiarrhe",
          "body": "SCSI is still very much alive in the enterprise storage space as Serial Attached SCSI.",
          "score": 16,
          "created_utc": 1745767130.0,
          "replies": [
            {
              "id": "mpc7ry9",
              "author": "leedo8",
              "body": "I did not know this. I figured it died with 40mb syquest drives.",
              "score": 3,
              "created_utc": 1745772873.0,
              "replies": [
                {
                  "id": "mpckd9c",
                  "author": "CeldonShooper",
                  "body": "Absolutely not. It is hiding as SAS. You can also get SAS hard disks and SAS SSDs which are often painfully more expensive than the peasant drives.",
                  "score": 7,
                  "created_utc": 1745776592.0,
                  "replies": [
                    {
                      "id": "mpfgj9x",
                      "author": "Znuffie",
                      "body": "If you ever think of buying used drives, always go for SAS ones. They're usually made for enterprise usage, so they have a lot of life left in them.\n\nI just bought 4 more (x 8TB) for 50€/ea last week, waiting for delivery to supplement my existing storage.\n\nAnd yes, I do use them in RAID10 (well, \"bunch of mirrors\", because ZFS).",
                      "score": 2,
                      "created_utc": 1745812418.0,
                      "replies": []
                    },
                    {
                      "id": "mpd7cic",
                      "author": "CrimsonFlash",
                      "body": "Often not if you get server pull drives. But getting a SAS enclosure for home use is pricey.",
                      "score": 1,
                      "created_utc": 1745783723.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpdcovw",
              "author": "im_thatoneguy",
              "body": "And iSCSI aka the SCSI protocol through Ethernet networks.",
              "score": 2,
              "created_utc": 1745785378.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mpcj5lf",
          "author": "CeldonShooper",
          "body": "I'm still a FireWire 400/800 person.",
          "score": 4,
          "created_utc": 1745776234.0,
          "replies": [
            {
              "id": "mpcj8or",
              "author": "leedo8",
              "body": "What did Iomega Zip drives use?",
              "score": 2,
              "created_utc": 1745776259.0,
              "replies": [
                {
                  "id": "mpcjilj",
                  "author": "CeldonShooper",
                  "body": "Many had a funky DB25 SCSI connector that was not very good (not enough ground connections) or a bidirectional parallel port that was slow as hell and never standardized well enough.",
                  "score": 2,
                  "created_utc": 1745776339.0,
                  "replies": [
                    {
                      "id": "mpcnwi9",
                      "author": "swolfington",
                      "body": "later revisions also used USB (probably 1.1 or something), and they made internal zip drives that used ATAPI",
                      "score": 2,
                      "created_utc": 1745777666.0,
                      "replies": []
                    },
                    {
                      "id": "mpctnmn",
                      "author": "colorebel",
                      "body": "I thought I was living the high life when I got my Gateway tower configured with an internal SCSI Zip Drive. Quick to transfer and play 32 MP3’s on a disk. Yes, that actually was the high life.",
                      "score": 1,
                      "created_utc": 1745779446.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mpcna8f",
                  "author": "StuffMaster",
                  "body": "Parallel port for me",
                  "score": 1,
                  "created_utc": 1745777476.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mpbmbbr",
      "author": "shitty_mcfucklestick",
      "body": "USB 1.0:\n- Am I a joke to you? 😢",
      "score": 8,
      "created_utc": 1745766190.0,
      "replies": [
        {
          "id": "mpboh81",
          "author": "nicman24",
          "body": "There was literally 1.1 within years. So kinda",
          "score": 16,
          "created_utc": 1745766874.0,
          "replies": []
        },
        {
          "id": "mpbtbg0",
          "author": "ABotelho23",
          "body": "It *is* a joke compared to 2.0.",
          "score": 13,
          "created_utc": 1745768386.0,
          "replies": []
        },
        {
          "id": "mpbyiem",
          "author": "Ace_of_Sevens",
          "body": "Too slow to be much use for storage or cameras. Basically only good for mice, keyboards & slow printers. Other devices existed, but the bottle neck was a big issue.",
          "score": 7,
          "created_utc": 1745769983.0,
          "replies": [
            {
              "id": "mpc6ylm",
              "author": "LegendOfVinnyT",
              "body": "Filling a Firewire iPod took minutes. Filling a USB 1.1 Nomad Jukebox took hours. This is why USB 2.0 was a godsend.",
              "score": 8,
              "created_utc": 1745772627.0,
              "replies": []
            },
            {
              "id": "mpc5hl9",
              "author": "mccalli",
              "body": "The competition at the time was floppy disk.",
              "score": 1,
              "created_utc": 1745772169.0,
              "replies": [
                {
                  "id": "mpc66pv",
                  "author": "Ace_of_Sevens",
                  "body": "It was SCSI & firewire. USB 1 was not an adequate substitute for either. USB 2 is what made it the do anything interface.",
                  "score": 8,
                  "created_utc": 1745772388.0,
                  "replies": [
                    {
                      "id": "mpc8pbz",
                      "author": "mccalli",
                      "body": "Nope, floppy. Original iMac for example - it got so much stick for only being USB and not having any floppy drive. \n\nSCSI existed (I wrote SCSI drivers for an early Linux kerne)(, FireWire too. But that wasn’t the target that USB 1 was pitching itself against. Those were considered pro/semi-pro at that time. USB was consumer.",
                      "score": -1,
                      "created_utc": 1745773149.0,
                      "replies": [
                        {
                          "id": "mpca0bq",
                          "author": "Ace_of_Sevens",
                          "body": "And to address these complaints, 2nd gen added Firewire. The complaint wasn't lack of a floppy per se. By 1998, floppies already had very limited utility because of size & speed, but were still around for compatibility reasons. There's a reason zip had gotten so big. The complaint was the lack of any good way to transfer files to another computer. The network was only good in applications that weren't common yet & the only other interface it had was super slow. People largely bought USB zip drives & CD burners, but they were slow & there wasn't a standard.",
                          "score": 5,
                          "created_utc": 1745773540.0,
                          "replies": [
                            {
                              "id": "mpcw2pz",
                              "author": "mccalli",
                              "body": "Oh agreed, but we’re in a thread that stated “USB 1: am I a joke to you?” \n\nUSB 1 was early thumb drive stuff. Its target wasn’t SCSI or FireWire, it was consumer stuff. The people who were getting their Gateway in the cow box, the dudes who were getting a Dell, the gen 1 iMac…that kind of thing.",
                              "score": 1,
                              "created_utc": 1745780194.0,
                              "replies": [
                                {
                                  "id": "mpdac62",
                                  "author": "Ace_of_Sevens",
                                  "body": "And that's exactly why 2 was a game changer & 1 was a somewhat more convenient serial port.",
                                  "score": 1,
                                  "created_utc": 1745784654.0,
                                  "replies": []
                                },
                                {
                                  "id": "mpgvrth",
                                  "author": "SScorpio",
                                  "body": "Your forgetting keyboards, mice, joysticks, printers, scanners, etc.\n\nHaving all that change to a single connector was a game changer.",
                                  "score": 1,
                                  "created_utc": 1745841397.0,
                                  "replies": [
                                    {
                                      "id": "mpgw8ch",
                                      "author": "mccalli",
                                      "body": "Agreed. At the time I remember the Slashdot thread where people, I kid you not, were moaning that USB \"was not a good enough reason to upgrade my mouse\".\n\n<sigh>.",
                                      "score": 1,
                                      "created_utc": 1745841595.0,
                                      "replies": [
                                        {
                                          "id": "mph1yf0",
                                          "author": "SScorpio",
                                          "body": "To be fair using USB instead of PS/2 for keyboard and mouse had large overhead and would make the whole system run worse back then. I also remember those horrible \"puck\" Apple mice from that era.\n\nGaming stuck with PS/2 for a long time until high pool rate gaming devices were the norm. 1000Hz pooling makes the interrupt advantage of PS/2 a moot point.",
                                          "score": 1,
                                          "created_utc": 1745843945.0,
                                          "replies": [
                                            {
                                              "id": "mph78pf",
                                              "author": "mccalli",
                                              "body": "Yep, it was more the 'upgrade' bit. You don't typically upgrade your mouse because of a connector. It was clear USB was just the new norm - buy a new computer? You're getting a USB mouse. Already own a computer and have a PS/2 mouse? Great - carry on using it, no rush.",
                                              "score": 1,
                                              "created_utc": 1745845928.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mpbph1v",
      "author": "Dolatron",
      "body": "50/50 chance of plugging it in the right way, but somehow wrong every… single… time.",
      "score": 16,
      "created_utc": 1745767188.0,
      "replies": [
        {
          "id": "mpbwuxb",
          "author": "Voidfang_Investments",
          "body": "Lmao",
          "score": 1,
          "created_utc": 1745769471.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpfpkeb",
      "author": "Gunfreak2217",
      "body": "25 years and apples 30$ charging cables still only support 2.0 max. Got to spend like 100$ to get 4 speeds lmao",
      "score": 5,
      "created_utc": 1745816787.0,
      "replies": []
    },
    {
      "id": "mpbnrsf",
      "author": "shadowpawn",
      "body": "I believe they could have made it slot in either way but would have cost more.",
      "score": 13,
      "created_utc": 1745766651.0,
      "replies": [
        {
          "id": "mpbv3fj",
          "author": "981032061",
          "body": "Yeah I have a little collection of reversible USB-A connectors that I’ve picked up over the years. Most are still available to buy in some capacity, but never really took off because of the cost.",
          "score": 7,
          "created_utc": 1745768928.0,
          "replies": []
        },
        {
          "id": "mpbosdf",
          "author": "KaspervD",
          "body": "Not without being incompatible with usb 1.0",
          "score": 4,
          "created_utc": 1745766971.0,
          "replies": [
            {
              "id": "mpdc3yi",
              "author": "im_thatoneguy",
              "body": "There are reversible USB A plugs from like dewalt of all people.",
              "score": 2,
              "created_utc": 1745785198.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mph3bzu",
          "author": "TheCrimsonDagger",
          "body": "Yeah it would have cost a lot more, which was a big deal when you’re trying to convince companies like Dell to include it in their PCs before there’s any devices that use it.",
          "score": 1,
          "created_utc": 1745844475.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpc9sbr",
      "author": "formershitpeasant",
      "body": "And I still can't just connect 2 computers by USB and move files",
      "score": 4,
      "created_utc": 1745773473.0,
      "replies": [
        {
          "id": "mphm1fr",
          "author": "YairJ",
          "body": "You might be able to connect them with an ethernet cable and set an ad-hoc network.",
          "score": 1,
          "created_utc": 1745850864.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpcafgg",
      "author": "Fredasa",
      "body": "Those rectangular ports have squandered probably several hours of my life over those 25+ years.  Yeah, it's the top comment.  People know.  But it's not even just \"Does it go in this way?\"  It's also \"I can't plug this damn thing in in the dark.\"",
      "score": 4,
      "created_utc": 1745773666.0,
      "replies": []
    },
    {
      "id": "mpcbj22",
      "author": "None",
      "body": "Didn’t the mothership in Independence Day have USBs?",
      "score": 4,
      "created_utc": 1745773996.0,
      "replies": []
    },
    {
      "id": "mpcono9",
      "author": "thermalblac",
      "body": "The main reason USB beat Firewire which was technically better at the time is royalty fees.\n\nIntel said no royalties for using USB standard in order to spur adoption. Apple decided on a royalty based licensing model for Firewire.",
      "score": 3,
      "created_utc": 1745777898.0,
      "replies": []
    },
    {
      "id": "mpeaivx",
      "author": "Polish-Proverb",
      "body": "Still get it upside down every first try.",
      "score": 3,
      "created_utc": 1745796371.0,
      "replies": [
        {
          "id": "mprf886",
          "author": "Neo_Techni",
          "body": "Every ~~single~~ double time.",
          "score": 1,
          "created_utc": 1745974569.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpfks27",
      "author": "End_Journey",
      "body": "And 25 years later it’s still 50/50 chance you will get it in right the first time!",
      "score": 3,
      "created_utc": 1745814387.0,
      "replies": []
    },
    {
      "id": "mpbjnbm",
      "author": "seamonkey420",
      "body": "Windows 98 SE baby!! giving us those 2.0 speeds!!!!",
      "score": 5,
      "created_utc": 1745765348.0,
      "replies": []
    },
    {
      "id": "mpc9u0q",
      "author": "Underp0pulation",
      "body": "Apple iMac in 1998",
      "score": 2,
      "created_utc": 1745773487.0,
      "replies": [
        {
          "id": "mpcj4o0",
          "author": "Cameront9",
          "body": "That was USB 1",
          "score": 3,
          "created_utc": 1745776226.0,
          "replies": [
            {
              "id": "mpd0cbf",
              "author": "Underp0pulation",
              "body": "Oh crap!",
              "score": 1,
              "created_utc": 1745781528.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mpd5lt0",
      "author": "Malawi_no",
      "body": "Remember buying a set of joysticks in the early 2000's. After some deliberation I went witht he USB version over gameport as I assumed it would be more future-proof. Worked out well.",
      "score": 2,
      "created_utc": 1745783188.0,
      "replies": []
    },
    {
      "id": "mpdpyn8",
      "author": "None",
      "body": "[deleted]",
      "score": 2,
      "created_utc": 1745789501.0,
      "replies": [
        {
          "id": "mpeajb7",
          "author": "iovnow",
          "body": "I always get it on the third try.",
          "score": 3,
          "created_utc": 1745796375.0,
          "replies": [
            {
              "id": "mpew9uf",
              "author": "Borderpatrol1987",
              "body": "Look at you showing off about getting it after the third try.",
              "score": 2,
              "created_utc": 1745804308.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mpdz03y",
      "author": "PsyJak",
      "body": "*revolutionise",
      "score": 2,
      "created_utc": 1745792481.0,
      "replies": []
    },
    {
      "id": "mpefk3e",
      "author": "Ok-Barracuda544",
      "body": "When I was training for my first tech support job, in preparation for the launch of Windows 95, we spent an hour going over have awesome USB was going to be.",
      "score": 2,
      "created_utc": 1745798142.0,
      "replies": [
        {
          "id": "mpevux0",
          "author": "MWink64",
          "body": "Windows 95 did not launch with USB support. I don't think it got USB support until OSR2. Could you be thinking of PNP?",
          "score": 1,
          "created_utc": 1745804155.0,
          "replies": [
            {
              "id": "mpf3tt1",
              "author": "Ok-Barracuda544",
              "body": "I definitely remember it was about USB but as something that was coming in the future.",
              "score": 2,
              "created_utc": 1745807144.0,
              "replies": []
            },
            {
              "id": "mprf68q",
              "author": "Neo_Techni",
              "body": "Might have been the launch of Win95B which did",
              "score": 1,
              "created_utc": 1745974551.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mpehi9j",
      "author": "the908bus",
      "body": "USB killed your local electronics shop, no more terninators or device IDs or pass throughs etc, things just “worked” and didn’t require an hour on the phone",
      "score": 2,
      "created_utc": 1745798844.0,
      "replies": []
    },
    {
      "id": "mpgu2he",
      "author": "dttm_hi",
      "body": "And like all technology - I have zero idea how it actually works.",
      "score": 2,
      "created_utc": 1745840649.0,
      "replies": []
    },
    {
      "id": "mphg3go",
      "author": "cantpanick86",
      "body": "r/FuckImOld",
      "score": 2,
      "created_utc": 1745848976.0,
      "replies": []
    },
    {
      "id": "mpjrse2",
      "author": "autopilotxo",
      "body": "And still all of my USB drives are 2.0, I really should buy a new one",
      "score": 2,
      "created_utc": 1745874034.0,
      "replies": []
    },
    {
      "id": "mpo0hdd",
      "author": "rendrr",
      "body": "The pinnacle of Apple's charger innovation.\n\n/s",
      "score": 2,
      "created_utc": 1745937614.0,
      "replies": []
    },
    {
      "id": "mpbf6m4",
      "author": "MagicBoyUK",
      "body": "Nah, Firewire was better.",
      "score": 2,
      "created_utc": 1745763896.0,
      "replies": [
        {
          "id": "mpbgf3f",
          "author": "karatekid430",
          "body": "None of the external interfaces are \\*good\\* but USB4 does a flawed attempt at bringing PCIe outside of the computer. I mean it works, but with a tonne of design mistakes.",
          "score": 5,
          "created_utc": 1745764300.0,
          "replies": [
            {
              "id": "mpblspj",
              "author": "nicuramar",
              "body": "What design mistakes?",
              "score": 3,
              "created_utc": 1745766028.0,
              "replies": []
            },
            {
              "id": "mpbhkhq",
              "author": "MagicBoyUK",
              "body": "That was stolen from Thunderbolt. 😉\n\nUSB2 sucked because although the headline rate said 480Mbps, the CPU had to supervise data transfers. So it was real world slower than Firewire which let devices manage the transfer with near zero overhead.\n\nUSB2 was convenient, but badly flawed.",
              "score": 2,
              "created_utc": 1745764676.0,
              "replies": [
                {
                  "id": "mpbjomm",
                  "author": "AmNoSuperSand52",
                  "body": "Convenience is a legitimate consideration when designing an interface",
                  "score": 16,
                  "created_utc": 1745765360.0,
                  "replies": []
                },
                {
                  "id": "mpbjqxf",
                  "author": "karatekid430",
                  "body": "USB3 does not change that. Only USB4 can let devices speak when not spoken to because it tunnels PCIe.",
                  "score": 0,
                  "created_utc": 1745765380.0,
                  "replies": [
                    {
                      "id": "mpbokt1",
                      "author": "MagicBoyUK",
                      "body": "Where did I mention USB3?",
                      "score": 1,
                      "created_utc": 1745766905.0,
                      "replies": [
                        {
                          "id": "mpc5xbo",
                          "author": "karatekid430",
                          "body": "Well not directly but saying USB2 sucks because of something which is also a problem in USB3 is an omission if USB3 is not mentioned also.",
                          "score": 0,
                          "created_utc": 1745772307.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mpbjvi1",
          "author": "seamonkey420",
          "body": "ahhh.. its was.. if you had a device that had the interface..  just like syquest was better than zipdrive but zipdrives had the popularity/name recognition.",
          "score": 2,
          "created_utc": 1745765421.0,
          "replies": [
            {
              "id": "mpeupav",
              "author": "MWink64",
              "body": "I probably still have a Syjet laying around somewhere. 1.5GB per cartridge, compared to 1GB for the Iomega Jazz.",
              "score": 2,
              "created_utc": 1745803726.0,
              "replies": []
            },
            {
              "id": "mpbopac",
              "author": "MagicBoyUK",
              "body": "My SyQuest drives were fine until they kept failing!",
              "score": 2,
              "created_utc": 1745766944.0,
              "replies": [
                {
                  "id": "mpbpkf3",
                  "author": "seamonkey420",
                  "body": "oof. yea that is not a good thing. i had pretty good luck with mine. oddly i used my drive to load operating systems.  felt pretty smart the first time i figured that out. hehe..",
                  "score": 2,
                  "created_utc": 1745767219.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mpbnjsz",
          "author": "sleepingcow",
          "body": "Was FireWire backward compatible ? If I recall it wasn’t at least in some cases ?",
          "score": 0,
          "created_utc": 1745766581.0,
          "replies": [
            {
              "id": "mpboyx2",
              "author": "MagicBoyUK",
              "body": "Being an original standard, there was nothing for Firewire 400 to be backwards compatible with.\n\nThe later Firewire 800 was backwards compatible with Firewire 400.",
              "score": 6,
              "created_utc": 1745767029.0,
              "replies": [
                {
                  "id": "mpbtxbh",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -2,
                  "created_utc": 1745768572.0,
                  "replies": [
                    {
                      "id": "mpbzas6",
                      "author": "MagicBoyUK",
                      "body": "It absolutely was with a £3 passive adapter, if you didn't have a existing FW800 device with a FW400 daisy chain socket on it, or a spare FW800 to FW400 cable that shipped with a device.",
                      "score": 2,
                      "created_utc": 1745770229.0,
                      "replies": [
                        {
                          "id": "mpcajrt",
                          "author": "Kyrond",
                          "body": "That is a long way to say it wasnt compatible. Needing adapter = not compatible.",
                          "score": 1,
                          "created_utc": 1745773702.0,
                          "replies": [
                            {
                              "id": "mpd3sms",
                              "author": "MagicBoyUK",
                              "body": "USB-C isn’t compatible then.",
                              "score": 2,
                              "created_utc": 1745782621.0,
                              "replies": [
                                {
                                  "id": "mpdatat",
                                  "author": "Kyrond",
                                  "body": "Indeed USB C isn't compatible with USB A. But USB 1, 2 and 3 are all fully compatible in the most common scenario (USB A).",
                                  "score": 1,
                                  "created_utc": 1745784802.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mpc0et0",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 0,
                          "created_utc": 1745770575.0,
                          "replies": [
                            {
                              "id": "mpd3g1o",
                              "author": "MagicBoyUK",
                              "body": "You tried jamming a USB-C cable in a USB-A port?",
                              "score": 1,
                              "created_utc": 1745782513.0,
                              "replies": [
                                {
                                  "id": "mq4cf7e",
                                  "author": "blackdynomitesnewbag",
                                  "body": "NO!",
                                  "score": 1,
                                  "created_utc": 1746148127.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mpbu0vq",
          "author": "Fabian_3000",
          "body": "It still is ...",
          "score": 0,
          "created_utc": 1745768601.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpbuh41",
      "author": "Alienhaslanded",
      "body": "I would love to see a full transition to C and maybe keep only 2 3.whatever A ports as legacy.",
      "score": 3,
      "created_utc": 1745768740.0,
      "replies": [
        {
          "id": "mphd1nw",
          "author": "mccoyn",
          "body": "Best we can offer is one C port that you have to use for power.",
          "score": 1,
          "created_utc": 1745847973.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpbktgq",
      "author": "MasterJeebus",
      "body": "It was great and I still find myself using it today.",
      "score": 1,
      "created_utc": 1745765720.0,
      "replies": []
    },
    {
      "id": "mpc173q",
      "author": "ITGuy7337",
      "body": "Remember when firewire thought it was the hot new shit. 😏",
      "score": 1,
      "created_utc": 1745770822.0,
      "replies": []
    },
    {
      "id": "mpc2n28",
      "author": "CyanConatus",
      "body": "The article says USB4 is 80gb capable. Holy shit I don't think we'll need a new standard for a long time eh?\n\nLike I think the one file format that increased the most over the years is video and we're kinda starting to figure that for the most part 4k is the most we'll ever need. Maybe 8k. And if we want to nuts a high bit rate + frame rate\n\nFor example.\n\n1 hour of 8k relatively high bitrate at 60 fps (i.e far far beyond anyone could reason want) is roughly 80gb\n\nA USB4 would transfer that in a second lol\n\nMore reasonable a typical 4k movie is 15-30gb",
      "score": 1,
      "created_utc": 1745771274.0,
      "replies": [
        {
          "id": "mpcdp7j",
          "author": "None",
          "body": "[removed]",
          "score": 7,
          "created_utc": 1745774639.0,
          "replies": [
            {
              "id": "mpcgjte",
              "author": "CyanConatus",
              "body": "I mean... That's still insanely good lol",
              "score": 5,
              "created_utc": 1745775471.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mpc6tuo",
          "author": "a82320",
          "body": "But not to confuse with write rate tho, USB4 can transfer 80GB in one sec, if you hard drive only write 80M per second, well…",
          "score": 1,
          "created_utc": 1745772586.0,
          "replies": []
        },
        {
          "id": "mpcum24",
          "author": "TenchuReddit",
          "body": "80 Gbps over a 10ft cable is mind-boggling to me.",
          "score": 1,
          "created_utc": 1745779741.0,
          "replies": []
        },
        {
          "id": "mpfw51v",
          "author": "BakaOctopus",
          "body": "LLMs, Diffuser models on a type C portable SSD begs to differ.\n\nHeck yeah portable game drives",
          "score": 1,
          "created_utc": 1745820371.0,
          "replies": []
        },
        {
          "id": "mpejh8i",
          "author": "im_thatoneguy",
          "body": "The big thing with the ultra high speed USB is PCIe. So if you want to have a laptop with an external desktop class GPU in an enclosure you want fast data transfers.",
          "score": 0,
          "created_utc": 1745799575.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpcds7l",
      "author": "chaiscool",
      "body": "My brand new wifi 7 router has 6ghz and 10 GBe wan/lan but only comes with usb 2.0. Damn you tp link. \n\nOnly support openvpn and not wireguard too.",
      "score": 1,
      "created_utc": 1745774664.0,
      "replies": []
    },
    {
      "id": "mpcz8yr",
      "author": "Free_Possession_4482",
      "body": "Damn, and I’m over here still rocking my ps/2 keyboard (admittedly with usb adapter).",
      "score": 1,
      "created_utc": 1745781181.0,
      "replies": []
    },
    {
      "id": "mpdlxwf",
      "author": "motorboat_mcgee",
      "body": "I just wish there was consistency for usb-c, at this point.\n\nCould be USB 2, USB 3, USB 4, Thunderbolt, whatever other standards, it's annoying",
      "score": 1,
      "created_utc": 1745788205.0,
      "replies": [
        {
          "id": "mpfwccm",
          "author": "BakaOctopus",
          "body": "And there are sony Type C port with just power output that can burn other normal type c ports.\n\nAlso pin layouts differs, totally on OEMs, it's a mess",
          "score": 1,
          "created_utc": 1745820487.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpdo9wa",
      "author": "bigsnow999",
      "body": "I was using it today to print out some docs from a library. Don’t trust any public pc to log onto my cloud drive",
      "score": 1,
      "created_utc": 1745788951.0,
      "replies": []
    },
    {
      "id": "mpebhm6",
      "author": "existentialedema",
      "body": "![gif](giphy|OPU6wzx8JrHna)",
      "score": 1,
      "created_utc": 1745796706.0,
      "replies": []
    },
    {
      "id": "mpetjo0",
      "author": "thebestguac",
      "body": "Wow. It’s the same age as Britney Spears’ song “Oops! I Did it Again”",
      "score": 1,
      "created_utc": 1745803296.0,
      "replies": []
    },
    {
      "id": "mpeupg8",
      "author": "Felinomancy",
      "body": "I remember when one of the selling points of Windows 95 is \"Plug 'n Play\". Those were the \"good\" 'ol days.",
      "score": 1,
      "created_utc": 1745803727.0,
      "replies": []
    },
    {
      "id": "mpf1cc8",
      "author": "chriswaco",
      "body": "FireWire was better, but more expensive.",
      "score": 1,
      "created_utc": 1745806189.0,
      "replies": []
    },
    {
      "id": "mpf6q9o",
      "author": "80sCrack",
      "body": "Yuhhh",
      "score": 1,
      "created_utc": 1745808283.0,
      "replies": []
    },
    {
      "id": "mpf99x7",
      "author": "sarhoshamiral",
      "body": "Thank, it wasn't like I was feeling old already :P",
      "score": 1,
      "created_utc": 1745809302.0,
      "replies": []
    },
    {
      "id": "mpfdk53",
      "author": "BaffledInUSA",
      "body": "dang... now where did I put that 32mb usb drive?",
      "score": 1,
      "created_utc": 1745811102.0,
      "replies": []
    },
    {
      "id": "mpfiosr",
      "author": "Wiggles69",
      "body": ">Even the latest iPhone 16e, which is Apple’s latest budget model, is limited to USB 2.0 speeds.\n\nYou what?",
      "score": 1,
      "created_utc": 1745813402.0,
      "replies": []
    },
    {
      "id": "mpfj5xp",
      "author": "pjhoody",
      "body": "Spy thriller movies were never the same",
      "score": 1,
      "created_utc": 1745813624.0,
      "replies": []
    },
    {
      "id": "mpfpgio",
      "author": "Death_passed",
      "body": "Today I know that i am old, I was gonna say Winrar ^5",
      "score": 1,
      "created_utc": 1745816730.0,
      "replies": []
    },
    {
      "id": "mpfucrd",
      "author": "SigmaLance",
      "body": "Drives back then were crazy expensive.",
      "score": 1,
      "created_utc": 1745819352.0,
      "replies": []
    },
    {
      "id": "mpg1ke0",
      "author": "fusionsofwonder",
      "body": "One of my early IT jobs was hooking up PCs to a portable hard drive via a printer cable (multidirectional) and using that to setup PCs in the field.\n\nImagine using one of [these](https://www.uline.com/Product/Detail/H-1011/Zebra-Desktop-Barcode-Printers/6-ft-Parallel-Printer-Cable) to charge your phone.",
      "score": 1,
      "created_utc": 1745823638.0,
      "replies": []
    },
    {
      "id": "mpg9q87",
      "author": "putragease",
      "body": "I remember back in 2002 I was the only one in my class in my small town with a 128mb usb drive. It had a capacity wayyy larger than a 1.44mb floppy disk and was blazing fast for that day. I tell you I was the shit and everybody in my class wanted my pendrive 😆",
      "score": 1,
      "created_utc": 1745828943.0,
      "replies": []
    },
    {
      "id": "mpgso6b",
      "author": "mbergman42",
      "body": "Odd article in that it sort of pretends that USB 1.0 wasn’t a thing, wasn’t groundbreaking, wasn’t supported on Windows. USB 2.0 was certainly an improvement and could do more faster, but USB 1.0 brought the innovation of grouping multiple devices on a single connector. And 12 Mbps was kind of a big deal at that time. \n\nI get it that it’s USB 2.0’s birthday, it’s a little bit like one of the bridesmaids complaining that the wedding is all about the bride. But not even mentioning where 2.0 came from? USB 2.0 was incrementally better than 1.0, not something new that sprang out of the earth. Kind of odd.",
      "score": 1,
      "created_utc": 1745840012.0,
      "replies": []
    },
    {
      "id": "mpkcbyk",
      "author": "phoenixmatrix",
      "body": "And now we have USB3, erre USB-C, err USB3? Thunderbolt maybe? Does it charge? Is it a data cable? Why won't it work ou crap I needed one with alt mode display port, whoops.\n\n\nGod I hate these cables. I have a million of them and Im always missing the one I actually need.",
      "score": 1,
      "created_utc": 1745880884.0,
      "replies": []
    },
    {
      "id": "mprfnh4",
      "author": "Neo_Techni",
      "body": "I remember when it came out and I was glad the Dex Drive used a regular serial connector cause I didn't have USB. Now I don't have a serial connection on my PC and can't use the Dex Drive without breaking out a very old laptop. Though I have the PS3 memory card adapter and the smart PS1/PS2 memory card so it's not really needed anymore.",
      "score": 1,
      "created_utc": 1745974704.0,
      "replies": []
    },
    {
      "id": "mpej3wq",
      "author": "TheCoolOnesGotTaken",
      "body": "One of the head engineers on the USB architecture just passed away the weeks ago in fact. At his funeral they lowered his coffin down into the grave then raised it back out and turned it around then they lowered his coffin down into the grave then raised it back out and turned it around then they lowered his coffin down into the grave then raised it back out and turned it around then they lowered his coffin down into the grave then raised it back out and turned it around then they lowered his coffin down into the grave then raised it back out and turned it around then......",
      "score": 1,
      "created_utc": 1745799440.0,
      "replies": []
    },
    {
      "id": "mpfvn9q",
      "author": "a_o",
      "body": "Usb-C connector is trash.",
      "score": 1,
      "created_utc": 1745820082.0,
      "replies": []
    },
    {
      "id": "mpd87e7",
      "author": "Fre4kyGeek",
      "body": "Apple has only just discovered it, apparently",
      "score": 1,
      "created_utc": 1745783990.0,
      "replies": [
        {
          "id": "mpdszs2",
          "author": "bill-m",
          "body": "Apple is in no small part the reason that USB caught on. The original iMac only had USB ports and it caused an absolute boom in USB peripherals. This, in turn, caused an increase in popularity on PCs.",
          "score": 0,
          "created_utc": 1745790488.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpbq22w",
      "author": "Tribolonutus",
      "body": "And iPhone 16 still uses it",
      "score": -2,
      "created_utc": 1745767374.0,
      "replies": []
    },
    {
      "id": "mpbzepw",
      "author": "wirefixer",
      "body": "What was that yellow or blue cable called with both serial and parallel connectors called? Remember using them for computer to computer copying.",
      "score": 0,
      "created_utc": 1745770263.0,
      "replies": []
    },
    {
      "id": "mpchir8",
      "author": "dr-doom-jr",
      "body": "Soooo... why do we need to revolutionise data transfer? It works don't it?",
      "score": 0,
      "created_utc": 1745775752.0,
      "replies": []
    },
    {
      "id": "mpesxl0",
      "author": "ImpromptuFanfiction",
      "body": "USB2 was the bane of my existence as a nerdy middle schooler. So gd slow and I was the rare case with terabytes of data to transfer. FW800 drives were hella pricey",
      "score": 0,
      "created_utc": 1745803070.0,
      "replies": []
    },
    {
      "id": "mpcjarr",
      "author": "Cameront9",
      "body": "Still wish FireWire had won, it was the better standard.",
      "score": -1,
      "created_utc": 1745776275.0,
      "replies": []
    },
    {
      "id": "mpbjoys",
      "author": "None",
      "body": "[deleted]",
      "score": -2,
      "created_utc": 1745765363.0,
      "replies": [
        {
          "id": "mpbmtuh",
          "author": "FuckSteve7",
          "body": "This is so weird I was like how does this even relate to this post? And two posts after was the one about the remote zipper lol.",
          "score": 2,
          "created_utc": 1745766353.0,
          "replies": [
            {
              "id": "mpbol1p",
              "author": "YoungHeartOldSoul",
              "body": "I refuse to believe that I saw that post, scrolled, *then* wrote that comment on an unrelated post. I simply won't believe that.",
              "score": 1,
              "created_utc": 1745766907.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mpbm22f",
      "author": "wj333",
      "body": "The article said 25 years, but I thought that it should have been 52 years, then I realized 25 was actually correct.",
      "score": -2,
      "created_utc": 1745766110.0,
      "replies": []
    },
    {
      "id": "mpcl7hz",
      "author": "bobber18",
      "body": "I’m paying for AppleTV+ and I don’t know why.",
      "score": -2,
      "created_utc": 1745776845.0,
      "replies": []
    },
    {
      "id": "mpduck6",
      "author": "__BIFF__",
      "body": "Gay",
      "score": -2,
      "created_utc": 1745790929.0,
      "replies": [
        {
          "id": "mprfcef",
          "author": "Neo_Techni",
          "body": "No, USB 2.0 was a heterosexual connector. It wasn't until USB-C that it went both ways/bisexual.",
          "score": 1,
          "created_utc": 1745974605.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpdrw78",
      "author": "igby1",
      "body": "USB has resulted in a ridiculous amount of e-waste, confusion, and buying of too many cables.",
      "score": -3,
      "created_utc": 1745790131.0,
      "replies": [
        {
          "id": "mpfv3vs",
          "author": "Ned_Sc",
          "body": "That couldn't be further from the truth even if you tried.",
          "score": 3,
          "created_utc": 1745819776.0,
          "replies": [
            {
              "id": "mpfv5pb",
              "author": "igby1",
              "body": "Do tell",
              "score": 0,
              "created_utc": 1745819804.0,
              "replies": [
                {
                  "id": "mpfw9yl",
                  "author": "Ned_Sc",
                  "body": "Ignoring the obvious waste reduced by standardized devices that used USB for charging, all sorts of products used their own propitiatory cables. Digital cameras had their own cables, Mac and PC keyboards required active adapters, MP3 players, various toys, medical devices, every manufacturer was just out there winging it. People had drawers full of random cables, for fear of needing that one specific one. When you got rid of an old device, all the cables that went with it were basically useless. \n\nThere was no confusion with USB cables for USB 2.0. You only needed to see the physical connector to see if one side was USB-A or USB-B. USB 2.0 was still a 4 pin connector, just like USB 1.0 and 1.1. It wasn't until USB 3.0 that you actually had different cables, and worst case was that a 3.0 device would fall back to 2.0 speeds. \n\nUSB-C has some issues that could have been avoided with mandated labeling on the cables themselves, and using much saner naming/versioning for to consumers, but even then, USB-C helped replace all of the different chargers for higher powered devices like laptops.\n\nThe idea that it caused waste is just pants-on-head. Things were far worse before USB was around.",
                  "score": 2,
                  "created_utc": 1745820449.0,
                  "replies": [
                    {
                      "id": "mpfwhgc",
                      "author": "igby1",
                      "body": "Well it’s been a *long* time since it has been just USB 2.0. So I stand by my statement.",
                      "score": -2,
                      "created_utc": 1745820570.0,
                      "replies": [
                        {
                          "id": "mpfwwfj",
                          "author": "Ned_Sc",
                          "body": "This thread is about USB 2.0 turning 25 years old today.",
                          "score": 2,
                          "created_utc": 1745820816.0,
                          "replies": [
                            {
                              "id": "mpfx0vr",
                              "author": "igby1",
                              "body": "Celebrating something that led to confusion, e-waste, and too many cables",
                              "score": -2,
                              "created_utc": 1745820887.0,
                              "replies": [
                                {
                                  "id": "mpfxavd",
                                  "author": "Ned_Sc",
                                  "body": "You're an idiot.",
                                  "score": 2,
                                  "created_utc": 1745821051.0,
                                  "replies": [
                                    {
                                      "id": "mpfxkyi",
                                      "author": "igby1",
                                      "body": "Agree to disagree. Wish you nothing but the best in your life.",
                                      "score": 0,
                                      "created_utc": 1745821217.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mpmycb5",
                          "author": "bflaminio",
                          "body": "r/confidentlyincorrect",
                          "score": 2,
                          "created_utc": 1745923483.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mpbry88",
      "author": "None",
      "body": "#FUCK USB 2.0",
      "score": -10,
      "created_utc": 1745767962.0,
      "replies": []
    }
  ]
}