{
  "post": {
    "title": "Apple Pressed by India to Pre-Install Government Apps on iPhones",
    "author": "a_Ninja_b0y",
    "id": "1i9tx12",
    "score": 530,
    "created_utc": 1737830971.0,
    "selftext": "",
    "num_comments": 67,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i9tx12/apple_pressed_by_india_to_preinstall_government/"
  },
  "comments": [
    {
      "id": "m94vkj1",
      "author": "Zerokewl_22",
      "body": "iBharat coming soon 😁",
      "score": 175,
      "created_utc": 1737831266.0,
      "replies": [
        {
          "id": "m96ggw4",
          "author": "_RADIANTSUN_",
          "body": "iNdia",
          "score": 53,
          "created_utc": 1737848912.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m956o2f",
      "author": "SsooooOriginal",
      "body": "From the little I have gleaned of how they use tech over there, Indians use their phones for everything related to IDs and other paperwork type stuff.\n\n\nI know plenty of people here try to do the same already. I hate how quickly we are pushing sensitive info onto insecure devices so casually.",
      "score": 207,
      "created_utc": 1737834493.0,
      "replies": [
        {
          "id": "m96ez6n",
          "author": "UnkindPotato2",
          "body": "I don't give a shit what the app is, I want nothing but the OS and the app store installed on my device when I buy it. Honestly I don't even need the app store, you can just sideload if you decide you want it. \n\nWhen it comes to government apps, I *definitely* want that shit off my phone. The government can send me whatever I need as a hard copy, and that's perfect. Anything that must be kept secure must be kept offline",
          "score": 87,
          "created_utc": 1737848407.0,
          "replies": [
            {
              "id": "m96r16l",
              "author": "SsooooOriginal",
              "body": "Cool, anyways. India has already pressured Apple on making the devices on their soil, this is just further action by their conservative government. The fact that people are already comfortable and fine with using their phones exactly in the way you don't like means this will lilely happen and become normalized.\n\n\n\n\nI don't like the lack of privacy and security with tech but we are too late to effect change. Any device with an internal battery and communication capability is compromised by state level acessibility by now. And rather than work to fix this the people benefitting from it have successfully gotten many people hooked on lines like \"so you just gonna be amish or wut?\". And people lile you and me knee jerk whining about wanting pure devices when those do not exist in practicality. ",
              "score": 16,
              "created_utc": 1737852454.0,
              "replies": [
                {
                  "id": "m977ekj",
                  "author": "UnkindPotato2",
                  "body": "I mean, I care about government survailance, but honestly you're right that avoiding it is unattainable. They can motitor your device without installing anything locally, it's more of a bloatware issue. Furthermore, it's generally more concerning to me that people who *aren't* the government can access my sensitive information contained on government applications that are pre-installed and can't be uninstalled without taking some pretty drastic pain in the ass measures",
                  "score": 5,
                  "created_utc": 1737858080.0,
                  "replies": [
                    {
                      "id": "m9783sb",
                      "author": "SsooooOriginal",
                      "body": "You are not wrong, we are just unfortunately a minority amongst the masses that are largely ignorant of any potential dangers and risks from sensitive information processing apps being placed in devices as default.\n\n\nI care about thenprivacy and safety ramifications, as well as the gross bloatware restricting devices we are supposed to own but in reality we lease all the software and hardware.",
                      "score": 3,
                      "created_utc": 1737858324.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m992gmg",
              "author": "its_dash",
              "body": "You receiving a physical copy most likely means that they already have a version of it *online*.",
              "score": 2,
              "created_utc": 1737891456.0,
              "replies": []
            },
            {
              "id": "m9g14zq",
              "author": "Curse3242",
              "body": "Offline where? Honestly it's more secure on my mobile with these goverment made apps. It's quite handy actually. Don't have to carry a wallet at all these days. Just some money here & there. But not a whole wallet",
              "score": 1,
              "created_utc": 1737982889.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m95try3",
          "author": "None",
          "body": "Safety is just perception. SS numbers in the US were never meant to be secure and private yet here we are treating them like lock and keys to our private life. Nothing is safe, nothing is secure. We’re just using rocks and sticks out of fear instead of lasers. When my state lets me use my ID on my iPhone instead of my plastic shitty one, I’ll be happy. \n\nInstead of being afraid of the future, we should embrace change and fight for actual security and repercussions when it’s broken.",
          "score": 3,
          "created_utc": 1737841524.0,
          "replies": [
            {
              "id": "m9900sh",
              "author": "JSoppenheimer",
              "body": "I’m not even American, but the part about social security numbers feels eerily familiar.\n\n\nBut yeah, trying to keep those numbers secure is inherently a game that is doomed to failure through inevitable security breaches, and worst of all, you can’t really do much to protect yourself against that. We’ve already had cases where those numbers were stolen through either health service or vehicle registration databases.\n\nSo it’s kind of maddening that there isn’t a stronger push to demand stronger verification procedures in place of asking social security number.",
              "score": 3,
              "created_utc": 1737890035.0,
              "replies": []
            },
            {
              "id": "m95x1se",
              "author": "SsooooOriginal",
              "body": "Continuing to put the cart before the horse and expecting that to work is asinine. We are here because we embraced the future with no regard for security or repurcussions.",
              "score": -7,
              "created_utc": 1737842542.0,
              "replies": [
                {
                  "id": "m96mye6",
                  "author": "None",
                  "body": "So go live with the Amish? I mean what’s your point",
                  "score": 4,
                  "created_utc": 1737851095.0,
                  "replies": []
                },
                {
                  "id": "m9ge5t4",
                  "author": "ReallyRecon",
                  "body": "Why do we draw the line at insecure mobile devices when we already store this information on insecure desktop and laptop devices?\n\nI think an iPhone with its encryption and fully-transparent app permissions is a bit more secure than the average home PC.",
                  "score": 1,
                  "created_utc": 1737987670.0,
                  "replies": [
                    {
                      "id": "m9h2r13",
                      "author": "SsooooOriginal",
                      "body": "The phrase \"cart before the horse\" is going over some heads.\n\n\nAs far as the phone, you don't have the home pc with you everywhere you go.\n\n\nThe home pc is not necessarily more secure, which is another instance of the cart before the horse. But the home PC is not as highly competent as an observational vector like a compromised phone can be.\n\n\nI am not arguing anything is secure, I am arguing that is exactly the problem that needs to be dealt with rather than blindly charging on with little care of consequence and fully ignoring lessons we have already paid for in blood.\n\n\nThe government is aware. That is why fed computer skus will be the no wireless comm builds, because no PC with wireless capability is secure anymore.\nYou truly believe your iphone encryption is actually useful? ",
                      "score": 1,
                      "created_utc": 1737995108.0,
                      "replies": [
                        {
                          "id": "m9tw9sx",
                          "author": "ReallyRecon",
                          "body": "Yes, I think it's useful. Most consumers don't have any reason to fear someone trying to physically or remotely extract data from their device. It's an effective deterrent.\n\nThe software crack that the FBI bought from Israel years ago to bypass iOS encryption cost $1.3 million. The tools they use today to try to extract any usable data rarely work on the newer devices running iOS 18.\n\nYou say nothing is secure, but I don't really see any evidence of that. Most people's biggest concerns are their browsing habits and voluntarily giving up information because they don't know any better, and that's not a device security issue.",
                          "score": 1,
                          "created_utc": 1738162484.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m957558",
          "author": "Darkstar197",
          "body": "Nothing is secure anymore. China could shut down the united states power infrastructure tomorrow if they wanted to.",
          "score": -6,
          "created_utc": 1737834635.0,
          "replies": [
            {
              "id": "m96bdus",
              "author": "paloaltothrowaway",
              "body": "And we can retaliate similarly. Most of them are using American made software still. \n\nOn the same line of thought, Russia has enough nukes to obliterate everyone but we could also retaliate and wipe them out as well. ",
              "score": 8,
              "created_utc": 1737847200.0,
              "replies": []
            },
            {
              "id": "m95yff3",
              "author": "nicuramar",
              "body": "Probably not really. ",
              "score": 22,
              "created_utc": 1737842981.0,
              "replies": []
            },
            {
              "id": "m96juq1",
              "author": "munukutla",
              "body": "Heh. What.",
              "score": 1,
              "created_utc": 1737850055.0,
              "replies": []
            },
            {
              "id": "m957tx9",
              "author": "SsooooOriginal",
              "body": "Probably just Texas and parts of Cali, Russia has the east coast. Already done some extortion runs on gaslines.",
              "score": -17,
              "created_utc": 1737834841.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9boz49",
      "author": "our_winter",
      "body": "Because pre-installing the U2 album wasn’t a good test case already?",
      "score": 16,
      "created_utc": 1737922537.0,
      "replies": []
    },
    {
      "id": "m98p14u",
      "author": "None",
      "body": "[deleted]",
      "score": 13,
      "created_utc": 1737883364.0,
      "replies": [
        {
          "id": "m9d6psk",
          "author": "None",
          "body": "[deleted]",
          "score": 2,
          "created_utc": 1737937677.0,
          "replies": [
            {
              "id": "m9edm75",
              "author": "None",
              "body": "lol, I mean government authoritarian",
              "score": 2,
              "created_utc": 1737951275.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9dgtce",
      "author": "bonerb0ys",
      "body": "India tech is not doing great in general.",
      "score": 3,
      "created_utc": 1737940651.0,
      "replies": []
    },
    {
      "id": "m956t7y",
      "author": "None",
      "body": "The largest democracy in the world my ass.",
      "score": 64,
      "created_utc": 1737834536.0,
      "replies": [
        {
          "id": "m95ymez",
          "author": "nicuramar",
          "body": "Everything has nuance, but also, how is it relevant whether it’s a democracy or not? A democracy could also regulate phone manufacturers. ",
          "score": 65,
          "created_utc": 1737843042.0,
          "replies": [
            {
              "id": "m98j1s0",
              "author": "iamjkdn",
              "body": "You are an idiot if you think democracy means forcing Apple to install Indian apps.\n\nEdit: Not replying to all you idiots about democracy.  i guess snowden didn’t teach anyone the overreach of govts in the name of democracy. This is just bonkers.",
              "score": -37,
              "created_utc": 1737879707.0,
              "replies": [
                {
                  "id": "m98kg3e",
                  "author": "TimmyMTX",
                  "body": "You’re missing the point, they said being a democracy doesn’t affect this decision. You could democratically elect a government that promised an app on every smartphone, hell you could vote for it to be written into your constitution.",
                  "score": 20,
                  "created_utc": 1737880557.0,
                  "replies": [
                    {
                      "id": "m98l46w",
                      "author": "iamjkdn",
                      "body": "I think you are confusing democracy with surveillance.",
                      "score": -20,
                      "created_utc": 1737880976.0,
                      "replies": [
                        {
                          "id": "m98lvc4",
                          "author": "TimmyMTX",
                          "body": "With democracy, government is by the people - either directly or by their agents under a free election system. That’s literally all it means.\n\nThe people can choose whatever batshit rules they want - you can democratically decide to ban eating fruit for breakfast, forbid any form of communication that isn’t overseen by a censorship committee, or just to install cameras in every bathroom. Doesn’t matter what the rule is, democracy means it was decided by the people (directly or via elected representatives) rather than a monarch, a non-elected president for life, or any other number of -cracies.\n\nJust because you associate democracy with freedom doesn’t mean the two concepts are logically the same.",
                          "score": 9,
                          "created_utc": 1737881433.0,
                          "replies": []
                        },
                        {
                          "id": "m990rzg",
                          "author": "DeadEye073",
                          "body": "If there are 10 people on an island and 9 decide that the 10th should be beaten to death is cruel, the majority literally just elected a cruel decision, but since the majority decided to do it makes it democratic.\n\n  \nJust because it's bad or unmoral doesn't make it less democratic",
                          "score": 7,
                          "created_utc": 1737890480.0,
                          "replies": []
                        },
                        {
                          "id": "m98m5c0",
                          "author": "JudgeFondle",
                          "body": "Imagine this. A nationwide vote wherein a proposal is voted on by the people for the people, and that proposal is to have this government app pre installed on phones…..\n\nIs that what happened? No. But pretending democracy and surveillance are two mutually exclusive things is just being dense. India’s elected officials may be implementing policy you don’t like, but they’re still democratically elected.",
                          "score": 6,
                          "created_utc": 1737881603.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m98vmey",
                  "author": "nunyertz",
                  "body": "You’re an idiot.",
                  "score": 5,
                  "created_utc": 1737887384.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m95onja",
          "author": "ProgrammerPlus",
          "body": "It is though",
          "score": -17,
          "created_utc": 1737839964.0,
          "replies": [
            {
              "id": "m95p74s",
              "author": "iamnotexactlywhite",
              "body": "on paper",
              "score": 10,
              "created_utc": 1737840128.0,
              "replies": [
                {
                  "id": "m95vv62",
                  "author": "ProgrammerPlus",
                  "body": "so which is the largest democracy then in your \"expert\" opinion that no one gives a fuck about?",
                  "score": -20,
                  "created_utc": 1737842171.0,
                  "replies": [
                    {
                      "id": "m95w0sj",
                      "author": "iamnotexactlywhite",
                      "body": "why are you asking if nobody gives a fuck?",
                      "score": -3,
                      "created_utc": 1737842219.0,
                      "replies": [
                        {
                          "id": "m95xm8a",
                          "author": "ProgrammerPlus",
                          "body": "just to fuck with you",
                          "score": -20,
                          "created_utc": 1737842722.0,
                          "replies": [
                            {
                              "id": "m98val2",
                              "author": "Financial_Army_5557",
                              "body": "I fell off the chair when I read this comment lmao",
                              "score": 3,
                              "created_utc": 1737887185.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m99k27y",
          "author": "HeftyArgument",
          "body": "Largest by manner of population size, it’s nothing to be proud of.\n\nIf they chose any other form of government they’d be the largest version of that too.",
          "score": -2,
          "created_utc": 1737899676.0,
          "replies": []
        },
        {
          "id": "m977y61",
          "author": "_CMDR_",
          "body": "The election of Modhi has been a challenge to that fact.",
          "score": -10,
          "created_utc": 1737858271.0,
          "replies": [
            {
              "id": "m97p5ct",
              "author": "Playos",
              "body": "If your definition of democracy requires one party/person winning or losing, you don't like democracy, you just find  public support for your political positions convenient.",
              "score": 11,
              "created_utc": 1737864620.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m96uovz",
      "author": "ryeguymft",
      "body": "Modi is a dictator",
      "score": 18,
      "created_utc": 1737853684.0,
      "replies": []
    },
    {
      "id": "m963d1i",
      "author": "thisisfuxinghard",
      "body": "Just as democratic as USA will be in the next few years",
      "score": 4,
      "created_utc": 1737844561.0,
      "replies": []
    },
    {
      "id": "m976hp6",
      "author": "shwekhaw",
      "body": "India does not deserve the name largest democracy in the world.",
      "score": 3,
      "created_utc": 1737857758.0,
      "replies": []
    },
    {
      "id": "m964xce",
      "author": "figbott",
      "body": "Hahaha no.",
      "score": 2,
      "created_utc": 1737845065.0,
      "replies": []
    },
    {
      "id": "m99jwdy",
      "author": "HeftyArgument",
      "body": "wasn’t too long ago that they were so happy to be part of the iphone manufacturing process. i guess now we see if their market is powerful enough to sway daddy cook",
      "score": 1,
      "created_utc": 1737899614.0,
      "replies": []
    },
    {
      "id": "m95gc48",
      "author": "Imbecile_Jr",
      "body": "And since it's all about the money, Tim Cook will be happy to oblige. He can probably still taste Trump's ring in his mouth.",
      "score": -4,
      "created_utc": 1737837438.0,
      "replies": [
        {
          "id": "m95yune",
          "author": "nicuramar",
          "body": "Maybe so, but all companies have to comply with laws in the countries they operate.",
          "score": 3,
          "created_utc": 1737843114.0,
          "replies": [
            {
              "id": "m9f8dhj",
              "author": "Trang0ul",
              "body": "They don't have to, they choose to.",
              "score": 1,
              "created_utc": 1737967163.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9dm5ig",
      "author": "IronyInvoker",
      "body": "Terimaki chutiya app incoming.",
      "score": 0,
      "created_utc": 1737942312.0,
      "replies": []
    },
    {
      "id": "m96svyl",
      "author": "SuspiciousImpact2197",
      "body": "In the US it’ll soon be the christian bible (king James or NIV only) and we won’t be able to delete it.",
      "score": -6,
      "created_utc": 1737853080.0,
      "replies": []
    },
    {
      "id": "m97oya7",
      "author": "waloshin",
      "body": "Good teaches Apple not use slave labour to build their iPhones…",
      "score": -8,
      "created_utc": 1737864543.0,
      "replies": []
    },
    {
      "id": "m950ird",
      "author": "None",
      "body": "[removed]",
      "score": -54,
      "created_utc": 1737832695.0,
      "replies": [
        {
          "id": "m951hsh",
          "author": "HeirOfBreathing",
          "body": "that's what you think communism is?",
          "score": 49,
          "created_utc": 1737832977.0,
          "replies": [
            {
              "id": "m952h3j",
              "author": "None",
              "body": "[deleted]",
              "score": -6,
              "created_utc": 1737833260.0,
              "replies": [
                {
                  "id": "m95650v",
                  "author": "Caladbolg_Prometheus",
                  "body": "I really think you are mixing up totalitarian up with communism. Which to be fair the go-to examples of communism people usually cite, USSR and PRC were/are totalitarian.\n\nBut you don’t have to be communist to be totalitarian. Nazi Germany and Mussolini Italy was totalitarian and it was not communism. Burma/Myanmar I would say is totalitarian. \n\nYou might think I’m splitting hairs but if you think someone can’t be totalitarian because they hate communism you might inadvertently support someone quite despicable.",
                  "score": 16,
                  "created_utc": 1737834335.0,
                  "replies": [
                    {
                      "id": "m95estz",
                      "author": "i_need_a_moment",
                      "body": "Communism = anything that they perceive as evil according to these people.",
                      "score": 11,
                      "created_utc": 1737836968.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m955dh5",
                  "author": "NotMyUsualLogin",
                  "body": "I’ll repeat the same question: that’s what you think communism is?",
                  "score": 8,
                  "created_utc": 1737834109.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m952r7o",
          "author": "Rabo_McDongleberry",
          "body": "That's not communism... It's faschism.",
          "score": 27,
          "created_utc": 1737833342.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m96cj7g",
      "author": "None",
      "body": "[deleted]",
      "score": -8,
      "created_utc": 1737847585.0,
      "replies": [
        {
          "id": "m96kltr",
          "author": "TheCouchEmperor",
          "body": "That’s not what UI is.",
          "score": 3,
          "created_utc": 1737850305.0,
          "replies": [
            {
              "id": "m96kxt7",
              "author": "None",
              "body": "[deleted]",
              "score": -9,
              "created_utc": 1737850418.0,
              "replies": [
                {
                  "id": "m96l8qo",
                  "author": "TheCouchEmperor",
                  "body": "So how is your comment relevant in this context? \nBeing asked to preload apps is not part of changing the UI. \nIt’s a part of changing the UX.",
                  "score": 4,
                  "created_utc": 1737850520.0,
                  "replies": [
                    {
                      "id": "m96ltvd",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -6,
                      "created_utc": 1737850717.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}