{
  "post": {
    "title": "Maxell MXCP-P100 is a portable cassette player with modern features like Bluetooth and USB-C",
    "author": "diacewrb",
    "id": "1lo4gkw",
    "score": 1216,
    "created_utc": 1751280803.0,
    "selftext": "",
    "num_comments": 147,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lo4gkw/maxell_mxcpp100_is_a_portable_cassette_player/"
  },
  "comments": [
    {
      "id": "n0k580a",
      "author": "speculatrix",
      "body": "I was watching the TechMoan's YouTube channel  and he basically concluded that modern cassette player mechanisms are badly made junk. Some of the ones he tests don't even have stereo playback! \n\nOne example\n\nhttps://m.youtube.com/watch?v=1Cq-rkr_taU\n\n*Just when you think it couldn't get worse, mono tape head*\n\n*It would need to be 3x better than that to be complete crap!!*\n\n\n\nI'm not saying the one in the linked article is crap, but, I wouldn't be surprised.",
      "score": 248,
      "created_utc": 1751282587.0,
      "replies": [
        {
          "id": "n0k5mkz",
          "author": "r31ya",
          "body": "Apparently the only existing tape player parts manufacturer are the one producing not that good of quality tape player.\n\nBrand name might add features parts like good AMP or good bluetooth chipset, but the core tape part would be the same not so good one",
          "score": 108,
          "created_utc": 1751282774.0,
          "replies": [
            {
              "id": "n0k6nqi",
              "author": "internetlad",
              "body": "Yep. I get that nostalgia is a hell of a drug and I'm very into the idea that people want to preserve old ephemera, but this seems like a cash in on the trend. At the risk of sounding like a gatekeeper, you're better off repairing/retrofitting old quality tech because this is literally a case of \"don't make em like they used to\"\n\n\n(By the way, if you like these concepts of preserving things that weren't really made to be preserved, check out the podcast \"Ephemeral\". It's finished it's run, but it has discussions on so much niche cool shit that I wouldn't know about except for having tuned in.)",
              "score": 43,
              "created_utc": 1751283248.0,
              "replies": [
                {
                  "id": "n0kcb1a",
                  "author": "thisischemistry",
                  "body": "This isn't even nostalgia, it's young people buying this crap. They somehow think that old technologies are somehow good just because they are old. No, they are bad but that's all people had back then.",
                  "score": 26,
                  "created_utc": 1751285672.0,
                  "replies": [
                    {
                      "id": "n0lpua2",
                      "author": "-Badger3-",
                      "body": "I think they just think the old analog technologies are cool, and they probably appreciate the perspective it gives them and the connection it has to their parents/grandparents.\n\nIn my lifetime, I’ve gotten to see all these new technologies evolve, whereas for gen Z, everything’s kinda stagnated and just been digital flash storage and streaming practically their whole lives.",
                      "score": 29,
                      "created_utc": 1751301348.0,
                      "replies": [
                        {
                          "id": "n0luekb",
                          "author": "thisischemistry",
                          "body": "There's nothing wrong with analog signals, it's really the cassette media that is the issue here. Even in its heyday it wasn't great, tapes would rapidly decay and break. You'd have to clean the heads all the time to get good output and tapes would need to be replaced regularly. The motors, reels, and associated mechanisms would often cause a good amount of [wow and flutter](https://en.wikipedia.org/wiki/Wow_(recording\\)) as well as tangling, stretching, and breaking tapes.\n\nAnalog and digital technologies both have their flaws and their benefits. We need to look at the implementations and use them where they are appropriate.",
                          "score": 2,
                          "created_utc": 1751302656.0,
                          "replies": [
                            {
                              "id": "n0m2wml",
                              "author": "-Badger3-",
                              "body": "Nobody’s saying cassettes are more practical, I’m saying to a generation where everything has been digital, they’re just cool.\n\nIt’s a machine that when you press a heavy “click-clacking” button, spins some gears and moves a magnetic tape that plays music. It’s more personal because you actually have to curate your own music instead of letting an algorithm decide what to play for you.\n\nAnd people enjoy the ritual. It’s all the same reasons millennials still like vinyl. It’s the same reason some people prefer shaving with a straight razor and hand-throffed shaving cream.\n\nI think people appreciate having these tactile, imperfect moments because they feel more human. I don’t think it’s all about nostalgia, I think people are also rebelling against this feeling that technology has become overly-convenient and thoughtless.",
                              "score": 24,
                              "created_utc": 1751304983.0,
                              "replies": [
                                {
                                  "id": "n0n6fee",
                                  "author": "dood117",
                                  "body": "People are arguing with you and giving their takes, but this is exactly it. Its more than nostalgia. Physical media has real value. My stack of records and my record player make every listening session an activity to be enjoyed. What value does your Spotify Playlist have? Can you physically touch and interact with your Playlist like I can my records and tapes? Absolutely you cannot. Nostalgia is certainly part of it but its more than that now. It really is a rebellion against digital \"goods\" and the sterile feeling of listening to music pushed on you by some algorithm.",
                                  "score": 9,
                                  "created_utc": 1751316394.0,
                                  "replies": [
                                    {
                                      "id": "n0pev5r",
                                      "author": "projectfar",
                                      "body": "Value is a weird word to use. Do you mean tangible? Cause basically anything can have value. I would say my Spotify playlist has value since I’ve curated it and added songs that I find enjoyable. Someone else might not but that’s irrelevant to whether it has value to me or not.",
                                      "score": 3,
                                      "created_utc": 1751344442.0,
                                      "replies": [
                                        {
                                          "id": "n17nmls",
                                          "author": "dood117",
                                          "body": "I see what you mean. Vinyl has monetary value and is a tangible good. You can't resell or touch a Spotify Playlist. You can't display the artwork that is the album cover.",
                                          "score": 2,
                                          "created_utc": 1751583491.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "n0muril",
                                  "author": "Ajreil",
                                  "body": ">It’s more personal because you actually have to curate your own music instead of letting an algorithm decide what to play for you.\n\nYou can curate digital music by creating playlists or downloading MP3s and managing them yourself. I think this is less a limitation of the digital age and more than people have forgotten how to seek out content.",
                                  "score": -3,
                                  "created_utc": 1751312981.0,
                                  "replies": []
                                },
                                {
                                  "id": "n0mbhic",
                                  "author": "thisischemistry",
                                  "body": "We can have all that and still not need the magnetic tape which is the main issue. Replace it with something solid-state and you can still have the tactile buttons and curated cartridges.",
                                  "score": -8,
                                  "created_utc": 1751307355.0,
                                  "replies": [
                                    {
                                      "id": "n0mu5zg",
                                      "author": "parisidiot",
                                      "body": "you're missing the point. they don't want that. they're not looking for fidelity. they're looking for something that, to them, is *different*. to you it is *worse*. it's art, it doesn't need to be technically excellent.\n\nlook at photography. people LOVE polaroids. polaroids kinda look like shit, but they're fun. they like the lo-fi aesthetic. they don't want an instant camera that takes a perfect picture and prints it without defects. that's less fun.",
                                      "score": 9,
                                      "created_utc": 1751312804.0,
                                      "replies": [
                                        {
                                          "id": "n0nbz8k",
                                          "author": "10000Didgeridoos",
                                          "body": "I think also with older music there is something they get out of listening to it on formats it was available on at the time it was made. There is something to be said for listening to 80s synthy pop on a cassette tape or 60s/70s classic rock on a vinyl for that physical connection to the period and experiencing how someone your age then would have listened to it vs a remastered digital stream or file you just transiently tap on your phone while doing 5 other things on it.",
                                          "score": 5,
                                          "created_utc": 1751318000.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "n0nhl09",
                                      "author": "-Badger3-",
                                      "body": "I can’t inherit a box of those from my parents.",
                                      "score": 3,
                                      "created_utc": 1751319682.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "n0mufm1",
                                      "author": "Minamato",
                                      "body": "Bro you don’t get it",
                                      "score": 2,
                                      "created_utc": 1751312883.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "n0mr5ui",
                              "author": "QuerulousPanda",
                              "body": "you're kinda overstating how bad tapes were.\n\nyeah, they were problematic in some ways, but i had tapes for years growing up and they never \"rapidly decayed and broke\", and cleaning the heads was really not something you ever *had* to do. Everyone always knew that one tape player that would eat tapes, but otherwise they all tended to work, and keep on working. Wow and flutter may have been a bit of an issue for portable devices but even still, it was fine, no one cared if it got a little wobbly when you moved too quickly.\n\nI don't want to say they were perfect or anything like that, cd's were a revolution for a reason, but tapes were *fine*.",
                              "score": 4,
                              "created_utc": 1751311899.0,
                              "replies": [
                                {
                                  "id": "n0otoqx",
                                  "author": "FlyingBishop",
                                  "body": "Eh, vinyl has a lifespan of over 100 years. Tapes last 15-30 years. There's really nothing wrong with vinyl other than being inconvenient. Tape is not sturdy.",
                                  "score": 2,
                                  "created_utc": 1751335996.0,
                                  "replies": [
                                    {
                                      "id": "n0pbn3k",
                                      "author": "creeva",
                                      "body": "I don’t think they are arguing tapes are sturdy - that the quality was fine. No one is saying using them for long archival.  You quote the lifespan is 15-30 years.  The time between the Walkman and the iPod is 22 years.  I have tapes that still play that are over 40 years old (granted they hardly are played the last couple decades.  \n\nThe answer is the format was fine for what it was and for those that enjoy the ritual.",
                                      "score": 2,
                                      "created_utc": 1751342995.0,
                                      "replies": [
                                        {
                                          "id": "n0rhdpk",
                                          "author": "FlyingBishop",
                                          "body": "You have outliers, but the average lifespans are the average lifespans. You probably will have current vinyl that still plays 1000 years from now. I doubt that any tapes will be that durable. And the lack of durability translates into daily use; tapes do wear out pretty quickly, commonly.",
                                          "score": 0,
                                          "created_utc": 1751379713.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "n0v0kdz",
                                      "author": "Riegel_Haribo",
                                      "body": "I can put 35 year old cassette recordings in right now, and they sound just as they did. However the range of \"less distinguishable from CD than an MP3 from a digital rip\" was, with 1996 adjusted for today, $750 deck and $10 tapes.\n\nAnd EVERYTHING before 1980 is pretty much analog tape.",
                                      "score": 2,
                                      "created_utc": 1751417381.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "n0na9q7",
                              "author": "dale_glass",
                              "body": "There's a lot \"wrong\" with analog signals, it's precisely why we don't do much analog anymore.\n\nWith analog everything interferes. There's no precise clock signal, so wow and flutter are an effect of inaccurate tape speed. There's no error correction and precise tracking of things, so head misalignment can make stuff sound bad. Any kind of interference can make it into your audio, including motor noise. Analog always has the real world intrude into it somewhere, so a copy always loses quality.\n\nDigital basically makes everything perfect. 44.1 KHz/16 bit audio on CD came out in 1982 and is still perfectly good for playback.\n\nOf course it's not so terrible as to be unusable, but there's just no real reason to use analog. It's only got downsides to it.",
                              "score": 2,
                              "created_utc": 1751317494.0,
                              "replies": [
                                {
                                  "id": "n1unfc7",
                                  "author": "harkuponthegay",
                                  "body": "It depends on what you’re looking for — perfect lossless audio that sounds exactly the same as if  you were sitting in the recording studio in the same spot as the microphone the recorded it? \n\nThat’s one experience that modern digital recording technology makes it possible to get close to achieving, but even that is not exactly a 1-to-1 experience of sound, because it is more than just a function of how a sound is recorded, it matters how it is played back as well— are you wearing headphones, sitting in front of studio monitors, is there surround sound, is the room that you are listening to the recording in treated to prevent echoes other acoustic anomalies from reaching your ear due to the way the sound waves propagate in the space? \n\nThe same digital file played by different speakers in different rooms will sound different. Hell it will even sound different if you sit in a different spot relative to the speakers in the same room. \n\nThe fact of the matter is that it is not possible to recreate the experience of sitting in front of the instrument or person who is making the recording in real life, feeling the subtle vibrations the the instrument itself is making pass through your body and bounce off of objects in the room. This is why live music will always be a timeless and sought after way of experiencing music— nothing else is really identical. \n\nSo if you give up the notion of perfection and concede that a recording cannot ever achieve that result, you are then able to appreciate the unique quirks (and flaws) that each type of recording technology brings to a listening  experience as worthy of merit in their own right. Sometimes the “crackle” of vinyl or the hum of a motor moving a cassette tape becomes a part of the joy of those listening to music using that method— it brings people back in time to a different era and connects them in some way with the past. Polaroids are vastly inferior to taking a picture with your iPhone and yet still for many people the Polaroid is more fun. \n\nIt’s not about the pursuit of perfection (eliminating the barrier the technology present between what you see/head and reality) it’s about savoring the intangible distance between the two worlds that remind you that everything in this universe is ephemeral and nothing can be perfectly captured or frozen in time, we only get to glimpse the past, we can’t live in it. There’s a beauty in being reminded of that fact.",
                                  "score": 1,
                                  "created_utc": 1751913081.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "n0rqt1v",
                          "author": "kawag",
                          "body": "Well, we don’t have a skittles bag of physical media formats any more because we eliminated physical media, but there is still plenty of technological evolution happening today.\n\nThe speed at which AI is improving and new tools like video synthesis are emerging is shocking to me and I see it as evidence that we definitely haven’t slowed down. There’s even an argument that it may be happening too fast for human beings to keep up.",
                          "score": 1,
                          "created_utc": 1751382481.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n0l426u",
                      "author": "speculatrix",
                      "body": "Some old things are good because of survivor bias.\n\nLike the radio channels dedicated to 70s 80s or 90s. There were so many rubbish bands or rubbish tracks but have been mostly forgotten.\n\nLots of cars were just horrible, with no redeeming features. We mostly only notice the ones that were worth preserving.",
                      "score": 8,
                      "created_utc": 1751295033.0,
                      "replies": [
                        {
                          "id": "n0l5j7s",
                          "author": "thisischemistry",
                          "body": "> We mostly only notice the ones that were worth preserving.\n\nOr the ones which weren't used much so they didn't get the wear-and-tear of being left in the weather and driven through salty slush over lots of potholes!",
                          "score": 3,
                          "created_utc": 1751295465.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n0mvdc2",
                      "author": "neologismist_",
                      "body": "Cassette tape hiss. I’m good with digital and LP pops.",
                      "score": 5,
                      "created_utc": 1751313162.0,
                      "replies": [
                        {
                          "id": "n5a6a38",
                          "author": "RickyChanning",
                          "body": "Not if you have a player with Dolby. Tapes that are Dolby encoded sound really good on a player with Dolby NR.",
                          "score": 1,
                          "created_utc": 1753545120.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n0mtjae",
                      "author": "parisidiot",
                      "body": "they don't think they're good. they just think they're fun.\n\nkids have gotten really into lomography, 20 year old digital pocket cameras, etc. because they look different from phones and DSLRs, for example. they're not looking for perfect. they're looking for something distinct.\n\nthere is also a subculture around tape collecting. there are small indie labels that only release music on tape. it's fun! like, only derranged 40 year old audiophiles think vinyl sounds better, whereas the vinyl resurgence is kids buying it.",
                      "score": 3,
                      "created_utc": 1751312618.0,
                      "replies": [
                        {
                          "id": "n48fut8",
                          "author": "iamnotevenhereatall",
                          "body": "I'm an older person and all the above mentioned mediums for different reasons. There is the nostalgia factor for both cassette and vinyl. Then there is the fact that they are one function devices. I get tired of being so distracted and pulled in different directions.\n\nI love digital because it's basically the highest quality you can get with absolutely no interference. I bought a Sony NW-A306 and I love that thing and I do use it. However, at the end of the day, it's an android device. I had to lock the thing down with app pinning to make it the one function device I wanted. Even with doing that, my brain still knows it's capable of more and that bothers me.\n\nAnyway, I get people wanting to correct others, but it's frankly a waste of time. People will believe what they want to believe and it won't be until they decide to face their delusions that they will figure it all out. It won't through some curmudgeon online ranting and raving about how cassette fidelity sucks.",
                          "score": 1,
                          "created_utc": 1753046899.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n0p9kry",
                      "author": "MrDLTE3",
                      "body": "Some old tech was pretty good like CRTs. Made a comeback before high refresh rate flatscreens were a thing even.",
                      "score": 2,
                      "created_utc": 1751342120.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n0n4vdr",
                  "author": "NeuHundred",
                  "body": "Agreed, fix the old shit but also don't be dependent on it.  Anything you run on it you should make a digital backup of.",
                  "score": 2,
                  "created_utc": 1751315941.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0mwirt",
          "author": "FrizzIeFry",
          "body": "My first thought was \"looking forward to the Techmoan video\"",
          "score": 12,
          "created_utc": 1751313498.0,
          "replies": []
        },
        {
          "id": "n0n9l5z",
          "author": "Autisticus",
          "body": "Agreed. I have one of these, if not a similar unit, and the bluetooth spontaneously disconnects and it's a bear to bind the headphones back to it. It's a bummer.",
          "score": 3,
          "created_utc": 1751317299.0,
          "replies": []
        },
        {
          "id": "n0nr7c8",
          "author": "Qwirk",
          "body": "This is an excellent example of why competition is a good thing. Back during their heyday, cassette players were going through a ton of competition as major brands were vying for your purchase. Now it's a niche market with no competition so you aren't going to get the same level of quality.",
          "score": 3,
          "created_utc": 1751322757.0,
          "replies": []
        },
        {
          "id": "n0nytv7",
          "author": "cat_prophecy",
          "body": "There's only like one company that still makes tap mechanisms and they are awful. Also love Techmoan.",
          "score": 3,
          "created_utc": 1751325292.0,
          "replies": []
        },
        {
          "id": "n0ktfb3",
          "author": "calvinwho",
          "body": "Aren't tapes better for long term storage? Even digital stuff can be saved on them so it surprises me no one is still doing this well enough to make a walkman.",
          "score": 7,
          "created_utc": 1751291780.0,
          "replies": [
            {
              "id": "n0l5hal",
              "author": "speculatrix",
              "body": "It's not the tape, the mechanisms are poorly made which causes speed inconsistencies leading to wow and flutter.\n\nI imagine the mechanisms are cheap copies of cheap copies.\n\nWhen Philips invented the compact cassette, it was for office dictation machines, not music. Technical advances meant it became possible for high end tape decks to be able to record audio from 20hz to 20khz with a relatively flat response and imperceptible wow and flutter. Noise suppression systems from Dolby (B and C) or the lesser known dbx meant the dynamic range was good enough. Those high end units would be over £1000 in today's money.",
              "score": 22,
              "created_utc": 1751295450.0,
              "replies": []
            },
            {
              "id": "n0l6v7f",
              "author": "thisischemistry",
              "body": "It depends. You *can* get magnetic tape which is specially formulated and stabilized so that it doesn't lose data and physical qualities over time. If you store those in special environments with protection from light, temperature extremes, and moisture then they can last a good amount of time.\n\nHowever, the usual mass-market cassettes aren't that great and they can leak their magnetic fields between successive layers, as well as lose the ability to hold onto the magnetic domains, and degrade the plastic tape so that it sticks, stretches, or tears. Also, if you're using the tape then every use will significantly accelerate that degradation.\n\nThere are much better mediums and formats for long-term storage but you have to choose between a balance of cost, ease-of-use, durability, and so on. Archival quality digital tapes are a great balance between all of those, at least for the medium-long term.",
              "score": 7,
              "created_utc": 1751295856.0,
              "replies": []
            },
            {
              "id": "n0lvy6q",
              "author": "Hungry_Horace",
              "body": "They have a finite shelf life unless you keep them in some super-stable archiving environment.  Most tapes from the 90s and earlier are now fairly degraded with terrible flutter/wow and noise.  Even digital tapes suffer - older camcorder formats like DV are passing the threshold of playback.\n\nThe only ones that seem to be surviving are DATS, which is odd as they were regarded as pretty fragile at the time.\n\nSource: I have a LOT of all of these and have been digitising them over the last few years.\n\nIf we want to bring back something retro, let's bring back MiniDISC!!  Far more reliable, far higher sound quality, the same \"make mixtape and give copies to mates\" experience.",
              "score": 4,
              "created_utc": 1751303085.0,
              "replies": [
                {
                  "id": "n0m0s1z",
                  "author": "calvinwho",
                  "body": "Fuck yeah Mini Disc! I got one when I was stationed in Germany and it was the first thing like it. Got me through all my deployments",
                  "score": 6,
                  "created_utc": 1751304401.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0lcxkn",
              "author": "PurpleCaterpillar82",
              "body": "I always thought they could become de-magnetized. I have a bunch of old tapes and tried to play them on various players and they all sound un-playable now",
              "score": 2,
              "created_utc": 1751297624.0,
              "replies": [
                {
                  "id": "n0ldfz8",
                  "author": "calvinwho",
                  "body": "Oof. Sounds like my dad trying to play 8 tracks in the 90s. Most of the time you'd get most of the way into a song and the machines would eat the tapes every time",
                  "score": 4,
                  "created_utc": 1751297774.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0ln4qg",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1751300570.0,
              "replies": [
                {
                  "id": "n0lp97r",
                  "author": "calvinwho",
                  "body": "Not sure what you're implying here. This is something I learned a while ago, and apparently has some truth, but it seems too costly for the regular user. I assure you I have a very real, regular human penis, thank you",
                  "score": 3,
                  "created_utc": 1751301180.0,
                  "replies": [
                    {
                      "id": "n0lv0n0",
                      "author": "thisischemistry",
                      "body": "> it seems too costly for the regular user. I assure you I have a very real, regular human penis\n\nI have no idea about the comment you're replying to but I'm just going to take this bit out of context and chortle over it.",
                      "score": 3,
                      "created_utc": 1751302825.0,
                      "replies": [
                        {
                          "id": "n0m1mig",
                          "author": "calvinwho",
                          "body": "Some weird implication I might be a bit or ai or some for shit. My Grammer is shitty, sure, but my vernacular is spot on stupid american",
                          "score": 2,
                          "created_utc": 1751304632.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0pa24k",
              "author": "cosmos7",
              "body": "> Aren't tapes better for long term storage?\n\nNope.",
              "score": 1,
              "created_utc": 1751342322.0,
              "replies": []
            },
            {
              "id": "n0ppblg",
              "author": "alidan",
              "body": "tapes are fantastic for storage, you write to them and if you pull the data off, you toss out the tape and get a new one because you can't/shouldn't trust that tape ever again, but in terms of long term storage, amazeing.",
              "score": 1,
              "created_utc": 1751349650.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0lgr3j",
          "author": "reid0",
          "body": "Even if it were good, it’s still tape. Hssssssss was  about a third of the sound even on the good decks back when you could buy good ones.",
          "score": 3,
          "created_utc": 1751298731.0,
          "replies": [
            {
              "id": "n0m2set",
              "author": "speculatrix",
              "body": "A decent tape deck, good quality tape, and using the full dynamic range meant that hiss wasn't much of a problem. Also, because it was constant, our brains would learn to ignore it. \n\nMpeg compression artifacts are a much worse thing than tape hiss. It's why people prefer a good stereo radio broadcast than a low bit rate DAB radio signal.",
              "score": 5,
              "created_utc": 1751304950.0,
              "replies": [
                {
                  "id": "n0mjxsf",
                  "author": "kindall",
                  "body": "Dolby C noise reduction (or dbx or maybe Dolby S if you're fancy) and Dolby HX Pro on a Maxell Metal Vertex cassette ain't nothing to sneeze at\n\nedit: forgot about Dolby S!",
                  "score": 7,
                  "created_utc": 1751309814.0,
                  "replies": [
                    {
                      "id": "n0nq21m",
                      "author": "speculatrix",
                      "body": "Yes, you could make excellent recordings. \n\nHX pro wasnt noise reduction, but a way to make the bias more dynamic to optimise the frequency response.\n\nhttps://beoworld.org/dolby-hx-pro/",
                      "score": 1,
                      "created_utc": 1751322380.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n0w97ly",
                  "author": "syncpulse",
                  "body": "Mpeg doesn't stretch,  wear out or lose quality when copied.  You also don't get bleed through from the song on the other side. All issues I have personally experienced with tape. ",
                  "score": 0,
                  "created_utc": 1751435230.0,
                  "replies": [
                    {
                      "id": "n0wfqmr",
                      "author": "speculatrix",
                      "body": "Agreed, provided you don't decompress and recompress, by only copying the original file, you only get one hit to the quality.\n\nI'm not saying tape is great by modern standards, but, it could be pretty good for its time .",
                      "score": 0,
                      "created_utc": 1751438755.0,
                      "replies": [
                        {
                          "id": "n0wgpqm",
                          "author": "syncpulse",
                          "body": "Exactly for its time. I just question the need for thid kind of device in 2025 except maybe archival purposes. I don't understand this recent reemergence of the cassette.",
                          "score": 0,
                          "created_utc": 1751439295.0,
                          "replies": [
                            {
                              "id": "n0xh2if",
                              "author": "speculatrix",
                              "body": "Yup, it's a weird nostalgia thing. People also buy vinyl records. Many have no way of playing them!",
                              "score": 0,
                              "created_utc": 1751458329.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n0o5fzx",
          "author": "mangage",
          "body": "This one actually states it supports stereo audio. If it really has a stereo head that would make it far better than any recently released deck.",
          "score": 1,
          "created_utc": 1751327451.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0kftaa",
      "author": "relentlessmelt",
      "body": "Magnetic tape over Bluetooth… why would you do this to your ears?",
      "score": 77,
      "created_utc": 1751287051.0,
      "replies": [
        {
          "id": "n0ld4wi",
          "author": "PurpleCaterpillar82",
          "body": "🤣",
          "score": 10,
          "created_utc": 1751297685.0,
          "replies": [
            {
              "id": "n0mzy3f",
              "author": "TheAmbiguity",
              "body": "I am probably the minority in this, but it would allow me to listen to my tapes while doing chores and move around without having to deal with wires or bulk as opposed to blasting it out of an amp, which is what I have to work with.",
              "score": 8,
              "created_utc": 1751314506.0,
              "replies": [
                {
                  "id": "n0n96mc",
                  "author": "rkan665",
                  "body": "I'm guessing your tapes are either mixtapes or stuff that's not easy to find on streaming.",
                  "score": 5,
                  "created_utc": 1751317184.0,
                  "replies": [
                    {
                      "id": "n0ng17o",
                      "author": "TheAmbiguity",
                      "body": "Yeah, I have PlexAmp that has a backup of everything, but I haven't ripped my stuff off of tape yet, one day I'll get there",
                      "score": 2,
                      "created_utc": 1751319209.0,
                      "replies": [
                        {
                          "id": "n0noz9z",
                          "author": "rkan665",
                          "body": "What genre? Punk?",
                          "score": 2,
                          "created_utc": 1751322034.0,
                          "replies": [
                            {
                              "id": "n0nrpyj",
                              "author": "TheAmbiguity",
                              "body": "drone, ambient, experimental, etc",
                              "score": 2,
                              "created_utc": 1751322928.0,
                              "replies": [
                                {
                                  "id": "n0o0ark",
                                  "author": "rkan665",
                                  "body": "Gotcha.",
                                  "score": 2,
                                  "created_utc": 1751325766.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n48h9jl",
                  "author": "iamnotevenhereatall",
                  "body": "I'm right with you. And honestly, not everything is about having the absolute best quality. Sometimes, it's about being completely present with the music. I find that hard to do with digital devices. Maybe my ipod was the closest thing to doing that. Even with that it was a bit of a distraction. One album at a time, one device, I appreciate that format",
                  "score": 2,
                  "created_utc": 1753047349.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n0krcq5",
      "author": "Chilling_Demon",
      "body": "I wish MiniDisc would make a comeback.",
      "score": 67,
      "created_utc": 1751291128.0,
      "replies": [
        {
          "id": "n0kzpsi",
          "author": "Microharley",
          "body": "I wanted a mini disc player so bad when I was younger. By the time I had adult money, the iPod was dominating the market.",
          "score": 27,
          "created_utc": 1751293736.0,
          "replies": [
            {
              "id": "n0ld3te",
              "author": "PurpleCaterpillar82",
              "body": "Same bro. The idea is still cool to me",
              "score": 9,
              "created_utc": 1751297676.0,
              "replies": []
            },
            {
              "id": "n0nplby",
              "author": "Chilling_Demon",
              "body": "Yeah, that’s pretty much what happened to me, too. My brother had a minidisc player as part of a stereo system in his house - I remember loving the album boxes for the discs, as well as the discs themselves.",
              "score": 2,
              "created_utc": 1751322230.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0ned0y",
          "author": "Ijustdoeyes",
          "body": "r/minidisc",
          "score": 3,
          "created_utc": 1751318707.0,
          "replies": [
            {
              "id": "n0o6o18",
              "author": "KFlaps",
              "body": "Hell yeah! Thank you",
              "score": 2,
              "created_utc": 1751327862.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n12wz1j",
          "author": "schwing710",
          "body": "I still have a shoebox full of minidiscs in my closet but I lost the player 20 years ago",
          "score": 1,
          "created_utc": 1751522269.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0kwcjv",
      "author": "Practical-Custard-64",
      "body": "Probably the same cheap junk cassette mechanism from one of the only two(?) manufacturers of these things left in the world. Wow and flutter off the charts because there's no mass to the cheap, plastic and/or aluminium flywheel.",
      "score": 21,
      "created_utc": 1751292700.0,
      "replies": []
    },
    {
      "id": "n0kitdf",
      "author": "blue-coin",
      "body": "What I really want it a modern cassette _recorder_. More specially, I was a modern multitrack cassette recorder like a Tascam Portastudio",
      "score": 17,
      "created_utc": 1751288177.0,
      "replies": [
        {
          "id": "n0l7iko",
          "author": "thisischemistry",
          "body": "Why, though? Record to a good-quality digital file and it will be more faithful to the original than most analog recorders. No need for multi-tracking since digital files don't need to be stored in physical proximity to each other, it's all done in software.",
          "score": 2,
          "created_utc": 1751296045.0,
          "replies": [
            {
              "id": "n0liuz9",
              "author": "blue-coin",
              "body": "I make music all day in a DAW. There’s just a workflow with tape that is different. You’re forced to focus on the performance. And also I like being able to make music out of a computer. I have owned all sorts of multitrack recorders over the years from 4 track cassette to 32 channel digital.",
              "score": 7,
              "created_utc": 1751299332.0,
              "replies": [
                {
                  "id": "n0mvvso",
                  "author": "Redeem123",
                  "body": "> There’s just a workflow with tape that is different\n\nIt's this 100%.\n\nI know it's a meme at this point, but there is something to the tactile nature of something \"real.\" Vinyl records, film photography, tape recording... all of it can basically be 100% recreated by digital tools now. However there is still something to be said for the benefit of having to take a little intentional effort.\n\nI've recorded to tape, and it's about a million times less convenient than using a DAW. But the act of rewinding the tape, getting the room ready, then knowing that the next five minutes were going to be a take, regardless of what happens, then listening back to it... it added to the performance.\n\nNow overdubs and edits... give me digital all day. I don't miss splicing tape.",
                  "score": 4,
                  "created_utc": 1751313311.0,
                  "replies": [
                    {
                      "id": "n0mxack",
                      "author": "blue-coin",
                      "body": "Yes! You get it. The OP-1 for example has a 4 track digital recorder that emulates recording on tape, and it is absolutely fantastic. I mean there is something charming about recording to real cassette or tape, but I would take a modern digital multitrack recorder if it had a recording workflow like the OP-1",
                      "score": 3,
                      "created_utc": 1751313722.0,
                      "replies": []
                    },
                    {
                      "id": "n0r7995",
                      "author": "caerphoto",
                      "body": "> However there is still something to be said for the benefit of having to take a little intentional effort.\n\nEspecially so for artists, where the act of creation is a very significant percentage of the *point*. Sure, the end result is obviously important, but how you get there is part of the artistic journey, it’s part of an artist’s motivation to keep going.",
                      "score": 2,
                      "created_utc": 1751376508.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0ndjzg",
              "author": "kanrad",
              "body": "The model I have has both cassette and an SD port, also has an out you can send to a digital device for recording.",
              "score": 2,
              "created_utc": 1751318465.0,
              "replies": []
            },
            {
              "id": "n0lea15",
              "author": "Level-Suspect2933",
              "body": "people spend good money on daw plugins that emulate all kinds of analog formats so it stands to reason that eventually some people are going to want the real deal.",
              "score": 2,
              "created_utc": 1751298019.0,
              "replies": []
            },
            {
              "id": "n0n2b0v",
              "author": "Pudge511",
              "body": "So nobody should ever paint again? Or make art? Or experiment with anything physical? You really just don't get creative effort do you?",
              "score": 2,
              "created_utc": 1751315195.0,
              "replies": [
                {
                  "id": "n0nc9y4",
                  "author": "thisischemistry",
                  "body": "Overreacting a bit are we? We can still record music, do art, film movies. The difference is using the tool that best suits the artform.\n\nWhen recording music you can completely capture the music digitally and analog adds very little, if anything, to the process. Do a bit of research on digital signal capture and understand the theory before you go to such extremes.",
                  "score": 2,
                  "created_utc": 1751318088.0,
                  "replies": [
                    {
                      "id": "n0ncqkt",
                      "author": "Pudge511",
                      "body": "I make music using entirely analog processes, to say it adds very little is just wrong. You don't get to decide what tool best suits any art form, it's art.",
                      "score": 2,
                      "created_utc": 1751318225.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0mucl8",
              "author": "parisidiot",
              "body": "yeah, why would anyone want to shoot film? or write a handwritten letter?",
              "score": 1,
              "created_utc": 1751312859.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0ndane",
          "author": "kanrad",
          "body": "Still have mine, works fine too",
          "score": 1,
          "created_utc": 1751318389.0,
          "replies": [
            {
              "id": "n0o7m7g",
              "author": "blue-coin",
              "body": "Same, I have a couple. Oldest is a Porta One. Only thing it’s needed is a new belt.",
              "score": 1,
              "created_utc": 1751328185.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0l1jev",
      "author": "InvertedEyechart11",
      "body": "I'll just continue to use my Sony Sports Walkman ngl",
      "score": 5,
      "created_utc": 1751294286.0,
      "replies": []
    },
    {
      "id": "n0kdbt7",
      "author": "thisischemistry",
      "body": "But why?\n\nCompared to modern digital players, a cassette player is nothing but downsides. Cassette tapes would tangle, break, distort, had *terrible* sound quality, awkward to use, held limited audio, and so on. There's a reason that people couldn't drop this technology fast enough once there were decent alternatives.\n\nAt least put a bit of digital storage on this device and a controller that can play audio off that. It would probably add less than $10 to the device and it would make it so much more useful since you could use a cassette *and* digital if you wanted.",
      "score": 29,
      "created_utc": 1751286083.0,
      "replies": [
        {
          "id": "n0kf5gd",
          "author": "MadOrange64",
          "body": "Nostalgia baiting. It does look cool though.",
          "score": 17,
          "created_utc": 1751286800.0,
          "replies": []
        },
        {
          "id": "n0kz34b",
          "author": "gene_harro_gate",
          "body": "Niche … but likely a decent enough demographic of people out there with boxes of old live recordings on cassette (think Dead, ABB, Phish, WSP, etc) that would be interested. This might seem like less hassle that converting everything to digital",
          "score": 8,
          "created_utc": 1751293545.0,
          "replies": [
            {
              "id": "n0l58f2",
              "author": "thisischemistry",
              "body": "If you have these types of recordings and you care about them then you should prioritize converting them to digital. Those old magnetic tapes have significant bleeding of the magnetic fields and degradation of the physical tape. They will tend to stick, stretch, and tear.\n\nI agree, back in the day those magnetic tapes were great for recording, mixing, and copying music but they have been surpassed by better means of doing such things. Those recordings would significantly degrade in less than a decade, never mind 40 or 50 years. I wouldn't dare put anything that old into a portable player, instead I'd be looking at an archival service to recover and preserve them as best as possible.",
              "score": 5,
              "created_utc": 1751295378.0,
              "replies": []
            },
            {
              "id": "n0v16bd",
              "author": "Riegel_Haribo",
              "body": "If you have a box of old cassettes, this junk is the LAST thing you should be buying. A Teddy Ruxpin likely has a better cassette deck.",
              "score": 1,
              "created_utc": 1751417596.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0kg23e",
          "author": "pwnersaurus",
          "body": "Yes, growing up with cassettes, they were just the worst, vastly prefer digital any day of the week. But I wonder if people who grew up with vinyl LPs feel the same way about how people idealise them…I guess for the average person, LPs were easy to damage and hard to transport and store, not the best quality either unless everything is done perfectly",
          "score": 5,
          "created_utc": 1751287146.0,
          "replies": [
            {
              "id": "n0kj6yl",
              "author": "thisischemistry",
              "body": "I understand the desire for vinyl records but there's nothing inherently better about that format, either. Vinyl is an imperfect medium which has distortion from the original music, it just happens to be a pleasant distortion which has a warm tone to it. We could get the same effect with a digital filter, if we chose to do that.\n\nNow, there are other advantages of vinyl that I appreciate. For example, liner art and the various materials they used to produce the record. It can be nice to have physical materials to handle and appreciate. However, we *could* do the same with digital music if we made them into modules which could be physically handled and stored.",
              "score": -1,
              "created_utc": 1751288315.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n1kzio4",
          "author": "Smurfsville",
          "body": "Because maybe you have a cassette or two or ten lying around and you wanna play them every once in a while without putting up with YouTube ads. Not everything is nostalgia bait. Not everyone wants to play Revolver on these things. \n\nAlso, what's with the condescending tone? Don't you think there's value in being able to listen to Revolver without paying 10 dollars a month?",
          "score": 2,
          "created_utc": 1751775175.0,
          "replies": [
            {
              "id": "n1l2iwq",
              "author": "thisischemistry",
              "body": "No condescension, just facts. \n\nIf someone cares about their cassette collection then the best thing they could do is to find some way to digitize it. Cassettes lying around tend to lose their quality and become more fragile, playing them hastens this process. I agree that buying media once is a good value but you have to protect that investment and not just trust it will always be in good condition.\n\nI have done just this in the past, used my audio outs to digitize analog formats so I'll have them for longer.",
              "score": 1,
              "created_utc": 1751776613.0,
              "replies": [
                {
                  "id": "n1mjn91",
                  "author": "Smurfsville",
                  "body": "Yeah but sometimes you're just walking around, you run into a music store, you buy a cassette and you play it. Don't you miss that feeling? it's magical! I bought a discman last year in order to do just that and 1) discs are insanely expensive here in Japan because for some fucking reason everyone is still buying them and every new record comes out as a CD and they're like 30 USD 2) discman devices are really prone to skipping 3) disks are easily scratched. ",
                  "score": 2,
                  "created_utc": 1751805711.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0kvluy",
          "author": "delicious-croissant",
          "body": "With any other tech, try and give a friend a “mix tape” that lasts 30 plus years…",
          "score": 2,
          "created_utc": 1751292466.0,
          "replies": [
            {
              "id": "n0l3qtx",
              "author": "thisischemistry",
              "body": "I have digital files from more than 30 years ago that are still the same quality as the day they were recorded. Any physical magnetic tape from that era will have significantly degraded in both data and physical qualities.\n\nThe smart thing to do is to convert those old analog magnetic recordings to digital formats. Yes, there is a cost associated with doing this because you either need to get equipment or sent it to a service but you'll now have a file which is much more durable and long-lived.",
              "score": 5,
              "created_utc": 1751294941.0,
              "replies": [
                {
                  "id": "n0sfjgg",
                  "author": "delicious-croissant",
                  "body": "I have 50 year old audio cassettes my grandparents sent me that play fine on cheap and available equipment .  It is the low tech and forgiving fidelity that makes tape the audio equivalent of the ak47.  Sure back it up digitally ; however digital media is fraught with complexity that obstructs access and usability.",
                  "score": 2,
                  "created_utc": 1751389342.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0l03kw",
          "author": "ronimal",
          "body": "Maybe so people with cassettes can play them?",
          "score": 2,
          "created_utc": 1751293851.0,
          "replies": []
        },
        {
          "id": "n0kz90k",
          "author": "MoonOut_StarsInvite",
          "body": "I have a bunch of DJ mix tapes from the rave days and bootlegged concerts from the snail-mailing cassette days. There are applications other than just new music, but also nostalgia",
          "score": 1,
          "created_utc": 1751293595.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0kzf3s",
      "author": "chrisdh79",
      "body": "$90 and only available in Japan. Not something I would go out and buy anyway.",
      "score": 4,
      "created_utc": 1751293647.0,
      "replies": [
        {
          "id": "n1kzx27",
          "author": "Smurfsville",
          "body": "Used casette players are insanely expensive in Japan. The reason being: there's no new manufacturers but a lot of demand. Why is there so much demand? Well, you've got book offs and hard offs everywhere selling these awesome casette tapes that you can buy for cheap and maybe discover some ancient piece of music that will most likely not be available on YouTube or Spotify and even if it was what's the fucking point of just googling every song one by one when you can just pay 1 or 2 dollars and listen to all of them ad-free on the spot. But there's just one problem: How the fuck are you going to play these tapes?",
          "score": 2,
          "created_utc": 1751775361.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0kqrxw",
      "author": "toddywithabody",
      "body": "I collect Vinyl and Blu-Rays. I work in a record store and even understand CD’s. I absolutely do not understand why anyone would want a cassette or VHS. I lived through that time, they were awful formats then. You should be nostalgic for the content not the medium.",
      "score": 12,
      "created_utc": 1751290937.0,
      "replies": [
        {
          "id": "n0p43kn",
          "author": "spilk",
          "body": "it sounds counterintuitive, but I think people like it because it sucks. not everything has to be pristine.",
          "score": 3,
          "created_utc": 1751339908.0,
          "replies": [
            {
              "id": "n0rd3ws",
              "author": "LordKwik",
              "body": "that's exactly what's going on. everything that has been digitized has this level of detail to it that makes it almost too perfect. it's why people are buying 2000s disposable cameras, tube TVs, CDs, flip phones, etc. \n\nit's very much a \"gen z movement\" which is fueled by growing up in an era of increasing perfection, and searching for something tangible and connected to our level of human error. we're all suckers for nostalgia, but gen z and after hardly got to experience life before HDR and 4k and HD audio. \n\nmillennials and older got to experience these things and know the flaws of this old tech, which is why we're not that interested in going back, but the youngins hardly/never got to experience that. I can't really blame them for wanting to experience something authentic.",
              "score": 1,
              "created_utc": 1751378411.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0l7lk6",
      "author": "Oiggamed",
      "body": "Sweet. I can finally listen to my Phish bootlegs again.",
      "score": 3,
      "created_utc": 1751296070.0,
      "replies": []
    },
    {
      "id": "n0lbtww",
      "author": "Hello_I_hate_it",
      "body": "This is a plus for the low budget music scene. Most tape consumers (currently) are rockers and show goers. Many bands have their entire record on tape.",
      "score": 3,
      "created_utc": 1751297303.0,
      "replies": []
    },
    {
      "id": "n0n7pdo",
      "author": "jsamuraij",
      "body": "This is dumb.",
      "score": 3,
      "created_utc": 1751316762.0,
      "replies": []
    },
    {
      "id": "n0mn9ie",
      "author": "ashtefer1",
      "body": "To the people confused why cassettes: Family! Physical media is tangible, and can be held, it’s not about the audio quality it’s about the sentimental value that your parents/grandparent enjoyed these albums in this form, and if someone gifted you something from their parents collection, there’s a lot of value to that.",
      "score": 4,
      "created_utc": 1751310760.0,
      "replies": []
    },
    {
      "id": "n0kp3ym",
      "author": "Melodic-Comb9076",
      "body": "cool, but in what scenario does a cassette tape trump digital medium?\n\nit’s not like a record/album, where there is better sound.",
      "score": 2,
      "created_utc": 1751290378.0,
      "replies": [
        {
          "id": "n0leon6",
          "author": "Level-Suspect2933",
          "body": "there are lots of times where i want the some or all aspects of the music i’m making to have the characteristics of an imperfect analogue format. plugins are fine, but it’s a similar difference to a filtered (often accurately) photograph and the same image made with, say, 35mm film.",
          "score": 3,
          "created_utc": 1751298137.0,
          "replies": [
            {
              "id": "n0lhvyl",
              "author": "Melodic-Comb9076",
              "body": "ok…totally get it.  thank you for the different lens that i need to look through.\n\nthat said, from a business perspective, how many of you are out there…..and out of those, how many have expendable income to actually pull the trigger on buying gone of those?\n\ni love music…(actually used to work for a major label early in my career here in hollywood)…and i was definitely interested in the return of albums.  read up on it, was interested, but i didn’t pull the trigger.\n\nso it makes me wonder how many would even be sold worldwide.  \n\nthanks again for the reply.",
              "score": 2,
              "created_utc": 1751299053.0,
              "replies": [
                {
                  "id": "n0oogq1",
                  "author": "MattInSoCal",
                  "body": "I’d probably buy one. I still have my auto-reverse Walkman I bought in the early 80’s, and at least 60 mixtapes that might be unplayable now.",
                  "score": 1,
                  "created_utc": 1751334138.0,
                  "replies": [
                    {
                      "id": "n12674h",
                      "author": "Pudge511",
                      "body": "Just fix the Walkman, way better quality than these modern ones.",
                      "score": 2,
                      "created_utc": 1751510512.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0nf0uv",
              "author": "SafeModeOff",
              "body": "Why not make the music digitally, record it to a tape, then record it back to digital, thus capturing the analog imperfections while still having the modern format?",
              "score": 1,
              "created_utc": 1751318905.0,
              "replies": [
                {
                  "id": "n0pc256",
                  "author": "thisischemistry",
                  "body": "No need to go through those convoluted steps. The limitations of analog recordings are fairly well-understood and pretty easy to mimic with simple digital filters.",
                  "score": 1,
                  "created_utc": 1751343176.0,
                  "replies": [
                    {
                      "id": "n0px3pv",
                      "author": "Level-Suspect2933",
                      "body": "it’s easy to mimic but hard to get right, i think. recording straight to cassette is a nice shortcut to a great sounding effect almost every time. it’s also fun.",
                      "score": 3,
                      "created_utc": 1751354039.0,
                      "replies": [
                        {
                          "id": "n0qvnzi",
                          "author": "thisischemistry",
                          "body": "It's not as difficult as people think. Human sense of hearing is actually quite poor, signal-wise, and you don't need much to mimic the kinds of artifacts we can hear in analog magnetic tape recordings.\n\nI certainly can understand using tricks like that to mimic the sound as a hobbyist but there are much better ways to do it as a professional.",
                          "score": 1,
                          "created_utc": 1751372388.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n0pwqm6",
                  "author": "Level-Suspect2933",
                  "body": "yeah, i do that all the time! that’s the kind of scenario i’m talking about. it’s also nice to release things on cassette.",
                  "score": 1,
                  "created_utc": 1751353825.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0p30cc",
          "author": "BrokenEffect",
          "body": "I have a cassette tape from some obscure band that I can’t find anywhere else.\n\nI want to listen to it.\n\nBoom.",
          "score": 1,
          "created_utc": 1751339484.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0mpphu",
      "author": "robaroo",
      "body": "Literal cassette futurism!!!",
      "score": 2,
      "created_utc": 1751311469.0,
      "replies": []
    },
    {
      "id": "n0knsdk",
      "author": "1leggeddog",
      "body": "I'll just use my OG Sony Walkman.",
      "score": 1,
      "created_utc": 1751289927.0,
      "replies": [
        {
          "id": "n1yyi1s",
          "author": "Lorfarius",
          "body": "they've had really poor OS's of late.",
          "score": 1,
          "created_utc": 1751975741.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0lx3d1",
      "author": "DumpsterBaby-Suicide",
      "body": "As someone who’s recently started collective vinyl again. I’ve noticed The vinyl cassette and cd communities are still around. Vinyl might be more popular butt still. People buy cassettes and cds and artists still put them out.",
      "score": 1,
      "created_utc": 1751303398.0,
      "replies": []
    },
    {
      "id": "n0m693e",
      "author": "None",
      "body": "I was searching Amazon for something similar in April.",
      "score": 1,
      "created_utc": 1751305890.0,
      "replies": []
    },
    {
      "id": "n0mmo71",
      "author": "A_Living_Pool_Noodle",
      "body": "To make the argument for cassettes in 2025, my exes car only had a radio and a cassette player. Thus began the process of sourcing and recording onto cassettes to make her some mixtapes. I feel like a player without a recording feature is pointless, especially since the last cassettes being used are in vintage cars.",
      "score": 1,
      "created_utc": 1751310593.0,
      "replies": []
    },
    {
      "id": "n0n74m8",
      "author": "cp5184",
      "body": "It would be cool if it could use digital recording as well as traditional analog, so if it could store an mp3 file on the cassette and play it back.",
      "score": 1,
      "created_utc": 1751316595.0,
      "replies": [
        {
          "id": "n0p4ewa",
          "author": "spilk",
          "body": "you would probably have to run the tape at a higher speed to get enough bandwidth to store an acceptable-quality MP3 file. kinda like how those [cassette-tape video recorders worked](https://en.wikipedia.org/wiki/PXL2000).",
          "score": 1,
          "created_utc": 1751340032.0,
          "replies": [
            {
              "id": "n0p70ji",
              "author": "cp5184",
              "body": "Apparently they could hold about 600MB at most?  Assuming 90 mins, I think that's ~113kB which should be OK for audio I think.  We can probably do better but that should work.",
              "score": 1,
              "created_utc": 1751341072.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0nfuu3",
      "author": "SafeModeOff",
      "body": "I get it, physical media is cool, and some people are bigger fans of it than me. As long as no one tries to tell me it’s better quality, then I can agree to live and let live",
      "score": 1,
      "created_utc": 1751319155.0,
      "replies": []
    },
    {
      "id": "n0nt5h4",
      "author": "xXgreeneyesXx",
      "body": "Ah yes, the good ol Tanashin clone. I can guarantee you, this is a shitty player with probably less shitty electronics glued on.",
      "score": 1,
      "created_utc": 1751323406.0,
      "replies": []
    },
    {
      "id": "n0oo3kr",
      "author": "PokePress",
      "body": "I picked up a Fiio CP13 last year after having issues with a refurbished Walkman. While it’s not possible to get top-of-the line performance from new cassette players, there are ways to make the performance at least acceptable (your mileage may vary) by adding in things like a metal flywheel, which I hope this is using given its cost. \n\nDecent is what folks are looking for, with a bit of novelty. It’s interesting to be able to hold 60-90 minutes of audio in the palm of your hand and be able to tell what it is.",
      "score": 1,
      "created_utc": 1751334007.0,
      "replies": []
    },
    {
      "id": "n0p0t4i",
      "author": "Secret_Cow_5053",
      "body": "….why",
      "score": 1,
      "created_utc": 1751338633.0,
      "replies": []
    },
    {
      "id": "n0p7hzc",
      "author": "spilk",
      "body": "but will Maxell start making their tapes again?",
      "score": 1,
      "created_utc": 1751341270.0,
      "replies": []
    },
    {
      "id": "n0r2h5z",
      "author": "snowflake37wao",
      "body": "do the home alone one in mini for cassette recorder next!",
      "score": 1,
      "created_utc": 1751374891.0,
      "replies": []
    },
    {
      "id": "n1ddjce",
      "author": "SummerPrincess95",
      "body": "Kids of today would have no idea what this is just looking at it first hand",
      "score": 1,
      "created_utc": 1751663315.0,
      "replies": []
    },
    {
      "id": "n0mvb89",
      "author": "imperialmoose",
      "body": "Good god let cassettes die. Annoying, shitty tech. ",
      "score": 1,
      "created_utc": 1751313144.0,
      "replies": []
    },
    {
      "id": "n0qb3bz",
      "author": "bucky_ballers",
      "body": "Funny how I remember clearly how shit tapes were even back then, but somehow still covet this",
      "score": 0,
      "created_utc": 1751362513.0,
      "replies": []
    },
    {
      "id": "n0qby0n",
      "author": "zjciprazz",
      "body": "Available for in person viewing  at your nearest hipsters.",
      "score": 0,
      "created_utc": 1751363009.0,
      "replies": []
    },
    {
      "id": "n0r7mfj",
      "author": "Craig1974",
      "body": "What is this rejection of innovation? Cassettes are lo fi and not a good format for pristine sound.",
      "score": 0,
      "created_utc": 1751376628.0,
      "replies": []
    },
    {
      "id": "n0ks3lf",
      "author": "Fancyness",
      "body": "No thanks ",
      "score": -2,
      "created_utc": 1751291366.0,
      "replies": []
    }
  ]
}