{
  "post": {
    "title": "Sony’s next flagship noise-canceling headphones might be close to launch | An FCC filing may have given us our first look at Sony’s WH-1000XM6 headphones, including the possibility of detachable earpads.",
    "author": "chrisdh79",
    "id": "1i8xlgz",
    "score": 679,
    "created_utc": 1737731556.0,
    "selftext": "",
    "num_comments": 210,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i8xlgz/sonys_next_flagship_noisecanceling_headphones/"
  },
  "comments": [
    {
      "id": "m8xnn46",
      "author": "updownkarma",
      "body": "Make them pair effortlessly with the Sony PlayStation maybe?",
      "score": 81,
      "created_utc": 1737736435.0,
      "replies": [
        {
          "id": "m8zeeso",
          "author": "JustHereForTheMemeza",
          "body": "If I remember correctly, this has been an ask since the PS3 but the Bluetooth band is prioritized to ensure a string connection for the controller",
          "score": 43,
          "created_utc": 1737754026.0,
          "replies": [
            {
              "id": "m91gk2q",
              "author": "Lake_Erie_Monster",
              "body": "Fine, stream it through the controller.",
              "score": 0,
              "created_utc": 1737778780.0,
              "replies": [
                {
                  "id": "m9bor2n",
                  "author": "BillMillerBBQ",
                  "body": "I don’t know why people downvoted you for this, but this is Reddit so I dog piled on you too.",
                  "score": 1,
                  "created_utc": 1737922474.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8x9yks",
      "author": "eras",
      "body": "Wish they hadn't degraded the foldability of those headphones. Giving me less reason to update from my good ol' XM2. With once fixed cracked earpad connection.\n\nSurprisingly the battery still works fine!",
      "score": 243,
      "created_utc": 1737732612.0,
      "replies": [
        {
          "id": "m8yo4r4",
          "author": "ArchusKanzaki",
          "body": "Being honest, foldability is overrated. As long as the case profile is still similar, being able to fold it flat is better for longevity of the hinge. And the case profile do be similar.\n\nWith that said, My XM4 I got for free from credit card sign-up is still basically perfect for me. I don't see much reason to buy XM5 or XM6 just for the hinge.",
          "score": 56,
          "created_utc": 1737746549.0,
          "replies": [
            {
              "id": "m8z6k1k",
              "author": "eras",
              "body": "I though have a backpack where the XM2 fits folded on its pouch. Can't imagine it fitting in without the ability to fill in that big empty space in the center.",
              "score": 21,
              "created_utc": 1737751804.0,
              "replies": []
            },
            {
              "id": "m8zwjrq",
              "author": "TheMagicalSock",
              "body": "I love my trusty XM4s.",
              "score": 10,
              "created_utc": 1737759340.0,
              "replies": []
            },
            {
              "id": "m9149um",
              "author": "Revenge-of-the-Jawa",
              "body": "I started with the 5 but honestly wish water resistance was added\n\nIf these have that (unlikely) I‘d be tempted to",
              "score": 2,
              "created_utc": 1737774027.0,
              "replies": []
            },
            {
              "id": "m93b8ox",
              "author": "GuyWithLag",
              "body": "My XM4 are still going great, I just had to replace the padding, and it's as new.",
              "score": 1,
              "created_utc": 1737814274.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8xdbmg",
          "author": "DBrEmoKiddo",
          "body": "Dude I sold my xm2 to buy xm4 regret, gave away and bought a xm3.\nNot only the folding issue but they removed aptx, sound sucks over bluetooth on xm4 and above.",
          "score": 33,
          "created_utc": 1737733569.0,
          "replies": [
            {
              "id": "m8xiq2l",
              "author": "bokewalka",
              "body": "I have my XM3 for years and not only the battery holds pretty well, but I love them, even more on a plane.",
              "score": 31,
              "created_utc": 1737735087.0,
              "replies": [
                {
                  "id": "m8y6c5r",
                  "author": "finlandery",
                  "body": "Changing battery on xm3 is really easy. Highly recommend, if your battery starts to get old instead buying new headphones. Its like 15min job even when looking youtube video for how to do it, and you only need small philips and something thin and sturdy to open plastic clips.",
                  "score": 16,
                  "created_utc": 1737741595.0,
                  "replies": []
                },
                {
                  "id": "m8yqh6q",
                  "author": "suprememau",
                  "body": "Same XM3 its been one of the best purchases i did still going strong",
                  "score": 6,
                  "created_utc": 1737747209.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8yncsm",
              "author": "ArchusKanzaki",
              "body": "If you are on Android, LDAC is way better than AptX and iirc, its available for everyone\n\nIf you are on Iphone, their AAC implementation is honestly alot better than on Android's. I only sorta notice the difference with LDAC on Android at least",
              "score": 13,
              "created_utc": 1737746332.0,
              "replies": [
                {
                  "id": "m8z8get",
                  "author": "DBrEmoKiddo",
                  "body": "Yeah LDAC is awesome. I use a mac. It's been a minute since I tried AAC. I force aptx always.\nMaybe it got better. When I bought xm3 I still had my xm4 and listening side by side it distorted on a certain levels and lost dinamic even on lower levels.\nThe day I got xm4 I use my android to tested and loved, probaly was on LDAC. Thats why I boiled down to the codec. Since 99% of the time I use it on my mac it simply was not going to cut for me.",
                  "score": 4,
                  "created_utc": 1737752339.0,
                  "replies": []
                },
                {
                  "id": "m8zyps2",
                  "author": "plumzki",
                  "body": "LDAC is great for phone use but honestly as someone who uses wireless to pc, aptx LL was always a must for me before now, the newer LC3+ codec with low latency mode fills that spot for me now, so if they release it with LC3+ it might be worth looking into for me.",
                  "score": 2,
                  "created_utc": 1737760012.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8yg3u4",
              "author": "nukem996",
              "body": "LDAC is significantly better but Apple refuses to support it. Luckily Android and Linux come with out of the box support.",
              "score": 8,
              "created_utc": 1737744313.0,
              "replies": []
            },
            {
              "id": "m8yg3to",
              "author": "HanzoNumbahOneFan",
              "body": "Weird I haven't had issue with the sound quality over bluetooth with my XM4s. It sounds pretty much the same when wired. Maybe I don't have an audiophile's ear though.",
              "score": 6,
              "created_utc": 1737744312.0,
              "replies": [
                {
                  "id": "m8z6tpj",
                  "author": "DBrEmoKiddo",
                  "body": "Yeah, and thats ok. I gave my xm4 to a friend of mine and she don't hear the difference either. For reference I do music production, amateurish but still. I have studio monitors in my desk.\nWhen you don't know what you should be listening its super hard to catch the differences.\nMy problem I was thinking I was upgrading and got a downgrade of quality.",
                  "score": 1,
                  "created_utc": 1737751879.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m91yvhw",
              "author": "The_JSQuareD",
              "body": "XM4 still folds. I have had the XM3 for years, and recently bought the XM4 for work. Basically identical design, but the XM4 has some additional features.",
              "score": 0,
              "created_utc": 1737787661.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8yr4a4",
          "author": "andysor",
          "body": "My xm2s are still fantastic! I mostly use my wf1000 xm4 as daily drivers, but the other day I took out my wm xm2 after 6 months of no use, and the battery was still high!",
          "score": 3,
          "created_utc": 1737747389.0,
          "replies": []
        },
        {
          "id": "m8ykxcy",
          "author": "IB_Yolked",
          "body": ">Wish they hadn't degraded the foldability of those headphones.\n\nAs someone who owns both, the size profile of the case is essentially the same. The sound quality upgrade is significant and noticeably better too, not sure what the other guy is talking about.",
          "score": 2,
          "created_utc": 1737745651.0,
          "replies": []
        },
        {
          "id": "m91fw72",
          "author": "baldycoot",
          "body": "Yeah. I get really annoyed with myself if I go fly and forget my xm4s. They still hold days of battery charge and I’ve had them for years now. I’ll upgrade when Sony re-introduce folding.",
          "score": 2,
          "created_utc": 1737778505.0,
          "replies": []
        },
        {
          "id": "m8yocyl",
          "author": "None",
          "body": "[deleted]",
          "score": 2,
          "created_utc": 1737746613.0,
          "replies": [
            {
              "id": "m8z6tyu",
              "author": "eras",
              "body": "What do you use NFC for? I suppose you re-pair (hah) them often?",
              "score": 3,
              "created_utc": 1737751881.0,
              "replies": [
                {
                  "id": "m8z7cvp",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1737752030.0,
                  "replies": [
                    {
                      "id": "m8z8ev4",
                      "author": "eras",
                      "body": "I'd rather want it to just be able to connect to multiple devices at the same time :/. Apparently XM4 can do it for two devices.",
                      "score": 1,
                      "created_utc": 1737752327.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8ze7it",
          "author": "No-Way3802",
          "body": "I owned multiple pairs that broke at that hinge, so I hope they stick with durability over portability",
          "score": 1,
          "created_utc": 1737753969.0,
          "replies": []
        },
        {
          "id": "m8zudk7",
          "author": "WalnutWhipWilly",
          "body": "Also still wearing the XM2s, they work very well. All I ever see in the Sony headphones sub are people posting pictures of broken joints on the XM5s - to the extent people on the sub recommend the XM4s as “the” model to buy;  the. m5s were not a very well thought out or user friendly concept. This thinking/approach to design would make me sceptical about any further models without some good reviews.",
          "score": 1,
          "created_utc": 1737758679.0,
          "replies": []
        },
        {
          "id": "m90eq88",
          "author": "Expln",
          "body": "Bro, totally unrelated question, but I am desperate, is there a way at all to purchase original replacement pads for the XM3 headphones? mines are SO worn out and I cannot find the original ones.\n\nmy headphones work perfectly fine but the pads are basically a dead body.",
          "score": 1,
          "created_utc": 1737765171.0,
          "replies": [
            {
              "id": "m96j9uz",
              "author": "FlattenInnerTube",
              "body": "Look on eBay. Plenty of them there.",
              "score": 1,
              "created_utc": 1737849861.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m90zu5y",
          "author": "xindianx5",
          "body": "Still using my XM2. Battery life is great still wear them everyday to the gym and on frequent flights. Finally switched out the ear pads with replacements from amazon. Don’t see myself upgrading unless they stop working",
          "score": 1,
          "created_utc": 1737772424.0,
          "replies": [
            {
              "id": "m926zqx",
              "author": "eras",
              "body": "I already once had a scare that they'd be broken, as they started pausing themselves. But it was just the weather.\n\nMaybe the (capacitive?) touch interface wasn't the best idea.",
              "score": 1,
              "created_utc": 1737792487.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m91ysas",
          "author": "Game0nBG",
          "body": "I still use daily my XM1s. Changed the pads from AliExpress last year. Still going strong.",
          "score": 1,
          "created_utc": 1737787612.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8x8etq",
      "author": "Sicnics",
      "body": "i use the xm5's daily. For listening to youtube their great. The only feature that would make existing owners worth upgrading is if the bluetooth audio was better quality when the mic is in use but i think it might be a limitation of bluetooth. Otherwise their top notch.",
      "score": 88,
      "created_utc": 1737732169.0,
      "replies": [
        {
          "id": "m8xavpv",
          "author": "DrBhu",
          "body": "The headset got 2 channels. When you use the mic one channel will be used for that.\n\n\nThere are bt chips which got 3 channels. (And i think rhey already where a thing when the headset came out.)\n\n\nI would like to see them waterproof; I had a hard time when I discovered that my 400 bucks headset cant take slightly rain.)",
          "score": 24,
          "created_utc": 1737732878.0,
          "replies": [
            {
              "id": "m8xh5ca",
              "author": "toastbot",
              "body": ">I had a hard time when I discovered that my 400 bucks headset cant take slightly rain.\n\nHear this Sony? Perfect chance to bring back the 90's Sony SPORTS line! A water-resistant version of these in gloss-yellow with gray accents could be an amazing niche/throwback design! Make a version for April Fool's and see the response you get!",
              "score": 13,
              "created_utc": 1737734645.0,
              "replies": [
                {
                  "id": "m8zxp8h",
                  "author": "DrBhu",
                  "body": "Atleast splash-proof would be nice. Every other producer seems to have no problem making their expensive headsets water/splashproof.\n\nAnd weirdly the automatic-noise supression (which should check in which environment it should turn up/down the noise cancelling) is getting worse every day; I had to switch to manual because it started to do the opposite of its job.",
                  "score": 4,
                  "created_utc": 1737759695.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8zi1u5",
              "author": "CeeCee123456789",
              "body": "This! I can't risk wearing them outside in these 100°F summers.",
              "score": 1,
              "created_utc": 1737755054.0,
              "replies": []
            },
            {
              "id": "m92a0i1",
              "author": "Ezaal",
              "body": "Tbh my xm2 might aswell be advertised as waterproof. Been using them heavily since their original release and still work great. Even tho I’m using them while cycling in the rain, and it rains a lot here. ",
              "score": 1,
              "created_utc": 1737794366.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8xaasi",
          "author": "gonfishn37",
          "body": "5s don’t fold flat! Right? Can we get that back?",
          "score": 37,
          "created_utc": 1737732709.0,
          "replies": [
            {
              "id": "m8xbrcb",
              "author": "BigLan2",
              "body": "They earpieces fold flat, but only in one direction (so you can lay them on a table), but they don't fold up towards the headband to make them more compact.\n\n\nThey come with a decent case though, but it's just bulky.",
              "score": 24,
              "created_utc": 1737733129.0,
              "replies": [
                {
                  "id": "m8yonub",
                  "author": "ArchusKanzaki",
                  "body": "The case that comes default with XM4 is also pretty bulky though. Its not that different from XM5's. Unless you are a fan of folding both earcups to pack them without case, the added durability of not needing to fold one side to pack them into the default case probably better for majority of user.",
                  "score": 3,
                  "created_utc": 1737746699.0,
                  "replies": []
                },
                {
                  "id": "m8xh3v7",
                  "author": "labe225",
                  "body": "Yeah, that is one of my biggest complaints. It's not a huge issue for me since I typically don't have much in my backpack, but it's a bit more of a challenge if both my wife and I want to pack everything into one backpack.",
                  "score": 3,
                  "created_utc": 1737734633.0,
                  "replies": [
                    {
                      "id": "m8yovs1",
                      "author": "ArchusKanzaki",
                      "body": "Do you fold both cups and pack them without case? I'm pretty sure the default case for XM4 and XM5 is pretty similar.",
                      "score": 3,
                      "created_utc": 1737746761.0,
                      "replies": [
                        {
                          "id": "m8yr1ml",
                          "author": "labe225",
                          "body": "Nope, they stay in the case. The XM4 case is slightly smaller since the headphones can fold up a bit more than the XM5. Volume wise the case is about 40% larger for the XM5.",
                          "score": 2,
                          "created_utc": 1737747368.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8xeeuv",
          "author": "tenemu",
          "body": "Is that why selecting headphones over headset makes it sound so much better??",
          "score": 8,
          "created_utc": 1737733877.0,
          "replies": [
            {
              "id": "m8xfs01",
              "author": "Sicnics",
              "body": "[https://www.bluetoothgoodies.com/a2dp/faq/?h=6d923b67&v=01040201&osv=10.0.22631.3085#microphone](https://www.bluetoothgoodies.com/a2dp/faq/?h=6d923b67&v=01040201&osv=10.0.22631.3085#microphone)  \nthat article details the issue with bluetooth headsets....When the headset microphone is enabled it swaps to a HFP driver which has mono audio not sure if thats the case with newer headsets.",
              "score": 8,
              "created_utc": 1737734260.0,
              "replies": [
                {
                  "id": "m8xhf1g",
                  "author": "narwhal_breeder",
                  "body": "It is the case with newer headsets - its why gaming headsets all use dongles. The Bluetooth spec has lagged behind.",
                  "score": 14,
                  "created_utc": 1737734721.0,
                  "replies": [
                    {
                      "id": "m8zbhfp",
                      "author": "FlorydaMan",
                      "body": "Do AirPods do this too?",
                      "score": 1,
                      "created_utc": 1737753202.0,
                      "replies": [
                        {
                          "id": "m8zeqo9",
                          "author": "narwhal_breeder",
                          "body": "Yes.",
                          "score": 1,
                          "created_utc": 1737754119.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8xiot0",
                  "author": "alyosha_pls",
                  "body": "Its the case with my momentum 4's.",
                  "score": 1,
                  "created_utc": 1737735077.0,
                  "replies": []
                },
                {
                  "id": "m8zy0zq",
                  "author": "DrBhu",
                  "body": "I had a cheapo bt headset before I bought the sony, and the cheapo headset already had 3 channels. (Just digged it out to test it.)\n\nSo it was just sony being cheap on the bluetooth chip.",
                  "score": 0,
                  "created_utc": 1737759797.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8xs9jy",
              "author": "makemeking706",
              "body": "Yes.",
              "score": 1,
              "created_utc": 1737737704.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8xmsmf",
          "author": "OnboardG1",
          "body": "I would love them more but they irritate my ears due to the geometry of the pads. Not sure why but I’ve had the issue with other headphones too. If I wear them for a long flight I get itchy ears for a couple of days after.",
          "score": 5,
          "created_utc": 1737736204.0,
          "replies": [
            {
              "id": "m8zy9ij",
              "author": "DrBhu",
              "body": "You could be allergic against the softeners used in the earpads, you should check this at your doctor. (If you live in a civilized country where healthcare is free)",
              "score": 2,
              "created_utc": 1737759871.0,
              "replies": [
                {
                  "id": "m92ilsu",
                  "author": "OnboardG1",
                  "body": "No, I’m not allergic to that. If that were the case I’d have a reaction around my ear where the pad touches as well as just on the helix. They just don’t fit my ears well. I’ve seen a couple of comments over the years on that.",
                  "score": 2,
                  "created_utc": 1737799799.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8xderv",
          "author": "Rengax",
          "body": "Totally agree, only time I get annoyed is when I try to use Siri and it sounds like straight out of a tin can",
          "score": 2,
          "created_utc": 1737733593.0,
          "replies": []
        },
        {
          "id": "m8y9gwl",
          "author": "waffles153",
          "body": "Hopefully BT6 will fix some of this",
          "score": 2,
          "created_utc": 1737742468.0,
          "replies": []
        },
        {
          "id": "m8yul22",
          "author": "Last_Competition3132",
          "body": "It begs the question - why did they bother with the mic at all? I’ve tried to use it with MS Teams. Both the sound and mic quality are unusable. I love my xm4’s for listening to music, but it’s unfortunate that I have to swap to a headset to take a call.",
          "score": 2,
          "created_utc": 1737748371.0,
          "replies": [
            {
              "id": "m8z0k7g",
              "author": "only_remaining_name",
              "body": "Interesting. I use mine every day at the office and love them for calls.",
              "score": 1,
              "created_utc": 1737750090.0,
              "replies": [
                {
                  "id": "m8z7k5g",
                  "author": "Nyoka_ya_Mpembe",
                  "body": "Your listeners may have different experience ;)",
                  "score": 2,
                  "created_utc": 1737752088.0,
                  "replies": [
                    {
                      "id": "m8zcr0b",
                      "author": "only_remaining_name",
                      "body": "Possibly, but I've made recordings with them and they sounded good.",
                      "score": 0,
                      "created_utc": 1737753558.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8zyet4",
              "author": "DrBhu",
              "body": "Do you have long hair? It blocks the microphones built in really bad.",
              "score": 1,
              "created_utc": 1737759916.0,
              "replies": [
                {
                  "id": "m93af6u",
                  "author": "Last_Competition3132",
                  "body": "No long hair.",
                  "score": 1,
                  "created_utc": 1737813964.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8xbxhr",
      "author": "starker",
      "body": "Use my XM4s daily.  Love them.",
      "score": 51,
      "created_utc": 1737733176.0,
      "replies": [
        {
          "id": "m8xccfu",
          "author": "Grytnik",
          "body": "I only like them during winter times because damn they get my ears hot.",
          "score": 15,
          "created_utc": 1737733294.0,
          "replies": [
            {
              "id": "m8xciak",
              "author": "starker",
              "body": "Different strokes, haven't had that issue myself.",
              "score": 11,
              "created_utc": 1737733339.0,
              "replies": []
            },
            {
              "id": "m8zmney",
              "author": "TeeMerce",
              "body": "Yep same, xm4s for winter and planes. airpods pros in summer.. well at least I did until the wind blew one out of my ear into a moving fiat 500...",
              "score": 3,
              "created_utc": 1737756361.0,
              "replies": []
            },
            {
              "id": "m8zt2t9",
              "author": "KidsSeeRainbows",
              "body": "Look into getting different material ear cups. Shouldn’t cost more than 40 bucks for an ok enough pair that help breathability.",
              "score": 2,
              "created_utc": 1737758285.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m91gfp6",
          "author": "themindisaweapon",
          "body": "Me too, fantastic product.",
          "score": 1,
          "created_utc": 1737778729.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8xcawc",
      "author": "Rivent",
      "body": "Unless they bring back folding earcups I'm sticking with my XM3s.",
      "score": 19,
      "created_utc": 1737733282.0,
      "replies": []
    },
    {
      "id": "m8xggkp",
      "author": "Velvet_Spaceman",
      "body": "I know they're a touch controversial but I love my XM5s, I doubt I'll need to upgrade after only a year with them but I'd bet these will be extremely solid as well!",
      "score": 17,
      "created_utc": 1737734450.0,
      "replies": [
        {
          "id": "m9005dc",
          "author": "None",
          "body": "[removed]",
          "score": 7,
          "created_utc": 1737760459.0,
          "replies": [
            {
              "id": "m901mxp",
              "author": "ramseysleftnut",
              "body": "They’re probably only controversial online for the lack of foldability but in real life they are super popular.",
              "score": 6,
              "created_utc": 1737760933.0,
              "replies": []
            },
            {
              "id": "m91a1of",
              "author": "Kobe7477",
              "body": "Because of the widespread durability issues. Many many threads on Reddit of careful people having their shit snap.",
              "score": 3,
              "created_utc": 1737776177.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8zbyrb",
      "author": "SpinCharm",
      "body": "I replaced my XM3 pads with 3rd party ones. Took under  15 seconds per pad and no tools required. They might not be officially detachable, but they’re entirely and simply detachable. \n\nHaving Sony make a model where this is somehow official is pretty desperate. What next - replacement ones have chips in them to prevent 3rd party pads?",
      "score": 6,
      "created_utc": 1737753338.0,
      "replies": []
    },
    {
      "id": "m8yw6eh",
      "author": "magondrago",
      "body": "The good folks at r/autism recommended me the XM4's. Best purchase ever. Everywhere I looked, I found people telling me the XM5's were a sidegrade at best and not worth the extra dough. I don't think I'll be rushing for the XM6's any time soon.",
      "score": 6,
      "created_utc": 1737748829.0,
      "replies": []
    },
    {
      "id": "m8x7af8",
      "author": "Thandor369",
      "body": "Changing name to something that human can pronounce will be a great start",
      "score": 53,
      "created_utc": 1737731844.0,
      "replies": [
        {
          "id": "m8x935t",
          "author": "Estrava",
          "body": "XM already has brand recognition",
          "score": 61,
          "created_utc": 1737732362.0,
          "replies": [
            {
              "id": "m8xdwby",
              "author": "Thandor369",
              "body": "Yeah, but you need some time to find this XM in the middle of the product name. Why not just have XM6? Oh wait, you also have 2 other W*-1000XM products.",
              "score": 14,
              "created_utc": 1737733731.0,
              "replies": []
            },
            {
              "id": "m8yqkt6",
              "author": "DevinOlsen",
              "body": "lol no it doesn’t. Outside of a tiny window of tech enthusiasts I would bet almost nobody knows and understanding the Sony naming for their headphones. \nI own a pair and genuinely couldn’t have told you the letters XM are in the model name.",
              "score": 4,
              "created_utc": 1737747238.0,
              "replies": []
            },
            {
              "id": "m8xocl2",
              "author": "Clemario",
              "body": "Not as much as you think",
              "score": 5,
              "created_utc": 1737736631.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8xbo25",
          "author": "DaJix2k5",
          "body": "You should see Asus' and AMD's naming conventions haha",
          "score": 6,
          "created_utc": 1737733103.0,
          "replies": []
        },
        {
          "id": "m8xb5au",
          "author": "ThinkpadLaptop",
          "body": "It's actually really good branding. It's a non professional consumer product with a long weird name that makes it sound like it's a professional studio headset, the likes of a sennheiser/beyerdynamics/audiotechnica (or even sony themselves) 34235235XC WHAT-EVER.\n\nUsed to work in retail tech and After hearing SKULLCANDY DESTROYER and JBL CRAZYBASS and ^(\\*\\~airpods max and bose quietcomfort\\~\\*), just mentioning a name like that really caught on to people's ears and made them raise an eyebrow in interest, since it sounds like it focuses on audio quality more than the others (whether it actually sounds better or not)\n\nToday I see XM3s/XM4s/XM5s all the time over here locally in the GTA area, and people generally know somewhat about them.",
          "score": 11,
          "created_utc": 1737732953.0,
          "replies": [
            {
              "id": "m8xczg2",
              "author": "Thandor369",
              "body": "But their in ear lineup also uses the same XM1-5 in the end. WH, WT, WI, you need to remember this. I am not even talking about 1000 in the middle, why not 2000 or 3000? And even I, a person who loves and follows this tech, need to google them every time to remember complete name.",
              "score": 6,
              "created_utc": 1737733473.0,
              "replies": [
                {
                  "id": "m8xdjlu",
                  "author": "ThinkpadLaptop",
                  "body": "The actual consumer from my experience isn't googling things. They'll go off either hype they heard from an online reviewer (which always mentions the XMs or airpods), a friend's recommendation, or what the salesman in store said. If not that, whatever's cheapest, and hearing about the XMs makes them more likely to eye something cheaper from the CH or whatever else line\n\nAt least the ones in store. For all I know people shopping on Amazon have different opinions and thought processing",
                  "score": 1,
                  "created_utc": 1737733632.0,
                  "replies": [
                    {
                      "id": "m8xfjoh",
                      "author": "Thandor369",
                      "body": "Yes, but why not put that known XM brand forward,  because not it is 8th and 9th symbols out of 10 in the name. I don’t see how having something like XM6-H and XM5-F will hurt, and I didn’t even changed letters, I just removed ones that are basically useless for regular consumer.",
                      "score": 4,
                      "created_utc": 1737734195.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8x9c1t",
          "author": "Myarmhasteeth",
          "body": "People just say xm# as in xm3, xm4, etc.\n\nBecause exactly, very bad naming. I have the xm3 and had to google every time someone asked me what the product name was, even the model. You reserve stuff like that for internal unique naming, not for the final consumer to deal with.",
          "score": 8,
          "created_utc": 1737732433.0,
          "replies": []
        },
        {
          "id": "m8yp6l6",
          "author": "burnSMACKER",
          "body": "They made the Sony Ult Wear for people like you",
          "score": 2,
          "created_utc": 1737746845.0,
          "replies": []
        },
        {
          "id": "m8x84yb",
          "author": "None",
          "body": "They should use the Mega Bass brand more.",
          "score": 3,
          "created_utc": 1737732090.0,
          "replies": [
            {
              "id": "m8yw1dw",
              "author": "ashyjay",
              "body": "Mega Bass has a bad rep as it's all bass now mids or treble. \n\nthey did have Hear.on/in but people just bought the WH-1000X, really though all sony products have a model number",
              "score": 1,
              "created_utc": 1737748788.0,
              "replies": []
            },
            {
              "id": "m8x91ny",
              "author": "Redmarkred",
              "body": "And Xplod",
              "score": 1,
              "created_utc": 1737732350.0,
              "replies": [
                {
                  "id": "m8xd3l8",
                  "author": "-Dixieflatline",
                  "body": "I would have preferred \"A Splode\". As in, \"Your head A Splode\".",
                  "score": 1,
                  "created_utc": 1737733506.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8xb8nq",
          "author": "sudoku7",
          "body": "Hmm 700UC vs 1000XM6... I dunno. Like some Sony products absolutely have the most product sku of a name, but the 1000XM series is one of their most straight forward ones.",
          "score": 1,
          "created_utc": 1737732980.0,
          "replies": [
            {
              "id": "m8xddv6",
              "author": "Thandor369",
              "body": "And don’t forget that WH-1000XM*, WF-1000XM* and WI-1000XM* are completely different products.",
              "score": 3,
              "created_utc": 1737733586.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8yv8wr",
          "author": "ashyjay",
          "body": "It makes sense, WH= Wireless headphone, 1000X= where it is in the product stack, M6= Mark 6.",
          "score": 1,
          "created_utc": 1737748561.0,
          "replies": [
            {
              "id": "m8zo1de",
              "author": "Thandor369",
              "body": "And what WF and WI mean?",
              "score": 1,
              "created_utc": 1737756771.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8xa2j9",
      "author": "PoeticBro",
      "body": "I hope they make them comfortable this time. My XM5 has nothing on my old Bose QC35.",
      "score": 17,
      "created_utc": 1737732643.0,
      "replies": [
        {
          "id": "m8xb2bh",
          "author": "koolaidismything",
          "body": "I’m wearing my Bose QC35ii right now.. January 2017. \n\nBest headphones ever.",
          "score": 4,
          "created_utc": 1737732930.0,
          "replies": [
            {
              "id": "m8xgk7k",
              "author": "None",
              "body": "Agree. The QC45s and new Quietcomforts are downgrades",
              "score": 2,
              "created_utc": 1737734478.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8xdhcx",
          "author": "-Dixieflatline",
          "body": "I loved my QC35's. Right up to the point I left them on an airplane because I was so used to leaving the carrier's headset at the seat. Some cleaning crewmember got lucky that day.",
          "score": 4,
          "created_utc": 1737733614.0,
          "replies": []
        },
        {
          "id": "m8z1tfs",
          "author": "Dodgson_here",
          "body": "I might have to replace my QC25s finally. The in line volume controls are getting finicky.  I’ve replaced the cable a couple of times but it keeps happening.",
          "score": 3,
          "created_utc": 1737750453.0,
          "replies": []
        },
        {
          "id": "m8xd3ev",
          "author": "_Karmageddon",
          "body": "I found this too, I was disappointed after \"Upgrading\" my dying QC35's to the XM5's. The sound was definitely a downgrade as well if you're listening to anything outside of Rap/Hip Hop.",
          "score": 2,
          "created_utc": 1737733504.0,
          "replies": []
        },
        {
          "id": "m8zw8rq",
          "author": "tyaston",
          "body": "I replaced the pads on my XM5’s with some from Amazon. Made a HUGE difference in comfort. I can’t believe Sony shipped them with such crap pads. The XM4 had nice pads, although they do wear out with regular use.",
          "score": 1,
          "created_utc": 1737759247.0,
          "replies": []
        },
        {
          "id": "m91n7dm",
          "author": "iamapizza",
          "body": "I used xm for a long time (and still have a soft spot for it), but didn't realise how many limitations I had been living with until I got that same Bose. Just switching between devices alone required all these gymnastics, and it's so effortless on the Bose. No I'm not installing your app.",
          "score": 1,
          "created_utc": 1737781684.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8xbc7q",
      "author": "None",
      "body": "[deleted]",
      "score": 4,
      "created_utc": 1737733008.0,
      "replies": [
        {
          "id": "m8xc3jb",
          "author": "starker",
          "body": "On my XM4s they are detachable. I've replaced them twice because of foam wear and tear.",
          "score": 2,
          "created_utc": 1737733224.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8xhb5q",
      "author": "Nikiaf",
      "body": "I wouldn't mind upgrading my XM3s, but they'll need to make this new iteration better than the current one. The reduction in ergonomics was not a good thing.",
      "score": 4,
      "created_utc": 1737734691.0,
      "replies": []
    },
    {
      "id": "m8yotaw",
      "author": "TatersAndHotSauce",
      "body": "The XM5s were worse than the XM4s imo.",
      "score": 5,
      "created_utc": 1737746742.0,
      "replies": [
        {
          "id": "m902dt9",
          "author": "jmegaru",
          "body": "Agreed!",
          "score": 2,
          "created_utc": 1737761172.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8xjp68",
      "author": "Sun_Beams",
      "body": "The WF XM5 buds were really disappointing. I hope they get a refresh as well soon.",
      "score": 3,
      "created_utc": 1737735358.0,
      "replies": []
    },
    {
      "id": "m8xik81",
      "author": "Froot-Loop-Dingus",
      "body": "I woke up this morning and my ear pads were missing again…they’re detachable.",
      "score": 4,
      "created_utc": 1737735042.0,
      "replies": [
        {
          "id": "m90w067",
          "author": "NoGoodNamesLeft_2",
          "body": "This comes in handy a lot of the time.\nI can leave them home, when I think they’re gonna get me in trouble,\nOr I can rent them out, when I don’t need them.",
          "score": 2,
          "created_utc": 1737771059.0,
          "replies": [
            {
              "id": "m90wcf7",
              "author": "Froot-Loop-Dingus",
              "body": "** Detachable ear pads. **",
              "score": 3,
              "created_utc": 1737771180.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8xc3mv",
      "author": "ShadowBannedAugustus",
      "body": "My only gripe with them was they made my ears super hot after 10 mins even in winter. If they fix that I am buying instantly.",
      "score": 4,
      "created_utc": 1737733225.0,
      "replies": [
        {
          "id": "m8xpa7l",
          "author": "DrSpaceman575",
          "body": "I’m afraid all ANC headphones I’ve tried have this problem. No way to get good noise isolation without sealing your ears into little easy bake ovens.",
          "score": 9,
          "created_utc": 1737736886.0,
          "replies": [
            {
              "id": "m8y51ki",
              "author": "Siyuen_Tea",
              "body": "The noise cancelling is OK. The in-ear xm4s had the best noise cancelling but they were Agonizingly painful. Unless something straight up seals to your ear like those did, noise cancelling will only ever get so far. I'm sure one day AI will create ambient noise cancelling but we're not there yet.",
              "score": 1,
              "created_utc": 1737741241.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m902cja",
          "author": "jmegaru",
          "body": "I like them for that, I hate it when my ears are cold.",
          "score": 1,
          "created_utc": 1737761161.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8xnmwt",
      "author": "ManEEEFaces",
      "body": "Until there's a breakthrough with cancelling higher frequency sounds, there's no reason to upgrade. Noise cancellation has pretty much been the same for almost a decade. Love me WH3s.",
      "score": 5,
      "created_utc": 1737736434.0,
      "replies": [
        {
          "id": "m92dgse",
          "author": "None",
          "body": "I thought they intentionally didn't block those sounds for emergency vehicle like noises. It isn't tech so much as people not getting run over. Car horn is high pitched.",
          "score": 1,
          "created_utc": 1737796537.0,
          "replies": [
            {
              "id": "m948bbo",
              "author": "ManEEEFaces",
              "body": "Where did you hear that?",
              "score": 2,
              "created_utc": 1737824593.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8xklyn",
      "author": "redsterXVI",
      "body": "Who cares about detachable earpads?! Give us back foldable headphones. I really love the WH-1000XM series, but if they don't bring back folding, the XM4s will remain my last. Heck, I might buy a reserve pair if the XM6 still do without the foldability.",
      "score": 2,
      "created_utc": 1737735608.0,
      "replies": [
        {
          "id": "m8ypz9q",
          "author": "ArchusKanzaki",
          "body": "Ppl who want Airpod Pro Max customizability. And also the hygiene-minded ppl too maybe. Headphone is also fashion item now.",
          "score": 1,
          "created_utc": 1737747068.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8xwdkb",
      "author": "surfer808",
      "body": "I loved my Sony XM noise cancelling headphones but hated the cheap ass pleather they used. Even the replacement pad flakes off everywhere. Never again",
      "score": 2,
      "created_utc": 1737738850.0,
      "replies": [
        {
          "id": "m8y4z90",
          "author": "seanrm92",
          "body": "I found some replacements made of sheepskin leather about a year ago on either Amazon or eBay, and so far they've held up nicely (I wear them just about every day).",
          "score": 2,
          "created_utc": 1737741223.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m91nx1g",
      "author": "Interesting_Dingo379",
      "body": "Detachable penis…detachable penis…anyone?",
      "score": 2,
      "created_utc": 1737782014.0,
      "replies": []
    },
    {
      "id": "m8xkef7",
      "author": "KingRichardTheTurd",
      "body": "Gave up waiting and bought a set of Bose QC Ultra literally yesterday as I wanted better noise cancelling. Just my luck, still have the XM3's and I still plan on using them for exercizing, cleaning, etc. Brilliant headphones.",
      "score": 1,
      "created_utc": 1737735552.0,
      "replies": []
    },
    {
      "id": "m8xmzy5",
      "author": "Freds1765",
      "body": "Still very happy with my xm5 in-ears",
      "score": 1,
      "created_utc": 1737736259.0,
      "replies": []
    },
    {
      "id": "m8xs1am",
      "author": "NighthawK1911",
      "body": "Looks like I'm buying XM4 again.",
      "score": 1,
      "created_utc": 1737737642.0,
      "replies": []
    },
    {
      "id": "m8xs8cq",
      "author": "smithstreeter",
      "body": "Are these made by Audeze?",
      "score": 1,
      "created_utc": 1737737695.0,
      "replies": []
    },
    {
      "id": "m8y0kl8",
      "author": "Terror-Reaper",
      "body": "Hopefully they fixed the noise canceling feedback issue XM4 and 5 have. Super annoying whine it has.",
      "score": 1,
      "created_utc": 1737740010.0,
      "replies": [
        {
          "id": "m8y435s",
          "author": "narwhal_breeder",
          "body": "Have you run the  Noise-Cancellation Optimizer in the app?",
          "score": 1,
          "created_utc": 1737740981.0,
          "replies": [
            {
              "id": "m8yjnve",
              "author": "Terror-Reaper",
              "body": "I'll try it.",
              "score": 1,
              "created_utc": 1737745295.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8yeuym",
      "author": "RogueScholarDerp",
      "body": "Ladies and gentlemen, I give you, The Five-assed Monkey /s",
      "score": 1,
      "created_utc": 1737743967.0,
      "replies": []
    },
    {
      "id": "m8yh808",
      "author": "dolphintamer1",
      "body": "You can’t take the earcups off Sony headphones? They must have a lot of faith in that leather",
      "score": 1,
      "created_utc": 1737744623.0,
      "replies": []
    },
    {
      "id": "m8yhm3m",
      "author": "ThatGamerMoshpit",
      "body": "Detachable Earpads will mean a grantee buy from me",
      "score": 1,
      "created_utc": 1737744731.0,
      "replies": []
    },
    {
      "id": "m8ymzci",
      "author": "ArchusKanzaki",
      "body": "Honestly, as far as headphone goes, this thing is basically perfect ever since XM4. No wonder they're just heading into more obscure stuffs now like more personalization. Even Sony's marketing material in-store basically need to list down point-by-point where the new one is better\n\nYeah, they take away to foldability for the latest gen.... But honestly, if the case is still small enough, its not an issue. More like, I have XM4, and I sometimes still confused on which cup to fold when trying to store it and you also need to shorten the headband.",
      "score": 1,
      "created_utc": 1737746228.0,
      "replies": [
        {
          "id": "m9fhv5x",
          "author": "ssuuh",
          "body": "Plenty of things they can make better: Let me charge and listen in parallel. Get rid of the announcement voice. Voice pickup only and connection to two devices with full audio quality",
          "score": 1,
          "created_utc": 1737973122.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8z7qz2",
      "author": "None",
      "body": "These are cool and all, but what I really want is headphones that can target certain people and tune only them out. \n\nTargeting noise cancellation, “Siri this is Tracy, tune her voice out permanently”\n\nThen the headphone just mute her and I ain’t gotta hear shit from her anymore",
      "score": 1,
      "created_utc": 1737752141.0,
      "replies": [
        {
          "id": "m921v4e",
          "author": "NecarisOmnis",
          "body": "Tracy is your wife? Just asking.",
          "score": 1,
          "created_utc": 1737789372.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8zz830",
      "author": "mashuto",
      "body": "Deeper earcups and LE audio might make these a buy for me even though I already have the xm4 and xm5. The xm4 are more comfortable for me, but the noise cancellation hisses. The xm5 is very quiet there, but it clamps a bit on my ear and gets uncomfortable. Also these things always feel so cheap. I would pay a bit more for better build quality.",
      "score": 1,
      "created_utc": 1737760171.0,
      "replies": []
    },
    {
      "id": "m905g36",
      "author": "sceadwian",
      "body": "I haven't met a pair of nose cancelling headphones that doesn't make me notice the distortions it misses enough and makes it sound unnatural enough it's more noticeable to me.",
      "score": 1,
      "created_utc": 1737762153.0,
      "replies": []
    },
    {
      "id": "m906pf4",
      "author": "Mumbles76",
      "body": "Waiting for these with bated breath.... ",
      "score": 1,
      "created_utc": 1737762556.0,
      "replies": []
    },
    {
      "id": "m90gjps",
      "author": "silkyjs",
      "body": "I hate the xm5, they disconnect from my iPhone and computer all the time all on their own. It’s infuriating. Went with the Bose the Sony just sits around as backups.",
      "score": 1,
      "created_utc": 1737765774.0,
      "replies": [
        {
          "id": "m92d3mt",
          "author": "guswang",
          "body": "Weird, must be a faulty one.  I use one and it never disconnected by itself on ios or mac, even tv",
          "score": 2,
          "created_utc": 1737796307.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m90q9op",
      "author": "kmartb",
      "body": "Anyone with the xm4s get a screeching sound when using noise cancelling? Mine often starts about an hour or two of use.",
      "score": 1,
      "created_utc": 1737769071.0,
      "replies": []
    },
    {
      "id": "m90xifk",
      "author": "orpheo_1452",
      "body": "The XM5 is shit compared to my Bose qc35. It broke at the hinge and it's not even one year I had it...",
      "score": 1,
      "created_utc": 1737771591.0,
      "replies": []
    },
    {
      "id": "m91acfk",
      "author": "konstipald",
      "body": "I had XM3 and XM4 both crack at the hinges for me and both times Sony refused any kind of warranty for them. Meanwhile my QC35s are still going strong. \n\nI’m never buying another pair of Sony headphones.",
      "score": 1,
      "created_utc": 1737776289.0,
      "replies": []
    },
    {
      "id": "m91ccn5",
      "author": "smackythefrog",
      "body": "I've held off on upgrading to the iterations after my XM3s. \n\nUnless there's something revolutionary in the XM6, I'll hang on again for another 2-3 years.",
      "score": 1,
      "created_utc": 1737777070.0,
      "replies": []
    },
    {
      "id": "m91ihn7",
      "author": "Neo_Techni",
      "body": "let me guess, they don't support the PS Link the PS Portal uses?",
      "score": 1,
      "created_utc": 1737779594.0,
      "replies": []
    },
    {
      "id": "m91snqm",
      "author": "WretchedMisteak",
      "body": "Have the XM4 that I use daily for work and home.  Without jinxing them, they're great.  The pads are starting to wear but that is expected I guess with 4 years of daily (3+hrs) use.",
      "score": 1,
      "created_utc": 1737784318.0,
      "replies": []
    },
    {
      "id": "m91w185",
      "author": "Morvar",
      "body": "It'd better have some low latency codecs like the XM3s have. Fingers crossed",
      "score": 1,
      "created_utc": 1737786085.0,
      "replies": []
    },
    {
      "id": "m92tf89",
      "author": "traypo",
      "body": "The reviews I’m finding haven’t convinced me that there is increasing quality correlated to increased cost. And, will my experience be comparable at $150 products vs $350 products. Can someone pass on some well articulated reviews? Thanks",
      "score": 1,
      "created_utc": 1737806360.0,
      "replies": []
    },
    {
      "id": "m92wlxr",
      "author": "Comfortable_Dig_781",
      "body": "My XM4’s may be my favorite piece of tech I own. Great battery life, durable and comfortable. Sound quality works for my needs.\n\nI wear these in a sauna probably 3-4 days a week, 0 issues. I recommend the XM4s at every opportunity I can lol.",
      "score": 1,
      "created_utc": 1737808049.0,
      "replies": []
    },
    {
      "id": "m93ce4m",
      "author": "Jefffahfffah",
      "body": "Hoo boy it looks like I am gonna get some XM5's for a darn good price in the near future",
      "score": 1,
      "created_utc": 1737814703.0,
      "replies": []
    },
    {
      "id": "m93forb",
      "author": "Independent-Ride-792",
      "body": "Bought Sony's once. Broke and went straight back to Bose where I will remain.",
      "score": 1,
      "created_utc": 1737815885.0,
      "replies": []
    },
    {
      "id": "m96g7lf",
      "author": "DrRiAdGeOrN",
      "body": "They will be useless to me if they dont fold well....",
      "score": 1,
      "created_utc": 1737848824.0,
      "replies": []
    },
    {
      "id": "m9b579p",
      "author": "Blapanda",
      "body": "They should update the app first allowing us disabling that bloody annoying and extremely loud voice nagging about remaining battery charge. Like wtf, Sony?",
      "score": 1,
      "created_utc": 1737916966.0,
      "replies": []
    },
    {
      "id": "m9fgs6c",
      "author": "ssuuh",
      "body": "Please fix all the shit!\n\n\\- Connecting to two devices with full audio quality  \n\\- Charging and listening in parallel  \n\\- Microphone pickup which actually just does voice and not everything around you like a mad person  \n\\- Get rid of this long announcement voice telling me my headset is on and connected...\n\nI like my MX4 but man wtf...",
      "score": 1,
      "created_utc": 1737972459.0,
      "replies": []
    },
    {
      "id": "mfbc00r",
      "author": "rylieclimbs",
      "body": "still rocking my xm2s. I've loved them and they are still running strong. My only complaints have been that I can't find replacement earpads and I wish the cups were a bit bigger and deeper or the pads were thicker.",
      "score": 1,
      "created_utc": 1740774850.0,
      "replies": []
    },
    {
      "id": "m8xdskj",
      "author": "Ceros007",
      "body": "Is the mic better now? I have the XM3 and the mic is terrible in an office space. It picks up every sound around you.",
      "score": 1,
      "created_utc": 1737733702.0,
      "replies": [
        {
          "id": "m8xg9s9",
          "author": "Velvet_Spaceman",
          "body": "The XM5s had the best mics in the category at launch, I think they still might actually but I haven't checked around since I bought mine last year.",
          "score": 2,
          "created_utc": 1737734398.0,
          "replies": []
        },
        {
          "id": "m9fhrrf",
          "author": "ssuuh",
          "body": "Hoping for this too. MX4 also picks up everything. I can't even wash my hands without the caller complaining :|\n\nApparently the reviews for MX5 are not relevant better. Lets hope",
          "score": 1,
          "created_utc": 1737973062.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8xkjcn",
      "author": "GreyBeardEng",
      "body": "Already?  I feel like I just bought my xm5's.   I'm not going \"full apple\" on this product and buying a pair every time one comes out.",
      "score": 0,
      "created_utc": 1737735588.0,
      "replies": [
        {
          "id": "m8y4qvy",
          "author": "narwhal_breeder",
          "body": "Nobody is telling you you have to?  \n  \nXM5s were released in Q1 2022 - Its been 3 years.",
          "score": 1,
          "created_utc": 1737741159.0,
          "replies": [
            {
              "id": "m93xig4",
              "author": "GreyBeardEng",
              "body": "Now I just feel old",
              "score": 1,
              "created_utc": 1737821504.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8xaq23",
      "author": "narwhal_breeder",
      "body": "I ditched my XM4s because you can't use them while charging. Hoping the XM6 fixes that.",
      "score": -7,
      "created_utc": 1737732832.0,
      "replies": [
        {
          "id": "m8xfq5q",
          "author": "HummusMummus",
          "body": "It sucks, but the charge time is like an hour for 3-4 days of very active usage. Is it really that big of a problem to stop using them?",
          "score": 13,
          "created_utc": 1737734246.0,
          "replies": [
            {
              "id": "m8ximwk",
              "author": "labe225",
              "body": "The XM5s are even faster. Mine go from dead to fully charged in ~20 minutes and last all day and then some.",
              "score": 1,
              "created_utc": 1737735063.0,
              "replies": [
                {
                  "id": "m8xnw0u",
                  "author": "DigitallyDetained",
                  "body": "Even my old XM2 gets like 10 hours in 15 minutes or something insane.",
                  "score": 3,
                  "created_utc": 1737736503.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8xh4wj",
              "author": "narwhal_breeder",
              "body": "For me, yes.   \n  \nPeople use the same justification for the magic mouse having the port on the bottom - but its just as annoying there.",
              "score": -10,
              "created_utc": 1737734642.0,
              "replies": [
                {
                  "id": "m8xnrjq",
                  "author": "SwaggyMcSwagsabunch",
                  "body": "Are you using them for 12 hours a day?",
                  "score": 2,
                  "created_utc": 1737736469.0,
                  "replies": [
                    {
                      "id": "m8xpzx6",
                      "author": "narwhal_breeder",
                      "body": "Usually 10.",
                      "score": 1,
                      "created_utc": 1737737080.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8xcq07",
      "author": "sioux612",
      "body": "I've owned WF and WH models since the 3 was out and always liked them\n\n\n\nI have the WF xm5, and they are the reason I won't buy Sony headphones again\n\n\nThey are worse in every single way, but they are smaller than the 4. They don't stay in your ear as well and don't seal as well, they have worse battery life, and 1/3 of all times I take them out of the charging box they do not turn on. Which is slightly annoying when you want to listen to something, pretty annoying when you want to accept a call but need to put on headphones first, and it fucking sucks when you go to the gym, leave the charger at home and only notice it once you are at the gym.",
      "score": -1,
      "created_utc": 1737733399.0,
      "replies": []
    },
    {
      "id": "m8xhjsq",
      "author": "Kerrigore",
      "body": "I woke up this morning with a bad hangover\n\nAnd my earpads were missing again.\n\nThis happens all the time.\n\nThey’re detachable.\n\n——————————————————\n\nThis comes in handy a lot of the time.\n\nI can leave them home, when I think they’re gonna get me in trouble,\n\nOr I can rent them out, when I don’t need them.\n\nBut now and then I go to a party, get drunk,\n\n——————————————————\n\nAnd the next morning I can’t for the life of me\n\nRemember what I did with them.\n\nFirst I looked around my apartment, and I couldn’t find them.\n\nSo I called up the place where the party was,\n\n——————————————————\n\nThey hadn’t seen them either.\n\nI asked them to check the medicine cabinet\n\n‘Cause for some reason I leave them there sometimes\n\nBut not this time.\n\n——————————————————\n\nSo I told them if they pop up to let me know.\n\nI called a few people who were at the party,\n\nBut they were no help either.\n\nI was starting to get desperate.\n\n——————————————————\n\nI really don’t like being without my earpads for too long.\n\nIt makes me feel like less of an audiophile,\n\nAnd I really hate having to sit down every time I listen to music.\n\nAfter a few hours of searching the house,\n\n——————————————————\n\nAnd calling everyone I could think of,\n\nI was starting to get very depressed,\n\nSo I went to the Kiev, and ate breakfast.\n\nThen, as I walked down Second Avenue towards St. Mark’s Place,\n\n——————————————————\n\nWhere all those people sell used books and other junk on the street,\n\nI saw my earpads lying on a blanket\n\nNext to a broken toaster oven.\n\nSome guy was selling them.\n\n——————————————————\n\nI had to buy them off him.\n\nHe wanted twenty-two bucks, but I talked him down to seventeen.\n\nI took them home, washed them off,\n\nAnd put them back on. I was happy again. Complete.\n\n——————————————————\n\nPeople sometimes tell me I should get them permanently attached,\n\nBut I don’t know.\n\nEven though sometimes it’s a pain in the ass,\n\nI like having detachable earcups.",
      "score": -5,
      "created_utc": 1737734758.0,
      "replies": [
        {
          "id": "m8yphhi",
          "author": "ArchusKanzaki",
          "body": "GPT bot having a stroke",
          "score": 2,
          "created_utc": 1737746929.0,
          "replies": [
            {
              "id": "m8yqm5t",
              "author": "Kerrigore",
              "body": "Beep boop.",
              "score": 1,
              "created_utc": 1737747248.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8xqb8y",
          "author": "bamsurk",
          "body": "Thanks for sharing",
          "score": 1,
          "created_utc": 1737737167.0,
          "replies": []
        },
        {
          "id": "m8zcso1",
          "author": "SpinCharm",
          "body": "Not many people in here old enough to get that penile reference I suspect.",
          "score": 1,
          "created_utc": 1737753571.0,
          "replies": [
            {
              "id": "m8znnqz",
              "author": "Kerrigore",
              "body": "[Darn kids!](https://youtu.be/NQBPgJQhQHc)",
              "score": 1,
              "created_utc": 1737756659.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8xi1zb",
          "author": "Atmp",
          "body": "Ok",
          "score": 1,
          "created_utc": 1737734900.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8x7282",
      "author": "diablosinmusica",
      "body": "I've never seen the purpose of high end Bluetooth headphones. They're naturally limited by the medium.",
      "score": -21,
      "created_utc": 1737731777.0,
      "replies": [
        {
          "id": "m8x7htd",
          "author": "Daakilah",
          "body": "They are more comfortable and convenient than wired headphones.",
          "score": 22,
          "created_utc": 1737731904.0,
          "replies": [
            {
              "id": "m8xbdt1",
              "author": "diablosinmusica",
              "body": "None of that is exclusive to expensive headphones. What's your point?",
              "score": -7,
              "created_utc": 1737733020.0,
              "replies": [
                {
                  "id": "m8xc8h3",
                  "author": "Daakilah",
                  "body": "What makes them more comfortable and convenient is them being wireless, not the price.",
                  "score": 3,
                  "created_utc": 1737733263.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8x7bwe",
          "author": "wotton",
          "body": "lol what, ANC? The best thing created since sliced bread",
          "score": 22,
          "created_utc": 1737731856.0,
          "replies": [
            {
              "id": "m8x7np6",
              "author": "bizarro_kvothe",
              "body": "Since *silenced bread",
              "score": 7,
              "created_utc": 1737731952.0,
              "replies": []
            },
            {
              "id": "m8x7x91",
              "author": "iguacu",
              "body": "Sometimes I will turn it off and on just to appreciate how much noise they block out.",
              "score": 7,
              "created_utc": 1737732028.0,
              "replies": []
            },
            {
              "id": "m8x7rx2",
              "author": "diablosinmusica",
              "body": "And you can get it in much cheaper headphones. What's your point?",
              "score": -15,
              "created_utc": 1737731985.0,
              "replies": [
                {
                  "id": "m8x8fi8",
                  "author": "billiontacos",
                  "body": "Quality of noise canceling matters to some people. There’s a valley of difference between ANC on premium headphones vs budget ANC headphones.",
                  "score": 12,
                  "created_utc": 1737732174.0,
                  "replies": [
                    {
                      "id": "m8xahim",
                      "author": "HiTork",
                      "body": "As an anecdote, I got a set of $5 noise canceling ear buds during Canadian Boxing Day at a regional electronics retailer.  The ANC noise canceling works okay, but the sound quality is absolutely horrid, sounding incredibly muffled.  They didn't even include volume control functions, something I see usually on the most basic ear buds now.",
                      "score": 3,
                      "created_utc": 1737732762.0,
                      "replies": []
                    },
                    {
                      "id": "m8xcl3r",
                      "author": "diablosinmusica",
                      "body": "There's not a lot of difference between a $100 set and a $400 set in ANC unless you're comparing within the same brand.",
                      "score": -2,
                      "created_utc": 1737733361.0,
                      "replies": [
                        {
                          "id": "m8xhac1",
                          "author": "billiontacos",
                          "body": "I very much disagree, but if you’ve found a $100 set of ANC headphones that work as well as a $400 set of ANC headphones then good for you.\n\nOr better yet, if you can’t hear the difference between the two, consider yourself blessed. You can save $300 and have what you feel is the same experience.",
                          "score": 4,
                          "created_utc": 1737734684.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8x8fnj",
                  "author": "Daakilah",
                  "body": "They are not equally effective.",
                  "score": 14,
                  "created_utc": 1737732175.0,
                  "replies": []
                },
                {
                  "id": "m8xa1v0",
                  "author": "danielv123",
                  "body": "These have been in a league of their own for anc performance for years. Bose now as an offering that is in some ways better, but it's the same price range.",
                  "score": 5,
                  "created_utc": 1737732638.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8x7o8t",
          "author": "roiki11",
          "body": "You should try them on a plane or any crowded place. Fucking life savers.",
          "score": 16,
          "created_utc": 1737731956.0,
          "replies": [
            {
              "id": "m8xbm0s",
              "author": "diablosinmusica",
              "body": "That's not exclusive to high end",
              "score": -5,
              "created_utc": 1737733087.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8x9i8d",
          "author": "Redmarkred",
          "body": "Not really. The new codecs sound really great",
          "score": 4,
          "created_utc": 1737732482.0,
          "replies": [
            {
              "id": "m8xard3",
              "author": "danielv123",
              "body": "Until you activate the mic",
              "score": 1,
              "created_utc": 1737732842.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8xa21e",
          "author": "Paragonswift",
          "body": "Tough to swallow pill: the difference in sound quality between low end BT headphones and high end BT headphones is greater and more noticable to an average user than the difference between good BT headphones and wired headphones.",
          "score": 3,
          "created_utc": 1737732639.0,
          "replies": []
        },
        {
          "id": "m8x8qge",
          "author": "Senior1292",
          "body": "I have a pair of XM4s and they're really nice for the Noise Cancellation when working in the office or travelling (I also got them at a decent discount). The sound quality is solid, and they would probably sound better if I wasn't streaming music through Spotify.",
          "score": 2,
          "created_utc": 1737732261.0,
          "replies": [
            {
              "id": "m8xd7d6",
              "author": "diablosinmusica",
              "body": "They're limited by Bluetooth. Even running on a lossless format, they're still not going to pass a certain point. Plenty of high end headphones just crank the bass to hide it.",
              "score": -2,
              "created_utc": 1737733536.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8x99pk",
          "author": "iguacu",
          "body": "If you're in an isolated work environment where you can wear them a lot of the day, they are unbeatable for long-term comfort, ANC, making phone calls while typing, listening to computer audio, etc.  Literally one of the best ways I spend money.  If I were just using them occasionally to listen to music and never at work, less so.  And the price caps out at \\~$400, they don't reach the prices of upper-end \"audiophile\" headphones.",
          "score": 2,
          "created_utc": 1737732415.0,
          "replies": []
        },
        {
          "id": "m8x9vet",
          "author": "dead_fritz",
          "body": "I didn't either until I took a flight with a pair of QuietComforts. It's headphones you can comfortably wear for hours with the best combo of active and passive noise cancellation. These headphones sell themselves on being a premium experience with solid build quality and features like being able to switch between Bluetooth and wired playback, better batteries, etc.",
          "score": 2,
          "created_utc": 1737732586.0,
          "replies": []
        },
        {
          "id": "m8xggox",
          "author": "Thandor369",
          "body": "For the wast majority of people limiting factor will be streaming service they use, not wireless protocol.",
          "score": 1,
          "created_utc": 1737734451.0,
          "replies": []
        },
        {
          "id": "m8x7sj1",
          "author": "None",
          "body": "Sony tends to put overkill bass in their headphones, so you won't be hearing those highs anyways. Conversely, if you need noise canceling to hear your headphones, then you wouldn't be enjoying the quality in that enivronment either.",
          "score": -3,
          "created_utc": 1737731990.0,
          "replies": [
            {
              "id": "m8xa90o",
              "author": "danielv123",
              "body": "I do wish it was possible to have it not go into turd mode as soon as the mic is activated though",
              "score": 1,
              "created_utc": 1737732694.0,
              "replies": []
            },
            {
              "id": "m8xc9vv",
              "author": "diablosinmusica",
              "body": "Yup. A lot of expensive headphones just crank the bass to hide the poor quality of Bluetooth.",
              "score": -2,
              "created_utc": 1737733274.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}