{
  "post": {
    "title": "Western Digital launches massive 26TB drives for pros & NAS users",
    "author": "chrisdh79",
    "id": "1j8qrne",
    "score": 969,
    "created_utc": 1741699792.0,
    "selftext": "",
    "num_comments": 121,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1j8qrne/western_digital_launches_massive_26tb_drives_for/"
  },
  "comments": [
    {
      "id": "mh78ftl",
      "author": "ddelamareuk",
      "body": "My Steam library 'might' just fit on there, but I'm not 100% certain of that claim.",
      "score": 212,
      "created_utc": 1741700264.0,
      "replies": [
        {
          "id": "mh82nbe",
          "author": "doyouevennoscope",
          "body": "It would be nice to have an offline drive with every single game I \"own\" installed. But I don't know if all the random crap I've bought over 10 years would fit either lol",
          "score": 39,
          "created_utc": 1741709373.0,
          "replies": [
            {
              "id": "mhazyue",
              "author": "Big-toast-sandwich",
              "body": "every call of duty from the past ten years be like 5% of that drive alone",
              "score": 25,
              "created_utc": 1741739824.0,
              "replies": [
                {
                  "id": "mhcdips",
                  "author": "314rft",
                  "body": "So I'd be good, since the most recent CoD I own is Black Ops 2?",
                  "score": 5,
                  "created_utc": 1741760051.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mhc2k45",
              "author": "phblue",
              "body": "I bought a 4TB SSD a few years ago with that intention, I installed everything I could imagine actually playing and I’ve still got 1TB or so left",
              "score": 6,
              "created_utc": 1741754157.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mharkio",
          "author": "lacunavitae",
          "body": "next COD update is 26.9TB",
          "score": 5,
          "created_utc": 1741737122.0,
          "replies": []
        },
        {
          "id": "mh7f1fy",
          "author": "Genocode",
          "body": "You might just be able to fit Balatro alongside BLOPS6 on that drive!",
          "score": 15,
          "created_utc": 1741702385.0,
          "replies": []
        },
        {
          "id": "mhabx9p",
          "author": "NorCalAthlete",
          "body": "Till the next steam sale, anyway",
          "score": 2,
          "created_utc": 1741732345.0,
          "replies": [
            {
              "id": "mhdwd7u",
              "author": "garrus-ismyhomeboy",
              "body": "Spring sale is about to start",
              "score": 1,
              "created_utc": 1741787990.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mh7ojfp",
          "author": "whatsyourname1122",
          "body": "Western Digital? I don't want even if it is a gift. MyCloud was a Fiasco and Sandisk TB portables were a disaster. This brand has fallen a long way.",
          "score": -14,
          "created_utc": 1741705273.0,
          "replies": [
            {
              "id": "mh9nu38",
              "author": "cashonomics",
              "body": "My western digital 4tb hard drive of around 8 years still hasn't failed, despite terabytes of written data :)",
              "score": 6,
              "created_utc": 1741725433.0,
              "replies": [
                {
                  "id": "mhawc12",
                  "author": "CatProgrammer",
                  "body": "I'd still recommend making backups just in case.",
                  "score": 1,
                  "created_utc": 1741738656.0,
                  "replies": []
                },
                {
                  "id": "mhdmvwp",
                  "author": "redsoxVT",
                  "body": "Yea, all my WD drives get phased out before they die. Finally let go of a 2TB drive during my last build.",
                  "score": 1,
                  "created_utc": 1741784799.0,
                  "replies": [
                    {
                      "id": "mhdn6p7",
                      "author": "cashonomics",
                      "body": "I mostly just use that old drive as my GoG game installers library (lol), and my CD ripped music, as I am now FINALLY transferring to SSDs and playing my games off of fast drives :)",
                      "score": 2,
                      "created_utc": 1741784907.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mhawfzv",
              "author": "CatProgrammer",
              "body": "Their NAS drives are pretty good (the CMR ones at least).",
              "score": 1,
              "created_utc": 1741738691.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mh8zemx",
      "author": "BlastFX2",
      "body": "\\[r/datahoarder heavy breathing\\]",
      "score": 52,
      "created_utc": 1741718601.0,
      "replies": [
        {
          "id": "mhcp0fq",
          "author": "pistolpoida",
          "body": "![gif](giphy|ncsQI9sF3pa8w)",
          "score": 7,
          "created_utc": 1741767338.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mh7imnv",
      "author": "Ok-Secret-981",
      "body": "Damn you could just about squeeze a new COD game onto one of those bad boys",
      "score": 112,
      "created_utc": 1741703494.0,
      "replies": [
        {
          "id": "mh8az5a",
          "author": "AspiringDataNerd",
          "body": "You might need 2 for Ark",
          "score": 30,
          "created_utc": 1741711742.0,
          "replies": []
        },
        {
          "id": "mh80xsu",
          "author": "None",
          "body": "[removed]",
          "score": -57,
          "created_utc": 1741708882.0,
          "replies": [
            {
              "id": "mh86ncs",
              "author": "garry4321",
              "body": "I’d rather hear this joke than your snarky rude comment that adds nothing positive or good to this world. Like who the fuck hurt you my guy?",
              "score": 28,
              "created_utc": 1741710514.0,
              "replies": [
                {
                  "id": "mh9brt3",
                  "author": "MonolithyK",
                  "body": "Fool! clearly you have no idea how tortured their existence is — the seventh grade is a crucible of suffering; there is no room for jokes or levity.",
                  "score": 6,
                  "created_utc": 1741722081.0,
                  "replies": []
                },
                {
                  "id": "mh8h2x1",
                  "author": "Zynbab",
                  "body": "Well clearly. Anyone using the language \"who hurt you my guy\" would certainly be a fan of that joke, as their vernacular is clearly swayed by comments they read online. It's so interesting, how many times did you see the phrase before you decided to take it for a spin yourself? Wouldn't you feel so dirty and naughty parroting someone! Oh that is just good fun of you. Sorry, gave away my last award or I'd give you another one.",
                  "score": -36,
                  "created_utc": 1741713455.0,
                  "replies": [
                    {
                      "id": "mh90iln",
                      "author": "El_Eesak",
                      "body": "Omfg you are a massive tool and I hope you lay awake in bed tonight lamenting on that fact",
                      "score": 11,
                      "created_utc": 1741718909.0,
                      "replies": [
                        {
                          "id": "mh9axhr",
                          "author": "Zynbab",
                          "body": "\"my guy\" user detected",
                          "score": -20,
                          "created_utc": 1741721845.0,
                          "replies": [
                            {
                              "id": "mhc949y",
                              "author": "DongmanSupreme",
                              "body": "Shut up dork",
                              "score": 4,
                              "created_utc": 1741757524.0,
                              "replies": [
                                {
                                  "id": "mhcbfxr",
                                  "author": "Zynbab",
                                  "body": "Just put the food on the porch and take a picture little bro. Where's my drink",
                                  "score": -1,
                                  "created_utc": 1741758826.0,
                                  "replies": [
                                    {
                                      "id": "mhzd626",
                                      "author": "DongmanSupreme",
                                      "body": "Sure you could afford it? Seems to me you do nothing but pick arguments and sift through comment and profile history like it’s a job - I’m sure there can’t be much money in that. On the off chance you do somehow have a job, they’re probably not very fond of you judging by your shitty argumentative attitude. \n\nBut I digress, you ordered the mclardass who finds a sad comfort in arguing and belittling others on the internet large meal with a coke, right?",
                                      "score": 1,
                                      "created_utc": 1742072156.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mh9k1zz",
                      "author": "garry4321",
                      "body": "Lmfao you can’t be a real person. It’s like r/incel and r/iamverysmart rolled into one cringy sad person 😂",
                      "score": 7,
                      "created_utc": 1741724385.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mh8zek2",
              "author": "justthisones",
              "body": "Honestly at this point I agree with you. 5 years of the same ”cod big haha” everywhere.",
              "score": 4,
              "created_utc": 1741718600.0,
              "replies": []
            },
            {
              "id": "mh83y95",
              "author": "7-SE7EN-7",
              "body": "Every time someone makes the joke they add another gigabyte",
              "score": 2,
              "created_utc": 1741709747.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mh8a89k",
      "author": "idebugthusiexist",
      "body": "And then you would have to buy 3 of them to have a simple RAID solution to make sure a drive failure doesn't lose all your data?",
      "score": 21,
      "created_utc": 1741711534.0,
      "replies": [
        {
          "id": "mhaob7e",
          "author": "im_thatoneguy",
          "body": "Yeah and you also now have less speed than using 14TB drives. \n\nMore small drives is betterer in almost all metrics. You would be way better off with 16x 14TB drives than 8x 26TB drives.",
          "score": 11,
          "created_utc": 1741736096.0,
          "replies": [
            {
              "id": "mhbbtae",
              "author": "PyroDesu",
              "body": "The two main metrics in which more smaller drives are worse also happen to be *very important* metrics.\n\nPower consumption, and heat generation.",
              "score": 9,
              "created_utc": 1741743782.0,
              "replies": [
                {
                  "id": "mhc60ro",
                  "author": "BlastFX2",
                  "body": "Also volume. Datacenter space is expensive, yo!",
                  "score": 7,
                  "created_utc": 1741755884.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mhax4y8",
              "author": "CatProgrammer",
              "body": "If you have the space and can afford the increased power consumption. Pure storage access speed is not the only consideration. ",
              "score": 3,
              "created_utc": 1741738916.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mhbdsd8",
          "author": "xkcdismyjam",
          "body": "Wouldn’t you just need 2 drives for fault tolerance? (RAID1)",
          "score": 2,
          "created_utc": 1741744446.0,
          "replies": [
            {
              "id": "mhcqwi2",
              "author": "redittr",
              "body": "2 for raid1, and another 2 for rotating cold backups.",
              "score": 2,
              "created_utc": 1741768597.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mhdz75s",
          "author": "scdfred",
          "body": "I was just thinking, “great, now I can have more space free on my drive when it fails 3 weeks after I bought it.”",
          "score": 1,
          "created_utc": 1741788898.0,
          "replies": []
        },
        {
          "id": "mhk77d4",
          "author": "doddi",
          "body": "People have been saying this since storage was invented. Storage requirements keep going up, and just because this is enough for all your data, doesn’t mean enough for everyone.",
          "score": 1,
          "created_utc": 1741872005.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mh96899",
      "author": "None",
      "body": "Pro tip:  Still cheaper than multiple streaming services",
      "score": 9,
      "created_utc": 1741720514.0,
      "replies": []
    },
    {
      "id": "mh79fh6",
      "author": "DXsocko007",
      "body": "Is it just me or are things like INSANELY over priced",
      "score": 39,
      "created_utc": 1741700593.0,
      "replies": [
        {
          "id": "mh7cvyq",
          "author": "GolotasDisciple",
          "body": "Yes and no... They are not really for general audiences.\n\nFrom what I understand they are trying to touch market of people who need to do Video Rendering or Music Production. Sort of portable super drive.\n\nIt's one of those items that appeals to small audience that wants to have something \"professional\" but are not ready or do not know how to really go pro. But in this case it really would be just wiser to start building a proper Rack which is always upgradeable and customizable with less single points of failures.\n\nThis reminds me of Apple Gadgets for \"Professionals\". Cool product, but it really is more of a \"gadget\" that can be used by professionals rather than professional gadget. If you know what i mean. No real music producer or animator or designer will be willing to spend so much money on non industry standard solution.",
          "score": 36,
          "created_utc": 1741701703.0,
          "replies": [
            {
              "id": "mh7nddc",
              "author": "Fire_Lord_Cinder",
              "body": "The consumer market is a very small portion of WD’s customers. Roughly 80% of sales go to businesses for cloud or AI storage. Just think about how much data companies like Netflix, Hulu, OpenAI, etc need to store every day. These companies want the largest amount of storage that they can fit on a single Hard Disk so they can maximize the amount of storage per server.",
              "score": 20,
              "created_utc": 1741704928.0,
              "replies": [
                {
                  "id": "mh8x5ko",
                  "author": "Abigail716",
                  "body": "To follow up on that:\n\nOne thing that's also worth pointing out is power efficiency with higher capacity drives. It might not seem like a big deal to the average person, but two 10 terabyte drives require more power than a 20 terabyte drive for obvious reasons. This amounts to extra electricity costs which are already staggeringly high at data centers, but also additional air conditioning needed, which contributes to the staggeringly high electricity costs. \n\nA few percentage points better efficiency makes no difference to your average consumer, but the large scale commercial clients like Netflix or OpenAI it's a huge deal.",
                  "score": 17,
                  "created_utc": 1741717969.0,
                  "replies": [
                    {
                      "id": "mh9qegp",
                      "author": "rob_allshouse",
                      "body": "OpEx vs CapEx? What a concept! \n\nThe power and cooling for data centers overwhelms the cost of the hardware. That’s why used servers can be so cheap!",
                      "score": 4,
                      "created_utc": 1741726139.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mh8ku5o",
                  "author": "None",
                  "body": "/thread",
                  "score": 2,
                  "created_utc": 1741714513.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mh7r40m",
              "author": "szucs2020",
              "body": "This would be a kind of strange move for music production imo. I produce music and most of what I have fits on a 1tb nvme. Now it's mostly full and I use another 2tb SSD for extras like large kontakt libraries. But the biggest thing for me is speed. For large sample libraries, loading times are insanely slow even on a 7200rpm drive. Now I'm not a professional but I really don't see them using hard drives at this point (without a nas/raid).\n\nEdit: I see in the article they mention video Editors and photographers. I think that makes a lot more sense. The scale they work with is significantly larger.",
              "score": 9,
              "created_utc": 1741706039.0,
              "replies": [
                {
                  "id": "mheb3h2",
                  "author": "heepofsheep",
                  "body": "I’m not sure why anyone would want to edit video off this thing. It simply doesn’t have the read/write speeds to support a lot of modern formats…. I can maybe see this being used for a very, very massive longform TV/film project where all the media is just low res proxies. Even then that’s a bit of a stretch since those types of productions would be use a remote in type workflow usually.",
                  "score": 2,
                  "created_utc": 1741792646.0,
                  "replies": []
                },
                {
                  "id": "mh8qjv2",
                  "author": "min0nim",
                  "body": "This is…so wrong.\n\nHalf the answer is even in the title, so you don’t even need to RTFA if you don’t want. But it’s like you didn’t even read the title before having a rant about…bedroom producers and Apple?",
                  "score": -5,
                  "created_utc": 1741716099.0,
                  "replies": [
                    {
                      "id": "mh8solr",
                      "author": "szucs2020",
                      "body": "I don't think you read the comment I replied to honestly. The article says nothing about music production. It mentions creatives and film/photography. Only the comment I replied to mentioned music production and I said that doesn't make sense. They mentioned the idea about this being a portable super drive.\n\nProfessionals work in studios and wouldn't need to carry around a hard drive like this. Bedroom producers and semi professionals wouldn't carry around hard drives like this because a single drive is significantly slower than SSDs/nvme without a proper raid setup. And on top of all of that unless you're a professional composer who needs massive sample libraries of every single instrument you won't run into space issues on consumer grade storage solutions. Again, that person is not travelling around with a hard drive anyway because to load that data into ram would take way too long.\n\nI said nothing about apple",
                      "score": 2,
                      "created_utc": 1741716715.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mh7cs73",
          "author": "KezzardTheWizzard",
          "body": "a 2 TB ssd is like $80. Their 208 tb drive is like $8000. \n\nWhat would you like it to be priced at?",
          "score": 9,
          "created_utc": 1741701671.0,
          "replies": [
            {
              "id": "mh7pgsu",
              "author": "samtherat6",
              "body": "I mean it’s a 208TB hard drive NAS, not sure if you can really compare it to a SSD.",
              "score": 11,
              "created_utc": 1741705551.0,
              "replies": []
            },
            {
              "id": "mh8hfa7",
              "author": "i_need_a_moment",
              "body": "I still can’t find *good* 2TB SSDs for under $120 around me that aren’t on sale, at least NVMe ones. Where are you getting one for $80?",
              "score": 7,
              "created_utc": 1741713553.0,
              "replies": [
                {
                  "id": "mhadpk9",
                  "author": "chaotic_zx",
                  "body": "I went to diskprices and found a few that are close as of this writing. It is possible to catch one on sale for $80 USD. Those listed below are not $80 but also not $120. If you aren't in the US there may be different prices. I do not personally know the quality of Silicon Power NVMEs but have listed them nonetheless. They have good reviews. One is seemingly going to pay $6-$10 USD more for a comparably sized Gen4 over a Gen3. \n\n[PNY CS2241 2TB M.2 NVMe Gen4](https://www.amazon.com/dp/B0BYLNY4V8?th=1) $105 USD\n\n[Patriot P300 M.2 PCIe Gen 3](https://www.amazon.com/dp/B089Y3262K?th=1) $94.99 USD\n\n[Silicon Power 2TB NVMe M.2 PCIe Gen3](https://www.amazon.com/dp/B07ZQ97H3W?th=1) $89.97 USD\n\n[Silicon Power 2TB UD90 NVMe 4.0 Gen4](https://www.amazon.com/dp/B0B996CJ64?th=1) $95.99 USD \n\n\n\n\n\nhttps://diskprices.com/?locale=us&condition=new&capacity=2-&disk_types=m2_nvme",
                  "score": 1,
                  "created_utc": 1741732882.0,
                  "replies": [
                    {
                      "id": "mhby4ie",
                      "author": "OcculusSniffed",
                      "body": "I had like six pny SD cards go out on me in a month, they are on my do-not-buy list forever",
                      "score": 1,
                      "created_utc": 1741752115.0,
                      "replies": [
                        {
                          "id": "mhc63x7",
                          "author": "chaotic_zx",
                          "body": "I understand your frustration. I haven't had an issue with my PNY 1 TB NVME. But to be fair, I've had it less than a month. It is in an external enclosure so it isn't getting as much wear and tear.",
                          "score": 1,
                          "created_utc": 1741755928.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mhcgpsd",
                  "author": "MWink64",
                  "body": "I think one of the best budget 2TB NVMe options currently available is the Team Group MP44L for $104 (with a free 32GB memory card from Newegg). It's from a mainstream brand (even if not one of the best), it still tends to come with TLC NAND, generally uses components *not* known to have widespread issues (either a Maxio or Phison controller and Micron or YMTC NAND), and performs decently. You can find drives slightly cheaper but you're usually getting into QLC NAND, questionable brands, and/or questionable components.",
                  "score": 1,
                  "created_utc": 1741762003.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mh7ib0t",
              "author": "None",
              "body": "….about Tree Fiddy.",
              "score": 16,
              "created_utc": 1741703394.0,
              "replies": []
            },
            {
              "id": "mhbl4y1",
              "author": "blank_isainmdom",
              "body": "Fucking where in the world is a 2 TB ssd 80!",
              "score": 2,
              "created_utc": 1741746988.0,
              "replies": [
                {
                  "id": "mhd0y0a",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1741774879.0,
                  "replies": [
                    {
                      "id": "mhdezhd",
                      "author": "blank_isainmdom",
                      "body": "Huh. American prices are better it seems. Wank. Cheapest I can find is 110 dollars (after conversion)",
                      "score": 2,
                      "created_utc": 1741781725.0,
                      "replies": [
                        {
                          "id": "mhdm73g",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 2,
                          "created_utc": 1741784544.0,
                          "replies": [
                            {
                              "id": "mhexesp",
                              "author": "blank_isainmdom",
                              "body": "Hey buddy, no worries! I almost reacted piss-ily to your message myself haha! \n\nFair play for apologising! I love to see people acting human even when in an anonymous setting like reddit. Takes maturity! Have a good one!",
                              "score": 2,
                              "created_utc": 1741799105.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mh7nu69",
              "author": "None",
              "body": "[deleted]",
              "score": 2,
              "created_utc": 1741705067.0,
              "replies": [
                {
                  "id": "mh7pe73",
                  "author": "Small_Editor_3693",
                  "body": "A 26TB internal drive is $500 to $600 too",
                  "score": 2,
                  "created_utc": 1741705529.0,
                  "replies": [
                    {
                      "id": "mh8ar6c",
                      "author": "sorrylilsis",
                      "body": "The 26tb single disk version is 649 $ there, so not that much of a price hike all things considered.",
                      "score": 2,
                      "created_utc": 1741711680.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mh9m7oi",
                  "author": "WillEdit4Food",
                  "body": "But this isn’t an SSD, right? It’s a 7200 spinning disk. Sorry if I’m misunderstanding.",
                  "score": 1,
                  "created_utc": 1741724986.0,
                  "replies": [
                    {
                      "id": "mhawot5",
                      "author": "CatProgrammer",
                      "body": "SSDs with equivalent storage density are way more expensive.",
                      "score": 1,
                      "created_utc": 1741738770.0,
                      "replies": [
                        {
                          "id": "mhbj1bp",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 1,
                          "created_utc": 1741746242.0,
                          "replies": [
                            {
                              "id": "mhbjuj5",
                              "author": "CatProgrammer",
                              "body": "It's like CPUs, eventually it becomes more cost-effective to just group a bunch of them together instead of trying to eke out diminishing returns.",
                              "score": 1,
                              "created_utc": 1741746526.0,
                              "replies": [
                                {
                                  "id": "mhch3so",
                                  "author": "MWink64",
                                  "body": "Yeah, it's pretty similar. I remember when hard drives usually had 1-3 platters. Some of the ones available today have at least 10 platters in a drive with the same footprint.",
                                  "score": 1,
                                  "created_utc": 1741762242.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mhbxswj",
                              "author": "rechlin",
                              "body": "You are misremembering. There were several years between 20 GB being cutting edge (maybe 1999?) and 80 GB being standard (maybe 2004?).",
                              "score": 1,
                              "created_utc": 1741751975.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mh7mfu1",
          "author": "Small_Editor_3693",
          "body": "These prices are right in line with internal Nas drives…",
          "score": 2,
          "created_utc": 1741704651.0,
          "replies": []
        },
        {
          "id": "mh9t27n",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1741726867.0,
          "replies": [
            {
              "id": "mh9zjqb",
              "author": "DXsocko007",
              "body": "Yea the one you’re talking about is just mechanical hdds that can be upgraded to SSDs.",
              "score": 1,
              "created_utc": 1741728710.0,
              "replies": []
            },
            {
              "id": "mhaa1z2",
              "author": "aerowtf",
              "body": "the 26TB drive is $999.99 on their website, $38 per TB",
              "score": 1,
              "created_utc": 1741731777.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mh7djm8",
          "author": "alman12345",
          "body": "They are, I really don’t know what they’re doing that warrants a thunderbolt connection to their host since even in RAID 0 a couple spinning rust drives won’t exceed the total data rate of USB 3.2 Gen 2 even in sequential reads/writes. I guess they may be running some advanced NVMe/HDD cache mechanism internally?\n\nEdit: Wow, bunch of WD shills around here.",
          "score": -4,
          "created_utc": 1741701910.0,
          "replies": [
            {
              "id": "mh8sxaw",
              "author": "Flipdip3",
              "body": "Can be chained through other thunderbolt devices. Instead of buying a dock some people just chain. Computer->NAS->Monitor isn't a weird set up for some people.",
              "score": 1,
              "created_utc": 1741716784.0,
              "replies": [
                {
                  "id": "mh92cjl",
                  "author": "alman12345",
                  "body": "There's effectively no difference between having the drive on a hub at the end of the chain and having it before the monitor. Terminating a thunderbolt chain with a USB-C device is also possible, so this is effectively just spending $500 on docking hardware with the thunderbolt specification and given that the drives are exorbitant for what they are it's a pretty silly product (sales on Seagate Exos equipped 24tb externals have been popping up left and right for months now at $279). I could shuck 4 of those and throw them in an OWC thunderbolt dock off Amazon for $200 less, and it'd have 8TB shy of double the space (vs the 52TB).\n\nAlso, none of these are really NAS at all unless they're connected to an always on machine and provisioned for network access. All in all just a shitty product honestly.",
                  "score": 1,
                  "created_utc": 1741719415.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mh87yeb",
      "author": "None",
      "body": "[deleted]",
      "score": 3,
      "created_utc": 1741710884.0,
      "replies": [
        {
          "id": "mh9sg1w",
          "author": "qtx",
          "body": "Literally any cheap PC case can do that.",
          "score": 4,
          "created_utc": 1741726697.0,
          "replies": [
            {
              "id": "mhc6fn8",
              "author": "BlastFX2",
              "body": "I don't think I've ever seen a non-server motherboard that had more than 6 SATA ports (never mind M.2 slots!).",
              "score": 2,
              "created_utc": 1741756095.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mhcdlih",
      "author": "314rft",
      "body": "We're at the point where harddrives have heatsinks.\n\nWe're cooked.",
      "score": 3,
      "created_utc": 1741760097.0,
      "replies": []
    },
    {
      "id": "mhcj3e0",
      "author": "The_Oracle_65",
      "body": "The problem is HDD’s are pretty much at their physics limits without needing technologies that make them increasing expensive. The capacity growth curve is flattening out without much increase in performance. \n\nFor larger individual drive sizes without the weight, power and cooling of HDDs we will need to wait for Datacentre NVMe QLC SSD tech to get cheaper and filter down into the retail markets. These drives are already at capacities well beyond 26TB but obviously optimised for storage arrays. For example, Pure Storage have been producing 24, 48 and 75TB drives for some time and an NVMe/PCIe QLC 150TB Drive is available now with a 300TB on the roadmap. \n\nSure, 150TB is overkill for most PCs even with an “extensive homework folder” but I’m pretty sure cheaper SSD’s at capacities beyond 30TB are coming.",
      "score": 3,
      "created_utc": 1741763487.0,
      "replies": []
    },
    {
      "id": "mh8pyfb",
      "author": "colopervs",
      "body": "Is there actually anything different technically between the various drives that wd sells?  Red, gold, black, purple?  (Other than platter speed and cache memory obviously).",
      "score": 2,
      "created_utc": 1741715936.0,
      "replies": [
        {
          "id": "mh8wuit",
          "author": "david_edmeades",
          "body": "There are some clear differences and some not-so-clear ones. Datacenter drives _should_ be CMR (although they do try to sneak SMR models into those lines sometimes until people notice and yell) The NAS series claim to be more resistant to harmonics and heat that you get when they are in a dense disk shelf with 35 other drives. They also are more likely to have a SAS option. \n\nWhen I'm buying disks I look at CMR vs. SMR and warranty period. If I'm going with a brand or series that's new to me I'll check the Backblaze drive stats and see what the reliability has been. That said, for datacenter operations we are insulated from absolute failure rates because nobody's running serious storage as a RAID-0. There are massive redundancies and hot spares. I have ~2PB of storage that's all ZFS mirror units that get rebuilt with a spare immediately upon a drive failing out of the array. Out of ~200 disks I get an actual RMA-worthy disk failure once every few months.",
          "score": 5,
          "created_utc": 1741717883.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mh937l1",
      "author": "Cygnus__A",
      "body": "Do these have parity or if a drive fails you lose everything?",
      "score": 2,
      "created_utc": 1741719655.0,
      "replies": []
    },
    {
      "id": "mh94qq0",
      "author": "rhunter99",
      "body": "all i want is a price drop on 12-14TB drives :'(",
      "score": 2,
      "created_utc": 1741720092.0,
      "replies": []
    },
    {
      "id": "mhau9ad",
      "author": "dakotanorth8",
      "body": "Ok theres a lot of really all over the place comments here.\n\nIt’s a rotational drive. This will never be anywhere close to SSD speeds.\n\nA “208 TB drive” is NOT a single rotational 7k drive.  It’s an 8 bay, raid equipped NAS enclosure. \n\nAlso, with 8 drives, and (user defined) RAID levels…you can have increased performance because each drive only has to do a portion of the seek or write time. (Again, since it’s rotational). \n\nAgain, there are variables that affect this. Such as RAID types and levels. Amount of drives. Speed of drives. \n\nFeel free to google any of these for additional context as this is a very high level overview.",
      "score": 2,
      "created_utc": 1741737982.0,
      "replies": []
    },
    {
      "id": "mhb2wnf",
      "author": "PracticalPianist6189",
      "body": "Wd makes the best enterprise disk drives. The hgst/wd ultrastar disks are super reliable.",
      "score": 2,
      "created_utc": 1741740787.0,
      "replies": []
    },
    {
      "id": "mh8ujhq",
      "author": "gigidalligna",
      "body": "WD just left the flash drive market if I’m not wrong, to focus on, you guessed it, Hard drives.",
      "score": 2,
      "created_utc": 1741717235.0,
      "replies": [
        {
          "id": "mh9rpa5",
          "author": "ChristopherLXD",
          "body": "Yes technically. Practically they just spun SanDisk out into its own company to have clearer differentiation for their R&D pipeline.",
          "score": 1,
          "created_utc": 1741726492.0,
          "replies": []
        },
        {
          "id": "mh9s8cq",
          "author": "qtx",
          "body": "WD owns SanDisk, so SanDisk will take over the SSD section.\n\nIt's just the WD brand that will leave the SSD market, the company itself won't leave.",
          "score": 1,
          "created_utc": 1741726639.0,
          "replies": [
            {
              "id": "mhbzf8y",
              "author": "gnartung",
              "body": "SanDisk and WDC are two separate publicly traded companies now.  WD has shares but is for all intents and purposes out of the flash business.",
              "score": 2,
              "created_utc": 1741752690.0,
              "replies": []
            },
            {
              "id": "mhbc6d4",
              "author": "PyroDesu",
              "body": "... Meanwhile, having *just bought* a WD Black SN850X 8 TB M.2 SSD...\n\nI guess I might be screwed on warranty? Or will SanDisk honor it?",
              "score": 1,
              "created_utc": 1741743903.0,
              "replies": [
                {
                  "id": "mhbz68g",
                  "author": "gnartung",
                  "body": "the warranty is completely covered, you just likely have to go through SanDisk since they’re the ones that made it in the first place.",
                  "score": 2,
                  "created_utc": 1741752578.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mh99ivk",
      "author": "qbl500",
      "body": "Why 26 and not 27.5??!",
      "score": 1,
      "created_utc": 1741721442.0,
      "replies": []
    },
    {
      "id": "mha0efi",
      "author": "tricorder",
      "body": "Awesome. I can now store my homework folder in one drive.",
      "score": 1,
      "created_utc": 1741728956.0,
      "replies": []
    },
    {
      "id": "mhadafp",
      "author": "ToMorrowsEnd",
      "body": "can we get a 5 year warranty with free data recovery when they cant make it the 5 years?   I have not been able to trust WD for a while as  the past 20 red drives for my NAS I have had 5 failures.  luckily  I run a raid so 2 drive failures is no data loss but it's nuts that I seem to get a drive failure almost yearly.",
      "score": 1,
      "created_utc": 1741732757.0,
      "replies": []
    },
    {
      "id": "mhajni7",
      "author": "ixoxeles",
      "body": "I’m confused. WD has already had external drives ranging incrementally from 4-44TB for 5 or so years. Is this one special in some way?",
      "score": 1,
      "created_utc": 1741734648.0,
      "replies": []
    },
    {
      "id": "mhap6im",
      "author": "N983CC",
      "body": "I can't even fill 4tb",
      "score": 1,
      "created_utc": 1741736368.0,
      "replies": []
    },
    {
      "id": "mhbjzbk",
      "author": "ohiocodernumerouno",
      "body": "It's just a mislabeled HGST drive with no warranty.",
      "score": 1,
      "created_utc": 1741746573.0,
      "replies": []
    },
    {
      "id": "mhdp55t",
      "author": "enewwave",
      "body": "Would video editors really want to use an HDD for large files/projects in 2025? For long term storage, maybe, but I tried cutting on an HDD in a pinch a few months ago and the waits due to the transfer speed killed me",
      "score": 1,
      "created_utc": 1741785598.0,
      "replies": []
    },
    {
      "id": "mh8zs02",
      "author": "JustinYummy",
      "body": "Just bought a 4TB one for $85 last night...2TB was $65 (discounted) so they got me on that bargin upgrade lol\n\n26tb is nuts!",
      "score": 1,
      "created_utc": 1741718704.0,
      "replies": [
        {
          "id": "mh9d3q1",
          "author": "ArseBurner",
          "body": "Not for us data hoarders lol",
          "score": 4,
          "created_utc": 1741722455.0,
          "replies": [
            {
              "id": "mh9i30l",
              "author": "JustinYummy",
              "body": "o7\n\nI have 8TB total, 4x 2TB drives\n\nUsing like 40% on each, except one which is at 80%\n\nThey say its recommended to keep like 20% free if possible\n\nI'm replacing a 2TB for the 4 because it has \"caution\" in crystaldiskinfo ;(",
              "score": 2,
              "created_utc": 1741723842.0,
              "replies": [
                {
                  "id": "mhayvrm",
                  "author": "ArseBurner",
                  "body": "lol I currently have 2x8TB, 2x10TB, and 2x18TB on my file/media server. \n\nI can't add any more since I'm all out of SATA ports (and drive bays) so the next upgrade is gonna be replacing those two 8TB drives. Anything less than 20TB isn't worth doing since it'll just use up the ports while not providing much additional space.\n\nCompared to the average user on the datahoarder sub my setup is still very much a lightweight.",
                  "score": 3,
                  "created_utc": 1741739474.0,
                  "replies": [
                    {
                      "id": "mhc19p4",
                      "author": "SupremeDictatorPaul",
                      "body": "Get an 8 bay box to run Unraid, put in 4 cheap drives, and use double parity. Then you can easily increase space by adding a single drive at a time, of any size. When you get close to filling it up, remove the smallest drive as you add a large one. You should end up with a system that is easily expandable until the hardware dies. And if that happens, move the drive to a new system and you’re good to go.",
                      "score": 2,
                      "created_utc": 1741753545.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mh9m4jf",
          "author": "Seagoingnote",
          "body": "Do you by chance have a link to the 4TB one you got? Kinda looking to upgrade and would love that price",
          "score": 2,
          "created_utc": 1741724961.0,
          "replies": [
            {
              "id": "mh9q6q5",
              "author": "JustinYummy",
              "body": "https://www.amazon.com/dp/B0BNGLFBXV?ref=ppx_yo2ov_dt_b_fed_asin_title&th=1\n\nPS: This is a great drive just for storage of like pictures and videos.\n\nIf you're going to be running applications off of it, get a SSD (solid state drive)\n\nThis drive is only 5400 rpm, but from what ive read and my exp, there really isnt that big of difference vs 7200, at least for its intended use. And the downsides of 7200 is its louder and uses more electricity.\n\nSSD is WAY WAY better when its needed, but unless u have way too much money, this will suffice for storage",
              "score": 2,
              "created_utc": 1741726081.0,
              "replies": [
                {
                  "id": "mhasnsm",
                  "author": "chumlySparkFire",
                  "body": "That WD 4 TB IS USED….. most drives on Amazon are",
                  "score": 1,
                  "created_utc": 1741737471.0,
                  "replies": [
                    {
                      "id": "mhbfuxc",
                      "author": "JustinYummy",
                      "body": "I don't see anything about it being used or refurbished?",
                      "score": 1,
                      "created_utc": 1741745145.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mha7wqr",
          "author": "zanillamilla",
          "body": "I just tried to buy this new 26TB drive with the thunderbolt enclosure. I tried three times. It insta-cancelled the order each time. Spent an hour with someone in customer service, still cancelled the last time. I figure WD just doesn’t want my business. I’ll just go to B&H and get a $600 26TB Glyph external with USB3. Not as fast, but clearly I can’t order from WD.",
          "score": 1,
          "created_utc": 1741731132.0,
          "replies": [
            {
              "id": "mhapwb3",
              "author": "JustinYummy",
              "body": "Oof sorry to hear that :(\nI bet they're more upset about it than you haha",
              "score": 2,
              "created_utc": 1741736592.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mhc21vy",
          "author": "keeleon",
          "body": "I currently only have 400gb left on a 12tb plex server, and I'm pretty stingy on filesizes.  I could imagine hitting 20tb if I stopped paying attention.",
          "score": 1,
          "created_utc": 1741753916.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mh92oh6",
      "author": "Vatican87",
      "body": "$649 per 26TB wow",
      "score": 0,
      "created_utc": 1741719506.0,
      "replies": [
        {
          "id": "mhc1mj8",
          "author": "SupremeDictatorPaul",
          "body": "I know you’re getting downvoted, but it’s pretty common for people to pick up lightly used 22TB drives for <$300. For the prosumer, this is going to be a tough one to swallow for a while.",
          "score": 1,
          "created_utc": 1741753716.0,
          "replies": [
            {
              "id": "mskk8a3",
              "author": "DrStarBeast",
              "body": "Hey sorry old post, outside of eBay where are you picking these up? I would love to get my hands on one. ",
              "score": 1,
              "created_utc": 1747368449.0,
              "replies": [
                {
                  "id": "msmcte5",
                  "author": "SupremeDictatorPaul",
                  "body": "I ordered mine from Amazon, which has listings for used drives. But https://serverpartdeals.com/ is a respected place to get used drives.",
                  "score": 1,
                  "created_utc": 1747401489.0,
                  "replies": [
                    {
                      "id": "msode6c",
                      "author": "DrStarBeast",
                      "body": "My man, thank you!",
                      "score": 2,
                      "created_utc": 1747423253.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mhat1op",
      "author": "dakotanorth8",
      "body": "Seagate has had 24TB drives for years. I don’t see how this is some huge leap? And 7k seems right in line with average tech?",
      "score": 0,
      "created_utc": 1741737594.0,
      "replies": []
    },
    {
      "id": "mh7m3j6",
      "author": "Small_Editor_3693",
      "body": "What is this title? The 26TB is the smallest one lmao",
      "score": -9,
      "created_utc": 1741704550.0,
      "replies": [
        {
          "id": "mh7qfag",
          "author": "iamtomas111",
          "body": "Technically it's the biggest one as it's just a single HDD, the rest are multi-bay units using multiples of this HDD.",
          "score": 8,
          "created_utc": 1741705836.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mh8rn8h",
      "author": "WatRedditHathWrought",
      "body": "I wouldn’t put my trust in anything Western Digital anymore.",
      "score": -2,
      "created_utc": 1741716411.0,
      "replies": []
    }
  ]
}