{
  "post": {
    "title": "German Seagate customers say their 'new' hard drives were actually used – resold HDDs reportedly used for tens of thousands of hours | The plot thickens.",
    "author": "chrisdh79",
    "id": "1ictn23",
    "score": 4926,
    "created_utc": 1738157016.0,
    "selftext": "",
    "num_comments": 228,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ictn23/german_seagate_customers_say_their_new_hard/"
  },
  "comments": [
    {
      "id": "m9tgnik",
      "author": "iamonelegend",
      "body": "Didn't Seagate get caught doing this bs a decade ago????????????????? I remember hearing about some Seagate drama when I worked at Circuit City (just to put some age on it). Crazy to see that they are back to their old ways",
      "score": 1179,
      "created_utc": 1738157208.0,
      "replies": [
        {
          "id": "m9thrmc",
          "author": "aitorbk",
          "body": "If I remember correctly (big IF) they used returned desktop and laptop units for external drives.  I am not sure if it was Seagate, but one company did it.  \nI could not find links to it, and that is quite worrisome by itself.",
          "score": 353,
          "created_utc": 1738157618.0,
          "replies": [
            {
              "id": "m9uey0j",
              "author": "Blurgas",
              "body": "Was looking for a new external drive for backups and saw a lot of people saying to just get a regular PC NVME drive and a good enclosure, claiming that the drives used for external drives(*HDD or SSD*) were the \"crappy\" ones that just barely passed inspection",
              "score": 106,
              "created_utc": 1738167937.0,
              "replies": [
                {
                  "id": "m9wjjvd",
                  "author": "ProphetoftheOnion",
                  "body": "The xbox external drives were at one point Hitachi enterprise drives, a friend bought a load and populated their NAS with them, when Amazon sold them with a 50% discount.",
                  "score": 54,
                  "created_utc": 1738188749.0,
                  "replies": []
                },
                {
                  "id": "m9ukxm8",
                  "author": "Smooth-Zucchini9509",
                  "body": "Did you see the Tik tok of the kid that goes to Goodwill or donating service for the old DirecTV hook up boxes and just removes the HD? I think the one shown in the video was 512GB. He got the box for like $3.",
                  "score": 41,
                  "created_utc": 1738169602.0,
                  "replies": [
                    {
                      "id": "m9v1qf7",
                      "author": "UhOhOre0",
                      "body": "I got a few 1tb HDD doing this method",
                      "score": 36,
                      "created_utc": 1738174165.0,
                      "replies": []
                    },
                    {
                      "id": "m9vybum",
                      "author": "AdmiralTassles",
                      "body": "Make sure you check model numbers though. Many of them have <100GB.",
                      "score": 17,
                      "created_utc": 1738183054.0,
                      "replies": []
                    },
                    {
                      "id": "m9wp1iz",
                      "author": "sharkbait-oo-haha",
                      "body": "I've been doing this for a decade. I used to buy/refurbish ex corporate laptops, they never come with HDDs for security reasons. Meanwhile the local cable company makes their set top boxes obsolete every 2-4 years for profit reasons. \n\nAlways worked out pretty well for me.",
                      "score": 10,
                      "created_utc": 1738190311.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ma03adi",
                  "author": "gerwen",
                  "body": "It's fairly well known in the home-server crowd that 'shucked' drives (external drives with the enclosures removed) are lower quality than drives purchased bare.  \n\nThese are guys that routinely buy used drives to plunk in servers, and tend to avoid externals.  Not sure where the knowledge stems from, but I expect it comes from reality and not some nonsense reason.",
                  "score": 3,
                  "created_utc": 1738241865.0,
                  "replies": [
                    {
                      "id": "ma0ak86",
                      "author": "kermityfrog2",
                      "body": "I think it was more that external drives only listed their capacity as a spec. Not usually drive speed or other specs. So it was a grab bag what you could end up with. Slower speed drives, ones that ran on less power, etc.",
                      "score": 7,
                      "created_utc": 1738244603.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m9uysbo",
                  "author": "FingerTheCat",
                  "body": "That's a good morsel of food for thought",
                  "score": 0,
                  "created_utc": 1738173363.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9vy8e3",
              "author": "esperlihn",
              "body": "I work for a large tech company and I remember one of our clients cancelled a massive order of external seagate harddrives. They refused to take them back so we decided to just shuck the drives to remove the HDD inside and use them for internal projects.\n\nThese cheap retail external hardrives had enterprise class seagate exos drives inside them??? We tested them and they were all good, most of them gave veen running in our internal servers for over 5 years now...\n\nNo idea wtf those guys are doing over there but hey a win is a win I suppose.",
              "score": 42,
              "created_utc": 1738183028.0,
              "replies": [
                {
                  "id": "m9w1sze",
                  "author": "Swastik496",
                  "body": "lol r/datahoarder loved those drives.",
                  "score": 17,
                  "created_utc": 1738183975.0,
                  "replies": []
                },
                {
                  "id": "m9whsxt",
                  "author": "InstanceNoodle",
                  "body": "No. Not all are exos.\n\n\n20tb was shuck as barracuda.\n\n\nIt has random drives. But you are right. If you hit the exos, you have half-price exos.",
                  "score": 10,
                  "created_utc": 1738188265.0,
                  "replies": []
                },
                {
                  "id": "m9xeqwp",
                  "author": "Lettuphant",
                  "body": "With similar insanity, I had a 6TB WD \"book\" drive that got absolutely *mangled* by their own backup software, which deleted everything in a catastrrophic overwrite way, without prompting.\n\nAfterward, it read and acted as an 11TB drive. And it didn't seem to be an error: I can fill that thing to the brim. Heck, I'm using it to ferry stuff between my NAS and Backblaze right now.",
                  "score": 8,
                  "created_utc": 1738198243.0,
                  "replies": [
                    {
                      "id": "m9ypg5n",
                      "author": "Party_Cold_4159",
                      "body": "Wonder if it was a factory RAID array or something",
                      "score": 3,
                      "created_utc": 1738214739.0,
                      "replies": []
                    },
                    {
                      "id": "m9ypy0b",
                      "author": "Wide-Rooster-751",
                      "body": "11 TB? I've never heard of any 11 TB Western Digital drive",
                      "score": 3,
                      "created_utc": 1738214963.0,
                      "replies": [
                        {
                          "id": "m9zle72",
                          "author": "Lettuphant",
                          "body": "Yeah, that's probably just down to TiB vs TB. \\~11,000 GiB",
                          "score": 7,
                          "created_utc": 1738232913.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9y7si8",
              "author": "rudyattitudedee",
              "body": "Why because maybe you didn’t remember correctly so you may be losing time again?",
              "score": 1,
              "created_utc": 1738207769.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9tia32",
          "author": "shitty_mcfucklestick",
          "body": "Interesting - around a decade ago or so, I had a batch of computers I had bought for some staff, all had seagate hard drives in them. Out of 9, 7 failed in the matter of about 2 years. Click of death, etc. I don’t know if I hit the worst batch of drives ever made, but at that point I pretty much boycotted Seagate and haven’t bought them since. Now you make me wonder if it was because those drives were already near failure when I bought them.",
          "score": 88,
          "created_utc": 1738157802.0,
          "replies": [
            {
              "id": "m9tk5qc",
              "author": "aitorbk",
              "body": "Quite a few models from several manufacturers were bad.,  \nIBM *Deskstar* 75GXP was known as Deathstar.  I had to return quite a few.  \nQuantum bigfoots.  Even worse than the above IMHO, and on top, slow.  \nWD Caviar AC.  Same as deskstart, and I had to eat the cost of one of the failed ones as the customer returned it the last day of warranty and I had a non covered day of warranty with that wholesale distributor.  the failure was intermitent.",
              "score": 47,
              "created_utc": 1738158470.0,
              "replies": [
                {
                  "id": "m9u1f05",
                  "author": "Bdr1983",
                  "body": "Oh, the deathstars... that's a LONG time ago. I collected them at work.",
                  "score": 23,
                  "created_utc": 1738164053.0,
                  "replies": [
                    {
                      "id": "m9vpgoo",
                      "author": "braytag",
                      "body": "You think the deathstar was a long time ago... Jesus the Quantum bigfoots... weren't those 5 1/4 drives?\n\nLike, in the Elden times, the times of legends!",
                      "score": 6,
                      "created_utc": 1738180621.0,
                      "replies": [
                        {
                          "id": "m9w1c8z",
                          "author": "Ceristimo",
                          "body": "Hell yeah they were. The size of a CD-ROM drive. I had a 6GB Quantum Bigfoot in the late ‘90’s. Big ol’ beast. Noisy too. But those 6GB’s felt like near infinite storage space. It could hold like so many floppy disks, man!",
                          "score": 4,
                          "created_utc": 1738183853.0,
                          "replies": [
                            {
                              "id": "m9wyo37",
                              "author": "cat_prophecy",
                              "body": "I remember buying a 40GB HDD and being like \"I'll never fill this!\".",
                              "score": 6,
                              "created_utc": 1738193182.0,
                              "replies": [
                                {
                                  "id": "ma5qxvw",
                                  "author": "ymbfa",
                                  "body": "80MB HDD in 1989, same thought.",
                                  "score": 1,
                                  "created_utc": 1738307857.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m9wi05x",
                              "author": "braytag",
                              "body": "about 6 thousands of them LOL",
                              "score": 2,
                              "created_utc": 1738188321.0,
                              "replies": [
                                {
                                  "id": "ma1bqq5",
                                  "author": "TheSmJ",
                                  "body": "*4,166 of them.",
                                  "score": 2,
                                  "created_utc": 1738255910.0,
                                  "replies": [
                                    {
                                      "id": "ma2h1fd",
                                      "author": "braytag",
                                      "body": "pfff...  MB are like sexual identities these days...  1000kb, 1024kb... pfff my floppies identify as 1000kb disks :p",
                                      "score": 1,
                                      "created_utc": 1738267251.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m9wn2pc",
                          "author": "SatansFriendlyCat",
                          "body": "I loved the feel of those drives. They looked so structural, with huge ridges. And they were always extra cold to the touch when not in use, because they are a big heatsink which wicks the warmth from your hand. Nice and heavy, too. Just fun to hold.",
                          "score": 3,
                          "created_utc": 1738189743.0,
                          "replies": []
                        },
                        {
                          "id": "m9xlpr5",
                          "author": "ol-gormsby",
                          "body": "I was sysadmin on an IBM AS/400 in the late 80s to about Y2K. Big ol' things they were, about the size of a large upright refrigerator.\n\nWe ordered a storage upgrade and I watched the field tech do the replacement.\n\nWinchester 5 1/4\" drives. When I asked why IBM didn't make their own, he said it wasn't the drives that made the difference, it was the storage controller. He must have been right, we only had one failure and the controller gave us plenty of warning. Ring the support number, quote the machine's serial number and the error code, and a replacement was onsite that day.\n\nBut I suspect those Winchester drives were special IBM orders.",
                          "score": 1,
                          "created_utc": 1738200471.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m9vbg1y",
                      "author": "Dickulture",
                      "body": "Glass platters right? Seemed like a good idea in theory but bad idea when you consider there's a chance glass can shatter even if you're not doing anything.  One tiny flaw, one weird temp fluctuation, one temblor from shifting tectonic plate, or even a fart from an ant in your computer and it's dead and unrecoverable.",
                      "score": 7,
                      "created_utc": 1738176795.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m9umrq0",
                  "author": "Aimhere2k",
                  "body": "I remember the \"stiction\" problem, where hard drives would fail to spin up at power-on unless you gave them a sharp tap. The manufacturer applied too much of a lubricant coating to the platters, so when the heads parked in the landing zone at power-off, they became stuck in the lubricant. \n\nI forget which manufacturer that was, though.",
                  "score": 9,
                  "created_utc": 1738170105.0,
                  "replies": [
                    {
                      "id": "m9yhuf1",
                      "author": "redlinezo6",
                      "body": "I believe it was western digital. Had to replace hundreds of those things in the DC I was at.",
                      "score": 1,
                      "created_utc": 1738211529.0,
                      "replies": []
                    },
                    {
                      "id": "m9yk6z8",
                      "author": "PamtasticOne",
                      "body": "Yup, I remember having to pull out a hard card and snap it like a whip to get it to move every couple of weeks. Fun times!",
                      "score": 1,
                      "created_utc": 1738212480.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m9vp6mq",
                  "author": "DonutConfident7733",
                  "body": "Just a month ago I booted up one of my old pcs one last time before taking it apart, has 20GB IBM Deskstar from 2000. It worked well and I made a backup of the files, only one bad sector corrupted one file and it tried a lot to read it. I had installed Win Xp on it around 2017 or so. It's amazing it still works well, XP used 250MB out of 756MB installed, but had trouble with expired root certificates, had to install a different browser to use the internet.\n\nMeanwhile, WD 1TB Blue hdd from 2018 had 6 weak sectors recently, after just one year since a similar problem that forced me to backup all data, format it and copy back.\nAfter format the weak sectors get considered good so no bad sectors increase. But I don't trust it. What happens is signal degrades after one or two years and it can't read properly the data in some sectors. So I made a partition in that area and labeled it WEAK to avoid placing important data there.\n\nAnother funny story - Seagate Barracuda 320GB from 2007 had some strange chirping sounds from time to time. After I bought it, I went back to store and tell the seller it makes strange noises. He said, if you have any trouble with the data, just bring it back and we exchange it on warranty.\nAfter 17 years, the hdd still works and chirps from time to time, the shop I bought it from is no more...",
                  "score": 6,
                  "created_utc": 1738180544.0,
                  "replies": []
                },
                {
                  "id": "m9tyd4i",
                  "author": "diuturnal",
                  "body": "The Hitachi Ultradeath still ultra deaths in 2025.",
                  "score": 9,
                  "created_utc": 1738163131.0,
                  "replies": [
                    {
                      "id": "m9u2uda",
                      "author": "None",
                      "body": "They should stick to making….massagers.",
                      "score": 9,
                      "created_utc": 1738164477.0,
                      "replies": [
                        {
                          "id": "m9uno7p",
                          "author": "therealfalseidentity",
                          "body": "Mine has produced a lot of m..... massages. \n\nSeagate is the worst big-name HDD manufacturer.",
                          "score": 4,
                          "created_utc": 1738170355.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9udoyy",
              "author": "hardolaf",
              "body": "The click of death was because of damage to their production line during a tsunami that they never bothered to fix in a timely manner. And they shipped a bunch of bad parts out the door despite them failing quality control.",
              "score": 9,
              "created_utc": 1738167588.0,
              "replies": []
            },
            {
              "id": "m9tjy1y",
              "author": "AlexZhyk",
              "body": "There was once a problem with program of controllers in some of HDD. Really annoying one, but people found way of de-bricking some of them back. I was the lucky one, who recovered content and I am still using that drive in my self-built NAS at home for more than 10 years now :)",
              "score": 7,
              "created_utc": 1738158394.0,
              "replies": [
                {
                  "id": "m9ubytf",
                  "author": "karma_the_sequel",
                  "body": "Still using it? You’re braver than I am.",
                  "score": 8,
                  "created_utc": 1738167101.0,
                  "replies": [
                    {
                      "id": "m9up044",
                      "author": "AlexZhyk",
                      "body": "Yep. In raid1 and with data duplicated to some other location anyway.",
                      "score": 3,
                      "created_utc": 1738170721.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m9tzuen",
                  "author": "inventurous",
                  "body": "Which ones were these? I had one that was an external that bricked and have saved it all these years hoping to find a way to recover whatever's on it. Read at the time that it might have had to do with an encryption card failure but eventually gave up on it.",
                  "score": 2,
                  "created_utc": 1738163581.0,
                  "replies": [
                    {
                      "id": "m9ur1ex",
                      "author": "AlexZhyk",
                      "body": "Yes, it was external drive in USB casing. I don't remember details of revovery, but I had to buy USB to serial cable. remove the drive and connect to dedicated i2c port on that hard drive and then send some commands through terminal. But the change itself was about changing few bits at certain address..\n\nThe reason of failure in my case was faulty controller firmware. I didn't use any encryption.",
                      "score": 3,
                      "created_utc": 1738171274.0,
                      "replies": []
                    },
                    {
                      "id": "m9u7a5v",
                      "author": "Annoyingly-Petulant",
                      "body": "If it reads sg-sanitize —crypto /dev/what ever your drive is.\n\nResearch first please i could be wrong.",
                      "score": 2,
                      "created_utc": 1738165771.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9ua8an",
              "author": "ChemNerd86",
              "body": "IIRC yes, it was seagate and the reason I have not bought another seagate drive since.",
              "score": 6,
              "created_utc": 1738166609.0,
              "replies": [
                {
                  "id": "m9upxbw",
                  "author": "ABirdOfParadise",
                  "body": "Oh yeah that 7200.11 disaster",
                  "score": 2,
                  "created_utc": 1738170973.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9w0is0",
              "author": "DatTF2",
              "body": "I bought 2 Seagate drives around a decade ago. Both died. I don't trust Seagate.",
              "score": 3,
              "created_utc": 1738183637.0,
              "replies": []
            },
            {
              "id": "m9ttyql",
              "author": "this_dudeagain",
              "body": "Seagate sorted out their issues a long time ago. I had a Seagate compute drive die recently after getting constant use in a Plex server over almost 6 years. It did about as good as any enterprise drive would've and cost only 90 bucks when I bought it. More important to have a good warranty and redundancy these days.",
              "score": 4,
              "created_utc": 1738161755.0,
              "replies": []
            },
            {
              "id": "m9wgh9r",
              "author": "Vectorman1989",
              "body": "Seagate had an issue around 2010 where certain 7200 drives bricked themselves due to bad firmware.",
              "score": 2,
              "created_utc": 1738187903.0,
              "replies": [
                {
                  "id": "mai9ohm",
                  "author": "shitty_mcfucklestick",
                  "body": "That tracks with what I experienced and what everybody’s describing. I don’t think the drives even cost that much, but restoring backups did.",
                  "score": 1,
                  "created_utc": 1738473796.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9tto7d",
              "author": "Buckminsterfullabeer",
              "body": "Maybe 20 years ago their QC at their thai plants went to crap after the tsunami, and it persisted for years after. Expecially on their drives with an odd number of gbs. Backblaze did a great analysis of the problems they were seeing. I've only bought Hitachi since.",
              "score": 2,
              "created_utc": 1738161660.0,
              "replies": []
            },
            {
              "id": "m9z92nb",
              "author": "SorcererDP",
              "body": "Same. The warranty replacement drives were just as bad as the ones they replaced. I've boycotted them ever since.",
              "score": 1,
              "created_utc": 1738225200.0,
              "replies": [
                {
                  "id": "mai9fau",
                  "author": "shitty_mcfucklestick",
                  "body": "I was considering an RMA after one or two but after seeing how many died I didn’t trust I wouldn’t be doing it again soon. Went back to Western Digital mostly until SSD’s came out and changed everything.",
                  "score": 2,
                  "created_utc": 1738473689.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9tk8z8",
              "author": "BeatKitano",
              "body": "Rosewood ? That's the model line that turned me away from seagate drives (even though most manufacturers had their bad models, those were truly awful)",
              "score": 1,
              "created_utc": 1738158501.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9tleah",
          "author": "sorrylilsis",
          "body": "Looks like it's more a reseller scam than a Seagate one. \n\n If I had to guess some marketplace vendors got their hands on used disks from datacenters, messed around with the software and tried to sell them as new. \n\nYou don't blame the car manufacturer for a used car salesman messing with the odometer ...",
          "score": 30,
          "created_utc": 1738158900.0,
          "replies": [
            {
              "id": "m9tpy37",
              "author": "None",
              "body": "[deleted]",
              "score": 23,
              "created_utc": 1738160447.0,
              "replies": [
                {
                  "id": "m9tsc47",
                  "author": "sorrylilsis",
                  "body": "The article isn't exactly clear about where the drive were actually bought. \n\nIf it was through a marketplace like Amazon, chances Amazon wasn't directly involved. Could be the same reseller on multiple marketplaces.\n\nAnd even if it was sold directly by the retailer, those guys don't necessarily buy directly to the manufacturer. Wholesalers and importers are often involved. A german one could have been compromised.\n\nI would honestly be very surprised if Seagate itself was involved in that. I don't see them buying back old drives to sell them back as new. Hard disk manufacturers already have a legit refurbished disks sale channel. Lots of good deals to be made there actually. \n\nSketchy chinese wholesalers though ? That's very much their alley. There is a whole industry of counterfeit components out there.",
                  "score": 4,
                  "created_utc": 1738161227.0,
                  "replies": [
                    {
                      "id": "m9tuu69",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 16,
                      "created_utc": 1738162033.0,
                      "replies": [
                        {
                          "id": "m9u1v3i",
                          "author": "sorrylilsis",
                          "body": "Personally, I'd bet a beer on a marketplace seller rather than a contaminated supply chain or Seagate doing some fuckery in their side.\n\nThose have been a scourge to online retailers since most big names use them these days and most buyers don't actually look at who is selling to them. And yeah that makes recommended retailers list often moot.",
                          "score": 1,
                          "created_utc": 1738164186.0,
                          "replies": []
                        },
                        {
                          "id": "m9uprnf",
                          "author": "ThePretzul",
                          "body": "“With a number of them also being official retailers” means that most of them weren’t official retailers or else they would have at least said that most of them were. \n\nWhich means marketplaces like Newegg, Walmart, and Amazon are most likely among the list of “official retailers” that are involved (if they’re not the entire list of them) since all 3 of those platforms allow 3rd party sellers. If anything I’d say this makes the sketchy wholesaler/distributor theory even more likely.",
                          "score": -1,
                          "created_utc": 1738170930.0,
                          "replies": [
                            {
                              "id": "mal67jw",
                              "author": "Perfect_Opinion7909",
                              "body": "Walmart and Newegg don’t operate in Germany.",
                              "score": 1,
                              "created_utc": 1738518329.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ma0dwjy",
                      "author": "N2-Ainz",
                      "body": "The article is a bad copy of the original\n\nhttps://www.heise.de/en/news/Fraud-with-Seagate-hard-disks-Dozens-of-readers-report-suspected-cases-10259237.html",
                      "score": 2,
                      "created_utc": 1738245770.0,
                      "replies": [
                        {
                          "id": "ma0gj02",
                          "author": "sorrylilsis",
                          "body": "Ah it's a bit clearer but the fact that they don't say if the drives were bought directly or through third party is annoying. \n\nIf I was still a tech journalist that would have been the first thing I would have checked out.",
                          "score": 1,
                          "created_utc": 1738246656.0,
                          "replies": [
                            {
                              "id": "ma0h52k",
                              "author": "N2-Ainz",
                              "body": "Seagate usually won't disclose any info who bought the drives originally and I guess the official partners won't tell the names either, as Germany has very strict privacy laws. However, I had the same issue and wrote with Seagate and they told me my drive was sold to a chinese company from Mongolia.",
                              "score": 1,
                              "created_utc": 1738246854.0,
                              "replies": [
                                {
                                  "id": "ma0igk1",
                                  "author": "sorrylilsis",
                                  "body": "I mean you don't need to check with Seagate. Just asking the buyers where exactly they bought it, direct from seller or marketplace would be a good start. \n\nYour case is interesting though, seems like it's a case of a shady wholesaler, maybe trying to cut costs by buying in other markets instead of the local channels. Would not be the first time, I remember talking with a very pissed off TV manufacturer because a whole bunch of TV ended up for sale on a french retailer. The only problem is that those TVs were intended for another market and had different software versions. With a bunch of customers then coming pissed to complain to the manufacturer. Using the grey market is a good way to get scammed tbh.",
                                  "score": 1,
                                  "created_utc": 1738247279.0,
                                  "replies": [
                                    {
                                      "id": "ma0jm2n",
                                      "author": "N2-Ainz",
                                      "body": "The article includes that. Mindfactory, Alternate, Reichelt, Boettcher, JB, etc... I ordered mine from an official partner, who is also known as a huge company amd trusted seller (not Amazon) in Germany but that was before this article got published. After I read that, I thought that I apparently didn't get a bad batch but was sold a bad drive. The first article is pretty bad and Heise has added way more information to this topic as they were the ones to report this issue\n\nEdit: My issue is that official partner sell these drives too which makes it really hard to get original and new drives from a trusted source, because the trusted source is apparently also not trustable due to multiple reports confirming this. That is sth Seagate is to blame for, because trusted partners should never be able to sell drives sourced from third parties, that's why they are official partners",
                                      "score": 1,
                                      "created_utc": 1738247654.0,
                                      "replies": [
                                        {
                                          "id": "ma0mxdk",
                                          "author": "sorrylilsis",
                                          "body": "> That is sth Seagate is to blame for, because trusted partners should never be able to sell drives sourced from third parties, that's why they are official partners\n\nThats ... Not how any of this works. \nA brand doesn't have control over what a resseller do. \nI mean they can punish them after the fact and depending on the contract maybe sue them but you vastly overestimate how much a manufacturer has control over what sellers do. \n\nHell the vast majority of ressellers never even interact with the manufacturer in the first place. They get their products through distributors or wholesalers.\n\nEdit : just digged into it because I was curious. Authorised ressellers in the program don't buy directly with Seagate but are supposed to go through autorised distributors. So it would point to a tainted distributor since so many shops are affected. \nIt's in the realm of possibility that Seagate themselves sold some old drives as new but the odds are low tbh, this would be a suicidal move on so many levels ...",
                                          "score": 2,
                                          "created_utc": 1738248714.0,
                                          "replies": [
                                            {
                                              "id": "ma0rfya",
                                              "author": "N2-Ainz",
                                              "body": "They definitely can. Any partner that buys from non authorized distributions will automatically be removed from the partnership program. Problem fixed",
                                              "score": 1,
                                              "created_utc": 1738250103.0,
                                              "replies": [
                                                {
                                                  "id": "ma0t0th",
                                                  "author": "sorrylilsis",
                                                  "body": "I mean they can be punished after the fact. \n\nBut partnership programs are not that important, those are mostly training ressources, marketing material and a nice \"authorized resseler\" badge. It's not exactly the show stopper you seem to imagine it to be. Hell they can't block you from buying or selling the products you manufacture.",
                                                  "score": 1,
                                                  "created_utc": 1738250578.0,
                                                  "replies": [
                                                    {
                                                      "id": "ma0tewz",
                                                      "author": "N2-Ainz",
                                                      "body": "For me they are. I only buy from official partner because I expect a drive with 5 years of warranty to be a guarantuee when I order one. These partners are now selling OEM drives more commong and apparently they aren't even new but used on top of that. This just means that I will go to a different brand without such common issues",
                                                      "score": 1,
                                                      "created_utc": 1738250696.0,
                                                      "replies": [
                                                        {
                                                          "id": "ma0un1s",
                                                          "author": "sorrylilsis",
                                                          "body": "You do you ! \n\nBut the reality is that the vast majority of people don't give a flying f*ck. I mean it's been 25 years and the vast majority of buyers still don't understand the difference between buying from Amazon or the marketplace. \n\nI've worked in the industry for a few years. You very quickly loose any illusions about how savy buyers are. :'D",
                                                          "score": 1,
                                                          "created_utc": 1738251053.0,
                                                          "replies": [
                                                            {
                                                              "id": "ma0utrf",
                                                              "author": "N2-Ainz",
                                                              "body": "The majority doesn't give a fuck? They definitely will after finding out that they ordered a new drive and received one with 30k+ hours for the full price. This is a huge scandal and not a small issue",
                                                              "score": 0,
                                                              "created_utc": 1738251107.0,
                                                              "replies": [
                                                                {
                                                                  "id": "ma0w8sv",
                                                                  "author": "sorrylilsis",
                                                                  "body": "Again : yeah they don't care. \n\nThe few hundred buyers will be pissed. Some people will read about it and will change brands. \n\nThe vast majority of people will never even hear about it. Again : this was my job and an industry I spent more than a decade in and I Can tell you you vaaaastly overestimate the actual sales impact tech scandals have other than on the short term.",
                                                                  "score": 1,
                                                                  "created_utc": 1738251521.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "ma0wegr",
                                                                      "author": "N2-Ainz",
                                                                      "body": "I'm pretty sure that a lot of enterprise buyers will hear about that and check because they aren't the average customer without technical knowledge",
                                                                      "score": 1,
                                                                      "created_utc": 1738251567.0,
                                                                      "replies": [
                                                                        {
                                                                          "id": "ma0xjix",
                                                                          "author": "sorrylilsis",
                                                                          "body": "Datacenters and system integrators work directly with manufacturers, and on a scale that is order of magnitudes bigger than retail. \n\nWill they look into it ? Yeah. \nWill they stop purchases because a few dozen cases of fuckery in retail channels ? Lol nope, they'll be a bit more carefull when their order arrive and the show will go on.",
                                                                          "score": 1,
                                                                          "created_utc": 1738251896.0,
                                                                          "replies": []
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ma0ednw",
                  "author": "N2-Ainz",
                  "body": "Money. OEM drives are cheaper to buy and sell and therefore they prefer them over official drives. This also opened issues for Seagate because we now have official partners selling scam drives which undermines the trust of customers because where are you now getting real drives if even the official sellers are scamming you unknowingly? Seagate needs to step up real quick and forbid official partners to source drives from anywhere else except from them without clearly labelling it",
                  "score": 1,
                  "created_utc": 1738245935.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9z8a6f",
              "author": "softwarebuyer2015",
              "body": "tend to agree.   \n\nit's more likely  they are counterfeits that got into the supply chain.",
              "score": 1,
              "created_utc": 1738224719.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9uk2go",
          "author": "OsmerusMordax",
          "body": "That’s what I recall too, and is why all my hard drives/ssds have been WD now. Used to be a Seagate gal…",
          "score": 3,
          "created_utc": 1738169364.0,
          "replies": [
            {
              "id": "m9z0xu1",
              "author": "Zomunieo",
              "body": "WD had their own scandal with passing off SMR disks as CMR without informing customers. This most works until a drive fails, meaning the RAID array/ZFS pool has to be resilvered, which almost certainly cause a cascade of other SMR failures. Fortunately they owned up to it and replaced their shit on demand, anyway. But many people lost a lot of data due to this. \n\nToshiba is the devil I don’t know, but I may order my next batch from them anyway.",
              "score": 3,
              "created_utc": 1738220449.0,
              "replies": [
                {
                  "id": "m9zjlfu",
                  "author": "OsmerusMordax",
                  "body": "I do actually have a few SSDs that are Toshiba, no issues so far.",
                  "score": 2,
                  "created_utc": 1738231821.0,
                  "replies": []
                },
                {
                  "id": "ma09mpv",
                  "author": "N2-Ainz",
                  "body": "My latest experience with them is pretty good. Received no OEM drives, ran quieter and cooler than their Exos counterpart and cost less. After this whole thing with official partner selling OEM drives that are apparently used drives too, I am taking a break from Seagate till they fix that issue",
                  "score": 1,
                  "created_utc": 1738244272.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9tj7rc",
          "author": "DjScenester",
          "body": "CC guy checking in… I miss that store.",
          "score": 6,
          "created_utc": 1738158136.0,
          "replies": [
            {
              "id": "m9tm34j",
              "author": "iamonelegend",
              "body": "I do too. The lack of competition has let the few other tech stores left to be kinda lame",
              "score": 3,
              "created_utc": 1738159138.0,
              "replies": [
                {
                  "id": "m9ttz2s",
                  "author": "None",
                  "body": "CC was so poorly run along with CompUSA. They expanded so quickly there was no way they wouldn’t fail. \n\nMicro Center is the shining example of how it should be done.",
                  "score": 3,
                  "created_utc": 1738161758.0,
                  "replies": [
                    {
                      "id": "m9tvw3b",
                      "author": "Allsgood2",
                      "body": "Fry's was so much better than Micro Center.  You could get everything, in store, to build a rig, from the case to the thermal paste to cards and beyond.  It was like have a Computer Shopper store!  They had a cafe in the middle to get coffee and sit around with the other computer aficionados.  So many options available for anything you would want.  The one in Las Vegas even had a casino theme going on.  It was so much better than Micro Center except in the ability to stay open.\n\nWhen I lived on the East coast I would go to the local Micro Center.  It does have what you need but it is so bland and doesn't have as much as Fry's did.  Still better than Staples or Best Buy!",
                      "score": 4,
                      "created_utc": 1738162364.0,
                      "replies": [
                        {
                          "id": "m9txpe8",
                          "author": "None",
                          "body": "Compared to the ones in California that had deeper theming, vegas was, well... Weak. Still fun, but 100% of the photos you saw around the border of the store you can find on the UNLV Archives.\n\nOnce you got past the slot machine outside and the stacks of coins, eh. There was a frys in the midwest or back east? That looked like the vegas one interior wise sans the theming",
                          "score": 3,
                          "created_utc": 1738162926.0,
                          "replies": [
                            {
                              "id": "m9u3ftg",
                              "author": "Allsgood2",
                              "body": "I was fortunate enough to live near the Fry's in Oxnard, CA in the 2000's.  It was like walking into a dream.  I geeked out in there all the time.\n\nI got scared once though.  I bought a external DVD burner in 2006 (when they were about $100).  Got home and plugged it in and it would not work.  I went back to the store and the return section.  The dude at the counter said \"the serial number on the drive does not match the one on the box.\"  Someone swapped out a bad one for a good one and Fry's restocked it.  I though for sure they were going to deny my return but the manager, after looking at me suspiciously, let me get a replacement.\n\nI am sure their lack of control of inventory didn't help with them keeping the doors open.",
                              "score": 4,
                              "created_utc": 1738164655.0,
                              "replies": [
                                {
                                  "id": "m9xnua2",
                                  "author": "None",
                                  "body": "Oh the Vegas one always had dubious junk in it.\n\nRemember CPU Coolers/Fans near the front. One of them was so so obviously a return scam and they just dropped it back on the shelf, and even had the balls to mark it down discounted.\n\nLooked like a fan from the Mid 90's or so Pentiums, still caked in dust even. Helen Keller saw that return coming...\n\nBet it's still in the building along with the Roaches hanging out at the cafe /s",
                                  "score": 1,
                                  "created_utc": 1738201160.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m9ulunr",
                          "author": "Xanthus179",
                          "body": "All the parts you needed plus a case of Bawls to keep you awake while you build.",
                          "score": 3,
                          "created_utc": 1738169853.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m9wiopf",
          "author": "None",
          "body": "[deleted]",
          "score": 3,
          "created_utc": 1738188510.0,
          "replies": [
            {
              "id": "m9x22sz",
              "author": "accidental-poet",
              "body": "Seagate and WD, as well as several other manufacturers who provide parts. That was a dark time as a system builder.",
              "score": 2,
              "created_utc": 1738194243.0,
              "replies": []
            },
            {
              "id": "m9wxo5k",
              "author": "iamonelegend",
              "body": "That's right! I remember the days of a $220 $500 GB desktop hard drive...",
              "score": 1,
              "created_utc": 1738192875.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9vaxh6",
          "author": "Dickulture",
          "body": "Those who don't remember from the history are doomed to repeat it. Or something like that.  I'm sure FTC will harass Seagate for selling garbage.",
          "score": 2,
          "created_utc": 1738176656.0,
          "replies": []
        },
        {
          "id": "m9wvaya",
          "author": "Johnsoid",
          "body": "CC was one of my first jobs. Still remember the jingle.",
          "score": 2,
          "created_utc": 1738192152.0,
          "replies": []
        },
        {
          "id": "m9ubqvx",
          "author": "karma_the_sequel",
          "body": "LOL Circuit City was more than a decade ago.",
          "score": 3,
          "created_utc": 1738167038.0,
          "replies": []
        },
        {
          "id": "m9tvm2m",
          "author": "sceadwian",
          "body": "I seem to recall something like that. Another one as well where they had cluster failures in a particular line.\n\nMy father was doing his first fault tolerant system on hardware that failed faster than it could be replaced.\n\nThey nearly lost the entire network from a raid failure. That was back in the dark early days of raid arrays though. Recovering a drive from parity took forever.",
          "score": 2,
          "created_utc": 1738162278.0,
          "replies": []
        },
        {
          "id": "m9wo2rw",
          "author": "spin81",
          "body": "I am in the market for some new drives. WD it is, then.",
          "score": 1,
          "created_utc": 1738190032.0,
          "replies": []
        },
        {
          "id": "m9wz1rz",
          "author": "stellvia2016",
          "body": "In this case, it's probably related to their recent introduction of certified used/refurbed drives for sale. Some batch probably got mixed up and sold as new on accident. I highly doubt they would do it intentionally given, as these customers pointed out: The usage data was still on the drives.",
          "score": 1,
          "created_utc": 1738193301.0,
          "replies": []
        },
        {
          "id": "ma096ou",
          "author": "Somestunned",
          "body": "Seagategate part 2.",
          "score": 1,
          "created_utc": 1738244111.0,
          "replies": []
        },
        {
          "id": "ma21rdc",
          "author": "Statharas",
          "body": "I will absolutely never buy Seagate. Back in 2013, I bought a laptop which had an overheating Seagate drive. I still remember the cycling redundancy errors.\n\nI had the store replace it, they put in another drive, still from Seagate. That new drive also started overheating after a while.\n\nThe shop then switched to a WD drive, which I had for over 6 years.",
          "score": 1,
          "created_utc": 1738263050.0,
          "replies": []
        },
        {
          "id": "m9thwtp",
          "author": "FamousFangs",
          "body": "Working at Circuit City comment alone ages this  like atleast 20 years ago.",
          "score": 1,
          "created_utc": 1738157671.0,
          "replies": []
        },
        {
          "id": "m9vbkqx",
          "author": "HandlebarWallace",
          "body": "I think that Apple has started slowing down their phones after an update again too. I will never forgive! -typed from iPhone. \n\nBut I’m not getting a Musk phone. I’m so pissed too because I need the satellite and have been waiting for this upgrade.",
          "score": -1,
          "created_utc": 1738176831.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9tlnla",
      "author": "Sopel97",
      "body": "no sellers mentioned\n\nedit. since SMART was reset and some were OEM drives they appear to me like the typical refurbished ones Seagate provides, so it's most likely a mix up of some sort",
      "score": 163,
      "created_utc": 1738158990.0,
      "replies": [
        {
          "id": "m9tpywe",
          "author": "ballaman200",
          "body": "In the original article from heise they discuss this and came to the conclusion that this isn't an option as the refurbished ones are getting obvious marks on them.\n\n\nHere is a link to the full article:\n\nhttps://www.heise.de/news/Betrug-mit-Seagate-Festplatten-Dutzende-Leser-melden-Verdachtsfaelle-10258657.html",
          "score": 36,
          "created_utc": 1738160455.0,
          "replies": [
            {
              "id": "ma5ginu",
              "author": "FrohenLeid",
              "body": "Thank you and heise ❤️",
              "score": 1,
              "created_utc": 1738302386.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9tluv1",
          "author": "Befuddled_Scrotum",
          "body": "Germany has very strong privacy laws so won’t be surprised if it’s because of that",
          "score": 19,
          "created_utc": 1738159059.0,
          "replies": []
        },
        {
          "id": "ma0a3uz",
          "author": "N2-Ainz",
          "body": "No, this is not the case. These were drives sold as new with a normal label. FARM data was available, while SMART data was wiped (Seagate clears both if it's refurbished). This happened to multiple major sellers in Germany. Seagate Support also said that they weren't refurbished, as I had this issue too with my last drive. They were sold to a chinese company and apparently they resold them to other sellers, even official partners from Seagate. This is a huge issue rn because I'm sure that it affects other countries too and it's not a 'received a refurbished instead of new drive' issue, but a very big scam where used drives get sold as new by third parties",
          "score": 3,
          "created_utc": 1738244442.0,
          "replies": [
            {
              "id": "ma0g332",
              "author": "Sopel97",
              "body": "thanks for the clarification\n\nso if I understand right the sellers are partially to blame as they didn't source the drives from Seagate?",
              "score": 1,
              "created_utc": 1738246512.0,
              "replies": [
                {
                  "id": "ma0gvgo",
                  "author": "N2-Ainz",
                  "body": "We don't have a lot of information about this rn but it hints at the sellers buying drives from an unverified non Seagate source. Some of the listed shops are known for refurbished drives, e.g. JB which hints at an issue with their listing where they either purposefully or accidentally forgot to add that they sell refurbished drives but these drives had the correct label on them. Other shops like Boettcher add to their listing that they sell OEM drives, Mindfactory is no official partner, so it's expected that they get their drives from non official sources. However official partners like Reichelt, Alternate, etc... are apparently selling drives from non Seagate sources which is a huge no go, especially as non of them list these drives as OEM drives which lets you expect to receive retail (bulk for Exos but with 5 years of warranty) drives",
                  "score": 2,
                  "created_utc": 1738246767.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9tz8ji",
      "author": "TheKingOfDub",
      "body": "In the 90s, an Apple dealer replaced my HD (warranty) with a drive that I was able to do an unerase on. I recovered tons of files from what appeared to be a property management company",
      "score": 25,
      "created_utc": 1738163396.0,
      "replies": []
    },
    {
      "id": "m9tmzco",
      "author": "zoobrix",
      "body": "Before people grab their pitchforks Seagate does sell officially refurbished drives at discount prices, clearly marked on their website. So while this could be Seagate pulling a fast one it's also quite possible that retailers are trying to pass off used drives as new or that someone sold them claiming they were new and the retailer assumed they were.\n\nThe article makes it clear what happened here isn't really known, other than that people got used drives listed as new, but third parties trying to profit off reselling used items as new is an old scam, I'd give it a good chance of being the explanation here.",
      "score": 237,
      "created_utc": 1738159448.0,
      "replies": [
        {
          "id": "m9trv53",
          "author": "loopy95",
          "body": "The article also makes clear that refurbished hdds have a green dot remark which the ones mentioned with the higher runtimes do not have. They were bought under the assumption to be new hdds",
          "score": 66,
          "created_utc": 1738161073.0,
          "replies": [
            {
              "id": "m9tt7eb",
              "author": "zoobrix",
              "body": "Although they might have a green dot that is not mentioned anywhere in this article. And in any case the green dot is not removable by someone trying to pass used drives off as new?\n\n\nI am not debating that people bought drives listed as new that turned out to be used but it's not clear if Seagate is responsible for this, or if it's a third party scamming retailers, or even the retailers themselves.",
              "score": 11,
              "created_utc": 1738161510.0,
              "replies": [
                {
                  "id": "ma0ajmq",
                  "author": "N2-Ainz",
                  "body": "The original german article mentions this exact scenario. They aren't refurbished drives but normal drives with a normal label getting sold as new. Refurbished drives also wouldn't have FARM data on them. I was affected by this issue too and they were originally sold to a chinese company according to Seagate Support. This hints at a massive scam going on rn and it probably affects more countries",
                  "score": 1,
                  "created_utc": 1738244597.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9uwyhd",
              "author": "Dt2_0",
              "body": "Also its pretty common knowledge that actually well done refurb drives are pretty dang reliable.\n\nThe biggest issues with hard drives are manufacturing errors, which often effect the entire batch of drives. So generally you buy 20 drives at a time, and one by one, each of them fails. But you replace them with drives out of different batches and they last years. This is a pretty common occurrence in the data center world.\n\nRefurb drives are 1) all from different batches, and 2) have been refurbed after whatever manufacturing error they might have had has been discovered and corrected. Officially refurbed drives are very reliable. You wouldn't buy them for a Data Center, but they are an excellent avenue for a home user with their own mass storage system (IMO the only reason to buy HDDs these days, SSDs are so cheap now there is no reason your primary and secondary storage devices in your computers and external storage devices should be an HDD).",
              "score": 3,
              "created_utc": 1738172876.0,
              "replies": [
                {
                  "id": "m9vr1fw",
                  "author": "IMI4tth3w",
                  "body": "I’m running 12 of the 20TB refurb drives in my NAS with zero issues from serverpartdeals. Although I heard their prices have gone up due to demand.",
                  "score": 4,
                  "created_utc": 1738181060.0,
                  "replies": [
                    {
                      "id": "m9vxfqy",
                      "author": "nicane",
                      "body": "Wow that's some space! I grabbed a bunch of 12tbs from them and they've been solid. I was going to go with 14tb drives or larger but yeah the prices... Reminds me I should grab another 1 or 2 to have as long term spares since I think the prices will be going up more soon.....",
                      "score": 2,
                      "created_utc": 1738182812.0,
                      "replies": [
                        {
                          "id": "m9w5uiv",
                          "author": "IMI4tth3w",
                          "body": "Yeah what really happened is the Google drive unlimited party ended so I had a lot of stuff I needed to move back local. In total my unraid server has about 330TB of usable storage, with dual parity that can handle up to 2 drive failures. Total of 28 drives currently in my array. \n\nI have a 1TB google drive account that is free with my Google fiber internet that I use to backup stuff I care about, and a drop box to triple backup my most important stuff.\n\nLooking to build another NAS at my parents house for additional backup and to set up some stuff over at their place.",
                          "score": 2,
                          "created_utc": 1738185058.0,
                          "replies": [
                            {
                              "id": "m9xda5m",
                              "author": "1fuckedupveteran",
                              "body": "I could lose my hard drive tonight and I wouldn’t bat an eye at it as far as lost data.\n\nWhat do you need 330TB for?",
                              "score": 2,
                              "created_utc": 1738197778.0,
                              "replies": [
                                {
                                  "id": "ma1v4ab",
                                  "author": "N2-Ainz",
                                  "body": "r/datahoarder",
                                  "score": 1,
                                  "created_utc": 1738261240.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m9ucnnp",
          "author": "Duckel",
          "body": "recently got a used and repacked PS4 controller from the PS4 webstore, sold as new. they shipped it from the netherlands to germany. must be some service company doing it for sony...",
          "score": 5,
          "created_utc": 1738167297.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9tkiw7",
      "author": "The_BigDill",
      "body": "Seagate: but it's new to you",
      "score": 39,
      "created_utc": 1738158598.0,
      "replies": [
        {
          "id": "m9zd8zy",
          "author": "Nyremne",
          "body": "This isn't like buying a used car, Seagate. Can't just slap \"certified pre-owned\" on a drive and call it a day.",
          "score": 1,
          "created_utc": 1738227841.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9u64cj",
      "author": "Fredasa",
      "body": "Seagate was the first name in HDDs that I swore off completely.  It's been a good 15 years now.\n\nBut I'm a bit odd in that regard.  I rarely have hardware outright fail while I'm still using it, and I hold a grudge.  Seagate for HDDs; Corsair for RAM (only had RAM fail twice, and both times were the only two times I bought Corsair); AMD for GPUs (the 290X was hyper-overclocked by design, ran unreasonably loud and was by far the hottest component I've ever owned; I was very unsurprised when it straight up died after a year).",
      "score": 12,
      "created_utc": 1738165440.0,
      "replies": []
    },
    {
      "id": "m9tuksl",
      "author": "drcigg",
      "body": "Seagate in the spotlight again.  I would never buy their products after the last scandal.  How they are still in business is beyond me.",
      "score": 17,
      "created_utc": 1738161949.0,
      "replies": [
        {
          "id": "m9tzeys",
          "author": "MrBogardus",
          "body": "What was the last scandal?",
          "score": 3,
          "created_utc": 1738163451.0,
          "replies": [
            {
              "id": "m9u09he",
              "author": "drcigg",
              "body": "Reliability issues..  10 years ago or maybe more.\nLots of brand new drives failing in the first year.\nI had a few fail.  My coworker that builds computers for farmers had over a dozen fail in the span of 6 months.  \nI will never buy them again.",
              "score": 16,
              "created_utc": 1738163708.0,
              "replies": [
                {
                  "id": "m9u8qsv",
                  "author": "UnsorryCanadian",
                  "body": "Yeah, my laptop came with a seagate drive and it just started to die\nReplaced it with a WD and it's been the secondary storage in my desktop\nThat drive is 12 years old now, maybe",
                  "score": 4,
                  "created_utc": 1738166187.0,
                  "replies": []
                },
                {
                  "id": "ma9gov9",
                  "author": "thegodfather0504",
                  "body": "so what do we buy?",
                  "score": 1,
                  "created_utc": 1738357166.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9x6axe",
          "author": "superbovine",
          "body": "HDD market confuses me as they all seem to be bad. Anything that isn't WD Black is bad. Seagate bad on/off for years. Toshiba/Hitachi deathstar scandal. Are there any drive manufacturers out there with a quality track record? I used Seagate drives up until I went full SSD for home use.",
          "score": 2,
          "created_utc": 1738195572.0,
          "replies": [
            {
              "id": "m9x6nzl",
              "author": "drcigg",
              "body": "I have been pretty happy with my Samsung and Sabrent rocket SSD.",
              "score": 1,
              "created_utc": 1738195688.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9tm017",
      "author": "throw123454321purple",
      "body": "Seagate? Shoddy business practices? You don’t say! /s",
      "score": 16,
      "created_utc": 1738159108.0,
      "replies": []
    },
    {
      "id": "m9ueeaz",
      "author": "Xielle",
      "body": "When will people learn to not buy Seagate? They pulled all kinds of shit 10 years ago.",
      "score": 4,
      "created_utc": 1738167784.0,
      "replies": []
    },
    {
      "id": "m9tmsb9",
      "author": "_eg0_",
      "body": "They sell a shit ton of recertified drives with warranty in Germany, over all kinds of retailers. \n \nI've bought plenty of those cheap drives. They are great. \nThe warranty on those recertified drives are new warranties from recertification and not the original ones from when the drives were new.\n \nI wouldn't put it past some of the retailers or a different middleman to purposefully sell them as new. I also wouldn't put it pass Seagate to not care.",
      "score": 8,
      "created_utc": 1738159382.0,
      "replies": [
        {
          "id": "ma0az79",
          "author": "N2-Ainz",
          "body": "It's not refurbished drives getting send out instead of new drives but used drives looking exactly like new drives. Also these drives are getting sold by official partners which hints at them buying from a third party source. Some scammer probably pulled their huge farms, cleared SMART data and sold them to other companies as new",
          "score": 1,
          "created_utc": 1738244749.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9tregh",
      "author": "kanabalizeHS",
      "body": "You guys still using Seagate?",
      "score": 12,
      "created_utc": 1738160922.0,
      "replies": [
        {
          "id": "m9u0ep4",
          "author": "facw00",
          "body": "I mean there are only three manufacturers, and they all have had issues. I'd take Toshiba over Seagate and Western Digital, but none of them strike me as especially trustworthy.",
          "score": 18,
          "created_utc": 1738163751.0,
          "replies": [
            {
              "id": "m9uh805",
              "author": "colostitute",
              "body": "It’s been a while but I always liked WD the best. Has something changed?\n\nI would do Hitachi if the price was substantially lower because I felt they were just as good. Maybe they were better?\n\nI would never trust a Seagate. I did once and it failed in just over a year. Most people I knew would avoid Seagate too.",
              "score": 10,
              "created_utc": 1738168575.0,
              "replies": []
            },
            {
              "id": "m9utyqh",
              "author": "Guyfly21",
              "body": "Hitachi and Western Digital are the same company",
              "score": 5,
              "created_utc": 1738172070.0,
              "replies": [
                {
                  "id": "m9uue93",
                  "author": "facw00",
                  "body": "Shoot, you are right, I had forgotten WD bought out Hitachi. Was thinking of Toshiba when I aid Hitachi.",
                  "score": 2,
                  "created_utc": 1738172188.0,
                  "replies": []
                },
                {
                  "id": "m9zchxl",
                  "author": "beefjerky9",
                  "body": "Yeah, I'm still sad about that one. I'd still trust the Hitachi/WD enterprise drives, but be more careful about their consumer level drives nowadays. \n\nThat said, I have 8 Hitachi 4TB \"Coolspin\" drives that have been chugging along 24/7 for 8+ years. They simply won't die or give any problems, but I'm likely to be retiring them soon, simply due to capacity.\n\nI've also had great luck with some Toshiba 8TB enterprise drives. I've got 8 of them as well that have been chugging along 24/7 for over 7 years, according to the SMART power on hours.\n\nThat said, my luck is that I'll have a drive failure right after I post this, LOL. But, I always have backups, so no biggie.",
                  "score": 1,
                  "created_utc": 1738227362.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9u8ggs",
              "author": "UnsorryCanadian",
              "body": "When did WD drop in reliability? When I replaced my *seagate* laptop drive over 10 years ago I looked up what drives had the best reliability and got a WD, that 2.5 inch drive is still working in my desktop\n\n\nDid they change manufacturing processes?",
              "score": 3,
              "created_utc": 1738166105.0,
              "replies": [
                {
                  "id": "m9upwwc",
                  "author": "facw00",
                  "body": "Reliability may be fine, but business practices seem shady. Selling SMR drives in roles they aren't at all suited for. Selling 7200 RPM drives (with accompanying heat and noise) as 5400 RPM drives. I think they've had a few other things recently? They also had their cloud software delete people's local USB hard drivers. \n\nMay not be the end of the world, but doesn't paint a great picture either.",
                  "score": 8,
                  "created_utc": 1738170969.0,
                  "replies": []
                },
                {
                  "id": "ma01bxj",
                  "author": "Thaodan",
                  "body": "Not exactly HDD related but WD still hasn't fixed the firmware of their dramless SSDs. The bug affects all their SSD lines which don't have dram.\nThe controller randomly stops reacting in 4k lba mode. \nThe bug I known for about 10 years I think.",
                  "score": 1,
                  "created_utc": 1738241068.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9u3mh3",
          "author": "AmNoSuperSand52",
          "body": "Did something happen where we’re not supposed to be using Seagate?",
          "score": 2,
          "created_utc": 1738164710.0,
          "replies": []
        },
        {
          "id": "m9tvr2d",
          "author": "Abigail716",
          "body": "The Exos ones that are in the photo are fantastic. Better rated than WD and cheaper per TB. We use a bunch of them in a raid 6 array for our Plex server. 32 16TB drives with zero issues after about 3 years.",
          "score": 5,
          "created_utc": 1738162321.0,
          "replies": [
            {
              "id": "m9u1jbf",
              "author": "TheRogueMoose",
              "body": "Where are you seeing these ratings? Backblaze's reports show no matter the model Seagate failures are consistently higher then pretty much every other manufacturer.",
              "score": 7,
              "created_utc": 1738164088.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9tz2ct",
          "author": "Fractal-Infinity",
          "body": "I have a couple of Seagates. Most HDD I have are WD.",
          "score": 1,
          "created_utc": 1738163344.0,
          "replies": []
        },
        {
          "id": "m9uhpz8",
          "author": "Doomnezeu",
          "body": "I mean, I have a 2 TB from 7 years ago, a 1 TB that I sold from like 9 years ago and another 1 TB for my security cameras that's 4 years old I think, all still working flawlessly. I guess I'm lucky then? Lots of hate for Seagate in this thread, but I'm thinking of buying a 4 TB one and there aren't many options around.",
          "score": 1,
          "created_utc": 1738168716.0,
          "replies": [
            {
              "id": "m9xh1j6",
              "author": "DemIce",
              "body": "The problem with pretty much all of the anecdotal reports is that they are anecdotal, and other than the manufacturer name and possibly capacity, they couldn't tell you anything more about it.\n\nYou can check things like Backblaze's drive reports, but unless you're using drives from the same batches they do, and use them in the same manner as they do, what do their reports even tell you?\n\nThe reality of the matter is that short of some very obvious issues - whether that's an HDD quickly dying with a clicking sound (IBM Deskstar 75GXP), or an SSD slowing down as the data on it 'ages' (Samsung 840 EVO), or in this case reports of drive activity times being out of line with what one would expect from a new drive - that quickly get discussed, any one drive an option is as good as another given the same characteristics.  \nAny one of them can die an early death if the lottery is against you, and any one of them could outlive your system's natural upgrade paths.\n\nSo if your choice is between a 4TB HDD from Seagate, Western Digital, or Toshiba, figure out what the differences between them are in terms of features (it's an HDD, there's not going to be a whole lot - some might claim higher endurance, but see previous statement), warranty, support, and budget-fitness, and choose based on that rather than manufacturer brand.\n\nAlso make sure you have a viable backup strategy if the data is important. No amount of \"Curse you Brand A who was highly rated when I bought this drive that just died, in hindsight I should have bought Brand B!\" can bring back data - backups can.",
              "score": 2,
              "created_utc": 1738198974.0,
              "replies": [
                {
                  "id": "m9y9yrl",
                  "author": "Doomnezeu",
                  "body": "I know it's anecdotal, but like you said, the choice is basically between Seagate, WD and Toshiba. All of them have good and bad reviews. So far, Seagate has been good to me so that's why I'm inclined to go with them but I might as well go with either of them, won't really matter as I'm not going to store critical files on it. It's just mass storage at this point, the SSDs are doing most of the work these days.",
                  "score": 2,
                  "created_utc": 1738208545.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ma1m0wz",
          "author": "derolle",
          "body": "I have 175 TB of seagate drives that are working fine for years. I buy the refurbished ones and use DrivePool with duplication, so if I lose a drive I just pop in a new one and I don’t lose any files. I haven’t lost any of my 10 drives to date. The price per TB is insane on the refurbished 18-22TB drives, especially with Black Friday / Cyber Monday type sales events. I’ve also had bad luck with seagate in the past but I kept everything on a single drive and had no backups.",
          "score": 1,
          "created_utc": 1738258743.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9tubih",
      "author": "tooeasilybored",
      "body": "7200.11 that's all I have to say. I still remember and I'm still bitter.",
      "score": 7,
      "created_utc": 1738161868.0,
      "replies": [
        {
          "id": "m9tyjmy",
          "author": "schwiggy",
          "body": "Holy shit that just brought back some memories",
          "score": 1,
          "created_utc": 1738163186.0,
          "replies": [
            {
              "id": "m9w8hes",
              "author": "Petersaber",
              "body": "but not the data, probably",
              "score": 1,
              "created_utc": 1738185761.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9tx1ot",
      "author": "kiss_my_what",
      "body": "At least they got something resembling a hard drive and not an actual brick.",
      "score": 3,
      "created_utc": 1738162724.0,
      "replies": []
    },
    {
      "id": "ma1d1if",
      "author": "Seagate_Surfer",
      "body": "Seagate did not sell or distribute these fraudulent drives to resellers. We recommend that resellers only purchase drives from certified Seagate distribution partners to ensure that they purchase and sell only new or factory-recertified Seagate drives. Hard drives that have been refurbished and factory-certified by Seagate and resold as part of the Seagate Drive Circularity Program can be identified by the green-bordered white hard drive label and the designation \"Factory Recertified\". \n\n\nTo report a suspected fraudulent Seagate drive, you can contact Seagate's Ethics Helpline at \nhttps://secure.ethicspoint.com/domain/media/en/gui/38559/index.html",
      "score": 3,
      "created_utc": 1738256268.0,
      "replies": [
        {
          "id": "ma1w1m0",
          "author": "N2-Ainz",
          "body": "Just that these drives also came from official partners as mentioned in the original article from heise\n\nhttps://www.heise.de/en/news/Fraud-with-Seagate-hard-disks-Dozens-of-readers-report-suspected-cases-10259237.html",
          "score": 2,
          "created_utc": 1738261491.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9tzxif",
      "author": "Autisticus",
      "body": "All of my seagate drives have failed over the years. I wont buy them.",
      "score": 5,
      "created_utc": 1738163607.0,
      "replies": [
        {
          "id": "ma060ua",
          "author": "ser_renely",
          "body": "I see little difference to western digital myself.",
          "score": 3,
          "created_utc": 1738242939.0,
          "replies": [
            {
              "id": "ma5yx4f",
              "author": "Yodl007",
              "body": "Same. Even that 3TB seagate that has had more than 50% failure rate is still chugging, meanwhile WD HDDs die lol.",
              "score": 1,
              "created_utc": 1738312614.0,
              "replies": [
                {
                  "id": "ma6p3s4",
                  "author": "ser_renely",
                  "body": "The reason I ended up using Seagates was 14 years ago I needed to replace a warranty hdd. I needed to use usps and they initially said they can't send via usps, quickly the head of support made the replacement happen via usps.  I appreciated that so i kept using them and haven't really had issues.\n\n Anyhow, I have had failures over the decade plus but my drives have lasted 6 plus years, even some lasted through my fan failures and high heat.",
                  "score": 1,
                  "created_utc": 1738327269.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9tmzbg",
      "author": "cobaltjacket",
      "body": "At least it's not as bad as what happened with [MiniScribe](https://en.wikipedia.org/wiki/MiniScribe?wprov=sfti1#Fraud_and_failure).",
      "score": 2,
      "created_utc": 1738159448.0,
      "replies": []
    },
    {
      "id": "m9u9f26",
      "author": "chorey",
      "body": "I stopped buying Seagate in 2017 after having too many die after only a couple of years of moderate use not reaching 5 years the straw was a drive dying after months, always the same issue of the reader scratching the platter.  I got WD drives over 10 years old well used still, it's a no brainer to avoid Seagate for me.",
      "score": 2,
      "created_utc": 1738166377.0,
      "replies": []
    },
    {
      "id": "m9uusph",
      "author": "deja_geek",
      "body": "I'm going to get pitch forked for this, but I buy exclusively recertified Seagates.  Place I buy them from warranties them for 5 years, and I've never had a warranty denied once.  I've had to return a few of them, but as long as they keep warrantying them, I'll keep buying.",
      "score": 2,
      "created_utc": 1738172297.0,
      "replies": []
    },
    {
      "id": "m9v4vq3",
      "author": "rellett",
      "body": "you would think if seagate was doing it couldnt they reset all the values to zero to hide to usage",
      "score": 2,
      "created_utc": 1738175019.0,
      "replies": []
    },
    {
      "id": "m9vbbau",
      "author": "frankster",
      "body": "About 15-20 years ago Seagate used to sell a model of hard disc that was very cheap, but all seemed to develop faults in a year. I'm surprised they recovered from that and are one of the last hdd manufacturers standing!",
      "score": 2,
      "created_utc": 1738176760.0,
      "replies": []
    },
    {
      "id": "m9vfi2g",
      "author": "X2ytUniverse",
      "body": "Can confirm. Bought Seagate Enterprise 10TB drive last week, the unit that came was manufactured in 2018 and was producing dead head clicking noises. Returned that shet immediately. However, it wasn't bought directly from Seagate, rather an Amazon re-seller, but the drive was indicated as new and unused. So not sure who to blame here.",
      "score": 2,
      "created_utc": 1738177902.0,
      "replies": []
    },
    {
      "id": "m9vmrpe",
      "author": "KingBenjaminAZ",
      "body": "Just like “new” drives on Amazon",
      "score": 2,
      "created_utc": 1738179886.0,
      "replies": []
    },
    {
      "id": "m9vv3mf",
      "author": "JefferyGoldberg",
      "body": "I just bought a 8TB HDD last night for $120 from Newegg.  Feeling a little worried about it now.",
      "score": 2,
      "created_utc": 1738182177.0,
      "replies": [
        {
          "id": "m9wf7zg",
          "author": "amoya0370",
          "body": "Better safe than sorry. Return it or resell it.",
          "score": 2,
          "created_utc": 1738187566.0,
          "replies": []
        },
        {
          "id": "ma0b5ts",
          "author": "N2-Ainz",
          "body": "Check FARM values. These scammers weren't intelligent enough to reset FARM and SMART which made this huge scam public",
          "score": 1,
          "created_utc": 1738244814.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9w3cnk",
      "author": "abjumpr",
      "body": "I run quite a few SeaGate disks with no issues - though, all the Seagate drives I run are Enterprise SAS drives.\n\nThat being said, I've had issues with getting sent Used drives when buying new ones online, primarily through Amazon. This happens frequently with \"bulk packaged\" items that aren't retail boxed. Drives are in sealed bags, but upon firing them up and checking SMART status, I've caught several that were in excess of 10,000 hours. In all cases, I was able to return them and get replacements that were actually new, and they are still in service. Several of these were Western Digital drives.\n\nI'd venture there was either a mixup at the factory, *or* possibly a bunch of sellers selling used drives as new and hoping no one notices. Or, quite possibly, there are sellers doing that, but now getting caught because of the publicity the factory-mixed-up drives are bringing and more checking of drives because of that publicity.",
      "score": 2,
      "created_utc": 1738184386.0,
      "replies": []
    },
    {
      "id": "m9w97vs",
      "author": "Haig-1066-had",
      "body": "Does anyone remember ESDI drives?",
      "score": 2,
      "created_utc": 1738185957.0,
      "replies": []
    },
    {
      "id": "m9wyu1c",
      "author": "cat_prophecy",
      "body": "Anecdotally: my friend just bought like 10, 20TB HDDs from Seagate and 7/10 were DOA. So it seems like Seagate is still Seagate.",
      "score": 2,
      "created_utc": 1738193234.0,
      "replies": []
    },
    {
      "id": "m9xh30v",
      "author": "jblatta",
      "body": "I swore off seagate drives over 10 years ago. The only hard drive failures I have had were seagates.  WD all the way.",
      "score": 2,
      "created_utc": 1738198988.0,
      "replies": []
    },
    {
      "id": "m9xjil7",
      "author": "Digital-Exploration",
      "body": "Just buy used anyway. These enterprises drives are champs and as long as things are backed up, it's all good.",
      "score": 2,
      "created_utc": 1738199766.0,
      "replies": []
    },
    {
      "id": "m9xr0qa",
      "author": "None",
      "body": "[deleted]",
      "score": 2,
      "created_utc": 1738202181.0,
      "replies": [
        {
          "id": "m9z2s8f",
          "author": "IlIFreneticIlI",
          "body": "Wouldn't you like an experienced-hand managing your data?",
          "score": 1,
          "created_utc": 1738221478.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9yafsa",
      "author": "bdoll1",
      "body": "I haven't bought a Seagate in decades since their bad firmware and premature drive death/excessive ramping fiascos, every single drive I ever bought from them died in short order and they are always doing something shady. I have 10x 12-15 year old WD drives, 4 Toshibas, and a Hitachi still going strong.",
      "score": 2,
      "created_utc": 1738208714.0,
      "replies": []
    },
    {
      "id": "m9twov8",
      "author": "ilep",
      "body": "Not surprised in the slightest.",
      "score": 1,
      "created_utc": 1738162613.0,
      "replies": []
    },
    {
      "id": "m9u3lxv",
      "author": "AdmiralEllis",
      "body": "Is this related to their web store being shut down? Maybe I should be glad my order was cancelled.",
      "score": 1,
      "created_utc": 1738164705.0,
      "replies": []
    },
    {
      "id": "m9v1c50",
      "author": "ballzsweat",
      "body": "Lots of DOA drives as of late.",
      "score": 1,
      "created_utc": 1738174058.0,
      "replies": []
    },
    {
      "id": "m9vb0vs",
      "author": "LoundnessWar",
      "body": "Louis Rossmann made a video about something similar a while ago.",
      "score": 1,
      "created_utc": 1738176682.0,
      "replies": []
    },
    {
      "id": "m9vgodi",
      "author": "bugeater88",
      "body": "astronomical privacy risk",
      "score": 1,
      "created_utc": 1738178225.0,
      "replies": []
    },
    {
      "id": "m9vn9e2",
      "author": "furian11",
      "body": "Just installed a 16tb exos.. ffs how do I check this on unraid? The smart says 4 hours now.. but I no longer trust that part..",
      "score": 1,
      "created_utc": 1738180020.0,
      "replies": [
        {
          "id": "ma0bfaj",
          "author": "N2-Ainz",
          "body": "smartctl -l farm /dev/xxx or whatever the path of your drive is",
          "score": 1,
          "created_utc": 1738244908.0,
          "replies": [
            {
              "id": "ma0madz",
              "author": "furian11",
              "body": "well thank you! and fuck me...\n\ndisk has 22 hours uptime (installed yesterday).. farm however says 25.000 hours..   \nallready contacted seller, he's going to check it out and make sure that i get a new disk..",
              "score": 1,
              "created_utc": 1738248511.0,
              "replies": [
                {
                  "id": "ma0roqj",
                  "author": "N2-Ainz",
                  "body": "That's sad to hear. Can I ask what model it was and where you are from?",
                  "score": 1,
                  "created_utc": 1738250176.0,
                  "replies": [
                    {
                      "id": "ma0t9i2",
                      "author": "furian11",
                      "body": "x18 16tb, netherlands. but the drive was shipped from germany.",
                      "score": 1,
                      "created_utc": 1738250651.0,
                      "replies": [
                        {
                          "id": "ma0th33",
                          "author": "N2-Ainz",
                          "body": "Who was the seller for that drive? Can you add the SN and the PN from that drive too?",
                          "score": 1,
                          "created_utc": 1738250713.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9x1dkn",
      "author": "springsilver",
      "body": "“Every drive is tested rigorously to ensure longevity”",
      "score": 1,
      "created_utc": 1738194024.0,
      "replies": []
    },
    {
      "id": "m9x3jq8",
      "author": "bil-sabab",
      "body": "That's some vintage Seagate. Hope their bribe slush fund is not hurting",
      "score": 1,
      "created_utc": 1738194703.0,
      "replies": []
    },
    {
      "id": "m9xeozg",
      "author": "None",
      "body": "Seagate is such a garbage company and I hate that people still defend them. Every single drive I've had from them fails within a year of use and there's no recovering that data cos they just suck as a company. \n\nAnything you can buy from them can be had from a better company. I have no idea why they're still around.",
      "score": 1,
      "created_utc": 1738198226.0,
      "replies": []
    },
    {
      "id": "m9xl67q",
      "author": "TheModeratorWrangler",
      "body": "That’s just the break in period.",
      "score": 1,
      "created_utc": 1738200297.0,
      "replies": []
    },
    {
      "id": "m9xyeto",
      "author": "ap0g33",
      "body": "Dozens failed over the last decade, no wonder.",
      "score": 1,
      "created_utc": 1738204597.0,
      "replies": []
    },
    {
      "id": "m9z7bhd",
      "author": "Luxuriosa_Vayne",
      "body": "If they put a 'recycled used hardware' as a sticker wouldn't people praise them?",
      "score": 1,
      "created_utc": 1738224133.0,
      "replies": []
    },
    {
      "id": "m9zh45j",
      "author": "Toothless-In-Wapping",
      "body": "This would explain why they would want all of our returned HDD.  \nI worked for a large retail chain.",
      "score": 1,
      "created_utc": 1738230301.0,
      "replies": []
    },
    {
      "id": "m9zvnhg",
      "author": "redlightwhite",
      "body": "I’m going to check my drives now 🥶",
      "score": 1,
      "created_utc": 1738238518.0,
      "replies": [
        {
          "id": "ma0q78q",
          "author": "furian11",
          "body": "make sure you do... my disk i received yesterday ended up with 25.000 hours already run..",
          "score": 1,
          "created_utc": 1738249726.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma01x9b",
      "author": "Uniblab_78",
      "body": "So reliable they can sell it twice 😉",
      "score": 1,
      "created_utc": 1738241313.0,
      "replies": []
    },
    {
      "id": "ma0gokn",
      "author": "Peakomegaflare",
      "body": "Yup pretty much. There's a hold thing a about \"drive shucking\" where you buy external HDD's, and open the case. Sometimes you'll get something WAY better than you paid for, sometimes you'll get some low-grade crap. Though I haven't heard of people doing it for a hot minute.",
      "score": 1,
      "created_utc": 1738246705.0,
      "replies": []
    },
    {
      "id": "ma3ybst",
      "author": "somegirl03",
      "body": "Seagate is trash, Samsung has not let me down yet",
      "score": 1,
      "created_utc": 1738282734.0,
      "replies": []
    },
    {
      "id": "mabfclt",
      "author": "salutmalibu",
      "body": "Wowwwwww wtf",
      "score": 1,
      "created_utc": 1738379970.0,
      "replies": []
    },
    {
      "id": "maoltgv",
      "author": "XenoZoomie",
      "body": "Is any old data recoverable off the drives ?",
      "score": 1,
      "created_utc": 1738556199.0,
      "replies": []
    },
    {
      "id": "m9tnbpc",
      "author": "rube",
      "body": "Kinda unrelated... years ago (like 15 or so) I had a number of Seagate drives die on me in the span of a couple of months.  Since then, I've always steered clear of them.\n\nGlad to hear it's still a good practice if they're pulling stuff like this.",
      "score": 1,
      "created_utc": 1738159566.0,
      "replies": []
    },
    {
      "id": "m9tnls7",
      "author": "Am0din",
      "body": "Interesting - I have two new HDDs coming today that are Seagate.  Gives me reason to check them out now.  Sigh.",
      "score": 1,
      "created_utc": 1738159661.0,
      "replies": [
        {
          "id": "m9w92fk",
          "author": "artificialidentity3",
          "body": "I just bought seven Seagate Exos 16 drives, each 14 TB. Checked them with SMART long tests and they seemed brand new. Zeroed them out and tested again and had no reallocated sectors. Seem fine to me. Personally never had issues with Seagate HDDs. Have had some customer support issues with Western Digital. I guess everyone's experience is different. Good luck with the new drives!",
          "score": 1,
          "created_utc": 1738185917.0,
          "replies": [
            {
              "id": "ma0b9q7",
              "author": "N2-Ainz",
              "body": "Check FARM data on them. Both can be wiped but these drives had only SMART data wiped",
              "score": 1,
              "created_utc": 1738244853.0,
              "replies": [
                {
                  "id": "ma1m2pk",
                  "author": "artificialidentity3",
                  "body": "I'm sorry- not familiar with FARM data? Do you have an example command? Thank you",
                  "score": 1,
                  "created_utc": 1738258757.0,
                  "replies": [
                    {
                      "id": "ma1o2oe",
                      "author": "N2-Ainz",
                      "body": "smartctl -l farm /dev/xxx or whatever else your path is",
                      "score": 1,
                      "created_utc": 1738259302.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9u7ppv",
      "author": "fault_finder",
      "body": "This isn’t new news. I bought an external Seagate in 2006. One day it got corrupt and so I had to recover data from it. \n\nThere were tons of family photos and documents on it. Nothing out of the ordinary.\n\nI wrote to the family to ask if they had lost the photos and documents from a failed drive. Never heard from them.\n\nThe drive did eventually fail and so seagate replaced it. I immediately did a recover on it but it was blank.\n\nIt wouldn’t surprise me if all manufacturers did this.",
      "score": 1,
      "created_utc": 1738165894.0,
      "replies": [
        {
          "id": "m9vsw60",
          "author": "SpinCharm",
          "body": "Just to make you feel better by proxy, I was given a hard drive that had photos on it. I was able to work out the owner and contacted him. He was extremely grateful - that’s lost the drive years before and those photos were the only ones of his family from those decades. \n\nIt doesn’t help your attempt I know.",
          "score": 1,
          "created_utc": 1738181570.0,
          "replies": []
        },
        {
          "id": "m9vflvo",
          "author": "Rekani",
          "body": "Why was this an issue?",
          "score": 0,
          "created_utc": 1738177931.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9ugpe0",
      "author": "brfritos",
      "body": "First your cars, now your HDDs?\n\n\nWay to go, Germany... 😬",
      "score": 1,
      "created_utc": 1738168429.0,
      "replies": []
    },
    {
      "id": "m9w6tor",
      "author": "PPC3PO",
      "body": "fuck Seagate - they have terrible reliability ratings.",
      "score": 1,
      "created_utc": 1738185319.0,
      "replies": []
    },
    {
      "id": "m9ux033",
      "author": "woosley87",
      "body": "Get Gamers Nexus on this ASAP. He’ll probably find a way to blame it on LTT.",
      "score": 0,
      "created_utc": 1738172889.0,
      "replies": []
    },
    {
      "id": "m9ubsf7",
      "author": "ModishShrink",
      "body": "Who the hell is still buying HDDs in 2025?",
      "score": -14,
      "created_utc": 1738167051.0,
      "replies": [
        {
          "id": "m9unk5a",
          "author": "Sentient545",
          "body": "Anyone who needs more than 4TB of storage and doesn't want to pay $1000 for it.",
          "score": 14,
          "created_utc": 1738170323.0,
          "replies": []
        },
        {
          "id": "m9whb30",
          "author": "Programmdude",
          "body": "20TB of HDD with 1 parity drive = $309x4 = $1236\n20TB of SSD (not nvme) with 1 parity drive = $1,148x4 = $4592.\nNot US$, but I can't be assed doing the conversion.\n\nThat for 4 8TB drives with 1 parity drive. More importantly, HDD's can go up to 24TB each, SSD's max out at 8TB (at my local store anyway).",
          "score": 2,
          "created_utc": 1738188127.0,
          "replies": []
        }
      ]
    }
  ]
}