{
  "post": {
    "title": "Fujifilm announces retro-styled X-E5 mirrorless digital camera | 40 megapixels, advanced image stabilization system, and more",
    "author": "chrisdh79",
    "id": "1lad4ay",
    "score": 542,
    "created_utc": 1749812753.0,
    "selftext": "",
    "num_comments": 64,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lad4ay/fujifilm_announces_retrostyled_xe5_mirrorless/"
  },
  "comments": [
    {
      "id": "mxjlbeg",
      "author": "xanas263",
      "body": " Fuji will do everything except release a new X-Pro camera.",
      "score": 124,
      "created_utc": 1749813462.0,
      "replies": [
        {
          "id": "mxkbq68",
          "author": "idrinkcement",
          "body": "They’re just trying to find a way to sell it for $2500",
          "score": 31,
          "created_utc": 1749823171.0,
          "replies": []
        },
        {
          "id": "mzdays8",
          "author": "HansBooby",
          "body": "Fuji will do everything except release a full frame camera",
          "score": 1,
          "created_utc": 1750701558.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mxkffii",
      "author": "ergotpoisoning",
      "body": "For anyone in this thread wanting to get into photography but put off by this insane pricing - get a used DSLR with some used lenses. You can get a used Nikon D750 for <$500 and a Nikkor 50mm 1.8G for <$150.",
      "score": 73,
      "created_utc": 1749824296.0,
      "replies": [
        {
          "id": "mxl8sju",
          "author": "Quillspiracy18",
          "body": "Or go Micro 4/3rds like I just did and you can get like-new weather-sealed bodies, image stabilisation, and fancy composite image features for less than half the price of the camera in the article.\n\nEspecially handy for noobs who want to try wildlife photography since the smaller sensor means zoom lenses are far more accessible and relatively tiny.",
          "score": 38,
          "created_utc": 1749832672.0,
          "replies": [
            {
              "id": "mxm7thu",
              "author": "okayherewegonow",
              "body": "Any examples of models?",
              "score": 5,
              "created_utc": 1749842678.0,
              "replies": [
                {
                  "id": "mxmbt0l",
                  "author": "Skratymir",
                  "body": "I use a Lumix G90/91/95 (number depends on region)\n\nGreat camera, but more expensive than getting an old DSLR. Still a lot cheaper than the Fuji in the post though and a lot easier to use and more feature-rich than an old DSLR.\n\nApart from Lumix, Olympus also makes great, cheap M4/3 cameras, such as the E10.\n\nIf you want to budget, get one used (mpb.com is a great store for used camera gear)",
                  "score": 7,
                  "created_utc": 1749843866.0,
                  "replies": [
                    {
                      "id": "mxph8qa",
                      "author": "speculatrix",
                      "body": "My Lumix G9 was only £700, new, on sale a few years ago. Incredible camera. Paired with some lightly used Leica lenses, it produces great results.",
                      "score": 3,
                      "created_utc": 1749887776.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mxmedji",
                  "author": "Quillspiracy18",
                  "body": "Well I got an Olympus EM-1 Mark III for £550 ($750), but you probably could get the Mark II for one or two hundred less for pretty much the same camera. Mark III just has a little joystick to change the location of the focus and more in-camera composite options like handheld high-res and live ND for blurred movement shots without needing a filter.\n\nPanasonic makes M43 cameras too, but I don't know much about their models. The lenses are interchangeable between the two brands though, so you don't have to worry as much about getting locked in to a platform like with other brands.",
                  "score": 3,
                  "created_utc": 1749844632.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mxqnqg0",
              "author": "Lied-",
              "body": "I have a $2000 Sony FF and some pretty nice lenses but they are hella heavy and hard to travel with. I’m determined to change to APS-C or M43 for this reason. Be honest with me, can I still get nice zoom shots of landscapes at sunset / after dark of cityscapes? I’m hesitant haha",
              "score": 1,
              "created_utc": 1749908852.0,
              "replies": [
                {
                  "id": "mxrkqka",
                  "author": "Quillspiracy18",
                  "body": "I haven't tried anything at night or sunset yet, so I can't say for certain. It is a struggle to get things sharp in lower light if you need the shutter speed, though that's probably less of an issue for landscapes. \n\nIf you want to go completely off the rails with zoom though, you can get a 150-600mm lens (300-1200mm full frame equivalent) for £2000 rather than £20,000.\n\nBut if a smaller camera gets you out more because it's easier to carry, then that just means more photos. A decent photo is better than no photo.",
                  "score": 1,
                  "created_utc": 1749919424.0,
                  "replies": [
                    {
                      "id": "mxsm5kq",
                      "author": "Lied-",
                      "body": "A decent photo is definitely better! And I’m planning to take mostly prime lenses anyways, so I guess I’ll just hope there’s enough resolution to crop. Thank you :)",
                      "score": 1,
                      "created_utc": 1749931264.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mxme92d",
          "author": "tj2286",
          "body": "What about a Sony RX100 VII?",
          "score": 4,
          "created_utc": 1749844594.0,
          "replies": []
        },
        {
          "id": "mxpyug1",
          "author": "ElasticFluffyMagnet",
          "body": "Can’t upvote this enough. Good answer",
          "score": 1,
          "created_utc": 1749898263.0,
          "replies": []
        },
        {
          "id": "mxsd7ae",
          "author": "Suspicious_Plan3394",
          "body": "I’m a canon guy but the Nikon D750 had me seriously tempted. It was years ahead of its time.",
          "score": 1,
          "created_utc": 1749928303.0,
          "replies": []
        },
        {
          "id": "mxvvucb",
          "author": "Bc187",
          "body": "What would be a good lense for product photocraphy for small items? I have this camera",
          "score": 1,
          "created_utc": 1749981306.0,
          "replies": []
        },
        {
          "id": "mxx1qdd",
          "author": "megamasterbloc",
          "body": "a canon 5D mark III might be a better value",
          "score": 1,
          "created_utc": 1749999399.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mxjpzkk",
      "author": "MadOrange64",
      "body": "It will be sold out the same millisecond it gets released.",
      "score": 18,
      "created_utc": 1749815456.0,
      "replies": []
    },
    {
      "id": "mxjo9gm",
      "author": "punchy-peaches",
      "body": "Starts at $1,600",
      "score": 21,
      "created_utc": 1749814742.0,
      "replies": [
        {
          "id": "mxjr47t",
          "author": "AgentStockey",
          "body": "I preordered it and will sell it for $2600 to a tik toker. Profit!",
          "score": 28,
          "created_utc": 1749815912.0,
          "replies": [
            {
              "id": "mxt0xwl",
              "author": "juanitovaldeznuts",
              "body": "4600 for the chance for the experience of opening the box. It’s a weird kink, but ya know it takes all types.",
              "score": 2,
              "created_utc": 1749936040.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mxmpbv9",
      "author": "Real_Establishment56",
      "body": "Remember when you could get a small point and shoot with a little bit of real optical zoom for <€$£1000? Pepperidge Farm remembers!\n\nI’ve looked at Fuji, Sony, Pentax, Leica, all way above the 1000 mark. And Canon doesn’t even do a point and shoot anymore, I don’t know what the fuck they’re doing over there. \n\nI used to haul 20kgs of DSLR and lenses around every holiday. Got sick of that and sold it all. But the phone just doesn’t do it. Point and shoot or 4/3 that can fit in a small bag is where it’s at. But no idea what to get.",
      "score": 9,
      "created_utc": 1749847887.0,
      "replies": [
        {
          "id": "mxovim6",
          "author": "firedrakes",
          "body": "profits where not as much. once smart phone could do the same thing.\n\nso margins became really thin.\n\nsamsung made a great point and shoot camera, same with fuji to.",
          "score": 6,
          "created_utc": 1749875992.0,
          "replies": []
        },
        {
          "id": "mxphlj7",
          "author": "speculatrix",
          "body": "Take a look at the Lumix G100, sure it's not a \"bridge\" camera, but it's close enough and not overly large, easy to carry a second lens if needed.\n\nhttps://www.panasonic.com/uk/consumer/cameras-camcorders/lumix-mirrorless-cameras/lumix-g-cameras/dc-g100.html\n\nHeight 82.5mm\n\nWidth 115.6mm\n\nDepth 54.2mm\n\nWeight 345g",
          "score": 3,
          "created_utc": 1749887990.0,
          "replies": []
        },
        {
          "id": "mxq4fyd",
          "author": "_das_f_",
          "body": "Not sure it's exactly what you're looking for, but I'm quite happy with my Fuji X-S20 16-50 kit as a convenient step up from my phone camera. When I bought it, it was about 1200 CHF. The cheaper kit was 1100.\nOf course I don't know what prices are like in your region.",
          "score": 2,
          "created_utc": 1749901031.0,
          "replies": [
            {
              "id": "mxqswgk",
              "author": "Real_Establishment56",
              "body": "Around the same in NL I think. I might be picking up a second hand Canon SX740 or something. Small with a nice optical zoom.",
              "score": 1,
              "created_utc": 1749910621.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mxr9qtt",
          "author": "Buichuk",
          "body": "Have you looked at the Ricoh GR3?",
          "score": 1,
          "created_utc": 1749915976.0,
          "replies": [
            {
              "id": "mxrqkkr",
              "author": "Real_Establishment56",
              "body": "Man, that’s a name I haven’t heard in a long time",
              "score": 1,
              "created_utc": 1749921214.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mxk4a3x",
      "author": "Grahamr1234",
      "body": "I'm still rocking my X-T1. It just won't die.",
      "score": 9,
      "created_utc": 1749820744.0,
      "replies": [
        {
          "id": "mxk89it",
          "author": "Slightlynorth",
          "body": "I have 2 of them! One was converted for IR photography though. Best cameras I have ever owned and no reason to replace.",
          "score": 3,
          "created_utc": 1749822071.0,
          "replies": []
        },
        {
          "id": "mxmbch1",
          "author": "LowZombie2",
          "body": "Xh1 here, it just keeps kicking",
          "score": 2,
          "created_utc": 1749843728.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mxkg8ai",
      "author": "highsinthe70s",
      "body": "Great. Another Fuji camera that I won’t be able to get my hands on.",
      "score": 6,
      "created_utc": 1749824533.0,
      "replies": [
        {
          "id": "mxnl1ib",
          "author": "fourthdawg",
          "body": "If not for the price, it'll be for their availability. To this day I've not even seen a secondhand X-E4 on my local market, and if there are, they mark up the price anyway.",
          "score": 4,
          "created_utc": 1749858326.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mxjr7cl",
      "author": "Salaminizer-",
      "body": "I’m not a camera aficionado. Is this good?",
      "score": 3,
      "created_utc": 1749815947.0,
      "replies": [
        {
          "id": "mxjwi5o",
          "author": "thisagaingm",
          "body": "It is a good camera. It is overpriced, though. This is an entry-level camera in this class, and the price should be closer to $800. If this is $1,600, then I can’t imagine what their next mid-tier device is going to cost. \n\nIn the world of interchangeable lens cameras, Fuji makes things very accessible, and lowers the barriers for folks who do not want to spend as much time in the processing stages. The devices are not limited to this approach, but they do an incredible job with it. This has given them the ability to charge these outrageous prices for them, despite the competition being able to deliver equally, and often more capable devices at a lower price. I enjoy the processing stage, and I still have a Fuji for this reason.",
          "score": 11,
          "created_utc": 1749818015.0,
          "replies": [
            {
              "id": "mxjyutf",
              "author": "layeterla",
              "body": "While I do agree it is overpriced, it is not an entry level camera and there is no way you can buy a camera with IBIS and aluminium plated.\n\n800-1000 dolar is indeed for entry level cameras, which fuji also sells its x-m5 for that price. \n\nCompared to that camera this has better sensor, better build, IBIS, EVF\n\nAs far as I know there is no camera at your price range match these specs. (Except EVF)",
              "score": 18,
              "created_utc": 1749818876.0,
              "replies": [
                {
                  "id": "mxt0au5",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 2,
                  "created_utc": 1749935829.0,
                  "replies": [
                    {
                      "id": "mxt0xlp",
                      "author": "layeterla",
                      "body": "1200-1300 is the fair range, I don't argue with that. You can also buy canon r7 for this price and it also has ibis, weather sealing, dual sd kart slot, 33mp sensor, better screens etc.\n\nArgument was, this camera should be in 800 dolar range which is impossible.",
                      "score": 0,
                      "created_utc": 1749936037.0,
                      "replies": [
                        {
                          "id": "mxt2bmb",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 2,
                          "created_utc": 1749936502.0,
                          "replies": [
                            {
                              "id": "mxt7wrt",
                              "author": "layeterla",
                              "body": "A6500 is literally a 9 years old camera that has inferior video specs and technology, on paper older and worse sensor, none of the modern autofocus features. \n\nIt is by no means a bad camera but you are comparing 2 different products from different ages and economical realities.",
                              "score": 1,
                              "created_utc": 1749938396.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mxkmrgw",
              "author": "Salaminizer-",
              "body": "Thanks for the answer. I like photography but have never really gotten into it in any serious way.",
              "score": 2,
              "created_utc": 1749826421.0,
              "replies": [
                {
                  "id": "mxn3brl",
                  "author": "NavidsonRcrd",
                  "body": "It might be worth looking into film photography, then! You can get a top of the line late 90’s Canon or Minolta with lenses for dirt cheap, and even a classic all-mechanical SLR or rangefinder from brands like Minolta, Nikon, or Pentax can be found easily often for $1-300. You’ll get a great camera that will have a timeless look and feel while learning the exposure skills that most take for granted today. It makes photography much more engaging and rewarding, imo!",
                  "score": 2,
                  "created_utc": 1749852256.0,
                  "replies": [
                    {
                      "id": "mxnr5jy",
                      "author": "Salaminizer-",
                      "body": "I have an iPhone 15. Serious question, how good is the camera on that versus a standalone camera?",
                      "score": 1,
                      "created_utc": 1749860542.0,
                      "replies": [
                        {
                          "id": "mxnt9f5",
                          "author": "NavidsonRcrd",
                          "body": "Pretty apples to oranges, imo. I’ve found iPhone photos, while technically great, lack a certain “realness” because they do way too much post-processing. It might not be a sharper image due to small sensor size, but apple’s ai is going to juice it up to what it thinks it should look like, which gives photos a very flashy, processed look you won’t get with unedited film. \n\nFilm renders very differently and to many, has a more pleasant look than digital. Fine-grain film with good lenses can create incredibly sharp, beautiful photos that you just can’t get out of a phone camera, while phone cameras will give you more immediate tools to use within a scene but force a lot of its own software magic into your photo, for better or worse. \n\nAn iPhone will take great photos for you, but shooting on a standalone film camera will make YOU take better photos with it, if that makes sense. That’s my two cents, hope it’s helpful!",
                          "score": 2,
                          "created_utc": 1749861330.0,
                          "replies": [
                            {
                              "id": "mxoaxge",
                              "author": "Salaminizer-",
                              "body": "Thank you for the answer. That makes a lot of sense actually. I felt like a lot of people would say to not buy a camera and just use my the one with my phone. This makes me feel better about justifying a camera purchase.",
                              "score": 1,
                              "created_utc": 1749867651.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mxjzp9f",
              "author": "UnsorryCanadian",
              "body": "As someone who likes the concept of photography but has only ever owned a single 20 year old used camera without a manual mode $800 for an \"entry\" model is crazy",
              "score": 3,
              "created_utc": 1749819174.0,
              "replies": [
                {
                  "id": "mxk1crc",
                  "author": "thisagaingm",
                  "body": "I don’t disagree that the prices are very high. Fuji does offer manual mode by default. You set the priorities at each parameter if you wish to automate. If I want aperture priority, I can set the shutter speed to A. If I do not, I can manually set the shutter speed. The same applies to setting shutter priority by setting the aperture to A, or setting or not setting auto ISO.",
                  "score": 2,
                  "created_utc": 1749819746.0,
                  "replies": []
                },
                {
                  "id": "mxk6sl2",
                  "author": "AnimeMeansArt",
                  "body": "Lmao, I wish camera body was the expensive part, but lenses will usually cost even more",
                  "score": 3,
                  "created_utc": 1749821580.0,
                  "replies": [
                    {
                      "id": "mxkc8ib",
                      "author": "UnsorryCanadian",
                      "body": "I couldn't even find a fixed lens camera for under $500",
                      "score": 2,
                      "created_utc": 1749823330.0,
                      "replies": [
                        {
                          "id": "mxkcmeg",
                          "author": "AnimeMeansArt",
                          "body": "Yep, it do be like that",
                          "score": 1,
                          "created_utc": 1749823450.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mxlfnbe",
              "author": "Perfect_Opinion7909",
              "body": "How does it compare to the much hyped X100VI - asking for a friend who has no clue about cameras",
              "score": 2,
              "created_utc": 1749834596.0,
              "replies": [
                {
                  "id": "mxnk0tg",
                  "author": "fourthdawg",
                  "body": "The main selling point of the X100 series is their optical viewfinder and it is a fixed lens camera (you can't change the lens, but there are several adaptors to convert the lens into different focal lengths). X-E line is an interchangeable lens camera with EVF, so you can switch to a variety of lenses regarding to your needs. \n\nBoth cameras are compact and a rangefinder-style camera (the viewfinder is in the corner of the body, instead of in the middle like a typical SLR). In terms of image and video quality, they should've been similar (provided you're using a similar lens to X100 on X-E3) due to their sharing the same sensor.",
                  "score": 2,
                  "created_utc": 1749857973.0,
                  "replies": []
                },
                {
                  "id": "mxmupbq",
                  "author": "thisagaingm",
                  "body": "They can be used for overlapping needs, but the experiences will be different. The fixed lens of the X100VI and the option for using the optical viewfinder being key differences. I don’t know much beyond that because I have no experience with these two cameras. I expect that with a similar lens, you would get pretty much the same result. I don’t know for sure though.",
                  "score": 1,
                  "created_utc": 1749849505.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mxk23ti",
      "author": "WinglyBap",
      "body": "I’ll stick with my X-E4 which was £950 with the 27mm.",
      "score": 2,
      "created_utc": 1749820007.0,
      "replies": []
    },
    {
      "id": "mxtpfs6",
      "author": "chief_yETI",
      "body": "interesting. dunno if it's $1600 interesting though",
      "score": 1,
      "created_utc": 1749944598.0,
      "replies": []
    },
    {
      "id": "mxuhhpq",
      "author": "SarahArabic2",
      "body": "I imagine it’s the same sensor as my xt5 which is pretty nice. I’d like a more compact version of that",
      "score": 1,
      "created_utc": 1749955125.0,
      "replies": []
    },
    {
      "id": "mxvydy2",
      "author": "hadoopken",
      "body": "Not weather sealed…",
      "score": 1,
      "created_utc": 1749982828.0,
      "replies": []
    },
    {
      "id": "mxjpus5",
      "author": "HansBooby",
      "body": "Fuji wake me when you do FF",
      "score": -6,
      "created_utc": 1749815402.0,
      "replies": [
        {
          "id": "mxkzshg",
          "author": "the_electric_bicycle",
          "body": "If you’re looking for a bigger sensor, they have medium format cameras where the sensor is even larger than FF",
          "score": 3,
          "created_utc": 1749830087.0,
          "replies": [
            {
              "id": "mxlhvuz",
              "author": "HansBooby",
              "body": "aware. i like their UI, film simulation and design ethos but not after a bulky $8k camera body that has a limited options of slow, equally expensive glass. or their fixed, slow lensed rangefinder with images that look no different to FF cameras. A ff rangefinder w evf and their UI will make Leica quiver in fear",
              "score": 2,
              "created_utc": 1749835215.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mxm159y",
          "author": "AllthisSandInMyCrack",
          "body": "Medium format superior",
          "score": 1,
          "created_utc": 1749840723.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mxk7m9r",
      "author": "PsyJak",
      "body": "*stabilisation",
      "score": -5,
      "created_utc": 1749821857.0,
      "replies": [
        {
          "id": "mxkcoj7",
          "author": "Razorvein",
          "body": "Both spellings are legitimate. Depends on whether you write in American English or British English.",
          "score": 4,
          "created_utc": 1749823469.0,
          "replies": []
        }
      ]
    }
  ]
}