{
  "post": {
    "title": "Nvidia accused of prioritizing RTX 5000 series as users report ongoing crashes in older cards | Frame Generation combined with G-Sync can cause issues",
    "author": "chrisdh79",
    "id": "1jip9zv",
    "score": 1331,
    "created_utc": 1742818717.0,
    "selftext": "",
    "num_comments": 228,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jip9zv/nvidia_accused_of_prioritizing_rtx_5000_series_as/"
  },
  "comments": [
    {
      "id": "mjgupkd",
      "author": "fakiresky",
      "body": "I had the black screen issue after updating to the latest driver (4080). DDU in safe mode seems to have fixed it.",
      "score": 203,
      "created_utc": 1742819550.0,
      "replies": [
        {
          "id": "mjhlzg5",
          "author": "RockEyeOG",
          "body": "I updated just last night (4070 ti) and it went black screen. I had to force reboot my computer.",
          "score": 45,
          "created_utc": 1742828876.0,
          "replies": [
            {
              "id": "mjijwhy",
              "author": "FewHorror1019",
              "body": "Hey same here with 4080 super. But mine went black before the update",
              "score": 10,
              "created_utc": 1742838757.0,
              "replies": []
            },
            {
              "id": "mjkxuws",
              "author": "ItNeverEnds2112",
              "body": "I had to reinstall windows",
              "score": 3,
              "created_utc": 1742864959.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mjjdvfw",
          "author": "bestnovaplayerever",
          "body": "My 5090 has the same issue. The latest driver are fucking garbage.",
          "score": 9,
          "created_utc": 1742847382.0,
          "replies": []
        },
        {
          "id": "mjjq32k",
          "author": "kaihong",
          "body": "3080 here. Same thing. New drivers after DDU fixed it.",
          "score": 9,
          "created_utc": 1742850871.0,
          "replies": []
        },
        {
          "id": "mjk18ec",
          "author": "TopShelfHockeyMN",
          "body": "*cries in 1080 ti hybrid*",
          "score": 5,
          "created_utc": 1742854386.0,
          "replies": []
        },
        {
          "id": "mjln29o",
          "author": "punktual",
          "body": "3080ti and also still getting blackscreen whenever computer sleeps. \nOnly way to fix was to trigger a windows restore and revert to the old driver.\n\nI'll try DDU, but it's ridiculous installing the latest Game Ready driver for Assassins Creed and having to use an older version to play.",
          "score": 4,
          "created_utc": 1742874496.0,
          "replies": []
        },
        {
          "id": "mjm8ovw",
          "author": "Ecstatic_Courage840",
          "body": "Damn, I just bought a second-hand 4090, and I kept getting black screens. Thought it was broken or my PSU was done, got a new one, turns out safe mode doesn’t cause these black screens. Fucking Nvidia, I’m still scared every time I boot my PC to return to a black screen.",
          "score": 3,
          "created_utc": 1742886508.0,
          "replies": []
        },
        {
          "id": "mjgwsaq",
          "author": "EducationallyRiced",
          "body": "Seems like i was right choosing amd for my new computer\nÉdit : Waow everyone seems to love userbenchmark and Nvidia a bit too much, only saying I prefer amd here xd",
          "score": 20,
          "created_utc": 1742820393.0,
          "replies": [
            {
              "id": "mjgyymp",
              "author": "giant_spleen_eater",
              "body": "Same. Wife got me a AMD for my birthday last year and it’s running pretty great.\n\nEdit: Yall getting salty cause my wife got me a Present. \n\nGo find someone to love and love em instead of being salty over a brand.",
              "score": 37,
              "created_utc": 1742821235.0,
              "replies": [
                {
                  "id": "mjher2q",
                  "author": "JohnnyOnslaught",
                  "body": "My 6750XT (and Nvidia's lack of interest in the gaming market) converted me. I'm gonna be buying AMD from here on out.",
                  "score": 9,
                  "created_utc": 1742826612.0,
                  "replies": []
                },
                {
                  "id": "mjh9axe",
                  "author": "EducationallyRiced",
                  "body": "Am I the only one noticing that everybody hates amd almost as much as userbenchmark?",
                  "score": 14,
                  "created_utc": 1742824861.0,
                  "replies": [
                    {
                      "id": "mjinyb3",
                      "author": "Vandrel",
                      "body": "Nvidia has had absolutely massive mindshare for a couple decades at this point. There are people who will buy Nvidia no matter what they do, how they treat their customers, or how their cards perform compared to AMD. Even when AMD's cards were unquestionably better (back around the 7970 era) they still couldn't make much headway toward gaining market share in the GPU market. Even for their CPUs which are absolutely destroying Intel at this point there's still quite a few people who view AMD CPUs as being cheap knockoffs but the effect wasn't quite so extreme in that market since AMD did manage to make a lot of progress there.",
                      "score": 12,
                      "created_utc": 1742839913.0,
                      "replies": [
                        {
                          "id": "mjit7zm",
                          "author": "EducationallyRiced",
                          "body": "So that’s why the hivemind is so obsessed by the overpriced cable melting devices",
                          "score": 5,
                          "created_utc": 1742841444.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mjhclf9",
                      "author": "giant_spleen_eater",
                      "body": "Yo, this is funny.\n\nI had no idea graphic card fans were this “intense”",
                      "score": 10,
                      "created_utc": 1742825923.0,
                      "replies": [
                        {
                          "id": "mjhuoji",
                          "author": "General_Jeevicus",
                          "body": "You can just turn them down on your graphics card control panel.",
                          "score": 10,
                          "created_utc": 1742831468.0,
                          "replies": [
                            {
                              "id": "mjhv0ps",
                              "author": "giant_spleen_eater",
                              "body": "![gif](giphy|d3mlE7uhX8KFgEmY)",
                              "score": 4,
                              "created_utc": 1742831568.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mjhln1k",
                          "author": "EducationallyRiced",
                          "body": "If you think that’s intense you haven’t read the descriptions of gpus from userbenchmark of Nvidia and amd’s side by side",
                          "score": 3,
                          "created_utc": 1742828772.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mjhhsrf",
              "author": "hedoeswhathewants",
              "body": "It's just not a useful (or frankly interesting) comment here.\n\nAnyway, people can just use the drivers they had been using until it gets fixed. It's not some scandal.",
              "score": -7,
              "created_utc": 1742827581.0,
              "replies": [
                {
                  "id": "mjhlttp",
                  "author": "EducationallyRiced",
                  "body": "Cards melting is a scandal",
                  "score": 6,
                  "created_utc": 1742828830.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mjgx83d",
              "author": "MultiMarcus",
              "body": "As long as you are in the market for lower end hardware like the xx70 tier. 7900 XTX and the 9070 XT are arguably reasonable competitors for the 4080 but it’s not a good one for the 5080 and certainly not the 5090. What was my option if I wanted a 4090 tier your card two years ago? And what is my choice if I want a 5080 or a 5090 tier card now? I always recommend AMD to people who are buying mid range cards and I recommend Intel to people buying low end hardware, but for the high-end there isn’t any viable competition for Nvidia right now.",
              "score": -9,
              "created_utc": 1742820566.0,
              "replies": [
                {
                  "id": "mjioyro",
                  "author": "Vandrel",
                  "body": "The 5080 is only around 10% faster than the 4080 Super and 7900 XTX in rasterization, let's not act like it's some kind of big jump from what was previously available. For the 4090 and now 5090 there of course isn't any substitute but the number of regular people in the market to spend that much on a GPU is tiny.",
                  "score": 11,
                  "created_utc": 1742840207.0,
                  "replies": [
                    {
                      "id": "mjiq7ab",
                      "author": "MultiMarcus",
                      "body": "Not only is 10% a fairly large gap, but the 5080 has an actually good upscaling solution, and Ray tracing is probably something you want to use on high-end graphics cards especially with how many games are starting to have it as a baseline requirement or at least a very much recommended feature. Indiana Jones is one of the few that require requires it but assassins Creed shadows certainly looks much better with good hardware accelerated ray tracing. \n\nAs for the market, not really buying the 5090 or whatever I think that’s very much true but that’s not really the point I’m making.  I was just mentioning that there isn’t really a high-end option if you’re not buying Nvidia.  That was my primary point. I even explicitly said that I recommend AMD to people who buy mid range products and Intel to low end product users.",
                      "score": -11,
                      "created_utc": 1742840563.0,
                      "replies": [
                        {
                          "id": "mjiunk1",
                          "author": "Vandrel",
                          "body": ">Not only is 10% a fairly large gap\n\nOn paper it sounds big but in practice it isn't. 60 fps vs 66 fps, 120 fps vs 132 fps, etc. The difference exists but it's rarely going to be something you can even notice let alone make a difference in gameplay.\n\n>but the 5080 has an actually good upscaling solution\n\nAren't all the DLSS 4 features are available on the 40 series except multi frame gen? [That's what Nvidia's website says](https://www.nvidia.com/en-us/geforce/news/dlss-4-multi-frame-generation-out-now/). And then [FSR4 is quite good now as well, beating out DLSS CNN by a good margin and for certain things doing a better job than DLSS transformer.](https://www.youtube.com/watch?v=nzomNQaPFSk)\n\n>and Ray tracing is probably something you want to use on high-end graphics cards especially with how many games are starting to have it as a baseline requirement or at least a very much recommended feature. Indiana Jones is one of the few that require requires it but assassins Creed shadows certainly looks much better with good hardware accelerated ray tracing. \n\nIt's funny that you bring up AC Shadows, [there's essentially no performance difference between the 5080, the 4080 Super, 7900 XTX, and 9070 XT with ray tracing on](https://www.techpowerup.com/review/assassin-s-creed-shadows-performance-benchmark/7.html).",
                          "score": 6,
                          "created_utc": 1742841861.0,
                          "replies": [
                            {
                              "id": "mjko4sh",
                              "author": "UsernameIn3and20",
                              "body": "I love it when people keep bringimg up \"Raytracing might be something they care about\" when it tanks performance down to the absolute shitters for most games, and in others genuinely doesn't even look good. Maybe 1 out of 20 games actually looks good and doesn't tank frames.",
                              "score": 5,
                              "created_utc": 1742861580.0,
                              "replies": []
                            },
                            {
                              "id": "mjixe34",
                              "author": "MultiMarcus",
                              "body": "Yeah the point was that if you want good upscaling it is NVIDIA or a new AMD card, which doesn’t come that close to 4080 let alone 5080 performance. Since the 4080 super is an Nvidia card it still holds to my point of buying high-end means buying Nvidia or it’s 7900 XTX which has a terrible upscaling solution using FSR 3.1. \n\nGreat to hear that AC shadows is one of the games that doesn’t have a large difference in ray tracing performance, but a cadre of other games that are coming really want good hardware accelerated ray tracing performance. \n\n If you want to get a high-end GPU, you are stuck getting Nvidia whether it be a new or old Nvidia card or you’re going to be getting an AMD card with some sort of sacrifice. The 9070 XT doesn’t really come close to the 5080 performance in most scenarios though I still think it’s a much better card since it has an actual reasonable price. The 7900 XTX is close enough to at least be comparable but it doesn’t have a good upscaling solution and even if you get it 5090 you’re going to need upscaling because games just demand it nowadays. \n\nLike AMD has done a lot of good stuff and if they launched a 9080 with comparable performance to a 5080 but with FSR four it would be my go to recommendation for anyone who’s buying an xx80 tier of GPU, provided of course that the pricing is good.",
                              "score": -1,
                              "created_utc": 1742842643.0,
                              "replies": [
                                {
                                  "id": "mjiy7tc",
                                  "author": "Vandrel",
                                  "body": "It's weird that you say the 7900 XTX is close enough to be comparable but the 9070 XT isn't when it's the same speed in raster and much faster in ray tracing.",
                                  "score": 5,
                                  "created_utc": 1742842878.0,
                                  "replies": [
                                    {
                                      "id": "mjj05zi",
                                      "author": "MultiMarcus",
                                      "body": "Oh, I believed that the 7900 XTX was more performant as I’ve personally not use that card because I prefer high-end products, but it was being consistently rolled out as an actual viable choice for people wanting 5080 level performance. In that case there just isn’t an offering that’s comparable with the 5080 on the AMD side. The 9070XT seems like an incredible product but it’s mid range and though it can brush close to 5080 level performance in some scenarios in most cases it’s definitely a weaker card.",
                                      "score": -1,
                                      "created_utc": 1742843442.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mjknva9",
                  "author": "UsernameIn3and20",
                  "body": "Userbenchmark aah comment.",
                  "score": 2,
                  "created_utc": 1742861487.0,
                  "replies": []
                },
                {
                  "id": "mjgxkuu",
                  "author": "EducationallyRiced",
                  "body": "In my opinion the 50 series are a scam, it’s all fake frames. And also less melting in them cables",
                  "score": 2,
                  "created_utc": 1742820706.0,
                  "replies": [
                    {
                      "id": "mjgz0z8",
                      "author": "MultiMarcus",
                      "body": "Well, it’s offering better performance than both last generation cards and all the high-end AMD offerings. Personally right now, I am playing assassins Creed shadows on my 4090 and getting roughly 50 frames per second at 4K DLSS 4 quality mode with everything on Max. Instead of playing it at that frame rate, I add frame generation to smooth things out. Yes there are some slight artefacts but in general the game feels similar to 90 FPS visually speaking and though there is some added latency it’s not a whole lot and since I’m playing with a controller, there’s already going to be some latency. Multiframe generation isn’t magic, of course not, and the way Nvidia markets it is ridiculous, but to me it would be a value added feature. If I had the 5090 instead of the 4090 and I could run the game at 60 FPS and then use multi frame generation to get it up to 240 which is the refresh rate of my monitor that would be a better experience than running the game at just 60 without it. I’m not going to compare a real 240 and the frame generated 240 because they are not comparable. What I am going to do is look and see if my gameplay feels better with frame generation or multiframe generation which I feel like it does. I think Nvidia is manipulating the numbers to make it seem like they have far higher frame rates than they actually do but to me frame generation does add value.",
                      "score": -7,
                      "created_utc": 1742821259.0,
                      "replies": [
                        {
                          "id": "mjlt1hr",
                          "author": "Peteskies",
                          "body": "Sorry, you're getting 50fps in a *4090* with DLSS *ON*?\n\nThis is the state of gaming right now?",
                          "score": 1,
                          "created_utc": 1742877315.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mjh4a2r",
                      "author": "jamesbecker211",
                      "body": "Could you define what you mean by \"fake frames\" because it's still generating the frames. I would genuinely like to know what difference it makes to you if a frame was generated natively or by some form of machine learning. As of now it just sounds like you have no clue what you're talking about and are just parroting what you've read elsewhere. And don't say they look worse or you can tell because that just means you haven't tried it or are lying.",
                      "score": -9,
                      "created_utc": 1742823190.0,
                      "replies": [
                        {
                          "id": "mjhv6gx",
                          "author": "General_Jeevicus",
                          "body": "input lag and artifacts are the problem with 'fake frames' just use the silicon for better processing instead, its a problem of AI cards and GPUs being paired together, instead of going in two different directions and providing excellence and pricing appropriate to the market.",
                          "score": 3,
                          "created_utc": 1742831614.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mjh1c82",
                      "author": "SpamingComet",
                      "body": "Scam has a pretty set definition, and it’s not something that’s up to opinion. You can dislike better things but that doesn’t make it a scam.",
                      "score": -11,
                      "created_utc": 1742822126.0,
                      "replies": [
                        {
                          "id": "mjh8kap",
                          "author": "EducationallyRiced",
                          "body": "Well in my opinion it is a scam \n1missing performance that was advertised as present\n2 melting cables",
                          "score": 7,
                          "created_utc": 1742824656.0,
                          "replies": [
                            {
                              "id": "mjhjsja",
                              "author": "SpamingComet",
                              "body": "Again, look up the definition of words. The word “scam” has a clearly defined meaning, and is not subject to opinion.",
                              "score": -10,
                              "created_utc": 1742828203.0,
                              "replies": [
                                {
                                  "id": "mjhm19a",
                                  "author": "EducationallyRiced",
                                  "body": "I do not identify as a dictionary and I’m pretty sure lying about performance is some kind of scam",
                                  "score": 0,
                                  "created_utc": 1742828891.0,
                                  "replies": [
                                    {
                                      "id": "mji5ruy",
                                      "author": "SpamingComet",
                                      "body": "You do identify as braindead",
                                      "score": -6,
                                      "created_utc": 1742834761.0,
                                      "replies": [
                                        {
                                          "id": "mji6nm8",
                                          "author": "EducationallyRiced",
                                          "body": "Personal attack already? That has to be some kind of joke, I’ve had longer arguments and conversations that did not go to personal attack. \nAnd no I don’t identify as « braindead » that’s offensive of you to assume such a thing, I identify as a large language model of course, no seriously try learning how to argue whitout personal attacks it’s just humiliating for you to do so",
                                          "score": 3,
                                          "created_utc": 1742835014.0,
                                          "replies": [
                                            {
                                              "id": "mji9f98",
                                              "author": "SpamingComet",
                                              "body": "Lmao you’re not even a good troll",
                                              "score": -2,
                                              "created_utc": 1742835808.0,
                                              "replies": [
                                                {
                                                  "id": "mjibtyv",
                                                  "author": "EducationallyRiced",
                                                  "body": "What tells you I’m a troll? Maybe I am serious. I at least have the decency not to use personal attacks",
                                                  "score": 3,
                                                  "created_utc": 1742836506.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mjj8tox",
              "author": "None",
              "body": "[deleted]",
              "score": -5,
              "created_utc": 1742845962.0,
              "replies": [
                {
                  "id": "mjjgmxx",
                  "author": "EducationallyRiced",
                  "body": "Wait did you switch from an Nvidia gpu right before that and kept the same installation of windows? If yes you might want to reinstall windows it happened to me",
                  "score": 3,
                  "created_utc": 1742848158.0,
                  "replies": [
                    {
                      "id": "mjjhvvz",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -1,
                      "created_utc": 1742848511.0,
                      "replies": [
                        {
                          "id": "mjn88g4",
                          "author": "EducationallyRiced",
                          "body": "Welp do a search about your specific issue including Reddit as a keyword might help , although it won’t help to recover for the downvotes you got for saying your amd gpu is no wanting to work",
                          "score": 1,
                          "created_utc": 1742906522.0,
                          "replies": [
                            {
                              "id": "mjou4wf",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 1,
                              "created_utc": 1742923788.0,
                              "replies": [
                                {
                                  "id": "mjp80jk",
                                  "author": "EducationallyRiced",
                                  "body": "Wdym its a pro amd echo chamber? All I ever see on there is about Nvidia. But ye I can understand you don’t like amd much after this kind of bs happening to you. Anyways hope you enjoy them cable melting devices",
                                  "score": 0,
                                  "created_utc": 1742927814.0,
                                  "replies": [
                                    {
                                      "id": "mjphcgg",
                                      "author": "None",
                                      "body": "[deleted]",
                                      "score": 1,
                                      "created_utc": 1742930555.0,
                                      "replies": [
                                        {
                                          "id": "mjpmwl4",
                                          "author": "EducationallyRiced",
                                          "body": "Calm down, never insulted your opinions.\nPhysX is made FOR Nvidia cards not amd.\nAmd is still about gaming, not Nvidia who’s only focusing on ai.",
                                          "score": 0,
                                          "created_utc": 1742932204.0,
                                          "replies": [
                                            {
                                              "id": "mjpnil6",
                                              "author": "None",
                                              "body": "[deleted]",
                                              "score": 0,
                                              "created_utc": 1742932377.0,
                                              "replies": [
                                                {
                                                  "id": "mjuvohg",
                                                  "author": "EducationallyRiced",
                                                  "body": "I never said physx is for ai??? I said Nvidia is FOCUSING on ARTIFICIAL INTELLIGENCE and NOT TAKING CARE OF THE MINORITY OF THEIR CLIENTS AKA GAMERS AND THAT THEY CANT EVEN SUPPORT THEIR OWN FUCKING TECHNOLOGIES ANYMORE. Physx was in borderlands 2 A game way before ai. Also didn’t I say physx is NOT MADE FOR AMD???? Can you not read?",
                                                  "score": 0,
                                                  "created_utc": 1743006656.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mjmx78s",
          "author": "BrendonBootyUrie",
          "body": "Is this black screen the same one I'm having? No rhyme or reason will be using my computer and then suddenly both screens go off and gpu speed ramps up to max. Have to turn off computer to fix it",
          "score": 2,
          "created_utc": 1742901762.0,
          "replies": []
        },
        {
          "id": "mjjcvm0",
          "author": "bogglingsnog",
          "body": "Do you mean 572.83?",
          "score": 1,
          "created_utc": 1742847106.0,
          "replies": []
        },
        {
          "id": "mjm080h",
          "author": "sturmeh",
          "body": "I had the black screen immediately after installing it but it went away after I forced a restart (after waiting several minutes for it to recover).",
          "score": 1,
          "created_utc": 1742881194.0,
          "replies": []
        },
        {
          "id": "mjm7oc3",
          "author": "trashcanman2000",
          "body": "Same with my 2080 Super.",
          "score": 1,
          "created_utc": 1742885846.0,
          "replies": [
            {
              "id": "mjmz2bt",
              "author": "Gregus1032",
              "body": "I guess I've been lucky with my 2070 super. I was thinking older cards were clear.",
              "score": 1,
              "created_utc": 1742902643.0,
              "replies": [
                {
                  "id": "mjmzytx",
                  "author": "trashcanman2000",
                  "body": "I'm glad!  My problem only came after restarting. My son was fine on his PC with a 3070.",
                  "score": 1,
                  "created_utc": 1742903059.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mjk2usn",
          "author": "ttubehtnitahwtahw1",
          "body": "You can really only ddu in safe mode so redundant.",
          "score": 0,
          "created_utc": 1742854897.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjh30cu",
      "author": "SpartanLeonidus",
      "body": "I've noticed PC lock ups & instability on my 4070 12GB since I updated to this driver. I may need to rollback.",
      "score": 26,
      "created_utc": 1742822735.0,
      "replies": [
        {
          "id": "mjlvlqe",
          "author": "Wrong_Hombre",
          "body": "Yeah I updated my 3070ti not too long ago to start playing that new Indiana Jones game and it's crashing my PC unless I turn all settings to low and downgrade to 1080p. Idk how an Xbox is running this game. All other games run as smooth as glass on my system.",
          "score": 1,
          "created_utc": 1742878622.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjkv3hb",
      "author": "Vegetable_Oil_7142",
      "body": "How can they be prioritizing RTX 5000 series when they barely made any RTX 5000 series",
      "score": 23,
      "created_utc": 1742863997.0,
      "replies": []
    },
    {
      "id": "mjhqgd8",
      "author": "gg06civicsi",
      "body": "I’m curious what percent of people are having problems vs have it working fine? It’s like the yelp effect where people mostly post about problems and not when things went well. \n\nIt might be that there is a small percent of people with these problems but they are the only ones posting and making it seem like everyone has it.",
      "score": 88,
      "created_utc": 1742830215.0,
      "replies": [
        {
          "id": "mjhujzh",
          "author": "garfield8625",
          "body": "this. yes.\n\npeople who has GPUs working fine do not visir reddit jsut to say, mine is workign fine... aside of the special ones.",
          "score": 44,
          "created_utc": 1742831431.0,
          "replies": [
            {
              "id": "mji9z54",
              "author": "hereforstories8",
              "body": "Mine is working fine",
              "score": 33,
              "created_utc": 1742835974.0,
              "replies": [
                {
                  "id": "mjkarsa",
                  "author": "ki11bunny",
                  "body": "beautiful naked big titty women dont fall out the sky ya know",
                  "score": 12,
                  "created_utc": 1742857401.0,
                  "replies": [
                    {
                      "id": "mjknsjb",
                      "author": "The-Gargoyle",
                      "body": "Well, they do, but terminal velocity kinda ruins the whole 'beautiful' part when they land, and then nobody wants to talk about it.\n\n:P",
                      "score": 9,
                      "created_utc": 1742861461.0,
                      "replies": [
                        {
                          "id": "mjlg0u0",
                          "author": "Jamba-Jew",
                          "body": "The sudden stop at the end seems to ruin the mood",
                          "score": 1,
                          "created_utc": 1742871556.0,
                          "replies": []
                        },
                        {
                          "id": "mjm5jxy",
                          "author": "DadPhD",
                          "body": "you just let them hit the pavement?! you have to catch them!!\n\nmr butterfingers over here ruining it for everyone else",
                          "score": 1,
                          "created_utc": 1742884488.0,
                          "replies": []
                        },
                        {
                          "id": "mjmbz1u",
                          "author": "ArseBurner",
                          "body": "I used to go to a LAN gaming place just across a big university, but stopped going once the lockdowns happened. \n\nBeen meaning to pay the place a visit, then I saw news from a gaming group chat that a young coed jumped from a nearby residential building and literally landed on the electricity meters of the place. I ended up not visiting anymore. The images shared of a young woman's mangled body on the parking lot of place I used to go to every day ruined the place for me. \n\nI hear they've moved to another location though, so I guess I can visit there just to reconnect with the owner. I kinda doubt any of the folks I used to play with still go.",
                          "score": 1,
                          "created_utc": 1742888707.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mjik1k7",
              "author": "Elastichedgehog",
              "body": "They also are more likely to have not updated their drivers regularly. \n\nThe 572.XX drivers have been hit or miss. 566.36 is stable.",
              "score": 5,
              "created_utc": 1742838796.0,
              "replies": []
            },
            {
              "id": "mjijpdb",
              "author": "Throwawaway314159265",
              "body": "Mine is working fine. GeForce RTX™ 4090 GAMING OC 24G.",
              "score": 2,
              "created_utc": 1742838700.0,
              "replies": []
            },
            {
              "id": "mjj030y",
              "author": "TumblrInGarbage",
              "body": "RTX 3080 here, I'm fine on 572.83.",
              "score": 1,
              "created_utc": 1742843418.0,
              "replies": []
            },
            {
              "id": "mjk9k1l",
              "author": "baubeauftragter",
              "body": "My GPU? If I speak.. I am in trouble..",
              "score": 1,
              "created_utc": 1742857022.0,
              "replies": []
            },
            {
              "id": "mjnz58n",
              "author": "Abtun",
              "body": "I had to reinstall the nvidia app for some reason on my 3060. Other than that no issues.",
              "score": 1,
              "created_utc": 1742915431.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mjhup7p",
          "author": "Turmfalke_",
          "body": "Hard to say, but there are already 3 reports in this thread about issues after an update. The other question is, what are acceptable odds?",
          "score": 7,
          "created_utc": 1742831474.0,
          "replies": []
        },
        {
          "id": "mjjg8uu",
          "author": "Sirisian",
          "body": "Also people with issues need to post them to the Nvidia forum. They tend to fix these issue relatively quickly in my experience as long as they're reported in the feedback thread. https://www.nvidia.com/en-us/geforce/forums/game-ready-drivers/13/",
          "score": 3,
          "created_utc": 1742848048.0,
          "replies": []
        },
        {
          "id": "mjhwuyc",
          "author": "vilemeister",
          "body": "I wouldn't usually post, but this thread has me interested.\n\nI updated my 2080 graphics driver the other day and after years of no issues I had 2 crashes this weekend on Transport Fever 2. Thought it was just the card getting old, but maybe not!",
          "score": 5,
          "created_utc": 1742832111.0,
          "replies": [
            {
              "id": "mjinpb3",
              "author": "stellvia2016",
              "body": "This is why the conventional wisdom says don't update your drivers unless there is a game that won't run or there is some critical patch you need to have, etc.",
              "score": 16,
              "created_utc": 1742839842.0,
              "replies": [
                {
                  "id": "mjjc95n",
                  "author": "randomIndividual21",
                  "body": "The have optimisation patch for every big new game release so that's no feasible unless you only play old game",
                  "score": 5,
                  "created_utc": 1742846929.0,
                  "replies": [
                    {
                      "id": "mjjgrm1",
                      "author": "stellvia2016",
                      "body": "I have yet to ever see a game-ready driver that did more than a few fps difference. You don't need it. I update my driver like every 12-18 months and I've never had a game run in such a state that the game ready driver ever made a difference that really mattered.",
                      "score": 10,
                      "created_utc": 1742848195.0,
                      "replies": [
                        {
                          "id": "mjjjdm7",
                          "author": "squarezero",
                          "body": "I update once ever 6-9 months. I'll check out the nvidia subreddit post for the latest driver, see which stable driver everyone is reverting to in the discussion, and then update to that (if needed).",
                          "score": 3,
                          "created_utc": 1742848930.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mjjthaj",
                      "author": "RikiWardOG",
                      "body": "I only play old games cuz I get them for like 5 bucks vs 60. Wild people pay full price for games imo",
                      "score": 2,
                      "created_utc": 1742851952.0,
                      "replies": [
                        {
                          "id": "mjk0joz",
                          "author": "alidan",
                          "body": "very few games are worth full price, wish there were more that were honestly.",
                          "score": 1,
                          "created_utc": 1742854169.0,
                          "replies": [
                            {
                              "id": "mjk99iu",
                              "author": "Wonderful-Mousse-335",
                              "body": "plus you'll get a working, updated game instead of a crashy/trashy game.. win-win?",
                              "score": 1,
                              "created_utc": 1742856931.0,
                              "replies": [
                                {
                                  "id": "mjkrmb3",
                                  "author": "alidan",
                                  "body": "honestly, im firmly on the side that like early access as soon as the game is in a playable state, god knows with 10 year dev cycles for some games, there is a good chance I die before they finish, and some of my favorite games were released in ea.\n\nI don't think a fully finished game with bug fixes actually does a whole hell of alot to make a game good, it just makes a game less annoying.",
                                  "score": 3,
                                  "created_utc": 1742862794.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mjiordu",
                  "author": "vilemeister",
                  "body": "Well, I had to reset my pc and the driver installer did it for me - couldn't use the recovery partition with all the drivers and installed it from bare bones so it wasn't an update per se, but a fresh install of a newer version.",
                  "score": 1,
                  "created_utc": 1742840148.0,
                  "replies": [
                    {
                      "id": "mjiq40z",
                      "author": "stellvia2016",
                      "body": "I see, well that is one nice thing with Nvidia is getting older driver versions is pretty trivial. I'm sure you already did, but it bears repeating to maybe help others:\n\nhttps://www.nvidia.com/en-us/geforce/drivers/\n\nYou can go to that link and set the values as appropriate, and it should provide a decent number of older driver revisions. 3rd party sites probably have even older ones than that if necessary, just make sure it's a site you can trust.",
                      "score": 2,
                      "created_utc": 1742840536.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mjjvyqa",
                  "author": "CamGoldenGun",
                  "body": "I'm usually lazy when it comes to updating drivers (usually a few weeks behind), but now I'm thinking if there's any point with an aging GTX1080.",
                  "score": 1,
                  "created_utc": 1742852734.0,
                  "replies": [
                    {
                      "id": "mjk2bg1",
                      "author": "stellvia2016",
                      "body": "Hard to say. I don't know the particulars of how the drivers are written to know if the \"optimizations\" made for new games would trickle down to being relevant for cards that old. I'm going to guess that most of their efforts aren't in raster performance anymore, and are mostly going to be related to newer features.",
                      "score": 1,
                      "created_utc": 1742854726.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mji8vtm",
          "author": "primalth0ught",
          "body": "I have a 3070 Founder’s, updated it a couple of days ago. No issues here!",
          "score": 3,
          "created_utc": 1742835647.0,
          "replies": []
        },
        {
          "id": "mjkblpm",
          "author": "ZafirZ",
          "body": "I've had more issues with the drivers since upgrading to a 50 series gpu than I had running them with my old 3080, lol.",
          "score": 2,
          "created_utc": 1742857665.0,
          "replies": []
        },
        {
          "id": "mjihloh",
          "author": "deejeycris",
          "body": "Does that matter? If I paid a product I want it working asap I don't care how many people have the issue.",
          "score": 2,
          "created_utc": 1742838109.0,
          "replies": []
        },
        {
          "id": "mjijwsz",
          "author": "Albatross_Charcoal",
          "body": "Noticed some weird behaviour with my 3080 ti lately, especially since the nvidia app changed and added “performance” section. I still use X1 / Afterburner but had to fight for its config to overrule the nvidia stuff. \n\nMy PC found to be the cause of tripping a 15a breaker when in “maximum performance mode”. IDK what or how it’s doing but it’s the only thing on the circuit that could do it. Also on a UPS / surge protector. \n\nWorks fine otherwise, get the odd monitor black screen but always comes back.",
          "score": 1,
          "created_utc": 1742838759.0,
          "replies": []
        },
        {
          "id": "mjil3ct",
          "author": "BoldMrRogers",
          "body": "Last week while looking for a 5090 I stumbled across a 4090 FE at BestBuy. I started my first time through Cyberpunk but was met with constant crashing. Turns out it was gsync. \n\nObviously just another anecdote, but this bug is reproducible.",
          "score": 1,
          "created_utc": 1742839090.0,
          "replies": []
        },
        {
          "id": "mjj0td2",
          "author": "ericstern",
          "body": "Something is definitely going on. I’ve been playing this 20 year old source engine fps( for that long). Got a 3070 a couple of years ago, everything’s been great updated it a couple time in 2023 and early 2024. Realized a couple months ago that I hadn’t updated gpu drivers in almost a year so I used nvidia app and installed the latest ready game driver or whatever it’s called, since then there’s like a 1/40th chance the game crashes when a map loads. This has never happened before. It’s been 20 years and this hasn’t happened. It hasn’t happened on my 3070 for two years. Only thing that changed on my pc was that gpu update update I did two months ago",
          "score": 1,
          "created_utc": 1742843632.0,
          "replies": []
        },
        {
          "id": "mjj491i",
          "author": "dopef123",
          "body": "I have a 4080 and updated drivers. No issues so far.",
          "score": 1,
          "created_utc": 1742844640.0,
          "replies": []
        },
        {
          "id": "mjkv9zk",
          "author": "seeingeyegod",
          "body": "I have a 4070Ti Super and a G-sync monitor but can't find the option for G-Sync where the internet shows it should be",
          "score": 1,
          "created_utc": 1742864058.0,
          "replies": [
            {
              "id": "mjl20lo",
              "author": "gg06civicsi",
              "body": "Are you using HDMI? You need to use display port.",
              "score": 2,
              "created_utc": 1742866418.0,
              "replies": [
                {
                  "id": "mjl6jth",
                  "author": "seeingeyegod",
                  "body": "I am using DP",
                  "score": 2,
                  "created_utc": 1742868013.0,
                  "replies": [
                    {
                      "id": "mjlejf3",
                      "author": "gg06civicsi",
                      "body": "Make sure gsync is turned on in your monitor.",
                      "score": 2,
                      "created_utc": 1742870980.0,
                      "replies": [
                        {
                          "id": "mjlw1t4",
                          "author": "seeingeyegod",
                          "body": "I found a setting that said \"adaptive sync\", which then made an identically named setting appear in display settings, turned that on and it definitely improved tearing issues I was seeing in microsoft flight sim 2024 using frame gen. I think that was it? thanks.",
                          "score": 3,
                          "created_utc": 1742878859.0,
                          "replies": [
                            {
                              "id": "mjlw8n9",
                              "author": "gg06civicsi",
                              "body": "Glad to hear, yeah we’ve all been there one way or another.",
                              "score": 2,
                              "created_utc": 1742878960.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mk92pjw",
          "author": "ryanvsrobots",
          "body": "4090 all good here",
          "score": 1,
          "created_utc": 1743195836.0,
          "replies": []
        },
        {
          "id": "mjlcrp2",
          "author": "Mindereak",
          "body": "If nothing was going wrong and even 1% of your user base starts having problem after the update then you just created a problem. Add that to the fact that you have the majority share of the GPU market and that 1% equals to tens of thousands of people.",
          "score": 0,
          "created_utc": 1742870308.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjhormk",
      "author": "pragmatick",
      "body": "I have a 5080 and problems with HDR with G-Sync, and more than 60 FPS. So I don't feel being priotized.",
      "score": 6,
      "created_utc": 1742829712.0,
      "replies": [
        {
          "id": "mjkrsjw",
          "author": "Vmanaa",
          "body": "Same, they aren’t prioritizing anyone, cause the  5000 series is broken in so many ways too",
          "score": 1,
          "created_utc": 1742862855.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjhzmwa",
      "author": "sqparadox",
      "body": "The first 50 series driver broke G-Sync on my 3080 Ti. It makes the whole screen flicker white.\n\nI reverted to and have continued using the last driver from December. But I'm worried about what happens when I buy a new game that wants newer drivers.",
      "score": 5,
      "created_utc": 1742832945.0,
      "replies": []
    },
    {
      "id": "mjlwkq8",
      "author": "Atomix117",
      "body": "I have a 4090 and Diablo 4 has hard crashed my computer twice this weekend. I assume it's related to this.",
      "score": 5,
      "created_utc": 1742879142.0,
      "replies": []
    },
    {
      "id": "mjhdwpj",
      "author": "AEternal1",
      "body": "For the last 6 years I have heard consistent bad news about graphics cards, making it really impossible to upgrade from my 1070. Nvidia has left gamers behind, and it really shows.",
      "score": 23,
      "created_utc": 1742826345.0,
      "replies": [
        {
          "id": "mjicmjq",
          "author": "OffbeatDrizzle",
          "body": "I just upgraded to a 9070xt from a 3060ti and couldn't be happier",
          "score": 6,
          "created_utc": 1742836735.0,
          "replies": [
            {
              "id": "mjj2z4v",
              "author": "ultra2009",
              "body": "I just got a 9070xt, really happy with the performance. AMD had a great launch with this card",
              "score": 6,
              "created_utc": 1742844266.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mji1cs8",
          "author": "xXRHUMACROXx",
          "body": "Confirmation bias because of social media exposure. \n\nEvery problem you read about probably affects a marginal % of consumers. Meanwhile there’s probably millions of users that enjoy their products without issues.",
          "score": 19,
          "created_utc": 1742833458.0,
          "replies": [
            {
              "id": "mjik5or",
              "author": "Roughneck_Joe",
              "body": "Except for 5000 series users since only like 12 of those shipped",
              "score": 13,
              "created_utc": 1742838828.0,
              "replies": []
            },
            {
              "id": "mjindbz",
              "author": "Stubs_Mckenzie",
              "body": "I think it's disingenuous to suggest that confirmation bias is the cause of their concern, the last 6 years of graphics card releases have absolutely had a lot of bad press for good reason.  The 20 series cards were way too expensive and did not deliver on promised addons they were marketed on and the 30 series, while overall very good on launch baring notably bad lower end cards, quickly were unavailable for anything but astronomical prices for the majority of their run due to scalping and AI use, not to mention concerns about memory specs and other issues.\n\nOn the radeon side, the 500 series was just a refresh of the 400 series that was decent price for performance but wasn't wowing anyone, and the 6000 series 6700 and above was again, generally well received like the Nvidia 30 series but quickly became unavailable.  It's unfortunate that the mostly fixed driver issues with radeon was still a cloud hanging over their head, but the negative sentiment around this time was about price and availability for both brands, and very valid for a very large segment of the population.",
              "score": 8,
              "created_utc": 1742839745.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mjif3k4",
          "author": "Erionns",
          "body": "I got a 4080 super for MSRP back in November and have had literally zero issues with it.",
          "score": 1,
          "created_utc": 1742837384.0,
          "replies": [
            {
              "id": "mjjf41l",
              "author": "AEternal1",
              "body": "I wonder if I can get so lucky🤣 Ive quit looking.",
              "score": 2,
              "created_utc": 1742847730.0,
              "replies": [
                {
                  "id": "mjjg2k9",
                  "author": "Erionns",
                  "body": "At this point, good luck. I specifically got mine instead of waiting, cause I've been through this game enough times to know waiting for the new series to drop is a trap",
                  "score": 1,
                  "created_utc": 1742848000.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mjmd5xy",
              "author": "OMGItsCheezWTF",
              "body": "Yeah I accidentally lucked out and got an MSRP 4080 super in december, apparently they went from being widely in stock to being like gold dust within a few weeks of me purchasing mine.",
              "score": 2,
              "created_utc": 1742889498.0,
              "replies": []
            },
            {
              "id": "mjmi3pe",
              "author": "OpposesTheOpinion",
              "body": "I went from 1080 to a 4080 super (on launch day) at MSRP. Zero issues. It outperforms all my expectations. The best thousand I've bucks spent.",
              "score": 1,
              "created_utc": 1742892900.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mjlcksf",
      "author": "Mussof",
      "body": "4070 Ti Super on the newest driver with no issues to date thankfully. Wonder if it’s a weird combo of hardware causing it?  Dunno.  : /",
      "score": 3,
      "created_utc": 1742870237.0,
      "replies": []
    },
    {
      "id": "mjj6av6",
      "author": "Derthnox92",
      "body": "My 3060 ti is working fine",
      "score": 7,
      "created_utc": 1742845239.0,
      "replies": [
        {
          "id": "mjjh4l9",
          "author": "12kdaysinthefire",
          "body": "Same here brother, fuck yes",
          "score": 1,
          "created_utc": 1742848296.0,
          "replies": []
        },
        {
          "id": "mjjrfbe",
          "author": "Darknessie",
          "body": "Mine to. Great card",
          "score": 1,
          "created_utc": 1742851296.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjh2cuz",
      "author": "ComputerSong",
      "body": "My 3080 is fine…",
      "score": 10,
      "created_utc": 1742822499.0,
      "replies": [
        {
          "id": "mjhdq00",
          "author": "Hissing_Newt",
          "body": "Same. My 10gb is chugging along in 2k.",
          "score": 5,
          "created_utc": 1742826285.0,
          "replies": []
        },
        {
          "id": "mjhtypg",
          "author": "jwensley2",
          "body": "My 3080 had a bunch of issues until I rolled back to pre 5000 series drivers. And I still get occasional black flashes on my main monitor.\n\nI’ve seen suggestions that it has to do with having multiple monitors and/or HDR. That fits my case at least since I have 3 monitors with different refresh rates and one of them has HDR.",
          "score": 7,
          "created_utc": 1742831259.0,
          "replies": [
            {
              "id": "mjhuft4",
              "author": "Crazy-Pain5214",
              "body": "Do you have some version number to help a brother out that has been having crashes on most recent ones?",
              "score": 2,
              "created_utc": 1742831397.0,
              "replies": [
                {
                  "id": "mjiaumw",
                  "author": "fummyfish",
                  "body": "566.36 for my 3090 fixed the black screen crashes",
                  "score": 3,
                  "created_utc": 1742836225.0,
                  "replies": []
                },
                {
                  "id": "mjix497",
                  "author": "jwensley2",
                  "body": "I’m on 566.36",
                  "score": 3,
                  "created_utc": 1742842564.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mjidz4v",
              "author": "champbob",
              "body": "I've got a similar setup; 3 screens, different resolutions, different refresh rates, 1 with HDR on a 3080. I've updated my GPU drivers recently for Monster Hunter Wilds, but haven't encountered any issues...\n\nHowever, I did have to disable GSync, else I'd be prone to black flashes despite my \"gsync ultimate\" monitor. That issue has been there since the beginning.",
              "score": 1,
              "created_utc": 1742837076.0,
              "replies": [
                {
                  "id": "mjiyiqx",
                  "author": "jwensley2",
                  "body": "Strange, I’ve been using GSync for years and never had the black flashes until recently when I got a new 360Hz OLED with FreeSync.",
                  "score": 1,
                  "created_utc": 1742842967.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mjifogn",
          "author": "biopticstream",
          "body": "Had my first issue with drivers really ever when the 5000 series first released, sporting a 4090.  Games would crash, sometimes the whole PC would blue screen.  But a clean install fixed it, and have had no issues with subsequent patches and hotfixes. That being said, these recent drivers absolutely had issues.",
          "score": 1,
          "created_utc": 1742837555.0,
          "replies": []
        },
        {
          "id": "mjikdwt",
          "author": "Elastichedgehog",
          "body": "What driver version are you on?",
          "score": 1,
          "created_utc": 1742838890.0,
          "replies": [
            {
              "id": "mjiqi3u",
              "author": "MorningPapers",
              "body": "572.42",
              "score": 1,
              "created_utc": 1742840650.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mjh2crn",
      "author": "Art_by_the_Snowman",
      "body": "I bought a 7900xtx back in December and I'm sure glad I did.",
      "score": 13,
      "created_utc": 1742822498.0,
      "replies": [
        {
          "id": "mjheotx",
          "author": "Stereo-Zebra",
          "body": "My 4070 supers gave me more driver issues than my Radeon RX 6700 ever did. Hell of an upgrade power wise but  the post 5000 launch drivers have been horrible",
          "score": 13,
          "created_utc": 1742826593.0,
          "replies": [
            {
              "id": "mjhkmde",
              "author": "Mimterest",
              "body": "My 4070 has had the wildest graphical issue to date: compression artifacting glitching.. it only happened with certain driver versions, on two or three of them to date, basically whenever there was any kind of compression going on, the pixels in the compression would kind of .. move around while having a green tint. Like a lasso tool but more subtle.\n\nFeels wild when your static daily Windows background starts moving, or random textures in games.. Rolling back to an older driver fixed it, waiting for a new one after also kept the issue away. I thought my card was dying xD",
              "score": 9,
              "created_utc": 1742828459.0,
              "replies": []
            },
            {
              "id": "mji3t0o",
              "author": "TwoBionicknees",
              "body": "Nvidia did a phenomenal PR job and internet job to make problems seem small.\n\nThey take over every site that has like tech forums and direct all users to their own nvidia forums. most people with problems go to nvidia forums and no one else at all goes there. So on reddit amd users post problems, don't go to amd forums (they are dead, useless and not pushed to be used by amd at all) and so their problems are very public. Nvidia users go talk about nvidia problems in this tiny private corner of hte internet and so most people are unaware of problems.\n\nI forget how long ago this was but there was a pretty big stuttering issue on nvidia cards, (probably like 6-7 years ago now) and there were MASSIVE threads, thousands and thousands of posts long, for months on end, begging for a fix but those threads weren't on reddit, weren't on any of the store forums I check now and then, tech forums, it was only talked about there.\n\nAt the time you would have the average user swear blind Nvidia has zero driver issues ever and AMD have constant issues.\n\nIt's almost entirely down to PR and working hard to control where people go to get help. Nvidia has plenty of driver issues, they just largely get hidden.",
              "score": 7,
              "created_utc": 1742834185.0,
              "replies": [
                {
                  "id": "mjiieex",
                  "author": "haywardhaywires",
                  "body": "glad I havent updated my GPU then!",
                  "score": 1,
                  "created_utc": 1742838336.0,
                  "replies": []
                },
                {
                  "id": "mjk22wi",
                  "author": "alidan",
                  "body": "amd lists known issues in their driver updates, or at least did last time I looked at patch notes for them. \n\nbut nvidia was the only brand I have used that had bluescreen issues when playing videos (it may happen one out of every 1000 videos, but god was it fun hitting that)\n\nmore issues than amd even back in their 'they have no drivers' days",
                  "score": 1,
                  "created_utc": 1742854651.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mjh4xui",
          "author": "NotOneofaKind",
          "body": "Same, got a 7800xt for under $500 last December.",
          "score": 4,
          "created_utc": 1742823423.0,
          "replies": []
        },
        {
          "id": "mjiqasa",
          "author": "Vandrel",
          "body": "I bought a 7900 XTX at $850 for one computer end of 2023 and a 4080 Super for $1050 for the other last spring. I was super hesitate to spend that kind of money on GPUs at the time because the 7900 XTX had been out for a year and then the 4000 series had been out for a year and a half when they were bought and I thought for sure new generations that would surpass them wouldn't be very far away. Boy was I wrong, apparently these cards are still going to be some of the best on the market for a couple more years.",
          "score": 2,
          "created_utc": 1742840591.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjka7nv",
      "author": "QuantumQuantonium",
      "body": "Accused? They dropped support of 32 bit physx just because its an old ai free tech designed for their older cards.",
      "score": 2,
      "created_utc": 1742857226.0,
      "replies": []
    },
    {
      "id": "mji9zto",
      "author": "kalirion",
      "body": "1050 ti - my Nvidia App refuses to even open, but that means it won't auto-upgrade any \"GameReady Drivers\" for me, so that's cool. Not that I have a G-Sync Monitor, nor use framegen (aside from experimenting with Lossless Scaling app).",
      "score": 2,
      "created_utc": 1742835979.0,
      "replies": [
        {
          "id": "mjlysu4",
          "author": "prontoingHorse",
          "body": "How is the lossless scaling? - fellow 1050ti mate",
          "score": 2,
          "created_utc": 1742880384.0,
          "replies": [
            {
              "id": "mjmaew4",
              "author": "kalirion",
              "body": "Speaking strictly of its framegen, based on my experience, don't use it on shooters or action games requiring quick reflexes unless they're old/retro games that come permanently locked to 30fps by the engine (i.e. games like Viking: Battle for Asgard / lazy console ports without working 60fps patches, etc).\n\nAs far as games where the GPU genuinely struggled to reach 60, I got decent results with Arise: A Simple Story and Beyond a Steel Sky (though I didn't play too far into this so don't know whether that would hold). In these I locked the games to 30fps, kept the settings near maxed @1080p, and the scrolling/running/panning were noticeably smoothed out and I didn't mind some additional input lag.\n\nWhenever I tried LSFG with a FPS though, I quickly disabled it - they just *felt* so much worse to play despite the *visual* smoothness of looking around.\n\nFor funzies I played some Wacky Wheels, and old DOS cart racer that runs at 10-12fps, with LS set to Adaptive FG (60fps). It was a very surreal experience, like playing the game on hallucinogenics.\n\nI originally bought Lossless Scaling for the, well, lossless scaling functionality - integer scaling to use with lowres retro games so I could see their pixels in all their glory without interpolation from GPU or monitor getting in the way. So for me, all this \"FG\" stuff is just a bonus that was added later.\n\nI'll be getting a new PC by end of year, after MS drops support for Windows 10 (Win 11 won't take to my i7-920, lol), so right now I'm avoiding games my PC struggles with, both CPU and GPU wise. Plenty of games in the ol' backlog that I don't need any kind of framegen for performance boosting. Who knows, maybe I'll even get around to Skyrim (probably not).",
              "score": 2,
              "created_utc": 1742887650.0,
              "replies": [
                {
                  "id": "mjmjvtu",
                  "author": "prontoingHorse",
                  "body": "Thank you! I had heard of Frame generation being bad for fps.\n\nSo when I selected FSR3 in call of Duty I made sure to turn it off specifically.\n\nGame ran beautifully, smoothly and gave decent fps.\n\nBut the lag was definitely there. Which was odd because high fps = lower latency. Turns out it was Frame generation lag. Even though I had turned it off. Couldn't hit a single shot. \n\nThe moment I switched to a different upscalar like nvidias, performance dropped but so did the lag.",
                  "score": 2,
                  "created_utc": 1742894088.0,
                  "replies": [
                    {
                      "id": "mjnxcko",
                      "author": "kalirion",
                      "body": "Very strange that FSR3 forced FG on you despite you explicitly turning it off. You may want to reach out to that game's community for help.",
                      "score": 2,
                      "created_utc": 1742914889.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mjiwnua",
      "author": "dirtydoofus",
      "body": "The 5000 series is such a ludicrous flop. You know it’s a bad release when your biggest focus is how great your frame gen is",
      "score": 3,
      "created_utc": 1742842435.0,
      "replies": []
    },
    {
      "id": "mjjfd1y",
      "author": "Noxious89123",
      "body": "Well yeah, no shit.\n\nI really hope they ***are*** prioritising 50 series, given how expensive they are.\n\nIt sucks that people on older cards are having driver issues too, but the most important factor here is that owners of older cards **have working drivers to roll back to, prior to 572.xx**.\n\n50 Series **only** has the 572.xx drivers, with no \"good\" drivers to roll back to.\n\nIf you're on an older card, what the hell are you installing 572.xx?! stay on your working driver!",
      "score": 1,
      "created_utc": 1742847800.0,
      "replies": []
    },
    {
      "id": "mji2s52",
      "author": "TwoBionicknees",
      "body": "weird to prioritise 60 users over millions.",
      "score": 3,
      "created_utc": 1742833883.0,
      "replies": [
        {
          "id": "mjj1cac",
          "author": "prules",
          "body": "Most of us can’t return our cards at this point so they don’t care about serving us lol",
          "score": 0,
          "created_utc": 1742843785.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjhfafw",
      "author": "NowOurShipsAreBurned",
      "body": "Had the black screen issue with my 3070, happened about once a day, yesterday I updated drivers to the latest and it happened every 5 minutes. Used DDU and it fixed it for now.",
      "score": 1,
      "created_utc": 1742826785.0,
      "replies": [
        {
          "id": "mji91i1",
          "author": "kalirion",
          "body": "After you use DDU, do you then go to the NVIDIA site and pick a specific older driver (and make sure Nvidia App doesn't re-upgrade to the broken version)?",
          "score": 2,
          "created_utc": 1742835692.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjhojbu",
      "author": "calcium",
      "body": "I've been getting BSOD's for the last week on my windows box after updating my drivers back on 3/11.  According to the reliability report my machine will BSOD every few days - sometimes while I'm gaming, other times when the machine is just sitting idle or I'm watching a video.  Been driving me insane and I figured it was either my nvidia drivers that I updated then or Starfield that I finally bought/installed then.  Running a 4070 Super here.",
      "score": 1,
      "created_utc": 1742829642.0,
      "replies": []
    },
    {
      "id": "mjhuwsl",
      "author": "LookinForLoot",
      "body": "NVIDIA Reflex On has been crashing me recently",
      "score": 1,
      "created_utc": 1742831535.0,
      "replies": []
    },
    {
      "id": "mjhvlep",
      "author": "campbellhouse208",
      "body": "I’ve refused to let windows update for a hot minute now cause the last one I did around the time the 50s came out I got the black screen issue, took me days to fix the issue",
      "score": 1,
      "created_utc": 1742831736.0,
      "replies": []
    },
    {
      "id": "mjhx9vb",
      "author": "saints21",
      "body": "Don't worry, the 5000 series isn't doing any better either. I had to do a system restore because the last driver I downloaded for my 5080 broke everything.",
      "score": 1,
      "created_utc": 1742832236.0,
      "replies": []
    },
    {
      "id": "mji0l64",
      "author": "Greyboxer",
      "body": "Not even upgrading drivers anymore since I won’t e playing new games for a few years anyway.",
      "score": 1,
      "created_utc": 1742833230.0,
      "replies": []
    },
    {
      "id": "mji3tv8",
      "author": "thatchroofcottages",
      "body": "Turn off global g-sync. Change settled to fixed frame rate, that fixes cyberpunk crashing at least.",
      "score": 1,
      "created_utc": 1742834192.0,
      "replies": []
    },
    {
      "id": "mji90s9",
      "author": "None",
      "body": "LOL, we got your mone 🤑",
      "score": 1,
      "created_utc": 1742835686.0,
      "replies": []
    },
    {
      "id": "mjiknef",
      "author": "Tirith",
      "body": "My card died (constant artifacting then couldnt even enable it) after recent driver update.",
      "score": 1,
      "created_utc": 1742838965.0,
      "replies": [
        {
          "id": "mjmid7o",
          "author": "OpposesTheOpinion",
          "body": "> My car died (constant artifacting then couldnt even enable it) after recent driver update.\n\nBruh how bad is your driving?",
          "score": 1,
          "created_utc": 1742893074.0,
          "replies": [
            {
              "id": "mjo2wzt",
              "author": "Tirith",
              "body": "🤣",
              "score": 1,
              "created_utc": 1742916559.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mjiuemw",
      "author": "ezredd1t0r",
      "body": "just received the Gigabyte Aorus Master RTX 5090 and a friend who bought the same one reported back screen crashing, so even 5000 series ain't fine lol",
      "score": 1,
      "created_utc": 1742841790.0,
      "replies": []
    },
    {
      "id": "mjizt8l",
      "author": "Spanky2k",
      "body": "3090 FE and I have so many stability issues now. Alt+Tabbing gives graphical errors in Discord/browser/in-game and sometimes alt tab will just crash my whole machine. It’s infuriating. I’ll have a look at rolling back to the pre 5000 drivers and see if that improves things because it’s driving me nuts.",
      "score": 1,
      "created_utc": 1742843339.0,
      "replies": []
    },
    {
      "id": "mjjt1c3",
      "author": "-__Doc__-",
      "body": "3090ti owners here. Bought it a week before the 4090 launch and I use it heavily daily. Zero issues with my card. Runs like a dream.",
      "score": 1,
      "created_utc": 1742851811.0,
      "replies": []
    },
    {
      "id": "mjk3mpk",
      "author": "pizoisoned",
      "body": "My 4080 FE seems fine. My wife’s ASUS 4080 black screened and did a bunch of goofy shit on the 572.xx driver. I rolled hers back and it’s fine.",
      "score": 1,
      "created_utc": 1742855143.0,
      "replies": []
    },
    {
      "id": "mjkbwko",
      "author": "Dnaldon",
      "body": "Just updated my Nvidia drivers. Black screen. Had to do some googling and use DDU in safemode. Kinda sad we have to rely on third party software, but thank God for DDU",
      "score": 1,
      "created_utc": 1742857758.0,
      "replies": []
    },
    {
      "id": "mjkckoo",
      "author": "tarel69",
      "body": "4070ti could not turn off or on dlss had to ddu and reinstall whatever the latest garbage is",
      "score": 1,
      "created_utc": 1742857968.0,
      "replies": []
    },
    {
      "id": "mjkcssu",
      "author": "BennieOkill360",
      "body": "Oof I'll stay on the latest stable one then",
      "score": 1,
      "created_utc": 1742858038.0,
      "replies": []
    },
    {
      "id": "mjklged",
      "author": "RChamy",
      "body": "After the latest Windows update 21/03 my system refused to reach the login screen until I safe Mode DDU the video driver. Quite odd.",
      "score": 1,
      "created_utc": 1742860662.0,
      "replies": []
    },
    {
      "id": "mjkpxpi",
      "author": "marcanthonynoz",
      "body": "I have a 5080 and I noticed mid game randomly my PC will lock up and I have to hard restart it. Anyone having this type of issue? Its specifically with assassin's creed shadows from what I've gathered.",
      "score": 1,
      "created_utc": 1742862205.0,
      "replies": []
    },
    {
      "id": "mjkpxur",
      "author": "Berkut22",
      "body": "Serious question ;\n\nIs there any point to upgrading your drivers if you're on an old card (30 series) not playing the latest games, and don't have any issues?",
      "score": 1,
      "created_utc": 1742862206.0,
      "replies": []
    },
    {
      "id": "mjku027",
      "author": "Vmanaa",
      "body": "The 5000 series are mega broken because of drivers. wtf are they talking about???",
      "score": 1,
      "created_utc": 1742863617.0,
      "replies": []
    },
    {
      "id": "mjky30p",
      "author": "Lagoon___Music",
      "body": "Fuck I have been so annoyed that my computer has been acting weird and tried so many things but it kept randomly crashing.  Now I get this article in my feed...my 3070 is definitely acting up, this totally explains it.  Wow!",
      "score": 1,
      "created_utc": 1742865037.0,
      "replies": []
    },
    {
      "id": "mjlhccw",
      "author": "talon04",
      "body": "3090 here lots of screen flickering for me has become a new norm it seems like on Helldivers. It's a \"known issue\" but with no fix in sight.",
      "score": 1,
      "created_utc": 1742872081.0,
      "replies": []
    },
    {
      "id": "mjloyz7",
      "author": "authustian",
      "body": "Yeah, i had to roll back the drivers for my 2080ti after the first framgen update. I'm one of those weird people that updates my drivers every month or so.",
      "score": 1,
      "created_utc": 1742875362.0,
      "replies": []
    },
    {
      "id": "mjlsjpc",
      "author": "TurnUpThe4D3D3D3",
      "body": "My 1070 still runs good",
      "score": 1,
      "created_utc": 1742877068.0,
      "replies": []
    },
    {
      "id": "mjlwc8m",
      "author": "Mugsy_Siegel",
      "body": "Anyone with a 3080 have issues since update when right clicking a pic you get a full screen refresh?",
      "score": 1,
      "created_utc": 1742879015.0,
      "replies": []
    },
    {
      "id": "mjmaiv0",
      "author": "GrynaiTaip",
      "body": "I think I'll continue chilling with my 1660 Super for a while longer. I don't really need to play the newest games all that bad.",
      "score": 1,
      "created_utc": 1742887723.0,
      "replies": []
    },
    {
      "id": "mjmeqe0",
      "author": "Osiris_Raphious",
      "body": "Planned obsolescence, now with software indusced obsolescence... Android, apple, windows, and now HP Samsung, nvidia are all doing it. Either on purpose or just malice of focusing on profit driving new stock and abandoning the old. But like not giving the ability to self manage and update by community, no locking it down and forcing people to sort of decide to upgrade. \n\nTechnofuedalism is here.",
      "score": 1,
      "created_utc": 1742890574.0,
      "replies": []
    },
    {
      "id": "mjmj5th",
      "author": "JimmyTheBones",
      "body": "No mans sky eats shit on the first load screen if I use frame gen on a 4090",
      "score": 1,
      "created_utc": 1742893608.0,
      "replies": []
    },
    {
      "id": "mjmj9ga",
      "author": "TowerofWavelength",
      "body": "I hope nvidia pay for their behaviour over the past few years. From melting connectors, broken drivers, 5000 series that don’t support physx, massively inflated prices and gimping budget cards with 8gb or less ram. I’m glad AMD are getting their act together with upscaling and ray tracing because I’m sick of their bullshit.",
      "score": 1,
      "created_utc": 1742893675.0,
      "replies": []
    },
    {
      "id": "mjmplxv",
      "author": "PsyJak",
      "body": "*prioritising",
      "score": 1,
      "created_utc": 1742897674.0,
      "replies": []
    },
    {
      "id": "mjmtkt7",
      "author": "Brief-Mulberry-3839",
      "body": "“Here is the fix: buy the new ones.”\n\nNVIDIA.",
      "score": 1,
      "created_utc": 1742899917.0,
      "replies": []
    },
    {
      "id": "mjn51ue",
      "author": "DarkFate13",
      "body": "Time for ATI Radeon",
      "score": 1,
      "created_utc": 1742905247.0,
      "replies": []
    },
    {
      "id": "mjnbpdb",
      "author": "The_Real_Raw_Gary",
      "body": "Color me shocked a company would prioritize its newest card over the older ones lol",
      "score": 1,
      "created_utc": 1742907826.0,
      "replies": []
    },
    {
      "id": "mjnge08",
      "author": "djbabaru",
      "body": "Been having the same issue with 4080, DDU in safe mode also and then going back to the Jan release driver has also not helped",
      "score": 1,
      "created_utc": 1742909506.0,
      "replies": []
    },
    {
      "id": "mjnsrwa",
      "author": "Thoromega",
      "body": "They charge way to much to have amd level drivers",
      "score": 1,
      "created_utc": 1742913495.0,
      "replies": []
    },
    {
      "id": "mjh5p4z",
      "author": "PM_ME_TRICEPS",
      "body": "My 1080 is working fine for my retro gaming needs thanks.",
      "score": 0,
      "created_utc": 1742823684.0,
      "replies": [
        {
          "id": "mji8lnx",
          "author": "kalirion",
          "body": "Same for my 1050 ti, with only an i7-920 providing it polygons. Sure there are many games in my library that don't run well, but there are also very many that run perfectly, the good thing about massive backlogs. Currently playing Metal Gear Rising: Revengeance for the first time.\n\nI feel sad that I'll need to get a new PC for Win 11 soon.",
          "score": 0,
          "created_utc": 1742835567.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjgx2d3",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1742820504.0,
      "replies": [
        {
          "id": "mjhbp5z",
          "author": "Jamie00003",
          "body": "Lmao 5 times??? This is why the GPU market is such a mess, people keep buying no matter how bad it gets",
          "score": -5,
          "created_utc": 1742825634.0,
          "replies": [
            {
              "id": "mjhpj9g",
              "author": "RemingtonSnatch",
              "body": "That's the joke.",
              "score": 3,
              "created_utc": 1742829940.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mjh8dg5",
      "author": "SuppleDude",
      "body": "My 4090 FE is working fine. No issues here.",
      "score": 1,
      "created_utc": 1742824595.0,
      "replies": []
    },
    {
      "id": "mjin0fp",
      "author": "Crowdfunder101",
      "body": "People have no idea about logistics.\n\nFirst off, it’s not gonna be the same team making a new graphics card as one who is dealing with issues of existing products.\n\nAnd even then, what’re they gonna do? Half all the factories producing new chips? Cancel all of their shipping containers to take new chips around the world? Hold all the marketing? Cancel the announcement and suck up the cost of venue hire and try to claim it back on insurance?",
      "score": 1,
      "created_utc": 1742839641.0,
      "replies": [
        {
          "id": "mjl6097",
          "author": "grumd",
          "body": "I'm pretty sure this is about driver updates though",
          "score": 4,
          "created_utc": 1742867819.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjh3i1o",
      "author": "sorrylilsis",
      "body": "I mean even in 20 series you have issues serious issues these days. \n\nI've got an old 2060 at home and it's been a couple months of black screen issues on windows that can only be fixed with a hard reboot. And I had to roll back a couple drivers versions just to be able to boot.",
      "score": 1,
      "created_utc": 1742822911.0,
      "replies": []
    },
    {
      "id": "mjht0li",
      "author": "ohiocodernumerouno",
      "body": "My GTX8800GT is still dead.",
      "score": 1,
      "created_utc": 1742830978.0,
      "replies": [
        {
          "id": "mji9kpg",
          "author": "kalirion",
          "body": "Do you mean 8800 GT or 8800 GTX? I don't think \"GTX8800GT\" is a real card.",
          "score": 2,
          "created_utc": 1742835854.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjh2hjp",
      "author": "RiderLibertas",
      "body": "How can I disable G-Sync?  Is that done in a particular game's settings or is it an aspect of the video card?",
      "score": 0,
      "created_utc": 1742822547.0,
      "replies": [
        {
          "id": "mjh8ypq",
          "author": "NinjaLion",
          "body": "right click desktop, nvidia control panel, left side menu, display, > set up g-sync, make sure all checkboxes in section 1 are unchecked, save, exit.",
          "score": 4,
          "created_utc": 1742824790.0,
          "replies": [
            {
              "id": "mjhm7hb",
              "author": "RiderLibertas",
              "body": "My menu deson't have the \"set up g-sync\" option at all.",
              "score": 1,
              "created_utc": 1742828944.0,
              "replies": [
                {
                  "id": "mjhn520",
                  "author": "NinjaLion",
                  "body": "Then your monitor does not have g-sync compatibility, or your nvidia driver is not detecting it properly.",
                  "score": 2,
                  "created_utc": 1742829224.0,
                  "replies": [
                    {
                      "id": "mji1zy1",
                      "author": "RiderLibertas",
                      "body": "You know, I've been wondering about this.  I have a 4k TV for my monitor but it's an older one now.",
                      "score": 1,
                      "created_utc": 1742833650.0,
                      "replies": [
                        {
                          "id": "mjmdffg",
                          "author": "OMGItsCheezWTF",
                          "body": "TVs are almost certainly not going to support G-Sync. G-Sync requires specific hardware in the display to function, it's not purely in the graphics card.",
                          "score": 1,
                          "created_utc": 1742889676.0,
                          "replies": [
                            {
                              "id": "mjnrbb2",
                              "author": "RiderLibertas",
                              "body": "Meh, considering I'm looking to turn G-Sync off I'm not too concerned.",
                              "score": 1,
                              "created_utc": 1742913037.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mjhjzbv",
          "author": "GreyScope",
          "body": "Just stay on a driver that works and don’t worry about g-sync (unless you need the updated driver for a new game of course) .",
          "score": 2,
          "created_utc": 1742828261.0,
          "replies": [
            {
              "id": "mjhmcx0",
              "author": "RiderLibertas",
              "body": "Yeah, I'm going to roll back and see if that helps.",
              "score": 1,
              "created_utc": 1742828990.0,
              "replies": [
                {
                  "id": "mjhu1az",
                  "author": "GreyScope",
                  "body": "v572.16 - 4090 here, this one works for me, the next two black screened.",
                  "score": 1,
                  "created_utc": 1742831280.0,
                  "replies": [
                    {
                      "id": "mji2etc",
                      "author": "RiderLibertas",
                      "body": "Thanks!  I downloaded 566.36 to try with my own 4090 but maybe I don't have to go back that far.  I'll try 572.16 first.\n\nThe last 2 updates when I installed them went to black screen and I had to reboot to get back but Nvidia said they were installed.  I should have realized.",
                      "score": 0,
                      "created_utc": 1742833773.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mji44pr",
          "author": "thatchroofcottages",
          "body": "I don’t get the downvotes.  Do it from the nvidia app - under display or visual settings, goto Global, Monitor tech - pick fixed refresh, not g-sync.  Fixed cyberpunk crashes for me.",
          "score": 1,
          "created_utc": 1742834280.0,
          "replies": [
            {
              "id": "mji6m4s",
              "author": "RiderLibertas",
              "body": "I've found out that my older 4k tv doesn't support these things so I don't have those items in my nvidia app menu.  I'm going to try rolling back my driver for now but looks like I'm in the market for a new TV too.",
              "score": 1,
              "created_utc": 1742835002.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mjh1dcc",
      "author": "Pipupipupi",
      "body": "Forced obsolescence yo. Just like how Apple updates make old phones slower after the new phone comes out.",
      "score": -10,
      "created_utc": 1742822138.0,
      "replies": [
        {
          "id": "mjhbh5g",
          "author": "Jamie00003",
          "body": "The reason phones get bogged down over time is due to newer software having more features. If you want to avoid this don’t update your phone\n\nApple don’t do this to force you to upgrade lmao",
          "score": 3,
          "created_utc": 1742825561.0,
          "replies": [
            {
              "id": "mjhiqi3",
              "author": "Deep_Taco",
              "body": "Apple was literally sued over intentionally slowing phones down.\n\nhttps://en.m.wikipedia.org/wiki/Batterygate",
              "score": 2,
              "created_utc": 1742827876.0,
              "replies": [
                {
                  "id": "mjhiw6u",
                  "author": "Jamie00003",
                  "body": "That was years ago and it was for a reason if you research the subject properly",
                  "score": 1,
                  "created_utc": 1742827925.0,
                  "replies": [
                    {
                      "id": "mjvgp76",
                      "author": "Joxsund",
                      "body": "just because there's a reason doesn't mean there's not an incentive for Apple to have done this, for maximum profits, and they got caught",
                      "score": 1,
                      "created_utc": 1743012621.0,
                      "replies": [
                        {
                          "id": "mjvhui6",
                          "author": "Jamie00003",
                          "body": "It wasn’t for profits lmao. It was literally for safety, it’s just they should have told their users",
                          "score": 1,
                          "created_utc": 1743012955.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mjh8yyz",
          "author": "MattLogi",
          "body": "Used to*, still chugging along just fine on a 12 mini and my battery health is below 80.",
          "score": 1,
          "created_utc": 1742824792.0,
          "replies": [
            {
              "id": "mjha9u2",
              "author": "s4lt3d",
              "body": "Why not pay to have the battery replaced. It’s not so expensive!",
              "score": 1,
              "created_utc": 1742825170.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mjgwp5x",
      "author": "EducationallyRiced",
      "body": "I mean at least their not melting! /s",
      "score": -4,
      "created_utc": 1742820359.0,
      "replies": []
    },
    {
      "id": "mjhe5n2",
      "author": "OfficialHaethus",
      "body": "My 3070 TI is able to push 4K 60-140 FPS depending on the game, it’s doing just fine.",
      "score": -2,
      "created_utc": 1742826424.0,
      "replies": []
    },
    {
      "id": "mjh4ajx",
      "author": "PhabioRants",
      "body": "I don't want to sound insensitive, but their house of cards is on fire; I'm not surprised they're devoting all their attention to the products that Mad Money is talking about. ",
      "score": -3,
      "created_utc": 1742823194.0,
      "replies": []
    }
  ]
}