{
  "post": {
    "title": "UserBenchmark faces backlash over Ryzen 7 9800X3D review, suggests 13600K and 14600K instead | \"Spending more on a gaming CPU is often pointless\"",
    "author": "a_Ninja_b0y",
    "id": "1govhyh",
    "score": 889,
    "created_utc": 1731340671.0,
    "selftext": "",
    "num_comments": 197,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1govhyh/userbenchmark_faces_backlash_over_ryzen_7_9800x3d/"
  },
  "comments": [
    {
      "id": "lwlolsi",
      "author": "Blunt552",
      "body": "When does Userclownmark not get backlash? They are a literal meme.",
      "score": 310,
      "created_utc": 1731343024.0,
      "replies": [
        {
          "id": "lwpqyj5",
          "author": "None",
          "body": "[deleted]",
          "score": 25,
          "created_utc": 1731395344.0,
          "replies": [
            {
              "id": "lwpxuw2",
              "author": "yepgeddon",
              "body": "Yep, really got a hate boner for AMD.",
              "score": 16,
              "created_utc": 1731399863.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwm1xsr",
          "author": "cobalt4d",
          "body": "ppl don't look at the reviews on the side i think most people just look at the benchmarks",
          "score": 71,
          "created_utc": 1731347123.0,
          "replies": [
            {
              "id": "lwmv0ch",
              "author": "danielv123",
              "body": "Even then, the review text for the 9800x3d admits it's far superior to Intel's offering, telling you to go for a low end chip instead, yet when you compare it to the 285k the Intel chip somehow shows as faster on everything but memory latency.\n\nIn my experience the numbers have been very reliable in the past and the flavour text has always been good fun, but now I am not so sure anymore. How did they get those results....",
              "score": 32,
              "created_utc": 1731355964.0,
              "replies": [
                {
                  "id": "lwnacax",
                  "author": "StaysAwakeAllWeek",
                  "body": "Their benchmarks are the most contrived bs you could possibly imagine. They used to use a bunch of outdated esports type titles with no intensive games included at all but now afaik it's all synthetics that are carefully designed to run best on Intel chips. All the info on the site is increasingly outdated because they know they can't update it without making AMD look better",
                  "score": 41,
                  "created_utc": 1731360643.0,
                  "replies": [
                    {
                      "id": "lwo8viz",
                      "author": "None",
                      "body": "Does Intel pay Userbenchmark for their \"promotion\"? Or they are just fanboys?",
                      "score": 5,
                      "created_utc": 1731372182.0,
                      "replies": [
                        {
                          "id": "lwo8znc",
                          "author": "StaysAwakeAllWeek",
                          "body": "They are anti-AMD not pro-Intel. They bash AMD GPUs too",
                          "score": 29,
                          "created_utc": 1731372222.0,
                          "replies": []
                        },
                        {
                          "id": "lwpoyi1",
                          "author": "Nah_Id__Win",
                          "body": "They are banned from the r/intel sub…",
                          "score": 14,
                          "created_utc": 1731394125.0,
                          "replies": []
                        },
                        {
                          "id": "lwxjomw",
                          "author": "lo0u",
                          "body": "No. They are fanboys for free and not even r/Intel wants them there.\n\nYou can't get much lower than that.",
                          "score": 1,
                          "created_utc": 1731512746.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwnr4ea",
              "author": "None",
              "body": "I never do.  It's all about the BMks.",
              "score": 0,
              "created_utc": 1731365979.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwlhrwl",
      "author": "karatekid430",
      "body": "I am shook. Hasn’t it always been an Intel shill?",
      "score": 449,
      "created_utc": 1731340884.0,
      "replies": [
        {
          "id": "lwljndr",
          "author": "mcoombes314",
          "body": "Not always, i.e. before Zen when Intel were comfortably ahead at everything they'd recommend AMD as a budget option. But pretty much as soon as AMD started trading blows with Intel (Ryzen 2000/3000ish), UB became what it is now.",
          "score": 205,
          "created_utc": 1731341474.0,
          "replies": [
            {
              "id": "lwmu4ru",
              "author": "Impossible_Angle752",
              "body": "Before Intel rolled out DDR4 support, that was the correct opinion.",
              "score": 10,
              "created_utc": 1731355695.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwljni0",
          "author": "burnSMACKER",
          "body": "Yes, it's a dangerous website.\n\nThese articles are just easy things to pump out every new amd chip because it's the same story every time",
          "score": 117,
          "created_utc": 1731341475.0,
          "replies": [
            {
              "id": "lwlqpgq",
              "author": "101m4n",
              "body": "It's also oddly anonymous, nobody knows who actually runs it",
              "score": 58,
              "created_utc": 1731343669.0,
              "replies": [
                {
                  "id": "lwltsvd",
                  "author": "dargonmike1",
                  "body": "It’s run by the “users” obviously? It’s right in the name!!",
                  "score": 35,
                  "created_utc": 1731344622.0,
                  "replies": [
                    {
                      "id": "lwm0cyc",
                      "author": "Igot1forya",
                      "body": "It would be funny if the person's real name was User",
                      "score": 14,
                      "created_utc": 1731346638.0,
                      "replies": [
                        {
                          "id": "lwm4skj",
                          "author": "QuickQuirk",
                          "body": "Dad's name is 'Elon'",
                          "score": 3,
                          "created_utc": 1731347981.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lwmj7of",
                  "author": "-Badger3-",
                  "body": "It's that guy who put all his grandma's money into INTC",
                  "score": 3,
                  "created_utc": 1731352366.0,
                  "replies": [
                    {
                      "id": "lwmtmsx",
                      "author": "101m4n",
                      "body": "F",
                      "score": 3,
                      "created_utc": 1731355544.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lwls654",
                  "author": "burnSMACKER",
                  "body": "The person is surely self aware and knows what they're doing. Anonymity is necessary when dealing with computer fanboys lol",
                  "score": 3,
                  "created_utc": 1731344116.0,
                  "replies": [
                    {
                      "id": "lwm0m4p",
                      "author": "101m4n",
                      "body": "I disagree. The people in this space who are worthy of respect, jz2c, gamers nexus, ian cutress etc all hold their opinions publicly.\n\n\"CPUpro\" whoever they are, knows they're peddling batshit conspiracy theories and tweaking the numbers in a way that misleads people. It's why they don't put their name to anything they say.",
                      "score": 36,
                      "created_utc": 1731346717.0,
                      "replies": [
                        {
                          "id": "lwm2qb0",
                          "author": "burnSMACKER",
                          "body": "Yes I specifically mean anonymity for outlets who are intentionally misleading consumers. Anonymity is paramount for them because they're complete liars and they themselves know it. I just fail to see where the money is for those people.",
                          "score": 15,
                          "created_utc": 1731347364.0,
                          "replies": [
                            {
                              "id": "lwmunyw",
                              "author": "101m4n",
                              "body": "Ah, I see what you mean. Thought you were saying tech reviewers needed anonymity to protect them from fanboys!",
                              "score": 3,
                              "created_utc": 1731355860.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lxhmwnx",
                          "author": "shroudedwolf51",
                          "body": "I'll mostly agree with that other than one. Jayz2Cents does not deserve the badge of credibility. Sure, on average they skew sensible...but they tend to regularly dip into takes and editorializing that is so utterly wild that it makes LTT sound reasonable.",
                          "score": 1,
                          "created_utc": 1731790276.0,
                          "replies": [
                            {
                              "id": "lxhweml",
                              "author": "101m4n",
                              "body": "He has taken good stances on anti-consumer nonsense in the past so I'm alright with him on the whole",
                              "score": 2,
                              "created_utc": 1731793387.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwlr4kk",
          "author": "pukem0n",
          "body": "Imagine fanboying about fucking CPUs lmao",
          "score": 42,
          "created_utc": 1731343799.0,
          "replies": [
            {
              "id": "lwm4kpj",
              "author": "NeuroXc",
              "body": "You don't fuck CPUs? It's the perfect fetish for my 15nm penis.",
              "score": 10,
              "created_utc": 1731347915.0,
              "replies": []
            },
            {
              "id": "lwm8qzm",
              "author": "JefferzTheGreat",
              "body": "You should have seen the freakout over a box in the background of a GamersNexus video.",
              "score": 5,
              "created_utc": 1731349187.0,
              "replies": []
            },
            {
              "id": "lwm097d",
              "author": "ilyich_commies",
              "body": "It would be kinda embarrassing if they weren’t taking bribes",
              "score": 14,
              "created_utc": 1731346608.0,
              "replies": [
                {
                  "id": "lwmd5hs",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 16,
                  "created_utc": 1731350524.0,
                  "replies": [
                    {
                      "id": "lwn4lxi",
                      "author": "stellvia2016",
                      "body": "That probably has more to do with their \"benchmark\" litmus hasn't been relevant in 15 years. The numbers are just that at this point: numbers on a page that don't actually tell you anything about the CPUs in question other than maybe raw core counts.",
                      "score": 3,
                      "created_utc": 1731358897.0,
                      "replies": []
                    },
                    {
                      "id": "lwmf90g",
                      "author": "rustle_branch",
                      "body": "That doesnt necessarily mean much though. IF UB is intel guerilla marketing it would make sense for intel to distance themselves from it as much as possible",
                      "score": 4,
                      "created_utc": 1731351157.0,
                      "replies": [
                        {
                          "id": "lwnhevv",
                          "author": "BranTheUnboiled",
                          "body": "\nIf Intel is guerilla marketing, they would tell UB to tone it down a couple dozen notches, because it's so blatantly biased it's worthless as marketing. You can shill by juking the stats, but when every single product has insane blurbs underneath screeching about how every gaming corner of the internet is all calling you untrustworthy, but it's actually because they're the paid shills, it starts to raise eyebrows from Joe Blow.",
                          "score": 14,
                          "created_utc": 1731362820.0,
                          "replies": [
                            {
                              "id": "lwqhnrq",
                              "author": "Kiseido",
                              "body": "The problem is: that sort of brash and confident hit-pieces works quite well to swing `low infornation` viewers. They are *the* top Google results when looking up benchmarks alot of the time, so it works even better.",
                              "score": 2,
                              "created_utc": 1731412605.0,
                              "replies": [
                                {
                                  "id": "lxib4zz",
                                  "author": "shroudedwolf51",
                                  "body": "Precisely. UB isn't about fooling us. It's all about convincing newcomers that don't know much of anything about much of anything yet about having a lifelong devotion to Intel and NVidia. \n\nAnd honestly, it works. Those kinds of irrational, emotional reactions are not easily broken. Look at how many people still will refuse to buy AMD graphics cards because of driver problems from 2013. I literally had a friend ask me for graphics card recommendations with a budget of about 550 USD. This was about the same time the 6800XT dropped to about 500 USD, so I'm like this is a no brainer recommendation. I did talk about how drivers haven't been an issue for nearly a decade and how my 6800XT and Vega64 have both been rock solid. The prat told me it sounds great, the advice is appreciated, and....bought a 4060Ti 16GB before the price on those dropped. Because it wasn't AMD and it \"fit the budget\".",
                                  "score": 2,
                                  "created_utc": 1731798476.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lwmu8r8",
                          "author": "Impossible_Angle752",
                          "body": "Intel apparently doesn't advertise there any more.",
                          "score": 2,
                          "created_utc": 1731355729.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lwmufb0",
                      "author": "FallenAngelII",
                      "body": "Plausible deniability. /s",
                      "score": 1,
                      "created_utc": 1731355785.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwmik28",
              "author": "SteveThePurpleCat",
              "body": "When CPU's can cost multiple hundreds of $/£ (sometimes even thousands), and human nature being what it is, you will likely tend to back your financial decision pretty hard.\n\nYou are now invested, and the other people who chose differently, well they are clearly wrong, and dumb. Not like you, a much smarter person.",
              "score": 2,
              "created_utc": 1731352167.0,
              "replies": []
            },
            {
              "id": "lwm04hz",
              "author": "MineralShadows",
              "body": "placid subsequent direful mysterious steer offbeat gullible homeless humor complete\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 1,
              "created_utc": 1731346568.0,
              "replies": [
                {
                  "id": "lwmr10a",
                  "author": "QuickQuirk",
                  "body": "you became a CPU fan?\n\nStay cool.",
                  "score": 6,
                  "created_utc": 1731354747.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lwmh5kd",
              "author": "karatekid430",
              "body": "I mean it’s not inconceivable that Intel be funding it in some way (I am not suggesting they are). But we all know about big corps sponsoring “scientific” studies which say food additives are not giving us cancer.",
              "score": 0,
              "created_utc": 1731351738.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwlr3ps",
          "author": "_EleGiggle_",
          "body": "So what’s a better alternative that covers every consumer CPU from the last 10, 15 years?  \n(I guess the last 5 years is fine but many of us still have older CPUs, and see no reason to upgrade yet.)\n\nIt should at least compare a benchmark number, and the most important specs.\n\nEdit: I‘m not sure why I‘m getting downvotes for asking for an alternative site. So apparently this one is inaccurate but asking for an alternative, more accurate site is also bad?\n\nYou might have found your reason why UserBenchmark is so popular if you assume everybody knows about this tech drama while the website is number one on Google in the mean time.",
          "score": -10,
          "created_utc": 1731343791.0,
          "replies": [
            {
              "id": "lwn5xov",
              "author": "stellvia2016",
              "body": "Tom's Hardware and Anandtech both maintained yearly benchmarks for CPUs and GPUs. They were the \"gold standard\" afaik for written format benchmarks.\n\nOtherwise there are a number channels that offer benchmark videos on Youtube, but that would be more for the last 7-10 years instead of 10-15.\n\nUserBenchmark was \"popular\" because they shilled the SEO game as hard as they could to be put at the top of results, that's all. Their numbers were always rather dubious, even early on, because IPC was what really matters. And now even IPC is only part of the picture due to auto-overclocking and thermal thresholds.",
              "score": 12,
              "created_utc": 1731359301.0,
              "replies": [
                {
                  "id": "lwndi4y",
                  "author": "_EleGiggle_",
                  "body": "> Tom’s Hardware and Anandtech both maintained yearly benchmarks for CPUs and GPUs. They were the “gold standard” afaik for written format benchmarks.\n\nThanks! I’ve used Tom’s Hardware for a few reviews but I think that was for a TV, and a monitor. Although I used their Intel i5 2500k over clocking guide, I guess that’s been a while.\n\nDid you intentionally write “were”? So they aren’t anymore?\n\n> End of the Road: An AnandTech Farewell\n\nOh, I see. That’s from August this year.\n\nDid Tom’s Hardware change as well? At least there’s no article about them quitting.",
                  "score": 2,
                  "created_utc": 1731361609.0,
                  "replies": [
                    {
                      "id": "lwni2lv",
                      "author": "stellvia2016",
                      "body": "All of the major tech websites have declined. Slashdot used to be a major nerd/tech news site, for example, but it's barely hanging on at this point. Tom's Hardware is still around, but it's also not what it once was. I haven't checked in several years if their benchmarks are still there or still relevant.\n\nOthers in this thread mentioned Gamer's Nexus puts all the charts from their videos onto their website, so that's probably a good place to check. And Linus Tech Tips has been standing up their LTT Labs effort for around a year now. I think they're only mostly doing PSU testing currently, but it looks like they have some keyboards, mice, and budget GPUs as well. (CPUs says coming soon, so until then I think their charts are only in their videos)",
                      "score": 5,
                      "created_utc": 1731363031.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwmhkkj",
              "author": "karatekid430",
              "body": "I ask you why you would consider any site which provides heavily biased data be desirable to use or better than no data at all.",
              "score": 4,
              "created_utc": 1731351866.0,
              "replies": [
                {
                  "id": "lwmjodb",
                  "author": "_EleGiggle_",
                  "body": "What, I‘m just asking for an alternative site that has multiple CPUs listed, and can compare them.\n\nSo for example the latest LTT video where they benchmark a single CPU wouldn‘t count. But if someone were to aggregate that data for comparison that would be helpful. Their lab site already does this but not for CPUs, although for graphic cards, power supplys and more.\n\nAre you saying there is no such alternative?\n\nEdit: Is it an unwritten rule of /r/gadgets to hate UserBenchmark without providing an alternative?",
                  "score": 6,
                  "created_utc": 1731352506.0,
                  "replies": [
                    {
                      "id": "lwmo1ry",
                      "author": "TooStrangeForWeird",
                      "body": "https://www.cpubenchmark.net/ works well. Plain and simple data. It's what I normally use.",
                      "score": 9,
                      "created_utc": 1731353840.0,
                      "replies": [
                        {
                          "id": "lwmtraf",
                          "author": "_EleGiggle_",
                          "body": "Thanks!\n\nFinally, someone who just provides a legit alternative. So this site basically does a „PassMark“ benchmark with every CPU, and uploads the result?",
                          "score": 0,
                          "created_utc": 1731355582.0,
                          "replies": [
                            {
                              "id": "lwnpbu6",
                              "author": "TooStrangeForWeird",
                              "body": "Yup. If you want something a little more comprehensive you can use CPU monkey. Scroll down quite a bit and there's quite a few benchmarks to compare: https://www.cpu-monkey.com/en/compare_cpu-intel_core_i7_8700-vs-intel_core_i7_9700\n\nProblem is that they're often missing benchmarks for some processors. These are popular (and old) enough that they're filled in pretty well, but newer processors and low/midrange processors sometimes don't get filled in. So I still end up using CPU benchmark for quick comparisons.",
                              "score": 2,
                              "created_utc": 1731365382.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lwn19o8",
                      "author": "karatekid430",
                      "body": "I don't have to prove that they exist or provide evidence of a given better alternative. The argument I make is that biased or tainted data is not better than having nothing all. I do not make any claim to whether an alternative exists or not.",
                      "score": -3,
                      "created_utc": 1731357883.0,
                      "replies": [
                        {
                          "id": "lwn47ac",
                          "author": "_EleGiggle_",
                          "body": "> I don’t have to prove that they exist or provide evidence of a given better alternative.\n\nSo why did you respond to my question with an unrelated argument while you don’t intend to\nanswer my question?\n\n> The argument I make is that biased or tainted data is not better than having nothing all.\n\nWho claimed that? It’s like you’re making up arguments in your head.\n\n> I do not make any claim to whether an alternative exists or not.\n\nAgain, why respond to a question that you don’t intent to answer?\n\nIt’s the first time I heard about the UserBenchmark website not being trustworthy. I’ve seen it before of course given it’s number one on Google lots of the time.",
                          "score": 2,
                          "created_utc": 1731358772.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwmvcv5",
              "author": "Impossible_Angle752",
              "body": "Honestly just look up the CPU on YouTube and watch a launch review  for whatever CPU from a channel with 1 million subscribers +/-. Preferably more. \n\nEven if you're just looking at a launch review for an older CPU, you'll get a decent representation of where it stood at that point.",
              "score": 1,
              "created_utc": 1731356070.0,
              "replies": [
                {
                  "id": "lwmvzf5",
                  "author": "_EleGiggle_",
                  "body": "I’m usually not looking up any CPU model but searching for a replacement for my existing one.\n\nI want the best CPU for the money I spend, and don’t care much about Intel or AMD. So if a site includes the current availabilities*, and uses up-to-date prices, it’s even better. Especially if it considers the benchmark points per €, so I’m getting the most value for my money.\n\nIt should also fit my GPU, so I’m not accidentally buying a combo where either one does barely any work.\n\nIf I search my current CPU model and “replacement”, I’m getting nothing recent because it’s too old.\n\n*what good are GPU benchmarks if 90% were sold out",
                  "score": 2,
                  "created_utc": 1731356262.0,
                  "replies": [
                    {
                      "id": "lwngck4",
                      "author": "stellvia2016",
                      "body": "Most of the YouTube reviews include things like that. They show where they stand vs the current gen and usually 1-2 gens before that. Original MSRP vs current prices, etc. Gamers Nexus even includes charts for stuff like $ per FPS, % increase in power vs perf for specific games or use-cases, etc.\n\nhttps://www.youtube.com/watch?v=s-lFgbzU3LY\n\nPlenty of other channels like Jayz Twocents, Linus Techtips, etc.",
                      "score": 2,
                      "created_utc": 1731362485.0,
                      "replies": [
                        {
                          "id": "lwnivym",
                          "author": "_EleGiggle_",
                          "body": "If only I were just 1 or 2 gens behind. They probably don’t produce the “new” model anymore when I’m looking for a new CPU.\n\nEdit: I think I remember my CPU. It’s a Ryzen 5 2600 from about 2018.\n\nEdit 2: As suspected, the people asking for a replacement asked in 2022 on sites like Reddit. Replacing this CPU usually comes with a motherboard and RAM DDR4 to DDR5, etc.",
                          "score": 1,
                          "created_utc": 1731363290.0,
                          "replies": [
                            {
                              "id": "lwnk4dc",
                              "author": "stellvia2016",
                              "body": "Does it really matter at that point then? Even AMD only supports a socket for 4-5 years, so at best you could buy a system when the socket was new, then buy the last gen of CPU for that socket even if the upgrade happened 6-7 years later.\n\nIf you only buy new parts at the point you're always building an entirely new system, simply look for whatever has the best bang for the buck for your use-case. If you're still on AM4, the 5800X3D is still quite a good gaming CPU. If you're on Intel, then likely you need a full upgrade regardless, because they only tend to support 2-3 years at a time.",
                              "score": 3,
                              "created_utc": 1731363685.0,
                              "replies": [
                                {
                                  "id": "lwnkxns",
                                  "author": "_EleGiggle_",
                                  "body": "Kinda?\n\nI’m on a Ryzen 5 2600 with 32 GB DDR4 RAM and an RTX 3060.\n\nThat was enough for Elden Ring before I finally got a PS5.\n\nDo I want to stay on AM4, or upgrade to AM5 or Intel?\n\nIs my power supply strong enough, or should I replace it just to make sure?\n\nI have a RTX 3060 as well so I could keep that.\n\nOr another option: Do I wait with upgrades, and keep gaming on my PS5 instead? How does the PS5 compare to a computer? What GPU is equivalent?\n\nThat’s why I want to compare my existing CPU like once a year if there was maybe a huge jump in performance that I can get for cheap but it seems like those days are over.\n\nMy first OS was Windows 98, so I’ve been doing this for a while.\n\nCurrently I’m mainly on my MacBook Air M3, and took a liking to the enormous battery life from an ARM processor. So do I want to upgrade my Windows PC at all?\n\nEdit: Told you, it’s no easy question.",
                                  "score": 1,
                                  "created_utc": 1731363946.0,
                                  "replies": [
                                    {
                                      "id": "lwnnjol",
                                      "author": "stellvia2016",
                                      "body": "Really depends on what your budget is. Assuming your board supports it (you probably have to update the BIOS is all) the 5800X3D would probably be double the performance in games compared to your current CPU as per the GN video (Which does list the Ryzen5 2600 at the very bottom of the chart)\n\nhttps://youtu.be/s-lFgbzU3LY?t=1869\n\nThat would only cost you around $200ish USD (Don't know what country you're in, so it might be more)\n\nOtherwise, assuming you kept the same case, PSU, and storage etc. A mobo/ram/cpu/cpu cooler would be around $800-900. For you to jump to the 7800X3D or 9800X3D. For PSU you'd probably want at least a 650W.\n\nSocket AM5 that the 7800X3D and 9800X3D are on they say will be supported through at least 2027.\n\nIf you're relatively content with the PS5, I'd probably simply drop in the 5800X3D into your current system and call it a day. If you're using the stock cooler with the 2600, I would buy a new one for the 5800. Something like the Peerless Assassin 140mm are very solid cheap air coolers that should do a decent job.",
                                      "score": 2,
                                      "created_utc": 1731364796.0,
                                      "replies": [
                                        {
                                          "id": "lwnu8qw",
                                          "author": "_EleGiggle_",
                                          "body": "Unfortunately they aren’t selling the AMD 5800X3D anymore in Austria (or Germany), so am I supposed to get that one used?\n\nAmazon, and sites that crawl all electronics sellers didn’t  find a single listing in Austria or Germany.\n\nThat’s the correct listing, am I right? https://www.amazon.de/AMD-Ryzen-5800X3D-Prozessor-Basistakt/dp/B09VCJ2SHD\n\nIt just says “Derzeit nicht verfügbar.” which means currently not available, not even from third party sellers.\n\nI’m also not sure if this CPU needs more power than my current one. I probably forgot to mention that I got a pretty good OC so I’m probably not getting that much from the CPU.\n\nThat’s why I already have beefier cooler though. A GAMMAXX 400, probably the first version because I just found a V2, and it looks older.\n\nI definitely appreciate your effort though.\n\nHow much performance should I get from the new CPU on average?\n\nBecause IIRC I overclocked my current one from 3.4 GHz to a stable 4 GHz on all cores. So I’m a bit afraid of spending money to get a CPU that’s basically the same speed.\n\nEdit: Technically, I found a listing for > 500 €, and they’ll ship a new CPU sometime between 25. December 2024 and 28. January 2025. Seems like a scalper to me.",
                                          "score": 1,
                                          "created_utc": 1731367045.0,
                                          "replies": [
                                            {
                                              "id": "lwnwsve",
                                              "author": "stellvia2016",
                                              "body": "That must be why the GN charts most recently only showed the 5700X3D (which is also on that chart). So you could get that or a used one if you can't find a new one from Schengen sellers. Clock speed doesn't tell you much about CPU performance these days, which is why userbenchmarks site is so bad. Instructions Per Second per core are what matters. Also most games still only use 1-2 cores so 8 cores vs 12-16 doesn't matter for games.\n\neg: 14900K turbos to 6.2ghz but gets beat by the 7800X3D that only goes to 5.4ghz.",
                                              "score": 2,
                                              "created_utc": 1731367932.0,
                                              "replies": [
                                                {
                                                  "id": "lwom85o",
                                                  "author": "_EleGiggle_",
                                                  "body": "Edit: I misread what you wrote. We were talking about the same card after all. 😅\nThe CPU with the lower number (5700X3D) is from 2024 although the higher one (5800X3D) is from 2022 but better.\n\nI’m not a fan of this CPU naming scheme but it’s crazy I can still use a socket from a board bought in 2019 for a CPU from 2024.\n\nEdit 2: Just to be sure, is the Asrock Fatal1ty B450 Gaming K4 making everything out of that CPU? It’s in the CPU support list but does it use the X 3D V-Cache as supposed?\n\nI could get AMD Ryzen 7 5700X3D instead for about 200 €.\n\nIts has CPU Mark score of 26355 instead of the 28302 from the 5800X3D.\n\nMeanwhile my AMD Ryzen 5 2600 is still at 13189.\n\nWould that upgrade be worth it? There are some older Ryzen 9 processors with a much higher score for the same price but they don‘t have the X3D so they aren‘t that good for gaming according to the website. I don‘t see how much that matters though, the game benchmarks all used a 5800X3D to achieve more FPS.\n\nShould I rather not upgrade, and wait until the 5800X3D is in stock again? Or maybe buy basically a new PC where everything is upgraded except the SSDs.",
                                                  "score": 1,
                                                  "created_utc": 1731376914.0,
                                                  "replies": [
                                                    {
                                                      "id": "lwpiwet",
                                                      "author": "stellvia2016",
                                                      "body": "The reason for the peculiarity of the 5700X3D coming out in 2024 when the 5800X3D is from 2022 is: AMD is using up the remainder of their wafers they purchased for that fabrication size of production. They previously released a small amount of 5600X3D as well which were actually rejected 5800X3D where some of the cores were defective. So they merely deactivated them and sold the 5600 as a 6 core instead of 8 core CPU.\n\nI would update the bios just to make sure, but it shouldn't have issues with the new one.\n\nhttps://www.reddit.com/r/buildapc/comments/13e8y91/big_bios_leap_ryzen_2600x_to_5800x3d_on_b450/\n\nAs far as if it's worth it: Everything else being equal, it appears to be broadly a doubling of FPS for most games looking through the various benchmarks in that GN video. (Assuming we're talking 1080p gaming)\n\nIf it's not something you use all the time and you don't try to push brand new AAA games at Ultra on like 1440p or something, I could see it buying you another 3 years np.\n\nThe alternative is a complete system rebuild of mobo/ram/cpu and possibly psu, which will cost you 4-5x as much and be around 20% more fps than the 5800X3D. Supposedly the 9800X3D is unlocked to allow overclocking as well, but I'm not going to count that bc most people won't resort to that.",
                                                      "score": 2,
                                                      "created_utc": 1731390644.0,
                                                      "replies": [
                                                        {
                                                          "id": "lwpnb26",
                                                          "author": "_EleGiggle_",
                                                          "body": "Thanks for the explanation!\n\nI just ordered the 5700X3D from Amazon, and some Noctua NT-H2 thermal paste.",
                                                          "score": 2,
                                                          "created_utc": 1731393145.0,
                                                          "replies": [
                                                            {
                                                              "id": "lxc7x01",
                                                              "author": "stellvia2016",
                                                              "body": "Sure thing!\n\nLet me know how much FPS uplift it is when you get it installed. My friend was poopooing not moving to AM5, but it's hard to justify that much extra money for only 20-25% more uplift.",
                                                              "score": 2,
                                                              "created_utc": 1731708827.0,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwntnb1",
              "author": "None",
              "body": "[removed]",
              "score": -3,
              "created_utc": 1731366839.0,
              "replies": [
                {
                  "id": "lwnwio0",
                  "author": "_EleGiggle_",
                  "body": "Sorry, I didn’t know that this is a default subreddit only for elitists.",
                  "score": 2,
                  "created_utc": 1731367833.0,
                  "replies": [
                    {
                      "id": "lwo0xtt",
                      "author": "Blue-Thunder",
                      "body": "No, it's just this site has been a joke for so long that finding someone who doesn't know this, is mindboggling. It's been a joke for so long that it's common sense that anything userwenchmark states is an outright lie. The fact you do not know this violates that common sense and just can't compute. People have known the site has been nothing but lies for almost a decade at this point.\n\nIt's like running into someone who thinks drinking colloidal silver will cure you, or to put it into more modern terms, ivermectin for Covid.",
                      "score": -1,
                      "created_utc": 1731369396.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lwlhs2e",
      "author": "Cornflakes_91",
      "body": "average userbenchmark moment",
      "score": 95,
      "created_utc": 1731340886.0,
      "replies": []
    },
    {
      "id": "lwlhzv5",
      "author": "heickelrrx",
      "body": "honestly Techspot should have not write this article\n\nUserbenchmark is troll and everyone knew it and we keep giving the site engagement they wanted\n\nif we gonna kill Userbenchmark we should make it obscured so it fade away, not giving it spotlight",
      "score": 175,
      "created_utc": 1731340954.0,
      "replies": [
        {
          "id": "lwlku15",
          "author": "fixminer",
          "body": "We are in an enthusiast bubble. We know to avoid UB, but if you google \"processor x vs processor y\", UB is always one of the top results. It is probably one of the main sources of information for casual buyers. Articles like this may help to warn more people that UB can't be trusted.",
          "score": 135,
          "created_utc": 1731341846.0,
          "replies": [
            {
              "id": "lwlosd0",
              "author": "JMacPhoneTime",
              "body": "Lol I was comparing CPUs awhile ago and wound up there as the first result.  It said the AMD CPU I was looking at was ~50% better than my Intel CPU.  Then I got to the bottom and read the blurbs.\n\nIt actually helped confirm my decision to upgrade to the AMD.  It seemed so obviously biased, and still said the AMD was much better, so I figured it must be a good upgrade.",
              "score": 36,
              "created_utc": 1731343079.0,
              "replies": [
                {
                  "id": "lwlp9cd",
                  "author": "fixminer",
                  "body": "They did change their benchmarks in the past to favor Intel, but you can only fudge the data so much.",
                  "score": 13,
                  "created_utc": 1731343224.0,
                  "replies": [
                    {
                      "id": "lwnbfrt",
                      "author": "StaysAwakeAllWeek",
                      "body": ">but you can only fudge the data so much\n\nTheir current favorite fudge is to talk about memory latency and how much it matters in games and how much better it is on Intel cpus. And all of that is true, but it doesn't change the fact that everything else is better on AMD, and the 3d cache literally exists to make it irrelevant.\n\nThere really is no limit to their fudging. They are pointing to a number that has been made irrelevant years ago as the sole contributor to gaming performance",
                      "score": 7,
                      "created_utc": 1731360980.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwmr94c",
              "author": "QuickQuirk",
              "body": "yeap. It's always frustrating, because the information is quite often inaccurate. and it's one of the top hits, along with some other junk sites.",
              "score": 1,
              "created_utc": 1731354816.0,
              "replies": [
                {
                  "id": "lxj6yht",
                  "author": "shroudedwolf51",
                  "body": "I'm not sure I've ever seen UB not be first search result as well as several subsequent ones. Even when I search for a specific website, if I search by name rather than use site:, then UB is right there.",
                  "score": 1,
                  "created_utc": 1731810476.0,
                  "replies": [
                    {
                      "id": "lxniq1w",
                      "author": "QuickQuirk",
                      "body": "Google no longer tells us if the top couple hits are sponsored or not - which to me implies that the entire first page of hits is mostly content people have paid to put there. UB is likely just throwing money at google to make sure of it.\n\nIt's why google has steadily gotten worse over the past couple years.",
                      "score": 1,
                      "created_utc": 1731878189.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwm6sz9",
              "author": "heickelrrx",
              "body": "That is because the tech site always mentioning it\n\nThe internet is changing, if people keep make UB relevant, the SOA Algorithm will keep make it relevant",
              "score": 1,
              "created_utc": 1731348593.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwliyji",
          "author": "zoobrix",
          "body": "You might know that but a lot of people just click on the first performance data site they see and unfortunately that's often userbenchmark. Articles like this that spread the word they're to be avoided are good because they reach more people so they know that the site is BS as well. Some people do make purchasing decisions based on few, if any, sources and warning them about userbenchmark is a good thing.",
          "score": 38,
          "created_utc": 1731341258.0,
          "replies": [
            {
              "id": "lwlme06",
              "author": "Cuteitch",
              "body": "What other sites should someone use when looking for quick comparisons between components?",
              "score": 7,
              "created_utc": 1731342334.0,
              "replies": [
                {
                  "id": "lwlygii",
                  "author": "NorysStorys",
                  "body": "Gamersnexus\n\n  \nEdit: specifically this page [https://gamersnexus.net/megacharts/cpus](https://gamersnexus.net/megacharts/cpus)",
                  "score": 9,
                  "created_utc": 1731346056.0,
                  "replies": [
                    {
                      "id": "lwm19qp",
                      "author": "Cuteitch",
                      "body": "Awesome. I wasn't to far off the mark when suggesting specific CPU's based off their recommendations so that's good to know. Ill use them more in the future going forward.",
                      "score": 1,
                      "created_utc": 1731346917.0,
                      "replies": []
                    },
                    {
                      "id": "lwmrq51",
                      "author": "QuickQuirk",
                      "body": "I had no idea this existed. It's never pimped by google in search results, since google doesn't get any advertising revenue from the site.\n\nThis is exactly what I've been looking for for a while. And I've been a long time viewer of their channel too.",
                      "score": 1,
                      "created_utc": 1731354961.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lwm4bx2",
                  "author": "aw3sum",
                  "body": "cpubenchmark is a more complicated site that has single and multicore scores for a buncha cpus",
                  "score": 2,
                  "created_utc": 1731347843.0,
                  "replies": []
                },
                {
                  "id": "lwlr8ox",
                  "author": "_EleGiggle_",
                  "body": "This!\n\n> So what’s a better alternative that covers every consumer CPU from the last 10, 15 years?\n>\n> It should at least compare a benchmark number, and the most important specs.",
                  "score": -4,
                  "created_utc": 1731343834.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lwloww2",
              "author": "hbkdll",
              "body": "I agree. Iam someone who just recently got interested in comparing benchmarks and sucked various sites and I may have visited ub multiple times. But also came to find they are shill and more about them",
              "score": 1,
              "created_utc": 1731343118.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwlltfz",
          "author": "Arlcas",
          "body": "Userbenchmark is one of the first results when searching comparisons on google no amount of random news site engagement is comparable to that.",
          "score": 13,
          "created_utc": 1731342157.0,
          "replies": []
        },
        {
          "id": "lwlrqq8",
          "author": "101m4n",
          "body": "If someone wants to kill user benchmark, all they need to do is make a better site",
          "score": 4,
          "created_utc": 1731343986.0,
          "replies": []
        },
        {
          "id": "lwln61r",
          "author": "LeCrushinator",
          "body": "I wouldn’t have known about it if it weren’t for this article. Not that I use it anyway, but articles like this can help spread the word.",
          "score": 3,
          "created_utc": 1731342575.0,
          "replies": []
        },
        {
          "id": "lwo9p68",
          "author": "None",
          "body": "[deleted]",
          "score": 0,
          "created_utc": 1731372472.0,
          "replies": [
            {
              "id": "lwoqsff",
              "author": "heickelrrx",
              "body": "have you ever heard\n\nSOA?",
              "score": 1,
              "created_utc": 1731378560.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwlnyje",
          "author": "NgonEerie",
          "body": "Correct. Sadly, people have a hard time understanding this.",
          "score": -4,
          "created_utc": 1731342822.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwm32qt",
      "author": "SaiyanRajat",
      "body": "Do people still use that nonsense website?",
      "score": 21,
      "created_utc": 1731347468.0,
      "replies": [
        {
          "id": "lwmiy93",
          "author": "SteveThePurpleCat",
          "body": "It's hard to avoid, pretty much the defacto google result for any CPU comparison search.",
          "score": 27,
          "created_utc": 1731352286.0,
          "replies": [
            {
              "id": "lwo8b3i",
              "author": "None",
              "body": "[deleted]",
              "score": 2,
              "created_utc": 1731371982.0,
              "replies": [
                {
                  "id": "lwqe49m",
                  "author": "CharlLeglerg",
                  "body": "geekbench and passmark they are free for non commercial use",
                  "score": 3,
                  "created_utc": 1731410675.0,
                  "replies": []
                },
                {
                  "id": "lwr1rjp",
                  "author": "ffpeanut15",
                  "body": "In addition to above comment, Notebookcheck is pretty reliable. They aggregate benchmark number from a variety of software",
                  "score": 2,
                  "created_utc": 1731421123.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lwmbr4u",
      "author": "Bwadark",
      "body": "I've used this site in the past. Can anyone suggest website alternatives?",
      "score": 18,
      "created_utc": 1731350099.0,
      "replies": [
        {
          "id": "lwojogy",
          "author": "theageofspades",
          "body": "Unless something has changed, [Passmark](https://www.cpubenchmark.net/singleCompare.php) is the gold standard (for similar to UB sites)",
          "score": 16,
          "created_utc": 1731376008.0,
          "replies": []
        },
        {
          "id": "lwp71or",
          "author": "Jubenheim",
          "body": "In addition to the guy’s comment below, I always checked out YouTube with GamersNexus. They’ve never steered me wrong and give great analyses and comparisons.",
          "score": 7,
          "created_utc": 1731384888.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwo1i9a",
      "author": "DriftMantis",
      "body": "Its weird because this article is obvious bias. However, the point about cpus for gaming is not terrible. It may make sense to get a lower end or last gen cpu if that raises the gpu budget. Reason being is that your more likely to be gpu locked than cpu locked. Your cpu can not boost your frame-rate if its waiting on the gpu. I think a fairly balanced build is a good idea. \n\nThe obvious exception to this would be you game at a low resolution or really need to max out refresh rate to some ridiculous level for competitive gaming.",
      "score": 8,
      "created_utc": 1731369593.0,
      "replies": [
        {
          "id": "lwybbnz",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1731521191.0,
          "replies": [
            {
              "id": "lwza5i4",
              "author": "DriftMantis",
              "body": "Yeah true, the article has issues with the specifics they are recommending and seems like a bias towards Intel.",
              "score": 1,
              "created_utc": 1731531765.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwyvsfi",
          "author": "cvelde",
          "body": "The other obvious exception I find very much worth mentioning is simply games that are cpu bound.  \n\n\n Be it Simulators like Kerbal space Program, strategy and 4x games like Stellaris or Total War, colony builders like Rimworld or Dwarf fortress or even just simply Minecraft.   \n\n\n A surprising amount of games is cpu limited and specifically often limited by a single thread doing the most important stuff. \nThe FPS here is mostly secondary,  instead we care about turn and simulation speeds.\n\n\nMeasuring FPS in say Stellaris is practically worthless, instead a measurement of how long a CPU takes to simulate a year of gametime is a more useful metric. (Thankfully a few outlets do this recently but there is much room for improvement) ",
          "score": 1,
          "created_utc": 1731527365.0,
          "replies": [
            {
              "id": "lwz9xgv",
              "author": "DriftMantis",
              "body": "Those are great points you've made! There are also real time games like Microsoft flight Sim that are very cpu bound as well that benefit from more expensive cpus even at 4k resolution. \n\nIt's worth noting also that gpus that support frame generation can boost performance in cpu bound games that support that technique. However, of course, they are not real rendered frames, so you are not getting the reduced input latency that you would get from just boosting performance using faster cpu hardware unfortunately.",
              "score": 2,
              "created_utc": 1731531697.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwlk546",
      "author": "uniq_username",
      "body": " /shocked Pikachu",
      "score": 6,
      "created_utc": 1731341629.0,
      "replies": []
    },
    {
      "id": "lwmkafm",
      "author": "Jamizon1",
      "body": "Userskidmark",
      "score": 5,
      "created_utc": 1731352692.0,
      "replies": []
    },
    {
      "id": "lwlk6du",
      "author": "XDenzelMoshingtonX",
      "body": "I absolutely love this UserBenchmark saga from an entertainment pov.",
      "score": 17,
      "created_utc": 1731341639.0,
      "replies": []
    },
    {
      "id": "lwln4uw",
      "author": "phoenixmatrix",
      "body": "Haven't the benchmark for MH Wild shown it's actually very very much worthwhile? (and that's a game a lot of PC gamers will care about).\n\nMy partner has the exact same PC spec as me, except for a 7800x3d (I have a 13700k) and the difference was non-trivial. So 9800x3d vs 13600k sounds like a bad move.\n\nI've been an intel shill ever since I stopped using my Athlon to heat up my bedroom back in the days, and I just can't anymore.",
      "score": 17,
      "created_utc": 1731342565.0,
      "replies": [
        {
          "id": "lwlniwe",
          "author": "XDenzelMoshingtonX",
          "body": "UB is a known Intel shill blaming good benchmark results by independent sources on AMD paying them lol",
          "score": 30,
          "created_utc": 1731342686.0,
          "replies": []
        },
        {
          "id": "lwlny5r",
          "author": "JoeyBigtimes",
          "body": "Yeah, if Intel keeps giving me the runaround with my 13900K RMA I'm gonna become an AMD shill. At least until Nvidia starts making CPUs.",
          "score": 3,
          "created_utc": 1731342818.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwntsyc",
      "author": "Blue-Thunder",
      "body": "I'm still surprised AMD hasn't sued them out of existence for their lies.",
      "score": 4,
      "created_utc": 1731366893.0,
      "replies": []
    },
    {
      "id": "lwryh4j",
      "author": "Type_Impossible",
      "body": "well your first mistake was trusting something that UB says",
      "score": 3,
      "created_utc": 1731431772.0,
      "replies": []
    },
    {
      "id": "lwll6ng",
      "author": "Winterspawn1",
      "body": "I have very reliable benchmarks that tell me otherwise, I see no reason to believe this.",
      "score": 6,
      "created_utc": 1731341956.0,
      "replies": []
    },
    {
      "id": "lwn1s9z",
      "author": "Finlander95",
      "body": "Its not completely wrong. In many cases 7600 or 13600k are superior options if you can use that money for gpu upgrade instead. 13600k was extremely cheap and close to 7600 in price in US sometimes.",
      "score": 7,
      "created_utc": 1731358041.0,
      "replies": [
        {
          "id": "lwndaju",
          "author": "Dirty_Dragons",
          "body": "Yup, that's exactly what the actual review says.\n\n>Nevertheless, the 13600K and 14600K still deliver almost unparalleled real-world gaming performance for around $200 USD. Spending more on a gaming CPU is often pointless, as games are generally limited by the GPU in real-world scenarios.\n\nIf you have $1,000 to spend on a gaming PC you'll get the most bang for you buck by getting a mid high GPU.",
          "score": 8,
          "created_utc": 1731361543.0,
          "replies": [
            {
              "id": "lwpgl29",
              "author": "ga9213",
              "body": "It's such a weird choice for me.  For the x3d chips to make a quantifiable difference you need to be running 1080p.  But then if you're spending almost 500 on a CPU, you're definitely buying a good graphics card and if you're doing that why are you gaming at 1080 and not taking advantage of the massive fidelity boost with 2k or 4k and high refresh rate monitors?  I went with a 7700x for my 4090 after trying both it and a 7800x3d and at 4k there is no difference.  Actually I think RDR2 was worse on the 7800x3d.",
              "score": 4,
              "created_utc": 1731389406.0,
              "replies": [
                {
                  "id": "lwrwog3",
                  "author": "Ruty_The_Chicken",
                  "body": "the 9800x3d is clearly much better at 4k than the 7700x, the difference only grows with more recent games, and the more demanding they are, the bigger the difference. Besides, a lot of these people will be getting the 5090 or whatever it's called which will only make a bigger difference",
                  "score": 1,
                  "created_utc": 1731431216.0,
                  "replies": [
                    {
                      "id": "lwrwzr3",
                      "author": "ga9213",
                      "body": "Do you have a source for the game comparison at 4k between the two CPUs?",
                      "score": 1,
                      "created_utc": 1731431314.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lwv4vac",
                  "author": "NeverComments",
                  "body": ">why are you gaming at 1080 and not taking advantage of the massive fidelity boost with 2k or 4k and high refresh rate monitors\n\nHigh refresh rate is often a scenario where CPU bottlenecks become an issue, since it doesn't matter how fast your GPU can render a frame if your CPU isn't able to prepare frames quickly enough to hit the low frame time targets. If you've got a beefy GPU and only 2~3ms of each frame is render, but the CPU takes 12ms to prepare it, you're not going to be able to make the jump from 60Hz to 120Hz and beyond without upgrading the CPU that's bottlenecking the system. \n\nCPU tests are conducted at lower resolutions because it puts the system in a scenario where this is true - a high end GPU will crank through a low resolution frame in a short millisecond or two while the bulk of the work falls on the CPU and in a like-for-like comparison that allows us to see how two CPUs perform relative to one another. \n\nThat doesn't mean this *only* happens at low resolutions though, it depends entirely on the game (and scene) in question. Counter-Strike 2 is going to be a lot easier to CPU bottleneck at 4k than Alan Wake 2, because the GPU isn't particularly stressed doing 4k renders in the former.",
                  "score": 1,
                  "created_utc": 1731469799.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lwrw0nj",
              "author": "Ruty_The_Chicken",
              "body": "That is absolutely NOT what the review says, besides, who the fuck is buying a high end cpu without actually getting a high end gpu? People who buy a 9800x3d on release don't have a limited budget, they're looking for the best of the best for each part of the build.",
              "score": 0,
              "created_utc": 1731431008.0,
              "replies": [
                {
                  "id": "lx6w6nc",
                  "author": "Finlander95",
                  "body": "You would be surprised. Nowadays many people build for esports so they go like 9800x3d and 7700xt / 7800xt even. Also many prebuilts often have way beefier cpus than graphic cards.",
                  "score": 1,
                  "created_utc": 1731635670.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lwp93h4",
      "author": "areyouhungryforapple",
      "body": "It's genuinely annoying how highly they're placed in Google searches. Such a useless site",
      "score": 2,
      "created_utc": 1731385794.0,
      "replies": []
    },
    {
      "id": "lwpvda4",
      "author": "thedanyes",
      "body": "I think the userbenchmark editorial is questionable for sure. That said, I personally would give up a lot of other specs before I gave up 4k resolution, and even a midrange CPU from 2-3 generations back is nearly never the bottleneck in 4k gaming.\n\nI know there are those who really vibe on >90 FPS, but I have literally never been competitive at first-person shooters, so I can enjoy 90FPS just as well as 480 FPS.",
      "score": 2,
      "created_utc": 1731398196.0,
      "replies": []
    },
    {
      "id": "lwrja1y",
      "author": "iamtheju",
      "body": "Doesn't Intel currently have a massive issue where they were hiding the fact that the 13th and 14th gen chips were frying themselves in normal use?\n\nSeems a strange time to recommend them 🤔",
      "score": 2,
      "created_utc": 1731427043.0,
      "replies": []
    },
    {
      "id": "lwn2v3l",
      "author": "Orange152horn3",
      "body": "Tell that to the new monster hunter game.",
      "score": 1,
      "created_utc": 1731358366.0,
      "replies": []
    },
    {
      "id": "lwo70u0",
      "author": "firedrakes",
      "body": "Another karma farmer ub title",
      "score": 1,
      "created_utc": 1731371534.0,
      "replies": []
    },
    {
      "id": "lwq4ssc",
      "author": "Jack123610",
      "body": "It's been known forever that Userbenchmark is completely worthless and just shills for Intel.\n\nIn fact the owner turns into a bit of a dumb ass if you call him out on it.",
      "score": 1,
      "created_utc": 1731404686.0,
      "replies": []
    },
    {
      "id": "lwv7wwf",
      "author": "karrotwin",
      "body": "Wait so the evidence that \"disproves\" the idea that that buying an expensive CPU for gaming is a bad choice is a benchmark with a fucking RTX 4090, a GPU that almost no one in the real world has?\n\nLook at the steam survey of what GPUs people actually own....you'll see a bunch of shitty cards like the RTX 3060, at best you get 3060ti/3070 type cards. The 4090 is less than 1% market share.\n\nWhat do you think the difference between a 9800X3D, a 13600k, or like a fucking 5600x from 4 years ago will be if you're using a RTX 3060?",
      "score": 1,
      "created_utc": 1731471063.0,
      "replies": []
    },
    {
      "id": "lx4zrku",
      "author": "Mormon_Dude",
      "body": "Honestly at this point I’m just here for the clown show. It’s really entertaining to read these “reviews.”",
      "score": 1,
      "created_utc": 1731613787.0,
      "replies": []
    },
    {
      "id": "lwpyw7x",
      "author": "mrureaper",
      "body": "Intel shills are gonna shill. Even when given literal shit they will eat it",
      "score": 1,
      "created_utc": 1731400579.0,
      "replies": [
        {
          "id": "lwq5ia0",
          "author": "Jack123610",
          "body": "The Intel subreddit doesn't even allow userbenchmark, everyone agrees it's shit, but it's the top result if you're just googling comparisons.",
          "score": 2,
          "created_utc": 1731405174.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwlrcz2",
      "author": "101m4n",
      "body": "I hate UB as much as the next guy\n\nBut devils advocate here, he has a point with not needing a top end CPU for gaming. \n\nI'm one of the chumps who bought into trx40, so I'm still on zen2 and honestly, I've still not come across anything that doesn't run plenty well enough.\n\nP.S. To be clear here, I'm not advocating for user benchmark. I think it's a negative force in the industry and i hate that it probably misleads many less informed consumers. But the point still stands, you don't need a top end CPU for games.",
      "score": -7,
      "created_utc": 1731343870.0,
      "replies": [
        {
          "id": "lwlwsi7",
          "author": "XDenzelMoshingtonX",
          "body": "point is that the 9800X3D is the best gaming CPU, it's specifically worse at tasks actual top end CPUs like your TR or even the regular 9950X excel at. \nBut yeah if you're the standard AAA gamer who's playing at 4K then you're gonna be GPU bound anyway. Completely different story if you're into competitive shooters and running funny shit like 540Hz panels and the likes.",
          "score": 7,
          "created_utc": 1731345547.0,
          "replies": [
            {
              "id": "lwma66x",
              "author": "_dharwin",
              "body": "[Based on Steam's hardware survey](https://store.steampowered.com/hwsurvey/videocard/) I would be shocked if most people were playing at 4k with those GPUs.\n\nIn the US, a Ryzen 7 7700x is ~$270 while a 9800x3d is $480 at MSRP.\n\nThat $210 dollars is about the difference between most levels of GPUs (4060 > 4070 > 4070 ti super > 4080 super).\n\nUnless you're targeting 1080p w/ insane FPS, most people would get better performance with the 7700x and getting the next step up GPU.\n\nMoving between those tiers is roughly 30% performance improvement depending on resolution (closer to 15% from 4070 ti super to 80 super).\n\nA 7700x to 9800x3d is only 10% improvement at 1440p and 13% at 1080p when benchmarked with a 4090, removing as much of a GPU bottleneck as possible.\n\nIn other words, if the option is spending $200 more for a 9800x3d or for a higher tier GPU, in almost all cases you'll get more performance from the better GPU.\n\nWhich is the point UB is making. You're better off spending the money on the GPU rather than the CPU for most gamers.",
              "score": 6,
              "created_utc": 1731349617.0,
              "replies": [
                {
                  "id": "lwmc0gn",
                  "author": "XDenzelMoshingtonX",
                  "body": "Yes, UB is right in that regard but they‘re using it to discredit the 9800X3D, which they never did when Intel was still on top. A 9900K was just as „pointless“ for the majority of gamers.",
                  "score": 2,
                  "created_utc": 1731350177.0,
                  "replies": [
                    {
                      "id": "lwme9lq",
                      "author": "_dharwin",
                      "body": "I'm not familiar enough with their history to know.\n\nI read the actual UB review and it's definitely slanted but not for the quotes we often see repeated.\n\nSaying, \"save money on the CPU for a better GPU\" is generally good advice.\n\nTalking about Intel stock performance, AMD advertising, and recommending the 13600k and 14600k without mentioning the oxidation issues is where I think the review goes off the rails.",
                      "score": 2,
                      "created_utc": 1731350857.0,
                      "replies": [
                        {
                          "id": "lwmfqpf",
                          "author": "XDenzelMoshingtonX",
                          "body": "Yeah they exclusively use that „save money on the CPU“ phrase when AMD beats intel at the top-end of the product line. Compare it to the 13900K or 285K reviews where they instead talk about Intels technical advancements or performance uplift from the previous generation",
                          "score": 4,
                          "created_utc": 1731351308.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwlzmrm",
              "author": "101m4n",
              "body": "Aye obviously there are cases where you may want that, and I'm not disputing that it's the fastest CPU for games. It definitely is. \n\nBut when you look at CPU benchmark graphs today, you see even mid-range parts from 4 years ago are still pulling 150 frames or more. I bet in 99% of cases, getting one of those and dropping the savings on the GPU is going to net better results overall.",
              "score": 1,
              "created_utc": 1731346417.0,
              "replies": []
            },
            {
              "id": "lwmb31z",
              "author": "SlightlyOffWhiteFire",
              "body": "But the review didn't say its not the best, they said the prices don't justify the benefits. Hell i was running AAA games fine on my i5 7600k for the better part of a decade.",
              "score": 0,
              "created_utc": 1731349896.0,
              "replies": [
                {
                  "id": "lwmchrk",
                  "author": "XDenzelMoshingtonX",
                  "body": "I mean it‘s a high end CPU lol, they are never really justified for gaming. Point is that people have been buying i9s for years and UB never made these kind of remarks towards that tier of intel CPUs\n\nEDIT: just check their review on the 13900K for example, absolutely hilarious.",
                  "score": 4,
                  "created_utc": 1731350325.0,
                  "replies": [
                    {
                      "id": "lwmw9jg",
                      "author": "SlightlyOffWhiteFire",
                      "body": "Honestly I don't think you really have a point. It seems to change with each passing comment....",
                      "score": -2,
                      "created_utc": 1731356349.0,
                      "replies": [
                        {
                          "id": "lwmxx5d",
                          "author": "XDenzelMoshingtonX",
                          "body": "Whatever you‘re saying broski lol",
                          "score": 2,
                          "created_utc": 1731356860.0,
                          "replies": [
                            {
                              "id": "lwn643q",
                              "author": "SlightlyOffWhiteFire",
                              "body": "People have been making that point about i9s since they debuted. I distinctly remember having conversations about this back in the 2010s before Ryzens emerged as real competitors to iX cores. \n\nI think you are just kind of a hack.",
                              "score": -1,
                              "created_utc": 1731359355.0,
                              "replies": [
                                {
                                  "id": "lwn7csm",
                                  "author": "XDenzelMoshingtonX",
                                  "body": "Yes, so what? What are you trying to say here broski?",
                                  "score": 2,
                                  "created_utc": 1731359735.0,
                                  "replies": [
                                    {
                                      "id": "lwnllq5",
                                      "author": "SlightlyOffWhiteFire",
                                      "body": ">Point is that people have been buying i9s for years and UB never made these kind of remarks towards that tier of intel CPUs\n\nHack",
                                      "score": -1,
                                      "created_utc": 1731364163.0,
                                      "replies": [
                                        {
                                          "id": "lwpwjdq",
                                          "author": "XDenzelMoshingtonX",
                                          "body": "that's the German word for Tatar! Delicious!",
                                          "score": 2,
                                          "created_utc": 1731398971.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lxpv1hs",
                  "author": "moderngamer327",
                  "body": "It does if you are either running for high refresh setups or are playing CPU bound games like KSP, Civ, or Stellaris",
                  "score": 0,
                  "created_utc": 1731910340.0,
                  "replies": [
                    {
                      "id": "lxr2m7p",
                      "author": "SlightlyOffWhiteFire",
                      "body": "You can play all three of those games on toasters",
                      "score": 1,
                      "created_utc": 1731936041.0,
                      "replies": [
                        {
                          "id": "lxrj515",
                          "author": "moderngamer327",
                          "body": "Not enjoyably. KSP especially with bigger rockets is awful on a low end CPU. Civ can takes minutes between turns in the late game",
                          "score": 1,
                          "created_utc": 1731942257.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwm27k4",
          "author": "ilyich_commies",
          "body": "I have a ryzen 7 5700x3d and I literally cannot imagine needing something more powerful unless I was professional competitive fps player. It easily keeps up with my 3090 and would probably do just fine with a 4090",
          "score": 4,
          "created_utc": 1731347205.0,
          "replies": [
            {
              "id": "lwmu4n6",
              "author": "101m4n",
              "body": "I have a friend with a 5800x3d and he's in the same boat. I'm not sure why people seem to think this is a controversial statement.",
              "score": 1,
              "created_utc": 1731355694.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwlz6vp",
          "author": "Sk1-ba-bop-ba-dop-bo",
          "body": "it depends, though with the performance of the latest ryzen chips it really is just worth grabbing an X3D chip if you have the money for it ( not so much for maximum FPS as much as the 1% lows )\n\nbut honestly, devil's advocate is misplaced here - that site has been tampered with so much that even intel-to-intel comparisons used to be messed up",
          "score": 1,
          "created_utc": 1731346282.0,
          "replies": [
            {
              "id": "lwmanv5",
              "author": "SlightlyOffWhiteFire",
              "body": "\"If you have the money\" is pulling a looot of weight there. We are talking a 400 dollar difference. Even to people with a good salary, thats a significant difference. \n\nI also agree that userbenchmark is garbage, but hasn't it been general wisdom for a long time now that you don't need to pour money into your cpu for gaming? \n\nLooking around at other tech reviewers talking about these chips, its not even like userbenchmark is really going against the grain. The consensus seems to being going with the 9000x3d series over i13000 or i14000 is a lot of extra money for disproportional gains.",
              "score": 2,
              "created_utc": 1731349766.0,
              "replies": [
                {
                  "id": "lwmfacr",
                  "author": "XDenzelMoshingtonX",
                  "body": "There are a lot of cases, where a system with a stronger CPU can make sense. Any competitive FPS game (valo, cs, apex, etc) profits greatly from the vcache, MSFS does greatly, the countless of sim racing games all do etc. So not exactly niche games overall. You‘re probably getting better performance with a 9800X3D and a 4070 than a 9700X and a 4080S or 4090. Sure, your AAA ultra settings timmies are never gonna see those gains.",
                  "score": 2,
                  "created_utc": 1731351169.0,
                  "replies": [
                    {
                      "id": "lwmylij",
                      "author": "SlightlyOffWhiteFire",
                      "body": "I feel like you are drastically overestimating the demographic size of people who play those games so competitively that they will spend an extra 400 dollars on a cpu to eek out milliseconds of reaction time.",
                      "score": 1,
                      "created_utc": 1731357067.0,
                      "replies": [
                        {
                          "id": "lwn02t0",
                          "author": "XDenzelMoshingtonX",
                          "body": "And I think you are drastically underestimating it lol",
                          "score": 0,
                          "created_utc": 1731357520.0,
                          "replies": [
                            {
                              "id": "lwn5c64",
                              "author": "SlightlyOffWhiteFire",
                              "body": "I think you need to leave the gamer space for a sec.....",
                              "score": 1,
                              "created_utc": 1731359120.0,
                              "replies": [
                                {
                                  "id": "lwn5qr3",
                                  "author": "XDenzelMoshingtonX",
                                  "body": "No, thank you buddy",
                                  "score": 0,
                                  "created_utc": 1731359242.0,
                                  "replies": [
                                    {
                                      "id": "lwn697o",
                                      "author": "SlightlyOffWhiteFire",
                                      "body": "You know computers are for more than just gaming, right?",
                                      "score": 1,
                                      "created_utc": 1731359399.0,
                                      "replies": [
                                        {
                                          "id": "lwn752v",
                                          "author": "XDenzelMoshingtonX",
                                          "body": "Yes, but the 9800X3D is specifically designed for gaming, it’s the whole point of the CPU.",
                                          "score": 1,
                                          "created_utc": 1731359670.0,
                                          "replies": [
                                            {
                                              "id": "lwnlo83",
                                              "author": "SlightlyOffWhiteFire",
                                              "body": "You've more than lost the plot.",
                                              "score": 1,
                                              "created_utc": 1731364186.0,
                                              "replies": [
                                                {
                                                  "id": "lwpwhl1",
                                                  "author": "XDenzelMoshingtonX",
                                                  "body": "the keeper of the trve hardware conversation has spoken.",
                                                  "score": 0,
                                                  "created_utc": 1731398938.0,
                                                  "replies": [
                                                    {
                                                      "id": "lwqip2l",
                                                      "author": "SlightlyOffWhiteFire",
                                                      "body": "Man you need therapy. Have a good one.",
                                                      "score": 1,
                                                      "created_utc": 1731413128.0,
                                                      "replies": [
                                                        {
                                                          "id": "lwqom8r",
                                                          "author": "XDenzelMoshingtonX",
                                                          "body": "thank you, you too!",
                                                          "score": 0,
                                                          "created_utc": 1731415901.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lwntycn",
                  "author": "BranTheUnboiled",
                  "body": "400 dollar difference compared to what? You mention later the i5; Microcenter has the i5-14400 for $200, the i5-14600k for $230, and the 9800x3d for $480. I would compare it to an i7, which is $310 or $330.",
                  "score": 2,
                  "created_utc": 1731366945.0,
                  "replies": [
                    {
                      "id": "lwnwya8",
                      "author": "SlightlyOffWhiteFire",
                      "body": "The article is about the 13th and 14th gen 600 series....\n\nAnd either way you have to get all the i9s to get into the same price bracket.",
                      "score": 0,
                      "created_utc": 1731367986.0,
                      "replies": [
                        {
                          "id": "lwnzykq",
                          "author": "BranTheUnboiled",
                          "body": ">The article is about the 13th and 14th gen 600 series....\n\nYes? And then I listed the 14600k and showed it was not a $400 difference?",
                          "score": 0,
                          "created_utc": 1731369050.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lwmggt1",
                  "author": "Sk1-ba-bop-ba-dop-bo",
                  "body": "and that's part of the problem, I think - you'd still be better off with AMD chips of comparable tiers ( so non-x3d options, right now ) if you'd like to stay within budget. Intel is that cooked...",
                  "score": 0,
                  "created_utc": 1731351529.0,
                  "replies": [
                    {
                      "id": "lwmy4i0",
                      "author": "SlightlyOffWhiteFire",
                      "body": "I was recently shopping for exactly that price range of cpu and none of the tech websites I checked preferred the Ryzens over the i5s. They tended to lean towards the i5s but not particularly strongly, mostly leaving it up to a few nuances in user preference.\n\nSo honestly what you're saying here sounds more like fanboying.",
                      "score": 1,
                      "created_utc": 1731356922.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lwnwndb",
      "author": "zoiks66",
      "body": "YouTube and Reddit are funny places when it comes to CPU’s and PC’s in general.  Their users don’t understand what a small blip gamers are for overall PC sales.  Intel has about 80% of the overall client PC market.  No corporate IT department wants to buy a desktop or laptop with an AMD CPU, as it would mean having to manage clients with non-Intel chip onboard Ethernet and WiFi chips.  Reddit and YouTube are full of people screaming at each other over 3% performance difference between CPU’s, when in reality those performance differences have effectively no effect upon CPU sales numbers,",
      "score": 0,
      "created_utc": 1731367878.0,
      "replies": [
        {
          "id": "lxpv960",
          "author": "moderngamer327",
          "body": "It departments are not going to care what CPU is in a computer in the vast majority of cases. Also AMD has been gaining a lot of market share, especially in the “Mobile” department",
          "score": 1,
          "created_utc": 1731910459.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwmoasz",
      "author": "burito23",
      "body": "Well in reality yes. Gaming performance is kind of saturating now. If a game can go 2000FPS would you even notice it from 144 FPS. Save your money.",
      "score": 0,
      "created_utc": 1731353917.0,
      "replies": [
        {
          "id": "lxpvb1s",
          "author": "moderngamer327",
          "body": "Still useful in CPU bound games or if you need it for other CPU heavy tasks",
          "score": 1,
          "created_utc": 1731910488.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwltkas",
      "author": "Greyboxer",
      "body": "Outrage brigade aside, they’re right tho. At 4K it’s 2.5% faster than a 13600k according to techpowerup’s charts.\n\nEdit: the outrage brigade found me 😎",
      "score": -18,
      "created_utc": 1731344548.0,
      "replies": [
        {
          "id": "lwlwbp9",
          "author": "otaconucf",
          "body": "Because at 4k your performance is being limited more by your graphics card than your CPU. This is why the performance gains are higher at lower resolutions, where the GPU stops being the bottleneck on performance.",
          "score": 15,
          "created_utc": 1731345402.0,
          "replies": [
            {
              "id": "lwnetkq",
              "author": "Dirty_Dragons",
              "body": "> This is why the performance gains are higher at lower resolutions,\n\nWhich is irrelevant if you are gaming at 4k. I don't plan to ever game at 1080p again, so I just don't care how many FPS games get at that resolution.",
              "score": 1,
              "created_utc": 1731362014.0,
              "replies": [
                {
                  "id": "lx0vn8u",
                  "author": "UglyFrustratedppl",
                  "body": "It's not irrelevant. The CPU performance is still there, just hidden under a bottleneck. As graphics cards get better overtime more of the CPU gets utilized. Somebody who bought a cheap CPU to run 4K might eventually find that it's not able to keep up in terms of futureproofing.",
                  "score": 2,
                  "created_utc": 1731551176.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lwm7729",
              "author": "Rxyro",
              "body": "It depends on your game heavily",
              "score": 0,
              "created_utc": 1731348711.0,
              "replies": []
            },
            {
              "id": "lwlx2f0",
              "author": "Greyboxer",
              "body": "Did you feel like you needed to explain that to me for some reason?\n\nAnyone with 4K and a 4090 doesn’t need a 9800x3d, or anything more than a midrange cpu. Gains are minimal. It’s blatantly obvious. The point is, there’s no reason outside of a % uplift near margin of error, to upgrade your CPU to the highest of high end when you’re already at 4K with a 4090.",
              "score": -14,
              "created_utc": 1731345631.0,
              "replies": [
                {
                  "id": "lxpvg1n",
                  "author": "moderngamer327",
                  "body": "There are still plenty of games that are bottlenecked by the CPU at 4K",
                  "score": 1,
                  "created_utc": 1731910564.0,
                  "replies": []
                },
                {
                  "id": "lwmc9yd",
                  "author": "GrompIsMyBae",
                  "body": "It's not blatantly obvious, nothing stops a person with a 4090 and a 4K monitor from playing say, competitive CS2 or Valorant, in which case X3D CPU's are MUCH better than any i5 out there, because those games are CPU bottlenecked even at 4K. That said, I somewhat agree with your sentiment, *somewhat*.",
                  "score": 1,
                  "created_utc": 1731350258.0,
                  "replies": [
                    {
                      "id": "lwme6nt",
                      "author": "Greyboxer",
                      "body": "You gotta admit though that what you’re describing is a 1% use case of a person who already has a top 1% of hardware.\n\nMaking it relevant like 1 out of 10,000 times",
                      "score": 2,
                      "created_utc": 1731350831.0,
                      "replies": [
                        {
                          "id": "lwmhe8b",
                          "author": "GrompIsMyBae",
                          "body": "I really wouldn't go as far as saying it's a 1% use case, considering how popular competitive games are.",
                          "score": 1,
                          "created_utc": 1731351812.0,
                          "replies": [
                            {
                              "id": "lwmlid9",
                              "author": "Greyboxer",
                              "body": "I think 1% is an overestimation of the rate of truly\ncompetitive valorant or CS2 players there are who would notice a 2.5% performance uplift, out of the entire population of 4K players with a 4090",
                              "score": 2,
                              "created_utc": 1731353065.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lwnqgt6",
                  "author": "iamcts",
                  "body": "This is gold right here. Before AMD started dumpstering Intel, the only thing Intel fanboys could still hold onto to was single core performance on their $500 CPU. \n\nNow that AMD beats Intel in nearly all metrics, they're resorting to not needing a good CPU anymore because the price to performance ratio isn't there.",
                  "score": 0,
                  "created_utc": 1731365761.0,
                  "replies": [
                    {
                      "id": "lwnss0r",
                      "author": "Greyboxer",
                      "body": "who the fuck fanboys anymore? is this the core 2 duo days or something? its 2024 brother get with the rest of humanity. No one fanboys a brand of CPU",
                      "score": 1,
                      "created_utc": 1731366543.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwlwwwo",
          "author": "Greyboxer",
          "body": "Lmao being downvoted for quoting from a chart",
          "score": -6,
          "created_utc": 1731345585.0,
          "replies": [
            {
              "id": "lwme4qz",
              "author": "XDenzelMoshingtonX",
              "body": "Downvoted for „at 4K“ in my case. Doesn‘t mean anything, since it fully depends on the games you‘re playing.",
              "score": 7,
              "created_utc": 1731350816.0,
              "replies": []
            },
            {
              "id": "lwmloru",
              "author": "i7-4790Que",
              "body": "Lmao, getting buttmad over internet points",
              "score": 4,
              "created_utc": 1731353119.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}