{
  "post": {
    "title": "NVIDIA GeForce RTX 5090 review: Pure AI excess for 2,000 Dollars",
    "author": "a_Ninja_b0y",
    "id": "1i84usn",
    "score": 915,
    "created_utc": 1737643322.0,
    "selftext": "",
    "num_comments": 277,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i84usn/nvidia_geforce_rtx_5090_review_pure_ai_excess_for/"
  },
  "comments": [
    {
      "id": "m8qdzhe",
      "author": "Thandor369",
      "body": "Nvidia main focus is AI now, it’s the cash cow. So gaming is just an afterthought, we just get this AI tech adapted to at least have something to show in terms of gaming performance improvements.",
      "score": 471,
      "created_utc": 1737644462.0,
      "replies": [
        {
          "id": "m8qozrf",
          "author": "zirky",
          "body": "ai is their cash cow. gaming is how they stay in the zeitgeist.",
          "score": 41,
          "created_utc": 1737647713.0,
          "replies": []
        },
        {
          "id": "m8qpert",
          "author": "Salahuddin315",
          "body": "What improvements? There is a handful of expensive titles like Cyberpunk (although I, for one, haven't forgotten what a disaster it was on release) that actually offer some stunning visuals; the rest use AI upscaling as a crutch to make up for dogshit optimization with the same quality of graphics we had 10 years ago. ",
          "score": 175,
          "created_utc": 1737647832.0,
          "replies": [
            {
              "id": "m8r0py2",
              "author": "Majestic_beer",
              "body": "Would be fun to get first local AI plot or conversations 🤷 or local ai dynamically changing situations.",
              "score": 36,
              "created_utc": 1737650978.0,
              "replies": [
                {
                  "id": "m8rlz81",
                  "author": "Storkmonkey7",
                  "body": "I think AI would be perfect for announcers in sports games. Not the same recycled lines everytime there is a big play or something.",
                  "score": 68,
                  "created_utc": 1737656771.0,
                  "replies": [
                    {
                      "id": "m8sjwpc",
                      "author": "Invoqwer",
                      "body": " Background chatter for villager-type NPCs as well, perhaps? Pedestrians? Maybe shopkeepers?",
                      "score": 20,
                      "created_utc": 1737666055.0,
                      "replies": [
                        {
                          "id": "m8sqfw2",
                          "author": "Auran82",
                          "body": "I imagine modders would love that, lol.",
                          "score": 9,
                          "created_utc": 1737667820.0,
                          "replies": []
                        },
                        {
                          "id": "m8tjdbg",
                          "author": "KuouoHD",
                          "body": "Y'all are gonna be the reason writers, artists, and voice actors lose their jobs in the video game industry. All those things, sports announcers, npc chatter in the background, pedestrians, shopkeepers - Written, drawn, modeled, and voice acted by actual people who depend on doing that as a livelihood. \n\nMeanwhile, in the near future, CEOs and their shareholders are laughing in your face because they managed to serve you slop at *seventy fucking dollars* a pop, all the while laying off another 2,000 employees for \"cost-reduction.\"\n\nDon't stand for this shit man, it's not cool. There's talented people out there in the gaming industry, and they're already getting screwed by greed.",
                          "score": 9,
                          "created_utc": 1737676289.0,
                          "replies": [
                            {
                              "id": "m8tkbd1",
                              "author": "Invoqwer",
                              "body": "It's not really a matter of cost reduction but more a matter of scale and immersion. Play a game long enough and you will absolutely hear the same background chatter lines over and over and over again. You simply cannot have so much background chatter that there is no overlap and no repetitions. IMO this is the perfect use case for AI generated voice stuff especially since it can make NPCs respond better to the going-ons of the main story. But  obviously do not touch any named characters with this. Leave it for nameless background NPCs only. Using AI generated lines for names characters breaks immersion IMO because it will inevitably get a bit weird with the responses. But it should be fine for Random Nameless Peasant #43 to generate some lines about how his pockets have holes or he heard someone took care of the nearby bandit camp yesterday.",
                              "score": 27,
                              "created_utc": 1737676585.0,
                              "replies": [
                                {
                                  "id": "m8ton4f",
                                  "author": "KuouoHD",
                                  "body": "You're looking at it from a gameplay perspective for your own immersion when you're failing to see the bigger picture at hand here. First, it was High on Life using AI art for background props like movie posters, then it'll be something like Elder Scrolls 6 using it for \"Immersive NPC chatter\" or a 2K game using an AI gen sports announcer. Before you know it, the next GTA or Marvel Rivals is going to have voice lines completely generated by AI.\n\n*The moment these companies realize they can get away with it, it won't be* ***just*** *for nameless background NPCs.* That's why you can't buy into this AI-gen crap. It's already seeping into the industry and costing people their actual jobs or low-balling them into contracts where these companies can use their voice/likelihoods forever in AI generated content.",
                                  "score": -15,
                                  "created_utc": 1737677942.0,
                                  "replies": [
                                    {
                                      "id": "m8ulrnh",
                                      "author": "4o1ok",
                                      "body": "And here we are, posting our thoughts using the heartless technology of Reddit, instead of using a paid Town Criers to announce our thoughts to the masses.",
                                      "score": 25,
                                      "created_utc": 1737689278.0,
                                      "replies": [
                                        {
                                          "id": "m8wrkyl",
                                          "author": "ElMatasiete7",
                                          "body": "\"Ah, you think people shouldn't kill? Then we should send the poor wife who defended herself against her abusive husband and shot him to jail then, according to you.\"",
                                          "score": -1,
                                          "created_utc": 1737726861.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "m8uy6eh",
                                      "author": "Alfawolff",
                                      "body": "Dang reading this kinda made me realize how people felt when they were told computers were the end of labor or something, or that credit cards are the antichrist",
                                      "score": 9,
                                      "created_utc": 1737693879.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "m91of13",
                                      "author": "ShitImBadAtThis",
                                      "body": "This is too much of a \"slippery slope!!\" type of argument. You do have a point with what you're  saying, but you're making up lots of things that haven't happened and maybe won't happen\n\nThings like Call of Duty are already relying waaay too much on AI and I hope it doesn't become normalized, but there are definitely legitimate uses for it that could be very entertaining.",
                                      "score": 2,
                                      "created_utc": 1737782249.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "m8vae4n",
                                      "author": "TheRealGOOEY",
                                      "body": "Do you buy only hand knit sweaters? Or butter churned by hand? Or any number of other products that have ultimately displaced workers due to automation? Generative AI isn’t the problem. The system that can abuse it is the problem.",
                                      "score": 3,
                                      "created_utc": 1737699322.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "m8ue6x7",
                                      "author": "welchplug",
                                      "body": "You can't stop it man. Whether you, me, or reddit want it, its here to stay. Can't stop progress.",
                                      "score": 5,
                                      "created_utc": 1737686465.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "m8va8y4",
                                      "author": "DorianGre",
                                      "body": "They will have to do different jobs. It is what it is. There used to be telephone operators, typewriter repairmen, and people who delivered milk to your house everyday. Crafted work will become an artisanal experience.",
                                      "score": 1,
                                      "created_utc": 1737699249.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m8ut65d",
                              "author": "MatteCrystal",
                              "body": "Not really. The big and small companies that use the ai to make these kinds of features in games successfully will be the reason. \n\nAlso, AI is expanding so rapidly and allows so much possibility that even smaller single dev indie devs could totally integrate it into their games in some way. In reality, the AI features will disproportionally effect and be useful to the smaller companies and make them more competitive with the larger companies. The large companies will of course still try to sell $70 slop and microtransactions on top. But Ai will only make the market more competitive. Smaller devs that create and sell games at lower prices with be able to make higher quality products than they would otherwise. And this in turn drives prices down. Of course most AAA will try to maintain their high prices, but in the end they'll prob just hurt their bottom line doing that. \n\nNot saying this in any way benefits workers AI would replace. just pointing out facts and likely outcomes.",
                              "score": 2,
                              "created_utc": 1737691937.0,
                              "replies": []
                            },
                            {
                              "id": "m937kdb",
                              "author": "Jaker788",
                              "body": "There's a reason why SAG is striking right now for voice actors, at least for studios that haven't agreed yet. They're asking for AI provisions, mainly that the actor doesn't have their voice used in AI without consent and they get some amount of payment for it.\n\nAI doesn't have to be the end of these jobs at all, it allows more voiced work than they'd be able to do and potentially more money.",
                              "score": 2,
                              "created_utc": 1737812866.0,
                              "replies": []
                            },
                            {
                              "id": "m954sds",
                              "author": "CosmicCreeperz",
                              "body": "There will still be tons of jobs in the game industry, they will just change focus as some things become easier to automate.  The whole point of open world games with thousands of NPCs is to appear unscripted and dynamic.  Why not just make it unscripted and dynamic?\n\nI’m sure a ton of people lost their jobs when cars replaced horses.  I’m also sure there are many orders of magnitude more people employed in the auto industry today.",
                              "score": 1,
                              "created_utc": 1737833937.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m954vir",
                          "author": "CosmicCreeperz",
                          "body": "Yep - nVidia and others are already working on it!\n\nhttps://youtu.be/uryeFhnNzEs",
                          "score": 1,
                          "created_utc": 1737833963.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m8t8pw6",
                      "author": "_RADIANTSUN_",
                      "body": "Problem is probably with rating something like that like e g. thru ESRB they require a list of all voice lines to rate it, I think there is some catching up the industry and regulation etc has to do. Not to mention probably union related stuff like with voice actors. Plus most ML frameworks are made for CUDA only and nobody really supports ROCM or OpenCL. So Nvidia-only.",
                      "score": 5,
                      "created_utc": 1737672987.0,
                      "replies": [
                        {
                          "id": "m8vae0l",
                          "author": "DorianGre",
                          "body": "This game has not been rated.",
                          "score": 1,
                          "created_utc": 1737699320.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m8ugf46",
                      "author": "BaggyLarjjj",
                      "body": "To be fair, that’s about all Madden himself had",
                      "score": 2,
                      "created_utc": 1737687291.0,
                      "replies": []
                    },
                    {
                      "id": "m8roxja",
                      "author": "Majestic_beer",
                      "body": "Lots of options!",
                      "score": 3,
                      "created_utc": 1737657602.0,
                      "replies": []
                    },
                    {
                      "id": "m8t5er6",
                      "author": "MSTK_Burns",
                      "body": "I've been waiting for a full on \"survivor\" game, the mini games would be challenges, microphone input, AI cast members for you to try and ally with or scheme against. Even just a multiplayer version of this.",
                      "score": 3,
                      "created_utc": 1737672016.0,
                      "replies": []
                    },
                    {
                      "id": "m8t4d0r",
                      "author": "Granitsky",
                      "body": "I wouldnt mind Boom Goes the Dynamite every time",
                      "score": 3,
                      "created_utc": 1737671710.0,
                      "replies": []
                    },
                    {
                      "id": "m8wijdp",
                      "author": "HighPriestofShiloh",
                      "body": "To risky.",
                      "score": 1,
                      "created_utc": 1737723565.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8rqq7u",
                  "author": "ManiacalDane",
                  "body": "It'd be no different to the trite you get with procedural generation. \"AI\" (I assume you mean LLMs) aren't really all that different from ML algorithms, which've already been used in videogames for procedural generation. And it's *not* a viable solution for fun nor plots.",
                  "score": 17,
                  "created_utc": 1737658087.0,
                  "replies": [
                    {
                      "id": "m8rsz1w",
                      "author": "Majestic_beer",
                      "body": "I'm not specifically refering to anything currently known. Lets see how they starts to utilize these chips with new innovations.",
                      "score": -7,
                      "created_utc": 1737658691.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8s4muz",
                  "author": "HectorJoseZapata",
                  "body": "The algorithms in GTA were considered top tier. Were.",
                  "score": 4,
                  "created_utc": 1737661854.0,
                  "replies": []
                },
                {
                  "id": "m8rn4y6",
                  "author": "Borghal",
                  "body": "There is a mod for Skyrim for this, (of course there is :-)). Iirc it only does conversations and a select handful of NPC actions, but it is at least connected to the TES wiki so that the NPCs dialogue is somewhat thematic.\n\nI don't know the specifics though, don't think it can use these NVIDIA cards, most likely it connects to some LLM over the internet.",
                  "score": 4,
                  "created_utc": 1737657116.0,
                  "replies": [
                    {
                      "id": "m8roszo",
                      "author": "Majestic_beer",
                      "body": "I know but with from 100 million dollar development team you can get quite a lot more done.",
                      "score": 2,
                      "created_utc": 1737657568.0,
                      "replies": [
                        {
                          "id": "m8s4u30",
                          "author": "HectorJoseZapata",
                          "body": "Tell that to Tesla",
                          "score": 6,
                          "created_utc": 1737661908.0,
                          "replies": [
                            {
                              "id": "m8v6lv3",
                              "author": "Majestic_beer",
                              "body": "They have done more to the self driving car sector than any other manufacturer, I'm not tesla funboy but it is idiotic to say that tesla hasn't gotten shit to done.",
                              "score": -6,
                              "created_utc": 1737697488.0,
                              "replies": [
                                {
                                  "id": "m8w3ea7",
                                  "author": "HectorJoseZapata",
                                  "body": "That’s not what I’m talking about. I’m talking about spending 100 million dollars and not having anything to show. \n\nTesla *was* the future. And then they slept on it. Every car manufacturer is on track to surpass them in the next few years. \n\nAnd yea, you’re a fanboy.\n\nEdit: spelling",
                                  "score": 2,
                                  "created_utc": 1737716351.0,
                                  "replies": [
                                    {
                                      "id": "m8wo118",
                                      "author": "Majestic_beer",
                                      "body": "It doesn't remove their advancements on those thing still. Call me fan boy, I don't care. I would buy toyota ev if they had what I want from a car. I drive cheap old petrol toyota as I can as no point bying EV driving yearly 4000km.",
                                      "score": -2,
                                      "created_utc": 1737725619.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m95pwyj",
                      "author": "addamee",
                      "body": "As long as it helps that girl find a good sweet roll in that skeever hole of a city",
                      "score": 1,
                      "created_utc": 1737840343.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8ueclx",
              "author": "Juub1990",
              "body": "We had graphics the quality of Black Myth Wukong, Indiana Jones, Hellblade 2, or FF XVI 10 years ago?",
              "score": 4,
              "created_utc": 1737686524.0,
              "replies": [
                {
                  "id": "m8wzdqh",
                  "author": "VagueSomething",
                  "body": "Look at how amazing Hellblade 1 looked on release and realise 2017 is 8 years ago. Once the existential crisis calms you can then see that some insanely good graphics came out last gen and that this gen is mostly a polished version rather than a new version entirely.",
                  "score": -1,
                  "created_utc": 1737729442.0,
                  "replies": [
                    {
                      "id": "m8x0bvb",
                      "author": "Juub1990",
                      "body": "And now look at Hellblade 2 that looks far better.",
                      "score": 5,
                      "created_utc": 1737729745.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8wl4pu",
              "author": "Queasy_Hour_8030",
              "body": "Nobody forgets that cp2077 was a buggy mess on launch, that doesn’t stop it from being one of the best video games of all time now. \n\nYou’re goofy for being pig headed about it. ",
              "score": 7,
              "created_utc": 1737724565.0,
              "replies": [
                {
                  "id": "m8xjze1",
                  "author": "ColinDJPat",
                  "body": "One of the best games of all time is a bit of a stretch, but it's undeniably a whole lot better than release. ",
                  "score": 4,
                  "created_utc": 1737735437.0,
                  "replies": [
                    {
                      "id": "m8xmc9d",
                      "author": "Queasy_Hour_8030",
                      "body": "What are your criticisms of the game in its current state?",
                      "score": 3,
                      "created_utc": 1737736079.0,
                      "replies": [
                        {
                          "id": "m91mu65",
                          "author": "killmak",
                          "body": "Lack of actions and dialog having consequences.  Game was amazing but the ending coming down to two dialog choices at the end of the game was disappointing.",
                          "score": 5,
                          "created_utc": 1737781515.0,
                          "replies": []
                        },
                        {
                          "id": "m91o43v",
                          "author": "ShitImBadAtThis",
                          "body": "I was not at all into the voice acting; everyone had this weirdly smug attitude with everything they would say, and then a lot of the dialogue had waay too much exposition and filler stuff that i felt no incentive to pay attention to. \n\nA lot of the missions I played (which to be fair, were not too many) were \"go here, talk to this person. Then go here, talk to this person. Then come back and talk to this person.\" \n\nI mean, I'm sure there's a lot to like, but I don't think it's immune to criticism. I put it down because I could not stop hearing exposition after exposition of stuff I truly did not care about, but I'll probably go back to it at some point soon",
                          "score": 4,
                          "created_utc": 1737782106.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8saz4q",
              "author": "ConcreteRacer",
              "body": "\"Still blurry HD graphics that make you doubt your optometrist's competence? Yes, but now they're \"AI ENHANCED (please buy our shit)\"",
              "score": 7,
              "created_utc": 1737663609.0,
              "replies": []
            },
            {
              "id": "m8ul8du",
              "author": "unpopular-dave",
              "body": "I mean… This is a joke right? It’s very clearly a 20 to 30% improvement across the board. Which might be too little for most consumers. And that’s OK. Most consumers aren’t in the market for a $2000 upgrade. I’m sure not.But let’s not be disingenuous",
              "score": 4,
              "created_utc": 1737689084.0,
              "replies": [
                {
                  "id": "m8wmlrh",
                  "author": "Thandor369",
                  "body": "Yeah, but don’t forget that we have 20-30% improvement with pretty much the same increase in cost and power usage. So it is more of a 4090 Ti than 5090.",
                  "score": 1,
                  "created_utc": 1737725103.0,
                  "replies": [
                    {
                      "id": "m8xtn39",
                      "author": "unpopular-dave",
                      "body": "OK",
                      "score": 2,
                      "created_utc": 1737738085.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8umbqm",
              "author": "Christopher135MPS",
              "body": "The CP2077 hatred is wildly overblown. So many people had no problems, day 1.",
              "score": 3,
              "created_utc": 1737689473.0,
              "replies": [
                {
                  "id": "m92c1x4",
                  "author": "Typemessage1",
                  "body": "Lol.\n\n\nI bought the game a year or so after. Insane bugs AT THE INTRO. Nothing about how bad the bugs were was overblown. People just started using mods to make the bad memories go away.",
                  "score": 1,
                  "created_utc": 1737795648.0,
                  "replies": [
                    {
                      "id": "m92g902",
                      "author": "Christopher135MPS",
                      "body": "I’m not denying people had trouble playing. \n\nI’m saying the hatred was overblown. I played on an AMD CPU that was so old I don’t remember what model, and a 1660 super 6gb. Lots of people played without issues. \n\nPeople struggling with bugs are much more likely to complaining online (with a valid reason to do so). The players that aren’t experiencing bugs and crashes aren’t posting how great it is the game is working fine - they’re just playing the game.",
                      "score": 1,
                      "created_utc": 1737798303.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8txa6a",
              "author": "revolvingpresoak9640",
              "body": "This is such a tired copypasta at this point.",
              "score": 3,
              "created_utc": 1737680667.0,
              "replies": []
            },
            {
              "id": "m8r387t",
              "author": "Manitcor",
              "body": "If aaa gaming does not collapse new top tier titles are more likely to use raytracing exclusively. Not sure if adoption is high enough however.",
              "score": 1,
              "created_utc": 1737651657.0,
              "replies": []
            },
            {
              "id": "mofr5to",
              "author": "DelinquentTuna",
              "body": "> There is a handful of expensive titles like Cyberpunk\n\nYou should take a look at what can be done w/ local AI on good GPUs.  IDK where to even suggest you look for a showcase, but maybe start at [CivitAI](https://civitai.com/)?  Pretty much any artistic task you require, from retouching/colorizing old photos of your great-grandparents to a photorealistic gender swap of your PE coach.  It's mind-boggling and these cards can spit out images with lightning speed.  Some of the locally hosted models are also nothing short of amazing wrt their ability to help with research or coding tasks - particularly important for working with proprietary data and ideas.\n\n_______________________________________________\nLeave you with a bit of mediocre but bespoke AI poetry:\n\nHe sees the hype, the fervent quest,  \nFor silicon brains, put to the test.  \nThese shiny GPUs, row on row,  \nFor tasks that future AI might know.\n\nWhile others chase the teraflops so grand,  \nHe holds a joystick in his hand.  \nLet algorithms learn and slowly creep,  \nSalahuddin has biases he'll surely keep.\n\nHe sees the benchmarks, numbers climb,  \nFor problems abstract, out of time  \nWith fragging noobs and epic loot,  \nHis priorities bear different fruit.\n\n\"These fancy cards,\" he might just sigh,  \n\"For tasks that tickle the digital sky.  \nI need my frames, my smooth display,  \nNot endless bots to ruin my day!\"\n\nSo let the models learn and grow,  \nHis skepticism continues to show.  \nA grounded soul, amidst the fray,  \nSalahuddin simply wants to play!\n\nPerhaps one day, he'll see the light,  \nWhen AI wins a gaming fight!  \nBut until then, with chuckle and with grin,  \nWe tip our hats to Salahuddin!",
              "score": 1,
              "created_utc": 1745332578.0,
              "replies": []
            },
            {
              "id": "m8vfmhu",
              "author": "truedef",
              "body": "I forgot I even own cyberpunk… barely played it",
              "score": 0,
              "created_utc": 1737702070.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8thb3l",
          "author": "LordTommy33",
          "body": "I would disagree actually. I think we’ve seen a progress push of “More power!” For a while that culminated in the 4090: a huge honking beast that took up a good amount of space and had some issues with overheating (and small fires from that stupid connector)\n\nI think this is a good amount of fore sight but game dev hasn’t quite caught up… yet. I dunno, I guess working directly in game dev I’m a bit more helpful but these new AI based cores are better for more of the Machine Learning style brains and AI from my understanding. These are tools we can develop and use in game dev to make them more performant and give us room for the other nice bells and whistles. Currently behavior trees are pretty much industry standard, maybe a state machine for simpler logic. They still require a decent number of ticks and when multiplied across multiple npcs in game it can add up. You start to hit a limit at how quickly your game can run when you have complex AI mixed with the high end graphics mixed with audio, etc. I think GPUs have already hit more of the upper limit on what they can do with ray tracing and lighting and handling beautiful graphics. \n\nNow the next logical step is to take some of that burden off and simplify some things like AI behaviors or maybe even frame interpolation through ML models that make the program run even faster. I can think of one form game that would benefit heavily from that: VR. \n\nWith VR basically needing to render two different views in the game simultaneously some sort of AI based frame generation would give some massive performance gains and let developers add some really detailed, large worlds into them. \n\nCombine that with the level of artistry you can see in Half life Alyx and I think you’d have a pretty amazing experience.",
          "score": 1,
          "created_utc": 1737675641.0,
          "replies": []
        },
        {
          "id": "m8who9w",
          "author": "qqpp_ddbb",
          "body": "Soon when GENai games begin to become better and more current consistent then we'll see them used for gaming again.. but via ai i guess",
          "score": 1,
          "created_utc": 1737723223.0,
          "replies": []
        },
        {
          "id": "m8y1gq9",
          "author": "nipple_salad_69",
          "body": "No, we literally can't make transistors any smaller, that's the real reason, we are bottlenecked by physical limitations of hardware, software is the only way to go forward atm.",
          "score": 1,
          "created_utc": 1737740259.0,
          "replies": []
        },
        {
          "id": "m8qnnwd",
          "author": "None",
          "body": "Games have good enough graphics already imo. It's like phones at this point the upgrades are hardly noticeable",
          "score": -16,
          "created_utc": 1737647334.0,
          "replies": [
            {
              "id": "m8qq2ca",
              "author": "Crintor",
              "body": "There's still so much ground to cover in graphics.",
              "score": 23,
              "created_utc": 1737648017.0,
              "replies": [
                {
                  "id": "m8qwg06",
                  "author": "Xeadriel",
                  "body": "I for one can’t wait for path tracing photo realistic 4k per eye VR with 240 fps games. \n\nYep  there is still room for improvement. I hope I’ll live to see it.",
                  "score": 6,
                  "created_utc": 1737649812.0,
                  "replies": [
                    {
                      "id": "m8sri46",
                      "author": "zekromNLR",
                      "body": "And your GPU to be a 2 kW space heater?",
                      "score": 3,
                      "created_utc": 1737668110.0,
                      "replies": [
                        {
                          "id": "m8ssck5",
                          "author": "Xeadriel",
                          "body": "With current standards yes. But I’d assume efficiency would improve along with the tech lol",
                          "score": 2,
                          "created_utc": 1737668343.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m8s5bfn",
                      "author": "HectorJoseZapata",
                      "body": ">4k per eye\n\nThat’s an 8k image split in two. \n\n>Yep  there is still room for improvement. I hope I’ll live to see it.\n\nThere is, but we are so far away from photorealistic, and using ai only damages the pictures more.",
                      "score": 1,
                      "created_utc": 1737662039.0,
                      "replies": [
                        {
                          "id": "m8sgbwm",
                          "author": "Xeadriel",
                          "body": ">That’s an 8k image split in two.\n\nI know.\n\n>There is, but we are so far away from photorealistic, and using ai only damages the pictures more.\n\nyeah that AI solution does feel like a duct tape \"solution\" doesnt it?\n\nwhat I'm more scared about is that they might eventually drive gpu prices so high that games will only be reasonably possible via cloud streaming. and oh god I cant describe how much I hate subscriptions.",
                          "score": 1,
                          "created_utc": 1737665085.0,
                          "replies": [
                            {
                              "id": "m8sjza4",
                              "author": "HectorJoseZapata",
                              "body": "Back in the old days of 2012 I used the OnLive demo on my PC and I loved it! Different experiences I guess. \n(I didn’t have enough spare money to buy a better gpu, I think I had an AMD HD5450 or something like that.)",
                              "score": 1,
                              "created_utc": 1737666074.0,
                              "replies": [
                                {
                                  "id": "m8sm5al",
                                  "author": "Xeadriel",
                                  "body": "It’s a trap. It’s the same as any other subscription based model. It’s made to make you overpay for a sense of comfort and the unnecessary luxury of using the latest release. \n\nBut when you buy you can decide to stretch out that payment you made over whatever time frame you want.\n\nFrom a money perspective buying is always better with anything whereas subscriptions, just like interest, abuse people with too little liquid assets.\n\nSubscriptions are nice as temporary solutions because of how flexible they are though.",
                                  "score": 1,
                                  "created_utc": 1737666660.0,
                                  "replies": [
                                    {
                                      "id": "m8w33mq",
                                      "author": "HectorJoseZapata",
                                      "body": "Well, SONY bought them in 2013 and did nothing for years.",
                                      "score": 1,
                                      "created_utc": 1737716183.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m95b690",
                          "author": "CosmicCreeperz",
                          "body": "No it’s not, it’s split in 4.  It’s a bit confusing but 8k is 4 times the pixels as 4k, since both vertical and horizontal are doubled.\n\nSo it really is just rendering 2 4K frames.   Though for VR the displays are much more square, or even a bit larger in the vertical dimension.  The Q3 is around 2000x2200 pixels per eye, which is basically 4k resolution total (ie combined is 4000x2200) Double that and you have “4k” equivalent per eye already.",
                          "score": 1,
                          "created_utc": 1737835857.0,
                          "replies": [
                            {
                              "id": "m95y85v",
                              "author": "HectorJoseZapata",
                              "body": "You’re right\n\n\n>4K = 3840×2160\n>8K = 7680×4320",
                              "score": 1,
                              "created_utc": 1737842916.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8qxtyb",
                  "author": "agnaddthddude",
                  "body": "such as?",
                  "score": -3,
                  "created_utc": 1737650200.0,
                  "replies": [
                    {
                      "id": "m8sc6js",
                      "author": "youzongliu",
                      "body": "Well if I show you a game and a video of real life, can you tell which one is a game and which one is real life? If the answer is yes then we still have a lot of improvements to do in graphics.",
                      "score": 3,
                      "created_utc": 1737663940.0,
                      "replies": [
                        {
                          "id": "m8tido5",
                          "author": "agnaddthddude",
                          "body": "totally unnecessary, actual photo realistic graphics would only make some things harder. gore for example would be very hard to achieve to the realistic nature of it. that’s why GTA while trying to improve the graphics doesn’t aim at a photorealistic one",
                          "score": 1,
                          "created_utc": 1737675979.0,
                          "replies": [
                            {
                              "id": "m8tweiy",
                              "author": "youzongliu",
                              "body": "Not sure if I follow, why would realistic graphics make gore hard to achieve? Plenty of movie examples of incredible displays of gore.",
                              "score": 2,
                              "created_utc": 1737680386.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8rr7c4",
          "author": "flogman12",
          "body": "A cash cow for who? Companies maybe but not the average consumer buying these things",
          "score": -5,
          "created_utc": 1737658215.0,
          "replies": [
            {
              "id": "m8sr5r2",
              "author": "echocage",
              "body": "That’s why 85% of nvidias profits are from the cooperate arise",
              "score": 2,
              "created_utc": 1737668016.0,
              "replies": []
            },
            {
              "id": "m8vbuik",
              "author": "Thandor369",
              "body": "Yeah, companies and data centers, 80% of Nvidia’s revenue comes from those sales.",
              "score": 1,
              "created_utc": 1737700064.0,
              "replies": []
            },
            {
              "id": "m8sof8a",
              "author": "AndreisValen",
              "body": "Maybe im in an echo chamber but AI is almost entirely looked down on in my circles. There’s maybe 1 or 2 that use it for art but they always get clowned on. \n\n(This is excluding machine learning in academia since we’ve been using that shit for years now and it’s far less excessive) ",
              "score": 1,
              "created_utc": 1737667274.0,
              "replies": [
                {
                  "id": "m8svbni",
                  "author": "Acquire16",
                  "body": "You're definitely in an echo chamber. Look outside art. ",
                  "score": 6,
                  "created_utc": 1737669147.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8qo2or",
      "author": "caiusto",
      "body": "We won't really start to see the full potential of these cards in gaming until the DirectX's new Neural Rendering API gets fully implemented, if you have money to spare then there's hope they will get a performance boost down the line but as of now doesn't seem worth it if you already got RTX 40XX.",
      "score": 94,
      "created_utc": 1737647452.0,
      "replies": [
        {
          "id": "m8qrofx",
          "author": "SiscoSquared",
          "body": "I have a 3080 and it doesn't seem worth it lol",
          "score": 78,
          "created_utc": 1737648480.0,
          "replies": [
            {
              "id": "m8qs9yb",
              "author": "caiusto",
              "body": "Oh yeah tbf the 3080/90 are both great cards still, even the 3070 if we look at how the 4060 turned out. But I reckon those were already thinking of upgrading but maybe not anymore.",
              "score": 28,
              "created_utc": 1737648649.0,
              "replies": [
                {
                  "id": "m8srq1t",
                  "author": "ShippingMammals_2",
                  "body": "I have a Vega64 lol.. the ole girl is past due to be put to pasture. I've been hemming and hawing about which card to get.  I want to do local AI but the price on those dam 5090s, more than everything else put together.  I want to see some benchmarks at least.  Not much point in running a local LLM if pushing on the pull door lol",
                  "score": 14,
                  "created_utc": 1737668171.0,
                  "replies": [
                    {
                      "id": "m8tq3sn",
                      "author": "Cougheemug",
                      "body": "I loved the boxy design of Vega 56/64. They looked so clean, wish they make more like em again",
                      "score": 2,
                      "created_utc": 1737678399.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8qug7b",
                  "author": "PM_ME_STEAM_KEY_PLZ",
                  "body": "Have a 4070.\n\nWant a 5080. Idk why.",
                  "score": 6,
                  "created_utc": 1737649263.0,
                  "replies": [
                    {
                      "id": "m8rdf0t",
                      "author": "IcodyI",
                      "body": "I have a 3070ti, I want a 5090",
                      "score": 4,
                      "created_utc": 1737654464.0,
                      "replies": [
                        {
                          "id": "m8reu18",
                          "author": "bold78",
                          "body": "Want... But only have a 650 watt PSU... So I guess I might be waiting until the next build.",
                          "score": 2,
                          "created_utc": 1737654844.0,
                          "replies": [
                            {
                              "id": "m8rfvsj",
                              "author": "IcodyI",
                              "body": "Ha yeah I have a 850w PSU, will need to get a 1200+ if I snag a 5090 lol",
                              "score": 5,
                              "created_utc": 1737655123.0,
                              "replies": [
                                {
                                  "id": "m8szgy9",
                                  "author": "ConcreteRacer",
                                  "body": "Maybe think a step ahead and ask your local Power/utilities provider if they'd like to build a powerplant in your backyard, for NVIDIA's 60-Series GPUs that's coming in a few years lmao",
                                  "score": 2,
                                  "created_utc": 1737670294.0,
                                  "replies": [
                                    {
                                      "id": "m8t17kq",
                                      "author": "IcodyI",
                                      "body": "Now we’re really futureproofing",
                                      "score": 2,
                                      "created_utc": 1737670795.0,
                                      "replies": [
                                        {
                                          "id": "m8v3qmv",
                                          "author": "ConcreteRacer",
                                          "body": "That's the Spirit!",
                                          "score": 1,
                                          "created_utc": 1737696204.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m8rwiwm",
                          "author": "Ausles",
                          "body": "Ditto",
                          "score": 1,
                          "created_utc": 1737659657.0,
                          "replies": []
                        },
                        {
                          "id": "m8s6oux",
                          "author": "Shadd76",
                          "body": "I have a 2080 on a six year old system I'm ready to build a new system when they drop. I WANT a 5090, but I'm going to get a 5080.",
                          "score": 1,
                          "created_utc": 1737662414.0,
                          "replies": [
                            {
                              "id": "m8z4de3",
                              "author": "L4ZYKYLE",
                              "body": "Similar here. 2070. (Over) ready to build, but still continue to struggle at the lack of $/fps improvements in the past 5 years. Sure I can spend 2x now to finally get 2x performance. I could have done that back then.\n\nI’ll take a 5070 ti, 5080, or 5090. I just want something at msrp. And a damn 9800X3D at msrp… lol",
                              "score": 1,
                              "created_utc": 1737751185.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m8s7a2a",
                          "author": "reptarbeatsbarney",
                          "body": "Have a 1070ti. Want a 5090 for the higher vram since I only upgrade every 7 years or so. Will probably have to settle for the 5080 at this price point for the level of improvement the 5090 gives over the 5080.",
                          "score": 1,
                          "created_utc": 1737662580.0,
                          "replies": []
                        },
                        {
                          "id": "m8srqek",
                          "author": "ShippingMammals_2",
                          "body": "I have a vega64, I would take either lol. Actually I'm about the pull the trigger on buying a new system and am debating what to get.",
                          "score": 1,
                          "created_utc": 1737668174.0,
                          "replies": []
                        },
                        {
                          "id": "m8z3rp6",
                          "author": "Magus_5",
                          "body": "I'm running CP2077, RDR2, BG3 and other recent titles on my 2080ti and all is well. I'm also not scrutinizing the level of detail in V's face in the rain puddles either so...",
                          "score": 1,
                          "created_utc": 1737751014.0,
                          "replies": []
                        },
                        {
                          "id": "m8ri74t",
                          "author": "opeth10657",
                          "body": "Have a 3090ti and want a 5090.",
                          "score": -5,
                          "created_utc": 1737655752.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8s6ra0",
              "author": "bunkSauce",
              "body": "I've said this in a million places. Upgrading to 5080 or higher should only be done if you have a 3070 or below.\n\nThis is pretty much true for any generation. Have a (X)0(Y)0? Don't upgrade until (X+2)0(Y)0 or (X+1)0(Y+2)0.\n\nFollow that rule or you're wasting money.\n\nPersonally, i stick with the 80 or 90 models and upgrade every 3 generations (2080 -> 5080/5090).\n\nUpgrading from 30xx to 40xx... or 40xx to 50xx... is just wasting money to eke out another 20% increased performance.",
              "score": 14,
              "created_utc": 1737662433.0,
              "replies": [
                {
                  "id": "m8tfd29",
                  "author": "crimson_raider",
                  "body": "Tbh I am gonna hold steady with my 3060ti for another gen.",
                  "score": 3,
                  "created_utc": 1737675025.0,
                  "replies": [
                    {
                      "id": "m8tgqbl",
                      "author": "bunkSauce",
                      "body": "My gf is still rocking the 1080ti. And I don't blame her. It handles everything she touches fine at 1080p.\n\nI use PCVR, so my 2080 could use a bump up.",
                      "score": 1,
                      "created_utc": 1737675459.0,
                      "replies": []
                    },
                    {
                      "id": "ma85zak",
                      "author": "Thelongdong11",
                      "body": "Same with a ryzen 5600. Im on a 1080p monitor so it still plays everything fine. Whenever I upgrade my gpu, I would also have to factor in the price of a monitor upgrade, then probably a Psu and cpu/ram upgrade which also means new mobo. It becomes a slippery slope real quick.",
                      "score": 1,
                      "created_utc": 1738344017.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8sm2gq",
                  "author": "vikingwhiteguy",
                  "body": "I currently have a 2080 Ti in an Asus Rog Rampage VI mobo, and looking to upgrade this year. What series card would I get the most out of with my current motherboard? I get super confused working out what I can or should upgrade to",
                  "score": 2,
                  "created_utc": 1737666639.0,
                  "replies": [
                    {
                      "id": "m8spf5w",
                      "author": "bunkSauce",
                      "body": "You should probably upgrade your mobo before moving to anything above 30xx. But your gpu will move to whatever build you make, so go ahead and update how you want, and if you feel bottlenecks by your CPU or PCIE, upgrade the mobo and cpu.",
                      "score": 2,
                      "created_utc": 1737667545.0,
                      "replies": []
                    },
                    {
                      "id": "m8t2cjr",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 2,
                      "created_utc": 1737671125.0,
                      "replies": [
                        {
                          "id": "m8xvjls",
                          "author": "bunkSauce",
                          "body": "30% increased raster at 4k.\n\nThe \"only adds fake frames\" talking point is BS.\n\nBut there's no reason to upgrade your 3060ti if you dont feel bottlenecked by your GPU ever.",
                          "score": 1,
                          "created_utc": 1737738620.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8wuy98",
                  "author": "R1ddl3",
                  "body": "30xx to 40xx was a big performance boost, not just 20%.\n\n\nI'd say whether it's a waste of money depends entirely on what resolution and framerate you're targeting.",
                  "score": 1,
                  "created_utc": 1737728004.0,
                  "replies": [
                    {
                      "id": "m8xvyem",
                      "author": "bunkSauce",
                      "body": "4090 to 5090 is not 20% gain, it's 28% gain.\n\n30xx to 40xx is generally around 30%.\n\n20xx to 40xx is generally around 40%.",
                      "score": 1,
                      "created_utc": 1737738734.0,
                      "replies": [
                        {
                          "id": "m8xxb8k",
                          "author": "R1ddl3",
                          "body": "I said 20% because that was the number you used at the end of your comment. Also though it really depends on the specific card. 3090 to 4090 was a lot more than 30%.",
                          "score": 1,
                          "created_utc": 1737739108.0,
                          "replies": [
                            {
                              "id": "m8xxvki",
                              "author": "bunkSauce",
                              "body": "Yeah, I wasn't being specific and thought you were downplaying this gen like everyone else is. We have some trusted numbers now, and that's where the 4k raster performance gain of 28% came from.",
                              "score": 1,
                              "created_utc": 1737739262.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8rgo4z",
              "author": "SpamingComet",
              "body": "On the flip side I also have a 3080 and it seems wildly worth it. Even without the AI the 5090 gets more than double the performance, introducing the AI features that will only get better with time is the cherry on top",
              "score": 3,
              "created_utc": 1737655334.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8td5n3",
          "author": "MorgrainX",
          "body": "Direct Storage is still only available in like 5 games, years after it has been announced. \n\nI'm pretty sure that we will get a new generation before the API gets used in games.",
          "score": 7,
          "created_utc": 1737674335.0,
          "replies": []
        },
        {
          "id": "m8renwy",
          "author": "CamiloArturo",
          "body": "Seems in someway like the first phones with internet (Nokia 9000 or6820 or some Sony Ericsson’s) which had this future potential when “the net was going on mobiles” and by the time it did they were absolutely obsolete.",
          "score": 3,
          "created_utc": 1737654798.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8qztqj",
      "author": "compound-interest",
      "body": "This article includes AI in the title, but has shockingly no AI or local LLM benchmarks. I get it’s because it’s part of the commentary but I expected that part of the evaluation considering the title.",
      "score": 68,
      "created_utc": 1737650739.0,
      "replies": [
        {
          "id": "m8ssxvt",
          "author": "c94jk",
          "body": "DLSS is AI",
          "score": 3,
          "created_utc": 1737668504.0,
          "replies": [
            {
              "id": "m8tds8a",
              "author": "TherapyPsychonaut",
              "body": "You know that isn't what they mean",
              "score": 26,
              "created_utc": 1737674530.0,
              "replies": [
                {
                  "id": "m8unvhy",
                  "author": "TheLost2ndLt",
                  "body": "Huh? AI use in these cards in a pretty big point of contention.\n\nWhy do people on Reddit this everything is evil.",
                  "score": 1,
                  "created_utc": 1737690015.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8qmkmb",
      "author": "devnullopinions",
      "body": "It’s not AI “excess” with only 32GB of vram. You can’t even run the largest open weight models with that lol.",
      "score": 54,
      "created_utc": 1737647025.0,
      "replies": [
        {
          "id": "m8rrx5r",
          "author": "AzorAhai1TK",
          "body": "You can't even run the largest open weight models with an H100 lol.",
          "score": 28,
          "created_utc": 1737658407.0,
          "replies": [
            {
              "id": "m8s44mw",
              "author": "PacketAuditor",
              "body": "Just get a GB200, what are you poor?",
              "score": 15,
              "created_utc": 1737661717.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8qj83l",
      "author": "Hattuherra",
      "body": "Price in Finland 2700 - 3000 dollars... I make 3-5x less than in similar positions in USA.",
      "score": 36,
      "created_utc": 1737646041.0,
      "replies": [
        {
          "id": "m8raqvv",
          "author": "xElMerYx",
          "body": "Real question: what percentage of the money you make ends up as disposable income in comparison to an American in a equivalent salary decile?",
          "score": 13,
          "created_utc": 1737653740.0,
          "replies": [
            {
              "id": "m8rdqey",
              "author": "Hattuherra",
              "body": "I get to keep a bit over half. After that we pay 25.5% VAT for almost everything we buy. Also we pay 30-34% of tax on investments after the first 1000€ profit. We have a mandatory pension payments of around 25% of the total salary the company pays us.\n\nWe don't actually own our pension investments, they are lost if the pensioner dies and can't be passed down as inheritance. Also the return of investments to our pension funds are terrible, self investing would make everyone in finland a millionaire when they would retire, but now we get scraps. Currently my projected pension age is almost 70 years and that will be raised most certainly.",
              "score": 13,
              "created_utc": 1737654549.0,
              "replies": [
                {
                  "id": "m8s6rp0",
                  "author": "None",
                  "body": "I could stand everything but the age of retirement... that's just sad. Are there no tax deferred or advantaged accounts you can open in Finland?",
                  "score": 3,
                  "created_utc": 1737662437.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8wv8jt",
              "author": "R1ddl3",
              "body": "Likely a lot less. Disposable incomes in the US are among the highest in the world.",
              "score": 3,
              "created_utc": 1737728099.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8qbfbr",
      "author": "theantig",
      "body": "I wonder if this will turn out like Apple AI where it doesn’t really drive the market. People just always tend to jump on the upgrade graphics card train though so I’m talking more long-term than short term.",
      "score": 27,
      "created_utc": 1737643674.0,
      "replies": [
        {
          "id": "m8qcwd5",
          "author": "imaginary_num6er",
          "body": "Yeah but Apple AI will initiate a \"super cycle\" /s",
          "score": 5,
          "created_utc": 1737644129.0,
          "replies": [
            {
              "id": "m8qdeat",
              "author": "Adeptius",
              "body": "What was or is Apple AI?",
              "score": 2,
              "created_utc": 1737644283.0,
              "replies": [
                {
                  "id": "m8qf1mm",
                  "author": "SkollFenrirson",
                  "body": "Newest method to extract money from the cult.",
                  "score": 8,
                  "created_utc": 1737644786.0,
                  "replies": [
                    {
                      "id": "m8qgjp9",
                      "author": "Adeptius",
                      "body": "That makes sense.",
                      "score": 6,
                      "created_utc": 1737645241.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8qazk9",
      "author": "NotAPreppie",
      "body": "If I were in the market for an expensive product with all of these features, I'd have to seriously reflect on why that was the case.\n\nEdit: man, a bunch of you are really butthurt that I don't want this product. I didn't say anything about anybody but myself. If you want to apply that to yourself, that's your choice, but don't mad at me about it.",
      "score": 94,
      "created_utc": 1737643536.0,
      "replies": [
        {
          "id": "m8qccrq",
          "author": "Squery7",
          "body": "Infinite money and gaming Is your hobby? Or you need it for work idk. 4090 was like 1% of steam cards so many people will easily be able to buy this as well.",
          "score": 59,
          "created_utc": 1737643962.0,
          "replies": [
            {
              "id": "m8qvzad",
              "author": "newly_me",
              "body": "If its your main hobby, to me it always seems 'reasonable', to the same extent spending thousands on any other hobby is. ​Always happy for someone getting something they love, even if its some excess, its one of the rewards of work. Will stick to my xtx (as if it'll be possible to get 90s on launch anyway), but like you said, i get why people do it. Shit, it's a lot cheaper than a ton of my friends hobbies to be honest. Cars, golf, travel,scuba, jet skis, etc. dwarf pc gaming in cost. Do what makes you happy is my philosophy, not one to judge if you're not hurting anyone.",
              "score": 15,
              "created_utc": 1737649685.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8qdnfj",
          "author": "JMPopaleetus",
          "body": "Some of us simply enjoy PC hardware as a hobby.\n\nI could ask the same to anyone who wastes thousands on performance car mods.",
          "score": 36,
          "created_utc": 1737644360.0,
          "replies": [
            {
              "id": "m8qeaau",
              "author": "JeffTek",
              "body": "Yeah there comes a point in life where spending big on your single hobby just isn't a big deal. I'm not a 5090 spender but I could be, wouldn't be a huge deal in the end. I've thought about looking into used 4090s possibly.\n\nPeople spend so much on car mods, home audio systems, pools/hotbtubs, jet skis, whatever. But nooo if a tech hobby person wants to build a PC that's just unacceptable? I don't get it.",
              "score": 39,
              "created_utc": 1737644553.0,
              "replies": [
                {
                  "id": "m8qqlbx",
                  "author": "PmMe_Your_Perky_Nips",
                  "body": "I don't think it would normally be seen as unacceptable. But there was a massive price spike at the start of COVID that people still can't justify, and prices are still rising at unbelievable rates. We spent over a decade with enthusiast GPUs sitting between $400 and $500. Then they suddenly spiked to $1500 and beyond. If the price for a component in any hobby tripled there'd be long standing backlash from the community.",
                  "score": 15,
                  "created_utc": 1737648168.0,
                  "replies": []
                },
                {
                  "id": "m8rp58h",
                  "author": "lapeni",
                  "body": "No, there are haters in all of those categories too. It’s not exclusive to computer components",
                  "score": 2,
                  "created_utc": 1737657660.0,
                  "replies": []
                },
                {
                  "id": "m8s7zgz",
                  "author": "Freya_gleamingstar",
                  "body": "Wanna buy my used 4090 if I upgrade? :)",
                  "score": 2,
                  "created_utc": 1737662775.0,
                  "replies": []
                },
                {
                  "id": "m8quqqh",
                  "author": "CryptikTwo",
                  "body": "A gpu is outpaced in 2years, often less. The new set of rims for your Beamer or the new pool that’s just added value to your home aren’t entirely comparable.\n\nEdit: just to be clear I don’t care what you spend your money on, buy whatever makes you happy. This is simply my opinion on my building habits and why I don’t by a 90 tier card every couple years.",
                  "score": -1,
                  "created_utc": 1737649344.0,
                  "replies": [
                    {
                      "id": "m8rt7zg",
                      "author": "Borghal",
                      "body": "If you compare values... car value drops far quicker than PCs.",
                      "score": 2,
                      "created_utc": 1737658758.0,
                      "replies": []
                    },
                    {
                      "id": "m8qwzqp",
                      "author": "JeffTek",
                      "body": "Zzzzzzz go judge people somewhere else",
                      "score": 1,
                      "created_utc": 1737649965.0,
                      "replies": [
                        {
                          "id": "m8qy45t",
                          "author": "CryptikTwo",
                          "body": "Wait what, who am I judging?",
                          "score": 0,
                          "created_utc": 1737650278.0,
                          "replies": [
                            {
                              "id": "m8qyu0g",
                              "author": "JeffTek",
                              "body": "Sorry just seemed like you were defending the people who try to shame PC enthusiasts for spending money on their hobby.",
                              "score": 2,
                              "created_utc": 1737650471.0,
                              "replies": [
                                {
                                  "id": "m8qzb3r",
                                  "author": "CryptikTwo",
                                  "body": "I am one of those pc enthusiasts lol. But I wouldn’t spend what I do on my car on my pc knowing how quickly better stuff is released.",
                                  "score": 3,
                                  "created_utc": 1737650599.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m8wdiir",
                      "author": "Grimreap32",
                      "body": "> A gpu is outpaced in 2years, often less. The new set of rims for your Beamer or the new pool that’s just added value to your home aren’t entirely comparable.\n\nDefinitely not. The 90's pull their weight and then some for many years. Even an old 2080ti is still capable of running games at medium/high.\n\n\n\nThe fact is graphically we haven't seen the same leaps and bounds we were seeing 10 years ago. We're seeing more niche improvements. Lighting, shadows & reflections.",
                      "score": 0,
                      "created_utc": 1737721463.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8qj8uq",
              "author": "notmoleliza",
              "body": "My main hobby/sport is cycling.  I dont need a new bike. I have several.  But if i did...my lord...prices of bikes and parts are outrageous now.",
              "score": 9,
              "created_utc": 1737646047.0,
              "replies": [
                {
                  "id": "m8qkdhc",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 5,
                  "created_utc": 1737646381.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8qhwwf",
              "author": "Asilva1516",
              "body": "What if you do both😓",
              "score": 3,
              "created_utc": 1737645651.0,
              "replies": []
            },
            {
              "id": "m8qp1o1",
              "author": "bsmithi",
              "body": "yeah there's also people that spend magnitudes more on guns that they will never use",
              "score": 5,
              "created_utc": 1737647729.0,
              "replies": []
            },
            {
              "id": "m8qf1j5",
              "author": "spewing-oil",
              "body": "Pretty good comparison. A fast car likely already has a turbo. But if you want to go faster expect to pay $2000+ upgrading the turbo.",
              "score": 5,
              "created_utc": 1737644785.0,
              "replies": [
                {
                  "id": "m8qfn1x",
                  "author": "JMPopaleetus",
                  "body": "My point was moreso that people have their hobbies.\n\nIf spending $2000 on a 5090 to play Microsoft Excel all day brings me joy, why should others care?",
                  "score": 16,
                  "created_utc": 1737644966.0,
                  "replies": [
                    {
                      "id": "m8shst1",
                      "author": "HanzanPheet",
                      "body": "One reason could be you are driving demand for a product unnecessarily making NVIDIA more prone to continuing to go in the direction it's going? I don't know how the GPU markets work so it's just a guess. \nI don't really care people blow their money on stupid shit everyday. ",
                      "score": -1,
                      "created_utc": 1737665487.0,
                      "replies": [
                        {
                          "id": "m8siv2h",
                          "author": "JMPopaleetus",
                          "body": "My purchase is not influencing Nvidia. \n\nCrypto farms (formerly) and compute farms (currently) are.",
                          "score": 1,
                          "created_utc": 1737665773.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m8qns7a",
                      "author": "secrestmr87",
                      "body": "Well you would be a special kind of idiot to buy a 5090 to play excel since it would provide 0 benefits. So you should rightfully be shamed. That would be like buying a turbo for your car to drive it 20 MPH.",
                      "score": -13,
                      "created_utc": 1737647368.0,
                      "replies": [
                        {
                          "id": "m8qo56w",
                          "author": "JMPopaleetus",
                          "body": "Okay guy asking /r/WallStreetBets how to yolo $10k.  It seems hyperbole isn’t your strong suit.",
                          "score": 16,
                          "created_utc": 1737647472.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8shnp0",
              "author": "dr_wheel",
              "body": "As someone who spent a lot of money on performance car mods when I was younger, let me be the first one to say I wish I had all of that fucking money back now.",
              "score": 3,
              "created_utc": 1737665448.0,
              "replies": []
            },
            {
              "id": "m8qq80f",
              "author": "NotAPreppie",
              "body": "I enjoy PC hardware as a hobby but I find this to be ridiculous.",
              "score": -1,
              "created_utc": 1737648061.0,
              "replies": [
                {
                  "id": "m8qqrb6",
                  "author": "JMPopaleetus",
                  "body": "Cool. You don’t have to buy it. \n\nThat’s what’s neat about hobbies and free willl.",
                  "score": 2,
                  "created_utc": 1737648215.0,
                  "replies": [
                    {
                      "id": "m8qr9a6",
                      "author": "NotAPreppie",
                      "body": "So, you do realize you just paraphrased what I typed in my original comment, right?",
                      "score": -3,
                      "created_utc": 1737648358.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8qzcki",
          "author": "Offduty_shill",
          "body": "1) some people have a lot of disposable income\n\n2) some people are very into PC hardware as a hobby\n\n3) some people are AI hobbiests/need it for work\n\nI don't get why every time something's expensive and you're not in the intended audience, reddit needs to shriek and and get upset at its existence. yeah, you don't need it or want it, so don't buy it. buy a cheaper card that does everything you need lol",
          "score": 6,
          "created_utc": 1737650610.0,
          "replies": []
        },
        {
          "id": "m8qf5xb",
          "author": "obiwanshinobi87",
          "body": "Because it’s a hobby that some of us can easily afford?",
          "score": 13,
          "created_utc": 1737644822.0,
          "replies": [
            {
              "id": "m8qqch6",
              "author": "NotAPreppie",
              "body": "This hobby shouldn't require dropping $2k on a single component.",
              "score": -17,
              "created_utc": 1737648097.0,
              "replies": [
                {
                  "id": "m8qx32d",
                  "author": "Co60",
                  "body": "It doesn't...\n\nA 5090 isn't a requirement for gaming.",
                  "score": 9,
                  "created_utc": 1737649991.0,
                  "replies": [
                    {
                      "id": "m8qxp4i",
                      "author": "NotAPreppie",
                      "body": "Okay, so you agree with me, then?",
                      "score": -7,
                      "created_utc": 1737650162.0,
                      "replies": [
                        {
                          "id": "m8r0ags",
                          "author": "Co60",
                          "body": "I agree with you that it shouldn't be a requirement for gaming. It also isn't a requirement. I don't really care if people want to shell out thousands of dollars for top of the line gear. That's true of pretty much every hobby. Even something as simple as coffee can quickly get you into the thousands of dollars if you insist on the absolute best of everything.",
                          "score": 10,
                          "created_utc": 1737650863.0,
                          "replies": [
                            {
                              "id": "m8r1nuc",
                              "author": "NotAPreppie",
                              "body": "But that's where we're at. \n\nAll I said is that purchasing something like this should be an indicator that I should re-evaluate my motivations and priorities... I never said anything about anybody else.\n\nIf you think I was talking about anybody else, that leap happened entirely within your head.",
                              "score": 2,
                              "created_utc": 1737651233.0,
                              "replies": [
                                {
                                  "id": "m8t19pl",
                                  "author": "TotoCocoAndBeaks",
                                  "body": "Yup, this whole chain basically came from a load of overly defensive people demanding you accept their right to waste cash, but tejecting your right to not waste cash.",
                                  "score": 1,
                                  "created_utc": 1737670813.0,
                                  "replies": []
                                },
                                {
                                  "id": "m8r2ikc",
                                  "author": "Co60",
                                  "body": "Fair enough. Thanks for clarifying.",
                                  "score": 0,
                                  "created_utc": 1737651463.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8qss1k",
                  "author": "atbths",
                  "body": "Good thing its not required.  Plenty of cheaper cards out there.",
                  "score": 15,
                  "created_utc": 1737648793.0,
                  "replies": [
                    {
                      "id": "m8qv80d",
                      "author": "NotAPreppie",
                      "body": "Which brings us back to my original comment.",
                      "score": -4,
                      "created_utc": 1737649477.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8qu0jv",
                  "author": "obiwanshinobi87",
                  "body": "Who held a gun to your head and said you needed to game at 4K with max settings? Nothing about this hobby “requires” anything. $2K or $2, it’s a choice to partake or not.",
                  "score": 13,
                  "created_utc": 1737649142.0,
                  "replies": [
                    {
                      "id": "m8zujdd",
                      "author": "fmaz008",
                      "body": "I so want to see a benchmark video about a 2$ gpu. It would be incredibly entertaining.",
                      "score": 1,
                      "created_utc": 1737758728.0,
                      "replies": []
                    },
                    {
                      "id": "m8quvbb",
                      "author": "NotAPreppie",
                      "body": "Okay.",
                      "score": -5,
                      "created_utc": 1737649379.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8rax7a",
                  "author": "PainterRude1394",
                  "body": "How dare other people have more money than you and want this card!",
                  "score": 2,
                  "created_utc": 1737653788.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8qnuum",
          "author": "neversummer427",
          "body": "I’m a 3D artist. I’m excited about the performance boost. I guess I should go reflect on why I want to spend less time rendering.",
          "score": 13,
          "created_utc": 1737647389.0,
          "replies": [
            {
              "id": "m8r6ndo",
              "author": "TheDubiousSalmon",
              "body": "Waiting for scenes to finish rendering builds character",
              "score": 5,
              "created_utc": 1737652606.0,
              "replies": [
                {
                  "id": "m8rg7b7",
                  "author": "neversummer427",
                  "body": "I put in my character building render time. Give me speed so I can have a work life balance.",
                  "score": 3,
                  "created_utc": 1737655208.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8sg8r4",
          "author": "ASpiralKnight",
          "body": "Just in case a game comes out one day worth playing.",
          "score": 2,
          "created_utc": 1737665062.0,
          "replies": []
        },
        {
          "id": "m8qi8el",
          "author": "JetKeel",
          "body": "Companies are bending over backwards to develop AI, and yet none of them have come out with something that actually represents a product the general consumer will want to pay for.",
          "score": 4,
          "created_utc": 1737645748.0,
          "replies": [
            {
              "id": "m8qoyuo",
              "author": "Pure-Specialist",
              "body": "AI is not meant for the  general consumer. It's meant to replace the general consumers jobs. They don't care about the average consumer..the real money is enterprise data centers and government contracts",
              "score": 2,
              "created_utc": 1737647706.0,
              "replies": [
                {
                  "id": "m8reav6",
                  "author": "JetKeel",
                  "body": "That’s a primary driver, but when they are still trying to up charge products because they are “AI enabled” they are definitely trying to find a consumer market.",
                  "score": 1,
                  "created_utc": 1737654701.0,
                  "replies": []
                },
                {
                  "id": "m8utk9w",
                  "author": "MadeByHideoForHideo",
                  "body": "Wait till they find out that the employees they so desperately want to cut don't have money to buy their products anymore, lol. Doesn't take a genius to figure that out.",
                  "score": 1,
                  "created_utc": 1737692085.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8qs2nn",
          "author": "mashuto",
          "body": "Do you not have any hobbies that you spend too much money on that other people wouldnt understand? Thats why. Just because you might think this is a waste doesnt mean that everyone else would feel the same.",
          "score": 4,
          "created_utc": 1737648593.0,
          "replies": []
        },
        {
          "id": "m8qp7f4",
          "author": "Stargate_1",
          "body": "I just enjoy gaming, nothing wrong with that",
          "score": 4,
          "created_utc": 1737647773.0,
          "replies": [
            {
              "id": "m8qr350",
              "author": "NotAPreppie",
              "body": "You don't need to drop $2k on a single component to enjoy gaming.",
              "score": 0,
              "created_utc": 1737648310.0,
              "replies": [
                {
                  "id": "m8qslex",
                  "author": "Stargate_1",
                  "body": "Ok but if I can, where is the problem? I'm financially repsonsible, make my own money, what's the issue here?",
                  "score": 10,
                  "created_utc": 1737648740.0,
                  "replies": [
                    {
                      "id": "m8qv0au",
                      "author": "NotAPreppie",
                      "body": "I would argue that dropping $2k on a single component isn't financially responsible, even if you can afford it.",
                      "score": -12,
                      "created_utc": 1737649417.0,
                      "replies": [
                        {
                          "id": "m8r0dny",
                          "author": "Offduty_shill",
                          "body": "I think some people just make a lot more money or have less other expenditures than you do lol\n\nnot really your business to judge anyone else's financial responsibility",
                          "score": 6,
                          "created_utc": 1737650887.0,
                          "replies": []
                        },
                        {
                          "id": "m8qwmaz",
                          "author": "Stargate_1",
                          "body": "??????? by what merit ?????????\n\nI work, and exchange my skill and time for money. Am I supposed to just hoard it? Should I never have bought any Magic cards? Sure, individual boxes were only 200 or 300 Euros, but I've bought over 2k in Magic Cards over the years. Why is it acceptable to spend 2k over the course of 2-3 years, but not 2k at once?\n\n  \n\\>I would argue that dropping $2k on a single component isn't financially responsible, even if you can afford it.\n\nSo if I am saving money, have all bills paid, and still have excess disposable income I just... shouldn't spend it on anything? Wtf? So if I am like my aunt, who worked her way up and is neck-deep in obligations and responsibilities, and earn 100k a year, I'm not allowed to spend even a single cent on myself? I gotta keep it all? Cause that's basically the point ur making. There is no difference between a 2k vacation to New York (I really doubt she only spent 2k there) and me buying a 2k GPU to game with because gaming is my hobby.",
                          "score": 6,
                          "created_utc": 1737649861.0,
                          "replies": [
                            {
                              "id": "m8qxysk",
                              "author": "NotAPreppie",
                              "body": "Okay, so you agree that this is all subjective.\n\nNext we will address the issue that I was only talking about myself. I never said others couldn't do what they wanted. That leap of logic happened entirely within your head.",
                              "score": -7,
                              "created_utc": 1737650237.0,
                              "replies": [
                                {
                                  "id": "m8qycw8",
                                  "author": "Stargate_1",
                                  "body": "\\> I would argue that dropping $2k on a single component isn't financially responsible, even if you can afford it.\n\nBut that is you expanding your opinion to others, with no reason behind it. It's saying \"one shouldn't spend 2k on a single part\" but gives no explanation for why.",
                                  "score": 11,
                                  "created_utc": 1737650343.0,
                                  "replies": [
                                    {
                                      "id": "m8r04kt",
                                      "author": "NotAPreppie",
                                      "body": "Right. That's where the subjectivity comes in.\n\nFrom accepting the idea that reasonable people can have different opinions and disagree, we get to the point where I was talking about me, not you.\n\nIf you want to get butthurt that I think dropping $2k on a single unnecessary component isn't financially responsible, I won't even try to stop you. However, you should at least try to understand that this anger you're feeling is a reflection of you.",
                                      "score": -5,
                                      "created_utc": 1737650820.0,
                                      "replies": [
                                        {
                                          "id": "m8si6qr",
                                          "author": "HanzanPheet",
                                          "body": "Yeah that was a wild ride let me tell you. ",
                                          "score": 3,
                                          "created_utc": 1737665591.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8rka8n",
                  "author": "Leopard__Messiah",
                  "body": "That's right! You should spend it on drugs and pussy and sports betting apps like a real man.",
                  "score": 5,
                  "created_utc": 1737656315.0,
                  "replies": [
                    {
                      "id": "m8rpmr1",
                      "author": "NotAPreppie",
                      "body": "I mean, I'm not going to kink shame if that's your thing.",
                      "score": 2,
                      "created_utc": 1737657792.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8qwtf1",
          "author": "TLhecarim",
          "body": "Damn that's crazy anyways I'm looking forward to getting a 5090",
          "score": 4,
          "created_utc": 1737649917.0,
          "replies": []
        },
        {
          "id": "m8qr1ih",
          "author": "Onetimehelper",
          "body": "Because monkey want shiniest trinket. \n\nIt is definitely not just for gaming. It’s about the gear. Same thing happens in the photography hobby, which much more expensive gear. All the dynamic range, low light noise performance, corner to corner sharpness, resolution, bit rate, etc, won’t change the fact that you are taking the same picture. ",
          "score": -1,
          "created_utc": 1737648297.0,
          "replies": [
            {
              "id": "m8wy1is",
              "author": "R1ddl3",
              "body": "You're arguing gear doesnt matter..? So there's no difference in the picture coming out of a Nokia bar phone from 2005 vs ​a modern mirrorless camera, say? It's the same picture?",
              "score": 1,
              "created_utc": 1737729011.0,
              "replies": [
                {
                  "id": "m8y8uys",
                  "author": "Onetimehelper",
                  "body": "Yes. Use the most extreme example. Because that definitely is the difference between what graphics you get from a modern GPU vs top level 5000 series. \n\nAny modern camera from the last 10-15 years can make a decent, even award winning photo. Anyone who’s a photographer can tell you that. Gamers are just finding out what GAS is. But you do you. Upgrading every time to chase the latest specs usually doesn’t lead to an actually better experience. If that makes you mad, not sure what else can be done. ",
                  "score": 1,
                  "created_utc": 1737742298.0,
                  "replies": [
                    {
                      "id": "m8ya48u",
                      "author": "R1ddl3",
                      "body": "Well you seemed to be making the blanket statement that gear doesn't matter with the 'it's the same photo' comment, so yeah an extreme example is where you'd start to disprove that. \n\nThere are absolutely people who play at high resolution and refresh rate who can use as much extra performance as they can get and are seeing a benefit from upgrading every time. But also... it's not like every 5090 buyer is someone who upgrades every time.",
                      "score": 1,
                      "created_utc": 1737742650.0,
                      "replies": [
                        {
                          "id": "m8ybxpt",
                          "author": "Onetimehelper",
                          "body": "No not really unless you want to be argumentative. The deeper point is that the push for gear is ignoring the reason why gear is bought in the first place, the games. \n\nThere are plenty of video essays on the topic of the inflation in video game engine inefficiencies, driven mainly because of these spec heavy, AI heavy GPUs. Where are the games that are actually pushing realism? Even CP 2077 isn’t that visually impressive given the amount of horsepower that was needed to run other visually impressive games a decade ago. Yes the textures are sharper and light can bounce in real time instead of relying on a dev to bake them in. But we haven’t seen a major jump in graphics to warrant the huge jump in power and price of GPUs. It’s like focusing on the camera than the actual subject. But feel free to argue. \n\nJust want an example of what game experience is worth these $1k-$2k GPUs? Can’t think of any. Maybe you can educate me. ",
                          "score": 1,
                          "created_utc": 1737743155.0,
                          "replies": [
                            {
                              "id": "m8yd3c2",
                              "author": "R1ddl3",
                              "body": "Cyberpunk would be my example. I strongly disagree with you that it's not visually impressive. It's not just the textures and the lighting, it's the fact that it's happening on such a massive scale in this incredibly detailed city with no loading screens where you can have many things happening on screen at once. There were no games a decade ago that were doing anything on that scale.",
                              "score": 1,
                              "created_utc": 1737743475.0,
                              "replies": [
                                {
                                  "id": "m8yf93i",
                                  "author": "Onetimehelper",
                                  "body": "The cars still become 2d billboards in a visible distance away. NPCs are just vomited up in large batches with no clear scheduling at all. Cars have no pattern and go no where. \n\nIt isn’t rendering that far. It’s just made to look that way. Again many videos on YouTube pointing this out. It’s an amazing looking game but the energy spend rendering it is not what you think it’s being spent on. \n\nGTA V is more advanced than it. Increase textures, use more high polygon models and for lighting, everything baked in as much as possible and you’d have a better looking, better composed game, that will probably run much better. Unfortunately no incentive for that type of game exists because everyone is focused on how many rays and AI frames are being pushed. \n\nCyberpunk is a great story game, but it’s not that great a technical achievement, even with the patches. We can agree to disagree. ",
                                  "score": 1,
                                  "created_utc": 1737744076.0,
                                  "replies": [
                                    {
                                      "id": "m8ygmyj",
                                      "author": "R1ddl3",
                                      "body": "I mean you say that, yet in what other games are there similar amounts of stuff being rendered at once? Go into the densest part of night city and clearly there is a ton of stuff being fully rendered. I don't know of any similar games. Certainly not GTA V. In what way is GTA V more advanced?\n\nI have no problem with RT being a focus, by the way. It significantly contributes to the atmosphere in Cyberpunk.",
                                      "score": 1,
                                      "created_utc": 1737744460.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8r65i4",
      "author": "maniacreturns",
      "body": "So I can just have the AI design me a game to play",
      "score": 5,
      "created_utc": 1737652468.0,
      "replies": [
        {
          "id": "m8ul2qc",
          "author": "intoned",
          "body": "Hehe, the best the current LLMs can do right now is the game snake. If it’s been trained specifically to pass this benchmark.",
          "score": 1,
          "created_utc": 1737689026.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8qhkm4",
      "author": "beleidigtewurst",
      "body": "Yeah, $2000, sure John...\n\nOr did you mean 5080?\n\nhttps://videocardz.com/newz/custom-geforce-rtx-5080-and-rtx-5090-pricing-emerges-made-for-gamers-with-deep-pockets",
      "score": 28,
      "created_utc": 1737645548.0,
      "replies": [
        {
          "id": "m8qu5jz",
          "author": "Peter_La_Fleur_",
          "body": "That link is showing prices in CAD. Conversion to USD is x0.7 right now so the prices would be around $1200-1300 USD for the 5080, if the referenced prices are correct.",
          "score": 22,
          "created_utc": 1737649182.0,
          "replies": [
            {
              "id": "m8rztfl",
              "author": "beleidigtewurst",
              "body": "Yeah. \"Only\" $1300 for a card with MSRP of $999. \n\n#NothingToSeeHere",
              "score": 5,
              "created_utc": 1737660550.0,
              "replies": [
                {
                  "id": "m8ssq8g",
                  "author": "Eve_newbie",
                  "body": "Not defending them at all, but haven't cards always been more than the MSRP of the founders edition? I'm an AMD Andy so I'm probably talking out my ass",
                  "score": 3,
                  "created_utc": 1737668446.0,
                  "replies": [
                    {
                      "id": "m8wvir2",
                      "author": "beleidigtewurst",
                      "body": "The first card witih \"MSRP discrepancy\" was 2080Ti. That was \"somehow\" always $200+ more.\n\nAnd then, suddenly, on one of the Filthy Green's presentation, the $1200 MSRP was actually admitted.",
                      "score": 1,
                      "created_utc": 1737728193.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8qiyd5",
      "author": "positivcheg",
      "body": "Oh, review embargo lifted. So now we will see the shitshow.",
      "score": 21,
      "created_utc": 1737645962.0,
      "replies": [
        {
          "id": "m8qn1is",
          "author": "PabloBablo",
          "body": "Well, at least you are going into it with an open mind.",
          "score": 19,
          "created_utc": 1737647159.0,
          "replies": []
        },
        {
          "id": "m8qxcsg",
          "author": "hyrumwhite",
          "body": "It’s a 4090ti with series locked features",
          "score": 20,
          "created_utc": 1737650066.0,
          "replies": [
            {
              "id": "m8rbhri",
              "author": "cronoes",
              "body": "If Moore's law wasnt dead before...\n\nThe gains that we can expect to see are going to be at the mid level anyway.  There is an opportunity for the $500 segment to really catch up in value - but that seems to b e where AMD is putting its resources in with RDNA4.  Not nvidia, which seems to be ceding that segment away.",
              "score": 3,
              "created_utc": 1737653944.0,
              "replies": []
            },
            {
              "id": "m8rb72n",
              "author": "PainterRude1394",
              "body": "People who have no clue what they are saying just making up stuff lol",
              "score": -3,
              "created_utc": 1737653863.0,
              "replies": [
                {
                  "id": "m8resd3",
                  "author": "hyrumwhite",
                  "body": "Same node, no efficiency gains, they threw more power and more/new ram at a 4090. \n\nNeat what it can do, though. ",
                  "score": 8,
                  "created_utc": 1737654832.0,
                  "replies": [
                    {
                      "id": "m8rt3ff",
                      "author": "PainterRude1394",
                      "body": "That's not what happened at all lol. Thank you for exemplifying my point about people having no clue what they are talking about making things up.",
                      "score": -2,
                      "created_utc": 1737658724.0,
                      "replies": [
                        {
                          "id": "m8rtghn",
                          "author": "hyrumwhite",
                          "body": "My pleasure ",
                          "score": 2,
                          "created_utc": 1737658821.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8s1j7h",
          "author": "JefferyTheQuaxly",
          "body": "i mean really just same things ive been seeing, very modest performance upgrade (mostly based off how many extra cores they added) that is mostly just for the enthusiasts who look to own the best on the market.  dont really see anything surprising coming out of the reviews that wasnt already generally known or assumed.",
          "score": 1,
          "created_utc": 1737661015.0,
          "replies": [
            {
              "id": "m8s5odj",
              "author": "positivcheg",
              "body": "Yeah. 5090 gives some improvement but idk, it will cost like 4k$. And 5080 is shitty improvement over  4080.",
              "score": 1,
              "created_utc": 1737662137.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8qw0f9",
      "author": "TheSto1989",
      "body": "My 3090 died an unexpected death recently. I don’t even need a 5090 but I’ll whatever I’m able to buy with this new gen as a replacement. 5080 seems fine though.",
      "score": 6,
      "created_utc": 1737649693.0,
      "replies": [
        {
          "id": "m8we0m5",
          "author": "Grimreap32",
          "body": "On paper, it seems fine, we haven't seen reviews for it yet.",
          "score": 2,
          "created_utc": 1737721685.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8qwv3l",
      "author": "badger906",
      "body": "Its AI capabilities compared to the 4090 aren’t even that amazing.",
      "score": 9,
      "created_utc": 1737649930.0,
      "replies": [
        {
          "id": "m8smqyy",
          "author": "Plebius-Maximus",
          "body": "32GB Vram instead of 24 is significant. Performance in terms of speed etc isn't a mind blowing uplift, but the 50% more vram opens doors that a 4090 couldn't",
          "score": 10,
          "created_utc": 1737666822.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8u7gjm",
      "author": "runnybumm",
      "body": "*4090ti",
      "score": 3,
      "created_utc": 1737684011.0,
      "replies": []
    },
    {
      "id": "m8ssqpr",
      "author": "Auran82",
      "body": "I feel like games nowadays are just not optimized as well as they used to be when they had to do all kinds of coding magic to get things to run on the more limited hardware we used to have. Cards can just brute force more to get reasonable frame rates, now with frame generation to help.\n\nEspecially with the options included in higher settings like ultra, I used to hear people say all the time that those settings were for the future, not intended to be used yet, waiting for more powerful hardware etc. In my experience, so many of those settings do stuff all for image quality and just tank performance for very little benefit, but give hardware reviewers something to point to as a comparison between cards.",
      "score": 4,
      "created_utc": 1737668449.0,
      "replies": []
    },
    {
      "id": "m8wc58z",
      "author": "Valuable-Tomatillo76",
      "body": "Um did they really say 4090 had 1 fan?… “NVIDIA also added another cooling fan this time around, instead of just relying on a vapor chamber and a single fan.”\n\nStopped reading.",
      "score": 2,
      "created_utc": 1737720841.0,
      "replies": []
    },
    {
      "id": "m90w9jm",
      "author": "Turkino",
      "body": "It's really a 4090TI",
      "score": 2,
      "created_utc": 1737771152.0,
      "replies": []
    },
    {
      "id": "m91ehok",
      "author": "Thundercats_Hoooo",
      "body": "Really unimpressed. A definite skip for me.",
      "score": 2,
      "created_utc": 1737777927.0,
      "replies": []
    },
    {
      "id": "m91ln37",
      "author": "None",
      "body": "AI huh? Something I REALLY DON\"T WANT. Looking forward to picking up a 4090 on Ebay when the cool kids waste a bundle on these.",
      "score": 2,
      "created_utc": 1737780969.0,
      "replies": []
    },
    {
      "id": "m8r2ipl",
      "author": "tofuchrispy",
      "body": "These are now cheap ai workstation cards. Not just gaming cards only …",
      "score": 4,
      "created_utc": 1737651464.0,
      "replies": []
    },
    {
      "id": "m8qqkd2",
      "author": "Onetimehelper",
      "body": "Makes this kinda of like a first gen product then. Minimal gains in actual raster and huge gains in AI focused tasks. If that’s the direction rendering is heading towards might as well see what they cook up next gen, instead of this stop gap generation. ",
      "score": 4,
      "created_utc": 1737648160.0,
      "replies": [
        {
          "id": "m8r5fg0",
          "author": "Jokong",
          "body": "With the rate AI is going maybe we'll see people running their own local ai on this. I kind of like the idea of not sharing my data and having a me focused ai if this card can do that.",
          "score": 3,
          "created_utc": 1737652267.0,
          "replies": [
            {
              "id": "m8rj1rz",
              "author": "Onetimehelper",
              "body": "For some that is worth the $2000 alone. If I could have a local AI that can use local documents and come up with advanced concise summaries or answers to questions based on my reference documents, I’d be all over this, if there’s a practical difference between it and the 4 series GPU. \n\nI don’t care for AI video and picture generation. But many do. ",
              "score": 1,
              "created_utc": 1737655983.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8rhp1j",
          "author": "SpamingComet",
          "body": "Raster gains anywhere from 25-33%. If that’s “minimal” to you then everything about GPU’s is way over your head",
          "score": 1,
          "created_utc": 1737655615.0,
          "replies": [
            {
              "id": "m8rih7w",
              "author": "Onetimehelper",
              "body": "Yeah and 25% more power usage, and 50% more expensive. If there was no power limit to the 4090 and you can cool it well, you’d get the same thing. Instead of trying to insult people, actually learn what’s going on. The only real gain is in AI processing. ",
              "score": 0,
              "created_utc": 1737655828.0,
              "replies": [
                {
                  "id": "m8rkc9b",
                  "author": "Nobody_Important",
                  "body": "It’s 25% more expensive and that’s independent of inflation.",
                  "score": 5,
                  "created_utc": 1737656330.0,
                  "replies": [
                    {
                      "id": "m8rsgij",
                      "author": "AzorAhai1TK",
                      "body": "How are you getting downvoted for correcting people spouting ridiculously incorrect numbers lmao",
                      "score": 5,
                      "created_utc": 1737658552.0,
                      "replies": [
                        {
                          "id": "m8rzbk4",
                          "author": "SpamingComet",
                          "body": "It’s a 5090 hate train, you either get on or get downvoted lmao",
                          "score": 4,
                          "created_utc": 1737660416.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8rzsz2",
                  "author": "SpamingComet",
                  "body": "50% more expensive than what? And no, you can push more power into the 4090 but you definitely do not get the same thing. There’s quite literally more GPU in the 5090. More of every component. Instead of trying to correct people and making a fool of yourself, why not actually learn what’s going on? Reading above a 5th grade level would be a good start",
                  "score": 0,
                  "created_utc": 1737660547.0,
                  "replies": [
                    {
                      "id": "m8siojk",
                      "author": "Onetimehelper",
                      "body": "![gif](giphy|GCvktC0KFy9l6)",
                      "score": -6,
                      "created_utc": 1737665725.0,
                      "replies": [
                        {
                          "id": "m8sy9e1",
                          "author": "SpamingComet",
                          "body": "Lmao got called out for your bullshit and that’s all you have in response? Pathetic",
                          "score": -1,
                          "created_utc": 1737669952.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8s3g5t",
          "author": "JefferyTheQuaxly",
          "body": "eh i dont think i can wait much longer, with my 2080 TI i already struggle hitting high FPS on 1440p with high uality graphics, which is generally what i prefer playing on.  might as well try getting this one now and waiting another 10 years to see what crazi AI advancements they bring in the meantime.\n\nplus it seems they do want to try bringing new software advancements to there older cards so even if they do keep working on software and AI improvements, a lot of it might end up coming to these cards anyways.",
          "score": 1,
          "created_utc": 1737661533.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8ra15u",
      "author": "Snowman-",
      "body": "Nvidia should create their own game engine to compete with Unreal 5 with much better performance so there's an alternative...",
      "score": 2,
      "created_utc": 1737653544.0,
      "replies": []
    },
    {
      "id": "m8tib0y",
      "author": "Funkrusher_Plus",
      "body": "What exactly are you paying $2k for? Slightly better graphics than the last greatest graphics card? A few more hair strands of detail? Slightly better shadows? This all seems kind of silly.",
      "score": 2,
      "created_utc": 1737675956.0,
      "replies": [
        {
          "id": "m8ump22",
          "author": "rasz_pl",
          "body": "Mostly for fake AI frame generation.",
          "score": 4,
          "created_utc": 1737689601.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8qrj05",
      "author": "MateTheNate",
      "body": "The DX12 and Ray Tracing gains look solid",
      "score": 1,
      "created_utc": 1737648436.0,
      "replies": []
    },
    {
      "id": "m8t8ze3",
      "author": "RichieNRich",
      "body": "I have the 3090 - am I correct in my reading the specs for the 5090 that it will be 3x faster? I'm a DCC creator (3D animation, etc).",
      "score": 1,
      "created_utc": 1737673063.0,
      "replies": [
        {
          "id": "m8vfpk3",
          "author": "Asunen",
          "body": "TL;DR it’s going to be 9 to 10% faster in actual processing , the crazy gains come from new technology that is using AI to generate several frames at a time as a sort of buffer between the rendered frames.",
          "score": -2,
          "created_utc": 1737702116.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8tnuii",
      "author": "Sammoonryong",
      "body": "its 2k$ before tax and before the awaited tariffs right? so its like 3-4k? depending on where you live?\n\nlmao\n\nBought my 4090 for 850€. I am good for the next years.",
      "score": 1,
      "created_utc": 1737677693.0,
      "replies": []
    },
    {
      "id": "m8whsqs",
      "author": "sun_cardinal",
      "body": "I’m literally only getting the 5090 for AI.",
      "score": 1,
      "created_utc": 1737723273.0,
      "replies": []
    },
    {
      "id": "m8x3x65",
      "author": "Maxpowerxp",
      "body": "4060 is enough.",
      "score": 1,
      "created_utc": 1737730843.0,
      "replies": []
    },
    {
      "id": "m908cfw",
      "author": "Spirited_Example_341",
      "body": "lol cons\n\n\"Why is it so expensive\"\n\nlol",
      "score": 1,
      "created_utc": 1737763083.0,
      "replies": []
    },
    {
      "id": "m90pobl",
      "author": "rabouilethefirst",
      "body": "Getting roasted, just like your computer case when you put a 5090 inside of it.",
      "score": 1,
      "created_utc": 1737768867.0,
      "replies": []
    },
    {
      "id": "m9710we",
      "author": "Mycatspiss",
      "body": "No. RDNA",
      "score": 1,
      "created_utc": 1737855864.0,
      "replies": []
    },
    {
      "id": "m99zv0v",
      "author": "MatrixVirus",
      "body": "I have a founders 3080ti.. how does this compare?",
      "score": 1,
      "created_utc": 1737905109.0,
      "replies": []
    },
    {
      "id": "m8rc4wl",
      "author": "JerryLZ",
      "body": "It’s still on my radar for a 4k gaming card. I don’t hold high hopes for the 5080 anymore and I know this is what nvidia wants which is for xx80 people to move into the xx90 bracket but what I want is actual playable 4k ultra. I have a 3080 which serves me well but I’m still disabling shadows and other settings to get my fps in a comfy spot.\n\nPlaying enshrouded right now, pulling 50fps, I want to do better without crippling my quality completely. If you have a 4090 you shouldn’t even be in the market but some people be like that and that’s on them. \n\nIt’s not the best value, especially for me since I’d be paying more for a aib and even more for a waterblock but from what it seems, if I were to buy one of these I could pull a easy 6 years from it I’m sure until the bug starts hitting me again. By then id have rebuilt the other components as well.",
      "score": 1,
      "created_utc": 1737654120.0,
      "replies": []
    },
    {
      "id": "m8rji2a",
      "author": "alman12345",
      "body": "I saw several games pushing double the frame rate of my 4080…it’s kinda tempting.",
      "score": 0,
      "created_utc": 1737656105.0,
      "replies": [
        {
          "id": "m8sxhq4",
          "author": "offence",
          "body": "Only people who can't afford them will complain , it's just as big of a leap as last gen but people need to cope.\n\nIm on rtx 4080 and i will be getting a 5090 .",
          "score": 0,
          "created_utc": 1737669737.0,
          "replies": [
            {
              "id": "m8v88yd",
              "author": "corut",
              "body": "I can afford it, but the cost (4kAUD) is not worth it for performance uplift on my 3080. If it was half the price I'd get one, but for now I'll wait for the 6090 and try again.",
              "score": 1,
              "created_utc": 1737698269.0,
              "replies": [
                {
                  "id": "m8vi993",
                  "author": "offence",
                  "body": "I mean that's highway robbery , in EU it will peak at 2500 euros tops.",
                  "score": 1,
                  "created_utc": 1737703541.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8vksrf",
              "author": "m_csquare",
              "body": "It isnt. 4090 was almost 60% better than 3090. 5090 doesnt provide that much of an upgrade",
              "score": 1,
              "created_utc": 1737705020.0,
              "replies": [
                {
                  "id": "m8vm2r8",
                  "author": "offence",
                  "body": "That's not true , no gen had a 60% perf. bump.",
                  "score": 1,
                  "created_utc": 1737705764.0,
                  "replies": [
                    {
                      "id": "m8vnt8a",
                      "author": "m_csquare",
                      "body": "Sigh.. the ones who deny this are those couldnt afford 4090 🥱\n\nhttps://youtu.be/tZC17ZtDmNU?si=g8zn20FPqFDaE7MG\n\nhttps://youtu.be/zSW_00jjeKI?si=Mscd_4mitAnSf26d\n\nWhy do ppl find this 5090 underwhelming if the uplift is as great as prev gen uplift? 4090 was heavily praised because its insane generational upgrade",
                      "score": 2,
                      "created_utc": 1737706798.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8uknej",
              "author": "alman12345",
              "body": "They’re all so salty they’re downvoting lmao, how sad for them all. Maybe they should buy AMD.",
              "score": -1,
              "created_utc": 1737688864.0,
              "replies": [
                {
                  "id": "m8vi4ve",
                  "author": "offence",
                  "body": "Yup",
                  "score": -1,
                  "created_utc": 1737703469.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8qlkow",
      "author": "Terrariola",
      "body": "The U.S. Dollar has inflated about 45.1% of its value since the year 2000 - this graphics card costs $1097.90 in 2000 USD, or $1390.27 in 2010 USD.",
      "score": 0,
      "created_utc": 1737646731.0,
      "replies": [
        {
          "id": "m8s7fqo",
          "author": "The_JSQuareD",
          "body": "The most expensive card Nvidia released in 2000 was the GeForce 2 Ultra, with an MSRP of $499.\n\nThe most expensive card Nvidia released in 2010 was the GeForce GTX 480, with an MSRP of... also $499.\n\nNormally technology is deflationary, not inflationary.",
          "score": 3,
          "created_utc": 1737662624.0,
          "replies": [
            {
              "id": "m8ww9r5",
              "author": "R1ddl3",
              "body": "They released the Titan with a $999 msrp in 2013 though.",
              "score": 2,
              "created_utc": 1737728439.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8t7bst",
      "author": "Superseaslug",
      "body": "Personally I can't wait until an indie studio makes a game where your companion is actually run by AI. Voice acting, behavior and all",
      "score": -1,
      "created_utc": 1737672578.0,
      "replies": []
    },
    {
      "id": "m8ra0l9",
      "author": "friiz1337",
      "body": "Just like Samsung's S25 Series",
      "score": 0,
      "created_utc": 1737653539.0,
      "replies": []
    },
    {
      "id": "m8rkk2t",
      "author": "InterstellarReddit",
      "body": "Damn I was going people would get fomo so I can pickup a second 3090 for AI but I don’t see it happening now.",
      "score": 0,
      "created_utc": 1737656389.0,
      "replies": []
    },
    {
      "id": "m8vxvq0",
      "author": "mertgah",
      "body": "I have a 6900xt I want a 5090 so I don’t have to deal with AMD’s fucked drivers anymore.",
      "score": 0,
      "created_utc": 1737713061.0,
      "replies": []
    }
  ]
}