{
  "post": {
    "title": "Atari 2600+ PAC-MAN Edition - Backward and forward compatible Console, Joystick & Games",
    "author": "landocharisma",
    "id": "1m5rj0b",
    "score": 707,
    "created_utc": 1753124062.0,
    "selftext": "",
    "num_comments": 112,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1m5rj0b/atari_2600_pacman_edition_backward_and_forward/"
  },
  "comments": [
    {
      "id": "n4e26m5",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1753124063.0,
      "replies": []
    },
    {
      "id": "n4e3l13",
      "author": "Gnarcotizer",
      "body": "Nice I'll finally be able to try my copy of et",
      "score": 58,
      "created_utc": 1753124461.0,
      "replies": [
        {
          "id": "n4e4vyp",
          "author": "jsamuraij",
          "body": "Oh no",
          "score": 16,
          "created_utc": 1753124828.0,
          "replies": [
            {
              "id": "n4fjp8u",
              "author": "rebbsitor",
              "body": "E.T. is a pretty good 2600 game.  It gets a bad rap mainly because it was release just as the Video Game Crash happened and because it's not a pick up and play game.  Someone absolutely must read the manual to understand what to do.  There's also one fiddly mechanic that's easy to work with once you know how, but could be very frustrating if you don't.\n\nI had a lot of fun with it back in the 80s and I've replayed it a few times more recently.  It still holds up.  It's honestly one of the more advanced games for the 2600.",
              "score": 14,
              "created_utc": 1753140176.0,
              "replies": [
                {
                  "id": "n4fl1wj",
                  "author": "INACCURATE_RESPONSE",
                  "body": "You’re evil.",
                  "score": 14,
                  "created_utc": 1753140619.0,
                  "replies": []
                },
                {
                  "id": "n4flm4r",
                  "author": "Enough-Cod7281",
                  "body": "Raise neck. See blinking dash in what I assume is a bush / hole. Fall into said bush / hole. 1 in 10 chances find a component. Raise neck to get out of hole. Repeat until you die. That is literally the gameplay loop I remember as a kid. Man I’d rather play Bubsy 3D.",
                  "score": 11,
                  "created_utc": 1753140803.0,
                  "replies": [
                    {
                      "id": "n4frgzk",
                      "author": "rebbsitor",
                      "body": "That's why you need the manual :)  There's a ? command to show where the phone pieces are so you don't go searching all the pits.  It's 100% in one that flashes.\n\nAlso, you eat the Reese's Pieces for more energy so you don't die.\n\nThe game is actually played for high score, so once you win (build the phone, go home), you keep playing additional loops for score.",
                      "score": 8,
                      "created_utc": 1753142766.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n4g9bkw",
                  "author": "3-orange-whips",
                  "body": "I have literally never seen a positive thing said about this game and I played it when it came out and it was incomprehensible.",
                  "score": 4,
                  "created_utc": 1753148983.0,
                  "replies": []
                },
                {
                  "id": "n4mzy35",
                  "author": "jiminyjunk",
                  "body": "![gif](giphy|yiADANv89n7UQuS5kJ)",
                  "score": 2,
                  "created_utc": 1753235666.0,
                  "replies": []
                },
                {
                  "id": "n4o473g",
                  "author": "Jebusfreek666",
                  "body": "Yeah, I was never a read the manual kind of kid. All I remember is trying to play it, having no idea what to do, and quitting.",
                  "score": 1,
                  "created_utc": 1753253045.0,
                  "replies": []
                },
                {
                  "id": "n5c6hyw",
                  "author": "BetSubject6704",
                  "body": "I agree. I bought an Atari 2600 in the late 2000s when I was 16, mainly because I loved shitty games and wanted to try out ET, and because I loved retro games. Plus my local game store was selling a 2600 bundle with like 30 games for $25 so why not. \n\nAnyways, I thought ET was a decent game. Definitely had more depth than most of the games I had on the console.",
                  "score": 1,
                  "created_utc": 1753568428.0,
                  "replies": []
                },
                {
                  "id": "n5bgwlm",
                  "author": "snoromRsdom",
                  "body": "No. ET is a crap game. We were right back then and we are still right. Just stop with the BS attempts to rehabilitate one of the worst games of all-time. It's embarrassing.",
                  "score": 1,
                  "created_utc": 1753559858.0,
                  "replies": [
                    {
                      "id": "n5c7f4v",
                      "author": "BetSubject6704",
                      "body": "Eh, I kinda agree with them. I was born in 93’ and purchased an Atari 2600 in the late 2000s as a teenager. So, I wasn’t around when the game came out, but I didn’t think it was that bad at the time. \n\nOf course, not playing a 2600 until decades after it came out, a lot of the games seem rudimentary and archaic. But ET seemed a little more complex than many other 2600 games and I had some fun with it.",
                      "score": 1,
                      "created_utc": 1753568757.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n4eadqp",
          "author": "jmohnk",
          "body": "12 year old me was very disappointed with that game.",
          "score": 5,
          "created_utc": 1753126394.0,
          "replies": []
        },
        {
          "id": "n4fxqtb",
          "author": "BestWesterChester",
          "body": "ET was one of my favorite games. It didn't tie too closely to the movie and it was complex, but that's why I liked it.",
          "score": 1,
          "created_utc": 1753144948.0,
          "replies": []
        },
        {
          "id": "n4g4do1",
          "author": "ur_anus_is_a_planet",
          "body": "Ooof, trauma flashback",
          "score": 1,
          "created_utc": 1753147260.0,
          "replies": []
        },
        {
          "id": "n4ed485",
          "author": "_That_Dog_Barks",
          "body": "Literal spit coffee in laughter. Well done. Snap••",
          "score": 1,
          "created_utc": 1753127181.0,
          "replies": []
        },
        {
          "id": "n4lfp3t",
          "author": "morrow98682",
          "body": "Spoiler alert** it’s fantastic.",
          "score": 0,
          "created_utc": 1753217534.0,
          "replies": [
            {
              "id": "n5bh189",
              "author": "snoromRsdom",
              "body": "Not even compared to Pong.",
              "score": 1,
              "created_utc": 1753559901.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n4e9tqv",
      "author": "Club_NVRBeautiful",
      "body": "Old guy here. I remember feeling incredibly ripped off when my pre ordered version of pac-man arrived at Hills department store. I find it funny that they chose a historically bad  2600 game to make a special edition out of.",
      "score": 71,
      "created_utc": 1753126235.0,
      "replies": [
        {
          "id": "n4eotto",
          "author": "jimbobdonut",
          "body": "It blows my mind that Atari spent millions on getting the licenses for both ET and Pac-Man, but then rushed out the games to make a Christmas deadline. ET was programmed by one guy in eight weeks. I’m surprised that the game was as playable as it was.",
          "score": 29,
          "created_utc": 1753130524.0,
          "replies": [
            {
              "id": "n4f1jvp",
              "author": "ProbablyDustin",
              "body": "As a veteran of having that game in our house… “playable” is doing a lot of heavy lifting here.",
              "score": 11,
              "created_utc": 1753134290.0,
              "replies": []
            },
            {
              "id": "n4ez0in",
              "author": "Myke_X7",
              "body": "Yeah, but y’all spent hours play’em. Don’t lie…",
              "score": 10,
              "created_utc": 1753133518.0,
              "replies": [
                {
                  "id": "n4in2hv",
                  "author": "kinisonkhan",
                  "body": "Yeah, spent hours constantly falling into pits.",
                  "score": 4,
                  "created_utc": 1753188943.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n4l21po",
              "author": "obi1kenobi1",
              "body": "ET is my go to cartridge for testing controllers. You’re just instantly thrown into gameplay where every action (the four directions and the button) does something, but there’s also no action or enemies, so you can take your time to figure out if the controller is working properly and reliably.\n\nSo it’s good for *something* at least.",
              "score": 2,
              "created_utc": 1753213763.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n4ez81c",
          "author": "not_a_moogle",
          "body": "Someone made a better version.  So it was possible once someone had a better understanding of how to maximize the hardware.\n\nhttps://forums.atariage.com/topic/229152-new-pacman-for-atari-2600/#comment-3061258",
          "score": 15,
          "created_utc": 1753133583.0,
          "replies": [
            {
              "id": "n4fj964",
              "author": "rebbsitor",
              "body": "Pac-Man on the 2600 is mainly down to time constraints on the developer and knowing that it was going to sell well no matter what they put in the box.  Donkey Kong on the 2600 came from a similar situation.  They could have made the game better even back then, but they wouldn't have made more money and that was the bottom line for the business.\n\nYou can see this with Ms. Pac-Man on the 2600 that came out a year later.",
              "score": 7,
              "created_utc": 1753140029.0,
              "replies": [
                {
                  "id": "n4hsrs3",
                  "author": "KeplerFinn",
                  "body": ">but they wouldn't have made more money\n\n\nThat´s highly speculative. Unless you have a time machine which can branch into parallel dimensions there´s absolutely no way to tell for sure. It´s a typical excuse made by lazy greedy people.\n\n\nIt´s this kind of mindset which directly lead to the video game crash... at the expense of a lot of opportunity money.",
                  "score": 0,
                  "created_utc": 1753175208.0,
                  "replies": [
                    {
                      "id": "n4i0o41",
                      "author": "rebbsitor",
                      "body": "It's both the company's assessment and probably correct. In the early 80s there was basically no gaming media, reviews, and certainly nothing like social media. Home video games sold based off advertisement, arcade reputation if it was a port, and the back of the box. \n\nWhat really led to the crash was companies churning out shovelware and customers having no good way to know what they were getting until after they bought it.  (the 2600 version of Pac-Man is arguably shovelware to capitalize on Pac-Man Fever)\n\nThey were so confident they could sell this version that they produced more carts than there were consoles existing at the time expecting it would be a system seller.  And they sold a ton of them.  It's by far one of the most common carts out there even after throwing a bunch in a landfill.  Unfortunately consumer confidence plummeted due to stuff like this and the market being flooded by a lot of 3rd party shovelware. It took Nintendo and their Seal of Quality system to revive the home market.",
                      "score": 2,
                      "created_utc": 1753179630.0,
                      "replies": [
                        {
                          "id": "n5bibjf",
                          "author": "snoromRsdom",
                          "body": "You have no clue about the crash at all. You obviously weren't there and are quoting from teenagers on Youtube who also have no clue. The amount of \"shovelware\" -- a term which didn't exist yet -- was absolutely irrelevant. Acting as if people stopped buying good games because bad games were on the shelf is lazy and ignorant. Try harder. The answer is obvious, and was written about at the time.\n\nAnd all of us back then read magazines that had reviews. Again, you have no clue at all.",
                          "score": -1,
                          "created_utc": 1753560321.0,
                          "replies": [
                            {
                              "id": "n5bk5re",
                              "author": "rebbsitor",
                              "body": "> You have no clue about the crash at all. You obviously weren't there and are quoting from teenagers on Youtube who also have no clue. The amount of \"shovelware\" -- a term which didn't exist yet -- was absolutely irrelevant. Acting as if people stopped buying good games because bad games were on the shelf is lazy and ignorant. Try harder. The answer is obvious, and was written about at the time.\n\n> And all of us back then read magazines that had reviews. Again, you have no clue at all.\n\nlmao, I've owned an Atari VCS since 1978.",
                              "score": 2,
                              "created_utc": 1753560928.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n5bhvti",
              "author": "snoromRsdom",
              "body": "It has nothing to do with having a better understanding. The poorgramma was not given enough time to write the game, just like ET. And sure, I could make a better version today. We all know that extremely primitive CPU and (Jay Miner's AV chip) inside and out now. Most games made for the Atari VCS today are far better than what came out at the time. Of course they often have 16K or more of code, which means Atari could not have afforded to SHIP them back in 1982, so there's that.",
              "score": 1,
              "created_utc": 1753560179.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n4edkf4",
          "author": "flyernut77",
          "body": "Yeh, the first time I played it with my friends, we were all like WTF?",
          "score": 10,
          "created_utc": 1753127308.0,
          "replies": []
        },
        {
          "id": "n4fjbby",
          "author": "unassumingdink",
          "body": "Hills was a beautiful trainwreck of a store. More toys abandoned in the aisles than still on the shelves.",
          "score": 6,
          "created_utc": 1753140049.0,
          "replies": []
        },
        {
          "id": "n4g3lqw",
          "author": "Andrew_hl2",
          "body": ">  I find it funny that they chose a historically bad 2600 game to make a special edition out of.\n\nIt's a 2-in-1 cart...its got the original shitty version and a more advanced arcade-style version.",
          "score": 5,
          "created_utc": 1753146988.0,
          "replies": []
        },
        {
          "id": "n4fpg2a",
          "author": "ThomW",
          "body": "Seriously. I think we CRIED it was so bad.  Haha",
          "score": 3,
          "created_utc": 1753142072.0,
          "replies": []
        },
        {
          "id": "n4idhlb",
          "author": "boardgamejoe",
          "body": "I was 5 when we got Pac-Man for the 2600. I knew then it wasn't like the arcade version but I didn't care in the slightest. I put thousands of hours into that game.",
          "score": 3,
          "created_utc": 1753185420.0,
          "replies": []
        },
        {
          "id": "n4hyd77",
          "author": "Skynuts",
          "body": "I haven't played it on the 2600. What was so bad about it? I've always seen Pac-Man as a timeless classic.",
          "score": 2,
          "created_utc": 1753178400.0,
          "replies": []
        },
        {
          "id": "n4jv057",
          "author": "norbertus",
          "body": ">I find it funny that they chose a historically bad 2600 game to make a special edition out of\n\nEspecially since, over the years, Atari has been renowned for their marketing savvy.",
          "score": 2,
          "created_utc": 1753201805.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4ef5n4",
      "author": "MarkZuckerbergsPerm",
      "body": "It looks very pretty, but there's no chance in hell I'm ever spending 150 euros to buy an Atari 2600 / 7800",
      "score": 22,
      "created_utc": 1753127758.0,
      "replies": [
        {
          "id": "n4hsmq4",
          "author": "Brilliant-Onion2129",
          "body": "The 7800 was a surprisingly good system!",
          "score": 2,
          "created_utc": 1753175124.0,
          "replies": [
            {
              "id": "n5billu",
              "author": "snoromRsdom",
              "body": "No it wasn't. Maybe if it had been released in 1981, but it shipped obsolete.",
              "score": 1,
              "created_utc": 1753560413.0,
              "replies": [
                {
                  "id": "n5dl9f3",
                  "author": "Brilliant-Onion2129",
                  "body": "The technology didn’t exist in 1981.",
                  "score": 1,
                  "created_utc": 1753588184.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n4enpek",
      "author": "particularswamp",
      "body": "Ms Pac-Man is and was the far superior game.",
      "score": 14,
      "created_utc": 1753130202.0,
      "replies": [
        {
          "id": "n4epy1h",
          "author": "dinan101",
          "body": "On the 2600 barely",
          "score": 1,
          "created_utc": 1753130838.0,
          "replies": [
            {
              "id": "n4f4bfw",
              "author": "Over-Conversation220",
              "body": "This may be nostalgia talking, but I remember the 2600 Ms. Pac Man as being a massive improvement over Pac Man.\n\nThe 2600 port of Pac Man was the first memory I have of being very disappointed in a game.",
              "score": 9,
              "created_utc": 1753135153.0,
              "replies": []
            },
            {
              "id": "n4fjvrv",
              "author": "rebbsitor",
              "body": "It's a lot better.  I have Ms. Pac-Man almost permanently plugged into my 2600+.",
              "score": 4,
              "created_utc": 1753140237.0,
              "replies": [
                {
                  "id": "n4fwe5o",
                  "author": "dinan101",
                  "body": "I wish I’d kept all of the my 2600 games and even the console but at some point I let my parents trash it all. Still, there are days I wish o had Yar’s Revenge, Pitfall, and Adventure to play in their original iterations. Those were my favorites. Oh, and River Raid!",
                  "score": 3,
                  "created_utc": 1753144481.0,
                  "replies": [
                    {
                      "id": "n4gk964",
                      "author": "rebbsitor",
                      "body": "Those are all good ones!  They're still out there and not super expensive.  A lot of them are in the Atari 50 collection now too to play on PC and console.  Sadly not the Activision games yet, but hopefully one day.",
                      "score": 1,
                      "created_utc": 1753152957.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n4gdvc9",
                  "author": "LucasNYC9",
                  "body": "Does the 2600 Ms Pac man have the animations as you get higher in the levels where they. meet, and fall in love etc?",
                  "score": 1,
                  "created_utc": 1753150584.0,
                  "replies": [
                    {
                      "id": "n4gjkpk",
                      "author": "rebbsitor",
                      "body": "Unfortunately they didn't squeeze those in.  It has the opening animation/attract mode, all 4 mazes, and the moving fruits though.",
                      "score": 2,
                      "created_utc": 1753152695.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n5bipuz",
              "author": "snoromRsdom",
              "body": "In the arcades AND ESPECIALLY on the 2600, Ms Pac-Man was the far superior game!",
              "score": 1,
              "created_utc": 1753560452.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n4e4viq",
      "author": "More_Combination86",
      "body": "Gosh darn. I remember buying 2 boxes from a neighbor when I was 12. It was 2001. Anyways, 1 box had three 2600 consoles and a large assortment of controllers. The other was filled with games. I bought it all for $30! It was a real score. I still remember going directly to the 99 cents store and buying the analog converters for the tv so I could play. That was so great. Sad thing is I lost all of it to theft. But that probably as close to a lottery as I’ll ever get lol.",
      "score": 9,
      "created_utc": 1753124824.0,
      "replies": [
        {
          "id": "n4elqjp",
          "author": "blue-coin",
          "body": "You can still score lucky like that. Yard sales, and estate sales are the way to go. Can also find grandmas unloading stuff like that on marketplace for cheap but you gotta snap it up quick",
          "score": 5,
          "created_utc": 1753129641.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4emina",
      "author": "tiresian22",
      "body": "I’m holding out for the Atari 2600 E.T. The Extra Terrestrial Special Edition with a collectors’ edition cartridge dug up fresh from the dump.",
      "score": 8,
      "created_utc": 1753129862.0,
      "replies": [
        {
          "id": "n4fk7e1",
          "author": "rebbsitor",
          "body": "They actually dug those up 10+ years ago:\n\nhttps://www.youtube.com/watch?v=8jHpOsJQaHM&t=1s",
          "score": 3,
          "created_utc": 1753140342.0,
          "replies": [
            {
              "id": "n4kqu1m",
              "author": "tiresian22",
              "body": "Haha, amazing. Love that!!",
              "score": 1,
              "created_utc": 1753210536.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n4e3box",
      "author": "MadOrange64",
      "body": "Looks cool ngl",
      "score": 8,
      "created_utc": 1753124386.0,
      "replies": []
    },
    {
      "id": "n4e9akb",
      "author": "LucasNYC9",
      "body": "It should come with two joysticks and Ms Pac-Man too",
      "score": 7,
      "created_utc": 1753126079.0,
      "replies": [
        {
          "id": "n4ejzu1",
          "author": "ChrisTaliaferro",
          "body": "The rights to Ms. Pac Man are complicated which is why you never see it in compilations or things like this even though it's far and away the best Pac-Man game.",
          "score": 6,
          "created_utc": 1753129135.0,
          "replies": [
            {
              "id": "n4fkdzz",
              "author": "rebbsitor",
              "body": "The rights really straightforward.  Namco can publish it whenever they want.  They just have to pay royalties to the rights holder (currently AtGames), and they really don't want to out of spite.\n\nThey will still do it sometimes for standalone things like Arcade1Up machines or Ms. Pac-Man handhelds.  They still sell it on Steam and Playstation Store as a standalone game.",
              "score": 4,
              "created_utc": 1753140401.0,
              "replies": []
            },
            {
              "id": "n4eqagq",
              "author": "codece",
              "body": "There was an Atari 2600 Ms. Pac-Man game, and it was *waaaaaaaay* better than the 2600 Pac-Man.",
              "score": 3,
              "created_utc": 1753130936.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n4ecpnp",
          "author": "DeLaOcea",
          "body": "Yeah, the other joystick in pink; probably if they see a good profit, they will market that one in the future.",
          "score": 3,
          "created_utc": 1753127067.0,
          "replies": [
            {
              "id": "n4eq5fo",
              "author": "pohatu771",
              "body": "They are also offering ghost-colored controllers.",
              "score": 3,
              "created_utc": 1753130896.0,
              "replies": []
            },
            {
              "id": "n4eqev0",
              "author": "Bobbler23",
              "body": "There is a pink joystick - but it's for \"Pinky\" the ghost:\n\n[https://atari.com/products/pac-man-cx40-joystick-pink](https://atari.com/products/pac-man-cx40-joystick-pink)",
              "score": 2,
              "created_utc": 1753130970.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n4ep3so",
          "author": "Crushed_Robot",
          "body": "Agree 100%. I would buy it if it came with two joysticks. I absolutely will not buy it with one joystick for the principle of it. Every company is a rip off these days.",
          "score": 3,
          "created_utc": 1753130601.0,
          "replies": []
        },
        {
          "id": "n4f9ijb",
          "author": "Neo_Techni",
          "body": "and a SNES classic so you can play some actually good games",
          "score": 1,
          "created_utc": 1753136847.0,
          "replies": [
            {
              "id": "n5bj3ej",
              "author": "snoromRsdom",
              "body": "Why don't I do something equally as ignorant and suggest you buy a PS5 Pro if you want to play actually good games? Sheesh! The Atari 2600 sold 30 million units for a reason, teenager!",
              "score": 1,
              "created_utc": 1753560577.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n4en9pd",
      "author": "TheOtherWhiteCastle",
      "body": "The irony of this is that I believe the Atari 2600 version of PAC-MAN was considered the worst of all the console versions at the time of its release.",
      "score": 5,
      "created_utc": 1753130077.0,
      "replies": [
        {
          "id": "n5bj8j6",
          "author": "snoromRsdom",
          "body": "It was. Even the Vic-20, which doesn't actually have a graphics mode, was better.",
          "score": 1,
          "created_utc": 1753560623.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4ejpus",
      "author": "LatinGeek",
      "body": "What a weird company. After the VCS flopped spectacularly, they come out with a 2600 re-release that plays all the original carts, outputs to HDMI, has a wireless controller... they even got some new releases! They went and paid homebrew devs to release [new games](https://atari.com/products/mr-run-and-jump-2600) for the 2600!",
      "score": 4,
      "created_utc": 1753129055.0,
      "replies": [
        {
          "id": "n4f1wcn",
          "author": "landocharisma",
          "body": "You said it! They also publish System Shock, the Mortal Kombat collection, the Tetris collection and some stylish organic [market tote bags](https://atari.com/products/centipede-market-tote). Don't tell me that isn't some cool shit :)",
          "score": 2,
          "created_utc": 1753134397.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4emyk3",
      "author": "WardenEdgewise",
      "body": "We got the Atari 2600 re-issue a couple years ago. I guess it’s just an emulator in the inside. It’s unplayable. Too much lag. The paddle controller is a tenth of a second laggy. Terrible. Maybe there’s a firmware update that fixes the lag and jitters.",
      "score": 3,
      "created_utc": 1753129989.0,
      "replies": []
    },
    {
      "id": "n4eumxq",
      "author": "Fire-max",
      "body": "On the one hand cool, on the other just PAC-MAN? Wouldn’t the 2600’s entire game library fit on one of those carts? I love the compability with real software for those who have them but I hardly see the reason to buy this for $160 then also have to track down 30+ year old games.",
      "score": 3,
      "created_utc": 1753132193.0,
      "replies": [
        {
          "id": "n4fqkqw",
          "author": "atomic1fire",
          "body": "It's like asking why buy vinyl when your entire music library can fit on one micro sd card.\n\nSome people just really want the experience of doing the old thing, even if that old thing was clunky.\n\nAlso it basically gives pre-existing collectors something to play their games on.",
          "score": 1,
          "created_utc": 1753142455.0,
          "replies": []
        },
        {
          "id": "n598i7n",
          "author": "Wiggles69",
          "body": "They reissued the games, they cost a truly obscene amount of money for 40 year old games (at least in Australia)\n\n\nhttps://www.bigw.com.au/brands/atari",
          "score": 1,
          "created_utc": 1753533653.0,
          "replies": []
        },
        {
          "id": "n4f74zg",
          "author": "Neo_Techni",
          "body": "Nothing pre-NES is worth playing.",
          "score": -5,
          "created_utc": 1753136071.0,
          "replies": [
            {
              "id": "n4fasz0",
              "author": "SovFist",
              "body": "Absolute nonsense take",
              "score": 3,
              "created_utc": 1753137269.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n4f7f38",
      "author": "Wolfwoods_Sister",
      "body": "We’ve still got our old 2600 and she works. Spent so much time playing. \n\nIn the 90s as teens, we’d crack out the 2600 during the All-80s New Year’s Eve radio music marathons and play all night.\n\nThe re-issue versions really haven’t been as much fun — the controllers have been buggy for some reason. Kinda disappointing.",
      "score": 3,
      "created_utc": 1753136162.0,
      "replies": [
        {
          "id": "n4g1vu5",
          "author": "pohatu771",
          "body": "That hasn’t been my experience. The included joystick controller works the same (but easier) than my originals.\n\nI haven’t tried the Racing or Paddle controllers. And I know the number pad controller doesn’t work.\n\nWith wired, anyway. I haven’t used the wireless controllers.",
          "score": 1,
          "created_utc": 1753146385.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4edck1",
      "author": "Pauly_Amorous",
      "body": "For those out of the loop like me, this looks like a 2600/Pacman-themed Atari 7800+:\n\nhttps://atari.com/products/atari-7800\n\nMy research indicates that the Pacman screenshots being shown is a 7800 port, and not the arcade version. (Can anyone verify this?",
      "score": 2,
      "created_utc": 1753127246.0,
      "replies": [
        {
          "id": "n4egvud",
          "author": "Own-Succotash2010",
          "body": "Includes PAC-MAN: Double Feature 2-in-1 game cartridge. Featuring an all-new, arcade-style version, PAC-MAN 7800 and the very first home version of the game, PAC-MAN 2600.",
          "score": 3,
          "created_utc": 1753128254.0,
          "replies": [
            {
              "id": "n4eos0c",
              "author": "LucasNYC9",
              "body": "So it’s 3-in -1?",
              "score": 1,
              "created_utc": 1753130510.0,
              "replies": [
                {
                  "id": "n4ere36",
                  "author": "pohatu771",
                  "body": "No. It includes a brand new game based on the arcade version, as well as the original 2600 version.\n\nA missing comma in this version of the copy could be misleading.\n\nThe product page has it in a different order:\n\n>This 2-in-1 cartridge includes PAC-MAN 7800, a new, arcade-style version, along with PAC-MAN 2600, the very first home version of the game.",
                  "score": 6,
                  "created_utc": 1753131249.0,
                  "replies": [
                    {
                      "id": "n4gead7",
                      "author": "LucasNYC9",
                      "body": "So the 7800 version is \"new\" (there wasn't one back then) and its more like the arcade version...... plus the orig 2600 version?",
                      "score": 1,
                      "created_utc": 1753150735.0,
                      "replies": [
                        {
                          "id": "n4geq8o",
                          "author": "pohatu771",
                          "body": "Yes. Original 2600 version, plus a newly-developed 7800 version (even compatible with the original 7800).\n\nThe screenshot looks equivalent to the (Namco) NES version.",
                          "score": 1,
                          "created_utc": 1753150895.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n4eqtj6",
          "author": "pohatu771",
          "body": "It’s a themed 2600+.\n\nThe 2600+ plays both 2600 and 7800 games.\n\nThe 7800+ also exists and is the same hardware in a different case and includes a different controller.\n\nThe game they are showing is a brand new 7800-compatible version of the game.",
          "score": 2,
          "created_utc": 1753131086.0,
          "replies": [
            {
              "id": "n4erunm",
              "author": "Pauly_Amorous",
              "body": "> The game they are showing is a brand new 7800-compatible version of the game.\n\nThere any videos of this version?",
              "score": 1,
              "created_utc": 1753131380.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n4f84my",
      "author": "19chris1996",
      "body": "So, this is basically the 2600+, but in a different coat of paint and a higher price. Got it. I'll stick to my Dad's still functioning 1982 2600.",
      "score": 1,
      "created_utc": 1753136392.0,
      "replies": [
        {
          "id": "n4g26bi",
          "author": "pohatu771",
          "body": "I mean, it is the 2600+, and they say that in the product name.\n\nIt’s $40 more than the retail price of the standard version and includes a game that sells for $35 separately. That’s not a bad markup for a special edition console.\n\nI have a working VCS, but still bought the standard edition. It’s more convenient and now I can also play 7800 games.",
          "score": 1,
          "created_utc": 1753146485.0,
          "replies": [
            {
              "id": "n4g40pi",
              "author": "19chris1996",
              "body": "Oh, I'm so stupid. my mistake.",
              "score": 1,
              "created_utc": 1753147134.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n4fwf8y",
      "author": "SadisticDaddy_1",
      "body": "Is this a legitimate console?",
      "score": 1,
      "created_utc": 1753144492.0,
      "replies": []
    },
    {
      "id": "n4g1pe7",
      "author": "BroodingKeroro",
      "body": "If i remember the original 2600+ wasn't wireless. Seeing that this ships with the wireless CX40+ I'm assuming  they reconfigured the hardware or am I wrong?",
      "score": 1,
      "created_utc": 1753146323.0,
      "replies": []
    },
    {
      "id": "n4g7cfv",
      "author": "bonesnaps",
      "body": "I remember going to a thrift store with my parents for *years* and being disappointed time after time that the only vids and consoles they had were Atari 2600s.\n\nThe games did not age well lol. I had like 10+ games and only 2 of them were decent.",
      "score": 1,
      "created_utc": 1753148307.0,
      "replies": []
    },
    {
      "id": "n4gaugv",
      "author": "meloman11",
      "body": "It's undoubtedly a cash grab for nostalgia, but I don't mind because it makes sense.  Give us new carts and more of this, and I'm all for it.  Over the past five years, Atari has been doing quite well here.",
      "score": 1,
      "created_utc": 1753149511.0,
      "replies": []
    },
    {
      "id": "n4gf28f",
      "author": "LucasNYC9",
      "body": "I still have my original 2600 in the (beat up) original box.  I had bought some type of cable like 10 years ago that allowed me to plug it into a modern TV but it might have been composite or component input not HDMI I forget and my box is up in a high closet :)\n\nSo I wonder if this (and the 2600+) . . . \n\n1. are actual hardware like the original 70s version or an emulator\n2. will the joystick (esp the wireless one with this PacMan version) have any lag? (I remember years ago buying one of those Atari joysticks that like 20 games in the joystick and it was super laggy)\n\nFYI the 2600+ came with 1 WIRED controller and a 10-in-1 game cartridge.",
      "score": 1,
      "created_utc": 1753151016.0,
      "replies": []
    },
    {
      "id": "n4glave",
      "author": "WestonP",
      "body": "Yet another retro cash grab attempt from Atari. I've lost count of how many times they've released a retro console of some sort.",
      "score": 1,
      "created_utc": 1753153361.0,
      "replies": []
    },
    {
      "id": "n4glx7k",
      "author": "Insert_Coin_P1",
      "body": "2600 Pac-Man was the worst imo",
      "score": 1,
      "created_utc": 1753153605.0,
      "replies": [
        {
          "id": "n4guj8s",
          "author": "happybutsadbuthappy",
          "body": "Maybe so, but when my older brother was playing it and doing so well that he was near the point of rolling the score over to zero and my mother paused dinner time to allow home to accomplish the feat it was a proud day in our house to be sure!",
          "score": 2,
          "created_utc": 1753157148.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4h1btz",
      "author": "dobbbie",
      "body": "I still have my 2600 and 7800 Pro Series.\n\nTons of games.",
      "score": 1,
      "created_utc": 1753160183.0,
      "replies": []
    },
    {
      "id": "n4h9mww",
      "author": "Allnite13",
      "body": "Crystal castles",
      "score": 1,
      "created_utc": 1753164377.0,
      "replies": []
    },
    {
      "id": "n4hmc2v",
      "author": "Tone_Gaia",
      "body": "Lowkey I still have mine with a bunch of games just sitting and catching dust!",
      "score": 1,
      "created_utc": 1753171427.0,
      "replies": []
    },
    {
      "id": "n4hsacl",
      "author": "Brilliant-Onion2129",
      "body": "Backwards and forwards compatible with what?",
      "score": 1,
      "created_utc": 1753174919.0,
      "replies": [
        {
          "id": "n4hx0lk",
          "author": "Tobias---Funke",
          "body": "It says in the specs in the article. \n\n“Plays both Atari 2600 and 7800 game cartridges”",
          "score": 1,
          "created_utc": 1753177662.0,
          "replies": [
            {
              "id": "n4nxd9j",
              "author": "Brilliant-Onion2129",
              "body": "There was an Atari 5200. And what is backwards from the 2600?",
              "score": 1,
              "created_utc": 1753249434.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n4jsumf",
      "author": "Flimsy-Buyer7772",
      "body": "I vividly remember the Christmas we got PacMan for the 2600 😂😂😂",
      "score": 1,
      "created_utc": 1753201212.0,
      "replies": []
    },
    {
      "id": "n4oic2z",
      "author": "MyGruffaloCrumble",
      "body": "They need a USB version of their paddles and keypads so more of the retro games are actually playable.",
      "score": 1,
      "created_utc": 1753261078.0,
      "replies": []
    },
    {
      "id": "n5bgq0o",
      "author": "snoromRsdom",
      "body": "Two things that absolutely do not go together. That was the shittiest version of Pac Man available for home use in the United States. And Pac-Man was not an Atari property. Who on Earth would want this blatant cash grab? No one from my generation. Might as well have a Donkey Kong theme Vic-20.\n\n\\#fail",
      "score": 1,
      "created_utc": 1753559798.0,
      "replies": []
    },
    {
      "id": "n5hv870",
      "author": "PlatonicSolidz",
      "body": "Is Defender and option on this? What about BurgerTime? (Can't find a full list of games.)",
      "score": 1,
      "created_utc": 1753649044.0,
      "replies": []
    }
  ]
}