{
  "post": {
    "title": "Rumors say next-gen RTX 50 GPUs will come with big jumps in power requirements",
    "author": "Sariel007",
    "id": "1hu7urx",
    "score": 0,
    "created_utc": 1736086292.0,
    "selftext": "",
    "num_comments": 63,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hu7urx/rumors_say_nextgen_rtx_50_gpus_will_come_with_big/"
  },
  "comments": [
    {
      "id": "m5itzud",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736086292.0,
      "replies": []
    },
    {
      "id": "m5iz8yp",
      "author": "proboscisjoe",
      "body": "This news is so old it broke a hip trying to do the two-step.",
      "score": 64,
      "created_utc": 1736088348.0,
      "replies": [
        {
          "id": "m5jai6g",
          "author": "jelde",
          "body": "I fell off my dinosaur!",
          "score": 3,
          "created_utc": 1736092233.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5j3pym",
      "author": "NickMalo",
      "body": "Inb4 more melting power cables",
      "score": 14,
      "created_utc": 1736089952.0,
      "replies": [
        {
          "id": "m5kzpfn",
          "author": "Affectionate-Memory4",
          "body": "The 5090 better have 2 12-pins on it. 4090s were melting with a TDP of 75% the maximum rating. If the 5090 is really going to be something like 575W, that's 96%. Basically 0 safety margin when a 1.3x one was already apparently insufficient.",
          "score": 5,
          "created_utc": 1736110145.0,
          "replies": [
            {
              "id": "m5l2cbj",
              "author": "ChrisFromIT",
              "body": "You do realize that the older cables 6-pin and 8-pin could also melt if they had a loose connection.",
              "score": 1,
              "created_utc": 1736110889.0,
              "replies": [
                {
                  "id": "m5l3rvd",
                  "author": "Affectionate-Memory4",
                  "body": "Yes, and I would advocate for it to have a reasonable number of those if it were going to use them.\n\n575W through a connector rated for 600W, when it's known to be relatively easy to mess up so badly it melts at 450W, is a bad idea. Splitting the load between 2 of them is safer all around. 300W each if we round up gives you as much overhead as a modern 8-pin, possibly a bit more.",
                  "score": 2,
                  "created_utc": 1736111283.0,
                  "replies": [
                    {
                      "id": "m5l83l6",
                      "author": "ChrisFromIT",
                      "body": "I don't think you understand. It doesn't matter how much wattage is being passed through or how much safety there is, ie, passing through 150 watts through a wire that can handle 300 watts, if the connection is loose and therefore a short, the cable can still melt.\n\nSplitting the load between two 600W cables will not prevent a cable from melting.\n\nAnd you are forgetting that the 12 pin standard has been updated that it is much more difficult not to plug it in properly, the sense pins act like an additional safety net and the device won't draw power if the sense pins aren't detected. Part of the new standard is changing the length of the sense pins, that it is very difficult to have a loose connection and have the sense pins connected. 6 pins and 8 pins connectors don't have that safety net and never did.",
                      "score": 0,
                      "created_utc": 1736112504.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5l1m66",
              "author": "solarwindy",
              "body": "All it needs is a standard computer 120 volt plug!  (And probably a plug on its own circuit breaker 🤣)",
              "score": 0,
              "created_utc": 1736110683.0,
              "replies": [
                {
                  "id": "m5l1zer",
                  "author": "Affectionate-Memory4",
                  "body": "Chuck a pair of XT90s on there and it's fine. Easier to plug in too. Honestly though, we need up up the supply voltage.\n\nMoving to 24V halves the current for a given power delivery, or to put it another way, gets us twice the power through current-limited connections.",
                  "score": 1,
                  "created_utc": 1736110787.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m5iy7k8",
      "author": "ekiander",
      "body": "And wallet requirements.",
      "score": 8,
      "created_utc": 1736087959.0,
      "replies": []
    },
    {
      "id": "m5iutag",
      "author": "ACanadianNoob",
      "body": "Hopefully big jumps downward, but I doubt it. My 15 amp circuit that my computer has to share with my air conditioner does not want your nonsense overblown power draw and heat output.\n\nGive us decent performance increases at low wattage requirements.",
      "score": 21,
      "created_utc": 1736086628.0,
      "replies": [
        {
          "id": "m5ivor4",
          "author": "Keening99",
          "body": "Sacrifices has to be made. Throw out your air conditioner. Obviously!",
          "score": 15,
          "created_utc": 1736086977.0,
          "replies": [
            {
              "id": "m5iyyj4",
              "author": "weavedawg74",
              "body": "But how will they cool the PC? Big jumps in temps too.",
              "score": 7,
              "created_utc": 1736088240.0,
              "replies": [
                {
                  "id": "m5j0w3y",
                  "author": "Starfox-sf",
                  "body": "Throw you out. Without it no need for AC or PC. /s",
                  "score": 5,
                  "created_utc": 1736088946.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5j8jq8",
              "author": "ACanadianNoob",
              "body": "Ah yes, I love gaming in the sauna.",
              "score": 6,
              "created_utc": 1736091589.0,
              "replies": [
                {
                  "id": "m5javdh",
                  "author": "Keening99",
                  "body": "Don't we all. Just a bit humid for the circuitry, gotta make sure to replace them parts every new generation.",
                  "score": 2,
                  "created_utc": 1736092353.0,
                  "replies": [
                    {
                      "id": "m5jb81q",
                      "author": "ACanadianNoob",
                      "body": "I think my drywall might need a yearly upgrade in that case too. And my chair, from all the sweat gaming in the heat. The wheel of capitalism turns again!",
                      "score": 2,
                      "created_utc": 1736092467.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m5j02q8",
          "author": "raziel686",
          "body": "The term \"jump\" is rarely used for decreases, they almost always use \"drop\" for that. \n\nNVIDIA is losing its grasp on reality, 1500 watts is the max steady draw on a circuit you can expect in an American home, and that includes all the other shit that needs power which is almost always shared on the same circuit. Most users aren't going to know which breaker runs to which outlet to split the load, if they even can split it. Any 20 amp circuits a home may have are almost always relegated to kitchens for appliances. I half expect Jensen to come out on stage and talk about how the 60 series will need a dedicated 240 line. \n\nNVIDIA is skipping the efficiency round that would normally come after a generation that significantly increases power draw, almost certainly because they are too focused on AI and took shortcuts on the GPUs. If nothing else, it swings the door wide open for AMD. Let's hope they don't trip on their own shoelaces trying to get through it like usual. NVIDIA needs a serious competitor and could use a generation where they get punched in the mouth and aren't on top.",
          "score": 11,
          "created_utc": 1736088650.0,
          "replies": [
            {
              "id": "m5j3rhj",
              "author": "nesquikchocolate",
              "body": "The high estimates for power consumption for the 5090 is 600W, that's 1/3 of the capacity of a normal 15A 120V receptacle. Even a two slice toaster uses more than that.\n\nBut because of how undervolting and downclocking works, you could almost certainly cut that 600W in half while still having 75%+ of the performance if you really wanted to - this way gives everyone options.\n\nNobody wants to buy a 5090 that's only 10% better than a 4090, even if it uses 30% less power doing that - so much rather sell a 5090 that is 40% better and uses 10% more power... Even though the actual efficiency is still so much better in both cases.",
              "score": 2,
              "created_utc": 1736089968.0,
              "replies": [
                {
                  "id": "m5j9em3",
                  "author": "ACanadianNoob",
                  "body": "If you add an Intel CPU, expensive water cooling, all the other components, and tons of drives in a high end system you are looking at 1000W-1500W depending on your build.\n\nAnd your power supply isn't 100% efficient at converting AC power to DC, either. That 600W power draw from the GPU 12VDC rail is more like 640-690W draw from the AC outlet.\n\nThe real solution is to vote with our wallets though, and don't buy halo tier products with high power draw.",
                  "score": 4,
                  "created_utc": 1736091875.0,
                  "replies": [
                    {
                      "id": "m5jb3l2",
                      "author": "nesquikchocolate",
                      "body": "If you've got 1500W worth of kit on your 1500W platinum rated power supply, it's 93% efficient so you're drawing 1615W from the wall.. Still below the 1800W available...\n\nBesides, I'm not sure how you'd even get to 1500W without a second gpu, since even a wild cpu doesn't draw 400W, and balance of system above 100W is very high.\n\nIf you can afford 2x 5090, you can also afford the dedicated 240V supply for it...",
                      "score": 1,
                      "created_utc": 1736092426.0,
                      "replies": [
                        {
                          "id": "m5l2rym",
                          "author": "QuickQuirk",
                          "body": "You're assuming that the computer is the only thing you are driving off that circuit.\n\nAdd in a monitor, speakers, your phone charger, wifi/router, and most of all: the air conditioner you're going to need to help you cool down the 1500 watt space heater in the summer.\n\nIt really is getting a bit much for most folks.",
                          "score": 1,
                          "created_utc": 1736111014.0,
                          "replies": [
                            {
                              "id": "m5l846t",
                              "author": "nesquikchocolate",
                              "body": "So you want to give your PC a 50W power budget because you insist on being able to run your whole home on the same outlet? That's insane. You shouldn't be putting your aircon on the same outlet as your PC anyway, and if you can't afford to have an additional outlet put into the house, what are you doing with a 5090?...",
                              "score": 0,
                              "created_utc": 1736112509.0,
                              "replies": [
                                {
                                  "id": "m5ovosn",
                                  "author": "Sure-Temperature",
                                  "body": "> and if you can't afford an additional outlet put in your house...\n\nWow what a terrible argument. Hiring electricians to run new circuits is definitely more expensive than a 5090, it's not even close",
                                  "score": 2,
                                  "created_utc": 1736168479.0,
                                  "replies": [
                                    {
                                      "id": "m5ow6s4",
                                      "author": "nesquikchocolate",
                                      "body": "Uh, I'm an business owner electrician that put additional circuits in homes as part of my dayjob, and you're incorrect.. Nobody is charging $1600+ for a single outlet in a residential house.",
                                      "score": 0,
                                      "created_utc": 1736168701.0,
                                      "replies": [
                                        {
                                          "id": "m5ozr7e",
                                          "author": "Sure-Temperature",
                                          "body": "An outlet probably not, but an outlet on a separate circuit? I tried to have some low voltage guys run ethernet up two floors and they wanted like $600 for two guys for an afternoon. Maybe electricians aren't as expensive as I thought though",
                                          "score": 2,
                                          "created_utc": 1736170202.0,
                                          "replies": [
                                            {
                                              "id": "m5p0m8g",
                                              "author": "nesquikchocolate",
                                              "body": "Two guys for an afternoon? There's no way I'm sending two people for a residential service call, and if it takes more than 3 hours for an outlet and home run when there's attic/crawlspace available, I'd charge the customer extra for being chatty and keeping my guy out of his work.",
                                              "score": 1,
                                              "created_utc": 1736170548.0,
                                              "replies": [
                                                {
                                                  "id": "m5p7ljw",
                                                  "author": "Sure-Temperature",
                                                  "body": "See I thought that price was crazy too, which is why I didn't even give it a second thought after the first call. Just for info, how much would you charge hypothetically to run an outlet up from a finished basement and up two floors? There's an attic but of course the second floor is right below that",
                                                  "score": 1,
                                                  "created_utc": 1736173460.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m5l0tmj",
                      "author": "appmapper",
                      "body": "And unless it's a Canadian winter, factor in the HVAC cost to remove the heat of a 1000w space heater.",
                      "score": 1,
                      "created_utc": 1736110457.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5l26po",
                  "author": "QuickQuirk",
                  "body": "> Nobody wants to buy a 5090 that's only 10% better than a 4090, even if it uses 30% less power doing that \n\nUm, actually, I would. I'm sure many others would too.\n\nI already undervolt and power limit my 4090 to drop power usage.\nAnd you're exagerrating to say you can halve the power draw and keep 75% of the performance. Maybe if you win the top prize in the silicon lottery, but my best undervolt/underclock got 25% savings for 14% performance drop - and that was unstable in some heavy games.\n\nSo yeah, a 10% performance improvement for 30% less power is *exactly* what I want.\n\nEspecially for my laptop where there's just no room for any more watts.",
                  "score": 2,
                  "created_utc": 1736110845.0,
                  "replies": [
                    {
                      "id": "m5l4o8m",
                      "author": "nesquikchocolate",
                      "body": "The 75% of perf from 50% of the power is from a techpowerup post I read a while ago, it was with a 4070, though, so it might be even better on the larger cards. \n\nMy own 1070 is too slow to underclock for any meaningful efficiency gains, I'm just hoping the 5070 isn't as expensive as the 4070 was at launch, then I might finally get an upgrade.",
                      "score": 1,
                      "created_utc": 1736111530.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5l2mxv",
                  "author": "w1n5t0nM1k3y",
                  "body": ">Even a two slice toaster uses more than that.\n\nA toaster is basically a space heater. It's actually a pretty high draw device. That why it hurts when you touch the toaster. If you combine the 600w you with a 250w CPUs, a couple of monitors and some other peripherals, you're going to get pretty close to the 1500w limit.",
                  "score": 2,
                  "created_utc": 1736110973.0,
                  "replies": [
                    {
                      "id": "m5l3hwp",
                      "author": "nesquikchocolate",
                      "body": "I don't know what cpu you game with, most are 90-120W, and would only rarely be running at full load while simultaneously running at full load on the graphics card... I don't know what monitor you use, my 27\" LG 4k monitor has a ~~65W~~ 40W power supply.\n\nBut regardless, neither of us are likely the target market for a 5090...",
                      "score": 1,
                      "created_utc": 1736111212.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5l2cue",
                  "author": "NorysStorys",
                  "body": "Man living in the UK/EU feels good, on outlet here can go up to 3000 watts so we still have a bunch of headroom left.",
                  "score": 1,
                  "created_utc": 1736110893.0,
                  "replies": [
                    {
                      "id": "m5l52ez",
                      "author": "nesquikchocolate",
                      "body": "Our outlets are 230V/16A so technically 3680W is available, but since it's 2.5mm2 wiring on a 20A breaker nothing really stops you from doing 4600W between two sockets.",
                      "score": 1,
                      "created_utc": 1736111644.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5j6ydm",
              "author": "Shawnmeister",
              "body": "I have planned my home ahead for power draw. What i can't plan for is that a company that doesn't pull a tik and tok dev cycle. There's still no end to the connector issue\n\nEdit: 240 line country here",
              "score": 1,
              "created_utc": 1736091058.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5iwzby",
          "author": "cutegamernut",
          "body": "Change you 15amp to 100amp",
          "score": 2,
          "created_utc": 1736087484.0,
          "replies": [
            {
              "id": "m5j7xsx",
              "author": "ACanadianNoob",
              "body": "12v 100amp circuits are a thing, but they use 4 or 2 gauge wire, the real thick stuff. And even then the wire runs have to be really short. It's usually just enough to go from the battery to an inverter where it's converted from 12v 100amp to 120v 10amp and can then be put through much smaller wire.\n\nCopper is expensive, no one is wiring their home for 100amp circuits. You'd be better off wiring a circuit for 230V and getting an EU power supply for your PC.\n\nEither way, no one is going to rewire their home just so they can have a shiny new computer. They will try it on existing wiring and either pop a breaker or the wires in their wall will get really hot.\n\nWe need hardware manufacturers to keep our circuit limitations and the fact that other devices will be on them in mind, and have fair products with lower power draw. Not to mention energy costs keep rising.",
              "score": 5,
              "created_utc": 1736091385.0,
              "replies": [
                {
                  "id": "m5lbw09",
                  "author": "weeklygamingrecap",
                  "body": "Then there's home builders wiring more than 1 room per breaker because they are cheap as fuck.",
                  "score": 2,
                  "created_utc": 1736113612.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5j0h5c",
              "author": "Kenny_log_n_s",
              "body": "This might not be safe to do if the attached wiring isn't rated for 100 amps.\n\nI'm not an electrician, but AFAIK most houses either have 14 gauge or 12 gauge, rated for 15 amps and 20 amps respectively.",
              "score": 5,
              "created_utc": 1736088795.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5iyg1s",
          "author": "templestate",
          "body": "I’m fine buying a lower tier card for less power draw but they have so little VRAM it’s not really a good option.",
          "score": 1,
          "created_utc": 1736088047.0,
          "replies": [
            {
              "id": "m5iz0vu",
              "author": "NotAPreppie",
              "body": "I saw a rumor that Intel is going to release a Battlemage \"Pro\" variant with 24GB.\n\nhttps://www.tomshardware.com/pc-components/gpus/intel-rumored-to-launch-a-24gb-battlemage-gpu-for-professionals-in-2025-double-the-vram-capacity-of-its-alchemist-counterpart-targeted-at-ai-workloads",
              "score": 3,
              "created_utc": 1736088264.0,
              "replies": [
                {
                  "id": "m5iz812",
                  "author": "templestate",
                  "body": "It’d be nice to be able to get a 5070 with 24GB of VRAM for DLSS, but Intel Arc is starting to look better and better.",
                  "score": 3,
                  "created_utc": 1736088339.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m5j19xn",
          "author": "ryguy28896",
          "body": "I've been paranoid of this too, and I'm on a 20-amp circuit shared with a window-mounted AC. I don't run both at the same time, either one is off while the other is on or vice versa, or none at all.",
          "score": 0,
          "created_utc": 1736089087.0,
          "replies": [
            {
              "id": "m5jbtut",
              "author": "ACanadianNoob",
              "body": "To be fair, I use a 5800X3D and an RTX 3070. My computer is undervolted to pull 360W from the wall at most according to my UPS power meter. I won't be upgrading until I need to, either.\n\nAnd since I recently got a small camper van that's powered by solar, lowering the power draw so I can take my PC with me when I start traveling this spring is something I'd like to do.",
              "score": 1,
              "created_utc": 1736092663.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m5l4j07",
      "author": "--Arete",
      "body": "These cards are beginning to resemble a nuclear reactor.\n\nI miss the days where I didn't have to wear noise canceling headset to enjoy a game.",
      "score": 3,
      "created_utc": 1736111489.0,
      "replies": []
    },
    {
      "id": "m5j5hh0",
      "author": "zirky",
      "body": "iirc the max power supply in the states is like 1500w or so because by code that’s the max draw on a single 110v circuit.",
      "score": 2,
      "created_utc": 1736090561.0,
      "replies": [
        {
          "id": "m5j9hua",
          "author": "azn2thpick1",
          "body": "Sustained draw on a 15A circuit, yes.  But 20A circuits exist.  As someone else mentioned above, usually kitchen.  I'm lucky enough they kept it simple and wired my whole house for 20A.",
          "score": 1,
          "created_utc": 1736091905.0,
          "replies": [
            {
              "id": "m5jbieh",
              "author": "zirky",
              "body": "it kind of sets the upper limit on what they can do. the states is a giant market and they aren’t going to cut them out",
              "score": 2,
              "created_utc": 1736092560.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m5iwin1",
      "author": "hopsgrapesgrains",
      "body": "Guess my 1000w needs to jump to 1600…",
      "score": 2,
      "created_utc": 1736087303.0,
      "replies": [
        {
          "id": "m5ixhyy",
          "author": "matycauthon",
          "body": "just gonna say i run an 8 year old 750w evga supernova with a 13700k and 4080 super, 8 drives, 6 fans, aio pump, etc.. and still have around 100-200 watts of headroom not sure exact amount but cpu hits around 165-180, gpu hits 190-207, both are undervolted but still. people overblow things and upgrade unnecessarily. psu's run less efficiently when you have over half the load available",
          "score": 5,
          "created_utc": 1736087685.0,
          "replies": [
            {
              "id": "m5iyaaw",
              "author": "D1stRU3T0R",
              "body": "Finally someone speaks the truth\n\nI have 5800X3D with 6900XT, both overclocked, on a 600W cheap psu. Meanwhile never checked the power from wall, realistically gpu sips 300ish W when fully used, cpu 100, rest 100(hdd, ssd, nvme, aio pump, fans). 100w headroom, and every psu has spike protection for up to even 20%+ for sustained load.\n\nYea, clearly i don't want to say to buy 500-600W psu for high end pcs, but rather have a 600W gold+, then 900W noname/no 80 certificate/bronze.",
              "score": 7,
              "created_utc": 1736087988.0,
              "replies": [
                {
                  "id": "m5j0ubh",
                  "author": "Revolutionary--man",
                  "body": "spot on, though to add to your last point - i built a new PC two months ago, I've got an 850w PSU simply because it was the same price as the 750w and £10 more than the 650w.\n\nPSUs aren't going to break the bank, and i could chuck in a second 4070ti and still have headroom on my 850w.\n\nAt worst this will push the 'default' PSU I'd recommend for any build to 1000w rather than the 850w that supports 90%+ of home PC builds currently, but i doubt it.",
                  "score": 3,
                  "created_utc": 1736088928.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m5j2ghk",
          "author": "CMDR_omnicognate",
          "body": "You probably won’t unless you’re overlocking the shit out of a 5090. 5080 is rumoured to be about 360W and the 5090 is rumoured to be about 575W, I can’t imagine the rest of your pc is going to be consuming 1000W of power",
          "score": 2,
          "created_utc": 1736089509.0,
          "replies": [
            {
              "id": "m5l3f8i",
              "author": "w1n5t0nM1k3y",
              "body": "Depends what else is on the same circuit. A lot of houses don't have a dedicated circuit for each outlet. Plug in the vacuum to the wrong outlet and your computer could power down.",
              "score": 0,
              "created_utc": 1736111193.0,
              "replies": [
                {
                  "id": "m5lew73",
                  "author": "CMDR_omnicognate",
                  "body": "what?",
                  "score": 1,
                  "created_utc": 1736114504.0,
                  "replies": [
                    {
                      "id": "m5lplxk",
                      "author": "w1n5t0nM1k3y",
                      "body": "Most houses have multiple outlets on a single circuit. You cant exceed the 15 amps on the entire circuit, not just the single receptacle. A vacuum can pull 12 amps depending on the vacuum. If you have a bunch of high draw devices on the same circuit then the circuit breaker will trip.",
                      "score": 1,
                      "created_utc": 1736117764.0,
                      "replies": [
                        {
                          "id": "m5lv90h",
                          "author": "CMDR_omnicognate",
                          "body": "Yeah but we're talking about the output capacity of a PC PSU, Original commenter is talking about upgrading their power supply to power new components, the amount of power pulled from the wall isn't what we were talking about",
                          "score": 1,
                          "created_utc": 1736119591.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m5izd4k",
          "author": "NotAPreppie",
          "body": "Meanwhile, most homes in the US have 120v 15A circuits. That's 1800W. \n\nAdd in monitors, room lighting, a fan, and any other peripherals and it's easy to overload a circuit at those power levels.",
          "score": 2,
          "created_utc": 1736088390.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5jjq85",
      "author": "Ryhsuo",
      "body": "As long as they put a proper fucking plug on it this time. The 12 VHPWR was a complete fiasco.",
      "score": 1,
      "created_utc": 1736095150.0,
      "replies": []
    },
    {
      "id": "m5l155a",
      "author": "strawboard",
      "body": "To power all that additional VRAM right?",
      "score": 1,
      "created_utc": 1736110544.0,
      "replies": []
    }
  ]
}