{
  "post": {
    "title": "Toshiba says Europe doesn't need 24TB HDDs, witholds beefy models from region | But there is demand for 24TB drives in America and the U.K.",
    "author": "chrisdh79",
    "id": "1kholog",
    "score": 1563,
    "created_utc": 1746706520.0,
    "selftext": "",
    "num_comments": 294,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kholog/toshiba_says_europe_doesnt_need_24tb_hdds/"
  },
  "comments": [
    {
      "id": "mr8x5rn",
      "author": "Immortal_Tuttle",
      "body": "I just bought 2 x 24tb Toshiba HDD in Germany...",
      "score": 108,
      "created_utc": 1746713339.0,
      "replies": [
        {
          "id": "mraccw6",
          "author": "spongeperson2",
          "body": "You don't need them. Please return them.",
          "score": 212,
          "created_utc": 1746728268.0,
          "replies": []
        },
        {
          "id": "mraelfs",
          "author": "KongoOtto",
          "body": "Yeah, me too bought them 3 weeks ago. Bit expensive but I don't see the prices fall soon",
          "score": 9,
          "created_utc": 1746728921.0,
          "replies": [
            {
              "id": "mreudwv",
              "author": "DuckDatum",
              "body": "What was the cost per bit?",
              "score": 1,
              "created_utc": 1746795299.0,
              "replies": [
                {
                  "id": "mreya6u",
                  "author": "KongoOtto",
                  "body": "I paid 17someting € per TB.",
                  "score": 1,
                  "created_utc": 1746796694.0,
                  "replies": [
                    {
                      "id": "mrf50s4",
                      "author": "DuckDatum",
                      "body": "Wouldn’t it be Terabyte expensive, then?",
                      "score": 1,
                      "created_utc": 1746798981.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mrjpxop",
          "author": "CoronaLime",
          "body": "What do you need all of that for?",
          "score": 1,
          "created_utc": 1746857205.0,
          "replies": [
            {
              "id": "mrjseke",
              "author": "Immortal_Tuttle",
              "body": "Data.",
              "score": 1,
              "created_utc": 1746858614.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mrju3na",
          "author": "KFR42",
          "body": "The story is confusing. It's only one specific model of 24tb drives they don't offer in Europe. They do offer other models in that size.",
          "score": 1,
          "created_utc": 1746859599.0,
          "replies": []
        },
        {
          "id": "msraaum",
          "author": "doommaster",
          "body": "Yeah this article is weird, the 24 TB models have been on sale here for months.  \nIt's only about the \"consumer\" variety, which makes 0 sense here because it comes with less warranty and is more expensive than the MG11ACA which is currently ~430€ incl. VAT.",
          "score": 1,
          "created_utc": 1747465359.0,
          "replies": []
        },
        {
          "id": "msrab9u",
          "author": "doommaster",
          "body": "Yeah this article is weird, the 24 TB models have been on sale here for months.  \nIt's only about the \"consumer\" variety, which makes 0 sense here because it comes with less warranty and is more expensive than the MG11ACA which is currently ~430€ incl. VAT.",
          "score": 1,
          "created_utc": 1747465366.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr8jbvp",
      "author": "baumpop",
      "body": "Toshiba makes hard drives for surveillance footage in the UK and US is what this says. ",
      "score": 480,
      "created_utc": 1746708741.0,
      "replies": [
        {
          "id": "mrbr7a6",
          "author": "Sir_roger_rabbit",
          "body": "And my porn collection\n\nEr... I mean artistic films.",
          "score": 117,
          "created_utc": 1746743879.0,
          "replies": [
            {
              "id": "mrc3l5n",
              "author": "ivanbin",
              "body": "And my... Animated artistic films...",
              "score": 34,
              "created_utc": 1746748287.0,
              "replies": []
            },
            {
              "id": "mrcivci",
              "author": "baumpop",
              "body": "Get this guy into elected office ",
              "score": 16,
              "created_utc": 1746753957.0,
              "replies": []
            },
            {
              "id": "mrd2rma",
              "author": "corgi-king",
              "body": "Romantic action movies.",
              "score": 10,
              "created_utc": 1746761768.0,
              "replies": []
            },
            {
              "id": "mrdmpyh",
              "author": "paulskinner88",
              "body": "My large collection of nothing",
              "score": 1,
              "created_utc": 1746771882.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mrgewa4",
          "author": "pickledeggmanwalrus",
          "body": "Bingo",
          "score": 1,
          "created_utc": 1746813036.0,
          "replies": []
        },
        {
          "id": "mrjtsju",
          "author": "CatProgrammer",
          "body": "Nothing in the article indicates that. And if that really were the motivation why is only Toshiba doing it? Other companies offer comparable density NAS drives in Europe already. And you don't need a specific hard drive brand to store data in a data center, people are going to use whatever's available to record footage. If anything you want variety so that they don't all fail at the same time.",
          "score": 1,
          "created_utc": 1746859418.0,
          "replies": [
            {
              "id": "mrklmog",
              "author": "baumpop",
              "body": "nobody says toshiba is the only game in town except the sales guys at toshiba.",
              "score": 1,
              "created_utc": 1746876048.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mrc6q1i",
          "author": "account22222221",
          "body": "Ok but like you know that’s actually nonsense right? Like if we wanted massive surveillance programs the is no rule it has to be a single drive?  Europe, UK and the US are currently already capable of storing many many exabytes. A normal data center might have a few thousand individual drives. \n\nThe real answer is the economy of data center hardware and what they are interested in buying. Maybe the drives need certain racks to be mounted in and those racks are not popular in Europe or some other such gorp, so they decided they would not likely sell many? Who knows. But it certainly isn’t because of facism.",
          "score": -22,
          "created_utc": 1746749437.0,
          "replies": [
            {
              "id": "mrd5kf1",
              "author": "OsmeOxys",
              "body": "> The drives probably need certain racks to be mounted in and those racks are probably not popular in Europe\n\nI... Wha... No.",
              "score": 18,
              "created_utc": 1746763031.0,
              "replies": [
                {
                  "id": "mrfvoky",
                  "author": "account22222221",
                  "body": "My example was a made up, arbitrary, figurative reason I pulled out of my ass. I guess I could have made it more clear by saying ‘the drive are blue in color and Europe hates blue so they decided it won’t sell’ \n\nI have no idea why they decided not to sell the drive. Some analyst probably made some report that had some reason or another for why they didn’t think it would be profitable. \n\nExcept to say I do know it has nothing to do with NA and the UK being some sort of evil facist surveillance state. \n\nAnd that ‘size of the drive’ has nothing to do with how much data you can store. It has to do with how I want to fill my data centers.",
                  "score": -5,
                  "created_utc": 1746807225.0,
                  "replies": [
                    {
                      "id": "mrg0n0a",
                      "author": "OsmeOxys",
                      "body": ">My ~~example was a made up, arbitrary, figurative reason~~  *specific claim as to the probable reason* I pulled out of my ass\n\nPlus it was just random words slapped together to form complete nonsense. You may as well have said hard drives use HDMI connectors in Europe.",
                      "score": 9,
                      "created_utc": 1746808746.0,
                      "replies": [
                        {
                          "id": "mrhnmmc",
                          "author": "account22222221",
                          "body": "Well no it really isn’t. This drive is almost definitely a 3.5 and I don’t know European standards but they maybe favor 2.5? \n\nOther considerations are power draw and heat dissipation, both of which I’ve had to personally compute and project before signing off on equipment purchase when professionally working ops for a data center for 7 YEARS. I mean it might be a made up reason but it’s not ‘random words’ as you and your 10 year experience as, it looks like, and auto-mechanic? Might think….",
                          "score": -2,
                          "created_utc": 1746826931.0,
                          "replies": [
                            {
                              "id": "mri3rfq",
                              "author": "OsmeOxys",
                              "body": ">This drive is almost definitely a 3.5 and I don’t know European standards but they maybe favor 2.5?\n\nYeah, you're just saying words. If you've been working dcops for 7 years without even being able to manage an A+ then... I mean, jeez, talk about bad management.\n\n>10 year experience as, it looks like, and auto-mechanic?\n\n#***You've just activated my trap card!***\n\nA+, net+, sec+, CYSA+ CCNA/P, CCST, CISSP, and 8 years towards my pension baby! No ASE though. \n\nI do work on cars for myself, family, and friends, but 10 years as an auto mechanic is still probably the worst guess you could have made based on my post history. Marine mechanic might make sense, hell 40 years as an accountant would too. But an auto mech? I made a single post asking about the best way to fix a rust hole in my girlfriend's truck. Yeah, I'm a real experienced mechanic all right. \n\nBut yes yes, carry on. Mock me for my interest in learning and working with my hands! The fat 3k check I just got for 2 days labor (undercharged, but I'm a nice guy) repairing a boat is in absolute shreds from such a tongue lashing.\n\nWould you like to mock me for my other interests and hobbies too? Electronic engineering is for losers too, right? Designing PCBs to improve my life sounds like something for the *poors*. Please tell me component level repair is still cool?!\n\n---\n\nEdit: I don't really take many opportunities to boast, I'm generally humble to the point of it being a problem. But when life gives you some pompous ass on a knee-high horse and the opportunity to dunk on them... It feels good, like a little mini therapy session.",
                              "score": 4,
                              "created_utc": 1746832609.0,
                              "replies": [
                                {
                                  "id": "mrif9hj",
                                  "author": "account22222221",
                                  "body": "That last comment was mostly bait to see the upvote downvote behavior surrounding things you post. Weird timing. No activity for an hour. You comment then suddenly three people stumble along and decide to read our convo. \n\nSo weird.",
                                  "score": -3,
                                  "created_utc": 1746836811.0,
                                  "replies": [
                                    {
                                      "id": "mrihd4p",
                                      "author": "OsmeOxys",
                                      "body": "2-1=0?\n\nYou sure? Don't be ashamed to pull out a calculator.\n\nAbsolutely hopeless. Good luck bud.",
                                      "score": -1,
                                      "created_utc": 1746837614.0,
                                      "replies": [
                                        {
                                          "id": "mrii50q",
                                          "author": "account22222221",
                                          "body": "Huh?\n\nHey look another comment with three almost simultaneous down votes. Strange",
                                          "score": -2,
                                          "created_utc": 1746837909.0,
                                          "replies": [
                                            {
                                              "id": "mriio9m",
                                              "author": "OsmeOxys",
                                              "body": "Sorry, misread. Thats actually worse\n\n4 upvotes minus 1 downvote equals 0 karma? You sure about that?",
                                              "score": -1,
                                              "created_utc": 1746838113.0,
                                              "replies": [
                                                {
                                                  "id": "mrijihh",
                                                  "author": "account22222221",
                                                  "body": "And now. It very weirdly. Stopped. Stranger still.",
                                                  "score": 1,
                                                  "created_utc": 1746838429.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "mrij25w",
                                          "author": "account22222221",
                                          "body": "Also btw in response to that 3year old confidently incorrect post. It’s called ECC and you were incorrect … confidently. \n\nhttps://www.intel.com/content/www/us/en/docs/programmable/683240/17-0/error-correction-code.html",
                                          "score": -2,
                                          "created_utc": 1746838258.0,
                                          "replies": [
                                            {
                                              "id": "mrip852",
                                              "author": "OsmeOxys",
                                              "body": "Let me get this straight... ECC is for correcting errors caused by CPUs that start degrading due to age, and makes the cpu recalculate... *something?* And you're in dcops ordering hardware?\n\nBy the gods, the mad mans done it. He's reached confidently incorrect confidentlyincorrect confidentlyincorrect.",
                                              "score": 0,
                                              "created_utc": 1746840661.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mrchlo8",
              "author": "baumpop",
              "body": "Thousands of drives all running cities worth of power grids to run. This could be an eco play for the same end goals. 24/7 active surveillance with less likely to add grid spikes. I’m literally spitting on balls here. ",
              "score": 2,
              "created_utc": 1746753489.0,
              "replies": [
                {
                  "id": "mrjtlav",
                  "author": "CatProgrammer",
                  "body": "And Toshiba is the only company capitalizing on it?",
                  "score": 1,
                  "created_utc": 1746859303.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mr8ejzb",
      "author": "Bismalz",
      "body": "Remember these actions for your future purchasing decisions. I remember that  companies would raise euro prices during Covid as it weakened compared to the dollar. Now the dollar is getting weaker what do they do? They raise the euro prices.",
      "score": 650,
      "created_utc": 1746706955.0,
      "replies": [
        {
          "id": "mr9qtw6",
          "author": "Oh_ffs_seriously",
          "body": "My regular Toshiba HDD failed after about two and a half years, so I'm already soured on the brand.",
          "score": 99,
          "created_utc": 1746722074.0,
          "replies": [
            {
              "id": "mrabbpf",
              "author": "Screamline",
              "body": "I have a 5tb 7200rpm one thats still going over 10 years later. I built the PC in febuary 2013, its moved to three new builds since but I did break the sata port.plastic and had to hot glue a cable on. Just brought home a.precision desktop from work, once I find a better Xeon for it, all my media drives are moving there and ill maybe shrink my gaming pc case",
              "score": 28,
              "created_utc": 1746727970.0,
              "replies": [
                {
                  "id": "mraydr0",
                  "author": "biosphere03",
                  "body": "Dude, I am completely blown-away by the in depth report on your HDD situation. Thank you.",
                  "score": 33,
                  "created_utc": 1746734777.0,
                  "replies": [
                    {
                      "id": "mrb10fc",
                      "author": "Screamline",
                      "body": "Your welcome. I'll be here all week.",
                      "score": 11,
                      "created_utc": 1746735559.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mrciym8",
                  "author": "hobbes543",
                  "body": "At 10 years old I’d be looking to clone it to a new drive , not transplant it to another device.  It’s already lived well past a normal lifespan of a mechanical drive.",
                  "score": 4,
                  "created_utc": 1746753992.0,
                  "replies": [
                    {
                      "id": "mrd5x1u",
                      "author": "kc5ods",
                      "body": "lol, what? i have SCSI HDDs from the 1980s that are still going strong.",
                      "score": 4,
                      "created_utc": 1746763190.0,
                      "replies": []
                    },
                    {
                      "id": "mrcoq4r",
                      "author": "Screamline",
                      "body": "Oh I will. I'm just surprised it lasted this long and with the busted sata port",
                      "score": 1,
                      "created_utc": 1746756133.0,
                      "replies": []
                    },
                    {
                      "id": "mre1pdz",
                      "author": "plains_bear314",
                      "body": "bro that is an elder hard drive keeper of ancient knowledge",
                      "score": 1,
                      "created_utc": 1746781307.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mraw2xi",
                  "author": "bnm777",
                  "body": "That is fascinating stuff, thanks for giving us in depth news on your zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz",
                  "score": -4,
                  "created_utc": 1746734097.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mrdw5n4",
              "author": "ilep",
              "body": "I suggest looking at some reports of failure amounts, there's some storage providers that produce statistics. It can be very model-specific what the failure rates are.",
              "score": 1,
              "created_utc": 1746777714.0,
              "replies": []
            },
            {
              "id": "mrbjnur",
              "author": "TheMacMan",
              "body": "3-5 years is the average span of a hard drive life. 2.5 years wouldn't be something most should be upset about.",
              "score": -8,
              "created_utc": 1746741284.0,
              "replies": [
                {
                  "id": "mrc5lhv",
                  "author": "NeuHundred",
                  "body": "i\"m pushin' five on some of mine.",
                  "score": 1,
                  "created_utc": 1746749019.0,
                  "replies": [
                    {
                      "id": "mrce5h5",
                      "author": "TheMacMan",
                      "body": "Sure. I have a couple drives that are 20 years old. But that's not the average. In fact it's drives that last that long that inflate the average.",
                      "score": 1,
                      "created_utc": 1746752213.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mragtn4",
          "author": "Plank_With_A_Nail_In",
          "body": "If people are still buying the same amount at these new higher prices then it means that these are now the correct prices.\n\nThings are priced at the maximum a market will pay not at some moral amount of profit, don't like it stop buying it.",
          "score": 9,
          "created_utc": 1746729581.0,
          "replies": [
            {
              "id": "mrds9t5",
              "author": "hungry4nuns",
              "body": "> “If people are still buying the same amount”\n\nAre they? That’s a significant if to hang the rest of the point on. \n\nThey can raise prices in one market but not another. Demand drops in the European market, fewer sales but overall make more profit to offset the losses in the US market due to the actions of US leadership. But the company probably take a hit overall due to tariffs and increased manufacturing costs. \n\nSo is this the new European price correct for the new market? No. \n\n“Things are priced at the maximum a market will pay” only applies to a free market. If you have a proportion that are deliberately priced out and cannot afford a product, they are forced to make do with an alternative product that does not fully meet their needs then it’s a restricted market. A free market requires unrestricted competition. \n\nWhen companies take themselves out of certain markets, there’s less competition within the market, less innovation less value to the consumer and more coercion to buy “whatever is left that they can access”, an inferior product. A free market has a full array of options across the board and the consumer sets the price by what they’re willing to pay. \n\nIn the 24TB hard drive example they’re directly taking themselves out of the entire EU market for this product line. In the euro price creep example they are taking themselves out of the bottom proportion in terms of affordability, therefore more and more products become inaccessible to the lower end of the market. That’s not a free market setting.",
              "score": 3,
              "created_utc": 1746775236.0,
              "replies": []
            },
            {
              "id": "mrp7pj0",
              "author": "DJEmirMixtapes",
              "body": "Yes, that is the problem with today's society, we have easier access to things and corporations have easier access to more customers, if we get lazy and don't try boycott or buy less of an item when it is priced too high then they will continue to price guage. Can you maybe go without updating your phone for a few models? Unfortunately, for a while there I kept outpacing hard drive capacity so had to keep upgrading every few years. At first, I had 2 x 4TB hard drives but then I was running out of room unfortunately the next generation only went to 6TB so I got two of those then I was running out of room I had to get 2 8TB then 2 12TB finally it took longer to fill those and by the time I needed new hard drives they were finally in the 20TB limits so I purchased two of those and now am set with two 20TB hard drives. But I have not updated my phone for a few gens now I have a Samsung Galaxy 20 Ultra and have not upgraded since the later generations removed the Micro SD card as many companies use that as a way to sell us Cloud Storage. I am sticking with m,y phone for the moment as I have a 1TB micro SD card and 500MB internal storage whereas the next generation only have 256GB 500GB internal but no ability to add additional storage. I feel if we complain about it and don't buy new phones they will need to lower their prices a bit for future releases. But most people can't wait for the latest next best thing and cannot go without the next upgrade even if some parts are a downgrade.",
              "score": 2,
              "created_utc": 1746937528.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mrc2495",
          "author": "AstroPhysician",
          "body": "> Things are priced at the maximum a market will pay\n\nEh not always. They weren't before covid but that changed",
          "score": 4,
          "created_utc": 1746747762.0,
          "replies": []
        },
        {
          "id": "mr8fos1",
          "author": "luvsads",
          "body": "Because Europe doesn't have a large enough consumer base. It's cut and dry.\n\nFor all the illiterate Europeans commenting \"yeah right,\" I'm talking about hard drives. You don't buy enough. Learn to read.",
          "score": -360,
          "created_utc": 1746707389.0,
          "replies": [
            {
              "id": "mr8hzr4",
              "author": "None",
              "body": "[deleted]",
              "score": 137,
              "created_utc": 1746708258.0,
              "replies": [
                {
                  "id": "mr8iqk3",
                  "author": "luvsads",
                  "body": "Yes, though storage/drive imports in the UK are expected to tank by 2028, too.",
                  "score": -207,
                  "created_utc": 1746708527.0,
                  "replies": [
                    {
                      "id": "mr8lo8f",
                      "author": "flac_rules",
                      "body": "That wasn't the question",
                      "score": 70,
                      "created_utc": 1746709574.0,
                      "replies": [
                        {
                          "id": "mr9n1c7",
                          "author": "luvsads",
                          "body": "What was the question? I said Europe doesn't have a large enough consumer base for hard drives. They asked uk. I said for now, but not by 2028. Learn to read",
                          "score": -41,
                          "created_utc": 1746720948.0,
                          "replies": [
                            {
                              "id": "mr9wji2",
                              "author": "Readonkulous",
                              "body": "And you clearly have no clue about what you are talking about. Bigger consumer base in the UK than the entirety of Europe? Fucking joke. ",
                              "score": 22,
                              "created_utc": 1746723724.0,
                              "replies": [
                                {
                                  "id": "mrai4py",
                                  "author": "luvsads",
                                  "body": "For these hard drives, that's correct. It isn't a joke. Why would toshiba be joking? There is probably a little bit of impact from WEEE or whatever it's called, but it's mostly numbers.",
                                  "score": -1,
                                  "created_utc": 1746729963.0,
                                  "replies": [
                                    {
                                      "id": "mrb2t4x",
                                      "author": "Readonkulous",
                                      "body": "More likely that they are diverting stock to the US to sell as much as possible before tariffs reduce demand, at which point they will send stock to the EU. This seems much more likely to be about squeezing the most money possible out of consumers rather than an actual paucity of demand in the EU. ",
                                      "score": 8,
                                      "created_utc": 1746736086.0,
                                      "replies": [
                                        {
                                          "id": "mrb8tqu",
                                          "author": "luvsads",
                                          "body": "Idk about more likely. NA and Asia are the two top markets. Beating tariffs is still plausible as part of the reason, though, like the article said\n\n> However, there might be a more elaborate strategy in place for Toshiba. The Japanese HDD maker might be more interested in shipping its highest-capacity models to the U.S. and its partners there, as this market is more important for the company. Toshiba may also attempt to ship as many high-end HDDs to its American stock as possible before country-specific tariffs kick in this July to grab some extra market share.\n> \n> If this is the case, we might see lowering shipments of other high-capacity Toshiba HDDs to mainland Europe as the company might be stockpiling them for its American customers in the U.S. Still, bear in mind that we are speculating and Toshiba hasn't communicated its strategy in detail.",
                                          "score": 1,
                                          "created_utc": 1746737848.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mr8mkjn",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 94,
                      "created_utc": 1746709889.0,
                      "replies": [
                        {
                          "id": "mraat9p",
                          "author": "trivial_vista",
                          "body": "Add France and UK is dwarfed by a lot",
                          "score": 6,
                          "created_utc": 1746727821.0,
                          "replies": []
                        },
                        {
                          "id": "mr9n5b8",
                          "author": "luvsads",
                          "body": "Storage drives. Europeans up in the comments unable to read. Jfc.",
                          "score": -15,
                          "created_utc": 1746720981.0,
                          "replies": [
                            {
                              "id": "mr9omw0",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 23,
                              "created_utc": 1746721421.0,
                              "replies": [
                                {
                                  "id": "mr9pxf1",
                                  "author": "luvsads",
                                  "body": "For hard drives, it is. Hence why Toshiba is making this decision. You go read. I already have, and you clearly aren't even understanding what I'm saying in plain english. I guarantee you're assuming I mean the whole consumer base rather than what the article and thread are talking about. \n\nI'll wait for numbers and happily concede if proven wrong that Europe buys more HDDs than the US and the UK.",
                                  "score": 0,
                                  "created_utc": 1746721804.0,
                                  "replies": [
                                    {
                                      "id": "mr9yg2t",
                                      "author": "kompergator",
                                      "body": "Can you even back that claim up with anything? I find it incredibly hard to believe that ~69 million people in the UK buy many more hard drives than the ~450 million in the EU and the whopping ~750 million people who live in geographical Europe.\n\nI think you are making wild assumptions that make zero sense.",
                                      "score": 21,
                                      "created_utc": 1746724273.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mr9ukbc",
                                      "author": "danabrey",
                                      "body": "When you say Europe do you mean the EU?",
                                      "score": 6,
                                      "created_utc": 1746723161.0,
                                      "replies": [
                                        {
                                          "id": "mrahqvi",
                                          "author": "luvsads",
                                          "body": "No, I mean the \"Europe\" market segment, which includes Norway, Switzerland, and everything between Croatia and Greece. Maybe some of those countries joined the EU in the last 5-10yrs, idk, but that's the group I'm talking about.",
                                          "score": 1,
                                          "created_utc": 1746729851.0,
                                          "replies": [
                                            {
                                              "id": "mraikd5",
                                              "author": "danabrey",
                                              "body": "So you should be including the UK in that definition, too, then.",
                                              "score": 6,
                                              "created_utc": 1746730090.0,
                                              "replies": [
                                                {
                                                  "id": "mranopb",
                                                  "author": "luvsads",
                                                  "body": "No, they aren't included. Ireland usually isn't, either. The UK has seen an increased demand in high capacity drives compared to Europe, but some forecasts show that tanking by 2028. Time will tell. Toshiba thinks there's enough money to be made there still",
                                                  "score": 1,
                                                  "created_utc": 1746731607.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "mra1mbo",
                                      "author": "yetanotherdave2",
                                      "body": "Considering the UK is in Europe it's not impossible that someone in another European country has bought a hard drive, making Europe as a whole the larger market.",
                                      "score": 5,
                                      "created_utc": 1746725195.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr8o39z",
              "author": "Scotty1928",
              "body": "It doesn't? Europe has a significantly larger population compared to the US.",
              "score": 90,
              "created_utc": 1746710409.0,
              "replies": [
                {
                  "id": "mr8vglu",
                  "author": "Nope_______",
                  "body": "More people doesn't necessarily mean a larger consumer base for HDDs. Consider disposable income, commercial needs, data centers, etc.",
                  "score": -56,
                  "created_utc": 1746712807.0,
                  "replies": [
                    {
                      "id": "mr8vv6h",
                      "author": "Scotty1928",
                      "body": "No it really doesn't, that is true. But at some point there's so many people that it actually does. Especially now that the US fucks up big time and there will be rising demand for european data centers.",
                      "score": 36,
                      "created_utc": 1746712934.0,
                      "replies": [
                        {
                          "id": "mr97bh1",
                          "author": "None",
                          "body": "[removed]",
                          "score": -54,
                          "created_utc": 1746716365.0,
                          "replies": [
                            {
                              "id": "mr98yxp",
                              "author": "Parcours97",
                              "body": "Wdym? They are subject to the EU Commission if they operate in the EU as you can see by the fines Google, Meta and Microsoft receive.",
                              "score": 41,
                              "created_utc": 1746716849.0,
                              "replies": [
                                {
                                  "id": "mr9agi8",
                                  "author": "None",
                                  "body": "[removed]",
                                  "score": -40,
                                  "created_utc": 1746717286.0,
                                  "replies": [
                                    {
                                      "id": "mr9k3so",
                                      "author": "SmallLetter",
                                      "body": "Asinine? Consumer protection is asinine now? Nevermind don't answer I'm sure it will be not worth reading",
                                      "score": 30,
                                      "created_utc": 1746720079.0,
                                      "replies": [
                                        {
                                          "id": "mr9ptkb",
                                          "author": "None",
                                          "body": "[deleted]",
                                          "score": -32,
                                          "created_utc": 1746721772.0,
                                          "replies": [
                                            {
                                              "id": "mr9r84f",
                                              "author": "SmallLetter",
                                              "body": "Love it",
                                              "score": 7,
                                              "created_utc": 1746722190.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "mr9zex2",
                                      "author": "kompergator",
                                      "body": "You are incredibly far up the rear end of companies who have long ago sold you out completely. They stole your data, and yet you still lick their boots clean.\n\nJesus Christ man, you’re pathetic. Wake up, and smell the ashes of what they took from you and burnt up to earn a profit.\n\nYeah, we have some strict rules here in the EU. Those are contrary to many US business practices. Those business practices are criminal, at least in civilised countries where the governments’ main goal is to serve the people – not the oligarchs, a dictator or both.",
                                      "score": 12,
                                      "created_utc": 1746724557.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mr9ywkp",
                              "author": "kompergator",
                              "body": "You mean the clearly laid out rules and regulations that are there to protect the EU’s population from having their data used without their consent or abused? \n\nFrankly, I don’t want companies here that would like to do that to my data. On the other hand, even those companies might find it easier to follow EU guidelines and rules than the arbitrary rollercoaster of the incredibly stupid Trump regime. Flipflopping every day, providing no stability for companies.",
                              "score": 11,
                              "created_utc": 1746724405.0,
                              "replies": []
                            },
                            {
                              "id": "mrabit1",
                              "author": "trivial_vista",
                              "body": "Google is headquartered in Dublin entirely within Europe and the EU",
                              "score": 6,
                              "created_utc": 1746728025.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mr8w7ta",
                          "author": "Nope_______",
                          "body": "At some point sure, but maybe we aren't at that point. There are things with a larger consumer base in the US than China and China has way more people than the US or Europe.",
                          "score": -38,
                          "created_utc": 1746713045.0,
                          "replies": [
                            {
                              "id": "mr8x1u1",
                              "author": "Scotty1928",
                              "body": "Sure, but europe has 750m people, that's double the US has, and after all the UK gets the drive, no?\nWe could also do a deep dive into what \"disposable income\" means for each and how it differs but that would be too much for this r/.",
                              "score": 25,
                              "created_utc": 1746713305.0,
                              "replies": [
                                {
                                  "id": "mr8zqf0",
                                  "author": "Nope_______",
                                  "body": "I doubt they're including Russia and Turkey (or any other European country not in the EEA) in the \"European market\" but I could be wrong. Then it's a lot closer to the US population. And maybe the costs to enter the European market make it not worth whatever size consumer base is there compared to the US or UK. You'd have to ask Toshiba, I'm just making the point that more people doesn't mean more consumers of a certain product.\n\nChina has several times the US population but a smaller consumer base for certain products, so having more people doesn't always mean more consumers of a certain product.\n\nIf you have a better source of data or better method of determining disposable income than OECD, I'd certainly be interested to see it.",
                                  "score": -18,
                                  "created_utc": 1746714113.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mr9suqj",
                      "author": "Contundo",
                      "body": "More people = bigger data centres.",
                      "score": 5,
                      "created_utc": 1746722667.0,
                      "replies": [
                        {
                          "id": "mr9tfex",
                          "author": "Nope_______",
                          "body": "Not necessarily. California and Cameroon have a similar population. Do you really think their data center needs are the same?",
                          "score": -3,
                          "created_utc": 1746722834.0,
                          "replies": [
                            {
                              "id": "mr9uu0x",
                              "author": "Contundo",
                              "body": "Now Europe isn’t exactly Cameroon",
                              "score": 10,
                              "created_utc": 1746723238.0,
                              "replies": [
                                {
                                  "id": "mra0b8y",
                                  "author": "Nope_______",
                                  "body": "Nope but it makes the point. Now we both agree that more people won't always have/need bigger data centers, so you can delete your earlier comment at your convenience now.",
                                  "score": -6,
                                  "created_utc": 1746724818.0,
                                  "replies": [
                                    {
                                      "id": "mra750m",
                                      "author": "Scotty1928",
                                      "body": "It also does not make the point the way you'd like it. California is no independent nation.",
                                      "score": 5,
                                      "created_utc": 1746726767.0,
                                      "replies": [
                                        {
                                          "id": "mraah1g",
                                          "author": "Nope_______",
                                          "body": "So you want me to find two similarly sized countries that have different data storage needs? Is that really going to be more convincing to you, or are you just grasping?",
                                          "score": 0,
                                          "created_utc": 1746727722.0,
                                          "replies": [
                                            {
                                              "id": "mraalf8",
                                              "author": "Scotty1928",
                                              "body": "No, i want you to find comparable entities, which you seem not to be capable of.",
                                              "score": 0,
                                              "created_utc": 1746727758.0,
                                              "replies": [
                                                {
                                                  "id": "mrac03h",
                                                  "author": "Nope_______",
                                                  "body": "Rofl ok, how about Sweden vs Dominican Republic. Same population. Same data storage needs or no? \n\nHappy now?",
                                                  "score": 1,
                                                  "created_utc": 1746728164.0,
                                                  "replies": [
                                                    {
                                                      "id": "mrac6rx",
                                                      "author": "Scotty1928",
                                                      "body": "See? Told you so.",
                                                      "score": 1,
                                                      "created_utc": 1746728218.0,
                                                      "replies": [
                                                        {
                                                          "id": "mractvl",
                                                          "author": "Nope_______",
                                                          "body": "The statement was more people = bigger data centers. I've shown that isn't true. What exactly do you want?",
                                                          "score": 1,
                                                          "created_utc": 1746728406.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mracfe1",
                              "author": "trivial_vista",
                              "body": "Density is a lot lower also it being not a first world country brings a lot of effort and money to get it on the same level, stupid take comparing California to Cameroon",
                              "score": 3,
                              "created_utc": 1746728288.0,
                              "replies": [
                                {
                                  "id": "mracos4",
                                  "author": "Nope_______",
                                  "body": "The statement was \"more people = bigger data centers.\" That isn't true.",
                                  "score": 3,
                                  "created_utc": 1746728364.0,
                                  "replies": [
                                    {
                                      "id": "mradd9x",
                                      "author": "trivial_vista",
                                      "body": "Oké in that case stand corrected, didn’t see that reply before weird ways of showing previous comments again on Reddit (use this platform for years)",
                                      "score": 1,
                                      "created_utc": 1746728563.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mr974au",
                  "author": "None",
                  "body": "[removed]",
                  "score": -40,
                  "created_utc": 1746716306.0,
                  "replies": [
                    {
                      "id": "mra1oox",
                      "author": "OverSoft",
                      "body": "You do realize the EU isn’t one country right? There are multiple countries that are on par of slightly below the US in terms of disposable income, and the data center sector (which is where 90% of the drives are going) is only expanding in the next two decades.",
                      "score": 6,
                      "created_utc": 1746725214.0,
                      "replies": [
                        {
                          "id": "mrabn5n",
                          "author": "PresumedSapient",
                          "body": "Not who you responded to, but they probably did realize that.\n\n\nThe comment above claimed the EU is a larger market and thus should command equal/similar treatment from Toshiba. It is only larger if you just count people. And while some Europeans have equal or more disposable income than the american average, the vast majority has less, hence why the EU average is so much lower, therefore the EU market for luxury consumer goods is smaller, and thus does not command the same treatment from Toshiba.  \n\n\nI do think it's a stupid decision though, since we here in Europe are absolutely moving away from US digital infrastructure, so we're going to want those drives. ",
                          "score": 2,
                          "created_utc": 1746728060.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mr9zobw",
                      "author": "kompergator",
                      "body": ">Note, this is disposable income, after subtracting taxes, healthcare expenses, cost of living, ect. from the total income.\n\nDoes it factor in average price differences?",
                      "score": 5,
                      "created_utc": 1746724634.0,
                      "replies": []
                    },
                    {
                      "id": "mr988ob",
                      "author": "micro_bee",
                      "body": "And it gets even crazier if you include consumer debt that keep growing and  growing in the US, they really buy a lot of shit",
                      "score": 8,
                      "created_utc": 1746716635.0,
                      "replies": [
                        {
                          "id": "mr9q6m8",
                          "author": "luvsads",
                          "body": "\"Buy em if you got em\"",
                          "score": -2,
                          "created_utc": 1746721880.0,
                          "replies": [
                            {
                              "id": "mr9qrcz",
                              "author": "Ponk2k",
                              "body": "They don't, hence the debt",
                              "score": 10,
                              "created_utc": 1746722053.0,
                              "replies": [
                                {
                                  "id": "mr9ram4",
                                  "author": "luvsads",
                                  "body": "You clearly missed the joke.",
                                  "score": -4,
                                  "created_utc": 1746722210.0,
                                  "replies": [
                                    {
                                      "id": "mr9rr4q",
                                      "author": "Ponk2k",
                                      "body": "Is that what that was supposed to be?",
                                      "score": 6,
                                      "created_utc": 1746722346.0,
                                      "replies": [
                                        {
                                          "id": "mr9s8cf",
                                          "author": "luvsads",
                                          "body": "Yup.",
                                          "score": -1,
                                          "created_utc": 1746722486.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr8wc86",
              "author": "frogking",
              "body": "That’s true, we live in huts and ride bicycles.",
              "score": 28,
              "created_utc": 1746713084.0,
              "replies": [
                {
                  "id": "mr9v6p9",
                  "author": "UnholyAbductor",
                  "body": "Not gonna lie…long, long fucking time ago back when I was still stuck in my American bubble I used to think I’d see a lot of older cars and tech being used in European countries when I went on holiday, because again, ignorant idiot I was/still kind of am. \n\nReally glad I got the chance to be proven an idiot and learned from it before we managed to sour our shit reputation even more with the world. Doubt I’ll get that chance again.",
                  "score": 10,
                  "created_utc": 1746723338.0,
                  "replies": [
                    {
                      "id": "mrazftu",
                      "author": "frogking",
                      "body": "Travelling is the best cure for ignorance. Europe is very diverse and even we have “faulty” conceptions about other European countries :-)",
                      "score": 5,
                      "created_utc": 1746735092.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr9nlnm",
                  "author": "luvsads",
                  "body": "And don't buy enough hard drives. Same way we don't get certain types of cars in the US due to not having a market for it.",
                  "score": -8,
                  "created_utc": 1746721117.0,
                  "replies": [
                    {
                      "id": "mrazr0d",
                      "author": "frogking",
                      "body": "There’s going to be a rush to get out of AWS, Azure and Google Cloud.. we are going to need drives soon. And we remember.",
                      "score": 2,
                      "created_utc": 1746735185.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr940ca",
              "author": "Acrobatic_Rub_8218",
              "body": "You need to be reminded that Europe has about 30% more people in it when compared to the USA. They also have a more stable economy over there, due to them not being run by a bunch of incompetent Nazis.",
              "score": 19,
              "created_utc": 1746715388.0,
              "replies": [
                {
                  "id": "mr9msmb",
                  "author": "luvsads",
                  "body": "It isn't about people. It's about how many storage drives are purchased. Yall are getting upset about neutral, cut, and dry facts. This isn't \"who's better\" it's literally a number of hard drives purchased.",
                  "score": -1,
                  "created_utc": 1746720876.0,
                  "replies": [
                    {
                      "id": "mra1xuy",
                      "author": "Acrobatic_Rub_8218",
                      "body": "The “consumer base” that you mentioned is made up of people… or Soylent Green if you prefer.",
                      "score": 3,
                      "created_utc": 1746725290.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr9e686",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -43,
                  "created_utc": 1746718369.0,
                  "replies": [
                    {
                      "id": "mr9jneb",
                      "author": "flextendo",
                      "body": "you need to be reminded that half the tech „coming“ from the US is not developed in the US and has significant hubs in the EU. You also need to be reminded that regulation is not bad, but hey get fucked by the US companies in every aspect, good luck!",
                      "score": 25,
                      "created_utc": 1746719946.0,
                      "replies": [
                        {
                          "id": "mr9mxyd",
                          "author": "luvsads",
                          "body": "It is developed in the US. It's not manufactured here. Google who does the most advanced development and research in tech.",
                          "score": -6,
                          "created_utc": 1746720919.0,
                          "replies": [
                            {
                              "id": "mr9p1cb",
                              "author": "flextendo",
                              "body": "Its also not developed in the US alone, thats why they have tech centers across the world. Let me give you an example, apple develops its modem chips in munich germany.\n\nEdit, google utilizes an unholy amount of HB1 visas, so do you count that as „US“ developed? almost 50% of major publications in the US are written by guest researches, H1Bs etc",
                              "score": 12,
                              "created_utc": 1746721540.0,
                              "replies": [
                                {
                                  "id": "mr9qyis",
                                  "author": "luvsads",
                                  "body": "It does not develop its modern chips in Germany lmfao. Thr 5G chip is not modern. They are very explicit about developing their new silicon in Silicon Valley and are now manufacturing them via TSMC in the states, too.\n\nI hadn't heard the 50% number you just threw out. Can you link me to where you read about that? I'm curious how that happened/impacts",
                                  "score": -2,
                                  "created_utc": 1746722112.0,
                                  "replies": [
                                    {
                                      "id": "mr9y5ol",
                                      "author": "flextendo",
                                      "body": "Dude…I literally have friends working on it. Also their M processors were partly developed and verified there. As someone in the industry I think I have a pretty good insight into it.\n\nLOL they are NOT yet producing in the US, the throughput is not even close to what they need…please read up on it.\n\nhttps://www.nsf.gov/nsb/news/news_summ.jsp?cntn_id=309184#:~:text=In%202022%2C%20the%20U.S.%20Patent,53%25%20went%20to%20foreign%20inventors.\n\nhttps://www.sciencedirect.com/science/article/abs/pii/S0048733324001264",
                                      "score": 8,
                                      "created_utc": 1746724189.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mr9rxs0",
                          "author": "None",
                          "body": "[deleted]",
                          "score": -25,
                          "created_utc": 1746722400.0,
                          "replies": [
                            {
                              "id": "mr9z4ij",
                              "author": "flextendo",
                              "body": "Dude, the things you use daily probably had some smart non US inventor. remember einstein - german, Konrad Zuse - german. Just a few examples of the people that literally laid groundwork for your comfortable life. I mean why even argue with you, the most R&D you‘ve been involved with is building a PBJ after 6 budweiser.",
                              "score": 9,
                              "created_utc": 1746724471.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mr9yj6l",
                      "author": "Readonkulous",
                      "body": "You realise this entire discussion is about a Japanese company selling stock to the US before idiotic tariffs come in, right? ",
                      "score": 9,
                      "created_utc": 1746724298.0,
                      "replies": []
                    },
                    {
                      "id": "mra1x7q",
                      "author": "None",
                      "body": "[removed]",
                      "score": 7,
                      "created_utc": 1746725285.0,
                      "replies": [
                        {
                          "id": "mra37jg",
                          "author": "Acrobatic_Rub_8218",
                          "body": "That’s a spicy comeback. \n\nI’m gonna have to remember that one. \n\nIt’s so accurate too. Any American who has been outside their run-down welfare-for-the-rich country would know how backwards and fucked up everything there is.",
                          "score": 3,
                          "created_utc": 1746725653.0,
                          "replies": [
                            {
                              "id": "mreib2e",
                              "author": "luvsads",
                              "body": "Listen to yourselves. lmao yall straight up thrive off of and run on hate. You have no idea if that commenter has a passport or not. Jfc lol",
                              "score": -1,
                              "created_utc": 1746790426.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mra0ggh",
                      "author": "kompergator",
                      "body": "> You need to remember that Europe is a shithole and regulated itself out of being competitive at anything. That’s why they rely on America for tech and have a shitty economy\n\nGet a load of the American calling others shithole. You guys don’t even have stable electricity in large parts of your country, and your houses are mostly made of materials that wouldn’t be used in the EU to build a doghouse. \n\nUnless you live in NY or some of the other metropolises, you live in a Third World country. The worst village in Germany would be 10 times more liveable than the average village in the US. Not even factoring in the shit your countrymen are allowed to put in your food (literally using carcinogens in kid’s cereal just to make it colourful, chlorinated chicken, etc.). \n\nGet off your high horse, especially considering you just voted in a dictator who is completely stupid. You have got no leg to stand on in terms of telling the rest of the world how to do things. You can’t even govern yourselves, you pathetic joke of a country.",
                      "score": 8,
                      "created_utc": 1746724861.0,
                      "replies": [
                        {
                          "id": "mrb7asv",
                          "author": "None",
                          "body": "[deleted]",
                          "score": -7,
                          "created_utc": 1746737400.0,
                          "replies": [
                            {
                              "id": "mrd8fwl",
                              "author": "MeateaW",
                              "body": "I live in a country where I don't fear for my life *ever*.\n\nBeen to a school recently?",
                              "score": 3,
                              "created_utc": 1746764366.0,
                              "replies": []
                            },
                            {
                              "id": "mrdj1ea",
                              "author": "kompergator",
                              "body": "I haven’t experienced a loss of electricity since 2005. Neither has the rest of my country. \n\nWhat you’re referring to is literally a once in a generation event. Meanwhile the US can barely keep the lights on in rural areas when a slight wind is coming up. \n\nBut keep believing your delusions of living in a developed country. Just never visit Europe, your eyes will fall out when you see the that the quality of hundreds of year old buildings surpasses that of your newly built paper houses.",
                              "score": 2,
                              "created_utc": 1746769787.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mrapik5",
                          "author": "None",
                          "body": "[deleted]",
                          "score": -8,
                          "created_utc": 1746732153.0,
                          "replies": [
                            {
                              "id": "mrdj46v",
                              "author": "kompergator",
                              "body": "The internet was invented in Europe by a Brit. You americucks don’t even know the slightest bit of history.",
                              "score": 3,
                              "created_utc": 1746769830.0,
                              "replies": [
                                {
                                  "id": "mrezdoj",
                                  "author": "None",
                                  "body": "[deleted]",
                                  "score": -1,
                                  "created_utc": 1746797077.0,
                                  "replies": [
                                    {
                                      "id": "mrh0txm",
                                      "author": "kompergator",
                                      "body": "I haven’t feared for my life ever. How’s your school system going?",
                                      "score": 1,
                                      "created_utc": 1746819753.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr8ogz8",
              "author": "dosk3",
              "body": "You are delusional",
              "score": 17,
              "created_utc": 1746710538.0,
              "replies": [
                {
                  "id": "mr9n9fd",
                  "author": "luvsads",
                  "body": "Show me numbers. Europeans on reddit love making these claims, but yall deadass never actually have evidence. Everyone knows Europe is dirt poor.",
                  "score": -9,
                  "created_utc": 1746721015.0,
                  "replies": [
                    {
                      "id": "mra5cnj",
                      "author": "Green-Amount2479",
                      "body": "Man I’m not a fan of rhetoric trickeries. You were the one who claimed to know details of the global HDD distribution going by your first comment. So you should be the one to prove your claim.\n\nI know well where to get those numbers and it’s highly unlikely for you to have personal access to that detailed data. Those are very granular reports but they are extremely expensive because they generally include the market forecasts like the ones at IDC which are 7,500 just for something like the previous market share and 40k for details on the HDD market including granular sales data and forecasts.\n\nIf you got your hands on a comprehensive summary somewhere to support **your** initial claim, you could just give us the link.",
                      "score": 10,
                      "created_utc": 1746726260.0,
                      "replies": [
                        {
                          "id": "mragrhq",
                          "author": "luvsads",
                          "body": "You're acting like I'm playing a trick, and/or you have access to secret data other people don't. Fairfield Research, market data, etc. are all publicly available. The US dominates the EU/UK market, and Asia dominates all of us.",
                          "score": 1,
                          "created_utc": 1746729563.0,
                          "replies": [
                            {
                              "id": "mrbr5mw",
                              "author": "Green-Amount2479",
                              "body": "Then it shouldn't be difficult to cite a source that supports your claim, should it? Yet, you didn't again.\n\nRegarding how I ‚act‘:\n1. You make a claim with no source, then turn the tables on your opponent, demanding a source that supports their claim and negates yours. That’s a simple rhetorical trick.\n2. It’s not ‚secret data‘ but it’s also not readily available so you can’t name them as a source for a public discussion. The complete Fairfield report you just mentioned, where you could look at the market data for HDDs **by country** also costs close to $5000.",
                              "score": 3,
                              "created_utc": 1746743863.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mrd8yto",
                      "author": "MeateaW",
                      "body": "> In 2023, FEANTSA estimated that at least 895,000 people were homeless in Europe\n\n> The current population of Europe is estimated to be around 744.5 million people.\n\n> In January 2024, the US Department of Housing and Urban Development (HUD) reported that over 771,480 individuals were experiencing homelessness in the United States.\n\n> The current population of the United States of America is 346,967,713\n\n\n 895000 / 744000000 = 0.0012029569892473  \n 771480 / 346967713 = 0.0022234921898915\n\nSo, Europe has half as many homeless people (per capita) than the USA.\n\nRemind me, do the dirtpoor people have homes?",
                      "score": 3,
                      "created_utc": 1746764620.0,
                      "replies": [
                        {
                          "id": "mregadg",
                          "author": "luvsads",
                          "body": "First off, your numbers are wrong. Quick Google search even shows FEANSTA reporting ~1.3M homeless in Europe as of 2025. Same number from EU Datasets and Eurocities. Bringing Europe's ratio up to .0017-.0018.\n\nhttps://eurocities.eu/latest/housing-first-in-cities-a-transformative-approach-to-homelessness\n\nThis is a dumb metric anyway, for many reasons. The better and  actually used metric is GDP. US GDP is over 30% greater than Europe. Which is a huge driver in Toshibas' decision.\n\nSecond off, how does this prove Euorpe buys enough hard drives for Toshiba to bring their high capacity ones there? Stg, yall are just here to argue. You're not even arguing about the article OP posted. You're just arguing for the sake of arguing, lol I want to see numbers showing Toshiba made the wrong decision",
                          "score": 1,
                          "created_utc": 1746789504.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mra6szr",
              "author": "binogamer21",
              "body": "Source: just trust me bro",
              "score": 3,
              "created_utc": 1746726671.0,
              "replies": []
            },
            {
              "id": "mra7jxy",
              "author": "Senaxx",
              "body": "Keep digging",
              "score": 2,
              "created_utc": 1746726885.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mr8m36s",
      "author": "rasz_pl",
      "body": "Something tells me its about EU mandatory warranty.",
      "score": 315,
      "created_utc": 1746709722.0,
      "replies": [
        {
          "id": "mr8qsdg",
          "author": "Yodl007",
          "body": "Tell me you expect the drives to fail within 2 years, without telling it !",
          "score": 168,
          "created_utc": 1746711316.0,
          "replies": []
        },
        {
          "id": "mramqe3",
          "author": "UTOPROVIA",
          "body": "The n300 & n300 pro are for power users and small businesses. It very well could be true like the article says: \"not enough demand\"\n\nIn the EU, they sell the better MG-11 for enterprise. \n\nWD and Seagate are big names. I've seen plenty of car manufacturers scrap a good product line because people weren't jumping ship to a lesser known or new player in a particular market segment.",
          "score": 11,
          "created_utc": 1746731325.0,
          "replies": []
        },
        {
          "id": "mracuz6",
          "author": "caleb39411",
          "body": "The UK has a statutory warranty 4 years (3 in Scotland) longer than the EU requirement, so I can’t imagine this is the case.",
          "score": 36,
          "created_utc": 1746728414.0,
          "replies": [
            {
              "id": "mram9re",
              "author": "45MonkeysInASuit",
              "body": "it's 6 and 5 years\n\n> Customers have up to 6 years to make a claim for an item they’ve bought from you (5 years in Scotland).\n\nBut burden of proof that the fault was there at purchase is on the consumer after 6 months.\n\nhttps://www.gov.uk/accepting-returns-and-giving-refunds",
              "score": 27,
              "created_utc": 1746731186.0,
              "replies": [
                {
                  "id": "mrbq52h",
                  "author": "EuHypaH",
                  "body": "They did say “longer than” ;) (2+4 and 2+3)",
                  "score": 9,
                  "created_utc": 1746743500.0,
                  "replies": []
                },
                {
                  "id": "mrbwcmc",
                  "author": "CardmanNV",
                  "body": "You mean you don't completely dismantle and lab test every HDD you buy?",
                  "score": 2,
                  "created_utc": 1746745696.0,
                  "replies": []
                },
                {
                  "id": "mrtccn0",
                  "author": "Ludwig234",
                  "body": "That's honestly pretty poor.\nI actually prefer 2 years of burden on the seller and one extra year of burden on the consumer.",
                  "score": 1,
                  "created_utc": 1746999392.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr92kl0",
          "author": "ZealousidealEntry870",
          "body": "Which is how long? Most drives like this come with a 5 year warranty.",
          "score": 9,
          "created_utc": 1746714962.0,
          "replies": [
            {
              "id": "mr9rjwp",
              "author": "Oh_ffs_seriously",
              "body": "My Toshiba P300 had a 2 year warranty, and I know that because failed after two and a half years.",
              "score": 11,
              "created_utc": 1746722286.0,
              "replies": [
                {
                  "id": "mra1g67",
                  "author": "ZealousidealEntry870",
                  "body": "You had a 24tb drive fail after 2 years?",
                  "score": 1,
                  "created_utc": 1746725145.0,
                  "replies": [
                    {
                      "id": "mraafns",
                      "author": "Drone30389",
                      "body": "P300 is 3 TB max",
                      "score": 5,
                      "created_utc": 1746727711.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr99xdc",
              "author": "bindermichi",
              "body": "Not all of them",
              "score": 10,
              "created_utc": 1746717130.0,
              "replies": [
                {
                  "id": "mra1mw0",
                  "author": "ZealousidealEntry870",
                  "body": "We’re talking about a specific drive.",
                  "score": 0,
                  "created_utc": 1746725200.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mr9h2b2",
              "author": "IdiAmini",
              "body": "The amount of time a person can reasonably expect a product to last",
              "score": 4,
              "created_utc": 1746719202.0,
              "replies": [
                {
                  "id": "mr9kvwg",
                  "author": "Tech_Itch",
                  "body": "Only in some countries. EU itself only mandates a 2 year warranty. The country-specific ones can be as long as \"the reasonable expected useful lifetime of a product\" for manufacturing defects, though.",
                  "score": 7,
                  "created_utc": 1746720310.0,
                  "replies": []
                },
                {
                  "id": "mra1kjq",
                  "author": "ZealousidealEntry870",
                  "body": "Which is how long? These drives come with a 5 year warranty.",
                  "score": 1,
                  "created_utc": 1746725181.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mrb01h4",
          "author": "ToMorrowsEnd",
          "body": "this.   Toshiba drives have a very high failure rate and they hate having warranty enforced.",
          "score": 1,
          "created_utc": 1746735271.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr8ja5l",
      "author": "ChloeWade",
      "body": "Ah yes, the UK. My favorite non-European country. Why do people say Europe when they mean the EU?",
      "score": 112,
      "created_utc": 1746708724.0,
      "replies": [
        {
          "id": "mr8lc2s",
          "author": "floluk",
          "body": "Actually, they don’t mean the EU either. They mean the EEA (European Economic Area), the Customs Union",
          "score": 120,
          "created_utc": 1746709455.0,
          "replies": [
            {
              "id": "mr9b1px",
              "author": "None",
              "body": "[removed]",
              "score": -49,
              "created_utc": 1746717460.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr9uzmi",
          "author": "WurserII",
          "body": "Why do people say America when they mean USA? ",
          "score": 9,
          "created_utc": 1746723282.0,
          "replies": [
            {
              "id": "mrahe1w",
              "author": "namerankserial",
              "body": "I found it interesting that Latin American's never refer to the US as America.  America is the whole continent(s).  The USA, is Estados Unidos.\n\nI sometimes use \"The States\" or \"The US\" here in Canada, but if you say America, everyone will still assume you mean the US.",
              "score": 7,
              "created_utc": 1746729747.0,
              "replies": [
                {
                  "id": "mraxelc",
                  "author": "doodler1977",
                  "body": "> if you say America, everyone will still assume you mean the US\n\nYEP\n\neveryone else can make the jackoff motion all the want, but it's called a colloquial shorthand.",
                  "score": 8,
                  "created_utc": 1746734487.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mrbcmd9",
              "author": "Programmdude",
              "body": "Because that's what english speakers use when talking about the country. We use \"North America\" or \"the Americas\" when talking about the continent.\n\nIn spanish, Canadians might be Americans, but in english, they certainly are not (and would probably get offended at you for implying it).\n\nOn the other hand, Europe should only be used for the continent, which includes the UK, never for the EU or EEA.",
              "score": 3,
              "created_utc": 1746739021.0,
              "replies": []
            },
            {
              "id": "mrp7zau",
              "author": "DJEmirMixtapes",
              "body": "You missed that they actually said Mericuh!!! LOL It's the Made America Plagued Again guys.",
              "score": 1,
              "created_utc": 1746937660.0,
              "replies": []
            },
            {
              "id": "mrax9gk",
              "author": "doodler1977",
              "body": "because who else would they be talking about?  ;-)",
              "score": 1,
              "created_utc": 1746734444.0,
              "replies": [
                {
                  "id": "mrequmy",
                  "author": "wntf",
                  "body": "is there more than one place where simpletons exist who cant deal with more than one word at a time? ",
                  "score": 2,
                  "created_utc": 1746793971.0,
                  "replies": [
                    {
                      "id": "mreximr",
                      "author": "doodler1977",
                      "body": "Reddit?",
                      "score": 0,
                      "created_utc": 1746796426.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mrbsc5y",
                  "author": "CanuckBacon",
                  "body": "The continent of America in the same way that Europe means the continent of Europe.",
                  "score": -3,
                  "created_utc": 1746744278.0,
                  "replies": [
                    {
                      "id": "mrefv4b",
                      "author": "Nitr0_CSGO",
                      "body": "From what I've seen when referring to continental America, people say 'The Americas'",
                      "score": 1,
                      "created_utc": 1746789305.0,
                      "replies": [
                        {
                          "id": "mreoicd",
                          "author": "CanuckBacon",
                          "body": "That does happen frequently in English, but is not the case in many other languages.",
                          "score": 1,
                          "created_utc": 1746793046.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mrbz8ze",
                      "author": "doodler1977",
                      "body": "which \"continent of America\"?\n\nAlso: is there a country with Europe in its name?  Europa?  Does it FUCKING DOMINATE to the point that it's synonymous?  \n\nis there a country in Europe that stretches from sea to motherfuckin shining sea?  and no, Russia doesn't count.",
                      "score": 0,
                      "created_utc": 1746746726.0,
                      "replies": [
                        {
                          "id": "mrc1wt8",
                          "author": "CanuckBacon",
                          "body": "The one that contains countries like the USA, Mexico, Brazil, and Nicaragua. It's a pretty well known one. \n\nSometimes people say Europe when they mean the European Union. It's not a country necessarily, but does regulate a lot of things that countries ordinarily would.",
                          "score": 3,
                          "created_utc": 1746747687.0,
                          "replies": [
                            {
                              "id": "mre3za7",
                              "author": "jaa101",
                              "body": "The English-speaking world generally goes with there being seven continents and then North and South America are collectively the Americas.  That leaves \"America\" (singular) free to mean the USA.  Now Spanish-speaking countries are more likely to consider the Americas as just one continent ... and so they have a different name for the USA.",
                              "score": 1,
                              "created_utc": 1746782776.0,
                              "replies": []
                            },
                            {
                              "id": "mreis2u",
                              "author": "Punman_5",
                              "body": "There is no continent that contains both the USA and Brazil.",
                              "score": 1,
                              "created_utc": 1746790641.0,
                              "replies": [
                                {
                                  "id": "mreof85",
                                  "author": "CanuckBacon",
                                  "body": ">The Americas, sometimes collectively called America\n\nhttps://en.wikipedia.org/wiki/Americas",
                                  "score": 0,
                                  "created_utc": 1746793011.0,
                                  "replies": [
                                    {
                                      "id": "mrfpzva",
                                      "author": "Punman_5",
                                      "body": "A colloquialism is not geography. There is no continent of America as recognized by geographers. There is a north and a South America, but no single America.",
                                      "score": 1,
                                      "created_utc": 1746805489.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mrdt5sx",
                              "author": "Difficult_Bird969",
                              "body": "That’s two continents in your example lmao, not one.\n\nThere isn’t an America continent either, so I don’t understand the pedantry.\n\nThere’s a North America continent and a South America continent, and most people living in them refer to themselves by their country. The USA is “The United States of America” shortened to “America”. It’s entirely valid. Just like we can say China instead of “The Peoples Republic of China”.",
                              "score": -1,
                              "created_utc": 1746775803.0,
                              "replies": [
                                {
                                  "id": "mre3ddm",
                                  "author": "fafarex",
                                  "body": ">That’s two continents in your example lmao, not one.\n\n>There isn’t an America continent either, so I don’t understand the pedantry.\n\nThere isn't only on model what the continent are, this, whole exchange is an exemple of how \"American\" can only look at their belly buttons and are persuaded it encompass the world.",
                                  "score": 3,
                                  "created_utc": 1746782388.0,
                                  "replies": [
                                    {
                                      "id": "mre46la",
                                      "author": "Difficult_Bird969",
                                      "body": ">There isn't only on model what the continent are\n\nThe other popular model in non english countries does not combine north and south america, it combines asia and europe. Sorry buddy, but this has nothing to do with Americans, quite literally two separate and distinct plates.\n\nI'm sorry that a country being named after the continent they are on is too much to comprehend.",
                                      "score": 0,
                                      "created_utc": 1746782905.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "mrp8ds4",
                                  "author": "DJEmirMixtapes",
                                  "body": "China is still just China as that is the name of the country itself, but there are other countries in America other than just the United States. Still, it is a well-established practice to call The United States of America by just saying America or rather Mericuh! LOL",
                                  "score": 1,
                                  "created_utc": 1746937861.0,
                                  "replies": [
                                    {
                                      "id": "mrpb5ea",
                                      "author": "Difficult_Bird969",
                                      "body": "America is literally the name of the country, just like China is. Jfc. “United States” is literally describing a form of governance, just like “People’s republic”. There’s no rule saying your country can’t have the same name as the continent, and there’s no rule saying you can’t refer to yourself as either part of that.\n\nAnd again, even the people that don’t differentiate south and North America, still recognize that there are two (more actually) plates that each sit on, which is a valid definition of a continent elsewhere, which is just a made up term to describe boundaries. None of that takes away from a country calling themselves whatever the fuck they want.\n\nPeople from Brazil don’t call themselves American, people from Guatemala don’t, people from Chile don’t, people from Mexico don’t, so the pedantry in practice is pointless as literally no one in the Americas is going to be confused when you say American. It’s only you guys that like to pretend, everyone else has it figured out.",
                                      "score": 1,
                                      "created_utc": 1746939248.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mrexhmg",
                              "author": "doodler1977",
                              "body": "interesting. sometimes people use geographical names colloquially?  YOU DON'T SAY!",
                              "score": 0,
                              "created_utc": 1746796416.0,
                              "replies": [
                                {
                                  "id": "mrext1i",
                                  "author": "CanuckBacon",
                                  "body": "You asked the question, I just answered it. I'm glad you learned something.",
                                  "score": 1,
                                  "created_utc": 1746796527.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mreipcn",
                      "author": "Punman_5",
                      "body": "Nobody assumes that when someone says “America” it means the continent. They either say North America, South America, or The Americas, to refer to the continents. “America” on its own refers to the United States. People from the US are called Americans, too, not United Statesians.",
                      "score": 0,
                      "created_utc": 1746790607.0,
                      "replies": [
                        {
                          "id": "mreor2l",
                          "author": "CanuckBacon",
                          "body": "People have different perspectives. Yours is more common in English, but mine is more common globally. Both should be understood, which is why I answered the person's question.",
                          "score": 1,
                          "created_utc": 1746793143.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr9wrxv",
              "author": "LetGoPortAnchor",
              "body": "Because that is what everybody in the USA says?",
              "score": -4,
              "created_utc": 1746723792.0,
              "replies": [
                {
                  "id": "mra2if1",
                  "author": "Tasty-Traffic-680",
                  "body": "Weird. I've always called it the US. Less letters, more accurate. Maybe it's a regional thing like soda vs pop.",
                  "score": 7,
                  "created_utc": 1746725454.0,
                  "replies": [
                    {
                      "id": "mre4xdn",
                      "author": "jaa101",
                      "body": "What do you call the USians?",
                      "score": 2,
                      "created_utc": 1746783378.0,
                      "replies": [
                        {
                          "id": "mre9owm",
                          "author": "Tasty-Traffic-680",
                          "body": "Depends where their great great grandparents came from",
                          "score": 2,
                          "created_utc": 1746786188.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr9xrr1",
              "author": "pistolpoida",
              "body": "What’s does the A stand for in USA",
              "score": -5,
              "created_utc": 1746724078.0,
              "replies": [
                {
                  "id": "mra2oeq",
                  "author": "Tasty-Traffic-680",
                  "body": "Amyl nitrate",
                  "score": 9,
                  "created_utc": 1746725502.0,
                  "replies": []
                },
                {
                  "id": "mr9yrrr",
                  "author": "xbbdc",
                  "body": "anarchy",
                  "score": 13,
                  "created_utc": 1746724367.0,
                  "replies": []
                },
                {
                  "id": "mraircr",
                  "author": "GasolinePizza",
                  "body": "What does the E stand for in EU?",
                  "score": 8,
                  "created_utc": 1746730147.0,
                  "replies": []
                },
                {
                  "id": "mra7gxl",
                  "author": "namerankserial",
                  "body": "Assholes",
                  "score": 2,
                  "created_utc": 1746726861.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mrdk20n",
          "author": "irishninja62",
          "body": "Little-known fact: there was no Europe before the European Union.",
          "score": 1,
          "created_utc": 1746770358.0,
          "replies": []
        },
        {
          "id": "mr9vs0u",
          "author": "EtherealPheonix",
          "body": "They said mainland Europe.",
          "score": 0,
          "created_utc": 1746723507.0,
          "replies": [
            {
              "id": "mradn7j",
              "author": "icanttinkofaname",
              "body": "Does that mean Ireland and Iceland get these drives then if they're not mainland Europe? /s",
              "score": 6,
              "created_utc": 1746728644.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mrc1sys",
          "author": "beeseekay",
          "body": "Ehh the UK made its choice and wanted to leave and be shit, so let em’",
          "score": -3,
          "created_utc": 1746747649.0,
          "replies": [
            {
              "id": "mrc1xmt",
              "author": "ChloeWade",
              "body": "They’re still European though, at least until a major geological event forms a new continent.",
              "score": 4,
              "created_utc": 1746747695.0,
              "replies": [
                {
                  "id": "mrc2957",
                  "author": "beeseekay",
                  "body": "Continents are a man made idea, it only matters as far as their diplomatic relations are concerned. \n\nPlus, they’re on an island.",
                  "score": -2,
                  "created_utc": 1746747811.0,
                  "replies": [
                    {
                      "id": "mrrtnuc",
                      "author": "ItsColorNotColour",
                      "body": "Bro is really trying to do historical revisionism on geography",
                      "score": 1,
                      "created_utc": 1746981586.0,
                      "replies": [
                        {
                          "id": "mrt8nbg",
                          "author": "beeseekay",
                          "body": "A little? Look, the UK is ‘technically’ part of Europe the same way Australia is part of Oceania, but when it comes to talking modern economics they might as well not be now. The term “Europe” is just as man made as “the EU”",
                          "score": 1,
                          "created_utc": 1746998141.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mr8ie5m",
      "author": "ByteEater",
      "body": "And here I'm in Italy hoping in 30TB drives",
      "score": 22,
      "created_utc": 1746708403.0,
      "replies": [
        {
          "id": "mraaud8",
          "author": "Tegumentario",
          "body": "You do eat bytes",
          "score": 3,
          "created_utc": 1746727830.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr8tkrf",
      "author": "ledow",
      "body": "Well... as someone speccing a NAS as the moment... looks like I don't \"need\" to worry about Toshiba as a suppplier.",
      "score": 23,
      "created_utc": 1746712213.0,
      "replies": []
    },
    {
      "id": "mr92bi1",
      "author": "Fredasa",
      "body": "On the one hand, I salivate at the thought of potentially consolidating every drive I own into one.\n\nOn the other, I just broke out in a cold sweat at the thought of said drive then showing problems in SMART.",
      "score": 16,
      "created_utc": 1746714887.0,
      "replies": [
        {
          "id": "mrae3sq",
          "author": "Legitimate-Wall3059",
          "body": "If you have any data you care about then drive failure shouldn't be something that is a concern as it should all be backed up",
          "score": 3,
          "created_utc": 1746728777.0,
          "replies": []
        },
        {
          "id": "mrdrj5e",
          "author": "Ulrar",
          "body": "Just get at least two.\nI have one behaving weird now, not sure which one.. I'll just wait to see which one disappears",
          "score": 1,
          "created_utc": 1746774772.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mra9xe0",
      "author": "Level-Suspect2933",
      "body": "100% it’s because european consumer law wouldn’t be favourable for the business.",
      "score": 6,
      "created_utc": 1746727565.0,
      "replies": []
    },
    {
      "id": "mr9xxmd",
      "author": "kompergator",
      "body": "[That’s weird. Didn’t know Germany is part of America / The UK](https://www.cyberport.de/?DEEP=3424-00C&APID=14)",
      "score": 3,
      "created_utc": 1746724125.0,
      "replies": []
    },
    {
      "id": "mrbj42c",
      "author": "He_Who_Browses_RDT",
      "body": "If Hitachi said the same thing, I would be worried... Toshiba can stick it...",
      "score": 3,
      "created_utc": 1746741103.0,
      "replies": []
    },
    {
      "id": "mrbjsaq",
      "author": "stickeeBit",
      "body": "Our pr0n is thiccer",
      "score": 3,
      "created_utc": 1746741324.0,
      "replies": []
    },
    {
      "id": "mrdd5wj",
      "author": "VitruvianVan",
      "body": "Instead of 24TB and 250 pencils, you can have 2TB and 5 pencils.",
      "score": 2,
      "created_utc": 1746766699.0,
      "replies": []
    },
    {
      "id": "mr8vjm3",
      "author": "MeRedditGood",
      "body": "I understand the use-case here is surveillance footage... Call me stupid, but I don't actually want 24TB drives.\n\nIf you're willing to put a small amount of effort in to building your own NAS (as opposed to an off-the-shelf solution) adding extra drives is easy. The cost of the bare metal in a NAS is nothing compared to the cost of the drives. Anyone who has been in IT or has a homelab knows that HDDs have a wild variability, you can have 2 drives of the same SKU one will truck on for 7+ years, the other won't make it past 3.\n\nI'd rather a bunch of drives than condensing that storage in to 1 drive. If the data is important, go RAID, even less of a reason to have gargantuan drives. A 24TB drive just seems like putting all your eggs in one basket. If you need 24TB, I'd feel safer with 4 6TB drives.\n\nHDDs aren't consumables, but they are a maintenance cost. If I build a NAS/SAN I expect the bare metal (Motherboard, CPU, PSU) to last until an upgrade, I anticipate those items still being useful beyond the lifespan of the entire setup. The HDDs on the other hand I fully anticipate having to replace.",
      "score": 6,
      "created_utc": 1746712833.0,
      "replies": [
        {
          "id": "mr8xgvh",
          "author": "GuanoLoopy",
          "body": "But the people who buy these probably aren't the people who need 24TB of space, they need hundreds of TB of space. This one drive is their redundancy for the 3 others they just bought too.",
          "score": 31,
          "created_utc": 1746713434.0,
          "replies": [
            {
              "id": "mr985sx",
              "author": "rosen380",
              "body": "Lets say you are looking for 500 TB and are targeting \\~750 TB total including striped, mirrored and drives ready for hot-swap.\n\nUsing 20 TB drives that is 38 drives, while with 24 TB drives you can knock that down to 32.\n\nIf you are using a Storinator from 45Drives, your options are 4, 8, 15, 30, 45, and 60-bay enclosures.  Assuming you want to have it all in one NAS, you are looking at the 45-bay for 20TB drives and 24TB drives anyways.",
              "score": 3,
              "created_utc": 1746716611.0,
              "replies": [
                {
                  "id": "mra9hwh",
                  "author": "Eokokok",
                  "body": "You are still assuming a relatively small storage for the use case those drives are aimed at. Big facilities, like factories or big distribution centers, will have 1k or more cameras and will need literally the whole 48U unit NVRs to meet their retention rules. \n\nClaiming 20 or 30 drives is no difference it's ok, 200 or 300 is another kind of issue. And Toshiba is literally stupid to say something so detached.",
                  "score": 6,
                  "created_utc": 1746727442.0,
                  "replies": []
                },
                {
                  "id": "mrab4kc",
                  "author": "techieman33",
                  "body": "There are a lot more factors than just how many drives you can fit in server or disk shelf. There’s future expansion, cost of the drives, spreading drives out over different brands, sizes, and batches so you don’t get screwed if you end up with a batch that has high failure rates, etc.",
                  "score": 3,
                  "created_utc": 1746727912.0,
                  "replies": []
                },
                {
                  "id": "mrappnk",
                  "author": "amayle1",
                  "body": "Yall are making me realized how detached from storage I’ve become as a software dev. Literally everything I’ve ever written professionally has been in AWS (or someone else had to worry about setting up storage) and I just set a daily backup and never think about it again.",
                  "score": 2,
                  "created_utc": 1746732212.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mr8xxzu",
              "author": "MeRedditGood",
              "body": "Yeah, for sure, in the context of surveillance footage and the such, it does make sense. I was just coming at it from the \"prosumer\" angle.\n\nI'd assume anyone in the EEA with such a use-case could source them from anywhere.",
              "score": 1,
              "created_utc": 1746713578.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr8w2zd",
          "author": "TheGhostofJoeGibbs",
          "body": "> f you're willing to put a small amount of effort in to building your own NAS (as opposed to an off-the-shelf solution) adding extra drives is easy. The cost of the bare metal in a NAS is nothing compared to the cost of the drives\n\n\nYour slots definitely cost money that needs to be added to the cost of the drive.  And if you find you need to upsize the drives, you also need to factor that cost in when it happens.",
          "score": 12,
          "created_utc": 1746713003.0,
          "replies": []
        },
        {
          "id": "mr8ywul",
          "author": "S_A_N_D_",
          "body": "Most people using these are running raid arrays with multiple drives. \n\nI manage two. One 6 drive (with 18TB drives) for work, and one 5 drive (with 16TB drives for home/personal.\n\nNeither have any surveillance footage involved.",
          "score": 7,
          "created_utc": 1746713868.0,
          "replies": [
            {
              "id": "mr8zbw2",
              "author": "MeRedditGood",
              "body": "Rebuilding a RAID array with such large drives must be eyewateringly painful! I don't envy that one bit :)",
              "score": 1,
              "created_utc": 1746713993.0,
              "replies": [
                {
                  "id": "mr964cr",
                  "author": "S_A_N_D_",
                  "body": "Not really painful, just slow.\n\nIt just takes a while and chugs away in the background. It took about two weeks to upgrade the 6 drive system (24-48 hours per drive), but the system itself isn't getting taxed very hard so there was no noticeable impact from the user side of things. \n\nWhat was painful was the system it replaced which hadn't been maintained. That one was in RAID 5 configuration and at some point a drive failed, but all they did was shove in a new drive - No one actually rebuilt the system so it just sat there down a drive. I only found this out because a second drive started failing right as I joined and took over maintenance. So now I was trying to rebuild the array with one of the drives on life support. It took a solid two months of just keeping it offline and letting it chug away in a corner. By the time it finished I had already built and brought online a new server with data restored from offsite backups. The only reason I let it keep going was because the most recent 4 weeks were not in the backups, and also pride to see if I could actually do it. In the end, we didn't actually need it as people had local copies of anything missing from the 4 week gap.",
                  "score": 5,
                  "created_utc": 1746716008.0,
                  "replies": [
                    {
                      "id": "mr9d294",
                      "author": "tastyratz",
                      "body": "This is the problem with raid 5 in modern drive sizing, it completely collapses against the bit error rate and your chances of a rebuild failing end up greater and greater, especially since most of the time people don't schedule regular scrub operations.\n\nNevermind that hammering drives for a week ends up as a stress test for possible failures.",
                      "score": 1,
                      "created_utc": 1746718045.0,
                      "replies": [
                        {
                          "id": "mr9fooj",
                          "author": "S_A_N_D_",
                          "body": "> Nevermind that hammering drives for a week ends up as a stress test for possible failures\n\nThis is why I switched to RAID 6 when I made the new server, and also why we recently upgraded all the drives. Not because we needed the space (though eventually we will need it), but rather because the drives were 5 years old, and all the same age. Chances are if one failed, others might be close as they were likely all manufactured on the same production line at the same time, and have all been subject to identical conditions. \n\nThey were all showing clean SMART tests, but I wasn't going to take the chance. \n\nIdeally I wanted to stagger to the upgrade over a year to avoid having drives all the same age and from the same manufacturing run but circumstances meant I needed to do it all at once.",
                          "score": 2,
                          "created_utc": 1746718806.0,
                          "replies": [
                            {
                              "id": "mr9m663",
                              "author": "tastyratz",
                              "body": "Honestly, your best bet is going to be through redundancy through backups.\n\nRemember your array is for IOPS and uptime availability, not backups.\n\nIf you can just do a flat restore in a bubble in acceptable time, especially if you can wait for some data vs other data, then drive loss won't be so catastrophic.",
                              "score": 1,
                              "created_utc": 1746720688.0,
                              "replies": [
                                {
                                  "id": "mr9r96j",
                                  "author": "S_A_N_D_",
                                  "body": "Absolutely. There is a second backup server squirrelled away in a different wing of the building, but I'm also limited by resources so while we have full backups with time snapshots as you describe, it's not a perfect 3:2:1. I'd also rather not have to try and restore from the backup if at all possible since it's never been tested. I'm not really sure how I could test a full restore without a full second set of drives, which I don't have the budget for. \n\nI'm not an expert in this matter, rather I'm just the closest thing we have to an expert. We're just a small academic lab so we don't have the resources for much else, and we are also constantly clashing with both funding agency data storage requirements (which limits many of the big name solutions because the data centres might be in another country), and our own institutional IT policies, both of which don't have any sort of real policy on how to handle this kind of thing, and neither of which offer suitable solutions of their own. When I last inquired about using our own IT for this kind of thing, they quoted us around $30 000 per year. \n\nIt's a pressing issue which the interested parties are keen to put policies in place, but just keep kicking the can down the road when it comes to putting solutions in place.",
                                  "score": 1,
                                  "created_utc": 1746722198.0,
                                  "replies": [
                                    {
                                      "id": "mr9yf1k",
                                      "author": "tastyratz",
                                      "body": "Storage arrays are always the weaker link, management understands cpu and ram more.\n\nA backup that's never had a test restore isn't a backup yet. Even if you split things to a few smaller luns so you can do critical pieces over the monolith you should.\n\nAlso if your backup is just an online duplicate in the same building it doesn't do anything in case of fire, electrical surge, or ransomware.\n\nThat's just long distance raid.",
                                      "score": 1,
                                      "created_utc": 1746724265.0,
                                      "replies": [
                                        {
                                          "id": "mraa8o7",
                                          "author": "S_A_N_D_",
                                          "body": "Management in my case is our PI, who understands but just has limitations on how much money they can direct this way. Unfortunately, grants rarely take into account data storage and retention. \n\n>Also if your backup is just an online duplicate in the same building it doesn't do anything in case of fire, electrical surge, or ransomware.\n\nI understand all of these and I've mitigated them to the best of my ability and resources. Simply put, there are limits to how much I can do and the rest are risks I've communicated. \n\nFire and electrical surge are unlikely. Both are on power filtering battery backups hooked into on the universities redundant power circuit and it's unlikely a power surge would manage to get through all of that on isolated circuits and go so far as to irreparably damage the hard drives (best it might kill the computer power supply). \n\nFire is unlikely to take out both. It's a massive and relatively new building and the wings are completely isolated from each other with multiple layers of fire breaks. It's not a continuous linear building. If a fire manages to take out both servers, that will be the least of our worries given that we'll have also lost hundreds of independant academic labs, an insurmountable number of irreplaceable research equipment and biological samples including cells lines and bacterial strains, and hundreds of millions of dollars in lab equipment. The data loss for our single lab at that point would just be a footnote and we'd functionally be shut down anyways. Offsite or a different building unfortunately isn't an option. But again, it would take deliberate action combined with a complete breakdown of fire suppression efforts to have both servers lost in a fire (famous last words a la Titanic I know).\n\nRansomware is an issue, but it's not a simple 1:1 copy, rather the backup is encrypted immutable snapshots on different underlying platforms. While I could see the server being hit by ransomware, it would more likely take a targeted attack to take out both systems which is also very unlikely. \n\nAs I said though, there are definitely a lot of flaws here, but I don't have the ability for a perfect solution, and my PI is well aware of the issues but is also powerless to force the institution to help adopt a better solution. Best I can do is my best to mitigate them.",
                                          "score": 1,
                                          "created_utc": 1746727654.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mra8m52",
          "author": "Eokokok",
          "body": "On one hand you are right, but after just finishing a 48U NVR system filled with 16TB Exos drives I wouldn't mind spending 30% less time screwing that mofos...",
          "score": 1,
          "created_utc": 1746727188.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr8ipjs",
      "author": "blackscales18",
      "body": "Good thing Toshiba drives are bad",
      "score": 6,
      "created_utc": 1746708517.0,
      "replies": [
        {
          "id": "mr9uksd",
          "author": "spellinbee",
          "body": "I mean per back blaze the only manufacturer that had better reliability than Toshiba was WD.\n\nhttps://www.backblaze.com/blog/backblaze-drive-stats-for-2024/",
          "score": 10,
          "created_utc": 1746723165.0,
          "replies": []
        },
        {
          "id": "mr96849",
          "author": "rotrap",
          "body": "Are they?  They used to be decent a decade or two ago.",
          "score": 2,
          "created_utc": 1746716039.0,
          "replies": [
            {
              "id": "mr9wobq",
              "author": "lack_of_reserves",
              "body": "Their consumer drives are. The enterprise versions are as good as the other brands.",
              "score": 2,
              "created_utc": 1746723763.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mranb8e",
      "author": "TRKlausss",
      "body": "Well this is a free market, let other players get the market share ¯\\_(ツ)_/¯",
      "score": 2,
      "created_utc": 1746731497.0,
      "replies": []
    },
    {
      "id": "mrazw5c",
      "author": "ToMorrowsEnd",
      "body": "Toshiba can keep their drives,  I dont trust their crap as it has a high failure rate.",
      "score": 2,
      "created_utc": 1746735228.0,
      "replies": []
    },
    {
      "id": "mr91vww",
      "author": "IronDragonGx",
      "body": "I got a 8tb drive for my home PC the other day. If I could have bought a 24tb one I would have! \n\nGames are like 150gb a pop now and are somehow getting bigger. \n\nBusinesses in Ireland and Europe definitely would need/want 24 Tb drives as well. Very poor Business sense from Toshiba.",
      "score": 2,
      "created_utc": 1746714758.0,
      "replies": [
        {
          "id": "mr9aapr",
          "author": "fuqdisshite",
          "body": "downloaded *Pod Racer* on the Switch this week.  it is a 25yo game and takes up 12gb.\n\nthat was kind of surprising.  i have a 128gb chip to add but still, that is only 10 games.",
          "score": 3,
          "created_utc": 1746717239.0,
          "replies": [
            {
              "id": "mr9dh2t",
              "author": "IronDragonGx",
              "body": "Ya it's wild stuff indeed file compression is something these companies have never heard of 😂",
              "score": 1,
              "created_utc": 1746718166.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr9yvym",
          "author": "xbbdc",
          "body": "there have been drives bigger than 8tb for years now...",
          "score": 1,
          "created_utc": 1746724400.0,
          "replies": [
            {
              "id": "mrac4d6",
              "author": "IronDragonGx",
              "body": "True, but none on the samaung m Stata list:)",
              "score": 2,
              "created_utc": 1746728199.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mra993q",
      "author": "hamiltonisoverrat3d",
      "body": "Insert “that’s a lot of porn” joke",
      "score": 1,
      "created_utc": 1746727372.0,
      "replies": []
    },
    {
      "id": "mrax80v",
      "author": "iiiinthecomputer",
      "body": "So there's some consumer law that would make them illegal in the EU I'm guessing.",
      "score": 1,
      "created_utc": 1746734432.0,
      "replies": [
        {
          "id": "mrec5rw",
          "author": "sunkenrocks",
          "body": "Not sure what law you think that'd be or why you'd jump to it. I don't see why a slightly more sense HDD would. It's not suddenly radioactive going from 20TB to 24TB",
          "score": 1,
          "created_utc": 1746787508.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrcelau",
      "author": "CharlieDmouse",
      "body": "Anyone got a shipping container for rent? I smell profit.",
      "score": 1,
      "created_utc": 1746752376.0,
      "replies": []
    },
    {
      "id": "mrdatl7",
      "author": "RandomWon",
      "body": "How has a better tech not come about? We need solid state mass storage",
      "score": 1,
      "created_utc": 1746765531.0,
      "replies": [
        {
          "id": "mrec0v2",
          "author": "sunkenrocks",
          "body": "Define better? Arguably there's a lot better out there than spinning mechanical HDs based on your criteria. They are just king at cheap, dense storage. Things like 3D storage mediums are slowly gaining traction but sometimes sn old technology is just hard to, or can't be, beat for the same price. Sometimes one of the first ideas remains one of the best. It's just luck and ingenuity.",
          "score": 1,
          "created_utc": 1746787439.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrdohy9",
      "author": "v3bbkZif6TjGR38KmfyL",
      "body": "Yes, I have a question about what countries are in Europe. ",
      "score": 1,
      "created_utc": 1746772931.0,
      "replies": []
    },
    {
      "id": "mrdpe0t",
      "author": "idebugthusiexist",
      "body": "They have their right to decide where to sell their products for whatever reason and customers have the right not to buy any of your products for whatever reason.",
      "score": 1,
      "created_utc": 1746773461.0,
      "replies": []
    },
    {
      "id": "mrejknh",
      "author": "Drapausa",
      "body": "Ok, stupid question, for what exactly are these used? Surely not in personal PCs? Some sort of commercial setting I assume?",
      "score": 1,
      "created_utc": 1746790989.0,
      "replies": [
        {
          "id": "mrk9ua7",
          "author": "NotMalaysiaRichard",
          "body": "Media servers",
          "score": 3,
          "created_utc": 1746869248.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrem3y1",
      "author": "FromSwedenWithHate",
      "body": "Yeah it is true, we don't need 24TB HDDs, we need 24PB HDDs.",
      "score": 1,
      "created_utc": 1746792064.0,
      "replies": []
    },
    {
      "id": "mrhd3sw",
      "author": "Phosquitos",
      "body": "We want SSDs. HDDs are too 2000's",
      "score": 1,
      "created_utc": 1746823528.0,
      "replies": []
    },
    {
      "id": "mrmqeel",
      "author": "Hattix",
      "body": "Toshiba has been struggling to produce enough HDDs on leading edge areal density processes for some years now.\n\nThis is just a shareholder-friendly way of saying it.",
      "score": 1,
      "created_utc": 1746903346.0,
      "replies": []
    },
    {
      "id": "mr8i9qg",
      "author": "PocketNicks",
      "body": "As a Canadian, I don't think I need 24tb hard drives.",
      "score": 1,
      "created_utc": 1746708358.0,
      "replies": [
        {
          "id": "mr8iuxh",
          "author": "blackscales18",
          "body": "They're great for storing media on",
          "score": 8,
          "created_utc": 1746708571.0,
          "replies": [
            {
              "id": "mr8jkga",
              "author": "PocketNicks",
              "body": "For sure they are. My current NAS that I run Plex from has 2x12tb drives and I have several other drives as well. Out of the 24tb available on the NAS, over the last 7 years I've been very active and still only filled about 13tb, with more content than I'll probably ever be able to watch in a lifetime. I can't imagine a scenario why I'd need a single 24tb drive over what I have now.",
              "score": 1,
              "created_utc": 1746708827.0,
              "replies": []
            },
            {
              "id": "mr8j6rl",
              "author": "baumpop",
              "body": "That’s a lot of something. Like say.\n\n\n\nStorage for flock cameras video feeds. It’s not for the end consumer. It’s for the police and military surveillance ",
              "score": 0,
              "created_utc": 1746708690.0,
              "replies": [
                {
                  "id": "mr8n9rs",
                  "author": "blackscales18",
                  "body": "I use them to store movies and tv shows in their highest quality for media watching lol. someday streaming will go kaput but i'll have all my shows",
                  "score": 5,
                  "created_utc": 1746710126.0,
                  "replies": [
                    {
                      "id": "mr8nq4z",
                      "author": "PocketNicks",
                      "body": "I have 24tb available to my Plex server, and in the past 7 years I've amassed 13tb of content. More than I'll probably be able to watch in a lifetime. I can't fathom why I'd need a single 24tb drive, my two 12s are working fine.",
                      "score": 1,
                      "created_utc": 1746710283.0,
                      "replies": [
                        {
                          "id": "mr8u1xo",
                          "author": "sucksfor_you",
                          "body": "Switch to remuxes, see how much space you need.",
                          "score": 4,
                          "created_utc": 1746712363.0,
                          "replies": [
                            {
                              "id": "mr8v6cr",
                              "author": "PocketNicks",
                              "body": "Yeah, I have a lot, probably 200+ physical Blu-rays for movies that I think need the best quality. I also have a lot of remuxes compressed to h/x265 at around 15-18gb a piece. And I have a lot of stuff that's fine at 5-7gb as well.\nIf I was storing all my digital media at 40gb per movie, I'd have easily used up my current 24tb, but it's super affordable to just buy another 2x 12tb drives. I still wouldn't see the need for a singular 24tb drive if some companies/countries are making them scarce.",
                              "score": 2,
                              "created_utc": 1746712718.0,
                              "replies": [
                                {
                                  "id": "mraqr2m",
                                  "author": "darkmacgf",
                                  "body": "Is there anything that makes two sets of 2x12 better than one set of 2x24?",
                                  "score": 1,
                                  "created_utc": 1746732519.0,
                                  "replies": [
                                    {
                                      "id": "mrar4a2",
                                      "author": "PocketNicks",
                                      "body": "If two 12tb drives are easily available and cheap, then they're definitely better than a 24tb drive that some says I can't have.",
                                      "score": 1,
                                      "created_utc": 1746732630.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mr98028",
                          "author": "blackscales18",
                          "body": "I have an obsessive desire to collect any content i might want to watch or that has some artistic value in my opinion. i also tend to like long running shows (anime, american science shows, etc)",
                          "score": 1,
                          "created_utc": 1746716565.0,
                          "replies": [
                            {
                              "id": "mr9ayi8",
                              "author": "PocketNicks",
                              "body": "Yeah, I have more than a lifetime worth of content already and I'm not stopping. I just personally am not upset if someone says I can't have a 24tb drive. 2x12tb drives works fine.",
                              "score": 1,
                              "created_utc": 1746717433.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mr8vuia",
                          "author": "Nope_______",
                          "body": "I've filled up two 24 TB drives in a year.\n\nYou've made it clear that *you specifically* do not need a 24 TB drive. That's great.",
                          "score": -4,
                          "created_utc": 1746712928.0,
                          "replies": [
                            {
                              "id": "mr8wajk",
                              "author": "PocketNicks",
                              "body": "Yup, I was pretty clear that I don't need one. No allusions here that others might.",
                              "score": 3,
                              "created_utc": 1746713070.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mr8x902",
      "author": "nagi603",
      "body": "Not that I was going to buy Toshiba, but got a few drives from another vendor... Though the best price/perf was for 20, with *plenty* of options. And writing one through takes literally a full day.",
      "score": 1,
      "created_utc": 1746713367.0,
      "replies": []
    },
    {
      "id": "mr9x144",
      "author": "colonelc4",
      "body": "Europe doesn't need 24TB drive from specifically Toshiba. No thanks you can keep you bad hard drives.",
      "score": 1,
      "created_utc": 1746723866.0,
      "replies": []
    },
    {
      "id": "mr9m1pp",
      "author": "nick1812216",
      "body": "Brexit finally pays off 😎",
      "score": -1,
      "created_utc": 1746720651.0,
      "replies": []
    },
    {
      "id": "mr9icta",
      "author": "poppop702025",
      "body": "Why here, am not in England?",
      "score": 0,
      "created_utc": 1746719575.0,
      "replies": []
    },
    {
      "id": "mrc3ftr",
      "author": "Random-Name-7160",
      "body": "Makes sense. In the short term..  They want to get their product into a chaotic market before they lose sales and profit margins due to the risk of future tariffs. \n\nAt the same time, they can’t say the quiet part out loud because it’s a ahitty thing they are doing… rewarding a chaotic market at the cost to a more stable one to maximize profits and minimize risk over the short term.. \n\nThe miscalculation is that it’s obvious, and they are losing share in the stabile markets of Europe who would clearly benefit from increased competition. \n\nOver the long run, this is a very poor decision on the part of their CEO.  Europe has a long memory and will reward those who play nice while punishing those who don’t.",
      "score": 0,
      "created_utc": 1746748234.0,
      "replies": []
    },
    {
      "id": "mr987sy",
      "author": "Edward_TH",
      "body": "24 TB drives are large, but not enormous: 30+ is common in large servers and 60+ are also available. These are NAS and small servers oriented products, so they think that the EU has lower deployment of those than the US and that would be fair to assume, although pretty questionable. But smaller than the UK, with a much smaller population and an economy that's less healthy than both the EU and the US? That's just impossible and smells like bullshit to cover up inconsistent supply and price shenanigans.",
      "score": -1,
      "created_utc": 1746716628.0,
      "replies": [
        {
          "id": "mredzvh",
          "author": "FlappyBored",
          "body": "UK economy is more healthy than the EU.\n\nIt's growth rate is higher than the Eurozone and higher than Germany, France and Italy this year.\n\n[https://www.cityam.com/hsbc-innovation-banking-uk-is-europes-innovation-powerhouse/](https://www.cityam.com/hsbc-innovation-banking-uk-is-europes-innovation-powerhouse/)\n\nFor startup funding the UK is miles ahead of any other EU country. It alone has more funding than Germany, France and Spain combined so far in 2025.",
          "score": 0,
          "created_utc": 1746788418.0,
          "replies": [
            {
              "id": "mrema9s",
              "author": "Edward_TH",
              "body": "The investment into startup is kinda a flawed metric: London is the one of the world capitals of banking and therefore a ton of money flows through it. But you need to look where those capitals go: if a startup get a billion pounds in fundings in London but they're mostly spent in India to gain market share, that money is counted as staying into the UK while in reality is going abroad. It's tricky to get a fair accounting in a reality so extreme like London.\n\n\nBut the UK economy being healthier than the EU? Man, that's just not what's happening: its economy is basically stagnant since 2007 (+8.1% growth) while the EU grew 50% than the UK more even with a country in default and 2 the risked it (+12.6%). Germany in the same period grew 19% and France (which is the worrying one) only 3.5%, but Poland grew 47%, the Netherlands 17.6% and Ireland (same problem as the UK though) 109%. The one default, Greece, is sitting at -33%. The two that risked it are also pretty bad, but Spain (-3.2%) seems to be have recovered and the real disaster is Italy because its gdp still has not recovered from 2008 (-6.4%) even if it was not hit by the crisis that bad: its economy is just slowly withering due much more systemic problems and it still is the third largest EU economy.\n\n\nSo no, the UK economy is not in the drain yet, but it's not as healthy as EU and it is much, much less healthy since they left the EU...",
              "score": 2,
              "created_utc": 1746792137.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mr9oljy",
      "author": "IdontneedtoBonreddit",
      "body": "Huh...I never realized the bovinity of the women took up more porndrive space!",
      "score": -2,
      "created_utc": 1746721410.0,
      "replies": []
    },
    {
      "id": "mr8khqe",
      "author": "JaffaSG1",
      "body": "They need the storage for PDF pr0n.",
      "score": -9,
      "created_utc": 1746709156.0,
      "replies": []
    }
  ]
}