{
  "post": {
    "title": "Xiaomi Launches AI Smart Glasses with 8.6-Hour Batteryand and Enhanced Capabilities",
    "author": "Separate-Way5095",
    "id": "1lmlhyd",
    "score": 28,
    "created_utc": 1751113222.0,
    "selftext": "",
    "num_comments": 17,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lmlhyd/xiaomi_launches_ai_smart_glasses_with_86hour/"
  },
  "comments": [
    {
      "id": "n0vnakv",
      "author": "mletourn",
      "body": "What does it do?? Play music that's it?? What's AI about this product 😂 such a long website to say so little",
      "score": 26,
      "created_utc": 1751425461.0,
      "replies": [
        {
          "id": "n0vtjuv",
          "author": "JacqueMorrison",
          "body": "What I got from that web - it can play audio. Great for glasses….",
          "score": 14,
          "created_utc": 1751427951.0,
          "replies": [
            {
              "id": "n0x2c67",
              "author": "TheRageDragon",
              "body": "'My glasses! My glasses! I can't hear without my glasses!'",
              "score": 14,
              "created_utc": 1751451793.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0w38v5",
      "author": "Aridez",
      "body": "The moment they start to make decently priced smart glasses that include a HUD I’m sold.   \n   \nThese seem just like yet another “speaker on your glasses” kind of thing no matter how they are selling it.   \n   \nI’ve seen a few cheap ones with great quality already, but I find no use for them that a pair of good quality headphones can’t do much better.   \n   \nSony even released some not long ago with an open design that would let external sounds go through the same as not wearing them. So not too different from the glasses.",
      "score": 10,
      "created_utc": 1751432255.0,
      "replies": [
        {
          "id": "n0xas3p",
          "author": "danielv123",
          "body": "There are quite a few options, there are 2 different displays to choose from. One has a decently wide FOV and 1080p screen, the other is more expensive, looks a lot sleeker but has a narrower FOV and 240p ish screen.\n\nBoth are held back by software. They don't really interact with the real world. The even G1 is a good example - they look good, the screen is decent but nowhere near an immersive AR experience. Using it for navigation and live translation is neat, but I'd really like to use it for ebooks. Thats just not a thing, because as far as I understand you are stuck with the apps they give you.",
          "score": 3,
          "created_utc": 1751455770.0,
          "replies": [
            {
              "id": "n0xss1m",
              "author": "Aridez",
              "body": "Yea, I've seen them and look neat. I always thought that would be super nice when I have to do presentations, having a small prompt guide at the side if I get lost, or even during meetings if they are discreet enough.\n\nBut comparing the 600\\~$ of these to a 60$ price you can get for a nice pair of classes with cameras and speakers having decent quality both, it makes me think that the technology on that side is not yet there.\n\nOn the other side is what you say, every vendor tries to put their own closed system with limited apps instead of making an open SDK. I guess they want to cash in those AI subscriptions/translation services instead of letting anyone take advantage of the glasses, and it's also what's killing them. Those prices for a product with closed systems of a new-ish company don't give me any kind of confidence.\n\nIf anyone made a pair of glasses with an open SDK, that would give easy access to every developer already in the play store or the app store. Everyone would be able to create this compatibility, something similar to what happened with smartwatches. But my guess is that won't happen until a big player gets into this specific market, like apple or google, forcing the rest to open to the whole store to compete.",
              "score": 1,
              "created_utc": 1751462497.0,
              "replies": [
                {
                  "id": "n0xt8v4",
                  "author": "danielv123",
                  "body": "Hopefully android XR will improve things.",
                  "score": 0,
                  "created_utc": 1751462651.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n0zeawj",
      "author": "Vo_Mimbre",
      "body": "I hate that when actual real AR glasses come out they’ll need a new name. These “smart glasses” are just headphones with corrective lenses if you want. Like, yay?",
      "score": 3,
      "created_utc": 1751479074.0,
      "replies": []
    },
    {
      "id": "n0wahtv",
      "author": "WrongUserID",
      "body": "What I like about Xiaomi is that they experience a lot. These glasses might be \"another pair of glasses with music\", but they don't just scrap the model, they build on it, and next version might have HUD. \n\nTake their phones. They were some of the first to have small factors, or small bezel, or small notch for camera. Xiaomi  innovate and have done it since the beginning.\n\nMy point is. Watch where these glasses are going in 6 months time.",
      "score": 3,
      "created_utc": 1751435902.0,
      "replies": []
    },
    {
      "id": "n0wijps",
      "author": "boxfetish",
      "body": "All the better to central plan you with, my dear...",
      "score": 2,
      "created_utc": 1751440320.0,
      "replies": [
        {
          "id": "n121czr",
          "author": "DrGepetto",
          "body": "🌹🌹🌹🌹",
          "score": 1,
          "created_utc": 1751508708.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n28k5ch",
      "author": "logia_ldn",
      "body": "Would like to try them",
      "score": 1,
      "created_utc": 1752091234.0,
      "replies": []
    },
    {
      "id": "n0wh5ni",
      "author": "Md__86",
      "body": "Will they show a person's social credit score above their head when you look at them?",
      "score": 2,
      "created_utc": 1751439540.0,
      "replies": []
    },
    {
      "id": "n0wvumy",
      "author": "Lexidoge",
      "body": "I was hoping for a cheaper Xreal. They need more competition.",
      "score": 1,
      "created_utc": 1751448200.0,
      "replies": [
        {
          "id": "n0xbj6n",
          "author": "danielv123",
          "body": "Eh, the xreal is already cheap. I'd like something better.",
          "score": 0,
          "created_utc": 1751456094.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0xpbke",
      "author": "zobby3",
      "body": "They can have my money if anyone can produce a decent pair of glasses that include face recognition - I’m old. 👍🙂",
      "score": -1,
      "created_utc": 1751461333.0,
      "replies": []
    }
  ]
}