{
  "post": {
    "title": "Samsung Galaxy Z Fold 7 Hands-On: Finally as Thin and Light as a Regular Phone",
    "author": "dapperlemon",
    "id": "1lvzptf",
    "score": 681,
    "created_utc": 1752109409.0,
    "selftext": "",
    "num_comments": 355,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lvzptf/samsung_galaxy_z_fold_7_handson_finally_as_thin/"
  },
  "comments": [
    {
      "id": "n2a6wzy",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1752109410.0,
      "replies": []
    },
    {
      "id": "n2ajf82",
      "author": "KEVLAR60442",
      "body": "I'm so pissed.  I was waiting for a Galaxy Fold to have a built-in S-Pen, not for a Galaxy Fold to have *NO* S-Pen support.",
      "score": 234,
      "created_utc": 1752113782.0,
      "replies": [
        {
          "id": "n2azl8h",
          "author": "UniformGreen",
          "body": "Wait one or two more years, they will tell everyone how revolutionary of a feature it will be when they’ll bring it back",
          "score": 88,
          "created_utc": 1752120026.0,
          "replies": [
            {
              "id": "n2b2yyr",
              "author": "WolverinesThyroid",
              "body": "nah its dead. It probably won't be in the S26 either. They will say it saved 0.5mm in size so it was worth it.\n\nThen in 3 years they will sell a stand alone Spen.",
              "score": 63,
              "created_utc": 1752121477.0,
              "replies": [
                {
                  "id": "n2hs6h0",
                  "author": "BoxOfDemons",
                  "body": "This already happened when the note got discontinued. The next ultra that came out had the s pen sold separately iirc.",
                  "score": 8,
                  "created_utc": 1752208090.0,
                  "replies": []
                },
                {
                  "id": "n2bik8b",
                  "author": "CutsAPromo",
                  "body": "Its worth losing it for the added battery space or thinness.  No phone needs an s pen built in",
                  "score": -36,
                  "created_utc": 1752129079.0,
                  "replies": [
                    {
                      "id": "n2fq4vj",
                      "author": "spinemc",
                      "body": "Not sure why people are downvoting you. I cannot remember seeing someone use an s pen in public or at work like ever.",
                      "score": 10,
                      "created_utc": 1752182185.0,
                      "replies": [
                        {
                          "id": "n2fx7jf",
                          "author": "CutsAPromo",
                          "body": "They're really neat in theory but most people just don't use them.  They either need to make a separate stylus phone, or upgrade the plus so people can have a better camera without one.\n\n\nI'll also add a stylus can be carried separate in a case or whatever, it's just such a waste of space having it in the phone when most people don't use it.  Most buy the ultra for the camera, screen and battery.  \n\n\nI nearly got an ultra but went with the base model (replacing my s22 plus)",
                          "score": 5,
                          "created_utc": 1752184322.0,
                          "replies": [
                            {
                              "id": "n2gbqr9",
                              "author": "HeftyArgument",
                              "body": "Good to know you can speak for most people, I for one buy (bought) the ultra for the screen, battery and pen.\n\nI could care less how great the camera is, the tech hasn’t really gotten appreciably better to anyone but enthusiasts for the last 5 years.",
                              "score": 3,
                              "created_utc": 1752188973.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "n2gbe86",
                          "author": "HeftyArgument",
                          "body": "I use mine a lot, I use the ultra as a notepad during meetings and just during the day when I notice things at work.\n\nThe being able to hover the pen over the screen to highlight and translate text on the fly is also a game changer considering the amount of foreign design drawings I look at during work.\n\nLatest ultra phone was a no go because they removed that feature, in normal life do I use the pen a lot? no, but during work, all the time.\n\nWhich was the entire point of the S Pen originally IIRC, that huge phone was supposed to be for multi tasking and productivity, the pen was a huge part of that.",
                          "score": 6,
                          "created_utc": 1752188860.0,
                          "replies": [
                            {
                              "id": "n2m1347",
                              "author": "Hellguin",
                              "body": "I use my S Pen for Jackbox games that require drawing.",
                              "score": 1,
                              "created_utc": 1752264911.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "n2guqo7",
                          "author": "Sasquatchjc45",
                          "body": "Agreed. I've had the ultra series for 5+ years now and very rarely use the spen. It's nice to have, but I probably use it less than 20 times/year, totally worth losing for some extra battery",
                          "score": 2,
                          "created_utc": 1752195482.0,
                          "replies": [
                            {
                              "id": "n2ml6x1",
                              "author": "Kind-Box4168",
                              "body": "I was excited to get the 23ultra with the pen. I've had it 2 years and maybe used it 30 times? Anything I use the pen for i can just use my finger and if I want to write a note quick its faster to type it. Maybe if I loved art and crazy good and making drawings on it like some people (don't know if you have seen the masterpieces people have drawn on them) but im not. I got the ultra over the fold because It was just too thick. I think im ready to upgrade now that its so thin AND had the same 200mp camera I have",
                              "score": 1,
                              "created_utc": 1752271010.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "n2rhyek",
                          "author": "chris_ayyye",
                          "body": "I use my s pen all the time on my S23 ultra to draw, edit but mostly use it to take group selfies.",
                          "score": 1,
                          "created_utc": 1752342860.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n2cxdfa",
                      "author": "lowcrawler",
                      "body": "I have an spen in my past 4(?) phones. \n\nother than some pictionary drawing game during covid, I never use it. it's literally completely wasted space.",
                      "score": 10,
                      "created_utc": 1752153458.0,
                      "replies": [
                        {
                          "id": "n2epgei",
                          "author": "eclipse60",
                          "body": "Im the same. I got an s24 ultra. First phone with an S Pen l. I literally used it once when I first got phone to draw a picture. Otherwise I never use. \n\nThe only use it sees is me clicking it as a fidget toy.",
                          "score": 1,
                          "created_utc": 1752171640.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n2hl9tn",
                      "author": "TheOxime",
                      "body": "I have used an S Pen every day for maybe at least a decade. Having it built-in is a huge reason I have a Samsung.",
                      "score": 2,
                      "created_utc": 1752205187.0,
                      "replies": []
                    },
                    {
                      "id": "n31w46n",
                      "author": "None",
                      "body": "I agree but clearly some peiple want the suppoet atleast, the fold 7 wont even support s pens at all",
                      "score": 1,
                      "created_utc": 1752488938.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n2ceq9u",
              "author": "DarraghDaraDaire",
              "body": "Galaxy Z Fold Pro Note 26",
              "score": 3,
              "created_utc": 1752146476.0,
              "replies": [
                {
                  "id": "n2e42kg",
                  "author": "cgaWolf",
                  "body": "26 inch screen, folded twice :P\n\n*) Edit: Called it: https://www.koreatimes.co.kr/business/tech-science/20250710/samsung-seeks-to-roll-out-tri-fold-phone-by-year-end-head-of-smartphone-business-says",
                  "score": 1,
                  "created_utc": 1752165819.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n2bii7e",
              "author": "CutsAPromo",
              "body": "Its not coming back, if anything it will be removed from the ultra too.",
              "score": 3,
              "created_utc": 1752129048.0,
              "replies": [
                {
                  "id": "n2bvqm0",
                  "author": "RenegadeUK",
                  "body": "But........Why ?!?",
                  "score": 5,
                  "created_utc": 1752136474.0,
                  "replies": [
                    {
                      "id": "n2c4ie0",
                      "author": "phero1190",
                      "body": "Because Samsung loves removing features lately. Removing the Bluetooth S Pen on the S25 Ultra was just fine to get people ready for its eventual full removal.",
                      "score": 11,
                      "created_utc": 1752141483.0,
                      "replies": [
                        {
                          "id": "n2co4gd",
                          "author": "RenegadeUK",
                          "body": ":( \\*crying\\*",
                          "score": 3,
                          "created_utc": 1752150245.0,
                          "replies": []
                        },
                        {
                          "id": "n2d2w4g",
                          "author": "eventfarm",
                          "body": "I didn't realize they did that. I'm on the S23, so hopefully still another year or two before I need to replace, but I love having an instant sketchbook. That plus the camera are the reason to splurge on this phone.",
                          "score": 1,
                          "created_utc": 1752155212.0,
                          "replies": [
                            {
                              "id": "n2d44z5",
                              "author": "phero1190",
                              "body": "The camera, not so much.",
                              "score": 0,
                              "created_utc": 1752155585.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n2cetow",
                      "author": "DarraghDaraDaire",
                      "body": "So they can bring back the Note in a few years!",
                      "score": 5,
                      "created_utc": 1752146518.0,
                      "replies": [
                        {
                          "id": "n2cnwph",
                          "author": "RenegadeUK",
                          "body": "Aha :)",
                          "score": 1,
                          "created_utc": 1752150167.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n2cxj5x",
                      "author": "lowcrawler",
                      "body": "because it's a waste of space for the majority of people",
                      "score": 2,
                      "created_utc": 1752153509.0,
                      "replies": []
                    },
                    {
                      "id": "n2i4u7e",
                      "author": "NotanAlt23",
                      "body": "Why do you need a pen for your phone? Its the one thing I hate from my s25 ultra. They couldve used that space for literally anything else.",
                      "score": 2,
                      "created_utc": 1752214155.0,
                      "replies": [
                        {
                          "id": "n2i66fi",
                          "author": "KEVLAR60442",
                          "body": "Note taking, signing documents, editing .pdfs, selecting small strings of text, extracting text from images, remote desktop and desktop emulation apps, mouse-over events, point and click games.",
                          "score": 1,
                          "created_utc": 1752214853.0,
                          "replies": [
                            {
                              "id": "n2i7hed",
                              "author": "NotanAlt23",
                              "body": "Except for signing docs (which is solved by having a png of your signature) I literally do all of that with my fingers lol.\n\nYou must have some sausage fingers if you have trouble with any of that but then writing with that small ass pen would also be troublesome.",
                              "score": 1,
                              "created_utc": 1752215544.0,
                              "replies": [
                                {
                                  "id": "n2i7urr",
                                  "author": "KEVLAR60442",
                                  "body": "It's much faster to do all of these things by just popping out a pen, which you can quickly adapt to even with my huge hands, than by pinching to zoom in constantly and using long presses.  And I've yet to find a good way to select text from images or get mouse-over events without using the S-pen.",
                                  "score": 1,
                                  "created_utc": 1752215742.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n2c2560",
                  "author": "peakedtooearly",
                  "body": "Nah, the ultra (or Fold 8) will have it. Along with a UDC camera.\n\nIf Samsung don't do it, Apple will.",
                  "score": 0,
                  "created_utc": 1752140184.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n2an65d",
          "author": "pcdenjin",
          "body": "Yeah, the exclusion of the feature is honestly baffling to me. One of the biggest use cases, I'd say, for unfolding phones like this is the ability to use them with a pen. The larger screen estate is kind of a no-brainer for that alone.",
          "score": 52,
          "created_utc": 1752115125.0,
          "replies": [
            {
              "id": "n2b5jye",
              "author": "Pavillian",
              "body": "If the device was not a premium price I can understand but y’all are right.\n\nAlso these types of articles read like ads when the price isn’t brought up till the end.",
              "score": 22,
              "created_utc": 1752122619.0,
              "replies": [
                {
                  "id": "n2c28xs",
                  "author": "peakedtooearly",
                  "body": "Yep, if the retail price was $300-400 lower than the Fold 6 then the reduced functionality might be acceptable.\n\nTo charge more though, for a phone that wasn't a great seller in the first place, is madness.",
                  "score": 8,
                  "created_utc": 1752140243.0,
                  "replies": [
                    {
                      "id": "n2epp0i",
                      "author": "eclipse60",
                      "body": "Im sure tariffs on either components or the finished product are def part of the equation.",
                      "score": 2,
                      "created_utc": 1752171709.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n2b9zcd",
          "author": "azlan194",
          "body": "As someone with the S23 Ultra, I only use the S-Pen as a camera shutter, lol.",
          "score": 16,
          "created_utc": 1752124682.0,
          "replies": [
            {
              "id": "n2binsz",
              "author": "CutsAPromo",
              "body": "Yeah I tried one in store and it wasn't useful at all.  Maybe in winter when I am wearing gloves it would be useful.  Ended up getting the s25 base in navy blue",
              "score": 7,
              "created_utc": 1752129133.0,
              "replies": [
                {
                  "id": "n2ch8da",
                  "author": "wizkidweb",
                  "body": "It depends on how you use it. Most people aren't using the s pen for regular phone navigation, but rather for notes and drawing. I use it for quick notes all the time, and now there aren't any folding phones with a Wacom stylus support like this.",
                  "score": 7,
                  "created_utc": 1752147554.0,
                  "replies": [
                    {
                      "id": "n2cqaio",
                      "author": "CutsAPromo",
                      "body": "Yes I feel like it should be a separate phone for you people, as it currently stands if you want the ultras cameras and screen you need to buy an ultra but most people don't care about the s pen.  \n\n\nI understand those that do are very passionate about it though.  They need to bring back the note, or upgrade the plus camera",
                      "score": 1,
                      "created_utc": 1752151041.0,
                      "replies": []
                    },
                    {
                      "id": "n2cspx2",
                      "author": "6StringAddict",
                      "body": "Could you give a couple useful examples for using the pen? I just got myself the s25 ultra and it's the first time in my life I have a pen so I don't really know what to use it for to be honest. It was fun using it on photos for removing objects but that got old fast lol.",
                      "score": 1,
                      "created_utc": 1752151900.0,
                      "replies": [
                        {
                          "id": "n2d354v",
                          "author": "eventfarm",
                          "body": "I'm an artist. I use it to sketch with.",
                          "score": 2,
                          "created_utc": 1752155288.0,
                          "replies": []
                        },
                        {
                          "id": "n2dbt7t",
                          "author": "wizkidweb",
                          "body": "I do some CAD and design work, and making quick sketches on the phone makes things a lot easier. I also personally find it faster to do complex math problems by writing it out.\n\nI've also used it to help with puzzle games, to map out builds in simulation games, and other random things that require notes that are more than text.\n\nBasically anything you would use a notepad for. The fold is big enough to basically just be a notepad in your pocket.",
                          "score": 1,
                          "created_utc": 1752157855.0,
                          "replies": []
                        },
                        {
                          "id": "n2i5un9",
                          "author": "KEVLAR60442",
                          "body": "Note taking, signing documents, editing .pdfs, selecting small strings of text, extracting text from images, remote desktop and desktop emulation apps, mouse-over events, point and click games.",
                          "score": 1,
                          "created_utc": 1752214682.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n2cx5lp",
              "author": "adamcunn",
              "body": "Same as that. If there was an option to completely reject hand input when the S-Pen was removed I may have taken the odd note with it, but even then the S-Pen itself just feels horrible to write with for me. Like trying to write with a toothpick.",
              "score": 1,
              "created_utc": 1752153386.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n2ask0e",
          "author": "jayk82",
          "body": "It's utterly ridiculous to remove this feature.",
          "score": 16,
          "created_utc": 1752117175.0,
          "replies": []
        },
        {
          "id": "n2bmusn",
          "author": "Key_Selection_7600",
          "body": "Samsung claims that removing the layer for stylus support, was necessary to make it as thin as possible.\n\nIt’s actually insanely thin. When unfolded it’s basically the same thinness as a usb c port.",
          "score": 3,
          "created_utc": 1752131399.0,
          "replies": [
            {
              "id": "n2hluum",
              "author": "gorkish",
              "body": "Methinks people might have tolerated a phone as thin as a usb port plus a sheet of paper. People are gonna stick screen protectors on it",
              "score": 2,
              "created_utc": 1752205425.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n2deoqb",
          "author": "ExplosiveDisassembly",
          "body": "*Still waiting for an SD card*",
          "score": 1,
          "created_utc": 1752158681.0,
          "replies": []
        },
        {
          "id": "n2gvnpb",
          "author": "Nail_Biterr",
          "body": "I'm on my 3rd phone with an s pen...... I've used it like 3 times, only when I go 'oh yeah. I should play around with this'. I wish I used it more/ liked it. But I won't miss it",
          "score": 1,
          "created_utc": 1752195799.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2b8eaz",
      "author": "None",
      "body": "[deleted]",
      "score": 33,
      "created_utc": 1752123924.0,
      "replies": [
        {
          "id": "n2d138l",
          "author": "peakedtooearly",
          "body": "Yeah, 1mm thicker would have made it completely usellable.\n\nSamsung are trapped in the Apple mindset, that everyone wants ultra-thin, fragile devices with so-so battery life.",
          "score": 10,
          "created_utc": 1752154659.0,
          "replies": [
            {
              "id": "n2h39v6",
              "author": "F-Lambda",
              "body": "meanwhile, my phone case is 1 cm thick\n\ngimme that grippy!",
              "score": 1,
              "created_utc": 1752198451.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n2aml5q",
      "author": "Poam27",
      "body": "I had the 3 and 6.  Hinges failed on both. Never again.",
      "score": 223,
      "created_utc": 1752114914.0,
      "replies": [
        {
          "id": "n2aq06y",
          "author": "Phx_trojan",
          "body": "After how long?",
          "score": 56,
          "created_utc": 1752116179.0,
          "replies": [
            {
              "id": "n2bjzur",
              "author": "AlwaysLateToThaParty",
              "body": "I've had the 6 since it came out, no problem.  The 4 lasted a couple of years.  I upgraded it to the 6 and they just accepted the trade-in.  The new design is great.\n\nI'll never return to a standard format phone.",
              "score": 21,
              "created_utc": 1752129852.0,
              "replies": []
            },
            {
              "id": "n2aq887",
              "author": "Poam27",
              "body": "18 months and 6 months respectively. My son's 3 had exact same issue after 11 months.",
              "score": 91,
              "created_utc": 1752116268.0,
              "replies": [
                {
                  "id": "n2aszes",
                  "author": "Phx_trojan",
                  "body": "Ah interesting. My flip 6 is a year old and the hinge seems as good as new.",
                  "score": 62,
                  "created_utc": 1752117344.0,
                  "replies": [
                    {
                      "id": "n2auqq7",
                      "author": "TwelveGaugeSage",
                      "body": "I have a Fold 4 from just before the 5 came out and I beat the hell out of it.  Has some cosmetic issues, but still works great!",
                      "score": 54,
                      "created_utc": 1752118056.0,
                      "replies": [
                        {
                          "id": "n2eik3s",
                          "author": "chizmanzini",
                          "body": "Same!  My 4 is almost three years old,  no case, going strong.   I fear the day is coming, but for now it's great.",
                          "score": 5,
                          "created_utc": 1752169743.0,
                          "replies": []
                        },
                        {
                          "id": "n2eyigu",
                          "author": "lolhi1122",
                          "body": "Same 0 issues with the 3 or 5",
                          "score": 3,
                          "created_utc": 1752174221.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n2b4mom",
                      "author": "il-Palazzo_K",
                      "body": "Same here.",
                      "score": 9,
                      "created_utc": 1752122209.0,
                      "replies": []
                    },
                    {
                      "id": "n2at6pl",
                      "author": "CreatineAddiction",
                      "body": "My wife's is fine as well. 🤷‍♂️",
                      "score": 13,
                      "created_utc": 1752117424.0,
                      "replies": [
                        {
                          "id": "n2b8ws1",
                          "author": "DutchBlob",
                          "body": "I’m glad she’s fine. It must be awful to have an unhinged wife.",
                          "score": 97,
                          "created_utc": 1752124168.0,
                          "replies": [
                            {
                              "id": "n2b93dq",
                              "author": "CreatineAddiction",
                              "body": "Shit joke, considering the punctuation indicates exactly what I actually said. 👍",
                              "score": -116,
                              "created_utc": 1752124256.0,
                              "replies": [
                                {
                                  "id": "n2b9cvn",
                                  "author": "DutchBlob",
                                  "body": "Ah it turns out her husband is unhinged",
                                  "score": 119,
                                  "created_utc": 1752124381.0,
                                  "replies": [
                                    {
                                      "id": "n2b9foc",
                                      "author": "CreatineAddiction",
                                      "body": "Shitter joke but accurate. 👍",
                                      "score": -87,
                                      "created_utc": 1752124418.0,
                                      "replies": [
                                        {
                                          "id": "n2bgzdy",
                                          "author": "MikkelR1",
                                          "body": "Lol you're a grumpy one aren't ya.",
                                          "score": 46,
                                          "created_utc": 1752128238.0,
                                          "replies": []
                                        },
                                        {
                                          "id": "n2ijy6g",
                                          "author": "AlwaysLateToThaParty",
                                          "body": "> Shitter\n\n\"shittier\".",
                                          "score": 1,
                                          "created_utc": 1752222497.0,
                                          "replies": [
                                            {
                                              "id": "n2ik5fv",
                                              "author": "CreatineAddiction",
                                              "body": "No, it was a shitter comment than his first one. God, you nerds are dumb.",
                                              "score": 1,
                                              "created_utc": 1752222617.0,
                                              "replies": [
                                                {
                                                  "id": "n2ikgwk",
                                                  "author": "AlwaysLateToThaParty",
                                                  "body": "You dropped [this](https://www.gosupps.com/media/catalog/product/cache/25/small_image/375x450/9df78eab33525d08d6e5fb8d27136e95/6/1/61NHW6h4AzL._AC_SL1400_.jpg).",
                                                  "score": 1,
                                                  "created_utc": 1752222803.0,
                                                  "replies": [
                                                    {
                                                      "id": "n2ikiw5",
                                                      "author": "CreatineAddiction",
                                                      "body": "Im ok. Thanks.",
                                                      "score": 1,
                                                      "created_utc": 1752222836.0,
                                                      "replies": [
                                                        {
                                                          "id": "n2iklde",
                                                          "author": "AlwaysLateToThaParty",
                                                          "body": "bahaha",
                                                          "score": 1,
                                                          "created_utc": 1752222876.0,
                                                          "replies": [
                                                            {
                                                              "id": "n2iknwu",
                                                              "author": "CreatineAddiction",
                                                              "body": "Bahahha didn't open it? So jokes on you?",
                                                              "score": 1,
                                                              "created_utc": 1752222918.0,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "n2ikbq3",
                                              "author": "CreatineAddiction",
                                              "body": "Apt username, though.",
                                              "score": 1,
                                              "created_utc": 1752222719.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "n2dnpbi",
                                  "author": "DinosaurShotgun",
                                  "body": "Put down the creatine, it's frying your brain. Not only did you not take the joke in jest as one is supposed to, you're not even right about the grammar confirming what you said.",
                                  "score": 6,
                                  "created_utc": 1752161195.0,
                                  "replies": [
                                    {
                                      "id": "n2fvo64",
                                      "author": "CreatineAddiction",
                                      "body": "My wife's phone. She is the owner of the phone. Wife's was right gadget nerds can't spell. I'm shocked.",
                                      "score": -1,
                                      "created_utc": 1752183852.0,
                                      "replies": [
                                        {
                                          "id": "n2gtgun",
                                          "author": "DinosaurShotgun",
                                          "body": "Wife's was right? Dude, if you're going correct people on their spelling when they were right in the first place, you can't have any errors. You also didn't respond to the right person with this comment because it has nothing to do with what I said to you.",
                                          "score": 3,
                                          "created_utc": 1752195043.0,
                                          "replies": [
                                            {
                                              "id": "n2gukzv",
                                              "author": "CreatineAddiction",
                                              "body": "Derrrrp I know who i was responding to. Your last sentence was about the grammar lmao. Lacking critical thinking which is why I suggested the Creatine supplementation. Holy shit.",
                                              "score": 0,
                                              "created_utc": 1752195427.0,
                                              "replies": [
                                                {
                                                  "id": "n2gwkp8",
                                                  "author": "DinosaurShotgun",
                                                  "body": "Alright, so tell me how this:  \n  \nMy wife's phone. She is the owner of the phone. Wife's was right gadget nerds can't spell. I'm shocked.  \n  \nIs a response to this:  \n  \nPut down the creatine, it's frying your brain. Not only did you not take the joke in jest as one is supposed to, you're not even right about the grammar confirming what you said.",
                                                  "score": 3,
                                                  "created_utc": 1752196118.0,
                                                  "replies": [
                                                    {
                                                      "id": "n2gx5jk",
                                                      "author": "CreatineAddiction",
                                                      "body": "\"...About the grammar confirming what you said.\" \n\n🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️\n\nResponse to your very last sentence. Picking right up where you left off.\n\n\nThen I sent you a link proving the first part of your response as idiotic.\n\n\nThis interaction has only further confirmed that fact. I even separated the comments for your comprehension level.",
                                                      "score": 0,
                                                      "created_utc": 1752196317.0,
                                                      "replies": [
                                                        {
                                                          "id": "n2gyne1",
                                                          "author": "DinosaurShotgun",
                                                          "body": "BUT IT DOESN’T CONFIRM WHAT YOU SAY AND YOUR RESPONSE IS A NONSEQUITER TO MY RESPONSE WHAT THE FUCK IS YOUR DUMB ASS TALKING ABOUT",
                                                          "score": 3,
                                                          "created_utc": 1752196837.0,
                                                          "replies": [
                                                            {
                                                              "id": "n2gywe5",
                                                              "author": "CreatineAddiction",
                                                              "body": "🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️",
                                                              "score": 1,
                                                              "created_utc": 1752196922.0,
                                                              "replies": [
                                                                {
                                                                  "id": "n2gz8ks",
                                                                  "author": "DinosaurShotgun",
                                                                  "body": "THIS WHOLE THING IS BECAUSE YOU DIDN'T UNDERSTAND A JOKE AND CLEARLY STILL DON'T",
                                                                  "score": 3,
                                                                  "created_utc": 1752197040.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "n2h1gw2",
                                                                      "author": "yellow_fig_tree",
                                                                      "body": "Trying to correct someone doesn't work when you're the one who's wrong.",
                                                                      "score": -1,
                                                                      "created_utc": 1752197818.0,
                                                                      "replies": [
                                                                        {
                                                                          "id": "n2h2mci",
                                                                          "author": "DinosaurShotgun",
                                                                          "body": "Whatever, dumbass",
                                                                          "score": 2,
                                                                          "created_utc": 1752198223.0,
                                                                          "replies": []
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "n2fvfe1",
                                      "author": "CreatineAddiction",
                                      "body": "At least try to pretend you know what you are talking about inbred. \nMaybe you should supplement some yourself. \n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC6093191/",
                                      "score": -4,
                                      "created_utc": 1752183778.0,
                                      "replies": [
                                        {
                                          "id": "n2gtaom",
                                          "author": "DinosaurShotgun",
                                          "body": "If you thought I was serious, you really are just stupid. Take the L and move on.",
                                          "score": 3,
                                          "created_utc": 1752194984.0,
                                          "replies": [
                                            {
                                              "id": "n2gupio",
                                              "author": "CreatineAddiction",
                                              "body": "Why would I not think you are serious lmao? As I said. Inbred.",
                                              "score": 0,
                                              "created_utc": 1752195471.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n2b2zdy",
                      "author": "64bytesoldschool",
                      "body": "I’m a bot and think the hinge is fine as long as you use two iPhones.",
                      "score": 4,
                      "created_utc": 1752121482.0,
                      "replies": []
                    },
                    {
                      "id": "n2bt3pn",
                      "author": "profheg_II",
                      "body": "I had a flip 4 and in the space of 2 years had numerous issues. The hinge itself never actually failed, but the screen once broke near the hinge (dead pixels), the screen protector never stayed on for more than 9ish months before it started bubbling (and at the time I had to arrange for Samsung to replace it themselves else id break the warranty), and then finally it developed some kind of weird powering off issue that when I looked into it seemed likely tied to expected behaviour around if the phone thought it was folded open or closed. \n\nI really like the idea of a folding phone but I've never had more issues with a phone and I couldn't ignore how every single one was somehow tied to the feature. Still hoping they'll become more reliable in time but I wouldn't consider one again in the near future.",
                      "score": 2,
                      "created_utc": 1752134921.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n2auv3m",
                  "author": "locofspades",
                  "body": "Ive had the 4 and 6 and never had an issue",
                  "score": 10,
                  "created_utc": 1752118105.0,
                  "replies": []
                },
                {
                  "id": "n2ccv6j",
                  "author": "-IoI-",
                  "body": "My flip 4 broke after a year, my fold 6 is going really well at a year",
                  "score": 4,
                  "created_utc": 1752145647.0,
                  "replies": []
                },
                {
                  "id": "n2dtedu",
                  "author": "BRock11",
                  "body": "That's wild bad luck. I've had the 6 since launch with no case and have no issues with the hinge. My brother has had a 5 for twice as long without issue. What are you doing to your phones? How exactly did yours and your son's hinges fail?",
                  "score": 4,
                  "created_utc": 1752162801.0,
                  "replies": [
                    {
                      "id": "n2dtv9d",
                      "author": "Poam27",
                      "body": "It's me, my son and two buddies. I know it's more than bad luck.",
                      "score": 1,
                      "created_utc": 1752162930.0,
                      "replies": [
                        {
                          "id": "n2dul2p",
                          "author": "BRock11",
                          "body": "So what was the failure mode for these folds?",
                          "score": 5,
                          "created_utc": 1752163131.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n2bsng4",
                  "author": "Necessary_Grass_2313",
                  "body": "How come reviewers never bring it up? I didn't even know hinges were a problem.",
                  "score": 4,
                  "created_utc": 1752134657.0,
                  "replies": [
                    {
                      "id": "n2dr8sd",
                      "author": "thelonesomeguy",
                      "body": "What reviews are you reading that uses a device for 6-18 months?",
                      "score": 5,
                      "created_utc": 1752162197.0,
                      "replies": [
                        {
                          "id": "n2drwe5",
                          "author": "Necessary_Grass_2313",
                          "body": "Some channels do a \"X months after I bought this\"\n\nOr when they're reviewing the next model, that's a good time to bring up issues from the previous Gen and question if they've been fixed in the new model.",
                          "score": 0,
                          "created_utc": 1752162381.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n2eiorg",
                  "author": "bwood246",
                  "body": "A $6k lesson",
                  "score": 1,
                  "created_utc": 1752169778.0,
                  "replies": []
                },
                {
                  "id": "n2fu1p3",
                  "author": "pete_topkevinbottom",
                  "body": "My fold 3 is 3 years old and still going strong. ",
                  "score": 1,
                  "created_utc": 1752183361.0,
                  "replies": []
                },
                {
                  "id": "n2bigh3",
                  "author": "CutsAPromo",
                  "body": "That's unacceptable durability.  One day everyone will have these flipping and folding phones but it still needs to improve ",
                  "score": -5,
                  "created_utc": 1752129022.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n2d5noc",
              "author": "Hedhunta",
              "body": "I've had a zfold2 since it came out... or a few months after anyway... I don't know what people are doing with their phones, but I wouldn't recommend a foldable to people who are clumsy. The only thing my phone has wrong with it is I scratched the center of the screen putting credit cards in my pocket.. totally my fault, but also almost unnoticeable and doesn't effect the use of the device whatsoever.\n\nBattery still lasts 16+ hrs/day with moderate use, or several days of light use. Almost never gets below 50% before it goes back on the charger. Been a great phone.. only now just starting to look for upgrades because the case I've been using is discontinued and I don't like any of the still available options.",
              "score": 2,
              "created_utc": 1752156037.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n2bq73w",
          "author": "SmooK_LV",
          "body": "My Flip 6 is working well after 12 months, no problems.\nEdit: to add, my moms fold 5 is going strong after two years.",
          "score": 19,
          "created_utc": 1752133257.0,
          "replies": []
        },
        {
          "id": "n2beuxv",
          "author": "SpitFire92",
          "body": "Had the 3,used it for 2 1/2 years. No direct issues with the hinge but the speakers stopped working, apparently they used a flat cable that passes trough the phone and disconnected from the mainboard...",
          "score": 5,
          "created_utc": 1752127137.0,
          "replies": []
        },
        {
          "id": "n2c6rb2",
          "author": "w2podunkton",
          "body": "Damn that's rough luck with two devices. I've been curious about foldables but stories like this make me hesitant. Seems like the tech still isn't quite there for long-term reliability yet",
          "score": 5,
          "created_utc": 1752142679.0,
          "replies": [
            {
              "id": "n2d1n84",
              "author": "nirurin",
              "body": "Ive owned a z flip 2, 3, 4, and am now still on the 5 because its been more than good enough and the 6 didnt really upgrade anything. \n\nScreen protectors usually peel up after 12+ months but you just replace them like any other screen protector. \n\nOther than that the only issue was my flip4 usbc port became unreliable, but that was almost definitely due to being soaked in alcohol and other cleaning products daily for a year due to covid. \n\nScreens and hinges all remained perfect. Really cant complain. \n\nFlip5 has lasted 2 years now with no signs of failure (other than screen protector).",
              "score": 5,
              "created_utc": 1752154831.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n2bl0z8",
          "author": "SizzlingPancake",
          "body": "My flip 5 lasted 13 months  until the screen separated along the hinge and made the middle third of the phone unusable, also killing the digitizer. Had to use a mouse and keyboard to migrate my data to my new pixel, one or two minor drops in the phone ever. Never another foldable for me.",
          "score": 8,
          "created_utc": 1752130408.0,
          "replies": []
        },
        {
          "id": "n2d5r2d",
          "author": "kneel23",
          "body": "My flip Z 6 was awesome, i loved it. I traded it in to get a bigger phone back with better camera again but kinda want it back now.  Oddly that was also the only phone i could wirelessly charge even with a popsocket on",
          "score": 2,
          "created_utc": 1752156065.0,
          "replies": []
        },
        {
          "id": "n2f7ifw",
          "author": "xarkness",
          "body": "Seems to me use + factory QA dependent maybe? I've had 4 for 2.5-3 years and haven't had any issues with the hinge",
          "score": 2,
          "created_utc": 1752176825.0,
          "replies": []
        },
        {
          "id": "n2dd2fu",
          "author": "VictoriaRose0",
          "body": "Foldables are honestly a consumer device for those that can spend money on it without thinking too much about it\n\nHardly any of us here should be looking at devices with so many points of failures when we need this shit for emergencies, communication, and now a ton of responsibilities that are tied to it. Foldable tablets are one thing, but smartphones aren’t tech toys anymore, it’s like needing a fridge and going for the smart fridge with limited updates if any at all over a nice basic fridge that can last you way longer. It’s no one’s fault but yours when it breaks when we KNOW what worked for decades with no issues.\n\nNobody I ask about it irl want a foldable because it’s expensive and fragile, when I see someone with it in the wild 9/10 they’re someone with a lot of money and barely any hobbies to pull that money away.",
          "score": 1,
          "created_utc": 1752158218.0,
          "replies": [
            {
              "id": "n2jljtd",
              "author": "Kingdionethethird",
              "body": "Damn. I guess you’re right. I really didn’t think about it that way. I have the fold 6, but I also have an iPhone. I’d never carry a folding phone as my only phone. Even if I daily drive the fold, I simply would not be comfortable having it as my only phone. When I bike or do anything active, I don’t even consider taking my Zf6 with me on those trips. A buddy of mine at work has the pixel fold, but he also has a traditional slab phone as well.",
              "score": 1,
              "created_utc": 1752239572.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n2cp4my",
          "author": "r-kellysDOODOOBUTTER",
          "body": "My screen went black but the hinges still worked. I never dropped the phone. It still turned on. It was a couple of months out of warranty. They wanted $700 to fix it so I said send it back broken lol. Never again. \n\nMy SO's 23 ultra did the same thing, black screen, no cracks. She went back to motorola for her next phone. $400 for their flagship on sale. Can't be too pissed if it breaks. My last motoraolla was a z2 force and I used it for 4 years, I'll be going back to them next as well.\n\nThis was both of our first time with Samsung and it's pretty disappointing.",
          "score": 2,
          "created_utc": 1752150617.0,
          "replies": [
            {
              "id": "n2cqsxy",
              "author": "Poam27",
              "body": "My latest was still under warranty, so I sent it in for repair. They told me I broke the phone which is utter nonsense. If by broken phone, they mean a known design weakness on the phone was exposed through normal use, then sure.  They basically wanted the price of a new phone to repair. This was all on the heels of a Samsung dishwasher I bought dying after 6 months with zero customer support on that as well. Samsung can rot.",
              "score": 2,
              "created_utc": 1752151223.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n2amzxp",
      "author": "daddyjailbreakme",
      "body": "Battery is embarrassing",
      "score": 93,
      "created_utc": 1752115061.0,
      "replies": [
        {
          "id": "n2bnxf0",
          "author": "69eatmyass69",
          "body": "Battery size is the same but software improved. Measured screen time has actually increased year over year. Increasing battery size is irrelevant when battery life can be extended via software / hardware efficiency.",
          "score": -14,
          "created_utc": 1752131987.0,
          "replies": [
            {
              "id": "n2csrhx",
              "author": "daddyjailbreakme",
              "body": "You're not wrong but having 30% less capacity than the competition is just unacceptable.",
              "score": 9,
              "created_utc": 1752151915.0,
              "replies": []
            },
            {
              "id": "n2cjpgk",
              "author": "tolandjordan",
              "body": "Idk why you’re being downvoted….? It’s true. \nPeople spend more and more time on their phones and most don’t follow proper battery charging techniques. \nSoftware optimization has a direct correlation to how your phones computer chips use energy. If it takes .01% of your battery to send a text, and they can take that down to .001% of your battery just through optimization then it’s going to make your battery last longer…as long as the increased screen time doesn’t overlap the improvement on optimization. \n\nThat’s what I’ve garnered through research online, am I just totally off base here?",
              "score": 12,
              "created_utc": 1752148550.0,
              "replies": []
            },
            {
              "id": "n2cmnzj",
              "author": "bender3600",
              "body": "You can improve both.",
              "score": 1,
              "created_utc": 1752149700.0,
              "replies": []
            },
            {
              "id": "n2ciq7b",
              "author": "4kVHS",
              "body": "Ok Tim Apple",
              "score": -2,
              "created_utc": 1752148162.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n2biupu",
      "author": "michaelthatsit",
      "body": "Headlines that start with “finally” always irk me.",
      "score": 28,
      "created_utc": 1752129237.0,
      "replies": []
    },
    {
      "id": "n2azsni",
      "author": "WordNERD37",
      "body": ">Samsung Galaxy Z Fold 7 Hands-On: Finally as Thin and Light as a Regular Phone\n\nBut still, double the price!",
      "score": 29,
      "created_utc": 1752120111.0,
      "replies": [
        {
          "id": "n2dfu2u",
          "author": "MathematicianLessRGB",
          "body": "Wait for samsung day. I got my fold 6 2tb for $1k. These phones dont sell well at all and go on deep af discounts",
          "score": 5,
          "created_utc": 1752159006.0,
          "replies": [
            {
              "id": "n2djcw9",
              "author": "WordNERD37",
              "body": "I actually own the Fold 6, and got it sub $1k with trade in. The problem with these are, they're still treating this as some niche piece of tech that demands this ridiculous price tag; when they're just fine with letting them go for half the msrp or less all the time (with trade in).\n\nJust, bring the price down to earth already. The adoption rate will climb faster when consumers aren't looking at a lead weight price tag like this. It's way too much at this point and is proverbially poisoning the well.",
              "score": 3,
              "created_utc": 1752159998.0,
              "replies": [
                {
                  "id": "n2dkd6y",
                  "author": "MathematicianLessRGB",
                  "body": "I got mines sub 1k with no trade ins. Samsung is desperate for people to buy it and I assume the new fold 7 will drop sub 1k around samsung day. And this is the 2tb version. You can get the lower memories for cheaper\n\nAnd agreed. I feel like mine is a ticking time bomb and it forced me to get samsung protection insurance. Im definitely going back to a brick phone after. Much more safer and better battery life.",
                  "score": 2,
                  "created_utc": 1752160278.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n2h55w3",
              "author": "Taviii",
              "body": "What is a ‘samsung day’? When is that?",
              "score": 3,
              "created_utc": 1752199113.0,
              "replies": []
            },
            {
              "id": "n2hp8qw",
              "author": "Grumpygig",
              "body": "What day is this?",
              "score": 1,
              "created_utc": 1752206829.0,
              "replies": [
                {
                  "id": "n2jcjgw",
                  "author": "MathematicianLessRGB",
                  "body": "I misspoke. It was during samsung fall event on sep 9th-15th. I would look for deals then",
                  "score": 2,
                  "created_utc": 1752236446.0,
                  "replies": [
                    {
                      "id": "n2n8t7s",
                      "author": "Xendrus",
                      "body": "RemindMe! 60 days",
                      "score": 3,
                      "created_utc": 1752279084.0,
                      "replies": [
                        {
                          "id": "n32plv4",
                          "author": "MathematicianLessRGB",
                          "body": "Check out \"slickdeals\" during the week. That is how I found out and also from hovering in the galaxy fold subreddit.",
                          "score": 1,
                          "created_utc": 1752500689.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n30x91i",
                      "author": "keybravery",
                      "body": "RemindMe! 60 days",
                      "score": 2,
                      "created_utc": 1752469480.0,
                      "replies": [
                        {
                          "id": "n32pkrt",
                          "author": "MathematicianLessRGB",
                          "body": "Check out \"slickdeals\" during the week. That is how I found out and also from hovering in the galaxy fold subreddit.",
                          "score": 1,
                          "created_utc": 1752500680.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n2bcrjm",
          "author": "zkyevolved",
          "body": "And, at the very least, double as fragile, too!!!",
          "score": 4,
          "created_utc": 1752126076.0,
          "replies": [
            {
              "id": "n2cqekl",
              "author": "AndreProulx",
              "body": "I had a 3 and am running a 5 now; several big drops on both and never had an issue.  They're pretty rugged phones.  The outside screen glass does seem a bit soft on the 5 though.",
              "score": 6,
              "created_utc": 1752151082.0,
              "replies": [
                {
                  "id": "n2ddo7x",
                  "author": "VictoriaRose0",
                  "body": "My 13 Pro Max came out that same year and I still have it with no problems, can’t do that with a foldable, even with me planning on switching to Android when it dies, I’ll have that same experience with almost any candybar styled phone, it’s just too fragile to be an actual tool like phones have become instead of tinkering devices like they were before",
                  "score": -1,
                  "created_utc": 1752158390.0,
                  "replies": [
                    {
                      "id": "n2gohi1",
                      "author": "AndreProulx",
                      "body": "I know several people running  foldables for 4+ years.  You don't know what youre talking about at all.  Just speculation.",
                      "score": 4,
                      "created_utc": 1752193284.0,
                      "replies": [
                        {
                          "id": "n2h2fzh",
                          "author": "VictoriaRose0",
                          "body": "And I don’t have to go “I know people that”, brick phones are more reliable and you’re crazy if you think it lasts as long, I don’t *need* to give examples to prove my point, it’s common fucking sense",
                          "score": -2,
                          "created_utc": 1752198160.0,
                          "replies": [
                            {
                              "id": "n2h41eb",
                              "author": "AndreProulx",
                              "body": "'People that brick phones'\n\nSo you know its the user nit the device?\n\nAlso when your 'common sense' conclusion is disproved by real world data that just means your assumption is wrong lol.  Keep talking about shit you've never used.",
                              "score": 2,
                              "created_utc": 1752198719.0,
                              "replies": [
                                {
                                  "id": "n2h48jo",
                                  "author": "VictoriaRose0",
                                  "body": "You’re high or something, I don’t know what you’re derailing towards",
                                  "score": -1,
                                  "created_utc": 1752198789.0,
                                  "replies": [
                                    {
                                      "id": "n2hh53w",
                                      "author": "AndreProulx",
                                      "body": ">I don’t know\n\nThat's all you need to say bud.  You're hunch is that the phones aren't durable.  It's wong, but that's ok.",
                                      "score": 1,
                                      "created_utc": 1752203525.0,
                                      "replies": [
                                        {
                                          "id": "n2j1mjo",
                                          "author": "VictoriaRose0",
                                          "body": "It’s not\n\nEdit: before you come back with some kind of bs statement, that’s the end of the discussion. You obviously don’t know what you’re talking about, one device has a glass screen, the other folds, one can handle nails, the other can’t, one doesn’t have points of failures, the other has a hinge and plastic screen over thin glass. Just because you’re a biased fanboy towards foldables, doesn’t mean that they’re more durable than a regular smartphone. You’re just upset because you can’t find any way to prove your point other than saying “nah bro trust me, it’s durable”, you gotta be a troll or something. And I’m just gonna block you if you keep being an idiot\n\nEdit 2: so my guy decided to make some statement then immediately block me, that shows how right you are. Being one use case over the many I’ve seen saying to wait, think smart people, don’t get a gimmick device when you rely on said device for emergencies, be smarter than him and don’t take that risk",
                                          "score": 1,
                                          "created_utc": 1752231971.0,
                                          "replies": [
                                            {
                                              "id": "n2j3x3b",
                                              "author": "AndreProulx",
                                              "body": ">having never used one, I will make a blanket statement based on my hunch. I'd rather try to convince someone who has actually used them for 5 years that my hunch is more valid than their real world experience than even consider my hunch is wrong. Good day sir!\n\nYou're a fucking idiot.",
                                              "score": 0,
                                              "created_utc": 1752232994.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n2cg281",
          "author": "firewire_9000",
          "body": "2 k, that’s wild.",
          "score": 1,
          "created_utc": 1752147056.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2awx6o",
      "author": "crymachine",
      "body": "Rip headphone jack, expandable storage, the s pen, and the s pen again.",
      "score": 52,
      "created_utc": 1752118935.0,
      "replies": [
        {
          "id": "n2blgo7",
          "author": "external72",
          "body": "Am I missing something? Headphone jack and expandable storage have been gone from premium segment for years at this point. Fold never even had that at any point. And usb-C wired headphones are basically the same thing? \n\nSad about S pen support tho",
          "score": 55,
          "created_utc": 1752130642.0,
          "replies": [
            {
              "id": "n2bn205",
              "author": "crymachine",
              "body": "We are getting less features, less options, and paying more for it. Samsung ditched the s pen, which other companies still include in their foldables, and Samsung didn't even use the latest battery technology (carbon I believe) and stuck with lithium.\n\nYour missing the history of having great, usable, accessible features that were standard and came with a phone that have been removed and gutted without price cut or reasonable exchange; Apple at least has always sucked and offered next to nothing. Samsung generally had the compliment it gave users options and features.\n\nUSB-c headphone jacks are just wear and tear on the port that will cause an expensive repair quicker down the road later.\n\nMy six year old s10e hasn't needed a single repair, and there's never been any storage limit problems, nothin. My s23 I've had under a year now has me carrying around wireless headphones that are annoying, don't pause/start as quickly as wired headphones, need to be charged, and I have to manage my storage about three times as often.\n\nSamsung and phones in general aren't getting better for consumers, they're getting better at copying the subscription style capitalism payment trap and trying to lock people into \"ecosystems\" which, sucks.",
              "score": 16,
              "created_utc": 1752131509.0,
              "replies": [
                {
                  "id": "n2byg1v",
                  "author": "external72",
                  "body": "Believe me, I do get the frustration with general enshitification of tech products over last few years and yes it sucks ass. But again Samsung is just one brand making foldables and if you dont like their approach, you have options for at least 7 other phones which may or may not have the features you desire. The oppo foldable has a pen support, for example. Nobody said that if you want a foldable then it should only be Samsung.\n\nI also don’t get your point about headphones where if you’re carrying wired then wireless only occupies a little bit more space than them? Like you have to carry both anyways lol. Also charging port has almost never failed me on any phone ever. Maybe it’s just anecdotal but I have a iPhone 4, 7, XR and oneplus nord, fold 2 and others and there are bunch of problems with different parts but almost never the charging port lol\n\nStorage I kinda agree with but don’t really get bc in last 3 years, I haven’t even come close to filling my 512 gb of storage",
                  "score": 7,
                  "created_utc": 1752138046.0,
                  "replies": []
                },
                {
                  "id": "n2bo1wc",
                  "author": "69eatmyass69",
                  "body": "It's minimalism, I like it. No need for wired headphones. All of mine are bluetooth. I have never once reached 1TB on any of my phone storage. And I have no use or need for the SPen.",
                  "score": -5,
                  "created_utc": 1752132055.0,
                  "replies": [
                    {
                      "id": "n2boosa",
                      "author": "crymachine",
                      "body": "Your car could come without a seat belt and you may never be involved in a car crash so you could call it minimalist and enjoyable. Losing features while things become more expensive is bad for consumers.",
                      "score": -3,
                      "created_utc": 1752132407.0,
                      "replies": [
                        {
                          "id": "n2bqbhd",
                          "author": "69eatmyass69",
                          "body": "Why do I need features I have no use for? Wired headphones? What is this 1997? Expandable storage is useless when I have 5 TB on my Google drive. I will never use an S Pen and have no need for it. Why would I want any of these things lol",
                          "score": 3,
                          "created_utc": 1752133326.0,
                          "replies": [
                            {
                              "id": "n2bvlcy",
                              "author": "N2-Ainz",
                              "body": "Because Google Drive will help you when your phone storage is full 😂\n\n1. Google Drive is obviously more expansive than local storage\n\n2. Google Drive requires internet, have fun when there is none",
                              "score": -1,
                              "created_utc": 1752136386.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n2bop0r",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -3,
                      "created_utc": 1752132410.0,
                      "replies": [
                        {
                          "id": "n2c1cia",
                          "author": "Detective-Crashmore-",
                          "body": "People will complain loudly about the S pen, but the reality is that almost nobody was using it, and that's why they got rid of it. Most common use of the s pen is just a camera remote.",
                          "score": 6,
                          "created_utc": 1752139729.0,
                          "replies": [
                            {
                              "id": "n2c3fsu",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 0,
                              "created_utc": 1752140903.0,
                              "replies": [
                                {
                                  "id": "n2ceiow",
                                  "author": "rapsney",
                                  "body": "Didn’t you just say they shouldn’t design a phone around one person?",
                                  "score": 4,
                                  "created_utc": 1752146382.0,
                                  "replies": []
                                },
                                {
                                  "id": "n2dkq5q",
                                  "author": "Detective-Crashmore-",
                                  "body": "The point is that most people aren't using it, even if a small, loud minority like yourself makes it seem like a bigger issue than it is.",
                                  "score": 1,
                                  "created_utc": 1752160378.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "n2bq5v4",
                          "author": "69eatmyass69",
                          "body": "Exactly, they shouldn't design phones around one person. Like for example, someone like me who prioritizes thinness of the phone. I'm glad they didn't just focus on the people that want to use an S Pen, because I have no use for one and prefer the smaller form factor.",
                          "score": 3,
                          "created_utc": 1752133237.0,
                          "replies": []
                        },
                        {
                          "id": "n2ddd6l",
                          "author": "981032061",
                          "body": "> Less features\n\n“Fewer” when you’re referring to a quantity.",
                          "score": 0,
                          "created_utc": 1752158303.0,
                          "replies": [
                            {
                              "id": "n2gcuhh",
                              "author": "crymachine",
                              "body": "A pretty flimsy and not hard set grammar rule.\n\n\"less features\" removed headphone jack, removed SD card slot, removed s pen. All going from the quantity of one to zero; which if you wanna be a big nerd, isn't really a number but a placeholder. An empty quantity. \n\n\"fewer features\" removed secondary headphone jack, leaving only one to the device. From two to one. Fewer. Sure. Either works and neither fails a hard rule.\n\nYou don't say \"fewer than two-hundred dollars\" (correct) you say \"less than two-hundred dollars\" (wrong).\n\nYou can read it as overall (multiple removed components equally a total whole) fewer things are apart of the device - but I wrote it as there are less individual things apart of the device now (individual features lost, all unique and separate). Because if I had a headphone jack, expandable storage, and a stylus, it wouldn't be considered a phone, they're just parts not equalling a whole.",
                              "score": 1,
                              "created_utc": 1752189330.0,
                              "replies": [
                                {
                                  "id": "n2niy1u",
                                  "author": "981032061",
                                  "body": "Edit: Apologies! I didn’t realize you were ESL. Yes, your method will generally allow an English speaker to understand what you mean when you say that, and that’s the important part. No worries about getting the grammar *exactly* right.",
                                  "score": 1,
                                  "created_utc": 1752282786.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n2de4y8",
              "author": "VictoriaRose0",
              "body": "The problem with USB C headphones is that you need yet another dongle if you want to charge and listen to music, one for the headphones since 9/10, you’re not using cheap headphones and they’re probably audiophile grade if you want a headphone jack, and that plugs into the dongle for charging since good luck finding a headphone jack/charging dongle with a decent DaC",
              "score": 2,
              "created_utc": 1752158523.0,
              "replies": [
                {
                  "id": "n2fzyze",
                  "author": "external72",
                  "body": "Tbh I don’t know enough about audiophile grade headphones. My question would be that is there no type-c solution from the manufacturers or 3rd party vendors? If yes then you can probably use that. If no, then they are maybe sleeping on a big market haha. In that case I’m stumped lol. Maybe you have other audiophile gear so you can use that?\n\nAs for your charging, use a wireless charger lol. They’ve been standard for last decade or so.",
                  "score": 1,
                  "created_utc": 1752185184.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n2n0jpp",
          "author": "icyhotonmynuts",
          "body": "you forgot to lament about the removable battery.",
          "score": 0,
          "created_utc": 1752276185.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2aa1f9",
      "author": "Mrhyderager",
      "body": "I've got the 6, and previously owned the 2 & 3. I'm bought into the concept. I'm interested in putting my hands on it, although the year over year jump from the 2-3 was similarly massive.\n\nSeems to me like now that it's this thin, the candy bar aspect ratio of the front screen should be able to be expanded to the size of a flagship as well.",
      "score": 16,
      "created_utc": 1752110490.0,
      "replies": [
        {
          "id": "n2agmsx",
          "author": "TpMeNUGGET",
          "body": "They did. It's a standard 21:9 aspect now.",
          "score": 14,
          "created_utc": 1752112801.0,
          "replies": [
            {
              "id": "n2agpq4",
              "author": "Mrhyderager",
              "body": "Oooooo shit I might have to upgrade early",
              "score": 7,
              "created_utc": 1752112829.0,
              "replies": [
                {
                  "id": "n2agu7s",
                  "author": "TpMeNUGGET",
                  "body": "Yeah, they did remove S-pen support though so be aware of that",
                  "score": 3,
                  "created_utc": 1752112872.0,
                  "replies": [
                    {
                      "id": "n2ah5mi",
                      "author": "Mrhyderager",
                      "body": "Good call out, but I'm not the target audience for the S Pen. Tried it with past Galaxy Notes and Tabs and never got the use out of it.",
                      "score": 20,
                      "created_utc": 1752112983.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n2bfubd",
      "author": "highways",
      "body": "Such a tiny battery.\n\nIt desperately needs a bigger battery",
      "score": 9,
      "created_utc": 1752127638.0,
      "replies": [
        {
          "id": "n2cocvz",
          "author": "TwoLeaf_",
          "body": "Same battery as the fold6, and people didn't have a problem with it. Of course more is always better, that goes without saying, but you are overreacting",
          "score": 7,
          "created_utc": 1752150333.0,
          "replies": [
            {
              "id": "n3rho4v",
              "author": "daddyjailbreakme",
              "body": "He's not overreacting at all. The battery is an instant deal breaker.",
              "score": 1,
              "created_utc": 1752814432.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n2d4jt2",
          "author": "Hedhunta",
          "body": "What? I have a Zfold2 and its battery literally lasts 16+ hrs of moderate use... What are you doing on the phone that requires so much battery?... Mine almost never makes it below 40% before I put it on the charger at bed time.",
          "score": 2,
          "created_utc": 1752155706.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2d07sy",
      "author": "Chigibu",
      "body": "Samsung doing all the innovations.",
      "score": 2,
      "created_utc": 1752154380.0,
      "replies": []
    },
    {
      "id": "n2azycc",
      "author": "Unique_Junket_7653",
      "body": "No enlarged vapor chamber is insane, especially considering how thin this phone is unfolded.",
      "score": 4,
      "created_utc": 1752120179.0,
      "replies": []
    },
    {
      "id": "n2az6hv",
      "author": "Kellic",
      "body": "Honestly I could not give less of a #$(\\*& about thin and light.  Over the course of 27 years of portable device use I've carried Palm Pilot 5000's, Casio Cassiopeia Windows CE devices, Ipaq devices, and a host of Windows CE phones that fit perfectly fine in my pocket.  This, what I'm classifying as a fetish people have for thin is costing features, battery life, repair-ability, and frankly the ability to replace batteries.  Frankly all of you have been duped into needing thin by Apple.  As they started this crap...It is absolutely not needed unless everyone is wearing jeggings in which case sure.",
      "score": 11,
      "created_utc": 1752119855.0,
      "replies": [
        {
          "id": "n2bokjc",
          "author": "AgencyBasic3003",
          "body": "Stop screaming at clouds old men. Thin and light devices are needed because devices nowadays would become unbearably heavy.\n\nYour palm pilot 5000 was thick, but its weight was obly 160g. An iPhone 16 pro max weights 227g, so it is 42% heavier.\n\nIf it would be as thick at the palm device was back then it would weight approx 495g. That’s 1.1 pounds. That would make it more than 3x heavier than the palm.\n\nThat’s why devices need to be slimmer. Otherwise we would have to carry heavy bricks which would totally defeat the purpose of being mobile.",
          "score": 24,
          "created_utc": 1752132341.0,
          "replies": [
            {
              "id": "n2frnv6",
              "author": "elsjpq",
              "body": "nobody's forcing Apple to make the damn thing out of a hunk of metal. Switch to plastic and you won't have weight issues",
              "score": 2,
              "created_utc": 1752182644.0,
              "replies": []
            },
            {
              "id": "n2d2shq",
              "author": "SidFarkus47",
              "body": "I mean sure, but I think a lot of people would accept some super thin devices being 5-10% bulkier if we would also get 5-10% more battery capacity. Like some tablets are just more thin than I'm even comfortable holding.",
              "score": 1,
              "created_utc": 1752155182.0,
              "replies": [
                {
                  "id": "n2gjnkx",
                  "author": "w1zinvestmentss",
                  "body": "Exactly, we don't need super thin. I would prefer the extra bulk and we have to use cases anyways. Our store our lives now, we can't afford to have them randomly breaking. I love my iPad pro, but I could never use that thing naked, it's not even fun.",
                  "score": 2,
                  "created_utc": 1752191603.0,
                  "replies": []
                },
                {
                  "id": "n2n2lg8",
                  "author": "icyhotonmynuts",
                  "body": "I was naive like that in my you get days. my note 8 had a case with a 10,000mah battery built into it. I too prioritized battery and said who cares if it's a bit thicker. Turns out it was a really heffer and it's not all its cracked up to be. Even my s2 I got a replacement extra capacity and replacement cover to double the capacity. I'm past those days. Happy for a lighter thinner phone that isn't awkward to carry around in my pocket or pull my shorts down when I'm out for a jog.",
                  "score": 1,
                  "created_utc": 1752276893.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n2djc17",
              "author": "Muslim_Wookie",
              "body": "Why would it be heavier if it was larger?",
              "score": 1,
              "created_utc": 1752159991.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n2bfmxp",
          "author": "Cry_Wolff",
          "body": "Ok Boomer.",
          "score": -5,
          "created_utc": 1752127533.0,
          "replies": []
        },
        {
          "id": "n2bo39k",
          "author": "69eatmyass69",
          "body": "Ok grandpa",
          "score": -2,
          "created_utc": 1752132077.0,
          "replies": []
        },
        {
          "id": "n2b11ck",
          "author": "Lied-",
          "body": "😂😂 I’m rocking an iphone12 mini with a cracked screen and I will die before i give more money to apple",
          "score": -2,
          "created_utc": 1752120639.0,
          "replies": [
            {
              "id": "n2boyfi",
              "author": "PUTASMILE",
              "body": "Replying from a 16pm, bless your heart. \n\nYou already did. Your next phone will be an iPhone. ",
              "score": 1,
              "created_utc": 1752132555.0,
              "replies": [
                {
                  "id": "n2bt96n",
                  "author": "Lied-",
                  "body": "But why tho",
                  "score": 0,
                  "created_utc": 1752135009.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n2bard4",
      "author": "auroriasolaris",
      "body": "Such a pointless letdown. No S-Pen again and wait... 4400 battery??? Samsung really is laughable in terms of basic functions. Other companies can fit over 5k on foldable phones and now over 6000 in flagships yet Samsung refuses to do so...",
      "score": 4,
      "created_utc": 1752125063.0,
      "replies": [
        {
          "id": "n2c8ztm",
          "author": "countingthedays",
          "body": "I’ve had it in hand already. The battery is a compromise for thickness for sure. Personally I think it felt great, but the large screen battery life is probably pretty rough.",
          "score": 1,
          "created_utc": 1752143824.0,
          "replies": []
        },
        {
          "id": "n2cp05b",
          "author": "Spazzdude",
          "body": "I am disappointed by the battery as well but if there is one company I expect to be cautious around adopting new battery tech, it's Samsung. They don't want another note 7. It has, however, been just about 2 years since they started showing up in phones, they need to figure it out.",
          "score": 1,
          "created_utc": 1752150571.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2ifuga",
      "author": "kevanions",
      "body": "I would never buy a fold. They are ugly as fuck",
      "score": 2,
      "created_utc": 1752220153.0,
      "replies": [
        {
          "id": "n2kgskv",
          "author": "EnvironmentalRun1671",
          "body": "How so",
          "score": 0,
          "created_utc": 1752248757.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2bd21k",
      "author": "Euro7star",
      "body": "Wow this is more powerful than a Switch 2. Lol",
      "score": 2,
      "created_utc": 1752126222.0,
      "replies": [
        {
          "id": "n2bypzc",
          "author": "littlebiped",
          "body": "And quadruple the price so yeah",
          "score": 5,
          "created_utc": 1752138206.0,
          "replies": [
            {
              "id": "n2jv3jy",
              "author": "UnsorryCanadian",
              "body": "Truely nothing but greed, I'm gonna boycot Samsung now even though I had no intent to buy one anyway \n\n\n/j",
              "score": 1,
              "created_utc": 1752242575.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n2bote8",
          "author": "d3agl3uk",
          "body": "Yeah Switches have never been powerful devices. I'm surprised it doesn't get more flack.",
          "score": 1,
          "created_utc": 1752132478.0,
          "replies": []
        },
        {
          "id": "n2cqnjn",
          "author": "AndreProulx",
          "body": "Its also like..  3x the price?",
          "score": 0,
          "created_utc": 1752151170.0,
          "replies": [
            {
              "id": "n2fp8hq",
              "author": "Euro7star",
              "body": "Yeah well It has a camera and can make calls and do much more than a Switch 2 can. You have to buy the camera for Switch 2 serarately and its nowhere near the quality of the Fold 7 camera. It can also fit in your pocket, so its expected that itll cost more.",
              "score": 1,
              "created_utc": 1752181915.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n2bfpfn",
          "author": "Cry_Wolff",
          "body": "Not really, no.",
          "score": -4,
          "created_utc": 1752127568.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2bn20l",
      "author": "unematti",
      "body": "They're destroying the reputation of their best lines, note, S, fold now... They once had the power user line, the extra nice line, and later, the foldable... Now no sd slot, no jack, no spen(which I'm a huge fan of, same pen on tablet and phone is great). And no battery life? What use is a thin phone if you can barely use it?",
      "score": 2,
      "created_utc": 1752131510.0,
      "replies": [
        {
          "id": "n2fr0jp",
          "author": "spinemc",
          "body": "I think it's great. S pen always seemed like a gimmick to me. The ability to have a full sized phone for regular use is soooo awesome. I understand the battery woes though.",
          "score": 1,
          "created_utc": 1752182451.0,
          "replies": [
            {
              "id": "n2hui7t",
              "author": "unematti",
              "body": "It's absolutely not just a gimmick, I use it daily, mainly because it's more precise than touch, and it seems it's just faster? Like the phone understands it better than the touch, so it can react faster...? Also it works if your phone is wet. Or underwater.",
              "score": 1,
              "created_utc": 1752209126.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n2gfys0",
      "author": "mikami677",
      "body": "Why do they all insist on putting the interior camera in the wrong place?",
      "score": 1,
      "created_utc": 1752190367.0,
      "replies": []
    },
    {
      "id": "n2h3633",
      "author": "13thFleet",
      "body": "How does it feel in the hand folded? I found the previous ones to be way too vertical for their width(like think portrait mode on steroids) but the Pixel 9 Fold feels great. However, I don't like Google's Software nearly as much as Samsung's",
      "score": 1,
      "created_utc": 1752198414.0,
      "replies": []
    },
    {
      "id": "n2qwb5h",
      "author": "TunaOnWytNoCrust",
      "body": "Cool stuff. I don't want to spend $2,000 on a phone that has a bent up warped screen. I will literally never buy one of these fucking things. Make the screen two separate screens that seamlessly fit together and cut the price in half and we'll talk. But I don't think we'll talk.",
      "score": 1,
      "created_utc": 1752336239.0,
      "replies": []
    },
    {
      "id": "n4c1h2f",
      "author": "hit_ahir_1317",
      "body": "The Fold 7 feels incredibly refined. Samsung has truly made it feel like a no-compromise flagship, foldable or not.",
      "score": 1,
      "created_utc": 1753102919.0,
      "replies": []
    },
    {
      "id": "n4cjf2y",
      "author": "Puzzled_Aide6397",
      "body": "Fold 7 is the foldable that doesn’t feel like a compromise anymore. Just a great phone that happens to fold.",
      "score": 1,
      "created_utc": 1753108705.0,
      "replies": []
    },
    {
      "id": "n4xrb53",
      "author": "hit_ahir_1317",
      "body": "This might be the first foldable I’d actually consider using daily. Slimmer, faster, and looks like it can handle real multitasking.",
      "score": 1,
      "created_utc": 1753378454.0,
      "replies": []
    },
    {
      "id": "n5mrcdc",
      "author": "hit_ahir_1317",
      "body": "Fold 7 finally feels like a no-compromise device—premium design, top-tier performance, and a crease that barely exists. Samsung’s most refined foldable experience yet. Looks like a true daily driver now",
      "score": 1,
      "created_utc": 1753719453.0,
      "replies": []
    },
    {
      "id": "n6c342v",
      "author": "hit_ahir_1317",
      "body": "The Fold 7’s side-by-side app experience is like having two phones in one. Other brands are trying, but Samsung’s multitasking layout just feels natural and optimized. This is where foldables shine, and Samsung is ahead.",
      "score": 1,
      "created_utc": 1754049719.0,
      "replies": []
    },
    {
      "id": "n6c54dz",
      "author": "alias_noa",
      "body": "This phone is an absolute beast.  The perfect phone imo (unless you really need s pen, I don't but I know some ppl do).  That's literally the only thing that keeps it from perfection.  Anyway I got a promo code for if you get it from samsung website: ref-mecem0\n\nAlso to veterans out there make sure to apply the veterans discount, I think with both of these you can save like $200 (I used both, and the $800 trade-in credit) saved like $1k total.",
      "score": 1,
      "created_utc": 1754050470.0,
      "replies": []
    },
    {
      "id": "n2cfs3z",
      "author": "frokta",
      "body": "I'm an S23U user, and I've been waiting for a zfold like this, and yet... Samsung's integration of AI into it's OS is pretty bad. Not just the functional nature of it, I have no idea how good or bad that is, but the privacy and misuse of personal data should be getting a LOT more press than it is. I am probably going to switch to an iPhone for the first time in 15 years to get away from Samsung entirely.",
      "score": 1,
      "created_utc": 1752146933.0,
      "replies": []
    },
    {
      "id": "n2dm99m",
      "author": "chumlySparkFire",
      "body": "And 24/7 privacy invasion included",
      "score": 1,
      "created_utc": 1752160798.0,
      "replies": []
    },
    {
      "id": "n2ee2jp",
      "author": "Horny4theEnvironment",
      "body": "Only 3x the cost of a regular phone!",
      "score": 1,
      "created_utc": 1752168538.0,
      "replies": []
    },
    {
      "id": "n2jfjhf",
      "author": "fkdisshyt",
      "body": "My fold 4 got black dots on seam after few months of use. Got it refurbished and this pos has same dots appearing again. All within 7-8 months",
      "score": 1,
      "created_utc": 1752237531.0,
      "replies": []
    },
    {
      "id": "n2bz213",
      "author": "machete777",
      "body": "Cool But I'm still not buying one until they figure out to bend glass screens. I'm not willing to buy the plastic screen.",
      "score": -1,
      "created_utc": 1752138403.0,
      "replies": [
        {
          "id": "n4d4yry",
          "author": "lallenlowe",
          "body": "You know the screen has had glass on it since the Fold 2 right?",
          "score": 0,
          "created_utc": 1753114872.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2b7w3h",
      "author": "CaptainColdSteele",
      "body": "I'm curious if the screen is actually flat when it's unfolded",
      "score": 0,
      "created_utc": 1752123686.0,
      "replies": []
    },
    {
      "id": "n2c22g5",
      "author": "peakedtooearly",
      "body": "Now as thin and light as a regular phone.\n\nNow with just the same functionailty as a regular phone (less functionality than an S25 Ultra).",
      "score": 0,
      "created_utc": 1752140142.0,
      "replies": []
    },
    {
      "id": "n2ajvnf",
      "author": "too_oh_ate",
      "body": "Who in any state of mind would pay $2,000 for this, or literally any phone? Lol, its a hilarious self own",
      "score": -22,
      "created_utc": 1752113943.0,
      "replies": [
        {
          "id": "n2ave80",
          "author": "TwelveGaugeSage",
          "body": "As a Fold owner, the added quality of life added by it versus any other phone is worth far more than what I paid for it.  Once you get used to having a small tablet everywhere you go, it would be really shitty to go back to a regular phone.",
          "score": 11,
          "created_utc": 1752118322.0,
          "replies": []
        },
        {
          "id": "n2jnr7a",
          "author": "Kingdionethethird",
          "body": "I have the fold 6 and I love it. But you’re right. It’s a very silly purchase that’s just not very justifiable If we’re being completely honest with ourselves. Yes it folds into a bigger screen. I love it. But is that worth 2000 bucks. Very likely not.",
          "score": 3,
          "created_utc": 1752240288.0,
          "replies": []
        },
        {
          "id": "n2akv8k",
          "author": "Grlions91",
          "body": "A lot of people. Clearly. Just because you don't want to doesn't mean it's wrong.\n\nMaybe you'll grow up one day and realize that.",
          "score": 21,
          "created_utc": 1752114296.0,
          "replies": []
        },
        {
          "id": "n2asapi",
          "author": "GoRacerGo",
          "body": "As a pianist, the benefits of having a tablet that can fit in my pocket are numerous",
          "score": 5,
          "created_utc": 1752117073.0,
          "replies": []
        },
        {
          "id": "n2am10z",
          "author": "CamiloArturo",
          "body": "A lot of people. The fact you can’t afford it doesn’t mean other people are on the same boat. \n\nMany many people do pay $2k for a phone and that’s why they sell out all the time.",
          "score": 9,
          "created_utc": 1752114712.0,
          "replies": []
        },
        {
          "id": "n2bnpqx",
          "author": "69eatmyass69",
          "body": "I'll be buying it. With cash. Ive been waiting for this tech to mature for years and this is the first phone they've released where I feel like it's actually there. Very excited.",
          "score": 4,
          "created_utc": 1752131872.0,
          "replies": []
        },
        {
          "id": "n2av3l8",
          "author": "locofspades",
          "body": "o/",
          "score": -2,
          "created_utc": 1752118201.0,
          "replies": []
        },
        {
          "id": "n2alnz9",
          "author": "Vandorol",
          "body": "Stop being poor",
          "score": -14,
          "created_utc": 1752114583.0,
          "replies": [
            {
              "id": "n2jodkp",
              "author": "Kingdionethethird",
              "body": "I bought a cyber truck cash last year. It was one of the silliest purchases I’ve ever made and totally. It with it. However, that doesn’t make me poor… just stupid. I say all that to say this: Just because someone is self aware enough to realize something is overpriced doesn’t mean they’re poor.",
              "score": 1,
              "created_utc": 1752240488.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n2b0xmn",
      "author": "Tormidal",
      "body": "Still a crap battery. Sticking with my Mate XT.",
      "score": -3,
      "created_utc": 1752120596.0,
      "replies": []
    },
    {
      "id": "n2ca9a9",
      "author": "nosocoolt",
      "body": "this one looks cool, but the camera bump is a bit too much",
      "score": 0,
      "created_utc": 1752144443.0,
      "replies": []
    },
    {
      "id": "n2cw2tp",
      "author": "Xyrack",
      "body": "I have a Z-Fold 4 which I've had mixed feelings on. I actually like having something weighty in my hands as opposed to a tiny gadget I feel like I could break if I sneezed while holding it. \n\nI've had the 4 for a few years now, I got it because I do on call IT work. Nice to have the big tablet view when trying to RDP into a server on the go. Worked great for like 2 or 3 years and then one day the big screen wouldn't turn on. I guess it's served me well for those 2-3 years but I miss the days of my Galaxy S3 which lasted me like 5 years.",
      "score": 0,
      "created_utc": 1752153034.0,
      "replies": []
    },
    {
      "id": "n2eih32",
      "author": "mavgeek",
      "body": "And it only took 7 iterations",
      "score": 0,
      "created_utc": 1752169721.0,
      "replies": []
    },
    {
      "id": "n2d7whi",
      "author": "Expensive_Prior_5962",
      "body": "I don't want thin.\n\nI don't want foldable.\n\nMake a phone that has an amazing battery.\n\nThat's it.",
      "score": -6,
      "created_utc": 1752156708.0,
      "replies": [
        {
          "id": "n2dq27a",
          "author": "lallenlowe",
          "body": "There are tons of smaller brands that make phones like that.",
          "score": 2,
          "created_utc": 1752161861.0,
          "replies": []
        },
        {
          "id": "n2jj9sf",
          "author": "Solisos",
          "body": "\"I don't want hypercars with spoilers.\"\n\n\"I don't want cars with gullwing doors\"\n\n\"Make a car that is good to get from A to B\"\n\n\"That's it\"",
          "score": 2,
          "created_utc": 1752238811.0,
          "replies": [
            {
              "id": "n2jktjt",
              "author": "Expensive_Prior_5962",
              "body": "Yes. That is exactly what 99% of people want....\n\nWhat's your point?",
              "score": 0,
              "created_utc": 1752239329.0,
              "replies": [
                {
                  "id": "n2jpael",
                  "author": "Solisos",
                  "body": "My point is your comment is meaningless. Plenty of phones that do what you're looking for, especially from China but you're here crying.",
                  "score": 3,
                  "created_utc": 1752240784.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n2cxqjy",
      "author": "Fenseven",
      "body": "Who asked for folding phones anyway?",
      "score": -5,
      "created_utc": 1752153575.0,
      "replies": [
        {
          "id": "n2fyphs",
          "author": "Feeling_Capital_7440",
          "body": "Me",
          "score": 8,
          "created_utc": 1752184781.0,
          "replies": []
        },
        {
          "id": "n2khbff",
          "author": "EnvironmentalRun1671",
          "body": "Who asked for touch screen phones?",
          "score": 1,
          "created_utc": 1752248902.0,
          "replies": []
        },
        {
          "id": "n2jj3ev",
          "author": "Solisos",
          "body": "Who asked for your birth anyway?",
          "score": 0,
          "created_utc": 1752238750.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2cn6m4",
      "author": "Whooptidooh",
      "body": "That’s going to break within a week.",
      "score": -3,
      "created_utc": 1752149896.0,
      "replies": []
    },
    {
      "id": "n2afofq",
      "author": "motohaas",
      "body": "Why do phone companies think that people want this?",
      "score": -40,
      "created_utc": 1752112464.0,
      "replies": [
        {
          "id": "n2afuyf",
          "author": "GermanCommentGamer",
          "body": "Because they do? I and many others want this.",
          "score": 32,
          "created_utc": 1752112527.0,
          "replies": []
        },
        {
          "id": "n2blhxn",
          "author": "SloppityMcFloppity",
          "body": "I've got a flip 5, I'm never going back to a regular non folding phone. I guess I'm in the demographic.",
          "score": 6,
          "created_utc": 1752130661.0,
          "replies": []
        },
        {
          "id": "n2bnr57",
          "author": "69eatmyass69",
          "body": "I want this?",
          "score": 4,
          "created_utc": 1752131893.0,
          "replies": []
        },
        {
          "id": "n2av6pe",
          "author": "locofspades",
          "body": "We do",
          "score": 8,
          "created_utc": 1752118236.0,
          "replies": []
        },
        {
          "id": "n2agr6c",
          "author": "theREAL_Harambe",
          "body": "Why do you think people don’t lmao",
          "score": 14,
          "created_utc": 1752112843.0,
          "replies": []
        },
        {
          "id": "n2ajzp6",
          "author": "DG_Now",
          "body": "Because it's awesome. You should get one.",
          "score": 8,
          "created_utc": 1752113982.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2bgnlv",
      "author": "Solrac50",
      "body": "The whole folding screen thing seems like an unnecessary vulnerability to me.  If you want greater screen area why not do what super large displays do and join two screen with zero space between them.  There would be no flex and with proper hinge design no pinch point either.",
      "score": -4,
      "created_utc": 1752128065.0,
      "replies": []
    },
    {
      "id": "n2denhp",
      "author": "BefuddledFloridian",
      "body": "Why?! So I can drop it?",
      "score": -2,
      "created_utc": 1752158671.0,
      "replies": []
    },
    {
      "id": "n2c6met",
      "author": "None",
      "body": "Imagine thinness being one of your top priorities as a manufacturer. People didn’t complain when phones were thicker 10 years ago. This obsession with compact bezelless thinness is killing tech’s practicality, reliability, and design as well.",
      "score": -5,
      "created_utc": 1752142608.0,
      "replies": [
        {
          "id": "n2d0t1b",
          "author": "silencesupreme-",
          "body": "What do you mean? People have always complained about phone thickness and bezels, like exclusively. Why else would the company push to make it thinner if they weren’t hearing that that’s what the consumer wanted? People love the idea of the fold but don’t want to carry around a heavy ass cellphone sandwich in their pockets.",
          "score": 5,
          "created_utc": 1752154567.0,
          "replies": [
            {
              "id": "n2ec5zx",
              "author": "None",
              "body": "Oh please, like the Fold 6’s 12mm in depth when folded is too thick, and a measly difference in weight between the 6’s 240 grams and the 7’s 215 grams is gonna be felt. 12mm for a fold phone is objectively a great thickness when even regular smartphones from 2013 were not far off at 8mm in depth.  \n  \nWe’re at a time now where thickness is no longer an issue and thinness is becoming the new issue. The issue is going to be tech’s reliability and serviceability if we keep thinning things into oblivion especially with fragile tech like foldable phones.",
              "score": 1,
              "created_utc": 1752168029.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}