{
  "post": {
    "title": "Why SNES hardware is running faster than expected—and why it’s a problem | Cheap, unreliable ceramic APU resonators lead to \"constant, pervasive, unavoidable\" issues.",
    "author": "chrisdh79",
    "id": "1jda4ok",
    "score": 1385,
    "created_utc": 1742209902.0,
    "selftext": "",
    "num_comments": 205,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jda4ok/why_snes_hardware_is_running_faster_than/"
  },
  "comments": [
    {
      "id": "mi8p3y6",
      "author": "Swallagoon",
      "body": "Which is why open source emulation separate from corporate intervention is extremely important for the preservation of art.",
      "score": 976,
      "created_utc": 1742210239.0,
      "replies": [
        {
          "id": "mi8sjuu",
          "author": "Medical_Solid",
          "body": "B-b-b-b-but what about corporate intellectual property rights? Won’t someone think of them? /s",
          "score": 327,
          "created_utc": 1742211897.0,
          "replies": [
            {
              "id": "mi8ydhn",
              "author": "RoadkillVenison",
              "body": "Fuck em?\n\nI think the original standard of 14+14 was good. It’s complete bullshit that works made in 1929 is only entering  public domain now.\n\nSNES is no longer sold, you cannot acquire many of the games through a legitimate channel, and that stuff should just be public domain.",
              "score": 294,
              "created_utc": 1742214452.0,
              "replies": [
                {
                  "id": "mi8z66k",
                  "author": "Edythir",
                  "body": "You should not be able to make a living \"Managing\" creative works created by a grandfather you never met. Or great grandfather even. The Hobbit is older than WW2 and still is managed by the Tolkien Estate.",
                  "score": 146,
                  "created_utc": 1742214781.0,
                  "replies": [
                    {
                      "id": "mib7x68",
                      "author": "HanCurunyr",
                      "body": "Tolkien books are still being printed and sold everywhere\n\nSNES carts and the console itself are not, the only way to play those games legally now is thru nintendo's own emulation on NSO\n\nThat's the main difference",
                      "score": 56,
                      "created_utc": 1742239502.0,
                      "replies": [
                        {
                          "id": "miblqdn",
                          "author": "RabidSeason",
                          "body": "Also, \"Tolkien Estate\" is very much the family who was given ownership of the works by the original creator.  I don't give a fuck what your politics are, companies are not people.  A person can own their creation for their entire life, and they can give it to their great grandchildren to own, and they can pass it on indefinitely for all I care.  But a company is not a person; it has no thoughts, creativity, nor desires; and it should have restrictions on it's ability to profit on any such things.\n\nIf there is unreleased music from Michael Jackson, Prince, or any other virtuoso, and their catalog is owned by their family, then that is still a human being who has creative control over their creation.  It's theirs to hold, share, or profit off of at their whim.  If it's owned by a company then it should absolutely be vulnerable to use-it-or-lose-it.",
                          "score": 50,
                          "created_utc": 1742243458.0,
                          "replies": [
                            {
                              "id": "miztlot",
                              "author": "chostax-",
                              "body": "lol, that same asset you are talking about handing down could also be a company in which people make a living. Not sure what your point is here?",
                              "score": 1,
                              "created_utc": 1742573240.0,
                              "replies": [
                                {
                                  "id": "mj4tpb7",
                                  "author": "RabidSeason",
                                  "body": "Yes, people can own companies.  If you can't understand that, I can't help you.",
                                  "score": 3,
                                  "created_utc": 1742645580.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mid4p78",
                          "author": "RoadkillVenison",
                          "body": "The thing about massive franchises like Tolkien’s, is they’ve got Trademarks. They can prevent anyone from using the likeness even without holding the copyright.\n\nCopyright is almost redundant for successful works, just preventing improvements or adaptations for failed works.",
                          "score": 2,
                          "created_utc": 1742261044.0,
                          "replies": [
                            {
                              "id": "miqw5oz",
                              "author": "night-otter",
                              "body": "Not just Tolkien, but others too.  I've read books with a list of characters at the end. With all the uncommon/madeup names being trademarked.\n\nJerryBob(tm)  \nSally  \nJenny Two Shot (tm)  \netc\n\n  \nWarner Bros has every bit of Harry Potter is locked up in Trademarks, to the point where the train engine that \"played\" the Hogwarts Express can not be displayed in public.",
                              "score": 3,
                              "created_utc": 1742445772.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "miejjk4",
                          "author": "Zilka",
                          "body": "Just like modern console games can be re-released on newer consoles with minimal visual changes, SNES era games occasionally get released on Steam. For example some classic Sonic games. Or Zero the Kamikaze Squirrel.",
                          "score": 1,
                          "created_utc": 1742285397.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mic4vjd",
                      "author": "NecroCannon",
                      "body": "I’m artist and fuck Disney for making public domains last as long as they do because of the mouse (just for it to all not even matter years later)\n\nLike I’ll be honest, I’ve seen more passion in fan works of some of the oldest IPs than I do the companies hoarding them. For example, Paramount and Hasbro has been fucking the Transformers IP in the ass just to finally cater to fans on their “failure” that broke the partnership. At this point the series should be in fans hands",
                      "score": 6,
                      "created_utc": 1742249161.0,
                      "replies": []
                    },
                    {
                      "id": "miar5jm",
                      "author": "Gintami",
                      "body": "Of course they should. The original works will enter public domain, but if it is left to their sons and grandchildren, yes they should.\n\nIf I create something and I die, it should go to my family if I leave it to them. I would want them to be set and should be theirs to handle and make a living off of it if I so choose to. Not taken away so then Amazon can just make money off of it without compensating my estate. \n\nThe books are not lost. You can buy them or read them for free from your library or online. And the originals will end up in PD.",
                      "score": 2,
                      "created_utc": 1742234707.0,
                      "replies": [
                        {
                          "id": "miazzge",
                          "author": "Bamstradamus",
                          "body": "There really needs to be a middle ground where if I want to make a LOTR movie I have to work out a contract, but if I want to make a movie using that established lore/magic system/world but a different story I have to wait X years since the last time the copyright holder created something in that world.\n\nOn the one hand its crazy that an IP can be dead for 100 years and nobody can touch it outside of parody.  But on the other hand if my kid keeps working on a book series that I started and it continues down the family line then I kinda get why it would be considered \"theirs\" until they sell it or quit.",
                          "score": 8,
                          "created_utc": 1742237239.0,
                          "replies": [
                            {
                              "id": "mibolou",
                              "author": "RabidSeason",
                              "body": "I think that middle ground should be if the owner is a human or a company.\n\nIf I create a story, and make little cartoons and videos for my kids and grandkids, and they continue on, perhaps entertaining friends and neighbors, but keeping the story their own; then that is absolutely their work no matter how old it is.  They should be able to say, \"That story belongs to our family, and you can't share recreations of it.\"  But if they sell it to Sony, and Sony sits on it for 19 years, and makes one flop of a movie just to say they're still using it (Fant4stic) then it should absolutely go back to the public after some time.\n\nYou can't just say, *Marshal Mathers (Eminem) released his first album over 25 years ago, so now I'm going to perform it because it's should be public domain.*  It's still his work!  But something like N'Sync, a company-manufactured product, is a different form of ownership, and it shouldn't be an issue if others want to recreate it.",
                              "score": 4,
                              "created_utc": 1742244281.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mi972hx",
                      "author": "GroinShotz",
                      "body": "So basically you don't think anyone should be allowed to inherit property? \n\nOr is it just against certain properties?\n\nIf Tolkien had a winery, and the grandkids and great grandkids are running the winery currently... This shouldn't be allowed?",
                      "score": -74,
                      "created_utc": 1742217818.0,
                      "replies": [
                        {
                          "id": "mi97qf6",
                          "author": "None",
                          "body": "[removed]",
                          "score": 94,
                          "created_utc": 1742218054.0,
                          "replies": [
                            {
                              "id": "mi9adsi",
                              "author": "MrBwnrrific",
                              "body": "This reads like a Robert Evans tweet",
                              "score": 22,
                              "created_utc": 1742218984.0,
                              "replies": [
                                {
                                  "id": "mi9lmvn",
                                  "author": "This_Guy_33",
                                  "body": "How many catalytic converters?",
                                  "score": 7,
                                  "created_utc": 1742222604.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mia4ftc",
                              "author": "GrimgrinCorpseBorn",
                              "body": "Based\n\nFuck Goodwill though",
                              "score": 12,
                              "created_utc": 1742228209.0,
                              "replies": []
                            },
                            {
                              "id": "mibi2qk",
                              "author": "tylerderped",
                              "body": "Holy shit a jumper cables reference!",
                              "score": 2,
                              "created_utc": 1742242415.0,
                              "replies": [
                                {
                                  "id": "mibtcjp",
                                  "author": "DigitalPages",
                                  "body": "Hahahahaha i wish I could tell that guy how often i think about jumper cables",
                                  "score": 1,
                                  "created_utc": 1742245652.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mi9ab5c",
                          "author": "Sexy_Underpants",
                          "body": "You inherit all the money they made when they still had the copyright. Is your argument that families should hold the copyright in perpetuity? That 5x great grandchildren should benefit and nothing is in the public domain?",
                          "score": 32,
                          "created_utc": 1742218958.0,
                          "replies": []
                        },
                        {
                          "id": "mi9bqib",
                          "author": "chronictherapist",
                          "body": "Real property is just that, real.\n\nIntellectual property is something that eventually just enters the zeitgeist or is largely forgotten. It's just impossible to protect it in perpetuity. Tolkien's winery would always be a piece of ground, with defined borders legally mandated by a deed. Regulated by a local government and its records. Plus, it's not being shared with the world willingly, Tolkien didn't announce, \"Here, everyone, share my winery. Talk about it, make parodies, porn, and memes of it.\" IP is like a dick pic ... once you send it out into the world, there is no taking it back or eliminating it entirely. \n\nAlso, no one is taxing IP like property either, are you suggesting we need to start taxing IP like a house or vehicle? I'd be all for that, tax Disney for the estimated value of Mickey Mouse. Tax Marvel for the estimated value of the MCU. Tax Intel, Qualcom, Microsoft, etc for the estimated value of all their collective IP. Every year, just like my house, and make sure it all goes to education.\n\nBut trust me, the second that happens, all those wealthy corporations that keep lobbying to extend Copyright longer and longer would suddenly reverse gears.",
                          "score": 21,
                          "created_utc": 1742219442.0,
                          "replies": [
                            {
                              "id": "miac2g4",
                              "author": "zebrastarz",
                              "body": "> all those wealthy corporations that keep lobbying to extend Copyright longer and longer would suddenly reverse gears\n\nI might make this my sole political goal from now on with how absolutely hilarious I find this premise",
                              "score": 7,
                              "created_utc": 1742230401.0,
                              "replies": []
                            },
                            {
                              "id": "mibktsa",
                              "author": "Spank86",
                              "body": "I think distilling it down Real Property is the kids can run the winery, intellectual property is ONLY the kids can run wineries. \n\nEveryone else can only make beer.",
                              "score": 1,
                              "created_utc": 1742243201.0,
                              "replies": []
                            },
                            {
                              "id": "mi9ijof",
                              "author": "alidan",
                              "body": "> Intellectual property is something that eventually just enters the zeitgeist or is largely forgotten\n\nit becomes part of culture, something that defines our collective lives far FAR more than anything else even if its hard to fully realize it.",
                              "score": -8,
                              "created_utc": 1742221642.0,
                              "replies": [
                                {
                                  "id": "mi9q059",
                                  "author": "chronictherapist",
                                  "body": "Yes, that's what \"enters the zeitgeist\" refers too.\n\nBut plenty of IP is just forgotten as well.",
                                  "score": 11,
                                  "created_utc": 1742223939.0,
                                  "replies": [
                                    {
                                      "id": "mi9zqkg",
                                      "author": "alidan",
                                      "body": "less forgotten but it ads something small and then the ip is forgotten but what it left remains.",
                                      "score": -4,
                                      "created_utc": 1742226842.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mi9ckjv",
                              "author": "GroinShotz",
                              "body": "Yea tax the shit out of em... The fuck do I care.  But I still think that the creator of something should be allowed to pass it down through their bloodline if they deemed it so before their death...",
                              "score": -10,
                              "created_utc": 1742219719.0,
                              "replies": [
                                {
                                  "id": "mi9t4to",
                                  "author": "jonosaurus",
                                  "body": "No one is saying otherwise; I think you're misunderstanding copyright law",
                                  "score": 2,
                                  "created_utc": 1742224880.0,
                                  "replies": []
                                },
                                {
                                  "id": "mi9jtlp",
                                  "author": "chronictherapist",
                                  "body": "They are ... but it's limited.",
                                  "score": 2,
                                  "created_utc": 1742222043.0,
                                  "replies": []
                                },
                                {
                                  "id": "miaykzr",
                                  "author": "sapphicsandwich",
                                  "body": "Ahh yes, the corporate bloodline. Let's be real, the vast majority of \"\"\"creators\"\"\" are actually paid servants and the \"real\" creator is some corporation. It's product, like a Big Mac. This is why AI image generators are so effective at damaging \"artistic\" job fields. They don't need to create \"art\" because most of what creatives do isn't for the sake of \"art\" either, nor is it that impressive, and so the image generator output is equally good and of equal value.",
                                  "score": 0,
                                  "created_utc": 1742236837.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mi9elus",
                          "author": "TooManyBeesInMyTeeth",
                          "body": "This is a very bad analogy. The Hobbit is a singular work of art, and a winery is business that produces goods. When you leave a winery to your kids, they have to continue the work you were doing, and keep the winery open, if they want to make a profit off of it. When you leave the ownership of a story like The Hobbit to your kids, they make a passive income off of the work you have already accomplished, and they reserve the right to tamper with the creative visions of any artists attempting to adapt or update your story in the future.\n\nIf we were talking about Tolkien leaving a Publishing Company to his Estate, instead of the Intellectual Property Rights to an already written book, then you might have a point.",
                          "score": 6,
                          "created_utc": 1742220390.0,
                          "replies": []
                        },
                        {
                          "id": "mi98r2f",
                          "author": "Edythir",
                          "body": "A winery has property. It has casks, it has vinyards, it has buildings. After you die, these buildings will still be there.\n\nA book is really just an idea, an idea you had. Sure, people have printed that idea, but you don't own the printers. If you harvest the same grapes, go through the same process, you will have the same wine. But you can't have the same thoughts, the same ideas and the same opinions as your grandfather, so you can't make the same book, so why should you control the book? There is nothing to own but an idea someone else had.",
                          "score": 23,
                          "created_utc": 1742218413.0,
                          "replies": [
                            {
                              "id": "mi9c8bd",
                              "author": "sawbladex",
                              "body": "you also put money into the winery to fix stuff, and that ship of Thesis process is enough to make it yours enough  to pass it on.",
                              "score": 9,
                              "created_utc": 1742219607.0,
                              "replies": []
                            },
                            {
                              "id": "mi9fxed",
                              "author": "nonowords",
                              "body": ">A book is really just an idea, an idea you had. Sure, people have printed that idea, but you don't own the printers\n\nyou're there and then you bring up printers for some reason. It's the idea that the writer owns. The idea is the casks, vinyards, buildings etc. The printer is the liquor distributor.",
                              "score": -6,
                              "created_utc": 1742220818.0,
                              "replies": [
                                {
                                  "id": "mi9rwf9",
                                  "author": "Frostypancake",
                                  "body": "No, casks, vineyards, and buildings are tangible assets. ‘I should start a grape fermentation company and call it a ‘vine yard’’ is an idea.",
                                  "score": 5,
                                  "created_utc": 1742224510.0,
                                  "replies": [
                                    {
                                      "id": "mibdee5",
                                      "author": "nonowords",
                                      "body": "Authors don't own the books, or the printers. They own the 'idea'\n\n\"I should make a vineyard and call it a vineyard' is not an idea in the same way that 100,000 words written in a unique and novel way is an idea. Pretending like those are more alike just because they don't have mass is ridiculous.\n\nYour whole analogy is confused and forced into the conclusion you want. A decendant absolutely can make the same book, that's what reprints are. They do it the same way a decendent can make the same wine. They just do what their grandparent did with the things their grandparent passed on to them, be it the vineard and the process (intellectual property). Or the 'book' and the intellectual property. And in both cases they might change and improve or degrade the product, or they might spend the effort (like what the Tolkien estate seems to attempt to do) to maintain the product's integrity.",
                                      "score": 1,
                                      "created_utc": 1742241077.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mi9c5yv",
                              "author": "GroinShotz",
                              "body": "Okay... So since the winemaking Tolkien is now dead.  For a certain amount of years.  And the kids have given up the current business... As in no longer are producing wine with the Tolkien label.\n\nI should be allowed to just take Tolkien's name and start my own winery?\n\nI mean his putting his name on wine was just the \"idea\".",
                              "score": -11,
                              "created_utc": 1742219585.0,
                              "replies": [
                                {
                                  "id": "mi9ffi5",
                                  "author": "BemaniAK",
                                  "body": "You're still missing the key part which is that the IP of The Hobbit is not a Winery, the advent of infinitely reproducible media and the desire to profit from it came with not just basic property rights that you have with a Winery, but also additional rights on top of that, these rights intentionally restrict the free flow of ideas and information for the purpose of commerce for the creator, so it has a time limit, that free flow of public domain information is more important than the right for great grandchildren to sue a father for putting a character on a gravestone.",
                                  "score": 8,
                                  "created_utc": 1742220657.0,
                                  "replies": [
                                    {
                                      "id": "mi9hqj8",
                                      "author": "alidan",
                                      "body": "that is a trademark issue, they are legally required to go after every single case of it or lose the trademark.\n\ntrademark is different from copyright. \n\ndisney gets hit with this alot because of their characters being trademarks themselves, so every time a school puts up a muryal of mickey mouse, and they find out, they get a cease and desist and then a 0 cost licensee to use it. \n\nI can't believe I am saying this about disney, but in this case the laws legal requirements make them look like bigger asshole than they are.",
                                      "score": 1,
                                      "created_utc": 1742221389.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mi9aoiy",
                          "author": "BossOfTheGame",
                          "body": "Physical property is one thing. Intellectual property is a misnomer. You should be able to profit from your ideas (i.e. intellectual work), but not indefinitely.",
                          "score": 3,
                          "created_utc": 1742219087.0,
                          "replies": [
                            {
                              "id": "mi9i9sy",
                              "author": "alidan",
                              "body": "im partially ok with life of creator + some years personally so they benefit and then their family benefits (I believe in leaving your family with what you have to make their lives better is a real thing), in the case of video games/corporates entities buying the rights away from the creator or its a mass effort under a corporation where its not one person, im ok with 14-25 years.",
                              "score": 2,
                              "created_utc": 1742221556.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mi9zo5v",
                          "author": "Downtown_Trash_8913",
                          "body": "A winery isn’t a creative work though, it’s a physical item. We’re specifically talking about intellectual property",
                          "score": 1,
                          "created_utc": 1742226823.0,
                          "replies": []
                        },
                        {
                          "id": "miadgap",
                          "author": "vyashole",
                          "body": "You should be allowed to inherit property. You should not be allowed to inherit intellectual proprietary. \n\nOwnership of intellectual property should be very limited (like patents), not virtually unlimited (like copyright). \n\nThe current copyright term of lifetime + 70 years or 95 years is just way too long for a society where information moves at the speed of light. The original term of 14+14 is more than enough for today's content creators. \n\nToo much monopoly on copyright stifles creativity and hinders innovation.",
                          "score": 1,
                          "created_utc": 1742230795.0,
                          "replies": []
                        },
                        {
                          "id": "mjpnn37",
                          "author": "TipAggressive7285",
                          "body": "Copyright, trademarks etc aren't actual property as such. They're a government-granted monopoly.",
                          "score": 1,
                          "created_utc": 1742932413.0,
                          "replies": []
                        },
                        {
                          "id": "mi99tew",
                          "author": "DrStrangererer",
                          "body": "Real property should be inherited and taxed over a certain value, say $1,000,000, to curtail nepotism. Intellectual property should be held for a certain amount of time before it becomes public domain, for the sake of art and humanity as a whole. It's not complicated and is a well established rule throughout much of the world. Maybe you just don't understand the difference between real property and intellectual property? It's okay, honey. I bet there's a lot of things you don't understand. That's what you have smart people like me for, though, to explain it to you.",
                          "score": -1,
                          "created_utc": 1742218786.0,
                          "replies": [
                            {
                              "id": "mi9dbxv",
                              "author": "None",
                              "body": "The reason why its this long is because 14 years and then the product enters public domain is damaging to the original person/company who made it.\n\nImagine you made a new superhero comic book aimed at children which is a stunning success. In 14 years that comic book enters public domain and now your competitors can use your characters which creates confusion since then there will be different books with different plots and stories that do not interact with each other. That's like if there are 12 different Supermans all having same background and premise but entirely different execution. \n\n\nIf you want creative competition. Encourage people to make Ultraman. Not make Superman go public domain near instantly. I am not a fan when companies gate keep old stuff but this is a case where I agree and think that intelligent property should not go public domain just because. Tolkien's books and winery are valid comparisons and therefore Tolkien's grandchildren are the ones who should own the rights to LoTR so there wouldn't be millions of LoTR the XXX sequel by Brazzers that is posed as \"the sequel to the great Tolkien's books\".",
                              "score": 0,
                              "created_utc": 1742219969.0,
                              "replies": [
                                {
                                  "id": "mi9f5jb",
                                  "author": "DrStrangererer",
                                  "body": "Lmao can you read?",
                                  "score": 1,
                                  "created_utc": 1742220567.0,
                                  "replies": [
                                    {
                                      "id": "mi9gu1k",
                                      "author": "None",
                                      "body": "I can read alright but you clearly don't.",
                                      "score": -1,
                                      "created_utc": 1742221106.0,
                                      "replies": [
                                        {
                                          "id": "mi9lgfx",
                                          "author": "DrStrangererer",
                                          "body": "I literally said intellectual property should be held for a certain amount of time. If 14 years is the standard, that's fine by me. I think it should maybe be longer, like maybe 25 years. Nothing I've said denies that. Your point is pointless. Indefinitely timed ownership of intellectual property stifles creativity, both by the owner and by new artists. Disney buying and leaning into established IPs has seriously hamstrung their ability to create new and innovative stories. It's cheaper easier and safer economically to pump out the same thing over and over. I'm tired of sequels to sequels of sequels. Give me Atlantis or Treasure Planet, not Star Wars Episode 69 or Avengers: Rehashed Basic Slop. Locking those IPs away from new artists indefinitely also drastically limits the pool of ideas they can draw from. They certainly weren't all good, but look at the incredible stories that came out of the Star Wars EU when George Lucas was in control and allowed for that? Imagine the incredible stories we could have now if Star Wars has gone public domain instead of being bought out by Disney. Theoretically, anybody could write whatever stories they wanted in the established universe, including wild crossovers, medieval Jedi, whatever they wanted. Then, Lucas and/or his estate could determine what is canon and not, what fits into the Main story, simply through the power of respect as the original artist. I feel this would encourage him to write new characters and stories. He would own the new stories/characters, and profit off them, without owning the old characters and stories. Or, better yet, create a new and original IP instead.",
                                          "score": 2,
                                          "created_utc": 1742222549.0,
                                          "replies": [
                                            {
                                              "id": "mia66h4",
                                              "author": "None",
                                              "body": "You just described why that would be a bad idea.\n\nStar Wars legends was creative sure but it was inconsistent as hell. In one novel Luke has children and in a second one he doesn't. Say what you want about new canon but one thing that Disney did right is keep canon consistent. \n\n\nAnd this leads to my main point. When something hits public domain, the franchise can be considered dead since then you'll have different branches of non canonical bs that will be very hard for anyone to follow.  \n\n\nI love Star Wars and Avengers. I'd rather have them hire better writers than make these stories public domain and sit through reddit to see what is worth reading and what isn't because I don't have the time to sit through and consume every single Avengers story where Ant Man goes inside Thanos' asshole and uses fork to kill him. If I want to read cheesy sequels, I'll open Wattpad. \n\n\n On the other hand. Gatekeeping characters from Star Wars/Avengers makes people create their own characters which can be inspired by the source material but often times it develops into its own thing (Invincible and The Boys). This is even better as people will literally be forced to make brand new IPs instead of relying on the public's love for Iron Man to sell \"Iron Man and Sonichu\".",
                                              "score": 1,
                                              "created_utc": 1742228711.0,
                                              "replies": [
                                                {
                                                  "id": "miado24",
                                                  "author": "DrStrangererer",
                                                  "body": "You're gonna create the next Star Wars and don't want any of the plebes to be able to steal any of your schmekels by copying your homework, right? Gotta pull the ladder up behind you when you make it to the top, right? Lick more corpo boot, honey. I like Schrodinger Skywalker. If you don't like it, don't read it. All Lucas had to do was say one is canon, one isn't. He didn't. Future artists should learn from that mistake and keep a tighter leash on the canon WITHOUT locking away a whole multiverse of potential stories.",
                                                  "score": 1,
                                                  "created_utc": 1742230856.0,
                                                  "replies": [
                                                    {
                                                      "id": "miahuij",
                                                      "author": "None",
                                                      "body": "You cannot advocate for creative new ideas and at the same time advocate for ideas to go public after short wait time so that these creative writing people could write such creative works of fiction using characters somebody else made. \n\nIf someone is truly creative. They will make Invincible without needing Superman to go public domain. This isn't sucking corporate boot. This is removing the boot out of your ass and looking at things logically.",
                                                      "score": 0,
                                                      "created_utc": 1742232067.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mi9bpc4",
                  "author": "TooManyBeesInMyTeeth",
                  "body": "Instead of a a set time frame for Computer Software to enter the Public Domain, we should just make it so software becomes public domain if the Owner stops putting the effort into keeping it functional.",
                  "score": 19,
                  "created_utc": 1742219431.0,
                  "replies": [
                    {
                      "id": "mi9g3op",
                      "author": "Medical_Solid",
                      "body": "Would have to go to trial to determine that, though. And then just before the court date, a *miraculous* software patch and bonus level bumps a 25-yo game into the present. Restart the clock, Ocarina of Time 2025 is available in the Nintendo eShop!",
                      "score": 15,
                      "created_utc": 1742220873.0,
                      "replies": [
                        {
                          "id": "mi9jzel",
                          "author": "TooManyBeesInMyTeeth",
                          "body": "That still solves my problem, which is that over 80% of video games have gone defunct and become completely unplayable, because Private Company see third-party preservation of their software as an act of theft.",
                          "score": 12,
                          "created_utc": 1742222093.0,
                          "replies": [
                            {
                              "id": "miahqxa",
                              "author": "JukePlz",
                              "body": "It creates a new problem tho, how many high quality projects would a company be able to juggle if they keep making new content? Ultimately this would incentive to just keep making remakes and ports over and over and over to manage their resources because every new game they push out is a legal maintenance burden in the long run.\n\nReverting copyright law to what it was originally meant to be before Micky Mouse put it's paws on it is the better approach.",
                              "score": 2,
                              "created_utc": 1742232037.0,
                              "replies": [
                                {
                                  "id": "miaojah",
                                  "author": "Leafy0",
                                  "body": "They’re already doing that it feels like. Both the video game and film industries have gotten so risk adverse that anything big budget that isn’t a remake or sequel is getting increasingly rare.",
                                  "score": 6,
                                  "created_utc": 1742233962.0,
                                  "replies": []
                                },
                                {
                                  "id": "miaqcxt",
                                  "author": "dakoellis",
                                  "body": "Are they actually going to spend money keeping up those games if they're not making money on them?",
                                  "score": 1,
                                  "created_utc": 1742234478.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mi9pc5k",
                          "author": "Namrepus221",
                          "body": "Ah yes. The Disney vault method of squeezing out every dime and refreshing copyrights.",
                          "score": 2,
                          "created_utc": 1742223735.0,
                          "replies": [
                            {
                              "id": "mi9s54p",
                              "author": "TooManyBeesInMyTeeth",
                              "body": "I would prefer constant cash-grabby re-releases to what we have in the Video Games Industry today.\n\nOver 80% of video games that have ever been made are completely defunct and unplayable, and it is legally considered theft if you try and fix them.",
                              "score": 6,
                              "created_utc": 1742224583.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mibd93w",
                          "author": "HanCurunyr",
                          "body": "It should be by SKU and plataform, a port or emulation of OoT for the Switch should not impact the status of OoT for the N64 as abandonware\n\nNintendo stopped making N64 consoles and carts? Its all abandonware\n\nDownloading the N64 rom to play on SoH or any emulator should not be piracy under this circunstances\n\nNintendo could keep selling the game on NSO and could still be screaming that download the switch NSP to run a emulator to be piracy",
                          "score": 1,
                          "created_utc": 1742241035.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mibfaje",
                  "author": "Maxwe4",
                  "body": "You can thank Sonny Bono and Disney for that shit.",
                  "score": 3,
                  "created_utc": 1742241618.0,
                  "replies": []
                },
                {
                  "id": "miigwut",
                  "author": "Turmoil_Engage",
                  "body": "We're all about \"artists should be paid for their work\" until it comes to Nintendo I see. Yes, Nintendo, where most of the people that made those SNES games still work to this day.\n\nI think the issue of copyright and retro games is a little more gray than people want it to be.",
                  "score": 2,
                  "created_utc": 1742334281.0,
                  "replies": []
                },
                {
                  "id": "mi90duq",
                  "author": "None",
                  "body": "As far as rights to a property, I think those should always remain with the artist. Basically, I never want to see some random ass person make \"official canon\" Lord of the Rings works. However, public access is different. Emulation for something that is no longer attainable is completely acceptable to me.",
                  "score": 3,
                  "created_utc": 1742215273.0,
                  "replies": [
                    {
                      "id": "mi933xo",
                      "author": "fla_john",
                      "body": "And no one will be able to make more \"official\" LOTR material, but people will be able to tell the stories in a different way. Think of Robin Hood or King Arthur -- even the Greek pantheon. In some ways, given Tolkien's love of legend and myth, I think he would appreciate his ideas joining those other stories.",
                      "score": 7,
                      "created_utc": 1742216340.0,
                      "replies": []
                    },
                    {
                      "id": "mi911rm",
                      "author": "bielgio",
                      "body": "That's leads to a fun proposition, if the property is valid for only the artist, killing the artist is very cheap compared to their IP value",
                      "score": 4,
                      "created_utc": 1742215538.0,
                      "replies": []
                    },
                    {
                      "id": "mi9diz9",
                      "author": "PhasmaFelis",
                      "body": "> As far as rights to a property, I think those should always remain with the artist. Basically, I never want to see some random ass person make \"official canon\" Lord of the Rings works.\n\n\nYou're talking about forbidding artists from selling their rights even if they want to. I don't think that's a good idea.",
                      "score": 1,
                      "created_utc": 1742220033.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "miagy0j",
                  "author": "Doppelkammertoaster",
                  "body": "And big corpo copyright holders only care about it when it's their stuff. Not all the things they feed into their AI.",
                  "score": 1,
                  "created_utc": 1742231799.0,
                  "replies": []
                },
                {
                  "id": "micriwf",
                  "author": "godwalking",
                  "body": "There was a law like this before, in canada i think. The basic reading of it was : if something isn't sold legaly in your country, but isn't illegal in itself, then you can acquire it ''illegaly''.\n\n  \nBasicely,  : you're not hurting sales if they aren't selling it to you. That whole loophole was shut down because of game of thrones specificaly. Episodes would air in the states like 2 hours before they did in canada, making that 2 hours window a 100% legal time to load the show.",
                  "score": 1,
                  "created_utc": 1742256546.0,
                  "replies": []
                },
                {
                  "id": "mie3m0b",
                  "author": "phillosopherp",
                  "body": "Be careful the mouse mafia might stab you in the night talking like that 😂",
                  "score": 1,
                  "created_utc": 1742275398.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mibtjfq",
              "author": "sulaymanf",
              "body": "Copyrighted material becomes public domain after a few decades. That’s too late for video games. They should overhaul copyright law and allow this.",
              "score": 4,
              "created_utc": 1742245710.0,
              "replies": []
            },
            {
              "id": "mi99ylj",
              "author": "Bigred2989-",
              "body": "\"Its my IP to sit on and do nothing with!\"",
              "score": 3,
              "created_utc": 1742218837.0,
              "replies": [
                {
                  "id": "mia4fgp",
                  "author": "SsooooOriginal",
                  "body": "The Sony angle. And many more, but they have the corner on music.",
                  "score": 1,
                  "created_utc": 1742228206.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mic4dtf",
              "author": "BriefCollar4",
              "body": "![gif](giphy|gvgao1wRa4eFXSEdzO)",
              "score": 1,
              "created_utc": 1742249006.0,
              "replies": []
            },
            {
              "id": "mifd9pu",
              "author": "bullcitytarheel",
              "body": "Throwing dirt on someone’s grave is a type of thought",
              "score": 1,
              "created_utc": 1742301425.0,
              "replies": []
            },
            {
              "id": "mikfiz4",
              "author": "SympathyMotor4765",
              "body": "Didn't AI companies just claim if anything is on the internet then it's free? \n\n\nDon't quote me I remember reading something like this though!",
              "score": 1,
              "created_utc": 1742359090.0,
              "replies": []
            },
            {
              "id": "mivl8t8",
              "author": "miklayn",
              "body": "The concept of Intellectual Property itself is invalid and needs to be rejected.",
              "score": 1,
              "created_utc": 1742509968.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mia6p6c",
          "author": "lolno",
          "body": "And we rely on incredibly smart people who do it for the love of the game \n\nRIP Near",
          "score": 9,
          "created_utc": 1742228859.0,
          "replies": [
            {
              "id": "miad1c6",
              "author": "Swallagoon",
              "body": "Well said, RIP Near",
              "score": 2,
              "created_utc": 1742230677.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mia6sas",
          "author": "Ancient_Tea_6990",
          "body": "But it’s harder to lock down and we can’t make as much money",
          "score": 2,
          "created_utc": 1742228883.0,
          "replies": []
        },
        {
          "id": "miasayp",
          "author": "tokyogodfather2",
          "body": "ok i’m a big of a geek and techno lover as the rest of them, but can some one ELI5 why this is news? Or better yet, why I should care?",
          "score": 2,
          "created_utc": 1742235038.0,
          "replies": [
            {
              "id": "miaz10k",
              "author": "Swallagoon",
              "body": "It's barely news. SNES consoles are over 30 years old now so their internal components are gradually moving out of spec as they age. It's the same story for basically any other console or system. Things get old and they break. Your SNES audio chip might run 1% faster on a warm day, but it will still probably work... for now.\n\nWhich is why emulation is important because it preserves the experiences for all generations going forward. Eventually these things we hold so dear will be extremely precious antiques.",
              "score": 6,
              "created_utc": 1742236965.0,
              "replies": [
                {
                  "id": "migbhuj",
                  "author": "No-Problem49",
                  "body": "This has been known about for years because someone way long ago found out you can speed run games quicker by heating up snes chips with a heat gun lol",
                  "score": 3,
                  "created_utc": 1742312394.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mib3x63",
          "author": "Another_Road",
          "body": "Emulation usually isn’t the problem. Downloading ROMs is where the issue often arises.",
          "score": -5,
          "created_utc": 1742238362.0,
          "replies": [
            {
              "id": "mib4yaq",
              "author": "Swallagoon",
              "body": "That is true, but there are certain corporations *cough*NINTENDO*cough* who have publicly stated their stance of emulation being a bad thing. Not just downloading ROMs, but actual emulation itself. \n\nBasically they are scumbags. Their policy on emulators is quite humorous and almost entirely incorrect. This is coming from Nintendo who have historically used third party emulators in their products and have also directly benefited from the years and years of reverse engineering and emulation development by the community.\n\nYou’d have no Virtual Console or Nintendo Switch Online without the decades of hobbyist community driven work, as much as they would hate to admit it.",
              "score": 13,
              "created_utc": 1742238654.0,
              "replies": [
                {
                  "id": "mibhgp3",
                  "author": "maazen",
                  "body": "i have worked on nintendo games in the DS era and their IDE came with a first party emulator.",
                  "score": 3,
                  "created_utc": 1742242241.0,
                  "replies": [
                    {
                      "id": "mibj29x",
                      "author": "Swallagoon",
                      "body": "Yes, a first party emulator. There are many such cases, like Sony writing an in-house PS1 emulator for the PSP.\n\nHowever, the current state of both “official” and “unofficial” emulation in 2025 would not be where it is without three+ decades of collective knowledge from different people and teams developing emulators. Everyone learns from each other.",
                      "score": 8,
                      "created_utc": 1742242698.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mi8xj64",
      "author": "NachoNachoDan",
      "body": "Any kid who spent a rainy Saturday playing Nintendo  now knows why the audio would start to get all “happy” after intense play.",
      "score": 253,
      "created_utc": 1742214104.0,
      "replies": [
        {
          "id": "mi8xptv",
          "author": "Xenc",
          "body": "I thought that was just our brains melting from all of the fun",
          "score": 105,
          "created_utc": 1742214182.0,
          "replies": [
            {
              "id": "mi91ujy",
              "author": "NachoNachoDan",
              "body": "Could be both.",
              "score": 32,
              "created_utc": 1742215854.0,
              "replies": [
                {
                  "id": "mibolyr",
                  "author": "Xenc",
                  "body": "Take that Sega Genesis!",
                  "score": 5,
                  "created_utc": 1742244283.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mi9mhrw",
      "author": "pinkynarftroz",
      "body": "The article says things become non deterministic even on the same hardware.\n\nI recall a Link to the Past Speedrun was  rejected because RNG was “impossible” with fire patterns in the boss not matching what they should be.\n\nWould this discovery not make all such analysis void, if even runs on the same console are non deterministic?",
      "score": 97,
      "created_utc": 1742222868.0,
      "replies": [
        {
          "id": "mia4idb",
          "author": "FlyingBishop",
          "body": "It could be nondeterministic but also the range of reasonable behaviors could be bounded.",
          "score": 45,
          "created_utc": 1742228230.0,
          "replies": [
            {
              "id": "mic3mhl",
              "author": "None",
              "body": "[deleted]",
              "score": 8,
              "created_utc": 1742248768.0,
              "replies": [
                {
                  "id": "mig1g01",
                  "author": "Lifeinstaler",
                  "body": "I think they meant that while non deterministic, some patterns would still be impossible or some would be expected and their presence/absence would evidence a cheat.",
                  "score": 4,
                  "created_utc": 1742309438.0,
                  "replies": [
                    {
                      "id": "migrojv",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 2,
                      "created_utc": 1742317036.0,
                      "replies": [
                        {
                          "id": "migsu29",
                          "author": "Lifeinstaler",
                          "body": "Yeah that makes sense that it’s about something very rare happening.\n\nI still think we’d be talking about evidence of cheating tho. Like that Minecraft speedrun that had altered drop rates for some trade stuff. It was technically possible but astronomically low chance to happen.",
                          "score": 2,
                          "created_utc": 1742317362.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mico8yq",
          "author": "Balmong7",
          "body": "I believe this specific bug only affects the sound chip.",
          "score": 6,
          "created_utc": 1742255451.0,
          "replies": []
        },
        {
          "id": "mifivbo",
          "author": "error521",
          "body": "Imagine if speedrunners start saying speedruns don't count unless they're played in an emulator lol",
          "score": 3,
          "created_utc": 1742303513.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mi9983z",
      "author": "ahzzyborn",
      "body": "Still the best console of all time. Such an amazing library of games",
      "score": 52,
      "created_utc": 1742218579.0,
      "replies": [
        {
          "id": "miaxn89",
          "author": "blacksoxing",
          "body": "I'm just in here to tell a personal story about the SNES. I went to an uncle's home who lived a bit away who had a SNES in a guest room. We played it, loved it, and I had the courage to ask him for it. He gave me the \"we'll see\". \n\nI'd go to my grandpa's house and pester him to ask my Uncle Charles for it and he'd too go \"we'll see\". A year went past and I all but gave up hope but still asked during the Fall as shit, he gotta be swinging through one day to drop this thing off!!!!\n\n.....AND HE DID! Got it like a week before Christmas. I missed him personally but I got the console in a paper bag. I just felt this well of emotion. I finally had it. Had it w/the Mario game I was hammering that day, too! I went home feeling like a king.\n\n.....And to add a fun twist to this story, I then got a PS1 that just came out for Christmas as well. My grandma didn't anticipate my Uncle Charles actually doing it and bought the PS1 off QVC on launch day. So now we had TWO consoles and that rental store was booming for a while :)\n\nIt is for this reason when my cousin asked me for my DS a decade ago I went \"we'll see\" and gave it to him for his birthday a few months later. I couldn't hold back my excitement",
          "score": 18,
          "created_utc": 1742236567.0,
          "replies": [
            {
              "id": "miczn6r",
              "author": "Unlucky_Sherbert_468",
              "body": "20 years from now your cousin's nephew will ask if he can have temporary digital rights to a cloud console and your cousin will reply, \"we'll see\".",
              "score": 10,
              "created_utc": 1742259277.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mi9c4pu",
      "author": "mlvisby",
      "body": "Unreliable? The SNES was released in 1990 in Japan, 1991 in the US. That's far from unreliable since this problem is recent. Old tech won't last forever, no matter how reliable the parts are. It's lived well past it's expected lifetime.",
      "score": 108,
      "created_utc": 1742219573.0,
      "replies": [
        {
          "id": "mi9evaw",
          "author": "SnowingSilently",
          "body": "It seems like it might have been an issue from the very beginning:\n>The TASBot team was not the first group to notice this kind of audio inconsistency in the SNES. In the early 2000s, some emulator developers found that certain late-era SNES games don't run correctly when the emulator's Digital Signal Processor (DSP) sample rate is set to the Nintendo-specified value of precisely 32,000 Hz (a number derived from the speed of the APU clock). Developers tested actual hardware at the time and found that the DSP was actually running at 32,040 Hz and that setting the emulated DSP to run at that specific rate suddenly fixed the misbehaving commercial games.\n\nDevelopers intentionally wrote their code expecting a higher clock speed than the spec. While it doesn't confirm it outright, there's a good chance it was due to the heating issue.",
          "score": 91,
          "created_utc": 1742220476.0,
          "replies": []
        },
        {
          "id": "mi9eub1",
          "author": "Dazed4Dayzs",
          "body": "> unreliable ceramic APU resonators lead to “constant, pervasive, unavoidable” issues.\n\nRead the article (or even the title) before commenting. They didn’t call the SNES unreliable.",
          "score": 33,
          "created_utc": 1742220467.0,
          "replies": [
            {
              "id": "miabko6",
              "author": "silentcrs",
              "body": "You’re calling out an unnecessary nuance. The APU is part in the SNES. Saying the APU resonators are unreliable means the SNES itself, by extension, is unreliable. It’s a small amount of unreliability overall, but it’s there.",
              "score": 1,
              "created_utc": 1742230259.0,
              "replies": [
                {
                  "id": "miac2ku",
                  "author": "Dazed4Dayzs",
                  "body": "You also clearly didn’t read the article. The issue was primarily related to audio delay. The SNES still runs reliably. They didn’t call the console unreliable.",
                  "score": 10,
                  "created_utc": 1742230402.0,
                  "replies": [
                    {
                      "id": "miacs6k",
                      "author": "silentcrs",
                      "body": "I did read the article. It said developers at the time specifically had to change code to address the shortcoming. That’s an “unreliable” system to write software for.\n\nAnd note: SNES wasn’t alone in that regard. The Genesis had 3 models, each with slightly different hardware (particularly audio). Developers had to work around that set of unreliabilities too.",
                      "score": 6,
                      "created_utc": 1742230605.0,
                      "replies": [
                        {
                          "id": "miadxn2",
                          "author": "Dazed4Dayzs",
                          "body": "No they didn’t. Quote the full paragraph. The devs didn’t call the SNES unreliable, only you are.",
                          "score": -6,
                          "created_utc": 1742230932.0,
                          "replies": [
                            {
                              "id": "miaiw5d",
                              "author": "Irapotato",
                              "body": "Bro he said the developers had to code their software around a known issue with the SNES sample rates, you’re getting way too hung up on who called what what.",
                              "score": 5,
                              "created_utc": 1742232365.0,
                              "replies": [
                                {
                                  "id": "mid4qa3",
                                  "author": "coltrain423",
                                  "body": "You mean they relied on the higher clock speed instead of the spec?\n\nWords mean things, and the developers relied on the higher clock speed. That’s not what unreliable means.",
                                  "score": 1,
                                  "created_utc": 1742261055.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mib866w",
                              "author": "silentcrs",
                              "body": ">That small but necessary emulator tweak implies that “the original developers who wrote those games were using hardware that... must have been running slightly faster at that point,” Cecil told Ars. “Because if they had written directly to what the spec said, it may not have worked.”\n\nIn other words, the developers knew it was a problem and had to ignore Nintendo’s own documentation. That’s the very definition of an unreliable system.\n\nLook, do you code for video games? At all? You would know that when a platform is presented to you with specs sheets saying one thing, and it ends up as another, it’s an unreliable platform. Say this happened on iOS or Android, for example. Apple or Google would change their documentation. Nintendo did not appear to do this (from their history, that’s not uncommon - there were bugs in the N64 documentation they left in).",
                              "score": 1,
                              "created_utc": 1742239575.0,
                              "replies": [
                                {
                                  "id": "mib9cgg",
                                  "author": "Dazed4Dayzs",
                                  "body": "You’re trying so hard to put words in their mouth. They didn’t say unreliable. It’s not in your quote either. You’re trying so hard to bend the definition of unreliable. The games worked at release. The console worked too. The games still work as do the consoles. Nobody called the console unreliable. Just you in the comments here. You are wrong, just stop, it’s sad.",
                                  "score": -6,
                                  "created_utc": 1742239915.0,
                                  "replies": [
                                    {
                                      "id": "mibk1db",
                                      "author": "repete2024",
                                      "body": "The article literally calls the APU clock unreliable, and says the games run differently now than they did at release. \n\nPlease read up on what \"non-deterministic performance\" means",
                                      "score": 4,
                                      "created_utc": 1742242975.0,
                                      "replies": [
                                        {
                                          "id": "micbu2y",
                                          "author": "Dazed4Dayzs",
                                          "body": "A few games run differently in that the audio is sometimes delayed by a fraction of a second. The article clearly states that this is not something that a normal player would even notice. The games run and so do the console. Nobody in the article called either unreliable.",
                                          "score": 0,
                                          "created_utc": 1742251391.0,
                                          "replies": [
                                            {
                                              "id": "micds6f",
                                              "author": "repete2024",
                                              "body": "\"Non-deterministic performance\" is unreliable, whether or not a typical player notices it. \n\nThe article calls the hardware unreliable. Try \"CTRL+F\"",
                                              "score": 1,
                                              "created_utc": 1742252025.0,
                                              "replies": [
                                                {
                                                  "id": "michjyb",
                                                  "author": "Dazed4Dayzs",
                                                  "body": "The article says the APU is unreliable. Which I quoted originally and the same quote is in the title. The article does not call the console itself nor the games unreliable. The devs didn’t call the console unreliable either. Does the console turn on? Yes. Does it play games without issue? Yes. There is no reliability issues with the console itself.",
                                                  "score": 1,
                                                  "created_utc": 1742253250.0,
                                                  "replies": [
                                                    {
                                                      "id": "miciut7",
                                                      "author": "repete2024",
                                                      "body": "The article says the non-deterministic performance is coming from more than just the APU\n\nNon-deterministic performance is unreliable. Doesn't matter if the effects are big or small",
                                                      "score": 1,
                                                      "created_utc": 1742253673.0,
                                                      "replies": [
                                                        {
                                                          "id": "micj6bh",
                                                          "author": "Dazed4Dayzs",
                                                          "body": "If the console runs and the game runs, then it’s reliable. They didn’t call the console unreliable. You’re just coping.",
                                                          "score": 0,
                                                          "created_utc": 1742253778.0,
                                                          "replies": [
                                                            {
                                                              "id": "micko3n",
                                                              "author": "repete2024",
                                                              "body": "It has to run the games correctly and consistently and you've already admitted it doesn't",
                                                              "score": 0,
                                                              "created_utc": 1742254263.0,
                                                              "replies": [
                                                                {
                                                                  "id": "micler9",
                                                                  "author": "Dazed4Dayzs",
                                                                  "body": "It runs the games without any issues that would prevent it from being played. A non-detectable millisecond audio delay on some of the music tracks does not affect the gameplay or usability of the game nor console. Not a single gamer would care. It’s only an ‘issue’ in regard to a third-party software a different group of people are trying to build decades later. And issue really just means something they had to take into account when coding. That’s it. You jumped up on this high-horse but didn’t actually understand a word of the article.",
                                                                  "score": 1,
                                                                  "created_utc": 1742254509.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "micmfzy",
                                                                      "author": "repete2024",
                                                                      "body": "It doesn't matter if the issues prevent the game from being played or not. The existence of issues means the hardware is unreliable. \n\nThe article also explains there's more issues than just the audio delay. I challenge you to explain them in your next response.",
                                                                      "score": 0,
                                                                      "created_utc": 1742254851.0,
                                                                      "replies": [
                                                                        {
                                                                          "id": "micn6vv",
                                                                          "author": "Dazed4Dayzs",
                                                                          "body": "If the game and consoles play fine, there are no issues, it’s reliable. They didn’t call the console unreliable, just the commenters here did. Keep shadow boxing those demons.",
                                                                          "score": 1,
                                                                          "created_utc": 1742255100.0,
                                                                          "replies": [
                                                                            {
                                                                              "id": "micnc63",
                                                                              "author": "repete2024",
                                                                              "body": "You didn't understand the article and now you're retreating",
                                                                              "score": 0,
                                                                              "created_utc": 1742255149.0,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "micnicw",
                                                                                  "author": "Dazed4Dayzs",
                                                                                  "body": "No you didn’t understand and you didn’t find/post the quote because it’s not there. I have been repeating the same stance this entire time. You’re wrong.",
                                                                                  "score": 1,
                                                                                  "created_utc": 1742255206.0,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "mico77j",
                                                                                      "author": "repete2024",
                                                                                      "body": "I've posted \"non deterministic performance\" several times. \n\nYou just don't understand what it means. \n\nThat's why I asked you to explain the other issues the article mentions and you couldn't. \n\nYou'll ignore my challenge in your next response too.",
                                                                                      "score": 0,
                                                                                      "created_utc": 1742255434.0,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "micpdng",
                                                                                          "author": "Dazed4Dayzs",
                                                                                          "body": "You’re just trying to move the goalpost and you’re throwing a hissy fit that I won’t engage.\n\nThis is the comment I replied to:  \n> Unreliable? The SNES was released in 1990 in Japan, 1991 in the US. That’s far from unreliable since this problem is recent. Old tech won’t last forever, no matter how reliable the parts are. It’s lived well past it’s expected lifetime.\n\nI said:  \n> They didn’t call the SNES unreliable.\n\nUnless you can quote in the article where they directly called the SNES console ‘unreliable’ as a gaming console (not for third-party software, for using the console as it was made) then you are wrong. It’s really that simple.",
                                                                                          "score": 1,
                                                                                          "created_utc": 1742255831.0,
                                                                                          "replies": [
                                                                                            {
                                                                                              "id": "micq4oc",
                                                                                              "author": "repete2024",
                                                                                              "body": "I didn't move the goal post. I've been quoting \"non deterministic performance\" the entire time. \n\nYou won't engage because you can't. You don't understand the topic. \n\nThey said the SNES has non deterministic performance, and it's caused by multiple components. That means it's unreliable. \n\nSaying \"as a gaming console\" or \"using it as it was made\" is you moving the goalposts. That's not what the article is about.",
                                                                                              "score": 0,
                                                                                              "created_utc": 1742256081.0,
                                                                                              "replies": [
                                                                                                {
                                                                                                  "id": "micrn9c",
                                                                                                  "author": "Dazed4Dayzs",
                                                                                                  "body": "You did move the goal post. Nowhere in the comment I replied to nor the comment I wrote was that mentioned. The commenter I was replying to was talking about the console reliability from a consumer perspective, as was I. Nowhere in the article did either dev team use the word unreliable in reference to the console nor games actually reliably working. I’m not going to re-explain to you for a third time.",
                                                                                                  "score": 1,
                                                                                                  "created_utc": 1742256586.0,
                                                                                                  "replies": [
                                                                                                    {
                                                                                                      "id": "mict0t2",
                                                                                                      "author": "repete2024",
                                                                                                      "body": "You said the article didn't say the SNES was unreliable. \n\nYou're wrong, because the article says the SNES has \"non deterministic performance\" caused by multiple components \n\nThat means it's unreliable. You just didn't understand the article and now you're embarrassed",
                                                                                                      "score": 0,
                                                                                                      "created_utc": 1742257047.0,
                                                                                                      "replies": [
                                                                                                        {
                                                                                                          "id": "micxh9i",
                                                                                                          "author": "Dazed4Dayzs",
                                                                                                          "body": "I said the my didn’t use the specific word unreliable. And they didn’t call it unreliable as a gaming console. I already explained what they were calling unreliable back here: https://www.reddit.com/r/gadgets/s/F6u9u72L95 . Just refer to my previous comments, I’m not going to go in loops with you just because you’re stubborn and/or incapable of understanding.",
                                                                                                          "score": 1,
                                                                                                          "created_utc": 1742258541.0,
                                                                                                          "replies": [
                                                                                                            {
                                                                                                              "id": "midb1vu",
                                                                                                              "author": "repete2024",
                                                                                                              "body": "The specific word unreliable is in the article, and the piece describes several ways the console is unreliable. \n\nThe comment you linked to only mentions one of the several ways. \n\nYou only partially explained what they were calling unreliable, because you only partially understood the article.",
                                                                                                              "score": 0,
                                                                                                              "created_utc": 1742263275.0,
                                                                                                              "replies": [
                                                                                                                {
                                                                                                                  "id": "midmc4y",
                                                                                                                  "author": "Dazed4Dayzs",
                                                                                                                  "body": "It’s not used in the way the commenter thought it was used. They didn’t say the console is unreliable as a console for use as a console. That is what i corrected. If you can’t understand that, there’s no helping you.",
                                                                                                                  "score": 1,
                                                                                                                  "created_utc": 1742267423.0,
                                                                                                                  "replies": [
                                                                                                                    {
                                                                                                                      "id": "midn9g4",
                                                                                                                      "author": "repete2024",
                                                                                                                      "body": "You didn't correct anything because what you said was even more wrong",
                                                                                                                      "score": 0,
                                                                                                                      "created_utc": 1742267793.0,
                                                                                                                      "replies": [
                                                                                                                        {
                                                                                                                          "id": "midnfm2",
                                                                                                                          "author": "Dazed4Dayzs",
                                                                                                                          "body": "Sure bud, go bother someone else with your buffoonery.",
                                                                                                                          "score": 1,
                                                                                                                          "created_utc": 1742267862.0,
                                                                                                                          "replies": [
                                                                                                                            {
                                                                                                                              "id": "mig61n2",
                                                                                                                              "author": "repete2024",
                                                                                                                              "body": "Or I can keep pointing out that you were wrong until you admit it. \n\nThe article explicitly calls the SNES unreliable, and explains multiple ways that's the case.\n\nYou know I'm right because ou keep trying to run away every time I bring up evidence that you're wrong.\n\nEdit: LOL",
                                                                                                                              "score": 0,
                                                                                                                              "created_utc": 1742310800.0,
                                                                                                                              "replies": [
                                                                                                                                {
                                                                                                                                  "id": "mig993s",
                                                                                                                                  "author": "Dazed4Dayzs",
                                                                                                                                  "body": "You’re not right because moving the goalpost to make you right means you’re wrong. Nice try, thanks for playing. Go bother someone else with you inability to read and comprehend.",
                                                                                                                                  "score": 1,
                                                                                                                                  "created_utc": 1742311736.0,
                                                                                                                                  "replies": []
                                                                                                                                }
                                                                                                                              ]
                                                                                                                            }
                                                                                                                          ]
                                                                                                                        }
                                                                                                                      ]
                                                                                                                    }
                                                                                                                  ]
                                                                                                                }
                                                                                                              ]
                                                                                                            }
                                                                                                          ]
                                                                                                        }
                                                                                                      ]
                                                                                                    }
                                                                                                  ]
                                                                                                }
                                                                                              ]
                                                                                            }
                                                                                          ]
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mibfdit",
              "author": "midsummernightstoker",
              "body": "They called the SNES unreliable.  They said it has an unreliable piece of hardware that causes performance issues and it affects things like speedruns. \n\nIn computing, getting different output from the same input is the definition of unreliable hardware. \n\nLike, imagine, if we said \"Nobody said the plane is unreliable. We just said it has unreliable landing gear.\" That's how silly what you're saying is.",
              "score": -1,
              "created_utc": 1742241642.0,
              "replies": [
                {
                  "id": "micc2ht",
                  "author": "Dazed4Dayzs",
                  "body": "They didn’t call the SNES unreliable. The console runs reliably. Directly quote it or be a clown somewhere else.",
                  "score": 0,
                  "created_utc": 1742251469.0,
                  "replies": [
                    {
                      "id": "micfdb0",
                      "author": "midsummernightstoker",
                      "body": "> Cheap, **unreliable** ceramic APU resonators lead to \"constant, pervasive, unavoidable\" issues.\n\nIt's right there below the headline.\n\nThe rest of the article describes the way in which the hardware runs unreliably. e.g. \n\n* \"degraded substantially enough to cause problems with repeatability\"\n* lag frames, in turn, are enough to \"desynchronize\" TASBot's input on actual hardware\n* the cheaper ceramic resonators in the SNES APU are \"known to degrade over time,\"\n*  excess heat may impact the clock cycle speed\n* On one console this might take 0.126 frames to process the music-tick, on a different console it might take 0.127 frames. It might not seem like much but it is enough to potentially delay the start of song loading by 1 frame\n* when Cecil replaced the ceramic APU resonator in his Super NES with a more accurate quartz version (tuned precisely to match Nintendo's written specification), the team \"did not see perfect behavior like we expected,\"\n* Beyond clock speed inconsistencies, Cecil explained to Ars that TASBot team testing has found an additional \"jitter pattern\" present in the APU sampling that \"injects some variance in how long it takes to perform various actions\" between runs.\n* non-deterministic performance even on the same hardware\n* \"TASBot is likely to desync\" after just a few minutes of play on most SNES games.\n* \"very non-deterministic reset circuit\" that changes the specific startup order and timing for a console's individual components every time it's powered on\n* impossible to predict specifically where and when lag frames will appear\n\n\nEither you didn't read the article or you didn't understand it.",
                      "score": -4,
                      "created_utc": 1742252539.0,
                      "replies": [
                        {
                          "id": "micg6ud",
                          "author": "Dazed4Dayzs",
                          "body": "TASbot is not the SNES. It’s a software that tries to make frame-perfect runs on videogames. They had issues they had to overcome with perfecting their software to work with the SNES. The SNES console itself and the games ran fine. This is what you’re not understanding. Re-read the comment I responded to.\n\n> Unreliable? The SNES was released in 1990 in Japan, 1991 in the US. That’s far from unreliable since this problem is recent. Old tech won’t last forever, no matter how reliable the parts are. It’s lived well past it’s expected lifetime.\n\nThis commenter claimed they called the SNES console unreliable because they didn’t read the article. They didn’t call the SNES console unreliable.",
                          "score": 2,
                          "created_utc": 1742252806.0,
                          "replies": [
                            {
                              "id": "migt7xa",
                              "author": "midsummernightstoker",
                              "body": "You're right, the TASbot is not the SNES, and it goes out of sync *because it doesn't have the unreliable hardware of the SNES*. The article explains all of this.\n\nThe commenter must have read at least part of the article, because it directly calls the SNES unreliable and then explains how it is unreliable. \n\nDo you want to try again, or admit you are wrong?",
                              "score": 0,
                              "created_utc": 1742317472.0,
                              "replies": [
                                {
                                  "id": "minmrsc",
                                  "author": "Dazed4Dayzs",
                                  "body": "Because of the frequency changes of the APU, which I have said from the beginning. The consoles and games themselves work just fine. The SNES is a reliable console. The TASbot third-party external software developed decades later has nothing to do with the SNES. Nobody called the SNES console unreliable. What was unreliable was their original method of implementing the TASbot software.",
                                  "score": 1,
                                  "created_utc": 1742406789.0,
                                  "replies": [
                                    {
                                      "id": "minzff2",
                                      "author": "midsummernightstoker",
                                      "body": "The article lists several components that are unreliable, not just the APU. The article calls the SNES unreliable, and goes on to explain how the SNES is unreliable. \n\nTASBot has a lot to do with the SNES. It is software that interacts with the SNES and is affected its unreliability. the The article explains all of this. \n\nNothing in the article says the SNES is a reliable console. Provide a quote for that or admit you are wrong.",
                                      "score": 0,
                                      "created_utc": 1742410448.0,
                                      "replies": [
                                        {
                                          "id": "mio0y8d",
                                          "author": "Dazed4Dayzs",
                                          "body": "Which components besides the APU? Quote it. Neither the original devs nor the TASBot call the console unreliable. The TASBot has nothing to do with the SNES. It’s already been explained to you multiple times that it’s a third-party software created decades later. Any issues or obstacles they have is their issue, not the console’s. The console and its games run reliably. You can try as hard as you’d like to bend words, you’re wrong. I could purchase an old SNES off of Craigslist or eBay today and play it just fine.",
                                          "score": 1,
                                          "created_utc": 1742410884.0,
                                          "replies": [
                                            {
                                              "id": "mioc2zb",
                                              "author": "midsummernightstoker",
                                              "body": "I already provided the quotes\n\n* \"very non-deterministic reset circuit\" that changes the specific startup order and timing for a console's individual components every time it's powered on\n\nThis makes it\n\n* impossible to predict specifically where and when lag frames will appear\n\nIf you play an SNES, you will experience random lag frames. Therefore, it's unreliable.",
                                              "score": 0,
                                              "created_utc": 1742414302.0,
                                              "replies": [
                                                {
                                                  "id": "miom6qa",
                                                  "author": "Dazed4Dayzs",
                                                  "body": "That quote again is about their TASBot software. The ‘non-deterministic performance‘ injects some variance in how long it takes to perform various actions between runs. All this means is that the “TASBot is likely to desync” after just a few minutes of play on most SNES games.\n\n> Casual players would only notice this problem in the form of an almost imperceptibly higher pitch for in-game music and sounds.\n\n> That difference is small enough that human players probably wouldn’t notice it directly;\n\nIf you play SNES, you will not experience any noticeable problems affecting the playability of the console nor games. The console is a reliable console.",
                                                  "score": 1,
                                                  "created_utc": 1742417208.0,
                                                  "replies": [
                                                    {
                                                      "id": "mioqwz3",
                                                      "author": "midsummernightstoker",
                                                      "body": "You're wrong again. That quote is about the SNES because it mentions a \"reset circuit\" which is hardware. \n\nHere's the full quote (that you either did not read or did not understand) \n\n> these inconsistencies across **same-console runs** are likely caused by a \"very non-deterministic reset circuit\" that changes the specific startup order and timing **for a console's individual components** every time it's powered on\n\nIt doesn't matter if you notice the problems or not. The existence of problems means the system is unreliable.",
                                                      "score": 0,
                                                      "created_utc": 1742418592.0,
                                                      "replies": [
                                                        {
                                                          "id": "miotdax",
                                                          "author": "Dazed4Dayzs",
                                                          "body": "Yes the circuit for resetting the APU is hardware. What you didn’t understand is that the issue it was causing was an issue related to the TASBot software development, as per all of my direct quotes from the article in my last comment. Not an issue for users of the console. Undetectable ‘problems’ that don’t affect usability are not a problem. If it is not detectable by the user and doesn’t prevent the usability of the device, it’s not unreliable. An unreliable console would be one that doesn’t startup consistently. Or one that resets/powers-off randomly. That’s not the SNES and nobody in the article made that argument. \n\nYou can purposely misinterpret and bend the meaning of reliable/unreliable all you want. You can lie and say they *directly said it was an unreliable console** then paste quotes where they didn’t say ‘unreliable’ and then argue that their words are ‘interpreted’ as unreliable, all you want. You can misrepresent the context of quotes all you want. It’s not going to magically make you right. Stop bothering me with your nonsense.",
                                                          "score": 1,
                                                          "created_utc": 1742419337.0,
                                                          "replies": [
                                                            {
                                                              "id": "mip5wv5",
                                                              "author": "midsummernightstoker",
                                                              "body": "For something to be reliable, it has to behave in a predictable and consistent manner every time. You cannot honestly say random lag frames or clock variance are reliable behavior. \n\nThe article calls the SNES unreliable twice, explains how it is unreliable, and gives specific examples. \n\nIt's really simple stuff. I'm sorry this is so hard for you.",
                                                              "score": 0,
                                                              "created_utc": 1742423212.0,
                                                              "replies": [
                                                                {
                                                                  "id": "mip8w8u",
                                                                  "author": "Dazed4Dayzs",
                                                                  "body": "The unreliablity quotes were in reference to difficulties they had to overcome in coding the TASBot software, which is third-party/unrelated to the console. It said for normal users of the console that the ‘issues’ were completely un-noticeable/non-impacting. The consoles don’t have issues. They power on reliably. They boot the games reliably. The games work reliably. You’re just straight up lying. I’ve told you all of this twice and provided the full quotes. Go ahead, spout some more lies.",
                                                                  "score": 1,
                                                                  "created_utc": 1742424171.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "mipby0r",
                                                                      "author": "midsummernightstoker",
                                                                      "body": "They had difficulties because the SNES hardware is unreliable. Of course it's related to the console. \n\nIt doesn't matter if normal users notice the issues or not. The existence of issues means the system is unreliable.\n\nHere's your problem. You are saying both: \n\n* Normal users can't notice the issues \n* There aren't issues \n\nBoth statements can't be true. \n\nTrying to argue both simultaneously is why you're getting so upset over this. Be kind to your mind and use logic and reason instead.",
                                                                      "score": 0,
                                                                      "created_utc": 1742425139.0,
                                                                      "replies": [
                                                                        {
                                                                          "id": "mipckq1",
                                                                          "author": "Dazed4Dayzs",
                                                                          "body": "The unrelated third-party software has nothing to do with the reliability of the console. I’ve explained reliability to you. I’ve explained how the console works reliably. I have explained with quotes from the devs themselves. I have explained the context of the commenter I was responding to and how their assumption was incorrect. I’m done listening to your nonsense and lies. You will never learn.",
                                                                          "score": 1,
                                                                          "created_utc": 1742425339.0,
                                                                          "replies": []
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mi9n8al",
          "author": "wrathek",
          "body": "It was always like this. If you'd read the article, you'd even see that some games were coded based on a faster clock speed so that the audio would sound correct.",
          "score": 8,
          "created_utc": 1742223092.0,
          "replies": [
            {
              "id": "mib13if",
              "author": "antpile11",
              "body": "The article also mentions that the clock speeds they found through their recent survey found that they're even higher than that and higher than what was found in the early 00's, which is why they think they could be speeding up.",
              "score": 4,
              "created_utc": 1742237560.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mihzzqs",
          "author": "Dear_Watson",
          "body": "Old electronics can last functionally forever as long as nothing degrades. I have many electronics that are 50 years old and still function the exact same way they did 50 years ago. Problems mostly happen if something had a defect or design flaw however long ago that never got caught or fixed, which is what seems to be the case here with the SNES.\n\nLikely it won’t affect all of them, but it will likely be a non-negligible amount that start to develop similar issues around the same age usually from the same batch of parts.",
          "score": 1,
          "created_utc": 1742329413.0,
          "replies": []
        },
        {
          "id": "mi9kw5w",
          "author": "anadalite",
          "body": "3310, all I'm sayin'",
          "score": -2,
          "created_utc": 1742222377.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mi9b4xu",
      "author": "IllBeSuspended",
      "body": "It's not running faster. Just the audio is.",
      "score": 20,
      "created_utc": 1742219240.0,
      "replies": [
        {
          "id": "mia3w0k",
          "author": "FlyingBishop",
          "body": "The APU is running faster. The problem is deeper than just the audio running slightly faster. Also, it's running faster than spec, and based on the evidence I am suspicious that any SNES actually ever had an APU that was as slow as the spec, since I don't think they found any, and also games don't work with the specced frequency.",
          "score": 11,
          "created_utc": 1742228049.0,
          "replies": []
        },
        {
          "id": "migcaan",
          "author": "No-Problem49",
          "body": "The games running faster too; it’s been known for a while in speed running community that you can cheat a speedrun on snes hardware by using a heatgun on the correct spot on an snes.   I don’t know if normal usage enough to make a difference but with enough heat in the right spot the game will run faster.",
          "score": 1,
          "created_utc": 1742312624.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mia8pfh",
      "author": "gramathy",
      "body": "new speedrun tech dropped",
      "score": 9,
      "created_utc": 1742229437.0,
      "replies": []
    },
    {
      "id": "mi9ivpg",
      "author": "Pipe_Memes",
      "body": "We’re complaining about the performance of the SNES? What year is it?",
      "score": 16,
      "created_utc": 1742221747.0,
      "replies": [
        {
          "id": "mia4cd6",
          "author": "FlyingBishop",
          "body": "No, we're not. The APU is faster than spec which causes errors with TAS and emulation, in addition to audio irregularities.",
          "score": 13,
          "created_utc": 1742228180.0,
          "replies": []
        }
      ]
    },
    {
      "id": "miaem4b",
      "author": "Mezmorizor",
      "body": "I wouldn't exactly call resonators that took 30 years to degrade \"cheap\" or \"unreliable\", but yes, this is a good example of why you need emulation. Electronics usually have a lifetime of ~15 years, and the old consoles will absolutely become paperweights only suitable for museum displays.",
      "score": 9,
      "created_utc": 1742231127.0,
      "replies": [
        {
          "id": "mic4nfb",
          "author": "Jiopaba",
          "body": "Some of the older data on this suggests people were aware of this as early as 2000 or so.  More importantly, I've yet to see any evidence of anybody finding even one of these things that actually ran exactly at spec anywhere.  It seems like they *all* ran very slightly fast relative to the spec.",
          "score": 2,
          "created_utc": 1742249089.0,
          "replies": []
        }
      ]
    },
    {
      "id": "miaiq3a",
      "author": "Strayresearch",
      "body": "This is such a miniscule issue",
      "score": 5,
      "created_utc": 1742232317.0,
      "replies": []
    },
    {
      "id": "mici32p",
      "author": "chang_bhala",
      "body": "Maybe the remaining SNES are moving away from the gravitational pull of earth.",
      "score": 2,
      "created_utc": 1742253421.0,
      "replies": []
    },
    {
      "id": "mig144d",
      "author": "heckfyre",
      "body": "I love that this problem is really only affecting the speedrunners. In my mind, it sort of creates a new challenge for speedrunners since the game isn’t guaranteed to be perfectly matched from run to run. Makes it a lot more interesting if you ask me.",
      "score": 2,
      "created_utc": 1742309340.0,
      "replies": []
    },
    {
      "id": "mi9xuii",
      "author": "PadSlammer",
      "body": "See. I told you that the controller isn’t doing what I told it to do!",
      "score": 4,
      "created_utc": 1742226293.0,
      "replies": []
    },
    {
      "id": "miaoeow",
      "author": "8funnydude",
      "body": "Ah. That explains a lot.\n\nI have an early-model SNES that I have fully recapped, upgraded the voltage regulator, and bought a quality Triad power supply for. \n\nAnd yet, I STILL have audio issues. The left audio channel likes to make poppy, staticy sounds. The pops occur when loading into a level, and the static fades in and out depending on what's happening.\n\nI thought that, maybe the APU chip is failing, but now I'll have to take a look at this ceramic resonator.",
      "score": 2,
      "created_utc": 1742233925.0,
      "replies": [
        {
          "id": "mijmlh8",
          "author": "AkirIkasu",
          "body": "That isn't the kind of problems that this resonator would cause. The resonator exists to clock the DSP, and speeding it up will make it ever so slighly higher in pitch. What you are describing is analog noise coming from RF interference somewhere around the analog portion of the circuitry. Perhaps in your repairs you bent or damaged some of the shielding, or perhaps one of the power smoothing capacitors you've replaced are not good quality? There's a lot of things that can cause that kind of noise, and some of it could be from the factory to begin with. You'll need to do some probing with an osciliscope to find out where the problem lays.",
          "score": 1,
          "created_utc": 1742347749.0,
          "replies": [
            {
              "id": "mijtl8t",
              "author": "8funnydude",
              "body": "Nope, went over it all with a fine-toothed comb and found no damage whatsoever; the capacitors I used came from a Console5 recap kit. The audio issue is still present before and after the repair job. \n\nAlso, it's worth mentioning that the audio issue only occurs after the console has warmed up. \n\nI ran a burn-in test for several hours, and the APU passed each time. No idea what else it could be, but considering the price of an oscilloscope, I'm better off just selling the SNES and emulating it instead.",
              "score": 1,
              "created_utc": 1742350163.0,
              "replies": [
                {
                  "id": "mik1484",
                  "author": "AkirIkasu",
                  "body": "You don't need to buy a *good* osciliscope. You can get \"good enough\" ones off of aliexpress for around $80. Since the sound you are hearing is in the audible frequency you don't need to buy anything particularly high resolution, as even the 1MHz cheapies can handle it.",
                  "score": 1,
                  "created_utc": 1742352897.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "miapoo8",
      "author": "TheMacMan",
      "body": "\"Cheap\"? Come on. It's 35 years later. They've held up pretty well for being \"cheap\". And it's really only an issue for the speed run folks.",
      "score": 4,
      "created_utc": 1742234288.0,
      "replies": []
    },
    {
      "id": "mi9nps7",
      "author": "Ionovarcis",
      "body": "I feel like any time 2+ years after the console is no longer being produced / available ‘new’ and it’s open game… New editions get their own timelines if there’s any significant transformative work or sustain their timeline if there’s just ‘new edition’ changes.  Virtual console would protect most games for the console’s lifespan +2 years in the new ‘digital download’ climate imo.\n\nThe issue with ‘legal’ game sharing versus ‘illegal’ becomes impossible to distinguish since many games aren’t even available with physical media or DRM free software… if I want to share some switch games or PC games, I need to share a whole library / access to that library.  Sure, pirating isn’t just borrowing a copy from a kid at school, but there’s gotta be a middle ground option that isn’t more subscriptions or other BS.",
      "score": 4,
      "created_utc": 1742223241.0,
      "replies": [
        {
          "id": "mibe1yt",
          "author": "maazen",
          "body": "as kids in school we just made sure everyone gets a different game and borrowed them across - so in a sense we did have a shared library.\n\noh and of course rentals from blockbuster etc.",
          "score": 3,
          "created_utc": 1742241263.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mib7sq2",
      "author": "Difficult-Ad628",
      "body": "> unavoidable \n\nIdk, I’m no tech expert by any stretch of the imagination but I bet it would be avoided if they didn’t use the cheapest parts available",
      "score": 2,
      "created_utc": 1742239467.0,
      "replies": []
    },
    {
      "id": "mi8wfo6",
      "author": "None",
      "body": "[deleted]",
      "score": 2,
      "created_utc": 1742213638.0,
      "replies": [
        {
          "id": "mi8ww0x",
          "author": "ballsmigue",
          "body": "Not a nothing burger at all.\n\nThere's speedrunners that do blindfold runs of sections of games.\n\nPerfect one that comes to mind was battletoads and yes it was the bike section.\n\nWhen you rely entirely on sound for ques for inputs it completely takes away being able to do challenges like this if it's not reliable enough.",
          "score": 12,
          "created_utc": 1742213833.0,
          "replies": [
            {
              "id": "mi90ov4",
              "author": "rdyoung",
              "body": "Can I just say, fuck those hover bikes.",
              "score": 5,
              "created_utc": 1742215396.0,
              "replies": []
            },
            {
              "id": "mi9clne",
              "author": "right_there",
              "body": "So 0.0000001% of the player base of these games are affected? Oh noooooo!",
              "score": -6,
              "created_utc": 1742219729.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mic3ez0",
      "author": "fanatic26",
      "body": "Talk about a complete non issue.\n\nIts not a problem at all that TAS people cant program their speed runs perfectly.\n\nCan you still play actual games on the actual console? Yep...that is what matters.",
      "score": 2,
      "created_utc": 1742248703.0,
      "replies": [
        {
          "id": "midvvco",
          "author": "TheMaskedHamster",
          "body": "The definition of \"problem\" is not \"bothers me personally\".",
          "score": 3,
          "created_utc": 1742271513.0,
          "replies": []
        },
        {
          "id": "mifkjfe",
          "author": "Thelaea",
          "body": "This, and it seems even the emulator works just fine. Just this whole pointless speedrun thing isn't working. Some people really need to get a life.",
          "score": 2,
          "created_utc": 1742304100.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mijwrwv",
      "author": "Polymathy1",
      "body": "Which is limited to only a small percent of the latest models of SNES. And is repairable.",
      "score": 1,
      "created_utc": 1742351295.0,
      "replies": []
    },
    {
      "id": "mikd5ug",
      "author": "trainbrain27",
      "body": "Thankfully, it's only a problem when people hook up another computer to play games frame perfect.\n\nThe fraction of a percent variation in speed, which is within the spec for the resonator as built, makes it difficult or impossible for Tool Assisted Speed Runs to perfectly match the game when the APU isn't constant between different SNES or even the same one at different temperatures.\n\nThe article says some original games were programmed to run on hardware that was a tenth of a percent faster then the documentation.\n\nIt definitely doesn't affect humans playing normally.",
      "score": 1,
      "created_utc": 1742357954.0,
      "replies": []
    },
    {
      "id": "mi8z0xi",
      "author": "rayeo_tnj",
      "body": "SNES speedrunners drooling now, so much time save now 🤣",
      "score": -5,
      "created_utc": 1742214721.0,
      "replies": [
        {
          "id": "mi92ldm",
          "author": "Swallagoon",
          "body": "The games don’t run faster, it’s the audio chip that runs faster. No time saves.",
          "score": 14,
          "created_utc": 1742216143.0,
          "replies": [
            {
              "id": "mi9izf3",
              "author": "alidan",
              "body": "go take a look at the speedruns that require putting the console on a hot plate, it's fascinating.",
              "score": 1,
              "created_utc": 1742221779.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mi93qqt",
          "author": "gman5852",
          "body": "The literal second paragraph explains why it's a problem for speed runners and why they were trying to diagnose it.\n\nReading the article isn't difficult.",
          "score": 16,
          "created_utc": 1742216582.0,
          "replies": [
            {
              "id": "mia4tu1",
              "author": "FlyingBishop",
              "body": "In fairness the article is pretty technical, I would guess that a majority of English speakers wouldn't understand the distinction between \"the APU is running fast\" and \"the SNES is running fast\" even after reading every word of the article.",
              "score": 1,
              "created_utc": 1742228321.0,
              "replies": []
            },
            {
              "id": "mi9fd7e",
              "author": "SnowingSilently",
              "body": "The one part I'm confused on is why the Audio Processing Unit matters much for a TAS. Is it because the code execution sequentially needs the audio to run or something?",
              "score": 1,
              "created_utc": 1742220637.0,
              "replies": [
                {
                  "id": "mi9odxn",
                  "author": "error521",
                  "body": "I'm kinda talking out of my ass a little here but audio doesn't necessarily work completely separate from everything else. A game might wait for an audio cue to finish before doing something, for example.\n\nAnd I could imagine it affecting loading times as well. If a game loads 0.1 seconds faster because the audio is loaded in quicker that can completely throw off a TAS.",
                  "score": 2,
                  "created_utc": 1742223446.0,
                  "replies": [
                    {
                      "id": "miarvj4",
                      "author": "SnowingSilently",
                      "body": "My thoughts were that you should only need to send data to the APU to get the audio to play, so it should be asynchronous. But if it's waiting on the audio to finish and thus it would be synchronous, that would make a lot of sense. I wouldn't have thought of designing an audio chip that way but there's probably a good reason.",
                      "score": 1,
                      "created_utc": 1742234916.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mi9jkh7",
                  "author": "alidan",
                  "body": "if I have to guess, its almost purely for autism reasons, there have been points where if you repaired an arcade system that disqualified it from being used for a record attempt.",
                  "score": -2,
                  "created_utc": 1742221963.0,
                  "replies": [
                    {
                      "id": "mi9mxzb",
                      "author": "MimeTravler",
                      "body": "I know nothing about this issue but enjoy speedruns and have autism so I feel I can weigh in lol. The problem I can see with your example  of the arcade machines is if one was repaired with new parts and the rest weren’t it would be like racers all driving a stock 2013 while you just replaced the engine in yours. It might not make a huge difference but yours will run better even if it’s a small amount and that’s an advantage when we are talking about records that get broken by milliseconds.",
                      "score": 2,
                      "created_utc": 1742223005.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mi9i2pr",
      "author": "iAmSamFromWSB",
      "body": "Green Blue Red? Sir, it was purple, purple, lavender, lavender. No gaslighting or revisionist history please.",
      "score": -7,
      "created_utc": 1742221494.0,
      "replies": [
        {
          "id": "mia5f9y",
          "author": "IIIIlllIIIIIlllII",
          "body": "Correct",
          "score": -4,
          "created_utc": 1742228493.0,
          "replies": []
        }
      ]
    }
  ]
}