{
  "post": {
    "title": "Apple Vision Pro May Now Be Out of Production",
    "author": "BlueLightStruct",
    "id": "1hr312h",
    "score": 1906,
    "created_utc": 1735738462.0,
    "selftext": "",
    "num_comments": 555,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hr312h/apple_vision_pro_may_now_be_out_of_production/"
  },
  "comments": [
    {
      "id": "m4ugndl",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1735738463.0,
      "replies": []
    },
    {
      "id": "m4umj1g",
      "author": "JanewaysFolly",
      "body": "It was pretty cool to play with at the apple store.  Unfortunately no content and way expensive.  At least the meta quest had some games.",
      "score": 1071,
      "created_utc": 1735741191.0,
      "replies": [
        {
          "id": "m4vlmke",
          "author": "IMovedYourCheese",
          "body": "Quest 3S at $300 is an insane value. Apple really thought *$3500* was a good price point to enter the market. Glad to see that the reality distortion field has some limits.",
          "score": 705,
          "created_utc": 1735754001.0,
          "replies": [
            {
              "id": "m4vyayk",
              "author": "LordRobin------RM",
              "body": "I can’t believe that Apple expected the product to sell well at that price point. I figured it was just a first step toward a more affordable future product. It’s a shame if that’s not going to happen. \n\nFor what it’s worth, I never saw Apple Vision as a competitor to MetaQuest or Oculus Rift. Apple seemed to be positioning it as a next-gen content consumption device, something that might replace the iPad for some folks.",
              "score": 207,
              "created_utc": 1735758027.0,
              "replies": [
                {
                  "id": "m4vzbd0",
                  "author": "Bob_A_Feets",
                  "body": "If it didn’t cost 3500 I’d watch a shitload of movies on it.",
                  "score": 142,
                  "created_utc": 1735758349.0,
                  "replies": [
                    {
                      "id": "m4w1s1e",
                      "author": "Bakk322",
                      "body": "In theory I thought I’d watch a bunch of movies on mine but having kids and wife prevented me from ever really being able to use mine",
                      "score": 85,
                      "created_utc": 1735759141.0,
                      "replies": [
                        {
                          "id": "m4w8ppa",
                          "author": "iamnotcreativeDET",
                          "body": "you could get one for the whole family! /s",
                          "score": 33,
                          "created_utc": 1735761385.0,
                          "replies": [
                            {
                              "id": "m4wuvr3",
                              "author": "elriggo44",
                              "body": "At the beginning they were locked to one person. So you HAD TO.",
                              "score": 26,
                              "created_utc": 1735768423.0,
                              "replies": [
                                {
                                  "id": "m4ymevl",
                                  "author": "Cyraga",
                                  "body": "First I heard of this. That's egregiously bad business",
                                  "score": 12,
                                  "created_utc": 1735791901.0,
                                  "replies": [
                                    {
                                      "id": "m4zxqnm",
                                      "author": "throwaways_are_cool_",
                                      "body": "I'm pretty sure that's wrong. I got mine within a few days of launch and _many_ people tried it in Guest mode \n\nGuest mode was clunkier than it is today, but it's not like other people couldn't use it.",
                                      "score": 0,
                                      "created_utc": 1735820046.0,
                                      "replies": [
                                        {
                                          "id": "m5099y3",
                                          "author": "elriggo44",
                                          "body": "That’s not how it was explained to me by an apple employee when I tried it. \n\nI took my son a few weeks later because he also wanted to try it and they told us about Guest mode. It sounded like a quick fix to the OS, which was based on the idea that a phone is owned by a single person. \n\nBut I’ll take your lived experience with it over my two demos.",
                                          "score": 2,
                                          "created_utc": 1735825456.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m4zrbwr",
                          "author": "sorrylilsis",
                          "body": "It's funny, when I reviewed the first Oculus dev kit for a magazine way back in the day once of the the things I was super hyped with was watching movies with it. \n\nMy editor then told me \"great, but that's a single guy point of view\". \n\nHe wasn't wrong and people keep having that bias 10 years later.",
                          "score": 13,
                          "created_utc": 1735816354.0,
                          "replies": [
                            {
                              "id": "m58j0l3",
                              "author": "fromYYZtoSEA",
                              "body": "I think it’s an open secret that most of the movies watched on Oculus etc are … the kind of movies that you wouldn’t normally watch with others",
                              "score": 3,
                              "created_utc": 1735934642.0,
                              "replies": []
                            },
                            {
                              "id": "m51vrl3",
                              "author": "Jojop0tato",
                              "body": "Thats true, but at least the quest is cheap enough that we have two Quest 3's between my partner and I. We regularly watch movies together in VR.",
                              "score": 2,
                              "created_utc": 1735844538.0,
                              "replies": []
                            },
                            {
                              "id": "m63wagy",
                              "author": "None",
                              "body": "Who gives a shit. You say this as if there aren’t tens of millions of single guys out there, who have more disposable income than average people. \n\nIt’s not a “bias” it’s a legitimate market insight.",
                              "score": 1,
                              "created_utc": 1736367933.0,
                              "replies": [
                                {
                                  "id": "m6744n3",
                                  "author": "sorrylilsis",
                                  "body": "Oh there are single guys out there sure ! Some nerdy enough to be interested in VR, an even smaller subset who are wealthy enough to throw a few thousands in an high end headset, and out of those an even smaller subset will actually pull the trigger and buy the thing.\n\nThe economic reality is that building a product like the Apple Vision Pro and mobilize the whole software ecosystem that it needs to be actually useful long term is very hard. \nIt's a super cool product technically, but one that is way too niche to actually have mass appeal. The tech industry is full of those.",
                                  "score": 1,
                                  "created_utc": 1736412591.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m4zepp8",
                          "author": "TacoParasite",
                          "body": "Can I have it? I got no wife or kids.",
                          "score": 1,
                          "created_utc": 1735808139.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m4wiivx",
                      "author": "daitenshe",
                      "body": "Borrowed it from a buddy for a few weeks and by far it was the thing I did most on it. Makes for an amazing viewing experience (and some of the best plane rides I’ve ever had) but that price point is a *looooot*",
                      "score": 28,
                      "created_utc": 1735764575.0,
                      "replies": [
                        {
                          "id": "m5012rd",
                          "author": "EDITORDIE",
                          "body": "What did you use it for on the plane rides and what duration were they roughly? I’m guessing movies or?",
                          "score": 2,
                          "created_utc": 1735821787.0,
                          "replies": [
                            {
                              "id": "m50qogu",
                              "author": "daitenshe",
                              "body": "Yeah pretty much movies/shows exclusively. It was nice to be able to turn on the scenes and have the world essentially dead to me and just kick back and watch something on what felt to be a massive screen. Only 3-4 hour flights but it felt quicker than ever before because there was nothing to bug me and just felt like I was watching a movie at home (minus the turbulence haha)",
                              "score": 3,
                              "created_utc": 1735831855.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m4wbswv",
                      "author": "gogodboss",
                      "body": "I have watched a shitload of movies on my Meta Quest 3 ",
                      "score": 13,
                      "created_utc": 1735762398.0,
                      "replies": []
                    },
                    {
                      "id": "m4wc7kw",
                      "author": "YujiroRapeVictim",
                      "body": "But you can’t since it doesn’t have Netflix or YouTube",
                      "score": 17,
                      "created_utc": 1735762532.0,
                      "replies": [
                        {
                          "id": "m4x21yu",
                          "author": "iamnotexactlywhite",
                          "body": "wtf",
                          "score": 11,
                          "created_utc": 1735770772.0,
                          "replies": [
                            {
                              "id": "m4x33c3",
                              "author": "Forrest319",
                              "body": "The killer app was Safari",
                              "score": 29,
                              "created_utc": 1735771122.0,
                              "replies": [
                                {
                                  "id": "m4ykh2n",
                                  "author": "bmore_conslutant",
                                  "body": "Am I being an idiot or can't you just use the browser version?",
                                  "score": 10,
                                  "created_utc": 1735791022.0,
                                  "replies": [
                                    {
                                      "id": "m4ytl13",
                                      "author": "JasonQG",
                                      "body": "You can",
                                      "score": 5,
                                      "created_utc": 1735795334.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "m515p4w",
                                      "author": "Forrest319",
                                      "body": "Edge and Safar both support 4k netflix. Chrome and Firefox do not. Different DRM implementations.",
                                      "score": 1,
                                      "created_utc": 1735836625.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "m53n8kb",
                                      "author": "onecoolcrudedude",
                                      "body": "yes. but people like having native apps. they're snappier, have more features, and better organized.",
                                      "score": 1,
                                      "created_utc": 1735863994.0,
                                      "replies": [
                                        {
                                          "id": "m564alj",
                                          "author": "Bob_The_Bandit",
                                          "body": "All native apps do is be a container for the web app. You can actually get YouTube to serve you the TV app in your browser by modifying what device you appear as.",
                                          "score": 1,
                                          "created_utc": 1735905342.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m4x93zz",
                              "author": "YujiroRapeVictim",
                              "body": "the thing literally has no media apps. It's sad that apple doesn't GAF. if they can't do this for the premium one will the more affordable one have them? The meta quest is a way better deal for money.",
                              "score": 13,
                              "created_utc": 1735773166.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m4za03l",
                          "author": "-6h0st-",
                          "body": "You still can watch in a browser",
                          "score": 2,
                          "created_utc": 1735804980.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m4z1ojq",
                      "author": "Radulno",
                      "body": "Meh I got it in trial for that and it's way inferior to a good TV/projector and sound system system (considering the price this is what it gets compared to). Sound is nothing exceptional from it and it's uncomfortable wearing that thing for the duration of a movie, it's heavy on your face and it heats (not to the point of hurting but uncomfortable).\n\nWithout even mentioning how it's so isolating where as a TV allow you to watch something with other people.\n\nAlso the other headsets way cheaper can watch movies too.",
                      "score": 2,
                      "created_utc": 1735799763.0,
                      "replies": []
                    },
                    {
                      "id": "m4xalrl",
                      "author": "None",
                      "body": "And even then you can get some pretty solid XR glasses for like 400 to do the same thing",
                      "score": 1,
                      "created_utc": 1735773660.0,
                      "replies": []
                    },
                    {
                      "id": "m4z9x6h",
                      "author": "momjeanseverywhere",
                      "body": "Based on reviews, you wouldn’t get through more than 40 minutes until your head hurt.",
                      "score": 1,
                      "created_utc": 1735804926.0,
                      "replies": []
                    },
                    {
                      "id": "m5006sk",
                      "author": "Jim_in_tn",
                      "body": "‘Movies’. Heh",
                      "score": 1,
                      "created_utc": 1735821337.0,
                      "replies": []
                    },
                    {
                      "id": "m50brvp",
                      "author": "db1000c",
                      "body": "If it was 1500-1800 I probably would have been tempted to finance one and never look back in terms of watching movies and sport. But 3500 was basically unjustifiable, sadly.",
                      "score": 1,
                      "created_utc": 1735826469.0,
                      "replies": []
                    },
                    {
                      "id": "m4y3t13",
                      "author": "lecollectionneur",
                      "body": "I have a VR headset but I will never get why'd you put one to watch a movie. It's not confortable and it adds nothing compared to a tv",
                      "score": -1,
                      "created_utc": 1735784180.0,
                      "replies": [
                        {
                          "id": "m4yfzt3",
                          "author": "nerevisigoth",
                          "body": "I guess if you don't have room for a decent sized TV. Like if you live in a dorm and would otherwise be watching on a laptop.",
                          "score": 6,
                          "created_utc": 1735789078.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m4wetcf",
                  "author": "Eccohawk",
                  "body": "Also seemed like they were positioning it to replace your monitors. \n\n\"Here's multiple desktops at whatever display scale and size you want.\"",
                  "score": 18,
                  "created_utc": 1735763375.0,
                  "replies": [
                    {
                      "id": "m4yq3bb",
                      "author": "Leungal",
                      "body": "That's the idea but it sucks right now.  Imagine you had to go about a regular workday at an office job but had to put on a pair of ski goggles every time you wanted to look at your monitor.\n\nMaybe one day if they're as lightweight and ergonomic as a pair of glasses but that will require multiple generational leaps in tech.",
                      "score": 21,
                      "created_utc": 1735793616.0,
                      "replies": [
                        {
                          "id": "m58quq0",
                          "author": "Soggy_Property3076",
                          "body": "That would be amazing, No one would know when I fell asleep.",
                          "score": 1,
                          "created_utc": 1735937053.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m4zgy45",
                      "author": "nagi603",
                      "body": "Yet it was absolutely incapable of replacing them for anyone who actually works with monitors all days. It was too heavy and it had a 2 hour battery life untethered.\n\nAnd if you actually want to interact, not just stare at those monitors, you either have to sit at the same place and use the keyboards, or get a hit on productivity and come up with a completely new gesture based interaction. Which is much more tiring than having your hands rest on the desk.\n\nSo it's great for a 10 minute demo session. And would be great for AR/VR work stuff, if it had the apps and comfort and usability of the rest of the market.",
                      "score": 3,
                      "created_utc": 1735809635.0,
                      "replies": []
                    },
                    {
                      "id": "m4ykup3",
                      "author": "bmore_conslutant",
                      "body": "Yeah if I tried to do a workday like that I'd be puking by noon",
                      "score": 1,
                      "created_utc": 1735791192.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4w6nvs",
                  "author": "stevenmu",
                  "body": "Weren't Apple very clear when they launched it that they never expected it to be a mass market consumer product? I'm pretty sure they always said it was somewhere between an experimental tech demo and a dev kit. \n\nMaybe I'm mis-remembering.",
                  "score": 60,
                  "created_utc": 1735760713.0,
                  "replies": [
                    {
                      "id": "m4wai5h",
                      "author": "ihateyouguys",
                      "body": "Nah that’s exactly what I remember hearing as well",
                      "score": 21,
                      "created_utc": 1735761969.0,
                      "replies": [
                        {
                          "id": "m4xzhh2",
                          "author": "TorrenceMightingale",
                          "body": "So basically you’re buying a partially functioning prototype for 3500?",
                          "score": 8,
                          "created_utc": 1735782523.0,
                          "replies": [
                            {
                              "id": "m4ykka1",
                              "author": "bmore_conslutant",
                              "body": "The \"you\" is like 100 people at CES\n\nit's not actually you",
                              "score": 8,
                              "created_utc": 1735791062.0,
                              "replies": []
                            },
                            {
                              "id": "m4yn19c",
                              "author": "ihateyouguys",
                              "body": "I mean… not me, but some people. Other people are investing/gambling on getting a head start in a potentially (eventually) lucrative space.",
                              "score": 1,
                              "created_utc": 1735792186.0,
                              "replies": []
                            },
                            {
                              "id": "m4zu5z8",
                              "author": "ArriePotter",
                              "body": "IMHO it was basically an open beta for developers. They wanted to build a bunch of hype for their new product category to be introduced to the mainstream over the next decade. The first gen was for the folks to make apps with for the next gens",
                              "score": 1,
                              "created_utc": 1735818054.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m4wf1zi",
                      "author": "Eccohawk",
                      "body": "That's what they said...but of course they hope regular prosumers will want one anyway.",
                      "score": 12,
                      "created_utc": 1735763454.0,
                      "replies": []
                    },
                    {
                      "id": "m4zgahx",
                      "author": "nagi603",
                      "body": "With this, it seems it never actually reached even the sales target of \"not mass market\" for Apple.",
                      "score": 3,
                      "created_utc": 1735809197.0,
                      "replies": []
                    },
                    {
                      "id": "m4xwy8y",
                      "author": "NtheLegend",
                      "body": "Yes. It was never \"oh we're going to sell it at a premium and it's going to break the entire category.\" It was always EXTREMELY clear from the initial presentation that this was a pickaxe in the ice, a high-end product that allowed them to push the technology in ways that consumer-priced tech simply can't. They wanted this to be different. People have such weird perspectives about this device that it was never intended to be.\n\nI absolutely agree it lacks content or a killer app, because it is a very convincing demo at an Apple Store, but they're building the technology first and hoping they can figure out what more they can do it with it from there.\n\n224,000 estimated Vision Pros sold at $3500 is three-quarters of a billion dollars in revenue. That's HUGE for a toe dipped in the water.",
                      "score": 9,
                      "created_utc": 1735781589.0,
                      "replies": [
                        {
                          "id": "m4y10ch",
                          "author": "PunkOverLord",
                          "body": "Your pricing math made me finally understand FN and their pricing models for civilians lol",
                          "score": 8,
                          "created_utc": 1735783099.0,
                          "replies": []
                        },
                        {
                          "id": "m4zkmne",
                          "author": "Bloody_Sunday",
                          "body": "That's revenue, not net income. \n\nOn one hand, its 2024 sales are guesstimated by market reports at around 400-420k. On the other, Apple was initially expecting it to sell around 800k and now according to the news reports they're stopping production, perhaps for a new model. \n\nThat's way too high even for the \"early adopter\" throw-money-away group, with very low market response outside the US estimated to be one of the main weaknesses. \n\nAugmented reality is nowhere near as extraordinary or \"experimental\" as Apple thought it is. And they are going to have to offer something way more tangible and cheaper if they have any expectations of success. \n\nPlus, their acquired know-how is admittedly very useful for them but they will have to use it sooner or later into something far more appealing.",
                          "score": 5,
                          "created_utc": 1735812105.0,
                          "replies": []
                        },
                        {
                          "id": "m52g70x",
                          "author": "OperativePiGuy",
                          "body": "what exactly DID it do to revolutionize the technology, out of curiosity?",
                          "score": 1,
                          "created_utc": 1735850822.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m4zoa9x",
                      "author": "tweda4",
                      "body": "I mean, that was what Apple suggested, but if that were true, then surely we'd be expecting a new apple vision device as opposed to just a shuttering of production?\n\n\nI can't tell then if they've decided the concept doesn't work, or if they've decided that other cheaper options wouldn't have enough market appeal?\nOr I suppose if they're just being really quiet about a successor for some reason.\n\n\nEither way, lacking any announcements indicating of a successor, it doesn't seem like the AVP has 'succeeded' in Apples view.",
                      "score": 1,
                      "created_utc": 1735814479.0,
                      "replies": []
                    },
                    {
                      "id": "m6t4vsv",
                      "author": "zzazzzz",
                      "body": "thats cope. all their marketing very clearly targeted the casual user. so either their marketing department completely failed or they just lied.",
                      "score": 1,
                      "created_utc": 1736715816.0,
                      "replies": []
                    },
                    {
                      "id": "m4wolzs",
                      "author": "chris8535",
                      "body": "This story was retroactively added after initial sales were very poor. It worked.",
                      "score": 0,
                      "created_utc": 1735766531.0,
                      "replies": [
                        {
                          "id": "m50m0tj",
                          "author": "wiyixu",
                          "body": "There are reports well before the launch that Sony was only able to produce 450,000 micro LED screens. Two screens per unit, plus typical failure rates and reserves for replacements. \n\nSupply chain evidence alone made it clear the AVP was going to sell in the low six-figure range. \n\nhttps://wccftech.com/apple-vision-pro-display-supplier-sony-cannot-make-one-million-panels-yearly/",
                          "score": 1,
                          "created_utc": 1735830286.0,
                          "replies": [
                            {
                              "id": "m50u0sd",
                              "author": "chris8535",
                              "body": "And Apple then halved that and now shut it down. \n\nStop being dumb. ",
                              "score": 1,
                              "created_utc": 1735832950.0,
                              "replies": [
                                {
                                  "id": "m50w0ov",
                                  "author": "wiyixu",
                                  "body": "There are two screens per AVP so 225,000 units per year. \n\nThere are no published sales figures by Apple. Everything sales estimate so far is a guess by analysts. \n\nAll estimates thus far suggest sales well above 225,000 units. ",
                                  "score": 1,
                                  "created_utc": 1735833589.0,
                                  "replies": [
                                    {
                                      "id": "m5610cm",
                                      "author": "ddark4",
                                      "body": "Oh wow! You corrected a dumb asshole who can’t follow a simple comment and didn’t even say “stop being dumb.” \n\n(Which must have been really hard considering the hypocrite you replied to is dumber than fuck.)",
                                      "score": 1,
                                      "created_utc": 1735903526.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m4wf7o3",
                  "author": "HaMMeReD",
                  "body": "The thing is, that's lonely AF. It's the perfect media consumption device for the person with no family or friends and a 140sf apartment that they can only sit with their hands on their lap and look at things.\n\nThat said, apple knew it wouldn't sell, they wanted to see if it would get traction though.\n\nIt was a flawed plan though, if they said \"Apple vision pro, $3500, Apple Vision $1500 6 mo later\", it would have actually sold really well and got way more traction, as developers would be like \"oh shit, we have 6 months to get products to market\".\n\nInstead they are like Vision Pro $3,500, next product ??? next product price ??? It's really a high risk situation. Not only do you have to spent a ton up front to get your foot in the door on the dev env, but you have no pathway to profitability.\n\nEdit: Same goes for content production, why spend the extra $$$ to produce content for such a small demographic. And personally I think it's content consumption for lonely, rich people with uber-necks.",
                  "score": 17,
                  "created_utc": 1735763505.0,
                  "replies": [
                    {
                      "id": "m5c28l2",
                      "author": "mcknuckle",
                      "body": "Honestly I think even at the $1500 price selling really well would still be selling to a niche audience. \n\nI think a world in which any kind of headset or glasses based computing is ubiquitous will be one that looks different than the one we live in today that uses a different computing paradigm that doesn't exist yet in addition to or instead of what we use today.\n\nIn the same way that GUI based computing was a different paradigm to CLI based computing or the way that smartphone based computing was massively more accessible than desktop based computing. \n\nIf we're putting on a pair of glasses, en masse, when we want to interact with computing power, it will be to do something we can't do already in a way we can't do any other way, not just to do more of what we can already do. Even if it's novel.",
                      "score": 1,
                      "created_utc": 1735986192.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4w2wlw",
                  "author": "charleswj",
                  "body": "There are only 3 people that would choose to wear that thing on their head for extended periods of time.",
                  "score": 8,
                  "created_utc": 1735759500.0,
                  "replies": [
                    {
                      "id": "m4xrbxq",
                      "author": "LordRobin------RM",
                      "body": "True. I’d watch a movie, reclining in a chair or relaxing in bed. But I can’t see doing any actual “work” in it that would require sitting at a keyboard.",
                      "score": 2,
                      "created_utc": 1735779566.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4wdwbt",
                  "author": "daft_knight",
                  "body": "The crazy thing is the Apple Vision Pro IS a competitor to the quest 3. Yes, it’s much more premium, but the quest 3 offers  ~90% of the vision pro’s functionality plus all of the PC VR gaming stuff that’s completely absent on the Vision Pro. I’m hard pressed to think of a feature present on the Vision Pro that’s not possible on the quest 3.",
                  "score": 20,
                  "created_utc": 1735763075.0,
                  "replies": [
                    {
                      "id": "m4wrl0u",
                      "author": "None",
                      "body": "Integration with macOS",
                      "score": 6,
                      "created_utc": 1735767460.0,
                      "replies": [
                        {
                          "id": "m4yh6na",
                          "author": "Grimzkunk",
                          "body": "It's not really a feature. It's more a vendor phish.\nIntegration with popular desktop OS (Windows, macOS, Linux) would have been a feature.",
                          "score": 10,
                          "created_utc": 1735789584.0,
                          "replies": [
                            {
                              "id": "m4yto4u",
                              "author": "None",
                              "body": "Idk what that means but cool",
                              "score": -2,
                              "created_utc": 1735795378.0,
                              "replies": [
                                {
                                  "id": "m505ggl",
                                  "author": "Grimzkunk",
                                  "body": "I meant that their own MacOS compatibility with the Vision is just another way to lock the user into their ecosystem. \nFrom my perspective it's very negative for a piece of hardware to not be able to run on operating systems. So I would not call that a \"feature\". It's more like a drawback.",
                                  "score": 2,
                                  "created_utc": 1735823823.0,
                                  "replies": [
                                    {
                                      "id": "m51h5cp",
                                      "author": "None",
                                      "body": "I see what you’re saying",
                                      "score": 2,
                                      "created_utc": 1735840102.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m53nv4y",
                          "author": "onecoolcrudedude",
                          "body": "you can use a quest 3 with windows 11 now if you're up to date so not much of a tradeoff there.",
                          "score": 3,
                          "created_utc": 1735864190.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m4yfqmx",
                  "author": "birdington1",
                  "body": "I don’t think people understand the fact they weren’t releasing it expecting it to sell well at this price point.\n\nIt’s priced that way simply to cover the cost of RND and use the current sales as customer feedback for the next iterations.\n\nThey will bring back a lower cost version in a few years with the exact same features as the now pro version and price a more advanced pro version slightly higher.\n\nWhen adjusted for inflation, the iPhone is now only $60 more than the very first one. This is their exact release model for every single product they have.",
                  "score": 7,
                  "created_utc": 1735788970.0,
                  "replies": [
                    {
                      "id": "m4z74kt",
                      "author": "nysecret",
                      "body": "and when the iPhone first came out it was considered an extravagant purchase and a luxury device. i know iPhones are still expensive, but tons of consumers are fine with the expense because iPhones have such improved utility to the point of near necessity. But at launch the iPhone didn’t even have an app store. The iPhone was in fact successful out the gate but I wouldn’t say it broke through till the 3rd generation.",
                      "score": 1,
                      "created_utc": 1735803115.0,
                      "replies": []
                    },
                    {
                      "id": "m4yrdpi",
                      "author": "_ravenclaw",
                      "body": "I can’t stand dumb people that think Apple created this assuming they’d sell like iPhones lmfao like use your brain. Yes, it has flaws…like literally every other headset out right now. \n\nIt’s obvious this is the beginning of the roadmap to what Apple really wants AVP to become.",
                      "score": 0,
                      "created_utc": 1735794235.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4yx14n",
                  "author": "totesmygto",
                  "body": "You see. Tim apple and all his friends spent that for breakfast. He has no clue what the poor:s are doing.",
                  "score": 2,
                  "created_utc": 1735797126.0,
                  "replies": []
                },
                {
                  "id": "m4z1drc",
                  "author": "Radulno",
                  "body": "Except they didn't have any content (well sorry except like 5 short films that's quite steep of a price)",
                  "score": 1,
                  "created_utc": 1735799587.0,
                  "replies": []
                },
                {
                  "id": "m50li5p",
                  "author": "mrureaper",
                  "body": "I mean the product actually sold out. It's just not feasible to make this a mainstream product at that price. They should look at bringing controllers even as an accessory to allow it to be a lot more versatile",
                  "score": 1,
                  "created_utc": 1735830105.0,
                  "replies": []
                },
                {
                  "id": "m51fqjg",
                  "author": "4your",
                  "body": "Who said they won’t make a more affordable “Apple Vision” in the future?",
                  "score": 1,
                  "created_utc": 1735839678.0,
                  "replies": []
                },
                {
                  "id": "m4wlgwz",
                  "author": "intellifone",
                  "body": "The only thing keeping it from being any semblance of mass market at that price is that there is zero way to share an experience. With my phone or laptop I can tilt the screen to show someone else, but I cannot watch a movie with someone else. I couldn’t get one for my wife and I to both watch a movie on a giant 1000’ screen at the Grand Canyon together. I can’t play games with her in the living room. \n\nThat would be the killer app.",
                  "score": 1,
                  "created_utc": 1735765533.0,
                  "replies": [
                    {
                      "id": "m4xcjet",
                      "author": "click4dylan",
                      "body": "Already exists with quest and other headsets for 10 years now",
                      "score": 2,
                      "created_utc": 1735774319.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4x7awd",
                  "author": "wkavinsky",
                  "body": "Reasonably sure it was a public beta with paid participation.\n\nApple do know what they are doing.",
                  "score": 1,
                  "created_utc": 1735772556.0,
                  "replies": []
                },
                {
                  "id": "m4xab08",
                  "author": "kibblerz",
                  "body": "They repeatedly stated that they knew it wouldn't become a mainstream thing, they were quite clear it was specifically for early adopters/enthusiasts.  They basically marketed it as a dev kit from the beginning \n\nThe reason it's so pricey is because the 4k micro oleds are quite difficult to manufacture,  with the cost for the screens themselves being about $1800 due to a 50% failure rate when manufacturing.",
                  "score": 0,
                  "created_utc": 1735773562.0,
                  "replies": []
                },
                {
                  "id": "m4weazg",
                  "author": "--Bazinga--",
                  "body": "Apple sold the best VR product they were able to make and consequently this was the price point. They could have settled for a Quest competitor, but it wouldn’t be near as good as the Vision Pro is. \n\nThat won’t mean they won’t release a cheaper version. They learned tons of shit from the Vision Pro and there is now an ecosystem with apps to benefit from.",
                  "score": -2,
                  "created_utc": 1735763208.0,
                  "replies": []
                },
                {
                  "id": "m4xeq6u",
                  "author": "adrian783",
                  "body": "no, the vision pro was a productivity device. the value lies in having like 6 high resolution virtual screens anywhere.\n\nI think the value prop was actually fair for organizations to provision to executives.",
                  "score": 0,
                  "created_utc": 1735775092.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4wb86a",
              "author": "jerkface6000",
              "body": "I know an Apple fanboy with a net worth north of $10M and even he has gone “uhhh no” to getting one",
              "score": 14,
              "created_utc": 1735762208.0,
              "replies": [
                {
                  "id": "m4zf15o",
                  "author": "Caffeine_Monster",
                  "body": "There was still a crazy number of casual non dev people (both inside and outside vr community) talking about getting one through.\n\nI wonder how long before they drop software / tool support for it?",
                  "score": 1,
                  "created_utc": 1735808355.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4w7a5a",
              "author": "Fedoraus",
              "body": "I don't really think they are wanting to compete with the quest though. They are trying to create an actual virtual replacement to your PC altogether but it was no where near ready.\n\nIt had the same processor as the highest end macbook pro at the time iirc. So at the very least I'd expect it to be between the price of a maxed out Ipad and a macbook pro. Whereas the quest 3 is like a mid end phone in terms of specs. \n\nI just don't think there's enough of a demand for what apple's selling yet even if priced well.",
              "score": 9,
              "created_utc": 1735760917.0,
              "replies": [
                {
                  "id": "m4wied2",
                  "author": "HaMMeReD",
                  "body": "On the CPU thing, it's a good point. And when they did that they should have been ready to refresh it yearly like they do in the mb's and ipads out there. Then at least they'd look committed to the product. Now it just looks old with it's M2.",
                  "score": 6,
                  "created_utc": 1735764534.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4w6ps0",
              "author": "FlyingBishop",
              "body": "It *might* have been an okay price point if they had made any effort to provide compatability with existing games. The fact that BeatSaber didn't work at launch... (The way they're insistent on hand tracking reminds me of Elon Musk insisting lidar/radar are unnecessary and FSD can just use cameras.)\n\nExcept the cameras cost nothing and they could've just provided compatability with Index/Quest controllers and not provided any first-party ones. Would have cost them basically nothing and they could've had access to existing gaming titles which would have at least doubled the use cases for the headset.",
              "score": 12,
              "created_utc": 1735760730.0,
              "replies": [
                {
                  "id": "m4whu2k",
                  "author": "accidentlife",
                  "body": "And you know what’s ironic: apple sells the best hand tracking remote ever. It’s called the Apple Watch.",
                  "score": 8,
                  "created_utc": 1735764351.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4wjytw",
              "author": "wuhkay",
              "body": "Yeah, I think if they had done $700-900 it would have been much better.",
              "score": 4,
              "created_utc": 1735765041.0,
              "replies": [
                {
                  "id": "m4xau63",
                  "author": "kibblerz",
                  "body": "The 4k micro oldest alone cost 1800 to manufacture because it's rather new tech and the manufacturing process has a 50% failure rate.. \n\nIt was never intended to be a mass market device, it was intended to push the envelope of what VR can do, and it succeeded.",
                  "score": 1,
                  "created_utc": 1735773737.0,
                  "replies": [
                    {
                      "id": "m4z2kqj",
                      "author": "Radulno",
                      "body": "Did it? What can this device do than all other headsets can't?",
                      "score": 6,
                      "created_utc": 1735800294.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4w3b7h",
              "author": "Stonebeast1",
              "body": "That’s a business expense Pricepoint not consumer imo compared to the competition",
              "score": 2,
              "created_utc": 1735759629.0,
              "replies": []
            },
            {
              "id": "m4wus7r",
              "author": "elriggo44",
              "body": "They legit thought it would be “for work”",
              "score": 2,
              "created_utc": 1735768392.0,
              "replies": []
            },
            {
              "id": "m4w4x1g",
              "author": "Fit_Specific8276",
              "body": "i fully believe that this is made for developers more than anything so that when they release a consumer model at a somewhat more reasonable price, it will actually have content",
              "score": 6,
              "created_utc": 1735760145.0,
              "replies": [
                {
                  "id": "m4wglk5",
                  "author": "HaMMeReD",
                  "body": "As a developer, Apple should have outlined that plan so that developers could manage their risk tolerance.\n\nIf you were a dev would you spend $3,500 up front (+ all your mac station expenses) so that you could have an opportunity to build for something not even knowing if there is a roadmap?\n\nLike yeah, apple might be doing this, but we don't know, so $3,500 is a lot. If they had announced the next version in 6mo or 1yr or whatever and the price point, a lot more developers would buy the $3,500 version knowing they have a 1 yr window to get their stuff to market for the masses.\n\nInstead, without a roadmap we are stuck with a chicken and egg scenario. Developers want users, users need developers. So developers sit and wait to see if a user base is being established, and potential users sit and wait for experiences that are worth it.",
                  "score": 8,
                  "created_utc": 1735763951.0,
                  "replies": []
                },
                {
                  "id": "m4whqwn",
                  "author": "HaMMeReD",
                  "body": "Without Apple announcing a clear roadmap, developers are just going to wait for that next version.\n\nThe \"for developers\" think doesn't work unless developers are also looped into the goals and details of the ecosystem and believe that their investment will have a clear path to ROI.   \n  \nDeveloping for a product that hasn't even been announced is incredibly high risk, and likely for very limited reward. It'd take a very special person to do that, instead of just you know, making a quest or pcvr experience, maybe with a consideration of using unity/unreal so you can maybe target AVP some time in the future.",
                  "score": 8,
                  "created_utc": 1735764323.0,
                  "replies": []
                },
                {
                  "id": "m4wia34",
                  "author": "PhilConnersWPBH-TV",
                  "body": "lol, what? Why would Apple keep it secret? Releasing a crazy expensive product that no one bought in order to get devs to support the next product... That makes no sense.",
                  "score": 1,
                  "created_utc": 1735764496.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4wjzpo",
              "author": "elton_john_lennon",
              "body": "> Apple really thought $3500 was a good price point to enter the market.\n\nIt's not about the price, people can justify the price when there are good ways to use the device. \n\nProblem is - there weren't. To the extent AVP is an entertainment device (personal mobile theatre etc), Meta gives you better bang for buck, and to the extent AVP is a productivity device, it doesn't actually provide anything new or groundbreaking. Just floating displays, nothing more, whatever you can do in the goggles you can do on a flat screen. \n\nI was really hoping for them to have some killer app ao killer usecase, but sadly the f-cked it badly and didn't even have some regular apps you'd expect them to have on launch day like popular streaming.",
              "score": 3,
              "created_utc": 1735765049.0,
              "replies": [
                {
                  "id": "m4zhjve",
                  "author": "nagi603",
                  "body": "> It's not about the price, people can justify the price when there are good ways to use the device. \n\nIt would have to be at least twice as useful as the average users' smartphone for that. For most, especially non-US rich gadget minded, the difference is even bigger. Hell, 5-10x as useful as an actual display, unless you are, again, rich AF and have a $3k display.",
                  "score": 1,
                  "created_utc": 1735810042.0,
                  "replies": []
                },
                {
                  "id": "m4xbfew",
                  "author": "kibblerz",
                  "body": "Well the mac virtual display can simulate a dual 4k ultrawide display, which a display like that costs atleast $2000. And it's portable. \n\nYou can also play PCVR through ALVR,  though if you want to experience the benefits of the 4k microoleds, you need a beefy PC. \n\nMy 4080 gets pushed to the max with VR on the vision, but it looks far superior to what the quest is capable of.",
                  "score": 0,
                  "created_utc": 1735773936.0,
                  "replies": [
                    {
                      "id": "m4y2yzc",
                      "author": "thedanyes",
                      "body": "Can emulate as many pixels as you want, as long as you're willing to turn your head. but effective DPI still sucks compared to a typical PC monitor. According to this guy, equivalent to a 28\" 1080p screen at typical viewing distance which is similar DPI as if you put a 55\" UHD TV on your desk:\nhttps://gigazine.net/gsc_news/en/20240519-apple-vision-pro-meta-quest-3-effective-resolution/",
                      "score": 3,
                      "created_utc": 1735783855.0,
                      "replies": [
                        {
                          "id": "m4y3xef",
                          "author": "kibblerz",
                          "body": "I have a vision pro, and I use the virtual mac screen often. It certainly looks 4k. The virtual monitor that was originally released looked closer to 1440p, but after the recent ultrawide updat in November, it looks great and truly looks 4k.\n\nThe 4k ultrawide can fit into the FOV without turning your head. If you want the dual 4k, you'll need to turn your head though.\n\n  If you have dual ultrawide monitors, you'll gonna be moving your head some regardless lol.",
                          "score": 1,
                          "created_utc": 1735784227.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4wno4e",
              "author": "Deltahotel_",
              "body": "Their advertising also wasn’t great in my opinion. I feel like if you’re going to create a product that nobody really asked for, you should try pretty hard to give people a reason to want it and help them to understand what it’s capable of. I never went out of my way to find out what it does or what the point of it was and probably most people felt the same way especially at $3500.",
              "score": 1,
              "created_utc": 1735766230.0,
              "replies": []
            },
            {
              "id": "m4xa80i",
              "author": "bogglingsnog",
              "body": "They probably had plans to release a machined aluminum headset stand for $999.",
              "score": 1,
              "created_utc": 1735773535.0,
              "replies": []
            },
            {
              "id": "m4xlvvv",
              "author": "puffferfish",
              "body": "In reality the Apple Vision Pro is a beta test. The wealthy or very devout Apple users are the testers. I think they will spend the next year or 2 developing capabilities and specialty apps. After all of this they will release a non-pro version alongside an updated pro version.",
              "score": 1,
              "created_utc": 1735777643.0,
              "replies": []
            },
            {
              "id": "m4xte8x",
              "author": "Gregus1032",
              "body": "Yea, I've been thinking about getting a VR set for me and the kids this summer. Meta seems to be the consensus top pick. Was just hoping to avoid giving my money to Facebook.",
              "score": 1,
              "created_utc": 1735780298.0,
              "replies": []
            },
            {
              "id": "m4ye33d",
              "author": "nexusjuan",
              "body": "I got my kid the 3s for Christmas. He loves it. I had it to play with for a few days before I gave it to him. I loaded it up with games, it's a lot of fun actually. You can play Steam games on it and non-steam games through Steam-VR. I've played Skyrim VR, a janky broken GTA V VR, Job Simulator, a knock off of Job simulator in a diner that was better, Tentacular was great, Beat Labs a really good Beat Sabre knock off, and a whole bunch of games I'm pretty sure were ported directly from Roblox. I'm considering getting myself one, I had a peak at some special interest VR videos while I had it that were an exceptional experience. I prefer gaming on PC the last console I bought was a 360.",
              "score": 1,
              "created_utc": 1735788273.0,
              "replies": []
            },
            {
              "id": "m4zg310",
              "author": "nagi603",
              "body": "Despite being over-engineered, badly, UX designed badly, priced badly, supported badly... 9to5 still selected it as product of the year, over the mac mini. Just 2 days ago.\n\nIf nothing, it shows just how much Apple relies on hype.",
              "score": 1,
              "created_utc": 1735809058.0,
              "replies": []
            },
            {
              "id": "m4zw3lz",
              "author": "sXyphos",
              "body": "What do you mean? That's Apple logic for everything, they sold/are selling? a monitor stand for 1000$...\n\nIf anything they're shocked the dumb sheep didn't gulp this like all their other bullshit...",
              "score": 1,
              "created_utc": 1735819142.0,
              "replies": []
            },
            {
              "id": "m52fz7f",
              "author": "Taki_Minase",
              "body": "The reality distortion field failed some time ago.",
              "score": 1,
              "created_utc": 1735850758.0,
              "replies": []
            },
            {
              "id": "m5642g1",
              "author": "Bob_The_Bandit",
              "body": "I own a a quest 3 and tested out the Vision Pro and I can’t begin the describe how miles ahead the VP is. It’s insane how clear the pass through is. It’s just not 7x better, but it’s 7x more expensive.",
              "score": 1,
              "created_utc": 1735905222.0,
              "replies": []
            },
            {
              "id": "m4w1wts",
              "author": "None",
              "body": "[deleted]",
              "score": 2,
              "created_utc": 1735759183.0,
              "replies": [
                {
                  "id": "m4w9a9b",
                  "author": "Crintor",
                  "body": "Where is that metric sourced from? I'm curious, and doubtful.",
                  "score": 3,
                  "created_utc": 1735761570.0,
                  "replies": [
                    {
                      "id": "m4we33w",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1735763135.0,
                      "replies": [
                        {
                          "id": "m4wfhnx",
                          "author": "Crintor",
                          "body": "I'm rather confused about their exact meaning in the article, they refer to market share but keep talking about specifically 2024 sales.\n\nIs this supposed to represent 5% of all VR sold since ~2016 or 5% of what sold in 2024?\n\nI would be wildly surprised if only 9.6mil VR headsets have sold in 8 years.\n\nApple making up 5% of 2024 sales sounds completely reasonable. Apple making up 5% of all headsets in 8 years at 3500$ a pop sounds wildly unrealistic.",
                          "score": 2,
                          "created_utc": 1735763597.0,
                          "replies": [
                            {
                              "id": "m4wfur8",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 1,
                              "created_utc": 1735763715.0,
                              "replies": [
                                {
                                  "id": "m4wg4sb",
                                  "author": "Crintor",
                                  "body": "I mean sure, but that's what I was trying to clarify.\n\n5% of 2024 sales would put apple at more likely something like 0.8-1.5% market share.\n\nStill an achievement, but accuracy matters.",
                                  "score": 3,
                                  "created_utc": 1735763803.0,
                                  "replies": [
                                    {
                                      "id": "m4wh441",
                                      "author": "parasubvert",
                                      "body": "Market share can be by revenue, not just units",
                                      "score": 0,
                                      "created_utc": 1735764117.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m4uues5",
          "author": "jzr171",
          "body": "Did they not let you play a terrible iPhone game with weird pinch controls? Lol this thing was awful for games.",
          "score": 65,
          "created_utc": 1735744503.0,
          "replies": []
        },
        {
          "id": "m4uwyfr",
          "author": "classicnikk",
          "body": "I got a quest 3 for Christmas and it’s pretty crazy how much content is available on it. Tons of games and apps",
          "score": 63,
          "created_utc": 1735745485.0,
          "replies": [
            {
              "id": "m4vfj38",
              "author": "opeth10657",
              "body": "They're doing a pretty good job just adding video content too.  The nature videos are pretty good, and they had a bunch of city tours too.",
              "score": 28,
              "created_utc": 1735751986.0,
              "replies": [
                {
                  "id": "m4vubd5",
                  "author": "Automatic-Scene5621",
                  "body": "Forgive me, old man here, but can you watch YouTube/YouTubeTV on it?",
                  "score": 6,
                  "created_utc": 1735756773.0,
                  "replies": [
                    {
                      "id": "m4vybkk",
                      "author": "BadCrazy_Boy",
                      "body": "Yes, there is a native app or you can use the browser to watch. There are even some VR videos uploaded on youtube that you can watch",
                      "score": 4,
                      "created_utc": 1735758032.0,
                      "replies": [
                        {
                          "id": "m4vzr3h",
                          "author": "ATLfalcons27",
                          "body": "Is it actually enjoyable watching stuff on their compared to a tv? Have always wanted to try watching sports on it",
                          "score": 1,
                          "created_utc": 1735758489.0,
                          "replies": [
                            {
                              "id": "m4x1f58",
                              "author": "LARGames",
                              "body": "You can make your virtual \"TV\" as big as you want. From a small screen floating in front of you to the size of a movie screen.",
                              "score": 1,
                              "created_utc": 1735770558.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m53ohjm",
                      "author": "onecoolcrudedude",
                      "body": "yes but the default facial interface and headstrap aint that good, and the battery only lasts like 2 hours, same as vision pro. if you want a good experience you're gonna have to pay slightly more for a better aftermarket soft facial pad, as well as a more comfortable strap design. lots of them come with battery packs too, to extend the battery time.",
                      "score": 1,
                      "created_utc": 1735864381.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4vwayh",
              "author": "sersoniko",
              "body": "Me too, I also suggest installing SideQuest, F-Droid, Aurora Store and Lighting Launcher or QGC. With this you will have an incredible selection",
              "score": 8,
              "created_utc": 1735757395.0,
              "replies": []
            },
            {
              "id": "m4vu8zq",
              "author": "darthvuder",
              "body": "Try Netflix on browser. Insane resolution",
              "score": 2,
              "created_utc": 1735756752.0,
              "replies": [
                {
                  "id": "m4zq9re",
                  "author": "WellYoureWrongThere",
                  "body": "But the actual resolution will mostly be 1080p or 4k (for the limited content that has it), assuming you have that subscription, as that's what the content is.\n\nHow's that insane?",
                  "score": 1,
                  "created_utc": 1735815704.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4w16sj",
              "author": "denM_chickN",
              "body": "Using Luke Ross VR? It's got so many titles ",
              "score": 1,
              "created_utc": 1735758948.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m4v44ds",
          "author": "Automate_This_66",
          "body": "If only there were some way they could have known /s",
          "score": 17,
          "created_utc": 1735748100.0,
          "replies": []
        },
        {
          "id": "m4vgmxv",
          "author": "Iluvembig",
          "body": "Right? Apples walled garden is cool and all, but at least macOS allows for external development.",
          "score": 6,
          "created_utc": 1735752353.0,
          "replies": []
        },
        {
          "id": "m4v983m",
          "author": "hi_im_new_to_this",
          "body": "I really wish Apple would continue developing Vision. The initial price is far to high for normal people, but given two-three generations more, I would absolutely consider ine of these things. First VR thing that I’ve seen that makes sense to me",
          "score": 9,
          "created_utc": 1735749871.0,
          "replies": [
            {
              "id": "m4v9xne",
              "author": "deevandiacle",
              "body": "It was well marketed but the market was not there for a 3.5k headset. The external battery felt very weird to me. \n\nThe quest 3 is so close in functionality, and tracking. It just needs to get pass through a little better in the next rev and it will catch up for a much lower price point.",
              "score": 20,
              "created_utc": 1735750113.0,
              "replies": [
                {
                  "id": "m4x45pr",
                  "author": "fuck_the_fuckin_mods",
                  "body": "It’s going to have enough power to run the Adobe suite and automatically and seamlessly integrate with all my other devices? Cuz that’s what was cool about the Vision Pro. The idea is basically just a MacBook Pro but in VR headset form. That’s what was interesting about it. They were/are looking at a very different market from the average VR gamer.",
                  "score": -2,
                  "created_utc": 1735771482.0,
                  "replies": [
                    {
                      "id": "m4x6ukx",
                      "author": "deevandiacle",
                      "body": "Why does it have to? Just be a peripheral not a whole computer. You can connect to windows desktops on it.",
                      "score": 5,
                      "created_utc": 1735772399.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4wljzr",
              "author": "Flat-Photograph8483",
              "body": "Yeah I wish people knew how much comparable tech that isn’t even Apple quality goes for. Also it wasn’t really meant for games. I don’t think there is enough money in it. They were reaching for a screen replacing / the entire room is your workspace market. I mean makes more sense than a watch to me. If I had the money I would definitely buy one for plane trips alone.",
              "score": 2,
              "created_utc": 1735765561.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m4vzgmz",
          "author": "ATLfalcons27",
          "body": "Do you think you could enjoy watching anything that is like 2 hours long on it given the weight?",
          "score": 1,
          "created_utc": 1735758395.0,
          "replies": []
        },
        {
          "id": "m4wc3em",
          "author": "YujiroRapeVictim",
          "body": "The subreddit says otherwise. They keep trying to justify it lol.",
          "score": 1,
          "created_utc": 1735762494.0,
          "replies": []
        },
        {
          "id": "m4wt7xu",
          "author": "TURBINEFABRIK74",
          "body": "My biggest concern was the apple guy answering to the question “ is there any software/ tool available to build up an immersive video on my own  or is it going to be clunky and backlash?”\n\nHe just said “ it’s too early”, maybe too honest but let’s face it… he’s right, customers that aren’t experienced digital developers + use 8k cameras will just struggle to use it for business purposes",
          "score": 1,
          "created_utc": 1735767943.0,
          "replies": []
        },
        {
          "id": "m4x7crz",
          "author": "ContemptAndHumble",
          "body": "After the demo I went and got a Meta quest. Literally more usable and games and stuff than the Vision Pro which would be a better movie watching experience but that's it.",
          "score": 1,
          "created_utc": 1735772574.0,
          "replies": []
        },
        {
          "id": "m4xjmwl",
          "author": "taizzle71",
          "body": "I couldn't even do that. There was one sitting in plain sight guarded by a single apple worker. I went up to it excited to see what the whole fuss was about. He said I needed to sign up online and wait until I get an invitation back to try it out. The store was empty, and not one person was testing it, though.",
          "score": 1,
          "created_utc": 1735776845.0,
          "replies": []
        },
        {
          "id": "m4xxt5u",
          "author": "CMDR_KingErvin",
          "body": "I didn’t realize just how many of the same features my Quest 3 has at a fraction of the price. 7x the cost for slightly better graphics is not the selling point they thought it was. Plus it’s so much heavier and bulkier that it becomes truly uncomfortable for extended use. I was starting to get a headache just after the 20 min demo. That glass screen really adds nothing to the experience, only cost and weight.",
          "score": 1,
          "created_utc": 1735781903.0,
          "replies": []
        },
        {
          "id": "m4yc39h",
          "author": "Fredasa",
          "body": "Its failure is only disappointing in the sense that a high-profile, prosumer VR product was exactly what the market needed to boost the speed at which VR with tolerably good resolution reaches consumer prices.  It'll still get there, eventually.  Just gonna take longer than I was hoping.",
          "score": 1,
          "created_utc": 1735787449.0,
          "replies": []
        },
        {
          "id": "m50fztp",
          "author": "SirEDCaLot",
          "body": "Exactly.  I did the same.  Absolutely beautiful tech.  The augmented reality function is spot on.  \n\nUnfortunately $3500 is unapproachable for anything that isn't a MUST have device.  If there was content for it I'd consider it, but there isn't so the only real use is if I want to 'escape to the beach' or if I want to try and be productive in the virtual desktop environment.  But the virtual desktop was too limiting (I get more functionality with my PC and 3 monitors).",
          "score": 1,
          "created_utc": 1735828100.0,
          "replies": []
        },
        {
          "id": "m4vhn9q",
          "author": "VeganCanary",
          "body": "If the rumours are true about PSVR2 Controller support, then that opens up a lot more games options.\n\nThe device is powerful enough to run every game that the Quest does. \n\nBut still way too expensive compared to PSVR2 or Meta Quest.",
          "score": 1,
          "created_utc": 1735752691.0,
          "replies": []
        },
        {
          "id": "m4xqz2v",
          "author": "ChaseballBat",
          "body": "People on this sub defended it tooth and nail... Wonder what they will say now?",
          "score": 0,
          "created_utc": 1735779437.0,
          "replies": []
        },
        {
          "id": "m4wex0f",
          "author": "-ry-an",
          "body": "Apple thinks they're Midas, but really, they were just first to market with touch screens. I've seen very little meaningfully innovation from them hardware wise....just innovation on how to sell consumers overpriced tech..",
          "score": 0,
          "created_utc": 1735763408.0,
          "replies": [
            {
              "id": "m5637to",
              "author": "ddark4",
              "body": "In my opinion, the first truly successful mass market touchscreen products were the Nintendo DS and DS Lite. As far as smartphones phones go, though, Apple was obviously first. \n\nI assume phones were what you were saying anyway, but just think it’s interesting to point out that Nintendo was years earlier to the touch generation/easy input for casuals craze.",
              "score": 1,
              "created_utc": 1735904763.0,
              "replies": [
                {
                  "id": "m565qpi",
                  "author": "-ry-an",
                  "body": "Wowwww I didn't know DS came out that much earlier.\nCrazy. Yes, I was referring to touchscreens relative to phones.",
                  "score": 1,
                  "created_utc": 1735906102.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m4x9q5f",
          "author": "kibblerz",
          "body": "While the app store is indeed lacking, the virtual mac display alone simulated a dual 4k ultrawide display, with the best quality of text legibility I've seen on any VR desktop. Similar dual 4k ultrawide displays run for atleast 2k.\n\nIt also supports PC VR through ALVR. Playing 4k PCVR is pretty tight. Of course you need a pretty pricey gaming PC to run PCVR games at 4k resolution. I have a 4080, and it gets pushed to the max when using my vision pro lol, especially with VR chat 😂\n\nI use Nintendo joycons as the controllers, and they work pretty good. Tracking is done via hand tracking on ALVR, while the buttons on the joycons function as normal inputs. Definitely could use actual VR controllers though, but I've heard of people getting index controllers + base stations working with it",
          "score": 0,
          "created_utc": 1735773374.0,
          "replies": []
        },
        {
          "id": "m4v05rl",
          "author": "Codipotent",
          "body": "I mean, this is just disingenuous. Vision Pro has quite a few immersive and VR games at this point - Synth Riders, Warped Kart Racers, City Scapes, Job Simulator to name a few of the more impressive ones. \n\nApple also has quite a few immersive shows. One for wildlife, one for adventures, one for concerts, a few for watching sports games. Each have about 2-3 episodes so far and they seem to be continually releasing new episodes, a new one on ice diving was just released a week ago. Tons of 3D movies, by far Vision Pro is the best 3D experience I’ve ever had.\n\nGranted there is less content than competing headsets, but to say there is no content is a complete lie.\n\nAs someone who had HTC Vive and multiple variations of the Meta Quest, I definitely prefer the Vision Pro as its screen quality is not comparable to any of the others. I would never watch a show or movie in the Vive or Quest, but prefer to watch movies on the Vision Pro. The quality surpasses a theater, it’s incredible.",
          "score": -34,
          "created_utc": 1735746672.0,
          "replies": [
            {
              "id": "m4v0zkf",
              "author": "ErGo404",
              "body": "If those are the most impressive ones, it's like saying there's no content, especially for the price point.",
              "score": 28,
              "created_utc": 1735746972.0,
              "replies": [
                {
                  "id": "m4v1djl",
                  "author": "Codipotent",
                  "body": "> By choosing your top 5 games out of the hundreds available, that’s like saying there’s no content\n\n\nMaybe focus on some linguistic studies because the two statements are in no way comparable.",
                  "score": -39,
                  "created_utc": 1735747111.0,
                  "replies": [
                    {
                      "id": "m4v1t7i",
                      "author": "ErGo404",
                      "body": "Why are you so aggressive?\n\nI know the games and I repeat myself, if those are the most impressive then I guess there are 10 more games that are okay ish and the hundred others are dog shit.\nQuantity does not mean quality. Who would spend 3500 dollars for that ?\n\nNow that the device is not being produced anymore, good luck finding devs willing to continue spending money on producing content for the device.",
                      "score": 19,
                      "created_utc": 1735747269.0,
                      "replies": [
                        {
                          "id": "m4v2f6s",
                          "author": "PooForThePooGod",
                          "body": "They dropped $3500+ and are trying to mentally justify this",
                          "score": 29,
                          "created_utc": 1735747487.0,
                          "replies": [
                            {
                              "id": "m4v440k",
                              "author": "Codipotent",
                              "body": "I make $500k a year I don’t have to justify a $4k purchase 😂",
                              "score": -38,
                              "created_utc": 1735748097.0,
                              "replies": [
                                {
                                  "id": "m4v71r3",
                                  "author": "SoulDevour",
                                  "body": "Most people *don't* make $500k a year and they *do* need to justify a $4k purchase for an entertainment device. It's all well and good that you see the value in the Vision Pro at its price point. Most people need to compare it with a couple months of rent/mortgage (and possibly less than a couple months) while on a yearly salary of $60k-$100k. A couple dozen unique experiences is going to be a very hard sell.",
                                  "score": 15,
                                  "created_utc": 1735749127.0,
                                  "replies": [
                                    {
                                      "id": "m4v7eyf",
                                      "author": "Codipotent",
                                      "body": "For sure. Price point is a different discussion altogether, and most definitely a huge barrier for most. I have been responding to this thread because everyone kept saying “no content”, which was the thorn in my side. At release there was no content, but it’s come a long way since.",
                                      "score": 0,
                                      "created_utc": 1735749253.0,
                                      "replies": [
                                        {
                                          "id": "m4vji2z",
                                          "author": "harmonicrain",
                                          "body": "\"not enough content to justify the price tag\"\nThere i reworded it, better?",
                                          "score": 8,
                                          "created_utc": 1735753309.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "m4v4dbr",
                                  "author": "PooForThePooGod",
                                  "body": "r/iamverybadass",
                                  "score": 18,
                                  "created_utc": 1735748189.0,
                                  "replies": [
                                    {
                                      "id": "m4v4wqg",
                                      "author": "Codipotent",
                                      "body": "Doesn’t make me badass, just make a $3,500 device a negligible purchase.\n\nIf you didn’t want me addressing it then you could have refrained from commenting on my mentality.",
                                      "score": -14,
                                      "created_utc": 1735748379.0,
                                      "replies": [
                                        {
                                          "id": "m4vb8l4",
                                          "author": "healthcarecompanion",
                                          "body": "Average apple consumer mindset",
                                          "score": 13,
                                          "created_utc": 1735750557.0,
                                          "replies": [
                                            {
                                              "id": "m4vbjan",
                                              "author": "Codipotent",
                                              "body": "We are discussing the content offerings of Vision Pro. Personal attacks because you don’t agree with someone is irrelevant as well as quite immature.",
                                              "score": 1,
                                              "created_utc": 1735750656.0,
                                              "replies": []
                                            }
                                          ]
                                        },
                                        {
                                          "id": "m4vjdg5",
                                          "author": "harmonicrain",
                                          "body": "Bet you bought the wheels for the mac pro too back in the day amirite.",
                                          "score": 7,
                                          "created_utc": 1735753267.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m4v1wec",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 11,
                      "created_utc": 1735747300.0,
                      "replies": [
                        {
                          "id": "m4v4ioc",
                          "author": "Codipotent",
                          "body": "Pedantry would be correcting its vs it’s, or who vs whom. The nature of the statement doesn’t change with the correction, the original intent is understood.\n\nCorrecting someone’s usage of “saying there is no content” vs “saying there is little” or “saying there is much less” is not pedantic. Quite literally the two statements mean different things.\n\nBut everyone in this thread is biased, so that justifies the use of exaggerations (even though they are incorrect) because it further a more negative look on the product.",
                          "score": -7,
                          "created_utc": 1735748241.0,
                          "replies": [
                            {
                              "id": "m4vjagl",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 5,
                              "created_utc": 1735753239.0,
                              "replies": [
                                {
                                  "id": "m564o07",
                                  "author": "ddark4",
                                  "body": "Pedantry is an excessive focus on minor details and rules. Correcting you for not knowing the definition of “pedantry” is not that and it’s definitely not ironic. \n\nSo it can be as delicious and ironic as you want it to be in your head, but that would just mean that you also don’t know the definition of “irony.”",
                                  "score": 0,
                                  "created_utc": 1735905540.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m4v3ovi",
                      "author": "bgarza18",
                      "body": "This is the most Reddit shit lol, stop it",
                      "score": 2,
                      "created_utc": 1735747942.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4v2a9z",
              "author": "i_max2k2",
              "body": "Does the Vision Pro have a player which can stream 3D Media files over network and display them?",
              "score": 2,
              "created_utc": 1735747439.0,
              "replies": [
                {
                  "id": "m4v6lmj",
                  "author": "Codipotent",
                  "body": "Yes, actually a few 3D Player options. Moon Player is one and it supports a few streaming protocols in addition to downloading your files directly to the device and watching from there.",
                  "score": 3,
                  "created_utc": 1735748972.0,
                  "replies": [
                    {
                      "id": "m4vs8nz",
                      "author": "Luciferianbutthole",
                      "body": "I’m reading through these comments and I want you to know there are people who agree with you. I think responding negatively is just more compelling to reddit users. A person with a positive thing to say might be too lazy to type it out, I know I usually am. \n\nYou’re right in defending your viewpoint.",
                      "score": 2,
                      "created_utc": 1735756121.0,
                      "replies": [
                        {
                          "id": "m4vv7x7",
                          "author": "Codipotent",
                          "body": "Thank you!",
                          "score": 2,
                          "created_utc": 1735757055.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m4vewfq",
                  "author": "KyleMcMahon",
                  "body": "Yes and in fact 3D movies are able to be watched natively (eg ones that were released in theaters in 3D)",
                  "score": 3,
                  "created_utc": 1735751778.0,
                  "replies": [
                    {
                      "id": "m4vhcsj",
                      "author": "i_max2k2",
                      "body": "3D MVC based blu ray rips?",
                      "score": 1,
                      "created_utc": 1735752594.0,
                      "replies": [
                        {
                          "id": "m4whpy0",
                          "author": "parasubvert",
                          "body": "Yes, or via Apple TV or Disney+",
                          "score": 2,
                          "created_utc": 1735764314.0,
                          "replies": [
                            {
                              "id": "m4ysn0m",
                              "author": "KyleMcMahon",
                              "body": "Or iTunes",
                              "score": 1,
                              "created_utc": 1735794858.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m4uyotu",
          "author": "SoSKatan",
          "body": "Not sure what you mean by no content.\n\nIt’s like saying the Apple TV has no content.\n\nAs an owner of one, it’s completely changed how i watch movies / shows.\n\nWhile the immersive video stuff is high quality, that’s not its primary function.\n\nI just see the unit as a high quality universal screen that you can place anywhere.  \n\nIt’s far better than any TV, or monitor I’ve ever seen and it works great for also playing ps5 and pc games.\n\nSo I find your comment confusing, it’s complaining that hd TV’s don’t have any content.  Wtf?\n\nSure the AVP can do more than show virtual screens in the air, but that is its primary function.\n\nApple’s own marketing has shown as something to watch movies on.\n\n99% of what I use it for are just the following apps: Apple TV, Max, Disney+, web browser (which also covers Netflix, etc)\n\nThe device has literally more content than I can consume in a lifetime with just four apps.",
          "score": -38,
          "created_utc": 1735746129.0,
          "replies": [
            {
              "id": "m4v2gbj",
              "author": "ThatLaloBoy",
              "body": ">It’s far better than any TV or monitor I’ve ever seen\n\nI mean, if the Vision Pro works for you, that’s great. But for $4K, you can absolutely get a stunning high quality OLED TV with an amazing 7.1 sound system.",
              "score": 28,
              "created_utc": 1735747498.0,
              "replies": [
                {
                  "id": "m4v3qq4",
                  "author": "SoSKatan",
                  "body": "The AVP has replaced my home theatre.\n\nYou are correct, you can buy an amazing TV for $4K\n\nWhat you can’t buy is an amazing TV that you can place on any wall any time and take with you in your back pack.\n\nIf there was such a device on the market, I would pay $4K for it.\n\nSure the AVP’s will get cheaper over time (just like everything else) and other similar devices will come out.\n\nThe quest 3 isn’t a TV replacement like the AVP is, but I’m sure they will get there soon.",
                  "score": -15,
                  "created_utc": 1735747961.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4uzm13",
              "author": "Mayberley",
              "body": "Compared to the quest though, it does feel bare. Quest can do all of the TV/movie stuff but it also has loads of games and apps specifically for the device/VR",
              "score": 14,
              "created_utc": 1735746471.0,
              "replies": [
                {
                  "id": "m4v1o9r",
                  "author": "SoSKatan",
                  "body": "The quest 3’s video quality isn’t better than most screens, the AVP is.\n\nDon’t get me wrong, I love my quest 3.  I use it for lots of things, but I use more AVP more.\n\nIt’s like comparing an iPhone to a Nintendo Switch.  At the basic level, they are very similar (high def screen, arm cpu, network connectivity, etc, etc)\n\nBut they are very different products with very different use cases.  I wouldn’t even say the two devices are compete against each other.\n\nI use my AVP more than my Quest 3 because well I watch more shows / movies than I play fully immersive games.\n\nI also love my Nintendo switch, but u use my iPhone far more.\n\nImagine someone trying to make the argument that the iPhone doesn’t have any content and people should just get a switch instead.\n\nAlso I’m not sure why I’m getting downvoted.\n\nAm I not supposed to provide first hand experience with the AVP?\n\nOn a daily basis, I use my AVP more than my quest 3.  But I guess it has “no content”?",
                  "score": -15,
                  "created_utc": 1735747218.0,
                  "replies": [
                    {
                      "id": "m4vbxp6",
                      "author": "joomla00",
                      "body": "It's cool that you can afford 4k for a personal media viewer, but I imagine that market is very, very, very small.  Most people buy a vr device, to you know, do vr stuff.  Whete it lacks content. And have a $200 tablet or tv for media consumption.",
                      "score": 13,
                      "created_utc": 1735750789.0,
                      "replies": [
                        {
                          "id": "m4vfovb",
                          "author": "SoSKatan",
                          "body": "I personally like the fact that there are different options.\n\nWould you prefer it if the AVP just didn’t exist?\n\nI’d argue that most people spend far more than $4K for movie / show watching when you factor in the cost of having a dedicated room right?\n\nA hundred years ago people use to have a dedicated room for listening to the radio, because radios were large and expensive.\n\nAs soon as they became portable, people no longer needed radio rooms.\n\nLook the AVP will come down is price over time, other companies will make similar quality products which will also lower the cost.\n\nBut at its current price and feature set, the AVP is worth it if you are the type of person who has a home theater.\n\nIt seems like you (and others) and hung up on the idea that such consumer electronic device exists at that price point.\n\nWhich seems silly compared to the automotive market.  It’s like trying to make the argument that Lamborghini’s shouldn’t exist, and everyone should just buy a pruis.\n\nI personally don’t think Lamborghinis are worth the money, but I’m glad they exist and are an option.\n\nWhich is also interesting, people here don’t bat an eye at high end vehicles markets existing, but a 4k high end headset existing is a “bad thing”, right?",
                          "score": -2,
                          "created_utc": 1735752039.0,
                          "replies": [
                            {
                              "id": "m4vooby",
                              "author": "joomla00",
                              "body": "You keep missing the point but ok.  No one is slamming you for your purchase, and your personal justifications for it.  Everyone is happy it works for you, and you find the price acceptable.  But It's designed as a vr device, the general population was expecting a revolutionary vr device,  and it's lacking as a vr device. The best use case you're presenting is for it to be a very high end media consumption device.  Which is great for the handful of you guys out there that were looking for, but disappointing to everyone else, especially at it's price point.  It's a dead product as-is.\n\nAnd as a home theater guy myself, a big part of the experience being able to share it with others. The best part is talking about a movie or show, and someone goes, we gotta watch it in the theater room.  And everyone smiling and having a good time sharing a visceral experience that only a proper home theater system can bring.  It's a completely different experience than a ht on your head solution.",
                              "score": 7,
                              "created_utc": 1735754983.0,
                              "replies": [
                                {
                                  "id": "m4vsowt",
                                  "author": "SoSKatan",
                                  "body": "Just stop and look at how many down votes I got for simply making the case that it’s very good at one thing, movie / show watching and that because of that I use it more than my Q3.\n\nThen look at how much the comments are upvoted claiming it has no content and it’s a paper weight.\n\nMost likely made by people who haven’t used the AVP more than 5 minutes.\n\nInteresting right?\n\nIt’s like people are legit mad the device even exists in the market at all.\n\nDo I wish the AVP was cheaper or had exclusive games?  Of course I do, but that doesn’t detract from the value I’m already getting from it.\n\nI do think expectations were given both the cost and it being Apple, and VR’s existing market being gaming.\n\nSo it’s like wtf is this thing?\n\nLook all I can offer is first hand experience.  The movie watching is so good, I prefer watching stuff on it, even if I’m sitting on my couch in front of my TV.\n\nI like how I can have that same experience reclined in bed at night, or take it on a plane.\n\nThe device didn’t meet my prior VR expectations, but it far exceeded the movie / show part.  So much so that it quickly changed my movie / show watching routine.\n\nI’m a gamer, and a VR enthusiast, but the AVP made me realize that I consume more movies / shows than I do VR games.\n\nAfter owning the AVP, my headset usage went up by a factor of 5.  Simply because it was better at doing something that I already did.\n\nLook if you are a home theatre guy, you might find this thread (or others) insightful.\n\nhttps://www.reddit.com/r/VisionPro/s/zmrHnkP6me\n\nGiven the costs of his other home theater, the AVP is on the cheaper side of his devices.\n\nBut the weird thing is the same people who are hate the idea of a high end headset existing have no problem that there is a high end theater market.\n\nInteresting right?",
                                  "score": 2,
                                  "created_utc": 1735756264.0,
                                  "replies": [
                                    {
                                      "id": "m4vwiqp",
                                      "author": "joomla00",
                                      "body": "Bruh you're talking in circles and keep missing the point.  If the best case for it is a personal home theater system, the device is a failure (aside from the handful of people like you) because its suppose to be a revolutionary vr device.  As a vr device, it's lacking content.  99% of people arnt looking at this to buy this just to watch stuff, they're expecting a revolutionary experience.  As presented by apple, and expected by its executives and investors.\n\nIm not going to keep going, but I'll just put it this way.  It's like apple releasing a flying car.  But it's not that useful as a flying car because it's uses are very limited because you can only fly and park it in a hand full of places, during certain weather conditions.  But it's the best one seater car ever built.  Great for people looking for the best one seater ever, and willing to pay 5x the cost to its nearest competitor.  Justifiably disappointing for everyone else.",
                                      "score": 3,
                                      "created_utc": 1735757463.0,
                                      "replies": [
                                        {
                                          "id": "m4vzpgf",
                                          "author": "SoSKatan",
                                          "body": "Hmm, I’ve only been mentioning the exact cost / benefit I’ve found with it.\n\nIt’s been worth it.\n\nBut I don’t think any one other than Apple fan boys thought it was going to be universal as iPhones.\n\nYes initial product, at a high entry cost is going to mean a limited market.\n\nBut people seem pissed about that.\n\nIt was never a mass market device.  There is still a potential world like that years from now but it would require a high quality + affordable product.\n\nPeople seem offended by the idea of a high end VR headset market.\n\nI imagine the product designers at Apple had been working on headsets for years and once they nailed the movie watching experience was like “we can make a product but it’s going to be expensive, or we can wait 5 years until we can make it cheap, what do we do?”\n\nAt some point I’m guessing internally they figured there might work given its movie watching experience.\n\nI’m happy with my AVP purchase and I’m glad it exists.  Without the AVP, the closest thing (for a home theatre replacement) we would have is big screen beyond, which given that it requires a PC and Steam VR trackers, the total cost is about the same as the AVP.\n\nGiven the BSB is tied to a single room makes the AVP a far better option.\n\nMaybe people are just mad that Apple released a new product that’s out of their budget.\n\nBut look, Lamborghinis aren’t in my budget, but I’m not mad at Lamborghinis for existing.\n\nI’m glad they exist.",
                                          "score": 0,
                                          "created_utc": 1735758475.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "m4vov2h",
                                  "author": "palindromesUnique",
                                  "body": "*New Reddit-wide unique palindrome found:*\r>**than a ht**\r \r ^(currently checked 70187854 comments) \\\n >!(palindrome: a word, number, phrase, or sequence of symbols that reads the same backwards as forwards) !<",
                                  "score": 1,
                                  "created_utc": 1735755044.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m4vp9ub",
                              "author": "pre-existing-notion",
                              "body": "It's because the Vision Pro was marketed as being able to do a lot more than just be a monitor, and while it has some content, a lot of it is underdeveloped. 4k is high but justifiable for a VR set of Aple quality.. however, the device isn't there yet. 4k for a nice screen when you were expecting a lot more is a big ask, and people understandably aren't a fan of it existing in this manner.",
                              "score": 3,
                              "created_utc": 1735755176.0,
                              "replies": [
                                {
                                  "id": "m4vuspi",
                                  "author": "SoSKatan",
                                  "body": "I honestly don’t think it was marketed as anything more than for content watching.  Every Apple commercial I’ve seen has just shown people watching movies / shows.\n\nPeople expected something different based on other prior VR headsets (which is reasonable.)\n\nThere is a distinct difference between what people expected versus how it’s marketed.\n\nThey did hype up the new UI scheme, and there is something to that which might highlight the future of computing UI for some use cases.\n\nBut that’s on par with what Apple did with the first Mac / Lisa and with the first iPhone.   They gave us a new more natural UI, but that’s isn’t what sold the product.\n\nIt was the overall, here is a better way at doing something you’ve already been doing.\n\nFor the AVP, that’s movie watching.  For the iPhone it was email / texting / web browser.",
                                  "score": 1,
                                  "created_utc": 1735756924.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m4v6oi6",
                      "author": "dunno0019",
                      "body": "It's probably because you keep insisting that basically every bit of video ever is now \"content\" for the AVP. \n\nBecause you know that's not what we are talking about. \n\nGreat, apple released yet another device that can play any video ever. Oh, and it also happens to do that on crisp new display technology. So, exactly par for the course with new apple tech. Awesome. \n\nNow what does it have for exclusive software that I can't get anywhere else?\n\nDon't be obtuse.",
                      "score": 14,
                      "created_utc": 1735749000.0,
                      "replies": [
                        {
                          "id": "m4vac1n",
                          "author": "SoSKatan",
                          "body": "I’m not being obtuse at all.\n\nI’m happy with my AVP purchase, even if that’s ALL it did, watch movies / computer monitor.\n\nWatching Dune 2 on the AvP was a better experience than watching it in the movie theater.\n\nThe fact that I can have that quality of a display on my couch, in my bedroom, on an airplane and take with me makes the device (for me at least) worth it.\n\nIf there was a physical TV that looked that good that I could just move easily room to room and take with me, I’d buy it.  But no such physical device exists.\n\nLike I get what you are saying, it would be nice to have exclusive content.\n\nBut I’m saying, at the end of the day it doesn’t need it to be useful.\n\nI didn’t buy an iPhone because it had exclusive content.  I bought an iPhone because it does most things I need well in a portable device.\n\nCompared to 15 years ago, smart phones are a partial computer replacement.\n\nAs soon as phone web browsing became was as good as doing it on a PC, it became a game changer.\n\nThe single most app I use on my iPhone is web browsing.  I didn’t buy my iPhone for exclusive content.  I bought it because it did things I could do elsewhere extremely well.\n\nSure the App Store is great, but the first gen iPhone didn’t have an App Store.  Its killer feature was the portable browser.\n\nThe AVP is similar, it’s a better TV than my TV.\n\nYes it’s fun to talk about what else could be done with it, but I’m happy with just that.  A home theater that I can use anywhere.\n\nSo for me it’s bizarre to see posts saying the AVP has “no content”",
                          "score": -4,
                          "created_utc": 1735750250.0,
                          "replies": [
                            {
                              "id": "m4vfj48",
                              "author": "dunno0019",
                              "body": "Dude. All these people were basically just asking you to sell them on this device.\n\nAnd the best you can come up with is: it is the best portable display available.\n\nIs it cost effective compared to other devices? Is the damn battery better? Does it weigh less? Does it have any single other feature besides \"the best portable display available\"?",
                              "score": 6,
                              "created_utc": 1735751986.0,
                              "replies": [
                                {
                                  "id": "m4virnf",
                                  "author": "SoSKatan",
                                  "body": "I’m not trying to sell any one on anything.\n\nI’m just relating my first hand experience, I’m happy with my AVP.\n\nBut to answer your question…\n\nThere is no other comparable device to the AVP on the market right now.\n\nI wish there was, but the Q3 isn’t at the quality of being a real TV replacement.  The AVP is.\n\nI’m sure we will have other options in the next few years.\n\nImage a world where the Nintendo switch came out before the iPhone.\n\n\nYou would see tons of posts from people who are like “I don’t get it, why is there an iPhone?  It’s 4 times as expensive, doesn’t have controllers or exclusive games.  It doesn’t have any content!”\n\nWhat would you think of such statements?\n\nI’m trying to highlight what’s really important.  I’m assuming you are like me, you have both a switch and a smart phone.\n\nThe two are very comparable hardware wise, are they not?\n\n99% of what I use my phone for is web browsing, messaging and email.\n\nIt does those things very very well.  So much so, that I’m happy to pay the 4x cost over a switch to use it for just that.\n\nThe AvP does movie watching very very well, and my entire point is because of that it’s a game changer.\n\nBecause of that, I use my AVP more than my quest 3, despite all of its exclusive content.\n\nI use my iPhone way more than my switch because it’s better at the things I do more often.\n\nPeople look at the AVP and look at it as a VR headset, whose existing market has mostly been gaming.  The AVP is something new, and its use case is completely different than other headsets.\n\nI understand the confusion, people only can relate to it in context of something else.\n\nThat’s why I use the TV comparison as it’s more apt.  But it’s difficult to convey the concept of a high quality TV that you can just place anywhere you want and take with you.\n\nIf a physical TV existed that was as good and as flexible and portable as the AVP, I’d pay $4K for it.",
                                  "score": -2,
                                  "created_utc": 1735753067.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4v1myu",
              "author": "fuckbrocolli",
              "body": "People say there’s no content because Apple marketed this as more than just a device to watch movies/shows…",
              "score": 7,
              "created_utc": 1735747205.0,
              "replies": [
                {
                  "id": "m4v23pl",
                  "author": "SoSKatan",
                  "body": "Can you point me to where that marketing is?  Everything I’ve seen from Apple has shown people watching movies on their couch or on a plane.",
                  "score": 1,
                  "created_utc": 1735747374.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4vyzoo",
              "author": "sethsez",
              "body": "It wasn't initially pitched as just being a personal portable screen, and taken in that context it still has the pretty massive downside of being gorgeous and sounding great for *exactly one person*. Which I suppose isn't a problem if you exclusively watch TV, movies and sports by yourself, but for a *lot* of people they consider those social activities at least some of the time and makes Apple Vision Pro a total non-starter as a home theater replacement no matter how great it is in every other respect.\n\nIt should also be mentioned that a simple TV is infinitely more *comfortable* than even the most comfortable VR/AR set, by virtue of not being strapped to any part of your body.\n\nI think it's a viable monitor replacement, but it's not a strict undeniable upgrade.",
              "score": 1,
              "created_utc": 1735758246.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m4vwhtj",
          "author": "Sneyek",
          "body": "There’s some content already. But content is not really the important thing with this headset, it’s not the features.\nMac passthrough is the killer feature here. Add this with a gaming PC at home and Moonlight OR an NVidia GeForce Now sub and you can pretty much do whatever you want wherever you want.\n\nIt’s young and lacks for sure, but it was never intended for everyone, it’s still a niche tech mostly to built hype and get feedback for a V2 which will probably be the actual consumer V1.",
          "score": -4,
          "created_utc": 1735757455.0,
          "replies": [
            {
              "id": "m4w1hvx",
              "author": "denM_chickN",
              "body": "Pass-through being a killer feature us really funny",
              "score": 3,
              "created_utc": 1735759049.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m4ums7i",
      "author": "None",
      "body": "Quite literally prohibitively expensive.\n\nIt was absurd watching people celebrate this $3,500 paperweight while looking down on the Quest 3.",
      "score": 581,
      "created_utc": 1735741305.0,
      "replies": [
        {
          "id": "m4uwqq9",
          "author": "Nikiaf",
          "body": "People were unironically calling it a total revolution in productivity. I remember so many comments from people saying how excited they were to use this for work, as if this was somehow exponentially better than two physical monitors that you didn’t have to strap to your head.\n\nVR has its place, but I think what Apple has now confirmed due to the pitiful lack of interest in this thing is that it’s destined to forever be a niche interest. Even a cheaper headset doesn’t give me the impression it would set the world on fire, at the end of the day, they still haven’t succeeded in proving to anyone *why* they should buy a VR headset, especially with no gaming support or anything resembling a killer app.",
          "score": 154,
          "created_utc": 1735745403.0,
          "replies": [
            {
              "id": "m4vd0xm",
              "author": "Valance23322",
              "body": "They just need to get it into something closer to a glasses form factor. VR headsets are too heavy and too hot (and often uncomfortable to wear with glasses) to use for long periods of time.",
              "score": 46,
              "created_utc": 1735751152.0,
              "replies": [
                {
                  "id": "m4xagw4",
                  "author": "bogglingsnog",
                  "body": "Yeah glasses like the Google Glass would have been awesome. A full headset is not very Apple-like.",
                  "score": 6,
                  "created_utc": 1735773616.0,
                  "replies": []
                },
                {
                  "id": "m4xwz5e",
                  "author": "jack-K-",
                  "body": "Doesn’t even need to be glasses imo, just something like those drone fps goggles would probably be small enough for most people",
                  "score": 1,
                  "created_utc": 1735781598.0,
                  "replies": [
                    {
                      "id": "m4xyw4n",
                      "author": "Randomaccountidkname",
                      "body": "Would it though? I have the Sky04X fpv goggles (~250g) and couldn't imagine myself wearing those for an entire 8 hour shift or something. It's not even just the weird weight and pressure on the head, it's also kinda straining on the eyes to look into it for a long time whenever I am reviewing DVR footage and not taking it off every few minutes to change battery.",
                      "score": 1,
                      "created_utc": 1735782304.0,
                      "replies": [
                        {
                          "id": "m4y006o",
                          "author": "jack-K-",
                          "body": "I think if they can improve the technology and mitigate those issues you described, that general size and format would be small enough for most people to manage, it’s already going to take a lot of work to get a vr headset to that size, it hopefully shouldn’t be that much more to solve those issues.",
                          "score": 1,
                          "created_utc": 1735782719.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m4y8wip",
                  "author": "Moderated",
                  "body": "The bigscreen beyond is the closest you can get, it only weighs 127 grams but it costs 1k.",
                  "score": 1,
                  "created_utc": 1735786183.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4uzy3j",
              "author": "dmibe",
              "body": "Jump from quest 2 to quest 3 has me very much thinking that the quest 4 WILL be that device that changes everything.",
              "score": 35,
              "created_utc": 1735746594.0,
              "replies": [
                {
                  "id": "m4v1e8j",
                  "author": "ErGo404",
                  "body": "The devices are too heavy to be used 8 hours a day.\n\nAnd I'm pretty sure it's bad as hell for your eyes to have screens strapped to them for that long.\n\nSo no, it's not a productivity device.\n\nIt will always be more cumbersome than a tablet or laptop.\n\nHowever the gaming experience is worth it IMO.",
                  "score": 34,
                  "created_utc": 1735747118.0,
                  "replies": [
                    {
                      "id": "m4vfrwa",
                      "author": "opeth10657",
                      "body": "> The devices are too heavy to be used 8 hours a day.\n\nThe first thing you should do with a Quest 3 is toss the original headstrap and get a halo style.  It spreads out the weight so much better and keeps the pressure off your face.",
                      "score": 10,
                      "created_utc": 1735752068.0,
                      "replies": [
                        {
                          "id": "m4voez6",
                          "author": "handsomeladd",
                          "body": "I got a new halo strap and a new breathable facial interface with softer material, but the nose cover is useless because I can still see the light where my nose it.  Is it because my nose is too narrow?",
                          "score": 6,
                          "created_utc": 1735754898.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m4vw66v",
                      "author": "gizmosticles",
                      "body": "I’ve been thinking of making a hack in my office using a [retractable tool reel](https://www.googleadservices.com/pagead/aclk?sa=L&ai=DChcSEwi7kYLul9WKAxXOJ0QIHdKUKCMYABAOGgJkeg&ae=2&co=1&gclid=Cj0KCQiA7NO7BhDsARIsADg_hIYhqfT8cslQ7jV8gBHqZJ36ZSdZ8qEXHqCO06cbX1FlPRaXZMuINxQaAmXyEALw_wcB&sph=&ohost=www.google.com&cid=CAESeOD2LkpQF8UZWKw7HWAukfoUHBKwId1cpU7CJ09bZo81oNuxNLWWz5S7ynmxKABGQwFQ0EyEuNs0QsF1hlEWD4q3A4_Ndn6aysa4unGLuByw4vLzyGrmC1YX1fMI9IkPwCnCWhY_62Msc256fCIa30tz8xkeh3-WoA&sig=AOD64_0TTf7G4ZO31G_dyfwJR91SBP0jjA&ctype=70&q=&ved=2ahUKEwigwfrtl9WKAxUwJ0QIHe3tB1kQwg8oAHoECAcQEQ&adurl=) on my ceiling above my desk to take some of the weight off",
                      "score": 5,
                      "created_utc": 1735757353.0,
                      "replies": []
                    },
                    {
                      "id": "m4v3dgs",
                      "author": "gefex",
                      "body": "This is it tbh, the advantages don't outweigh the disadvantages. Until they can design a unit that is comfortable, light and reasonably priced, it will never be more than a niche.",
                      "score": 15,
                      "created_utc": 1735747829.0,
                      "replies": [
                        {
                          "id": "m4ykdqh",
                          "author": "Abigail716",
                          "body": "They honestly don't even need that. A big problem with VR is it doesn't do any single thing incredibly well. \n\nJust upping the resolution a bunch with a much wider field of view would make them sell far better and allow for more casual use like watching TV or less intensity things like playing flight sim. \n\nIf you can increase the immersion enough people will forgive other faults. Making it lighter and more comfortable, or cheaper while good won't stop it from remaining just a niche thing and becoming mainstream.",
                          "score": 2,
                          "created_utc": 1735790982.0,
                          "replies": []
                        },
                        {
                          "id": "m4y8rmd",
                          "author": "Moderated",
                          "body": "The bigscreen beyond has the first two, but it costs 1000 dollars",
                          "score": 1,
                          "created_utc": 1735786130.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m4wl5rm",
                      "author": "brycedriesenga",
                      "body": "There's no evidence yet that using VR headsets long term is noticeably bad for your eyes",
                      "score": 4,
                      "created_utc": 1735765431.0,
                      "replies": [
                        {
                          "id": "m4y9o3g",
                          "author": "WredditSmark",
                          "body": "My throbbing headache says otherwise",
                          "score": 0,
                          "created_utc": 1735786482.0,
                          "replies": [
                            {
                              "id": "m50h7rn",
                              "author": "GraduallyCthulhu",
                              "body": "That sounds like yours is badly adjusted. Or the lenses are dirty.",
                              "score": 1,
                              "created_utc": 1735828556.0,
                              "replies": []
                            },
                            {
                              "id": "m53p8vg",
                              "author": "onecoolcrudedude",
                              "body": "a headache aint the same as losing your eyesight.",
                              "score": 1,
                              "created_utc": 1735864611.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m4x4fxs",
                      "author": "sesor33",
                      "body": "With the right strap, it really isn't that heavy. I've done VRChat sessions as long as 6 hours with no issues using a bobo strap and spare battery.",
                      "score": 1,
                      "created_utc": 1735771577.0,
                      "replies": []
                    },
                    {
                      "id": "m4v7cu9",
                      "author": "DarthBuzzard",
                      "body": "It'll be Quest 5 or 6, by that point it will be small, lightweight and actually good for your eyes since they'll no doubt have varifocal tech by that point.",
                      "score": 0,
                      "created_utc": 1735749233.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4vhrj9",
                  "author": "gokarrt",
                  "body": "there are at least two generational leaps before headsets actually break into common usage. physically, we're just not there yet.",
                  "score": 2,
                  "created_utc": 1735752732.0,
                  "replies": [
                    {
                      "id": "m4x4iq7",
                      "author": "sesor33",
                      "body": "More Q2's have sold than Xbox Series S/X. Would you call Xbox common?",
                      "score": 1,
                      "created_utc": 1735771603.0,
                      "replies": [
                        {
                          "id": "m4xbxtq",
                          "author": "gokarrt",
                          "body": "more that i would call xbox series a failure",
                          "score": 5,
                          "created_utc": 1735774113.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4v8p21",
              "author": "JBWalker1",
              "body": "> I remember so many comments from people saying how excited they were to use this for work, as if this was somehow exponentially better than two physical monitors that you didn’t have to strap to your head.\n\nSounds cool at first but having a full VR headset literally strapped to your face all day while working would be terrible, especially in hot weather so your face would get sweaty. They look very dorky to use which alone will put lots off. It also restricts your vision, like you cant see stuff to the side of you. I think it's field of view is around 95 degrees instead of probably 160 degrees+ with your normal vision so thats another reason why it would feel bad to wear long. Would close yourself off from people around you too much and thats even ignoring the fact that they can't see your face, just weird digital eyes. The pass through quality is decent but not close to as good as real life. \n\nOn the other hand AR glasses exist for just $399. Just glasses which are almost the same size as normal glasses but have a screen built into them. You don't need something strapped to your face so they're comfortable to wear for longer and you can look reletively normal using them. They fit in your pocket. Can be taken off and on easy like normal glasses, helpful if you're talking to people. You can see through them like normal glasses so you have your full real world field of view visible. They now also have all the 3dof features built in like other VR headsets so you can place a virtual screen in front of you and it'll stay in place like a normal monitor when you turn your head away(optional of course). The main downside is that the screens have a 50 degrees field of view, but thats not a huge deal since you have your full natural field of view. This years versions are already 60 degrees anyway. The main drawback is that they're 1080p. As soon as they're 1600p then they're perfect.\n\nBut yeah glasses are the future for work. Not even the far future either so it's weird Apple chose to make the vision pro as a work device, normally they're forward thinking. Someone in a cafe wearing a full vision pro for work will look dumb compared to someone next to them using glasses even if the vision pro does more.",
              "score": 11,
              "created_utc": 1735749690.0,
              "replies": [
                {
                  "id": "m4vdlzo",
                  "author": "Valance23322",
                  "body": "Human vision is roughly 205° horizontal (including peripheral vision)",
                  "score": 5,
                  "created_utc": 1735751347.0,
                  "replies": [
                    {
                      "id": "m4wgo6j",
                      "author": "JBWalker1",
                      "body": "Oh nice, even more reason why glasses are much better. You'd get the full 205 degrees instead of only 95 or so degrees with a Apple Vision or VR headset.",
                      "score": 1,
                      "created_utc": 1735763974.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4wjfef",
                  "author": "parasubvert",
                  "body": "The field of vision is about 105 , halo headsets strap lets you take off the light seal to retain peripheral vision. I wear mine all day.",
                  "score": 1,
                  "created_utc": 1735764870.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4veefr",
              "author": "OtterishDreams",
              "body": "AR will have more consumer uses.  Quest3 already heading down that road nicely",
              "score": 5,
              "created_utc": 1735751611.0,
              "replies": [
                {
                  "id": "m4wcunt",
                  "author": "elton_john_lennon",
                  "body": "AR is the future, VR was only the launchpad for it, we are just waiting for technology to catch up.",
                  "score": 2,
                  "created_utc": 1735762744.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4vba4z",
              "author": "marxcom",
              "body": "It could have been a revolutionary product if Apple wasn’t greedy, and I’m not talking about the price tag. It’s easy for someone to make a killer app but Apple has gagged this product by binding it with iPadOs and integrating it deeper into their 30% App Store cut model. These two issues are the Achilles tendon of this product. Most content consumption apps have declined to be bothered on the AVP platform because Apple would want their cookies. \n\nFirst make the new product, let it go mainstream then tie some services to make money. But Apple brought this right out of the gates with the 30% cut and limited iPadOS.",
              "score": 9,
              "created_utc": 1735750571.0,
              "replies": [
                {
                  "id": "m4w8dbj",
                  "author": "FlyingBishop",
                  "body": "Locking it to iPadOS is something that I oppose ideologically, but it might not be a killer, except they also don't support any existing controllers. If they had launched with controller support for the existing VR platform controllers and also some flagship ports (Beatsaber, Half-Life Alyx, etc.) that might've been interesting, you would have a lot of gamers lining up to get it. Beatsaber is the closest thing to a killer app for VR in my book, and the fact that they didn't support it at launch is nuts.",
                  "score": 5,
                  "created_utc": 1735761273.0,
                  "replies": [
                    {
                      "id": "m53pqjg",
                      "author": "onecoolcrudedude",
                      "body": "meta owns beat saber now, we dont know if they'd be willing to port it.\n\ngiven how apple tends to not play nicely with other companies, especially competitors, idk if meta would bother.",
                      "score": 1,
                      "created_utc": 1735864764.0,
                      "replies": [
                        {
                          "id": "m53z3rq",
                          "author": "FlyingBishop",
                          "body": "I mean that's the thing, I know for a fact it was very hard to get a headset and you had to sign a very cumbersome NDA, etc. Apple is just not cut out for launching a product like this anymore. They should have been coming to Meta hat in hand with a headset and saying \"make Beatsaber work\" but they're incapable of doing that.",
                          "score": 1,
                          "created_utc": 1735867846.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4vhhw7",
              "author": "high_everyone",
              "body": "I was sure hoping for it.  Having a desktop is great, having to be away from my desktop for hours at a time with no way to access anything feasibly was less great.  The Vision Pro v2-3 would have been amazing at this.  Is it a stop gap?  Perhaps, but at someone with a disability, having more ability and time with my screens means more productivity for me and less time away from the things my disability keeps me from.\n\nWhen my disability is flaring, I'm on the other side of the house, far away and unable to access the things I was working on, which can lead to exhaustion trying to sort out what I was doing before my flare up occurred thirty-sixty minutes prior.\n\nYou can do this on the Meta Quest now, but getting Apple's take on it was my priority since it's going to be the one to most likely cater to my needs for accessibility features already baked into Apple's ecosystem from fonts to keyboard shortcuts and text expansion.",
              "score": 2,
              "created_utc": 1735752642.0,
              "replies": []
            },
            {
              "id": "m4w1dmg",
              "author": "formershitpeasant",
              "body": "Vr will have its time when headsets get brought down to the size of glasses and get wireless connectivity.",
              "score": 2,
              "created_utc": 1735759010.0,
              "replies": []
            },
            {
              "id": "m4v3ueq",
              "author": "mcarterphoto",
              "body": "I kind of agree, but much of what I've read from people who've lived with the VP for a while is that they felt like they \"lost one of their sense\" when they returned it.\n\nSo my prediction? Someday the tech will be ubiquitous, but with a smaller form factor. There's nothing yet that seems to just hack into user's brains like a top-end VR set, at least until VR brain implants become a thing. It just seems too powerful and useful and versatile to throw away. And remember when the first iPhone was introduced, it seemed amazingly groundbreaking, and then look at how it advanced in utility in a handful of years, once market acceptance and developer interest snowballed. VR will eventually reach a similar status and market reach, once someone figures out how to make it more easily integrated into daily life and specific work/creative uses. What that evolution will be, I have no idea, but someone will figure it out and create an entirely new market.",
              "score": 0,
              "created_utc": 1735747997.0,
              "replies": [
                {
                  "id": "m4vinhr",
                  "author": "VeganCanary",
                  "body": "I think VR will have its place when it becomes less bulky.\n\nIf you could wear VR discretely and they looked pretty much like glasses, this would open up options to wear them in public.\n\nImagine if you could wear some glasses as you walk that you see through, and it overlays the directions as you walk. You get a message and you can see it without getting your phone out of your pocket.",
                  "score": 7,
                  "created_utc": 1735753029.0,
                  "replies": [
                    {
                      "id": "m4vqbvo",
                      "author": "quintk",
                      "body": "I have a lot of trouble recognizing people, including friends and coworkers I see on a regular basis. I would love a facial recognition system! But we know from past news stories that people don’t like being recorded and processed in public, and some guy somewhere would find a way to make it creepy ",
                      "score": 2,
                      "created_utc": 1735755516.0,
                      "replies": []
                    },
                    {
                      "id": "m4zcmpi",
                      "author": "ungoogleable",
                      "body": "Miniaturization bumps up against physics at some point. You need to store energy to power the device. You need surface area to dissipate heat. Optics and sensors take physical space. Maybe it's possible to shrink them small enough, but it might not be. Or maybe the tech is possible but it's just so expensive that the marginal benefits over a screen don't justify the increased cost.\n\nI'm reminded of flying cars and jet packs as futuristic ideas that were easy to imagine but hard to turn into real products.",
                      "score": 2,
                      "created_utc": 1735806735.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4w74q3",
              "author": "FlyingBishop",
              "body": "The price point seemed to be an acknowledgement that this was a dev kit and not intended to be a mass market product. (And it's a dev kit for creating software that will run on a headset that doesn't exist yet, that has similar specs, is lighter weight, and has a reasonable price point.)\n\nBut the way they were hyping it sounds like... I feel like Apple's leadership is pretty out of touch in terms of what $3500 is and how many people are willing to spend that on a whim. But at least initially I think they knew it was a dev kit price and not a mass-market price.",
              "score": 1,
              "created_utc": 1735760867.0,
              "replies": []
            },
            {
              "id": "m4xc7rz",
              "author": "kibblerz",
              "body": "The AVP can simulate a dual 4k ultrawide display with the mac, with text clarity that's FAR superior to what the quest can offer. A similar monitor costs atleast $2000 bucks.\n\nAlso, the vision pro does have gaming support via ALVR. I play no man's sky and VRchat on mine quite frequently at 4k (though it pushes my 4080 to the limits lol). \n\nI use Nintendo joycons for the controllers (ALVR allows to use the joycons for button input simultaneously with hand tracking for tracking support). It works really well, though they joycons are a bit uncomfortable. But there are 3rd parties making more full fledged controllers. \n\nThis myth that you can't play PCVR on vision pro needs to die, cause I do it all the time without issues lol (besides hand cramps from joycons).",
              "score": 1,
              "created_utc": 1735774207.0,
              "replies": []
            },
            {
              "id": "m4xguis",
              "author": "the_war_won",
              "body": "Now do AI!!!",
              "score": 1,
              "created_utc": 1735775847.0,
              "replies": []
            },
            {
              "id": "m4yz9vl",
              "author": "None",
              "body": "the only thing VR is good is games and porn. Everything else is a gimmick.",
              "score": 1,
              "created_utc": 1735798370.0,
              "replies": [
                {
                  "id": "m502t6i",
                  "author": "DarthBuzzard",
                  "body": "Don't forget fitness and social stuff.",
                  "score": 1,
                  "created_utc": 1735822619.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m54hfwk",
              "author": "haragoshi",
              "body": "I recently learned that people lie on the internet.",
              "score": 1,
              "created_utc": 1735874359.0,
              "replies": []
            },
            {
              "id": "m4wkqxt",
              "author": "HaMMeReD",
              "body": "Apples ability to mislead the masses is phenomenal. The company itself has grandiose narcissism.\n\nDon't get me wrong, I think Apple does a lot of great things, but the level apple thinks they are, vs where they really are is like orders of magnitude off.\n\nIf they set a $1,500 price point, and built the hardware to match that. They would have sold buckets of AVP's, and even though the hardware wouldn't be as good, it would not stop the Apple stans from proclaiming it's the best.",
              "score": 1,
              "created_utc": 1735765298.0,
              "replies": [
                {
                  "id": "m4yku6d",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1735791185.0,
                  "replies": [
                    {
                      "id": "m4ypr9e",
                      "author": "HaMMeReD",
                      "body": "Apple has economy of scale being a hardware manufacturer for decades.\n\nAnd we are talking about doubling the budget and still making 50% profit.\n\nI'm not talking about Apple taking a loss, I'm talking about Apple pricing and developing reasonable things that a consumer could justify.",
                      "score": 1,
                      "created_utc": 1735793455.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4v6ea1",
              "author": "AnalogWalrus",
              "body": "Tbh I think it could replace our desktop setups, and I am absolutely here for that. \n\nBut a) the tech isn’t quite there yet and b) never buy the 1.0 version of a hardware product.",
              "score": -2,
              "created_utc": 1735748900.0,
              "replies": [
                {
                  "id": "m4v9o95",
                  "author": "Peroovian",
                  "body": "It would be amazing for traveling while working. I work remote and I work at home 100% of the time (outside of travel) because I’m way more productive with my full setup. Having a VR headset that could let me essentially carry a virtual version of that would be incredible. \n\nBut yeah, I’d never buy the first version. Or spend $3500 on it unless it’s absolutely perfect.",
                  "score": 2,
                  "created_utc": 1735750024.0,
                  "replies": [
                    {
                      "id": "m4vbkkw",
                      "author": "AnalogWalrus",
                      "body": "Exactly. That would be my use case as well. I could work from anywhere, but honestly I can’t get shit done without my multiple monitor setup and all that, so a way to replicate that in a portable way would be a game-changer. But the tech just isn’t there yet.",
                      "score": 2,
                      "created_utc": 1735750667.0,
                      "replies": []
                    },
                    {
                      "id": "m4x7vo6",
                      "author": "fuck_the_fuckin_mods",
                      "body": "This is what it’s for, as far as I’m concerned, and why the price tag isn’t all that insane to me. If they could manage a consumer version with the same specs and price as a new MacBook Pro I would absolutely buy one, for the reasons you outlined, and the fact that it would immediately and automatically seamlessly integrate with my other devices. I could be running multiple Adobe programs on multiple “screens,” with multiple browser windows open and showing, and a movie playing off to the side, in my bed or on an airplane or when camping. People trying to compare these things to gaming headsets with cellphone hardware and random software are missing the point.",
                      "score": 1,
                      "created_utc": 1735772754.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4vbjq6",
                  "author": "TryingT0Wr1t3",
                  "body": "> never buy the 1.0 version of a hardware product.\n\nThis has the same vibes as https://i.imgur.com/LZG0qGd.jpeg",
                  "score": 1,
                  "created_utc": 1735750659.0,
                  "replies": [
                    {
                      "id": "m4vnebh",
                      "author": "AnalogWalrus",
                      "body": "Hah. \n\nJust…think it’s generally solid advice for any expensive gadget 🤷‍♂️ especially since nowadays new iterations of products seem to emerge faster than ever.",
                      "score": 4,
                      "created_utc": 1735754565.0,
                      "replies": [
                        {
                          "id": "m4vrzcp",
                          "author": "TryingT0Wr1t3",
                          "body": "I agree, I just thought it sounded/read funny. Now I want to add it in some adventure game. XD",
                          "score": 2,
                          "created_utc": 1735756038.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4vkdet",
              "author": "Docphilsman",
              "body": "I've been saying for about a decade now that VR would never be this widely accepted game-changer and I've watched as that opinion has gone from being laughed at to basically being the accepted truth.\n\n I think the main reason is that VR doesn't allow you to multitask/goof off. If you're watching a movie or gaming in VR that's all you are doing. You can't glance down and check your phone like you would doing those activities in the traditional way. We have short attention spans now that require multiple stimuli, VR monopolized your entire attention. Add in that it's uncomfortable and gives many users motion sickness and it's pretty easy to see why it hasn't gained wider use",
              "score": 0,
              "created_utc": 1735753593.0,
              "replies": [
                {
                  "id": "m4w8jb9",
                  "author": "FlyingBishop",
                  "body": "It's always been obvious that VR tech isn't \"there\" yet as a mass-market tech to anyone who used it. It also still seems unlikely that it will be there for 5-10 years. Saying \"never\" though is silly and you should be laughed at for saying it.",
                  "score": 2,
                  "created_utc": 1735761328.0,
                  "replies": [
                    {
                      "id": "m4x5ste",
                      "author": "Docphilsman",
                      "body": "People have been saying that exact same thing for a decade now. \n\nSome of the biggest companies in the world have poured tens of billions of dollars into R&D. Every few years, we get a new breakthrough that's supposed to be what finally makes VR ubiquitous, and it just never does. AR will absolutely find a broad audience if someone makes a good version but outside of a few niche professional contexts... and reddit nerds, VR just does not have that wide of an appeal",
                      "score": 2,
                      "created_utc": 1735772037.0,
                      "replies": [
                        {
                          "id": "m4xdez6",
                          "author": "FlyingBishop",
                          "body": "It might not be an exaggeration to say that mass-market VR is as elusive as fusion. There are sound reasons why the current tech is not viable. It's fair to say that you might need a refresh rate of 300FPS (3x the AVP) and similarly 3x the pixels of the AVP. Along with better latency on the passthrough. That means it could be 20-30 years still before the tech can support that kind of power. Never is a ridiculous thing to say.",
                          "score": 0,
                          "created_utc": 1735774626.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4vdwax",
              "author": "MrTurkle",
              "body": "It is not worth $3500 (over $4k when all is said and done) but comparing this to any other headset is a mistake. It is next level shit in many ways but not ready for the masses. Like many Apple products before it, it’s ahead of its time.",
              "score": -5,
              "created_utc": 1735751442.0,
              "replies": [
                {
                  "id": "m4w4myt",
                  "author": "Pterodactyl_midnight",
                  "body": "What Apple products were ahead of their time? \n\nApple didn’t invent the smartphone, mp3 player, computer, wireless headphones, etc. They simply marketed well and made it easy to use within its own ecosystem.",
                  "score": 3,
                  "created_utc": 1735760053.0,
                  "replies": [
                    {
                      "id": "m4w9h36",
                      "author": "MrTurkle",
                      "body": "you don't remember the apple newton?  Sure, they didn't invent a lot of those things, but you have to admit they certainly set the standard particularly with the iPhone and iPod which were both revolutionary.",
                      "score": -1,
                      "created_utc": 1735761632.0,
                      "replies": [
                        {
                          "id": "m4wepc8",
                          "author": "Pterodactyl_midnight",
                          "body": "Again, they are good products but not revolutionary. Those products already existed, Apple just marketed their version best—specifically with education discounts, multiple colors, and iTunes popularity.",
                          "score": 1,
                          "created_utc": 1735763339.0,
                          "replies": [
                            {
                              "id": "m4x1i5d",
                              "author": "MrTurkle",
                              "body": "A smart phone on part with the iPhone existed? There was nothing as compact or easy to use as the iPod when it came out. It totally changed mobile music.",
                              "score": -1,
                              "created_utc": 1735770585.0,
                              "replies": [
                                {
                                  "id": "m4y6vq4",
                                  "author": "Pterodactyl_midnight",
                                  "body": "LG released a touchscreen smartphone before Apple. And multiple companies released compact mp3 players before the iPod, but Apple did innovate with the click wheel.",
                                  "score": 1,
                                  "created_utc": 1735785392.0,
                                  "replies": [
                                    {
                                      "id": "m4z5nxp",
                                      "author": "MrTurkle",
                                      "body": "LG’s touch screen was a dumpster fire!",
                                      "score": 1,
                                      "created_utc": 1735802183.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m4uol86",
          "author": "RottenPingu1",
          "body": "Probably the same people still lining up at every iPhone launch.",
          "score": 25,
          "created_utc": 1735742092.0,
          "replies": [
            {
              "id": "m4uvin9",
              "author": "WillowOtherwise1956",
              "body": "I don’t get the hate. It’s ok to get excited for every new phone unless it’s the most popular one?\n\nAnyone willing to really explain what’s so bad about a new iPhone?\n\nIf it helps what I like about it is how user friendly it is. I love the ecosystem, I don’t have to download a video chat app from some random company I use FaceTime. I don’t need some random streaming company I have Apple Music, I make invoices for my small business, I take great pictures of my 5 year old, I love AirPods, i love my Apple ultra watch, I really like the translate app and using the new action button to translate conversations with co workers and customers, etc etc. \n\nI’m not saying it’s the best phone, but it seems to be a really good one by most metrics. Where is the big downside? What am I missing from another company?",
              "score": -9,
              "created_utc": 1735744936.0,
              "replies": [
                {
                  "id": "m4uya3s",
                  "author": "power899",
                  "body": "You haven't used any other devices and are completely entrenched in the Apple ecosystem, and then ask what you're missing from other companies? \n\niOS is currently shockingly worse compared to Android in almost every way. Make no mistake, Apples iOS keyboard implementation is trash. \n\nAnd all of the activities you mentioned can be carried out with any Android flagship and would probably be cheaper than the Pro or Pro Max iPhones.",
                  "score": 3,
                  "created_utc": 1735745978.0,
                  "replies": [
                    {
                      "id": "m4v42pb",
                      "author": "ThatLaloBoy",
                      "body": "I’m sorry, but as someone who moved from a Pixel 7 Pro to a 15 Pro Max, iOS is not “worse” in every way. \n\nApp integration is much better on iOS with far less bugs and weird crashes. iOS runs consistently smooth compared to Android, which occasionally will stutter for no reason. Long term app support between Apple and Google is night and day (as a salty GPM and Inbox user). Ecosystem compatibility between iPhone and other Apple products is leagues ahead of whatever Google tried to do with Chromebook and Android Wear.\n\nIt’s not perfect, as I do miss side loading apps and the app navigation is not as consistent as Android. And I hate Apple’s compatibility with things that are outside their ecosystem. But day to day, I prefer using my iPhone.",
                      "score": 0,
                      "created_utc": 1735748084.0,
                      "replies": [
                        {
                          "id": "m4vy0xn",
                          "author": "deevandiacle",
                          "body": "Using a 15 Pro Max right now from Pixel 7 Pro. I lean toward the other direction. iOS feels much more limited on 3p app integration and things just work on Android that are hard or impossible to do on iOS. \n\nThe roundabout focus system instead of notification channel control is by far the most frustrating thing on iOS. \n\nThe flip side is voice control/siri seems to work a lot better than Google Assistant. But that’s not my main control plane so it’s not as big of an advantage to me.\n\nedit: also the lack of a universal back gesture/button is absurd. I hate that some apps just don’t support swipe back, where you have to on Android.",
                          "score": 2,
                          "created_utc": 1735757939.0,
                          "replies": [
                            {
                              "id": "m4yn1dq",
                              "author": "bmore_conslutant",
                              "body": ">The roundabout focus system instead of notification channel control is by far the most frustrating thing on iOS. \n\nReally? Because for me it's every time I type on my work iPhone I want to punt it into the harbor",
                              "score": 1,
                              "created_utc": 1735792188.0,
                              "replies": [
                                {
                                  "id": "m50eyhi",
                                  "author": "deevandiacle",
                                  "body": "Yeah the keyboard is really bad on iOS as well. I tend to not message a lot and type on my macbook if i can. Notification channelling personally just drives me nuts.",
                                  "score": 1,
                                  "created_utc": 1735827708.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m4v32qx",
                      "author": "ShavenYak42",
                      "body": "I’ve used multiple Android phones, but prefer iOS by a wide margin. There’s nothing wrong with the iOS keyboard, and the operating system just feels more mature and intuitive to me.",
                      "score": 0,
                      "created_utc": 1735747723.0,
                      "replies": [
                        {
                          "id": "m4v7ee3",
                          "author": "power899",
                          "body": "Then why ask strangers on Reddit unless you're seeking validation from them regarding your tech choices?\n\nYou've tried both and you prefer iOS. And it is a *preference* because most of the features on Android are objectively better. But hey man you do you. I use all the Apple devices too, but they're pretty mid other than their laptops and MacOS.",
                          "score": -2,
                          "created_utc": 1735749248.0,
                          "replies": [
                            {
                              "id": "m6gdk2q",
                              "author": "ShavenYak42",
                              "body": "I don’t recall asking anyone for anything or seeking validation. I’m just responding to your statements with, yes, my preference. At least I can admit it’s a preference though, and am not going around saying Android’s keyboard is trash and iOS is “objectively better” without providing any actual objective criteria by which I’m comparing them.",
                              "score": 1,
                              "created_utc": 1736537832.0,
                              "replies": [
                                {
                                  "id": "m6ge9s2",
                                  "author": "power899",
                                  "body": "Check out the hundreds of posts on r/ios complaining about the keyboard. Anyway tbh it doesn't matter what device you use as long as you're happy using it. \n\nLife's too short to care that much about the tools we use 😂",
                                  "score": 1,
                                  "created_utc": 1736538041.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m4x8jr7",
                      "author": "fuck_the_fuckin_mods",
                      "body": "> iOS is currently shockingly worse compared to Android\n\nWell you *definitely* haven’t used both as daily drivers for a significant amount of time. That’s an insane thing to say unless you completely ignore how normal people use phones and what they want from them. Android is very good at some things and frequently beats Apple to market with features, but the whole experience still feels very disconnected, janky and jury-rigged. If you just want no issues, no decisions to make, no bugs, no surprises, and a congruent, well-integrated experience… Apple is still a great choice.\n\nJust buy whatever you like, who gives a shit? There are perfectly rational and acceptable reasons why some people prefer each.",
                      "score": 1,
                      "created_utc": 1735772974.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4uxa5t",
                  "author": "dfsvegas",
                  "body": "As a person who moved from the Galaxy S21 Ultra to the iPhone 15 pro... Not a damn thing. It's a great phone.",
                  "score": 1,
                  "created_utc": 1735745606.0,
                  "replies": [
                    {
                      "id": "m4v22ft",
                      "author": "_RADIANTSUN_",
                      "body": "You are missing the ability to choose and not being totally locked in by one company. You either take what Apple gives you or kick rocks and have to change your whole software ecosystem to Android. Whereas if you're already on Android, you can choose from like a billion different phones and companies with various particular strengths and tradeoffs.",
                      "score": 2,
                      "created_utc": 1735747361.0,
                      "replies": [
                        {
                          "id": "m4v395p",
                          "author": "dfsvegas",
                          "body": "Dude, I'm 36... I don't need the latest and greatest, and a bunch of options, I just want a phone that works. At a certain point in life, the shit you mention just stops mattering to you.",
                          "score": 6,
                          "created_utc": 1735747788.0,
                          "replies": [
                            {
                              "id": "m4vcycs",
                              "author": "_RADIANTSUN_",
                              "body": "By that logic you might as well use a free government program smartphone then and pretty much any phone would suffice, so why use an iPhone? Cuz they are certainly priced like the latest and greatest.",
                              "score": -1,
                              "created_utc": 1735751128.0,
                              "replies": [
                                {
                                  "id": "m4vyacd",
                                  "author": "SUPRVLLAN",
                                  "body": "You got some funny logic.",
                                  "score": 2,
                                  "created_utc": 1735758021.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m4ux6v3",
                  "author": "QB8Young",
                  "body": "Spoken like a true Apple fan. It's only just become the most popular one. Android has outsold Apple every year untill 2022. \n\nSure, since you asked... Apple gets features Android has had for years, renames it, and claims it is new and groundbreaking. They also lock you out of the level of customization that Android has. It's has 3 cameras but still can't match the zoom or quality of other phones (Samsung for example). Android doesn't need a \"video chat app from some random company\" 🤦‍♂️ they have Google Duo/Meet. Which can also be used on iPhone so we can video chat across platforms. Something Apple would never do with FaceTime. 🤷‍♂️",
                  "score": -6,
                  "created_utc": 1735745571.0,
                  "replies": [
                    {
                      "id": "m4uy62p",
                      "author": "sharkfighter-",
                      "body": "Spoken like a true, chronically online redditor.",
                      "score": 2,
                      "created_utc": 1735745936.0,
                      "replies": []
                    },
                    {
                      "id": "m4uxm77",
                      "author": "WillowOtherwise1956",
                      "body": "I think the customization point is where people come to a head, and it’s not needed. That’s a preference. My brother likes that but for me I just see it as being more complicated than I personally want or need. Nothing against it but it’s brought up a lot as something iPhone users are losing when in reality it’s just not something most iPhone users are concerned with.",
                      "score": 3,
                      "created_utc": 1735745730.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4uxzc5",
                  "author": "DomDomPop",
                  "body": "What you’re missing is the general trend toward people hating things they can’t buy, or things that aren’t marketed towards them in general. It’s rather pervasive at this point, but obviously only with the audiences who aren’t in the target market. Ask some wannabe synth bro what they think of Teenage Engineering products, and they’ll tell you they suck and they’re too expensive. Ask an actual musician who’s repeatedly spent thousands on an instrument that does one thing, and they’re much more likely to have a favorable opinion. You can do the same thing with expensive boats, cars, hobbies, it’s everywhere. It’s basically just the sour grapes mentality.",
                  "score": -4,
                  "created_utc": 1735745867.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m4wemf3",
          "author": "LurkerPatrol",
          "body": "I feel like someone is myopic if they’re taking this product to be more than a developer toy and potential predecessor for way better actual use case products in the future.",
          "score": 2,
          "created_utc": 1735763312.0,
          "replies": []
        },
        {
          "id": "m4y94fs",
          "author": "NoninflammatoryFun",
          "body": "That AND it was my too heavy on my face, even after only 20 minutes. \n\nEven so, I would’ve very much wanted one if it had been say $1,000 or 1,500.",
          "score": 2,
          "created_utc": 1735786269.0,
          "replies": []
        },
        {
          "id": "m4usmx0",
          "author": "KingKapwn",
          "body": "It wasn’t a product geared for normal consumers, it was a proof of concept geared for tech enthusiasts. The Quest 3 and Vision Pro fulfil two different niches.",
          "score": 5,
          "created_utc": 1735743796.0,
          "replies": [
            {
              "id": "m4v1ac5",
              "author": "None",
              "body": "Proof of concept devices don't go for sale. \n\nIt was an actual product. They missed the mark. It failed.",
              "score": 23,
              "created_utc": 1735747079.0,
              "replies": [
                {
                  "id": "m4yla98",
                  "author": "Abigail716",
                  "body": "Yes they do. For example LG has a line of products under the \"T\" name exactly for that purpose. It isn't common, but it happens. T does not officially stand for anything, but it's believed that it stands for test. That's the line of products that you will see come out that are absurdly expensive, like the  $100,000 rollable TV.",
                  "score": 2,
                  "created_utc": 1735791387.0,
                  "replies": [
                    {
                      "id": "m5if2bj",
                      "author": "_RADIANTSUN_",
                      "body": "This is cope because at the end of the day it was a PRODUCT, on sale to the general public, with expensive media promotion and everything.\n\nIt's a failure as a product and the \"proof of concept\" cope doesn't change that.",
                      "score": 0,
                      "created_utc": 1736079420.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4wjtjs",
                  "author": "parasubvert",
                  "body": "It was mostly supply constrained, and sold what Apple wanted to sell… not a failure beyond Reddit forums",
                  "score": 2,
                  "created_utc": 1735764994.0,
                  "replies": [
                    {
                      "id": "m4woz7e",
                      "author": "None",
                      "body": "It's a failure when people start [returning the product you just sold them.](https://www.ccn.com/news/technology/apple-vision-pro-headache-45-percent-return-device-mark-zuckerberg/)",
                      "score": 1,
                      "created_utc": 1735766646.0,
                      "replies": [
                        {
                          "id": "m4wpbqq",
                          "author": "parasubvert",
                          "body": "You are citing a web poll from two weeks after February launch as evidence of the return rate?",
                          "score": 3,
                          "created_utc": 1735766754.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4uu0lq",
              "author": "Jugales",
              "body": "And it was a flop. Basically a sequel to Google Glass. Now Apple will happily shift those engineers to AI, like they did with the Apple Car",
              "score": 12,
              "created_utc": 1735744347.0,
              "replies": [
                {
                  "id": "m4uv40e",
                  "author": "DarthBuzzard",
                  "body": "The concept and technology of Vision Pro is completely different to Google Glass.\n\nEdit: Anyone downvoting me is clueless. Absolutely clueless.",
                  "score": -13,
                  "created_utc": 1735744779.0,
                  "replies": [
                    {
                      "id": "m4uwmnt",
                      "author": "Jugales",
                      "body": "They are both augmented reality offerings for a price too high for consumers. The technology is different, the marketing and failure are the same.",
                      "score": 12,
                      "created_utc": 1735745361.0,
                      "replies": [
                        {
                          "id": "m4v1tur",
                          "author": "Codipotent",
                          "body": "Google glass couldn’t do VR. You are incorrect.",
                          "score": 1,
                          "created_utc": 1735747275.0,
                          "replies": [
                            {
                              "id": "m4wret9",
                              "author": "DarthBuzzard",
                              "body": "Imagine being downvoted for saying this. How do people not get this? Google Glass is literally a **2D display** with **no tracking** in front of **one** of your eyes with **light bleeding** all around you since it's not encased - that's the furthest thing from VR.",
                              "score": 1,
                              "created_utc": 1735767407.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m4v7kbn",
                          "author": "DarthBuzzard",
                          "body": "Google Glass was a smartglasses offering, not augmented reality.\n\nAugmented Reality is defined as overlaying digital information into the real world. Google Glass had no concept of the real world - it simply displayed content on a 2D screen placed near your eye.",
                          "score": -6,
                          "created_utc": 1735749304.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m4ux4n3",
                      "author": "clay_perview",
                      "body": "I mean they both tried to make AR  system, except only one had a gigantic fish bowl headset.",
                      "score": 3,
                      "created_utc": 1735745548.0,
                      "replies": [
                        {
                          "id": "m4v72mo",
                          "author": "DarthBuzzard",
                          "body": "Google Glass never had any AR capabilities. It was a monocular smartglasses device, a completely different segment of technology to VR/AR.\n\nIt's like the difference between a computer and a calculator. A calculator may calculate and a computer may calculate, but that's where the similarities end.",
                          "score": 4,
                          "created_utc": 1735749135.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4x21eb",
              "author": "shinyquagsire23",
              "body": "IMO it's a product designed to get people excited. Enterprise likes it because the competition is a $10k headset with a subscription model (Varjo) and Vision Pro is half the price.\n\nI suspect it can take off in Pro markets because it's a portable calibrated 10-bit HDR display with perfect lighting conditions, exactly what you'd want for video color grading and mastering (kinda niche but hey, I'm sure there's people who'd like to work next to a window for a change if the price was about half). There's alternatives but no 1:1 competing products, but it's also a bit too heavy for 8hrs of work. But ime, even for casual VR uOLED is great and brings out a ton of low-light details that get nuked on LCDs, and it avoids all the OLED smear that full size OLED monitors have.\n\nFor consumers, it and Android XR are the only headsets with Widevine DRM ready to go, so they don't have to beg every streaming service to make an exception to get 1080p and 4K video. I've tried using my Quest for media and it's just such a hassle comparatively.",
              "score": 2,
              "created_utc": 1735770767.0,
              "replies": []
            },
            {
              "id": "m4v4rqo",
              "author": "ThatLaloBoy",
              "body": "If it wasn’t geared towards “normal consumers”, they wouldn’t have spent so much money and resources marketing it and offering payment plans at Apple stores for people to buy them. They probably didn’t expect iPhone level sales, but they absolutely expected a lot more people to buy them.",
              "score": 4,
              "created_utc": 1735748329.0,
              "replies": []
            },
            {
              "id": "m4uwtsa",
              "author": "Dude312FDoT",
              "body": "It was a failure from the get! VR is old tech from the early 90’s! And this all Apple could do is some gimmicky head set?? Haha! Apple is dead on moving forward. Better come up with a new idea quick!",
              "score": -4,
              "created_utc": 1735745435.0,
              "replies": [
                {
                  "id": "m4v29qp",
                  "author": "ErGo404",
                  "body": "The tech that enables usable VR is not from the 90s though.\n\nEven now we could say that the tech is not quite ready, the headsets are still way too heavy",
                  "score": 1,
                  "created_utc": 1735747434.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m4v6nfu",
          "author": "SoSKatan",
          "body": "I don’t see them as competing products in n the same way that the iPhone doesn’t compete against the Nintendo Switch.\n\nI own both the AVP and the Quest 3 and use both weekly.  I actually use my AVP more as I tend (like most people) to consume more shows / movies than I consume VR games.\n\nI love my Nintendo switch.  It’s cheaper and has more games than my iPhone.  But I have and use both an iPhone and a switch.\n\nAnd I use my iPhone far far more than my iPhone.",
          "score": 2,
          "created_utc": 1735748989.0,
          "replies": []
        },
        {
          "id": "m4uryqq",
          "author": "NecroCannon",
          "body": "I’m mostly excited for the future of it, Apple has a way of pushing the Industry standard with the masses once they get past the first models\n\nMeanwhile I don’t like Meta, the thing that made start looking down on the Quest in general is it getting bought by Meta, forcing you to use a Meta account, ontop of all the privacy bs they do to make money\n\nIt’s like people forgot that Meta is a vile company just because they released a cheap headset, which is exactly what they want",
          "score": 0,
          "created_utc": 1735743524.0,
          "replies": [
            {
              "id": "m4ux03h",
              "author": "Sure-Temperature",
              "body": "FWIW, you can create a Meta account and have it completely separate from your Facebook/Instagram/whatever account. Still not a fan of Meta having so much information, but at least it's something of a deterrent",
              "score": 7,
              "created_utc": 1735745501.0,
              "replies": []
            },
            {
              "id": "m50dma6",
              "author": "JamesHeckfield",
              "body": "Ayy but Palmer Luckey is a vile person, so even if it hadn’t been bought out….",
              "score": 1,
              "created_utc": 1735827195.0,
              "replies": []
            },
            {
              "id": "m4v2hxj",
              "author": "None",
              "body": "Apple is a vile company. Valve is a vile company. Nvidia is a vile company.  Every single corporation is a vile company by definition.\n\nIf you don't want to buy something that isn't tainted by evil, then don't buy anything.",
              "score": -6,
              "created_utc": 1735747515.0,
              "replies": [
                {
                  "id": "m4v3upt",
                  "author": "NecroCannon",
                  "body": "It’s not even that, I just don’t want my data used for profit, something pretty simple that all other competitors do for more money.\n\nI mean I’m not going to judge you if you prefer to save money by going for the option that uses user data and attempting to lock down their ecosystem. The Quest 3 is a good product despite that. But I’ll hold out on paying more for a more secure experience rather than getting one myself. I can’t stand all corporations, but only one of those don’t have my data and overrunning the internet with ads as a part of their profits, which shows how terrible things have gotten, but it’s not like other people put their money where their mouth is and keep giving them money.",
                  "score": 1,
                  "created_utc": 1735747999.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m4utk3r",
          "author": "matycauthon",
          "body": "still had some cool things implemented that i hope to see pop up in other forms with ar/vr tech. i don't use apple products much, but i respect the tech behind them",
          "score": 1,
          "created_utc": 1735744167.0,
          "replies": []
        },
        {
          "id": "m4xlper",
          "author": "Statsmakten",
          "body": "Plus it was only sold in US and was region locked for some reason. I literally couldn’t buy it.",
          "score": 1,
          "created_utc": 1735777579.0,
          "replies": []
        },
        {
          "id": "m4z6v6l",
          "author": "Bootychomper23",
          "body": "Zucks video shitting on the VIision was cringey but he wasn’t wrong. No universe is it better value to go with Apple for what you get.",
          "score": 1,
          "created_utc": 1735802943.0,
          "replies": []
        },
        {
          "id": "m4zc9d4",
          "author": "Asking4Afren",
          "body": "But honestly less than 1k it's pretty much a go for me it's dope",
          "score": 1,
          "created_utc": 1735806484.0,
          "replies": []
        },
        {
          "id": "m50d181",
          "author": "JamesHeckfield",
          "body": "You guys are spoiled. 3 grand is in the ballpark of how much a good computer would cost in the 90s.\n\nThis is a very advanced piece of technology made from premium materials.\n\nThe Quest is a toy by comparison.\n\nApple is playing the long game here, that should be clear. Those who say they are perplexed as to why Apple thought this would be a big success are either ignorant or being disingenuous. They never gave any indication that they expected this thing to be a hit.",
          "score": 1,
          "created_utc": 1735826969.0,
          "replies": []
        },
        {
          "id": "m4vnvdx",
          "author": "ChafterMies",
          "body": "You better believe I look down on Facebook’s VR headset. Expense aside, I’m not keen on strapping a computer onto my face. My money is better spent on a larger monitor.",
          "score": 0,
          "created_utc": 1735754720.0,
          "replies": []
        },
        {
          "id": "m4w0tmu",
          "author": "turbinedriven",
          "body": "Hot take the price wasn’t the problem. It was the product. Where do we even begin? It’s spatial computing but doesn’t spatially compute for a Mac, it only offers a bigger virtual screen. Amazing entertainment possibilities with next to no content for it. People thought sports were amazing and begged and pleaded for F1 and they’re even hacking their way to getting it but Apple won’t back this obvious use case. Apple hates AAA games so that’s a no go and the low end gaming market that Apple caters to was never going to go along with it. It’s portable but not really because it’ll take up half your carry on. And it’s gotta be the first Apple product that’s truly anti social. Oh and on top of all of that it doesn’t even have the content or compatibility of the quest 3. I’m sure a highly educated MBA will tell me I’m wrong but I just don’t see the value. Yeah AVP is amazing tech it’s just not compelling to use in the real world.",
          "score": 0,
          "created_utc": 1735758832.0,
          "replies": []
        },
        {
          "id": "m55vx6i",
          "author": "Unicycldev",
          "body": "The way I personally look at it is through the lens of historical product launches and their inflection adjusted prices. My take away is that wages have not kept up with inflation and we experience modern price points in an increasingly unequal wealth gap. \n\n1977 Apple 2: $7,000\n\n1984 Macintosh: $7,750\n\n1992 PowerBook 100: $5,254\n\n1997 iMac: $2,379\n\n2008 MacBook Air: $2,688",
          "score": 0,
          "created_utc": 1735900497.0,
          "replies": []
        },
        {
          "id": "m4uqpwd",
          "author": "Doublestack00",
          "body": "It was mostly targeted towards businesses.",
          "score": -7,
          "created_utc": 1735743009.0,
          "replies": [
            {
              "id": "m4urb25",
              "author": "WhiteFlash102",
              "body": "$3,500 is still way too much for even large businesses to pay.",
              "score": 3,
              "created_utc": 1735743257.0,
              "replies": [
                {
                  "id": "m4usoj8",
                  "author": "Doublestack00",
                  "body": "Hasn't stopped a ton of businesses and developers from using to to make a ton of money.",
                  "score": -7,
                  "created_utc": 1735743815.0,
                  "replies": [
                    {
                      "id": "m4uxofc",
                      "author": "clay_perview",
                      "body": "Which ones? Because when I look it up it seems like this is just used as an expensive training headset.",
                      "score": 6,
                      "created_utc": 1735745753.0,
                      "replies": [
                        {
                          "id": "m4v2139",
                          "author": "Doublestack00",
                          "body": "https://time.com/7093536/surgeons-apple-vision-pro/",
                          "score": 1,
                          "created_utc": 1735747347.0,
                          "replies": [
                            {
                              "id": "m4v2jiq",
                              "author": "clay_perview",
                              "body": "Right that is a great use, but I imagine Apple was looking for a much larger use case.",
                              "score": 2,
                              "created_utc": 1735747531.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m4v2g2u",
                      "author": "ErGo404",
                      "body": "They bought the device out of FOMO and I'm sure the developed some nice POCs. Where's the real use case ?",
                      "score": 2,
                      "created_utc": 1735747496.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m4veo6x",
          "author": "KyleMcMahon",
          "body": "lol the fact that you’re comparing the AVP To the quest 3 is wild",
          "score": -3,
          "created_utc": 1735751701.0,
          "replies": [
            {
              "id": "m4vgqby",
              "author": "None",
              "body": "You're right -- the Quest 3 actually had things you could do with it.",
              "score": 6,
              "created_utc": 1735752385.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m4urxaw",
      "author": "Peteostro",
      "body": "This article is based on a report released in October which said Apple would stop production at the end of the year. Mac rumors seems to have had this article ready to go since October and had it set to auto publish on January 1st. I guess regurgitating a news article months later with no new information is what counts for “news”. What a joke of a site",
      "score": 235,
      "created_utc": 1735743508.0,
      "replies": [
        {
          "id": "m4utcxr",
          "author": "Boogie-Down",
          "body": "The word ‘Rumor’ is literally in the name, not ‘news’",
          "score": 51,
          "created_utc": 1735744088.0,
          "replies": [
            {
              "id": "m4vqajl",
              "author": "Peteostro",
              "body": "Ok, I guess regurgitating “rumors” from months ago with absolutely no new info is what these rumor sites have become. What a joke of a site they have become",
              "score": 16,
              "created_utc": 1735755505.0,
              "replies": [
                {
                  "id": "m4xvcci",
                  "author": "Rdubya44",
                  "body": "First time I saw it so I guess it worked 🤷",
                  "score": -2,
                  "created_utc": 1735780997.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m4up0p7",
      "author": "slikk50",
      "body": "I have a Quest and my buddy had the Pro. I tried his and he tried mine. My buddy now has a Quest. Just saying.",
      "score": 124,
      "created_utc": 1735742275.0,
      "replies": [
        {
          "id": "m4uuaw5",
          "author": "VVLynden",
          "body": "Lots of new Quest users after Christmas.. can’t say the same for Apple Vision.",
          "score": 40,
          "created_utc": 1735744461.0,
          "replies": []
        },
        {
          "id": "m4v7dcy",
          "author": "kobriks",
          "body": "Quest 3 is 80% of Vision Pro for 15% of the price. Apple completely fumbled.",
          "score": 55,
          "created_utc": 1735749238.0,
          "replies": [
            {
              "id": "m4vmcjn",
              "author": "IMovedYourCheese",
              "body": "Quest ecosystem also has 10x the amount of content (games, apps) than Apple. Vision Pro has better specs, sure, but after getting over the initial wow factor it is a pretty useless device.",
              "score": 35,
              "created_utc": 1735754232.0,
              "replies": []
            },
            {
              "id": "m4x1r2b",
              "author": "LARGames",
              "body": "80 percent of the quality, but also like 50 percent MORE functionality. The Quest 3 just does more things than the Apple vision pro.",
              "score": 19,
              "created_utc": 1735770669.0,
              "replies": []
            },
            {
              "id": "m4xu3hb",
              "author": "ChaseballBat",
              "body": "The tech in the Apple product is pretty cutting edge, micro OLED are super expensive and titanium frame is ridiculously unnecessary.\n\nThey could have made this competitive with the quest ($6-800) but didnt and suffered the consequences.",
              "score": 7,
              "created_utc": 1735780547.0,
              "replies": [
                {
                  "id": "m4yvzdr",
                  "author": "agentfrogger",
                  "body": "Also the whole outer display which wasn't really necessary must've added a ton to the cost",
                  "score": 10,
                  "created_utc": 1735796570.0,
                  "replies": []
                },
                {
                  "id": "m50dzj1",
                  "author": "JamesHeckfield",
                  "body": "What consequences? \n\nIs Apple not printing money anymore because this product didn’t meet the expectations of redditors?\n\nIt’s not going away. They will iterate on it, I guarantee it ",
                  "score": 0,
                  "created_utc": 1735827337.0,
                  "replies": [
                    {
                      "id": "m56a6j2",
                      "author": "lowbatteries",
                      "body": "Exactly. They have money to try big.",
                      "score": 1,
                      "created_utc": 1735908288.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m4zcdyx",
          "author": "Asking4Afren",
          "body": "Yeah I picked up a quest 3 for Christmas as a gift from my wife. After testing the demo for the AVP I wanted vr bad. I don't use it for gaming but it does what I need it to do in streaming and browsing the web. Unbelievable product. Avp had nothing to offer at that price. Literally nothing is out. It is better visually though I'll say that.",
          "score": 3,
          "created_utc": 1735806571.0,
          "replies": []
        },
        {
          "id": "m4v0yp3",
          "author": "MHWGamer",
          "body": "the Pro is like a f40 ferrari. Sure, anybody finds it cool and it has a legendary status (in VR terms crazy good hardware) but owning one and actual driving it daily... yikes!\nYou prefer your Skoda after 2 days",
          "score": 6,
          "created_utc": 1735746963.0,
          "replies": [
            {
              "id": "m4vfm5i",
              "author": "ssuuh",
              "body": "I don't think it's a good analogy.\n\n\nEither q3 has just a lot more content or something else is off but very expensive in VR still means better visual quality and weight ",
              "score": 7,
              "created_utc": 1735752014.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m4wg8gt",
          "author": "kvothe5688",
          "body": "i am waiting for the android XR to be released. full support to android apps on playstore is very tempting. also with deep integration with gemini AI sounds very tempting.",
          "score": 1,
          "created_utc": 1735763835.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4uth0j",
      "author": "Grunkenn",
      "body": "As someone who has been testing one over the holidays with the extended return policy, the tech in this thing is amazing. Unfortunately the price and comfort are a huge barrier for adoption. I see SO many use cases for something like this once the form factor resembles glasses and the price is a few hundred dollars. This gen-1 release is a necessary step to achieving that IMO.",
      "score": 45,
      "created_utc": 1735744133.0,
      "replies": [
        {
          "id": "m4xal5f",
          "author": "bogglingsnog",
          "body": "There's also the cracking issue though. These things need to be made to take a few hits, something Apple doesn't have any experience with.",
          "score": 8,
          "created_utc": 1735773654.0,
          "replies": []
        },
        {
          "id": "m4v69xp",
          "author": "None",
          "body": "[deleted]",
          "score": -5,
          "created_utc": 1735748858.0,
          "replies": [
            {
              "id": "m4vbbah",
              "author": "Grunkenn",
              "body": "Not my first experience, but my point was about the vast array of AR tech (cameras/sensors/processors) found in this device and how the software seamlessly brings it together. It’s quite natural and it just works. \n\nBut the Vision Pro is notably (front) heavy and puts quite a bit of pressure on the face. I’ve always preferred the halo strap solutions, and have zero issues wearing a headset like that for hours. \n\nI’m primarily exploring it as a solution in live video production, but much of the tools I currently rely on (mostly OSC compliant ones) are not optimized for Vision OS. The iPad versions provide a preview of what is possible, but again, not practical for an AR application.\n\nI’m happy go into more detail about what gets me personally excited about something like this in my field, but I also recently visited a museum and couldn’t stop thinking about how amazing a robust AR experience would be.",
              "score": 6,
              "created_utc": 1735750582.0,
              "replies": [
                {
                  "id": "m4warnb",
                  "author": "veryverythrowaway",
                  "body": "It’s nice to hear a real experience from someone who intends to use this for something other than “games”. A lot of the hand-wringing over this product has been comparing it to gaming headsets, and I agree the future of this product goes way beyond that. Remains to be seen what kind of traction Apple will get, but their products usually feel “mature” in generation 4 or 5.",
                  "score": 2,
                  "created_utc": 1735762056.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m4uqbz7",
      "author": "DasGaufre",
      "body": "Opening it up to third party connections would've given the whole vr ecosystem the best display on a headset yet. That alone would've sold it and might've actually enticed people to develop something useful for it.",
      "score": 48,
      "created_utc": 1735742833.0,
      "replies": [
        {
          "id": "m4w5bvu",
          "author": "bv915",
          "body": "I wouldn't be surprised if this was the \"next thing\" for AVP v2.\n\nv1:  Build the thing, introduce it to Apple enthusiasts, collect telemetry.\n\nv2:  Build it better, smaller, cheaper; open the market to a few other devs.\n\nv3:  Iterate on v2.",
          "score": 10,
          "created_utc": 1735760281.0,
          "replies": [
            {
              "id": "m4wvlra",
              "author": "Motor-Replacement223",
              "body": "You can’t fail this hard on v1 and have success after. They aren’t going to be a real VR player within a decade. Never were. People pointed and laughed at people wearing these things.",
              "score": 2,
              "created_utc": 1735768661.0,
              "replies": [
                {
                  "id": "m4xg22d",
                  "author": "bv915",
                  "body": "That's certainly one opinion, and may be correct, but I bet Apple already has v2 in the works and will announce sometime in 2025 (summer?).  \n\nThere's no way they're going to bow out of the wearable headset / VR space.  \n\nIf I had to guess -- they'll release a premium \"Pro\" version for the die-hards and an \"SE\" version that'll take on the  economy competitors.  Announce at WWDC 2025.  Pro will hover just below the cost of v1 and the \"SE\" will be sub-$1000.  \n\nThen, in 2026, we'll see sub-$2000 and ~$500, respectively.  \n\nI'd put money on it.",
                  "score": 4,
                  "created_utc": 1735775567.0,
                  "replies": [
                    {
                      "id": "m4xygpf",
                      "author": "pvlrss",
                      "body": "I don’t think a cheap headset from Apple will cost less than $500. AirPods Max cost more.",
                      "score": 3,
                      "created_utc": 1735782143.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4yw6cc",
                  "author": "jaydizzleforshizzle",
                  "body": "This is a funny comment, people would laugh at anyone walking around with a VR headset, most people couldn’t tell you which vr headset it is.",
                  "score": 1,
                  "created_utc": 1735796673.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m56adzl",
          "author": "lowbatteries",
          "body": "Was there not an entire SDK?",
          "score": 1,
          "created_utc": 1735908384.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4w36xw",
      "author": "Stonebeast1",
      "body": "I tried to test one at the Apple Store randomly (was with family shopping and I was just killing time while they shopped) and the lady said no you can’t touch them they are just for display…. Like how am I supposed to be sold if I can’t even test it?",
      "score": 26,
      "created_utc": 1735759590.0,
      "replies": [
        {
          "id": "m4whw54",
          "author": "Acheron-X",
          "body": "Was just at the Apple store, you need to sign up for a 30 min timeslot to demo. Definitely a bit annoying, didn't want to leave my group behind so had to skip on it.",
          "score": 12,
          "created_utc": 1735764370.0,
          "replies": [
            {
              "id": "m4x3gik",
              "author": "skyclubaccess",
              "body": "The setup is a bit convoluted.. you need to scan your face to get the right band & seal. You also need to calibrate your hands and eyes. If you wear prescription glasses, you need to measure your lens prescription to get the right demo prescription lens. It’s not something where someone could casually try out on their own for a few minutes.",
              "score": 17,
              "created_utc": 1735771244.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m4wf5lk",
          "author": "Brooklyn11230",
          "body": "A similar thing happened to me a few years back when I wanted to test drive - before buying - a brand new Harley Road King Classic.  The dealer told me that that I could test drive the bike all I wanted to after I bought it.\n\nSo, I drove to a Triumph dealer, asked for a test ride on their best cruising bike at the time - a [Sprint ST](https://en.m.wikipedia.org/wiki/Triumph_Sprint_ST), and 30 minutes later, I brought the bike.",
          "score": 10,
          "created_utc": 1735763487.0,
          "replies": [
            {
              "id": "m4wmb7o",
              "author": "None",
              "body": "Harley sells shirts",
              "score": 8,
              "created_utc": 1735765804.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m4wxanz",
      "author": "FEEEETY",
      "body": "Most people’s takeaway from this “rumor” is that Apple is ceasing all VR/AR operations and I definitely don’t think that’s the case. This version of the Vision Pro may be phased out sooner than expected, but only to make room for whatever they have planned next. I don’t believe Apple would dare enter a product space that they can’t do well in. The high price tag definitely coincides with the R&D and the premium build, but it isn’t sustainable even for Apple’s most loyal consumer base. The fact Vision Pro exists is amazing and should be celebrated while it’s relevant but I think it is only a glimpse at what will be possible. Meta definitely has the right idea with the Orion AR Glasses by offloading the processing power of the headset to an external device and I hope that’s the direction we’re headed.",
      "score": 6,
      "created_utc": 1735769211.0,
      "replies": []
    },
    {
      "id": "m4yhyxu",
      "author": "malibul0ver",
      "body": "Remember the gold Apple Watch for like 20k that probably is totally useless by now —- who is this guy at apple trying to setup these price levels — fire him/her!!!",
      "score": 6,
      "created_utc": 1735789922.0,
      "replies": []
    },
    {
      "id": "m4wb9o9",
      "author": "cowadoody3",
      "body": ">The Information said that Vision Pro suppliers have now produced enough components for between 500,000 to 600,000 headsets.\n\nGosh, this brings it in line with the Nintendo Virtual Boy, another failed 3D gaming headset from the 90s, that only sold 770,000 units. The Virtual Boy was ALSO criticized for being too expensive, and not having enough content (it only had 13 games total released).\n\nBtw, I never thought I'd be comparing the Virtual Boy to the Apple Vision Pro. lol",
      "score": 18,
      "created_utc": 1735762221.0,
      "replies": []
    },
    {
      "id": "m4uq9mf",
      "author": "xjaw192000",
      "body": "I don’t think this is the last we will hear from the ‘Vision’ line, just the tech is not ready for the mass adoption they probably have in mind",
      "score": 24,
      "created_utc": 1735742804.0,
      "replies": [
        {
          "id": "m4urui8",
          "author": "Da_Steeeeeeve",
          "body": "This was always an early adopter / enthusiast product.\n\nI would bet they take the lessons learnt and data and release a cheaper version within a few years.",
          "score": 25,
          "created_utc": 1735743478.0,
          "replies": [
            {
              "id": "m4uwymk",
              "author": "Nikiaf",
              "body": "A cheaper version that still doesn’t do anything beyond party tricks isn’t likely to move the needle. This entire category still hasn’t really succeeded in justifying its existence to the average consumer.",
              "score": 22,
              "created_utc": 1735745487.0,
              "replies": [
                {
                  "id": "m4vydco",
                  "author": "beatsnstuffz",
                  "body": "I have one and love watching movies/youtube or streaming PlayStation or steam through it. The quality is unparalleled and really offers the best media consumption of any device I own, including my home theater setup.",
                  "score": 4,
                  "created_utc": 1735758048.0,
                  "replies": []
                },
                {
                  "id": "m4uxe0t",
                  "author": "Da_Steeeeeeve",
                  "body": "First smart phones barely had any apps.\n\nLots of examples.\n\nApple here are learning about the tech and usage, I don't think they will target the games market I think they will go for productivity, I can think of a million ways hand gestures and an unlimited sized working screen could be useful.\n\nThat's without even touching augmented reality, someone in a warehouse with an overlay or a doctor who can see patient notes or look things up while with a patient.\n\nWe don't know what the future will look like but if apple think it includes headsets I imagine they are not entirely off the mark, remember how much user data they have over the years.",
                  "score": 4,
                  "created_utc": 1735745645.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m4uvrfz",
          "author": "lanadelkray",
          "body": "It shows the market that eventually they can compete in this space, same thing with the poorly functional Apple Intelligence\n\nAI and tech is hot in the markets, and Apple wants to show they can (eventually) compete",
          "score": 1,
          "created_utc": 1735745030.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4yzxx1",
      "author": "filmguy123",
      "body": "My understanding following previous rumors is that this is out of production, but not discontinued - simply because they have excess stock and are updating it with a new CPU next year.\n\nThe current model has plenty of inventory due to low sales and does not need further production. A lot of people are mistakenly reading this as “discontinued”.\n\nThe refresh is rumored to have no big changes, just a newer CPU.",
      "score": 4,
      "created_utc": 1735798750.0,
      "replies": []
    },
    {
      "id": "m4w88yd",
      "author": "EngineeringNext7237",
      "body": "Lots of comments seem to be only reading the headline. This is common for apples low volume items. The dev teams are still at work on a new VisionOS and content. The hardware team has slowed on gen2 to focus on a cheaper version.",
      "score": 12,
      "created_utc": 1735761234.0,
      "replies": []
    },
    {
      "id": "m4wjnc5",
      "author": "Lukashavla",
      "body": "Not allowing porn was killer decision",
      "score": 13,
      "created_utc": 1735764939.0,
      "replies": [
        {
          "id": "m4x02xn",
          "author": "ibarker3",
          "body": "You can sideload it into the quest. It's... Interesting...",
          "score": 7,
          "created_utc": 1735770106.0,
          "replies": []
        },
        {
          "id": "m4zped5",
          "author": "hiphoptomato",
          "body": "You can’t watch porn on the Vision Pro?",
          "score": 3,
          "created_utc": 1735815167.0,
          "replies": [
            {
              "id": "m4zqdc0",
              "author": "Lukashavla",
              "body": "Tbh I’m not sure how it works or doesn’t. But I remember reading something obout porn being blocker or something. \n\nhttps://nypost.com/2024/02/05/tech/apple-vision-pro-blasted-as-3500-chastity-belt-for-blocking-porn/#:~:text=Apple’s%20much%2Dheralded%20Vision%20Pro,a%20“%243%2C500%20chastity%20belt.”\n\nNot sure if it nowdays works or not.",
              "score": -1,
              "created_utc": 1735815766.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m4wqh9p",
          "author": "SuicidalChair",
          "body": "Apple never seen Tropic Thunder and it shows",
          "score": 1,
          "created_utc": 1735767119.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4vcp8b",
      "author": "champs",
      "body": "> VR headset \n\nUm, ackshually, it’s not VR. It’s spatial computing, more like AR. Are you intentionally misunderstanding this revolution just to frustrate me, a person who is definitely not emotionally over invested in the success of this thing?",
      "score": 10,
      "created_utc": 1735751045.0,
      "replies": [
        {
          "id": "m4x2a5l",
          "author": "LARGames",
          "body": "It's both. AR and VR. Just because you're doing something in AR doesn't mean it's a whole different thing. If doing work in AR is \"A revolution\", then that revolution happened a long time ago. Way before apple released this functionality deprived headset.",
          "score": 5,
          "created_utc": 1735770849.0,
          "replies": [
            {
              "id": "m4xfn8o",
              "author": "champs",
              "body": "I’m pretty sure we’ve been through a decade of consumer headsets and moving goalposts vis-a-vis cost, features, and applications. Fit the bill on cost, it’s poor in features, fit the bill on features, it costs three times more than a laptop, yet somehow in the end Beat Saber is *still* the “killer app.”\n\nI don’t think it’s much of anything tbh.",
              "score": 2,
              "created_utc": 1735775418.0,
              "replies": [
                {
                  "id": "m4xifw6",
                  "author": "LARGames",
                  "body": "Beat Saber is hardly the killer app. I don't think there is one. Though there are a plethora of fantastic experiences that as a whole, make VR as a platform worth it. Though 99 percent of them are on Meta and PC. \n\nOf course, those fall under VR. \"Spatial computing\" has always been used rarely as a niche application. Things like 3d design and showcasing. \n\nTo be a replacement for a monitor, it needs to surpass a monitor for the specific requirements of a monitor without having additional downsides. While you can have a display any resolution and as many as you want (Not on the apple headset of course), battery life and comfort are a downside. ESPECIALLY on the apple headset. Just because they wanted to go with form over function. \n\nMaking the headset out of incredibly heavy materials like metal and glass was just plain stupid. Having a headstrap without any top support was just plain stupid. Having no internal battery at all was incredibly stupid. If it had even a tiny one, you'd be able to hot swap the external battery instead of having to turn off the device.",
                  "score": 2,
                  "created_utc": 1735776415.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m4uozog",
      "author": "_RADIANTSUN_",
      "body": "iT's FoR dEvElOpErS aNd EnTeRpRiSe",
      "score": 14,
      "created_utc": 1735742263.0,
      "replies": [
        {
          "id": "m4vvmvk",
          "author": "geekwonk",
          "body": "this but unironically.",
          "score": -2,
          "created_utc": 1735757184.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4wxbvg",
      "author": "OwnPension8884",
      "body": "Imagine buying one for $3500, and it end up on Apples end of life list after 6 years.",
      "score": 5,
      "created_utc": 1735769222.0,
      "replies": []
    },
    {
      "id": "m4v2d2u",
      "author": "Relevant-Doctor187",
      "body": "All the early monetization happened outside Apples ecosystem. The low sales was not enough to get devs to port anything over. Apple managed to wait themselves out of this.",
      "score": 2,
      "created_utc": 1735747466.0,
      "replies": []
    },
    {
      "id": "m4vlmij",
      "author": "Ok_Potential359",
      "body": "This wasn’t even out 1 year. Crazy. Why are they abandoning it so quickly?",
      "score": 2,
      "created_utc": 1735754001.0,
      "replies": [
        {
          "id": "m4wg5yb",
          "author": "parasubvert",
          "body": "they’re not abandoning it. Click bait ; they are managing inventory levels for a speed bump version.",
          "score": 1,
          "created_utc": 1735763813.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4wpxwo",
      "author": "xtralongleave",
      "body": "Looking forward to the fifth version of this when it’s priced to consumers and has had years of production evolution. Think about when the iPhone 5 launched and everyone had to have it. That’s the version of the Apple Vision Pro I am looking forward to.",
      "score": 2,
      "created_utc": 1735766949.0,
      "replies": []
    },
    {
      "id": "m4wzppg",
      "author": "Mysterious_Ad1164",
      "body": "Goodbye good riddance!! Another VR project.",
      "score": 2,
      "created_utc": 1735769986.0,
      "replies": []
    },
    {
      "id": "m4ycvnd",
      "author": "gimmeslack12",
      "body": "It’ll be back.",
      "score": 2,
      "created_utc": 1735787774.0,
      "replies": []
    },
    {
      "id": "m4yg1iq",
      "author": "tdubasdfg",
      "body": "As far as being version1 of a cutting-edge piece of future tech goes, AVP is awesome. As far as being a product ready for mass adoption goes, AVP is not that. \n\nAnd Apple KNOWS this….so many people commenting on AVP are completely missing the point.",
      "score": 2,
      "created_utc": 1735789098.0,
      "replies": []
    },
    {
      "id": "m4yhfp5",
      "author": "Yung_james69",
      "body": "Good. Nobody is paying $3500 for that shit.",
      "score": 2,
      "created_utc": 1735789693.0,
      "replies": []
    },
    {
      "id": "m500kyb",
      "author": "spinosaurs70",
      "body": "Lots of people seem to be acting like shutting down the production of something isn’t a sign of failure for a product.",
      "score": 2,
      "created_utc": 1735821539.0,
      "replies": []
    },
    {
      "id": "m51xuix",
      "author": "See_Wildlife",
      "body": "Ran out of suckers no doubt.",
      "score": 2,
      "created_utc": 1735845233.0,
      "replies": []
    },
    {
      "id": "m523tmx",
      "author": "you_the_real_mvp2014",
      "body": "The dumbest thing I've ever read around the Vision Pro came from the copium sub on here saying that the Vision Pro will make an impact similar to the iPhone. So delusional\n\nThe smartphone just stomps this kind of hardware because even though this has the ability to change how you experience the world around you, the price + battery life + lack of apps makes it underwhelming. The best thing that can be done with the Vision Pro is to use it to enhance the other important devices in your life (like your MacBook)\n\nThis is why the phone will always win. The phone is closer to a MacBook than this headwear. I can create doctor's appointments, listen to music, make content, become famous, etc etc on my phone. And some people are able to do all of this in the damn shower\n\nThe Vision Pro is a waste and everyone is like \"it just needs a killer app\" That's stupid and it shows that people don't understand product. You don't release something with the hope that something will be released, in the future, that will make what you bought useful. That's cope.\n\nThe reason the iPhone worked so well was because you immediately knew why it was great because of what was already out at the time. People may have thought it was stupid but that's because there were competing solutions that were looking to solve the same problem, but in a different way.\n\nBut what problem is the Vision Pro solving? What can the Vision Pro do that none of my current devices can't do, to any degree?",
      "score": 2,
      "created_utc": 1735847135.0,
      "replies": []
    },
    {
      "id": "m55q114",
      "author": "Houdini_n_Flame",
      "body": "Tim apples 50million dollar salary should go to pay his slaves instead",
      "score": 2,
      "created_utc": 1735896799.0,
      "replies": []
    },
    {
      "id": "m4v2f5e",
      "author": "Zodaztream",
      "body": "Isn’t the reason because they are making a cheaper version instead and a new version, so they are discontinuing this first version ?",
      "score": 7,
      "created_utc": 1735747486.0,
      "replies": [
        {
          "id": "m4vf7qf",
          "author": "KyleMcMahon",
          "body": "Yes, but this is Reddit where we don’t read the articles",
          "score": 5,
          "created_utc": 1735751882.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4uvx5j",
      "author": "swiftninja_",
      "body": "They still have a bunch of VR engineers hired, no sudden “Looking for work” posts on LinkedIn so it’s still in development.",
      "score": 2,
      "created_utc": 1735745091.0,
      "replies": []
    },
    {
      "id": "m4vxk4z",
      "author": "dolcewheyheyhey",
      "body": "This was nice but stupidly heavy. My neck was starting to hurt towards the end of the demo. Light weight should be one of the highest priorities not premium feel.",
      "score": 4,
      "created_utc": 1735757790.0,
      "replies": []
    },
    {
      "id": "m4yak3p",
      "author": "None",
      "body": "Tried one. Was amazed! (Only tried first gen oculus before that like 15 years ago).\n\nThen I just fuckin sent it on a Quest 3 without trying THAT out and I was equally amazed. It’s different obviously, but DAMN VR has gone a long way.\n\nIn fucking sane to me Apple tried pushing that for bands when a Q3 is like $350.",
      "score": 3,
      "created_utc": 1735786833.0,
      "replies": [
        {
          "id": "m4zcrdb",
          "author": "Asking4Afren",
          "body": "Yeah same here. Love my quest 3. Just insane where we got to. I think if they put better quality into the lenses quest would be 10/10",
          "score": 2,
          "created_utc": 1735806824.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4w8hqg",
      "author": "kiltedswine",
      "body": "Great tech, but an outrageous price point!",
      "score": 2,
      "created_utc": 1735761314.0,
      "replies": []
    },
    {
      "id": "m4uqb8a",
      "author": "Soaddk",
      "body": "Or it may not…",
      "score": 2,
      "created_utc": 1735742823.0,
      "replies": []
    },
    {
      "id": "m4w11kf",
      "author": "Jorgen_Pakieto",
      "body": "It failed because it is way too expensive.\n\nMight as well have been calculating solely for the upper class demographic.",
      "score": 2,
      "created_utc": 1735758901.0,
      "replies": []
    },
    {
      "id": "m4wxj3b",
      "author": "joern16",
      "body": "Who was dumb enough to make it 3k and expect it to sell?!",
      "score": 2,
      "created_utc": 1735769288.0,
      "replies": []
    },
    {
      "id": "m4x5f4x",
      "author": "yick04",
      "body": "The best thing the Apple Vision Pro do was push people to buy a Meta Quest 3 (and now 3S). And VR gamers were rewarded with Batman: Arkham Shadow and Alien: Rogue Incursion this year.",
      "score": 2,
      "created_utc": 1735771907.0,
      "replies": []
    },
    {
      "id": "m4y8pur",
      "author": "Terbatron",
      "body": "Are you able to watch porn on it yet?",
      "score": 2,
      "created_utc": 1735786110.0,
      "replies": []
    },
    {
      "id": "m4yrfyz",
      "author": "olraygoza",
      "body": "You couldn’t even connect it to to the PS5 to play some VR games. I would have considered buying one if you could connect it to other VR devices or be compatible with other VR experiences outside of Apple.",
      "score": 2,
      "created_utc": 1735794265.0,
      "replies": []
    },
    {
      "id": "m4yxxgh",
      "author": "walrus_yu",
      "body": "So you’re telling me apple actually innovate garbage products!!!???",
      "score": 2,
      "created_utc": 1735797616.0,
      "replies": []
    },
    {
      "id": "m4znz4j",
      "author": "YoungRichBastard26s",
      "body": "Apple got comfortable but that hype is dead when I was in school you had to have the new iPhone to be “cool” I’m glade everybody matured and realized Apple was just finessing us and slapping a high price tag on the the same phone every year that broke after hitting the ground once",
      "score": 2,
      "created_utc": 1735814281.0,
      "replies": []
    },
    {
      "id": "m4w0ml7",
      "author": "flux_capacitor3",
      "body": "That was faster than I expected. I knew it wouldn't survive. It was hard enough for me to drop $200 on my Quest 2. I haven't even used it in a year.",
      "score": 2,
      "created_utc": 1735758770.0,
      "replies": []
    },
    {
      "id": "m4ungsf",
      "author": "DriftMantis",
      "body": "Let me pull out the world's tiniest violin for the eulogy.",
      "score": 2,
      "created_utc": 1735741605.0,
      "replies": []
    },
    {
      "id": "m4vao42",
      "author": "DragonSyndrome",
      "body": "All they had to do was cheap out on it on key parts, like they have with the 3GS, then sell it at a loss to accrue market share. The Apple brand can only do so much for an unproven new product category, full honest I can’t tell which is the biggest blunder between this and Apple intelligence",
      "score": 1,
      "created_utc": 1735750364.0,
      "replies": []
    },
    {
      "id": "m4vkcn8",
      "author": "speel",
      "body": "I might be experiencing the Mandela effect but I thought this happened already?",
      "score": 1,
      "created_utc": 1735753586.0,
      "replies": []
    },
    {
      "id": "m4vqwj3",
      "author": "Th3Batman86",
      "body": "I really feel like Microsoft could have told them that developing bulky VR no one can afford isn’t going to work out (looking at you HoloLense)",
      "score": 1,
      "created_utc": 1735755699.0,
      "replies": []
    },
    {
      "id": "m4w32wd",
      "author": "DryTap2188",
      "body": "I’m usually the first to buy dumb products like this out of curiosity and god damn I’m really glad I didn’t make this purchase.",
      "score": 1,
      "created_utc": 1735759556.0,
      "replies": []
    },
    {
      "id": "m4w69kj",
      "author": "NShizzzle",
      "body": "Oof!",
      "score": 1,
      "created_utc": 1735760584.0,
      "replies": []
    },
    {
      "id": "m4woh13",
      "author": "btsalamander",
      "body": "I never would have been able to afford one anyway so this doesn’t upset me at all.",
      "score": 1,
      "created_utc": 1735766487.0,
      "replies": []
    },
    {
      "id": "m4wyt0l",
      "author": "MMA-Guy92",
      "body": "![gif](giphy|MeWhwkW9vPV10xjEJu)",
      "score": 1,
      "created_utc": 1735769689.0,
      "replies": []
    },
    {
      "id": "m4x5ejw",
      "author": "Simply_Epic",
      "body": "This was never going to be the product to take the VR/AR market by storm. It’s way too expensive to be that. But hopefully making a product that went all out helped them figure out exactly what they need for a reasonably priced product and what they can cut.",
      "score": 1,
      "created_utc": 1735771902.0,
      "replies": []
    },
    {
      "id": "m4x80d3",
      "author": "TheModeratorWrangler",
      "body": "Side question- is it worth going with Meta Quest 3 if you only have a MacBook? I’d like to play WOT:B in VR.",
      "score": 1,
      "created_utc": 1735772799.0,
      "replies": []
    },
    {
      "id": "m4xe3pm",
      "author": "JodieFostersFist",
      "body": "lol",
      "score": 1,
      "created_utc": 1735774870.0,
      "replies": []
    },
    {
      "id": "m4xkrmx",
      "author": "ragnarok62",
      "body": "People who run companies seem completely out of touch with the financial realities facing a good chunk of the world. \n\nWe can’t afford this stuff. The middle class is being priced out of everything, and in the United States at least, that’s probably 70% of the country.\n\nAll these tony companies marketing tony products to tony buyers are going to find that they can’t sustain the numbers they want by selling to the rich only.",
      "score": 1,
      "created_utc": 1735777248.0,
      "replies": []
    },
    {
      "id": "m4xm4fm",
      "author": "_byetony_",
      "body": "I wish they’d put effort into marketing this",
      "score": 1,
      "created_utc": 1735777725.0,
      "replies": [
        {
          "id": "m4xnto8",
          "author": "TheReturningMan",
          "body": "I did a little digging and within the first 2 weeks of launch, it dropped to the third row of Apples website. iPhone 15 Pro and iPhone 15 were in the first two. And within the first month, it was gone. I think it had a slight boost when visionOS 2 was announced over the summer, but since then, it hasn’t been featured on the website. There was no event to announce the thing when it launched. visionOS 2 got what the Apple TV usually gets during WWDC. I genuinely think Apple doesn’t know what to do with Vision Pro. They just kinda put it out there and did a pivot to AI.",
          "score": 1,
          "created_utc": 1735778321.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4xq8hc",
      "author": "yupidup",
      "body": "It was an innovation product, I believe. Got a few spins of users try out, some industrial which didn’t mind the price probably integrated it in some advance use.\n\nI’m expecting a different product years from now iterating on all this at a real consumer price",
      "score": 1,
      "created_utc": 1735779176.0,
      "replies": []
    },
    {
      "id": "m4xqg6w",
      "author": "woodnoob76",
      "body": "Well I just got the quest and was surprised to find most features that mattered to me… except of course the integration to the Mac ecosystem, with bothers me but not to the tune of 7 times the price",
      "score": 1,
      "created_utc": 1735779252.0,
      "replies": []
    },
    {
      "id": "m4xqg9c",
      "author": "d_e_l_u_x_e",
      "body": "Like the Apple Newton it was a product in search of a consumer",
      "score": 1,
      "created_utc": 1735779253.0,
      "replies": []
    },
    {
      "id": "m4xya8m",
      "author": "Dick_Lazer",
      "body": "Probably stopped production on V1, until they start building stock for the next version.",
      "score": 1,
      "created_utc": 1735782077.0,
      "replies": []
    },
    {
      "id": "m4y1400",
      "author": "bingeboy",
      "body": "Sad. 😢",
      "score": 1,
      "created_utc": 1735783138.0,
      "replies": []
    },
    {
      "id": "m4y7a2r",
      "author": "majortomsgroundcntrl",
      "body": "Isnt this old news?",
      "score": 1,
      "created_utc": 1735785548.0,
      "replies": []
    },
    {
      "id": "m4yfxzf",
      "author": "FUCKYOUINYOURFACE",
      "body": "I’d pay maybe $500. $3500 was just a way to grift some Apple fanboys who were willing to pay the tax.",
      "score": 1,
      "created_utc": 1735789057.0,
      "replies": []
    },
    {
      "id": "m4yjgcw",
      "author": "The-Fumbler",
      "body": "If I lived alone, didn’t have a tv, wasn’t expecting guests ever, then MAYBE I would consider it for watching movies. But fuck man at that price point you can get a really nice tv and an amazing sound system to go with it. So, no thanks.",
      "score": 1,
      "created_utc": 1735790570.0,
      "replies": []
    },
    {
      "id": "m4yrw8n",
      "author": "LeadChambers",
      "body": "Well yeah, it’s a billion dollars! Who has that kind of money?",
      "score": 1,
      "created_utc": 1735794490.0,
      "replies": []
    },
    {
      "id": "m4ytqdd",
      "author": "WillieSpaz",
      "body": "ii mean what did they expect for 3500? ii love apple as much as any cultist, but at some point reality has to come into play.",
      "score": 1,
      "created_utc": 1735795410.0,
      "replies": []
    },
    {
      "id": "m4yvei2",
      "author": "PeaceJoy4EVER",
      "body": "They should have made it $100 and then opened it up to developers. The money isn’t in the hardware, has Bill Gates taught you anything?",
      "score": 1,
      "created_utc": 1735796266.0,
      "replies": []
    },
    {
      "id": "m4yvq47",
      "author": "Lock0n",
      "body": "Was hoping they mad a none pro vision that was at most $600-$800 usd lol",
      "score": 1,
      "created_utc": 1735796435.0,
      "replies": []
    },
    {
      "id": "m4zaza8",
      "author": "-6h0st-",
      "body": "My take:\n- 3.5k is way too expensive, for 2k it’s good value to me as it can replace monitor/s and my iPad Pro and that’s what I got it for\n\n- it’s not a lonely device to me as watch movies with my partner - just start one simultaneously both on tv and AVP - can enjoy sound coming off my HT\n\n- there are apps that do AI 3D on my Plex library and that is something that neither tv nor projector can do at the moment - cool af - not to mention native 3d movies. Plus you enjoy movies on massive screen with perfect oled contrast and no black crush whatsoever. Also being only person to care about HT and picture quality - I don’t need to spend on bigger better tv that would no doubt cost me 4k+ as I was planning to do.\n\n- being able to work from anywhere practically- not bound to desk anymore\n\n- and yes Oculus is £400 device that would not work for me to do all those things for me so it’s price and comparison is a moot.",
      "score": 1,
      "created_utc": 1735805631.0,
      "replies": []
    },
    {
      "id": "m4zj5rw",
      "author": "idebugthusiexist",
      "body": "Not surprised. VRs useful application for anything other than being a gadget to play around with and enjoy some experiences is still a central problem. And to pay $3500 for what is essentially a toy is a bit much for most people (with any common sense anyways). Heck, I have a MQ3 and I don’t even really think it was worth it to me, but at least my kiddo is having some fun playing GorillaTag and burning off some energy. Neat technology, but still just a toy/gadget.",
      "score": 1,
      "created_utc": 1735811129.0,
      "replies": []
    },
    {
      "id": "m4zluhs",
      "author": "wolfiasty",
      "body": "May ? I could bet that there are warehouses full of Visions just laying in boxes. Production was stopped some time ago for sure.\n\n$3500 was waaaaay to high of a price. Even for Apple users. Simple as that.",
      "score": 1,
      "created_utc": 1735812901.0,
      "replies": []
    },
    {
      "id": "m4zo2it",
      "author": "TareXmd",
      "body": "Good. Now the Deckard could be priced closer to the Quest rather than the AVP. I also think Apple is pulling out ahead of the Valve Deckard announcement this quarter, so it looks better.",
      "score": 1,
      "created_utc": 1735814341.0,
      "replies": []
    },
    {
      "id": "m4zplne",
      "author": "hhulk00p",
      "body": "Was the whole point of the Vision Pro to bring forward a very limited number of expensive units to show off the technology and create the premium brand image before they start mass producing cheaper units?",
      "score": 1,
      "created_utc": 1735815293.0,
      "replies": []
    },
    {
      "id": "m507z8x",
      "author": "jelloslug",
      "body": "That will certainly make more companies want to produce apps for it.",
      "score": 1,
      "created_utc": 1735824911.0,
      "replies": []
    },
    {
      "id": "m5096g7",
      "author": "thirteennineteen",
      "body": "This message is astroturfed by Meta ever few weeks 🙄\n\nApple is committed to the light sealed passthrough focused XR model of wearable which visionOS realizes today in AVP as the platform to succeed iOS (in as much as iOS has “succeeded” macOS). The market for visionOS is currently at the start of the adoption curve. AVP is not going anywhere but into further development. \n\nI’ve at least demoed every popular headset design (open/closed, wave guide/displays) and model, and AVP delivers the best user experience (if not your perfect feature set), hands down. Visual and spatial fidelity, UI, input, image and audio quality, platform security, it stands far beyond any similarly priced solution (what are you plugging that affordable Meta headset into?). \n\nApple will spend at least the next 10 years (of continuous visionOS support, production and development) in this pursuit. The devices will get smaller, more minimal, and the OS capabilities will slowly expand. Eventually, a more affordable model will arrive on a more mature platform, where more developers/researchers are engaged. \n\nYou may recall iPhone 1 being lambasted as expensive and pointless, indeed it didn’t have a copy/paste, or App Store, or any other dozen “missing” features (physical keyboard, for those who really missed the point). Apple added new things to iOS very slowly, and did so with a fundamental obsession over the security, and “why” of every single feature/service/program/change. \n\nIf you’ve been around the block of AR/VR/XR, you will recognize the visionOS user experience as the platform/model that will lead all XR product development in the world, just like iPhone did for mobile phones.",
      "score": 1,
      "created_utc": 1735825414.0,
      "replies": []
    },
    {
      "id": "m50alan",
      "author": "Key_Acadia_27",
      "body": "I’d highly respect Apple for giving it a go and then just being honest and stepping back and saying this idea isn’t developed enough on an industry level and we’re not going to waste millions or billions more to compete in this market for a what amounts to a toy. \n\nWalk away Apple, it didn’t work and that’s totally fine.",
      "score": 1,
      "created_utc": 1735825995.0,
      "replies": []
    },
    {
      "id": "m50bzrz",
      "author": "CrossonTheGroove",
      "body": "As others are probably saying, I’d buy it in a heart beat if it was $300-$500 dollars",
      "score": 1,
      "created_utc": 1735826558.0,
      "replies": []
    },
    {
      "id": "m50m9vj",
      "author": "Minegott",
      "body": "Didn't see that coming!",
      "score": 1,
      "created_utc": 1735830372.0,
      "replies": []
    },
    {
      "id": "m51k0on",
      "author": "None",
      "body": "It was cool but $3500 awesome. If it was going to succeed it had to be a maximum of $1000. All the other VR products were sub $1000 so you could get some apple tax that way but 3500 is crazy. Also you needed games and movies and a eco system ready to go.",
      "score": 1,
      "created_utc": 1735840941.0,
      "replies": []
    },
    {
      "id": "m51o7a5",
      "author": "themightychris",
      "body": "I feel like at $3500 for the first gen device with a content chicken and egg problem, they should have positioned it as a dev kit and went crazy giving them away to people with good ideas to build with it",
      "score": 1,
      "created_utc": 1735842158.0,
      "replies": []
    },
    {
      "id": "m51tcgn",
      "author": "just-bair",
      "body": "If this is real it’s not surprising. The vision pro was no more than a product to get into headlines and make customers pay to beta test their new technologies. \n\nNow if they’re going to attempt to launch a successful VR/AR headset is to be seen",
      "score": 1,
      "created_utc": 1735843755.0,
      "replies": []
    },
    {
      "id": "m52k1on",
      "author": "GJMOH",
      "body": "Jobs and Ivy are gone, the supply chain guy doesn’t know how to innovate.",
      "score": 1,
      "created_utc": 1735851966.0,
      "replies": []
    },
    {
      "id": "m52pvwu",
      "author": "AshTeriyaki",
      "body": "If this had come out pre race to the bottom on pricing, 5 years sooner and around $1000 it might have been a good idea. People making false equivalences to the “iPhone moment for VR” forget that post iPhone products mature and become polished in a very different way and FAR faster as the iPhone raised the bar for consumer expectations for electronics.\n\nPlus the iPhone improved upon and addressed things the market was clamouring for. VR is awesome, but unnecessary and the market isn’t looking to replace phones with something more cumbersome, intrusive and that provides little actual utility for the mass market. We’ve had a decade of VR/AR headsets and excited developers looking for the “killer app”, again in a post-iPhone world. VR can certainly grow hugely as a market but it really isn’t the “next thing”.\n\nI think Apple actually knows this but feeling the squeeze from the rapidly saturating smartphone market and pushing for a new category I don’t think they were entirely sure needed to exist.",
      "score": 1,
      "created_utc": 1735853674.0,
      "replies": []
    },
    {
      "id": "m53nwxr",
      "author": "twec21",
      "body": "Here's a [Kotaku article](https://kotaku.com/apple-vision-pro-vr-mixed-reality-report-1851731279) (take it with a grain of salt) citing the same rumor and taking a shot at the website that ran it in the first place lol",
      "score": 1,
      "created_utc": 1735864205.0,
      "replies": []
    },
    {
      "id": "m549k8p",
      "author": "WafflingToast",
      "body": "They will reintroduce it later.  \n\nIf you’re old enough, you may remember the Apple note taking gadget that could not compete against Palm Pilots in the mid-1990s.  Early Apple engineering plus hardware advancements eventually yielded the iPad.",
      "score": 1,
      "created_utc": 1735871530.0,
      "replies": []
    },
    {
      "id": "m559o35",
      "author": "pattywhacked",
      "body": "A gen-2 product would sell better if they could pack the core features in for $1800. People buy vr headsets at a steady pace, and an overpriced apple version has a firm place in the market. But $3000 is exorbitant and people know not to buy a first-gen apple product except to be guinea pigs.",
      "score": 1,
      "created_utc": 1735886829.0,
      "replies": []
    },
    {
      "id": "m5bqye8",
      "author": "PsychologicalPop4426",
      "body": "Now its worth double the price tag! I see what you did there tim.",
      "score": 1,
      "created_utc": 1735978948.0,
      "replies": []
    },
    {
      "id": "m4usuaa",
      "author": "Supertobias77",
      "body": "The Vision Pro was meant for developers, not for consumers. They probably produced enough Vision Pro’s by now that they’ll have enough for the next couple years. \n\nWe will see another “Vision” product in a couple years that will actually be for the consumer.",
      "score": 1,
      "created_utc": 1735743881.0,
      "replies": [
        {
          "id": "m4wfol1",
          "author": "MrHeavySilence",
          "body": "I don’t know. Kind of seems like they were hoping for more engagement and more developers doing the work of creating the ecosystem like in their early iPhone days",
          "score": 4,
          "created_utc": 1735763660.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4uhzq3",
      "author": "wotton",
      "body": "This should be a suprise to no one. Developer device. Apple used the device as a test bed for VisionOS.",
      "score": -4,
      "created_utc": 1735739111.0,
      "replies": [
        {
          "id": "m4usu0p",
          "author": "zushiba",
          "body": "Apple has real developer programs and real development hardware. They do not release a system to the public, specifically for development. In the past they’ve even had developers send back development hardware to be destroyed so that it wouldn’t ever be confused for a real product. \n\nApple is extremely careful about what is and isn’t released. \n\nApple Vision Pro was a real product meant for real people that didn’t make the splash Apple had hoped it would.",
          "score": 6,
          "created_utc": 1735743878.0,
          "replies": []
        },
        {
          "id": "m4uj4op",
          "author": "StickyThickStick",
          "body": "No they did not. Obviously the Vision Pro wasn’t such a success as Apple hoped it would be",
          "score": 4,
          "created_utc": 1735739654.0,
          "replies": [
            {
              "id": "m4ul8bp",
              "author": "wotton",
              "body": "I’m assuming you don’t own one?",
              "score": -8,
              "created_utc": 1735740610.0,
              "replies": [
                {
                  "id": "m4um33j",
                  "author": "StickyThickStick",
                  "body": "Yes",
                  "score": 3,
                  "created_utc": 1735740993.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m4uw97b",
          "author": "EfficientAccident418",
          "body": "Why would they create a hyper-expensive product that they sold to the general public in the hopes that developers would buy it just so they could test a new OS that is specific to the device they created?\n\nThey could’ve done the same thing with a cheaper headset that plugs into a macOS/iOS/ipadOS device.",
          "score": 2,
          "created_utc": 1735745219.0,
          "replies": []
        },
        {
          "id": "m4up4x7",
          "author": "None",
          "body": "Well of course this should be no surprise, this is the same thing as saying apple stop production of iPhone 13. Well of course they did they are making iphone now. Apple is making AVP2.",
          "score": -2,
          "created_utc": 1735742324.0,
          "replies": [
            {
              "id": "m4wqgjn",
              "author": "Vurbetan",
              "body": "Requiem?",
              "score": 1,
              "created_utc": 1735767113.0,
              "replies": [
                {
                  "id": "m4wrpje",
                  "author": "None",
                  "body": "Apple Vision Pro 2. This is such a bait headline and I am not sure why I got downvoted for truth.",
                  "score": 2,
                  "created_utc": 1735767500.0,
                  "replies": [
                    {
                      "id": "m4x14no",
                      "author": "Vurbetan",
                      "body": "I was making an Alien Vs Preditor joke.",
                      "score": 1,
                      "created_utc": 1735770459.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m4vfg1j",
      "author": "insufficient_nvram",
      "body": "For the folks griping about price, it was never for you. It’s a proof of concept device for tech that will trickle down. Gestures are already in the watch. Think BMW i8",
      "score": 2,
      "created_utc": 1735751958.0,
      "replies": []
    },
    {
      "id": "m4waqgk",
      "author": "None",
      "body": "was DOA garbage out of the gates. Should bever have been produced.",
      "score": 2,
      "created_utc": 1735762045.0,
      "replies": []
    },
    {
      "id": "m4ulwpc",
      "author": "superpingu1n",
      "body": "can't believe how bad apple is now",
      "score": -3,
      "created_utc": 1735740913.0,
      "replies": [
        {
          "id": "m4up7di",
          "author": "gurrmin",
          "body": "Their software is abysmal. But at least by making the user experience and products so bad, I now spend more time with nature and family, in turn saving money and getting much more joy out of life! :) happy new year.",
          "score": -3,
          "created_utc": 1735742354.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4wumey",
      "author": "Motor-Replacement223",
      "body": "So it was vaporware like everyone said. Lol",
      "score": 1,
      "created_utc": 1735768341.0,
      "replies": []
    },
    {
      "id": "m4xu8pv",
      "author": "cmlucas1865",
      "body": "Good. Wearable VR is the product no one asks for that companies have been trying to shove down consumers throats for 40 years now. At some point the problem becomes the form factor. Besides, if Virtual Boy failed, every other application was bound to.",
      "score": 1,
      "created_utc": 1735780600.0,
      "replies": [
        {
          "id": "m4y5v5k",
          "author": "Makeitquick666",
          "body": "there is a niche use case for sim racing/aviation. Very niche and thus cost a fortune to run",
          "score": 1,
          "created_utc": 1735784992.0,
          "replies": [
            {
              "id": "m4y7frz",
              "author": "cmlucas1865",
              "body": "Sure. But as a mass consumer product? No one ever said they wanted to watch TV or play games that way, & the tech companies have been trying to convince us otherwise for 30+ years.",
              "score": 1,
              "created_utc": 1735785610.0,
              "replies": [
                {
                  "id": "m4y7zcp",
                  "author": "Makeitquick666",
                  "body": "30+? in my neck of the woods it’s only been 10 or so years. But even then you’re talking about stuff like the Google Daydream or whatever they were.\n\nBut yeah I only knew about it because I was fortunate and dumb and passionate about it enough to justify the cost, complexity, and inconvenience (which is arguably the most important factor) of running it, and even then I’ m finding myself using my triple monitor setups more and more. More and consistent framerates while being much easier to get in and drive",
                  "score": 1,
                  "created_utc": 1735785821.0,
                  "replies": [
                    {
                      "id": "m4ybqu7",
                      "author": "cmlucas1865",
                      "body": "I’m counting the Virtual Boy from Nintendo in 1995 as my starting point. It seems like since then, someone’s always peddling VR/smart glasses/AR, something wearable no one asked for.",
                      "score": 1,
                      "created_utc": 1735787307.0,
                      "replies": [
                        {
                          "id": "m4ybvtw",
                          "author": "Makeitquick666",
                          "body": "kinda like 3d tv, no?",
                          "score": 1,
                          "created_utc": 1735787364.0,
                          "replies": [
                            {
                              "id": "m4yk68c",
                              "author": "cmlucas1865",
                              "body": "Absolutely. 3D movies + TV did nothing but give viewers headaches. But don’t worry James Cameron is working on some next level camera tech or something we just don’t understand trust me bro trust me.",
                              "score": 1,
                              "created_utc": 1735790888.0,
                              "replies": [
                                {
                                  "id": "m4ylcxz",
                                  "author": "Makeitquick666",
                                  "body": "tbh I never felt that headache, but there were never content in the first place",
                                  "score": 1,
                                  "created_utc": 1735791421.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m4y7wmk",
      "author": "None",
      "body": "Over at the apple sub they claimed this was going to sell like hotcakes. These people are separated from reality but in any case the device is definitely the most advanced. However content is lacking severely",
      "score": 1,
      "created_utc": 1735785791.0,
      "replies": [
        {
          "id": "m4yyji1",
          "author": "cloudcity",
          "body": "nobody in their right mind, including apple, claimed this.",
          "score": 2,
          "created_utc": 1735797957.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4z9sw7",
      "author": "Horror-Raisin-877",
      "body": "Could be the commercial failure has something to do with stupid hairstyles in the advertising :)",
      "score": 1,
      "created_utc": 1735804849.0,
      "replies": []
    },
    {
      "id": "m503ftu",
      "author": "Blapanda",
      "body": "Just now? Not earlier? Wasn't it obvious for Apple that no one was going to spend 3500 bucks for the base and more than additional 1k for the extras and upgrades while upselling the device, and not obvious enough that people who had not purchased themselves into VR with other brands, which were way more affordable, that they would not jump onto a hefty and painfully expensive paperweight with no real content on it?\nWhich showcased some flat native 2D smartphone gaming apps in a 3D environment?\n\nReally?\n\nDoes Apple do statistics and stoaistics at all?!",
      "score": 1,
      "created_utc": 1735822914.0,
      "replies": []
    },
    {
      "id": "m507qlx",
      "author": "faze_fazebook",
      "body": "So glad Apple got a reality check with this thing.",
      "score": 1,
      "created_utc": 1735824809.0,
      "replies": []
    },
    {
      "id": "m4urtjg",
      "author": "Feeling-Extreme2190",
      "body": "I have one and honestly don’t feel like it’s going anywhere. First gen isn’t for the masses. Vision OS has already made significant upgrades since Feb and will continue to do so. When a cheaper model comes out, the negativity will start to fizzle!",
      "score": 1,
      "created_utc": 1735743467.0,
      "replies": []
    },
    {
      "id": "m4upf1t",
      "author": "None",
      "body": "I’m not a gadget guy in any regard but I saw the commercial for this thing and was immediately like, who in the hell would want that. I’m probably a curmudgeon but looking at the world thru a screen hits that uncanny valley of existence and I think people are just kind of repulsed by the idea.",
      "score": -1,
      "created_utc": 1735742442.0,
      "replies": [
        {
          "id": "m4ut1h8",
          "author": "Chytectonas",
          "body": "I love mine. Cinema on every flight, within an environment (think mountaintop or lakeside). Massive widescreen on my laptop. Those are my only two use cases - I spend about 4 hours a day on it, WFH. Zero latency zero nausea, unlike the Quest. “Repulsed” doesn’t quite cover *my* experience.",
          "score": 4,
          "created_utc": 1735743962.0,
          "replies": [
            {
              "id": "m4uvg3h",
              "author": "VVLynden",
              "body": "I don’t think people experience nausea unless they’re doing a movement based activity like gaming or exercising. My personal experience is I only had it happen one time back on the original Oculus Quest. It was a very active game and I was strafing in a circular motion around an enemy and suddenly felt very hot and queasy, it came on very fast. I took my headset off and sat down then got a glass of water. I never played that game again and it was the one and only time I’d been hit with motion sickness. \n\nI’ve read the more often you use it the less it will occur. Like acclimation.",
              "score": 3,
              "created_utc": 1735744909.0,
              "replies": []
            },
            {
              "id": "m4uxz36",
              "author": "iDom2jz",
              "body": "Ngl I couldn’t imagine feeling the need to watch a movie on a mountain or at a lake… I think you are 100% their target audience. \n\nThat’s wild to say the least.",
              "score": 6,
              "created_utc": 1735745864.0,
              "replies": [
                {
                  "id": "m4v0fla",
                  "author": "Chytectonas",
                  "body": "(Well, I fly coach and often. The need arises, now that I’ve felt the difference.)",
                  "score": 4,
                  "created_utc": 1735746771.0,
                  "replies": [
                    {
                      "id": "m4v3vii",
                      "author": "shaftshaftner",
                      "body": "Do you feel any safety/security issues wearing it in public?",
                      "score": 1,
                      "created_utc": 1735748007.0,
                      "replies": [
                        {
                          "id": "m4vcodm",
                          "author": "Chytectonas",
                          "body": "On planes it feels 100% safe and great. Controlled environment with enforced normalcy standards. (I’ve never used it on Spirit.) But in coffee shops it feels unsafe going into immersive environments as I don’t like being unaware of people around me. Having just a large screen in a coffee shop works fine. I don’t wear it in other public spaces - don’t walk around with it for example.",
                          "score": 2,
                          "created_utc": 1735751037.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m4v14aa",
                      "author": "iDom2jz",
                      "body": "The flying part definitely makes a ton of sense",
                      "score": 1,
                      "created_utc": 1735747019.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4v80ek",
                  "author": "DarthBuzzard",
                  "body": "Digital hangouts. We all have friends/family that are physically far away, so being able to have a holocall with them and watch a movie together on a lake backdrop is appealing, at least as the devices mature and get easier, smaller, etc.",
                  "score": 1,
                  "created_utc": 1735749456.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m4uleeh",
      "author": "SelectTotal6609",
      "body": "should have cancelled it like airpower. waste of r&d.",
      "score": -4,
      "created_utc": 1735740687.0,
      "replies": [
        {
          "id": "m4umcfu",
          "author": "JanewaysFolly",
          "body": "what is airpower?",
          "score": 2,
          "created_utc": 1735741108.0,
          "replies": [
            {
              "id": "m4umstr",
              "author": "subjecttomyopinion",
              "body": "Exactly",
              "score": 15,
              "created_utc": 1735741313.0,
              "replies": [
                {
                  "id": "m4uugoa",
                  "author": "doge1976",
                  "body": "Just like H.R. Pickens",
                  "score": 1,
                  "created_utc": 1735744524.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4uoerj",
              "author": "Mr_Engineering",
              "body": "Fish claim that it's an avian supremacy movement.\n\nGeese claim that it's just an ad-hoc advocacy group.",
              "score": 10,
              "created_utc": 1735742015.0,
              "replies": []
            },
            {
              "id": "m4upku5",
              "author": "Feesuat69",
              "body": "Apple tried to make their own magnetic charging pad-esque thing, The idea was that you would place your iPhone X anywhere on this charging pad anywhere and it would charge, The idea was cancelled because the amount of coils they had to fit in for the “place anywhere” concept was too much ig.",
              "score": 1,
              "created_utc": 1735742508.0,
              "replies": []
            },
            {
              "id": "m4upqp6",
              "author": "MM556",
              "body": "It was their attempt at multiple device wireless charging. \n\n\nThey announced it maybe 5 years ago (could be wrong on the time there admittedly) but they couldnt get it working so was cancelled ",
              "score": 1,
              "created_utc": 1735742579.0,
              "replies": []
            },
            {
              "id": "m4uqrcj",
              "author": "ovrlrd1377",
              "body": "Wind turbine generators?",
              "score": 1,
              "created_utc": 1735743026.0,
              "replies": []
            },
            {
              "id": "m4v5tmi",
              "author": "MVPizzle_Redux",
              "body": "They were on the “1 yard line” to “place any device you have , watch included, anywhere on the charging pad and it just works” for like 7 years before cancelling it",
              "score": 1,
              "created_utc": 1735748701.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m4vdduv",
      "author": "fullload93",
      "body": "Oh no… what will the rich ever do now with their $4,000 paperweight?",
      "score": 0,
      "created_utc": 1735751272.0,
      "replies": [
        {
          "id": "m4w36qr",
          "author": "dantheriver",
          "body": "I don’t think they’ll disable all the ones already out. Im sure it will be quite usable for years to come and by the time they fully stop supporting it the rich will have moved on to a newer more impressive expensive toy.",
          "score": 0,
          "created_utc": 1735759588.0,
          "replies": [
            {
              "id": "m4wegq9",
              "author": "fullload93",
              "body": "Yeah I didn’t mean disabled but there’s not really going to be much support or development for it if they didn’t sell well.",
              "score": 2,
              "created_utc": 1735763260.0,
              "replies": [
                {
                  "id": "m4wfxap",
                  "author": "parasubvert",
                  "body": "There’s quite a bit of work going on visionOS. It’s not going away, I would bet a new device is released in 2025.  Apple doesn’t kill major projects that are released.  They iterate.",
                  "score": 2,
                  "created_utc": 1735763737.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4xczrf",
              "author": "Thesinistral",
              "body": "Not trying to shoot the messenger but with what games, apps and software? Obvi only what is out already but can’t be much, I assume.",
              "score": 1,
              "created_utc": 1735774477.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m4vjola",
      "author": "x42f2039",
      "body": "It’s a business/ developer product. Of course version 1 is winding down.",
      "score": 0,
      "created_utc": 1735753369.0,
      "replies": []
    },
    {
      "id": "m4wd433",
      "author": "AudiB9S4",
      "body": "In my opinion, its main issue isn’t its price as much as the format.  The reality is that nobody wants to be seen wearing a giant, overly heavy, vision obstructing device on their head.  I saw a guy wearing one at a gate hold at an airport the other day, and he looked ridiculous.  They should have concentrated on a more narrowly focused device with fewer features in an eyeglass format - even if that meant waiting years for the technology to make it practical.  I don’t know…maybe the Vision Pro is their stepping stone.",
      "score": 0,
      "created_utc": 1735762827.0,
      "replies": []
    },
    {
      "id": "m4xo42i",
      "author": "avclubvids",
      "body": "It is so weird to me that Apple‘s decision to prevent anyone from developing VR apps on OSX in 2014 would somehow lead to there not being enough developers interested in making content for their new headset. Super weird. I wonder if anyone will ever be able to understand what happened here????",
      "score": 0,
      "created_utc": 1735778422.0,
      "replies": []
    },
    {
      "id": "m4us5xf",
      "author": "stirlow",
      "body": "Obviously they’re not going to keep producing Vision Pro (gen 1) a year after its release…\n\nLet’s get ready for the Vision Pro 2nd gen production (and hopefully a significant price cut).",
      "score": 0,
      "created_utc": 1735743606.0,
      "replies": []
    },
    {
      "id": "m4us91j",
      "author": "thislaneopen",
      "body": "buh bye",
      "score": 0,
      "created_utc": 1735743641.0,
      "replies": []
    },
    {
      "id": "m4uvrts",
      "author": "EfficientAccident418",
      "body": "I’m shocked that no one at Apple HQ told Tim Cook that Vision Pro would be DOA. Maybe if it had been $999 and actually ran macOS, and had a 5-10 hour battery life without a weird battery attachment. \n\nAnd it weighs nearly two pounds- partly because of the weird screen in front that simulates the user’s eyes. Sometimes it’s ok to use plastic, Apple. Not everything needs to be machined aluminum and exquisitely curved glass. And no one needs to see anyone’s virtual eyeballs as they watch VR porn 🤣",
      "score": -2,
      "created_utc": 1735745034.0,
      "replies": []
    },
    {
      "id": "m4unibm",
      "author": "None",
      "body": "[removed]",
      "score": -3,
      "created_utc": 1735741624.0,
      "replies": [
        {
          "id": "m4ut0ki",
          "author": "zushiba",
          "body": "I just want one so I can play games at work and no one else can see.",
          "score": 1,
          "created_utc": 1735743951.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4vsgll",
      "author": "Va1crist",
      "body": "It’s probably one of the worst and pointless pieces of tech out there so it’s probably a good thing",
      "score": -2,
      "created_utc": 1735756191.0,
      "replies": [
        {
          "id": "m4vyqqq",
          "author": "SUPRVLLAN",
          "body": "Pointless can be argued, but worst absolutely not. It’s expensive and it’s good at what it does, just nobody really needs to do what it does.",
          "score": 3,
          "created_utc": 1735758165.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4vjm43",
      "author": "thecoastertoaster",
      "body": "They were super late to market on AR/VR, so they went the luxury route. Yet another case of Apple not reading the room/economy and listening to what their customers actually need/want. Also, wasted so many resources on “Apple Car”, which would have been another terrible flop.  \n\nCook only listens to the board/shareholders, and I can’t wait to see him replaced.",
      "score": 0,
      "created_utc": 1735753345.0,
      "replies": []
    },
    {
      "id": "m4zqpe1",
      "author": "bmcapers",
      "body": "To make way for new. This technology will take over mobile phones.",
      "score": 0,
      "created_utc": 1735815974.0,
      "replies": []
    },
    {
      "id": "m4v4eqr",
      "author": "Accurate_Return_5521",
      "body": "Worst horrible shit I ever bought",
      "score": -2,
      "created_utc": 1735748203.0,
      "replies": []
    },
    {
      "id": "m4vig2b",
      "author": "None",
      "body": "Haha 🤣 I knew that piece of shit wouldn’t take off. Way over priced",
      "score": -1,
      "created_utc": 1735752960.0,
      "replies": []
    },
    {
      "id": "m4up6kb",
      "author": "boogermike",
      "body": "Y'all were excited about Apple innovating when they released this and were was like \"YOLO - Good for them for finally trying something\".... Now y'all are dancing on their grave.\n\nI'm glad they tried something new, and also glad I didn't buy one of these.",
      "score": -2,
      "created_utc": 1735742344.0,
      "replies": [
        {
          "id": "m4uw0td",
          "author": "_RADIANTSUN_",
          "body": "1. How is it particularly innovative when other devices have been doing the same shit already! They were late to the punch and launched a product at an non viable price for the consumer market. There's a reason no one is really shitting on Meta Quest 3 the same way... Cuz it's actually a good value proposition.\n\n2. Why is it so bad to call out Apple's missteps? Every single time Apple fucks something up, their fanboy squad comes out ready and armed with all the copes, emotional appeals, everything. Like why are you so invested in defending the trillion dollar corporation?",
          "score": 4,
          "created_utc": 1735745130.0,
          "replies": [
            {
              "id": "m4uwj6z",
              "author": "boogermike",
              "body": "Oh I'm not defending the device, I've never even tried it.\n\nI think Apple should be spending some of their vast piles of gold on new technology ideas.",
              "score": 1,
              "created_utc": 1735745325.0,
              "replies": [
                {
                  "id": "m4v1ch0",
                  "author": "_RADIANTSUN_",
                  "body": "Nobody disagrees with that, only that this particular application of their vast piles of gold was poorly executed, ill considered and ill supported.",
                  "score": 0,
                  "created_utc": 1735747101.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m4ushry",
      "author": "Aritra319",
      "body": "Good to hear. Let’s hope some of the exclusive stuff that was made for it gets ported to a system affordable by people outside the top 1%",
      "score": -4,
      "created_utc": 1735743738.0,
      "replies": []
    },
    {
      "id": "m4ur0n4",
      "author": "Under_Over_Thinker",
      "body": "Who would’ve thought that this prohibitively expensive piece of hardware that brings screens right to your eyes would not take off /s.",
      "score": -1,
      "created_utc": 1735743135.0,
      "replies": []
    },
    {
      "id": "m4us5om",
      "author": "boofoodoo",
      "body": "$3500. It’s like they didn’t even want this thing to succeed.",
      "score": -1,
      "created_utc": 1735743603.0,
      "replies": []
    },
    {
      "id": "m4v6707",
      "author": "VagabondVivant",
      "body": "> Apple Vision Pro\n\nOh, you mean Newton 2.0?",
      "score": -1,
      "created_utc": 1735748830.0,
      "replies": [
        {
          "id": "m4vk2zo",
          "author": "Independent_Wrap_321",
          "body": "EAT MARTHA",
          "score": 3,
          "created_utc": 1735753498.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4v95n0",
      "author": "Ermahgerd_Sterks",
      "body": "Even Stevie Wonder could have seen this one coming.",
      "score": -2,
      "created_utc": 1735749848.0,
      "replies": []
    }
  ]
}