{
  "post": {
    "title": "AMD says Intel's 'horrible product' is causing Ryzen 7 9800X3D shortages",
    "author": "a_Ninja_b0y",
    "id": "1hy71ep",
    "score": 1575,
    "created_utc": 1736523250.0,
    "selftext": "",
    "num_comments": 164,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hy71ep/amd_says_intels_horrible_product_is_causing_ryzen/"
  },
  "comments": [
    {
      "id": "m6ezbph",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736523251.0,
      "replies": []
    },
    {
      "id": "m6fljar",
      "author": "CarltonSagot",
      "body": ">\"Building a traditional semiconductor, it's basically 12 to 13 weeks from when you start a wafer to when you get a product out the other end of the machine,\"\n\nFascinating.",
      "score": 124,
      "created_utc": 1736529758.0,
      "replies": [
        {
          "id": "m6ovcyy",
          "author": "methpartysupplies",
          "body": "Dang dude that’s wild.  Boeing builds a 737 in like 2 weeks.  I mean, they fly into the ground a decent amount of time but it’s a neat contrast",
          "score": 63,
          "created_utc": 1736653234.0,
          "replies": [
            {
              "id": "m6puh2m",
              "author": "Agamemnon323",
              "body": "Maybe they should take their time.",
              "score": 33,
              "created_utc": 1736671289.0,
              "replies": [
                {
                  "id": "m6swe6y",
                  "author": "dblrb",
                  "body": "How would that increase their profits?",
                  "score": 13,
                  "created_utc": 1736713376.0,
                  "replies": [
                    {
                      "id": "m6ukcjn",
                      "author": "Agamemnon323",
                      "body": "Maybe other things matter too.",
                      "score": 4,
                      "created_utc": 1736731887.0,
                      "replies": [
                        {
                          "id": "m6x9ti5",
                          "author": "dblrb",
                          "body": "Only to humans that aren’t sociopaths. So not CEOs or board members, unfortunately.",
                          "score": 2,
                          "created_utc": 1736778542.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m6tlzty",
              "author": "Undergrid",
              "body": "The chips in the electronics on a 737 probably took 12 to 13 weeks to make too.  If you count everything from raw materials into a finished 737, it'll be a lot more than 2 weeks.",
              "score": 5,
              "created_utc": 1736720866.0,
              "replies": [
                {
                  "id": "m6x6nqo",
                  "author": "diablosinmusica",
                  "body": "Yeah, that's just assembly.",
                  "score": 2,
                  "created_utc": 1736777391.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m6r7ar2",
          "author": "None",
          "body": "It also requires 5-10 years to get all the equipment calibrated to run the latest nm process.\n\n\nSo there is a reason supply is always short.",
          "score": 6,
          "created_utc": 1736695528.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m6f0te2",
      "author": "Dirty_Dragons",
      "body": "LOL! In other words, AMD wasn't expecting to complely dominate.\n\nPersonally I was planning on getting a new Intel CPU but after the reviews for both chips the answer was obvious.",
      "score": 799,
      "created_utc": 1736523705.0,
      "replies": [
        {
          "id": "m6f1cbr",
          "author": "drmirage809",
          "body": "And on top of that: both chips are being made by TSMC now. Intel have their own fabs, but those have been stuck on an older process node due to being unable to get the newer stuff working out. \n\nTSMC only has so much capacity and now we have Intel, AMD, Apple and Nvidia all fighting for the really high end stuff.",
          "score": 298,
          "created_utc": 1736523864.0,
          "replies": [
            {
              "id": "m6f66eh",
              "author": "asdfasdferqv",
              "body": "Well, not really Apple, they just always get one node ahead. Everyone else fighting for the scraps.",
              "score": 128,
              "created_utc": 1736525305.0,
              "replies": [
                {
                  "id": "m6f9ayf",
                  "author": "FightOnForUsc",
                  "body": "Crazy that they stay a node ahead of nvidia even (at least for now). Because Apple always had the highest margins and so could afford it. Idk how long the deals last but I could see nvidia being willing to pay more. Then again they don’t really have competition at the moment so why would they",
                  "score": 95,
                  "created_utc": 1736526221.0,
                  "replies": [
                    {
                      "id": "m6fykzq",
                      "author": "perthguppy",
                      "body": "From my understanding, Apple gets exclusive rights to the leading node because they are basically funding TSMC to explicitly buy the equipment to produce at the new leading edge nodes.",
                      "score": 88,
                      "created_utc": 1736533497.0,
                      "replies": []
                    },
                    {
                      "id": "m6fsq6f",
                      "author": "4-3-4",
                      "body": "Yep. The played it well and took the risks with tsmc and it pays off now.",
                      "score": 40,
                      "created_utc": 1736531817.0,
                      "replies": []
                    },
                    {
                      "id": "m6ggzsm",
                      "author": "RandomlyMethodical",
                      "body": "Apple also makes about 10x more chips than Nvidia so it has the purchasing power to buy everything TSMC can produce at new nodes.",
                      "score": 48,
                      "created_utc": 1736538841.0,
                      "replies": []
                    },
                    {
                      "id": "m6ius4m",
                      "author": "Elephunkitis",
                      "body": "Apple scale is way bigger because of iPhones though. Nvidia isn’t really competing at scale.",
                      "score": 17,
                      "created_utc": 1736567071.0,
                      "replies": [
                        {
                          "id": "m6l3uv0",
                          "author": "FightOnForUsc",
                          "body": "I think nvidia’s die sizes are bigger though. So I’m not sure who would buy more wafers",
                          "score": 3,
                          "created_utc": 1736608854.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m6futcj",
                      "author": "3600CCH6WRX",
                      "body": "Most of Nvidia’s and its competitors’ products are not for mobile devices. They don’t need to spend more in the latest nodes, which typically enhance power efficiency.",
                      "score": 7,
                      "created_utc": 1736532415.0,
                      "replies": [
                        {
                          "id": "m6lk64q",
                          "author": "FightOnForUsc",
                          "body": "It still matters. Better efficiency can almost always be traded for more speed (if it was only efficiency iPhones and Macs wouldn’t be getting faster every year). It also makes a huge difference in operating costs when you’re talking about 100,000 H100s",
                          "score": 2,
                          "created_utc": 1736614133.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m6i8lxz",
                      "author": "Ashamed-Status-9668",
                      "body": "Not really once you know. TSMC creates the low power node/pdk first. Then in about a year they tweak out the higher power node. Think N5 vs N5P. Apple uses the lower power one and Nvidia uses the higher power one. If Nvidia was making low power stuff like cell phones they would get first dibs like Apple does.",
                      "score": 2,
                      "created_utc": 1736559103.0,
                      "replies": [
                        {
                          "id": "m6i9707",
                          "author": "FightOnForUsc",
                          "body": "M1 used N5 and M2 used N5P. A16 is N4P. A17 pro is N3B and A18 Pro is N3E. So I’m not sure it’s that simple",
                          "score": 2,
                          "created_utc": 1736559304.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m6j1bwa",
                      "author": "joomla00",
                      "body": "I see 2 major reasons why Nvidia can't really do this.  First, Nvidia doesn't need as many chips as Apple, by a very large amount.  Their investment costs per chips is much higher.  \n\nSecond, Nvidia is in a boom cycle, which is going to bust at some point.  They're going to be left holding the bag when that happens.  It's really hard to time these things.  Apple on the other hand, will continue to see steady increasing growth for their products for the foreseeable future.  \n\nContractually it's likely apple is largely funding TSMCs research, and have exclusive rights on these cutting edge nodes.  So it might not even be possible for Nvidia unless they rework the contracts.  Even though they largely serve different markets, Nvidia is starting to encroach onto Apples space, so apple will want to hold onto their edge.",
                      "score": 2,
                      "created_utc": 1736569658.0,
                      "replies": [
                        {
                          "id": "m6ke662",
                          "author": "TUNEYAIN1",
                          "body": "How are you so sure Nvidia is in a boom cycle? Are you saying the increasing demand and adoption of AI is a boom cycle?",
                          "score": 2,
                          "created_utc": 1736598170.0,
                          "replies": [
                            {
                              "id": "m6kgqm1",
                              "author": "joomla00",
                              "body": "If you think Nvidia will be able to sell every chip as fast as they can make them for the next decade, as they comtinue to ramp up production as fast as possible, you should sell whatever you can and buy as much Nvidia stock as possible.  \n\nJust because it's going to bust doesn't mean it will bust tomorrow, or next year.  But a decade of this, or even 5 years, at this pace seems unlikely.",
                              "score": 1,
                              "created_utc": 1736599513.0,
                              "replies": [
                                {
                                  "id": "m6mlie8",
                                  "author": "TUNEYAIN1",
                                  "body": "Oh I was just asking to see if you had sources on the “boom cycle” comment",
                                  "score": 2,
                                  "created_utc": 1736625791.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m6n13fk",
                              "author": "justbrowse2018",
                              "body": "Idk if big companies will by $40,000 gpu every year forever?  But maybe they’ll get more powerful and more expensive and they’ll keep going.",
                              "score": 1,
                              "created_utc": 1736630826.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m6nojer",
                          "author": "sithelephant",
                          "body": "Hardware sales for Apple have been basically flat for other than services and accessories since 2021.\n\nThere was a big bump in 2021, but before then, same story till 2015.\n\nApple is only an uncomplicated story of hardware sales growth in the decade or so before 2015. (I am splitting out accessories for obvious reasons).",
                          "score": 1,
                          "created_utc": 1736638465.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m6iiydt",
                      "author": "dertechie",
                      "body": "Part of that is that most of Apple’s chips are small.  It’s a lot easier to work around the defect rates of a newer node with a 90 mm2 A18 SoC than a 800+ mm2 Blackwell die.  The larger M chips come later in the process.",
                      "score": 1,
                      "created_utc": 1736562685.0,
                      "replies": []
                    },
                    {
                      "id": "m6vyjaw",
                      "author": "luuuuuku",
                      "body": "Compared to AMD/Nvidia/intel Apples margins are pretty small. \nApple gets the latest and greatest because they’re paying the development and buy early/low yielding wafers to fund TSMC. Without Apple, neither NVIDIA nor AMD would really have the chance to get better nodes in time",
                      "score": 1,
                      "created_utc": 1736753331.0,
                      "replies": []
                    },
                    {
                      "id": "m6fdk40",
                      "author": "8day",
                      "body": "They cheap out on VRAM which causes stutter, etc., even though their lower end cards would've behaved much better in many demanding games. No way in hell they will do this w/o competition.",
                      "score": -11,
                      "created_utc": 1736527450.0,
                      "replies": [
                        {
                          "id": "m6fqb0s",
                          "author": "nick182002",
                          "body": "They don't cheap out on the quality of the VRAM tbf, just the quantity.",
                          "score": 10,
                          "created_utc": 1736531129.0,
                          "replies": [
                            {
                              "id": "m6iiqqy",
                              "author": "_RADIANTSUN_",
                              "body": "Quantity>\"quality\" when it comes to RAM.",
                              "score": 1,
                              "created_utc": 1736562609.0,
                              "replies": []
                            },
                            {
                              "id": "m6g0d00",
                              "author": "Zixinus",
                              "body": "If you run out of VRAM, you will still get stutter as the CPU now is juggling the extra VRAM contents between the VRAM and RAM. If there was enough VRAM, it would simply not have to do that. It would be better if there is enough VRAM on a slower memory rather than gain that overhead. \n\nPeople ran benchmarks on the 4060ti that had a 8gb and 16gb version and the 16gb delivered better performance.",
                              "score": -4,
                              "created_utc": 1736534010.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m6g01sy",
                          "author": "Zixinus",
                          "body": "Not in the high-tier. AMD practically admitted that they won't even be trying. Last generation their top-tier card was contending Nvida's mid-tier. Intel is gaining ground but most looking likely be competition for AMD rather than Nvidia. \n\nAs someone who did a graphic card update recently, I considered going to AMD but I would lose features. I don't like RT but there are games that require it and then you NEED DLSS.",
                          "score": 5,
                          "created_utc": 1736533920.0,
                          "replies": [
                            {
                              "id": "m6hfyf2",
                              "author": "DonArgueWithMe",
                              "body": "Amd hasn't been directly competing on the top end for a long time, since well before the 1080ti. Amd has always been the budget/mid tier winner and frame per dollar winner. Nvidia wins in peak performance every generation. \n\nYou also lose nothing with amd though, it has rt and fsr is as good or better than dlss.",
                              "score": 0,
                              "created_utc": 1736549406.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m6fuss3",
              "author": "ChrisFromIT",
              "body": "Only part of Intel's latest CPUs are made by TSMC.",
              "score": 7,
              "created_utc": 1736532411.0,
              "replies": []
            },
            {
              "id": "m6ihctn",
              "author": "jsting",
              "body": "I'm Taiwanese American, and this just made me realize the only thing keeping Taiwan from being dominated by China during the Trump years are all the tech billionaires kissing the ring. I was sure Xi leans on Putin to make the US back off, but with tens of millions of dollars in kickbacks, that may be enough to buy Trump's support for Taiwan.",
              "score": 8,
              "created_utc": 1736562116.0,
              "replies": [
                {
                  "id": "m6khi8p",
                  "author": "DGGuitars",
                  "body": "Trump had a pretty similar stance is taiwan military defense as biden did. The issue is the physical military aid slowed to a near dead crawl under biden during his first years. Pretty well documented.",
                  "score": -3,
                  "created_utc": 1736599889.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m6fdsfo",
              "author": "Dirty_Dragons",
              "body": "I wonder how many of each chips are being made. I'm assuming that Intel is getting more manufactured",
              "score": 2,
              "created_utc": 1736527519.0,
              "replies": []
            },
            {
              "id": "m6f6e3h",
              "author": "RealDickGrimes",
              "body": "Shouldn't that make the prices go down? Yes but in reality, no. It really seems like these mfks are teaming up on us",
              "score": -17,
              "created_utc": 1736525369.0,
              "replies": [
                {
                  "id": "m6f7lxq",
                  "author": "SolidOutcome",
                  "body": "\"Should 1 company making all the chips in the world make prices go down?\"....what? Where's the logic? This is a monopoly, and a choke point in manufacturing....these always make prices go UP.",
                  "score": 28,
                  "created_utc": 1736525727.0,
                  "replies": [
                    {
                      "id": "m6f8q42",
                      "author": "RealDickGrimes",
                      "body": "Nope, selling more powerful and cheaper will equal in less price. Which will increase their overall net worth.",
                      "score": -28,
                      "created_utc": 1736526052.0,
                      "replies": [
                        {
                          "id": "m6gcosr",
                          "author": "namisysd",
                          "body": "What are you even talking about?",
                          "score": 9,
                          "created_utc": 1736537578.0,
                          "replies": [
                            {
                              "id": "m6i73tk",
                              "author": "RealDickGrimes",
                              "body": "Sell cheaper but sell more. You get it?",
                              "score": -2,
                              "created_utc": 1736558594.0,
                              "replies": [
                                {
                                  "id": "m6id7at",
                                  "author": "NotAnotherNekopan",
                                  "body": "But _why_ sell cheaper? They’re the only ones. They can set whatever price they want. \n\nI’m shocked you haven’t grasped this.",
                                  "score": 2,
                                  "created_utc": 1736560669.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m6f7p14",
                  "author": "slapshots1515",
                  "body": "Why would that make prices go down? It’s simple supply and demand.",
                  "score": 9,
                  "created_utc": 1736525753.0,
                  "replies": []
                },
                {
                  "id": "m6fkyun",
                  "author": "Jonsj",
                  "body": "The prices did get lowered, for every model but the 5090.\n\nEspecially when you account for the larger than normal inflation this year.\n\n\nNot defending NVIDIA but it did at least go somewhat down.",
                  "score": 2,
                  "created_utc": 1736529595.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m6fygka",
          "author": "internetlad",
          "body": "After the 11th gen Intel power issues that were literally killing their chips, I haven't even considered a device with a recent gen Intel chip since. \n\n\nI do have concerns of course. Monopoly is never good for the market and AMD has certainly had their flops and failures in the past. I have never owned an AMD GPU that hasn't had SOME sort of issue (usually driver but often bad hardware, ram probably, causing artifacting under load)\n\n\nBetween everything it'll be an interesting next few years and i fear not in the good way",
          "score": 25,
          "created_utc": 1736533462.0,
          "replies": [
            {
              "id": "m6gdzt5",
              "author": "SimiKusoni",
              "body": "I don't think it's all negative, and there's some reason to be hopeful.\n\nFor one AMD have been [ramping up R&D spending](https://www.statista.com/statistics/267873/amds-expenditure-on-research-and-development-since-2001/) for years now, after chronically underspending for an entire decade (note the chart is not inflation adjusted). That should really start paying off in products coming out soon and we can already see dramatic improvements in their software stack.\n\nThey are perhaps flagging a bit in terms of hardware on the GPU side but Intel have done oddly well in that respect this gen, and it'll be interesting if AMD return to producing higher end SKUs around the same time Intel start pushing into that area.\n\nAnd as for Intel everything hinges on 18A which is... eh. There was of course the rumour about Broadcom not being happy with it but [the only actual quote](https://www.reuters.com/technology/intel-manufacturing-business-suffers-setback-broadcom-tests-disappoint-sources-2024-09-04/) is that it was ‘not yet viable to move to high-volume production,’ which doesn't really tell us anything as it wasn't meant to be ready at that point. They've since [confirmed a defect rate of <0.4 defects/cm2](https://www.intel.com/content/www/us/en/newsroom/opinion/continued-momentum-intel-18a.html), which they are very unlikely to have fudged, so there is a fair chance that's overblown even if we don't have enough info to judge yet.\n\nIf Intel do pull it off we could see both CPUs and GPUs on a truly cutting edge node for the first time in a while, as opposed to all of that capacity going to mobile (Apple). More competition for TSMC is also always good given how expensive they've become.\n\nObviously a lot of this does hinge on Intel not fucking up again, so maybe it's not all sunshine and rainbows, but I think there's a fair chance we might see some really cool shit come out in the next few years.",
              "score": 13,
              "created_utc": 1736537960.0,
              "replies": []
            },
            {
              "id": "m6hibco",
              "author": "erdnussbrot",
              "body": "> After the 11th gen\n\nIsn't it only 13th and 14th gen?",
              "score": 5,
              "created_utc": 1736550178.0,
              "replies": [
                {
                  "id": "m6hkkzn",
                  "author": "internetlad",
                  "body": "Mmm yeah you're right. Got the gen wrong. In my brain the 2550k is still current so",
                  "score": 5,
                  "created_utc": 1736550940.0,
                  "replies": []
                },
                {
                  "id": "m6mse7y",
                  "author": "twigboy",
                  "body": "12th gen definitely pushing the power envelope, but 13/14 flew too close to the sun",
                  "score": 1,
                  "created_utc": 1736628032.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m6kuf76",
              "author": "FelixTheEngine",
              "body": "Don’t worry. US tax payers are sinking billions of dollars to help intel work its way out of its greed spiral. Just keep working three jobs a day and paying those taxes and praying you don’t get sick.",
              "score": 1,
              "created_utc": 1736605411.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m6i6f8q",
          "author": "FerricDonkey",
          "body": "Yeah, I was gonna build a new computer at about the Intel 14, but it sucked. I wasn't in a hurry, so decided, screw it I'll wait for the 15. It also sucked. So now I have my first amd computer in a long long time. The 9800x3d is legit. ",
          "score": 5,
          "created_utc": 1736558361.0,
          "replies": []
        },
        {
          "id": "m6oeie5",
          "author": "FuryxHD",
          "body": "What made you want to build a intel CPU after the benchmarks and obviously the 13/14th gen coverup intel was doing that you were ready to trust them with next gen right away?",
          "score": 1,
          "created_utc": 1736647126.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m6f4nor",
      "author": "aposi",
      "body": "The price hikes on the 7800X3D haven't helped. Not much reason to buy one over the 9800X3D at current prices.",
      "score": 157,
      "created_utc": 1736524851.0,
      "replies": [
        {
          "id": "m6f67i5",
          "author": "None",
          "body": "[deleted]",
          "score": 36,
          "created_utc": 1736525314.0,
          "replies": [
            {
              "id": "m6f7pip",
              "author": "aposi",
              "body": "9800X3D is the next generation, its a bit better. It's regarded as the top gaming CPU at the moment. Whether or not its worth it depends on how powerful a GPU you're getting, if you're going midrange you'll get way more performance spending more on a better GPU and getting a 9700X for a lot less. If you're getting a high end card then the 9800X3D is worth it.",
              "score": 43,
              "created_utc": 1736525757.0,
              "replies": [
                {
                  "id": "m6hbhg8",
                  "author": "whatlineisitanyway",
                  "body": "Also should be noted that the 9950X3D and 9900X3D will be available at some point in March. So two new faster gaming chips are coming out soon.",
                  "score": 2,
                  "created_utc": 1736547980.0,
                  "replies": [
                    {
                      "id": "m6hezz7",
                      "author": "half3clipse",
                      "body": "Neither of those should be expected to be better for gaming unless AMD has fixed the need to park cores for Vcache heavy workloads. \n\nFor gaming, the 9950X3D is a slightly higher clockspeed and better ability to handle background tasks, in exchange for needing to deal with core parking and the problems that happen when it doesn't work. For gaming, unless your a streamer (and not doing 2 machine set ups) it does little for you. The  9900X3D meanwhile is effectively down two cores relative to the 9800X3D in gaming.",
                      "score": 15,
                      "created_utc": 1736549099.0,
                      "replies": [
                        {
                          "id": "m6u9vpl",
                          "author": "thekeffa",
                          "body": "Two machine setups as in one device doing the gaming and the other handling the encoding and streaming side of it?",
                          "score": 1,
                          "created_utc": 1736728454.0,
                          "replies": [
                            {
                              "id": "m6xfrvx",
                              "author": "Ghuleh",
                              "body": "yes, high end streamers usually do this so that \n1. they get better frames \nand \n2. a system crash doesn’t cause them to end their stream (viewers leave when this happens, lots don’t come back)",
                              "score": 1,
                              "created_utc": 1736780604.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m6kx5p9",
                  "author": "Cakeking7878",
                  "body": "I actually got the 9800x3D then put a 4070 S in it. Yeah it’s kinda underpowered for the cpu but I plan to upgrade that gpu in a few years. The cpu should be rock solid for a long while",
                  "score": 1,
                  "created_utc": 1736606457.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m6fan4s",
              "author": "petersterne",
              "body": "9800X3D is slightly better than 7800X3D for gaming and significantly better than 7800X3D for non-gaming tasks, making it all around the better choice. \n\nIf you’re lucky enough to have a choice between the two, go for the 9800X3D unless the 7800X3D is significantly cheaper.",
              "score": 32,
              "created_utc": 1736526607.0,
              "replies": [
                {
                  "id": "m6tj3d8",
                  "author": "shmed",
                  "body": "Where can I read more about it's \"better performance in non gaming task\"? My understanding was the 9800x3d is mostly the same design as the 7800x3d and has the same number of cores and threads. Main difference is the slightly higher clock speed. What makes it significantly better than the 7800x3d?",
                  "score": 1,
                  "created_utc": 1736719989.0,
                  "replies": [
                    {
                      "id": "m6w8jvy",
                      "author": "petersterne",
                      "body": "Here you go: https://www.tomshardware.com/pc-components/cpus/amd-ryzen-7-9800x3d-review-devastating-gaming-performance\n\nShort answer is that the second-generation 3D cache (now positioned on the bottom of the chip instead of on top of it) causes less of a hit to productivity-based tasks.",
                      "score": 1,
                      "created_utc": 1736759797.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m6f6u0b",
              "author": "kiwiandrice",
              "body": "Yep. 9800X3D takes the crown, but 7800X3D is only second to that",
              "score": 9,
              "created_utc": 1736525499.0,
              "replies": []
            },
            {
              "id": "m6f9tyx",
              "author": "SolidOutcome",
              "body": "Omg yes....9800x3d,,,,would be 25% better if it was the exact same silicon...simply because the cache was moved under the CPU. The cache was on top the CPU, and was blocking the ability to cool the CPU on the 5000/7000x3d chips. Thermals are the main limiting factor of CPU performance(within ~2 generations of designs).\n\nThe 9000x3d finally fixed this issue. And that alone allows them to unlock the chips for over clocking, allows higher Hertz out of the box...let alone a (sub-par) generational improvement of the CPU internals.",
              "score": 8,
              "created_utc": 1736526374.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m6h1xos",
          "author": "Aelexx",
          "body": "I mean, the 9800X3D being out of stock everywhere is a pretty big reason if you ask me.",
          "score": 3,
          "created_utc": 1736545030.0,
          "replies": [
            {
              "id": "m6i6vlo",
              "author": "FerricDonkey",
              "body": "I've had good luck at microcenter, if there's one near you. Got one for me, then one for my brother on 2 separate trips. ",
              "score": 3,
              "created_utc": 1736558514.0,
              "replies": [
                {
                  "id": "m6kf9mm",
                  "author": "broggyr",
                  "body": "Same. Online vendors were always out, so I made the 2-hour trek to my closest MicroCenter and upgraded CPU, mainboard, ram, and cooler.",
                  "score": 3,
                  "created_utc": 1736598753.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m6tk24a",
              "author": "shmed",
              "body": "You can order it on Amazon right now. It has been that way for almost a week now. They are accepting back order. Current shipping date is March though, however, they've been known to ship it much earlier (e.g. When I ordered mine back in early December they were predicting end on January shipping but I got it late in December)",
              "score": 1,
              "created_utc": 1736720284.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m6f9d89",
          "author": "SolidOutcome",
          "body": "I won't touch a 7800x3d simply because the cache is on top. Amazing product, but who was the doltz that decided it was gonna be on top, and that was a 2 generation mistake. (The designers knew it should be on bottom, but knew it would take 2 generations to fix it)",
          "score": -16,
          "created_utc": 1736526239.0,
          "replies": [
            {
              "id": "m6fgp3d",
              "author": "James_Bondage0069",
              "body": "Why? For temps? I have a 5700x3D on stock voltage that never even gets above 70 with my AF3.",
              "score": 6,
              "created_utc": 1736528353.0,
              "replies": []
            },
            {
              "id": "m6fiq89",
              "author": "Mooide",
              "body": "What’s wrong with having it on top? Cooling?",
              "score": 6,
              "created_utc": 1736528946.0,
              "replies": [
                {
                  "id": "m6ge4gf",
                  "author": "namisysd",
                  "body": "Cache isn’t as power dense as the compute cores, having the cache on top insulates the cpu cores from the heatsink; moving them to the bottom allows for better heat conduction overall and allows for an increase in TDP and boost clocks/windows which results in better performance.",
                  "score": 3,
                  "created_utc": 1736537998.0,
                  "replies": [
                    {
                      "id": "m6hhike",
                      "author": "Material-Nose6561",
                      "body": "I don’t know why you got downvoted when that was the explanation AMD gave for relocating the cache on the 9800 X3D.",
                      "score": 3,
                      "created_utc": 1736549914.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m6fbrnw",
      "author": "Kike328",
      "body": "I’m doing my Phd in a Computer Architecture lab. We’re all up to date with tech and hardware releases, and we work literally for optimizing CPU multicore loads.  Yesterday a colleague of me asked that when the 15th series of intel processors would be released…\n\nIntel is doing absolutely a terrible marketing/product job if even in my field, people is not catching up.\n\nIf you didn’t know, the “15th” series released with a new renaming a couple months ago",
      "score": 107,
      "created_utc": 1736526934.0,
      "replies": [
        {
          "id": "m6guzza",
          "author": "MattLogi",
          "body": "Ran into this exact scenario myself on here. Someone said the 12th gen is 3 generations old and I asked, wouldn’t it only be 2. It was kindly pointed out there was a release this fall that many refuse to acknowledge. My mind broke for a second…and I’m someone constantly buying and building and even remember the launch but it’s like my mind just erased it.",
          "score": 31,
          "created_utc": 1736542947.0,
          "replies": []
        },
        {
          "id": "m6impt0",
          "author": "Inquisitor2195",
          "body": "TBH, I really hate that Intel messed around with their naming scheme, it used to be really easy to understand, I don't know what they are doing now but last time I looked it was a confusing mess. I am not Gunna lie it was one of the reasons I jumped ship. I would have probably still jumped given the timing of my upgrade and how hard the 7800x3d dominated and how hard it looks like the 9800x3d is dominating so far. It's a fair bit of coin but I am probably Gunna keep it for 5-8 years unless something crazy happens with CPU tech.",
          "score": 6,
          "created_utc": 1736564042.0,
          "replies": [
            {
              "id": "m6tn2si",
              "author": "shmed",
              "body": "While I agree, I still dont understand the AMD naming scheme. For example, the  AM5 RYZEN 7 9800x3d.\n\nI understand am5 is the new generation chipset. RYZEN 7 means 8 cores? (Why 7?) other than this I have no idea what it means to have your model number start with 9 or to have a 8 on the second position. I see some amd CPUs also have a 5 in the third position (e.g. 9950x). No idea what the x means either. It also doesn't look like the numbers increment with new releases so it's probably not a version number like for Nvidia GPUs",
              "score": 0,
              "created_utc": 1736721193.0,
              "replies": [
                {
                  "id": "m6toj4k",
                  "author": "Inquisitor2195",
                  "body": "I am Gunna be honest I don't fully understand it either. The first number appears to be a gen number but it doesn't increment in any way that makes sense. You have for example the 5800x, 7800x and 9800x which seem to all be roughly the same sku in different gens? The hundreds on just seem to be high is better, the X probably stands for extreme or some other cringe 'gamer' phrase, but more or less means \"this is the good stuff\" and 3D just means it has their fancy new cache tech that lets them slap some truly absurd levels of L3 cache on their chips.",
                  "score": 1,
                  "created_utc": 1736721643.0,
                  "replies": []
                },
                {
                  "id": "m6tu0g9",
                  "author": "UnsorryCanadian",
                  "body": "To answer your first question,  its Ryzen 7 because it's supposed to compete with the Intel i7.\n\n\nNow Intel's changed their naming scheme and the comparison is gone",
                  "score": 1,
                  "created_utc": 1736723325.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m6g3g6e",
          "author": "AlexHimself",
          "body": "What's your opinion on the top Intel and AMD CPUs then?",
          "score": 12,
          "created_utc": 1736534898.0,
          "replies": [
            {
              "id": "m6gj0zg",
              "author": "Kike328",
              "body": "imo hardware-wise intel is doing it correctly as a safe long term strategy (after the gen13/14 flop), they mainly focus in energy efficiency, which has way longer appeal for non hardcore user or desktop gamers. My lab has acquired a Gen 1 ultra for example bc the new ultra low power cores.\n\nthat been said, as a gamer, what I have read is that AMD is the way to go this year. I cannot speak from my own experience bc I have not tried the new 2nd ultra gen, neither the amd.",
              "score": 24,
              "created_utc": 1736539433.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m6iwes7",
          "author": "GoTeamScotch",
          "body": "Ah yes, classic Xbox One x series s 360 method",
          "score": 6,
          "created_utc": 1736567697.0,
          "replies": []
        },
        {
          "id": "m6lkeld",
          "author": "michi098",
          "body": "Wow, you’re right. I had no idea?! How did we all miss that? Not only that, apparently this 15th gen with completely different and confusing naming isn’t really more powerful, but mostly on par with the 14th gen but uses less power and runs at lower temps. Not something gamers are terribly interested in. I built a PC a while ago and put a i5-12600K in with the plans of upgrading to a i7-14700K at some point. After the whole debacle, I’m not sure it’s worth it. Guess I’ll be building an AMD rig when the time comes.",
          "score": 3,
          "created_utc": 1736614206.0,
          "replies": []
        },
        {
          "id": "m6q415h",
          "author": "4-3-4",
          "body": "Actions like this  shows They are trying to make things better but not knowing how. It shows they don’t know what the actual issues are and they tweak everywhere hoping the sum will turn out better. Naming/marketing is one of those pieces.",
          "score": 1,
          "created_utc": 1736677348.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m6f5caq",
      "author": "rabbitaim",
      "body": "I go back and forth between the two.  I used to get AMD for years as the budget brand.  Now they’re dominating I’m going with Intel as the budget brand.  \n\nI’m not going to argue which is better or faster as I mostly go for stuff 2 gens behind and upper middle tier.",
      "score": 28,
      "created_utc": 1736525056.0,
      "replies": []
    },
    {
      "id": "m6gcjm5",
      "author": "mkvii1989",
      "body": "My brother ended up buying a prebuilt because he wanted a 9800x3d and a 4080 Super and couldn’t find a single one for a reasonable price. So he was like if I’m gonna overpay by $500, might as well save myself some effort.",
      "score": 11,
      "created_utc": 1736537536.0,
      "replies": []
    },
    {
      "id": "m6fvl0i",
      "author": "mrjane7",
      "body": "It helps that the X3D series is fricken' lit.",
      "score": 7,
      "created_utc": 1736532637.0,
      "replies": [
        {
          "id": "m6tucfd",
          "author": "UnsorryCanadian",
          "body": "Just bought a 5700x3d and I'm loving it\n\n\nThe fact I can still use my old Corsair Hydro cooler with it doesn't hurt either",
          "score": 3,
          "created_utc": 1736723431.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m6f0kx0",
      "author": "skyhighrockets",
      "body": "DJ Khaled – Suffering from Success",
      "score": 33,
      "created_utc": 1736523634.0,
      "replies": []
    },
    {
      "id": "m6frbp0",
      "author": "randomIndividual21",
      "body": "9800X3D MSRP is £450, now selling for £530 ish. even last gen 7800X3D GPU changed from £300 couple months ago to £450 now.\n\nhopefully this wont last long, esle i am just going to get a 9700X",
      "score": 8,
      "created_utc": 1736531418.0,
      "replies": [
        {
          "id": "m6fsct1",
          "author": "Xendrus",
          "body": "Edit: Back in stock.\n\nhttps://www.amazon.com/AMD-9800X3D-16-Thread-Desktop-Processor/dp/B0DKFMSMYK\n\nOn amazon right now for MSRP, has been for days.\n\nUnfortunately the 9950x3d is only 3~ months out so I have to keep waiting.",
          "score": -1,
          "created_utc": 1736531711.0,
          "replies": [
            {
              "id": "m6ft3qk",
              "author": "randomIndividual21",
              "body": "for US not UK though, i wonder if because AMD is sending in all the stock to US first before JAN",
              "score": 1,
              "created_utc": 1736531924.0,
              "replies": []
            },
            {
              "id": "m6hldp0",
              "author": "wh1pp3d",
              "body": "This listing doesn't work. Can't add it to cart",
              "score": -1,
              "created_utc": 1736551208.0,
              "replies": [
                {
                  "id": "m6ixtlx",
                  "author": "Xendrus",
                  "body": "Back in stock.",
                  "score": 2,
                  "created_utc": 1736568210.0,
                  "replies": [
                    {
                      "id": "m6izt0s",
                      "author": "wh1pp3d",
                      "body": "Thanks, ordered. Though it says delivery not until the end of March. Will just cancel if I can find it at Micro Center",
                      "score": 1,
                      "created_utc": 1736569013.0,
                      "replies": [
                        {
                          "id": "m6j195m",
                          "author": "Xendrus",
                          "body": "Every single time I see someone getting those insane delivery times it is just them covered their ass, and you usually get it much faster.",
                          "score": 1,
                          "created_utc": 1736569626.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m6hm8v9",
                  "author": "Xendrus",
                  "body": "There was stock when I posted. It's gone now.",
                  "score": 0,
                  "created_utc": 1736551500.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m6idyat",
      "author": "w2tpmf",
      "body": "Savage.",
      "score": 3,
      "created_utc": 1736560929.0,
      "replies": []
    },
    {
      "id": "m6q6wec",
      "author": "Hikashuri",
      "body": "AMD's horrible stock is causing the issues.",
      "score": 3,
      "created_utc": 1736679143.0,
      "replies": []
    },
    {
      "id": "m6f0tg9",
      "author": "nezeta",
      "body": "Intel would also say the same thing when AMD released horrible products like Phenom I or AMD FX.",
      "score": 22,
      "created_utc": 1736523705.0,
      "replies": [
        {
          "id": "m6f7zci",
          "author": "SolidOutcome",
          "body": "Not really....back then, Intel wasn't using the same manufacturer as AMD,,,Intel should have its own fab houses, but since it failed, it is now consuming space in AMD/nvidia fab house (tsmc)...which is why it's true now that, one is taking up manufacturing bandwidth from the other.",
          "score": 11,
          "created_utc": 1736525837.0,
          "replies": [
            {
              "id": "m6k19i6",
              "author": "gay_manta_ray",
              "body": "intel's fabs haven't \"failed\". they skipped 20a to go straight to 18a, and 18a is on track for this year.",
              "score": 3,
              "created_utc": 1736590295.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m6h00u4",
      "author": "PARANOIAH",
      "body": "AMD: \"Damn it Intel, stop punching yourself!!!\"",
      "score": 3,
      "created_utc": 1736544456.0,
      "replies": []
    },
    {
      "id": "m6kzzup",
      "author": "smartbart80",
      "body": "More like shortcomings of the AMD sales team lol",
      "score": 2,
      "created_utc": 1736607496.0,
      "replies": []
    },
    {
      "id": "m6i20lr",
      "author": "AppleNo4479",
      "body": "stock price doesnt show that",
      "score": 1,
      "created_utc": 1736556865.0,
      "replies": [
        {
          "id": "m6k9wfp",
          "author": "bannerlordthrow",
          "body": "Cause they are a more of a gpu company and for all intel nvidia and amd the consumer market for gaming etc is a small part.",
          "score": 1,
          "created_utc": 1736595747.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m6jowku",
      "author": "HarryLewisPot",
      "body": "This is probably the greatest sentence a company in a duopoly can say.",
      "score": 1,
      "created_utc": 1736582226.0,
      "replies": []
    },
    {
      "id": "m6kfdbm",
      "author": "Mental5tate",
      "body": "Burn!!!",
      "score": 1,
      "created_utc": 1736598808.0,
      "replies": []
    },
    {
      "id": "m6ngz8h",
      "author": "YetAnotherWTFMoment",
      "body": "yeah. AMD is scaling up production at their plants....oh wait....",
      "score": 1,
      "created_utc": 1736635909.0,
      "replies": []
    },
    {
      "id": "m6o73w3",
      "author": "DIRTRIDER374",
      "body": "It is pretty amusing to see AMD putting the heat on intel lately after having it done to them for so many years. Now I just hope someone can do it to Nvidia.",
      "score": 1,
      "created_utc": 1736644592.0,
      "replies": []
    },
    {
      "id": "m6p7ovs",
      "author": "africanlivedit",
      "body": "Basically why I bought the 98003D!",
      "score": 1,
      "created_utc": 1736658476.0,
      "replies": []
    },
    {
      "id": "m6pk34r",
      "author": "EatMeatGrowBig",
      "body": "sure buddy",
      "score": 1,
      "created_utc": 1736664926.0,
      "replies": []
    },
    {
      "id": "m6q9kpd",
      "author": "alman12345",
      "body": "I guess Nvidia would say the same of the 4090 (and will say the same of the 5090 soon)",
      "score": 1,
      "created_utc": 1736680807.0,
      "replies": []
    },
    {
      "id": "m6qk1ji",
      "author": "MooMoo_Juic3",
      "body": "AMD taking stabs like Wendy's now 😂",
      "score": 1,
      "created_utc": 1736686596.0,
      "replies": []
    },
    {
      "id": "m6qpwgm",
      "author": "KennKennyKenKen",
      "body": "Yeah relax, NVIDIA could say the same about GPUs",
      "score": 1,
      "created_utc": 1736689167.0,
      "replies": []
    },
    {
      "id": "m6v1bl1",
      "author": "pittyh",
      "body": "I have a 13700k so I'm not due for an upgrade for another few years imo. But when i do it will probably be a 13800x3d",
      "score": 1,
      "created_utc": 1736737855.0,
      "replies": []
    },
    {
      "id": "m6f4tf2",
      "author": "Count_vonDurban",
      "body": "They obviously got ATIs temper when buying them. I remember ATI blasting nonsense that had nothing to do with their product just to get at Nvidia",
      "score": 1,
      "created_utc": 1736524898.0,
      "replies": []
    },
    {
      "id": "m6gic99",
      "author": "imaginary_num6er",
      "body": "AMD: “Suck to suck”",
      "score": 2,
      "created_utc": 1736539232.0,
      "replies": []
    },
    {
      "id": "m6kenep",
      "author": "EwesDead",
      "body": "ive always liked amd over intel and love otnwhen i can find an affordable amd cpu and graphics card....but thisbnew nvidia insanity means its amd and nvidia. i miss 5 years ago where a full amd rig felt like hot knife in butter",
      "score": 1,
      "created_utc": 1736598427.0,
      "replies": []
    },
    {
      "id": "m6ezyjy",
      "author": "diuturnal",
      "body": "That's fair, Intel's last few generations have been downgrades in comparison to the previous generation. With this latest generation being the biggest generational downgrade that has ever existed.",
      "score": -8,
      "created_utc": 1736523445.0,
      "replies": [
        {
          "id": "m6f83wo",
          "author": "slapshots1515",
          "body": "There is a ton to criticize Intel about right now, but saying their “last few” generations have been downgrades on each other implies that something around Rocket Lake would outperform every CPU after it. And that, quite simply, is not true.",
          "score": 19,
          "created_utc": 1736525875.0,
          "replies": []
        },
        {
          "id": "m6f6isj",
          "author": "PainterRude1394",
          "body": "No, 14k series was not a downgrade from 13k series. 13k series was not a downgrade from 12k series. These divorced from reality  narratives y'all make up are hilarious though.",
          "score": 18,
          "created_utc": 1736525407.0,
          "replies": [
            {
              "id": "m6f76rx",
              "author": "gbrahah",
              "body": "yeh.. you can shit on Intel but make it make sense xd",
              "score": 8,
              "created_utc": 1736525603.0,
              "replies": [
                {
                  "id": "m6f7phf",
                  "author": "PainterRude1394",
                  "body": "Right? And if Intel is doing so bad surely we don't have to fabricate lies to convince others Intel is doing so bad.",
                  "score": 4,
                  "created_utc": 1736525757.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m6f8icx",
              "author": "ex1stence",
              "body": "14th gen sets itself on fire until it breaks. Yes, it is a downgrade.",
              "score": -16,
              "created_utc": 1736525991.0,
              "replies": [
                {
                  "id": "m6f8t8w",
                  "author": "PainterRude1394",
                  "body": "No, it does set itself on fire. \n\nAnd the 13th gen had similar degradation issues to the 14th gen, so it's not a downgrade in that respect. \n\nDo you just have no clue what is happening or are you lying?",
                  "score": 5,
                  "created_utc": 1736526078.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m6k1bsr",
          "author": "gay_manta_ray",
          "body": ">With this latest generation being the biggest generational downgrade that has ever existed. \n\n\nlove how everyone is conveniently forgetting bulldozer",
          "score": 1,
          "created_utc": 1736590337.0,
          "replies": [
            {
              "id": "m6l7zt0",
              "author": "diuturnal",
              "body": "Love how you’re conveniently forgetting 14nm+++++++++++++++++++++++++",
              "score": 1,
              "created_utc": 1736610243.0,
              "replies": [
                {
                  "id": "m6ldy52",
                  "author": "gay_manta_ray",
                  "body": "what part of that am i forgetting?",
                  "score": 0,
                  "created_utc": 1736612177.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m6f4h8x",
          "author": "twisty77",
          "body": "I got an AMD processor with my new build and have zero issues with it. Was planning to go intel at one point too so glad I did my research",
          "score": 1,
          "created_utc": 1736524797.0,
          "replies": [
            {
              "id": "m6feuw9",
              "author": "ForTheHordeKT",
              "body": "Same.  I got a rig with the 7950X3D last year and it's been alright.  I was originally planning on Intel but with that 13th and 14th gen BS going on, I wasn't going to mess with that risk.  The combo of the 7950X3D and a Nvidia 4090 is a big fucking improvement over an i7 and the 2070 Nvidia card.  So even if there's some slightly better combos out there now, I'm happy as a clam with what I got.",
              "score": 1,
              "created_utc": 1736527827.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m6f3w2l",
      "author": "zane910",
      "body": "SHOTS FIRED!!!\n\n![gif](giphy|2CcKiHPDsJqVi)",
      "score": -1,
      "created_utc": 1736524624.0,
      "replies": []
    },
    {
      "id": "m6fzxd8",
      "author": "Salty_Amigo",
      "body": "My friend who lives in Oregon knew someone in Texas where it was in stock. He then had them buy it and send it to him.",
      "score": 0,
      "created_utc": 1736533884.0,
      "replies": [
        {
          "id": "m6ga8zb",
          "author": "oandakid718",
          "body": "Prob MicroCenter. Stores seem to get an allocation of at least 25 every week or 2",
          "score": 0,
          "created_utc": 1736536870.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m6r81na",
      "author": "None",
      "body": "So they didn't estimate maket trends, blames competitors...\n\n\nOk",
      "score": 0,
      "created_utc": 1736695773.0,
      "replies": []
    },
    {
      "id": "m6lgepq",
      "author": "jailtheorange1",
      "body": "I have a 5800 X 3-D, I presume I would need any motherboard also, I have Windows 10 on the PC, is it straightforward to change motherboard memory and CPU, on to the existing windows machine?",
      "score": 0,
      "created_utc": 1736612957.0,
      "replies": [
        {
          "id": "m6oqs9z",
          "author": "Emberstone73",
          "body": "The 5800X3D is still placing near the very top of benchmark charts despite its age, even placing higher than the i9-14900K in tons of games and only falling behind the 7800X3D and 9800X3D for the most part. I'd say just hang onto what you already have. The 5800X3D is still an absolutely awesome chip.",
          "score": 2,
          "created_utc": 1736651494.0,
          "replies": [
            {
              "id": "m6pgkrr",
              "author": "jailtheorange1",
              "body": "Maybe just a video car change then, I only have a 5700 XT.    On the PC, I only play Warcraft and boulders gate three.  But I got a quest three recently, and a few more games are enticing me and I believe that VR games would be moving twice as many pixels, as each eye would be independent?",
              "score": 1,
              "created_utc": 1736662967.0,
              "replies": [
                {
                  "id": "m6psyqt",
                  "author": "Emberstone73",
                  "body": "Definitely upgrade the video card first if you have a 5700XT. It's five years old now so it's getting old. Not a bad card and still perfectly servicable, but if you were looking to upgrade something, that's where I'd start first.",
                  "score": 1,
                  "created_utc": 1736670330.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m6hfwji",
      "author": "None",
      "body": "[deleted]",
      "score": -5,
      "created_utc": 1736549390.0,
      "replies": [
        {
          "id": "m6i204n",
          "author": "strictlyPr1mal",
          "body": "reads like intel is in amds shadow now",
          "score": 2,
          "created_utc": 1736556861.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m6f3g1y",
      "author": "heickelrrx",
      "body": "It's less about Intel being horrible and more about Social media Impact on modern sales\n\nToday is a modern day of social media, where people are driven by social media, With product like 9800 X3D Win the performance Crown it will also boost the other SKU Sales as well, People want to get a small taste of AMD product, even thought they will never buy the Flagship the product\n\nIntel Product get Ignored across the board even if the Core Ultra 7 and Core Ultra 5 actually not that bad, in term of Performance, Cost and Feature, but because the strong perception driven by Social media of Ryzen is faster and better, they will always get ignored because the Ultra 9 lose the Race\n\nAfter all who even want to buy 2nd place brand if the winning brand is just 100$ more expensive, In modern day, Sales are driven by emotion, this is why social media Win the war\n\n  \nThis is the same reason Why Apple Win Smartphone Race, Why NVIDIA dominate the Gaming GPU market",
      "score": -16,
      "created_utc": 1736524492.0,
      "replies": [
        {
          "id": "m6gztym",
          "author": "thelingeringlead",
          "body": "LOL word of mouth from actual users influences sales...who would have thought.",
          "score": 3,
          "created_utc": 1736544399.0,
          "replies": []
        },
        {
          "id": "m6f73q9",
          "author": "2roK",
          "body": "That's a long and strange way to say that Intel has dropped the ball.",
          "score": 11,
          "created_utc": 1736525579.0,
          "replies": [
            {
              "id": "m6k1fd7",
              "author": "gay_manta_ray",
              "body": "yeah, that's what this thread is about. he offered a whole lot more insight than you did.",
              "score": 1,
              "created_utc": 1736590402.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m6f88uz",
          "author": "Inaksa",
          "body": "Not everyone is guided by the reviews. If you need to upgrade, it's not your fault that there are only mainly 2 manufacturers of processors and that one consumes energy like a lost person consumes water in the desert. Do not project your behavior unto others.",
          "score": 3,
          "created_utc": 1736525914.0,
          "replies": [
            {
              "id": "m6f8xfn",
              "author": "heickelrrx",
              "body": "no one say review, I'm saying Social Media :')\n\nThings that like you sharing your opinion on your social media, will influence your friend circle and anyone who end up reading it.\n\nThis called SMM, and there is a whole Theory, and scholarly topic around it",
              "score": -2,
              "created_utc": 1736526112.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m6f8w4s",
          "author": "SolidOutcome",
          "body": "Well, ya....society is always hyper focused on #1\n\nRichest man on earth? Ignore #2-#50,,,all focus on #1\n\n9800x3d is #1...it earned it. And Intel has never been further behind. \n\nSocieties focus is an exponential function. But in this case, it's well deserved. AND it's true for the first time in 20 years, that Intel is taking up AMDs manufacturing bandwidth (Intel is using tsmc, instead of its own fab)",
          "score": 1,
          "created_utc": 1736526101.0,
          "replies": [
            {
              "id": "m6k1j1u",
              "author": "gay_manta_ray",
              "body": ">And Intel has never been further behind.  \n\n\nlol how old are you kids? Intel was much further behind amd than they are now during the Prescott days.",
              "score": 2,
              "created_utc": 1736590470.0,
              "replies": []
            },
            {
              "id": "m6gj1qu",
              "author": "TheJohnSB",
              "body": "Its the same reason people are frothing at the mouth for the 5090 but it's arguably just slightly better than the 4090 for 500$ more on the MSRP. And honestly the 4090 is overkill for everything that is presently out (unless you have a VR use case). AMD putting out two cards that can cover the spread of all* of the last generation of cards kind of shows you where the market is really at. (*Except the 4090)\n\nFrame gen and ray tracing are snake oil and the new \"Crysis\" bench marks for modern gaming. Frame generation has many draw backs and is only good for \"make number better\". If you have a game that you are getting screen tear on, sure you can trade ghosting and input lag for a better frame rate. Only ONE game in the last 4-6 years REQUIRES ray tracing, and they didn't even use full ray tracing. \n\nI'm thinking AMD has pulled the right move here. Slot into the market at the 250-400$ mark and try and gobble up the user's that are coming from the 10/20 series cards where it's a HUGE improvement over their current card. Keeps MFG costs down, keeps the number of SKU down. Put that time/money into the 9080/9090 they can release 6mo-1y from now to slap around the 50 supers.",
              "score": 1,
              "created_utc": 1736539439.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m6f5a7f",
      "author": "Mediocre_Bit_405",
      "body": "AMD couldn’t make their own chips and outsourced them to TSMC and now they’re talking shit!  I’ve never liked AMD and will never own their products.",
      "score": -13,
      "created_utc": 1736525038.0,
      "replies": [
        {
          "id": "m6fhhsp",
          "author": "drchia",
          "body": "You do realize that Intel also outsources to TSMC, right?",
          "score": 8,
          "created_utc": 1736528585.0,
          "replies": [
            {
              "id": "m6fj5kj",
              "author": "BitRunr",
              "body": "Let them have ... whatever it is they're doing.",
              "score": 4,
              "created_utc": 1736529070.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m6fgw75",
          "author": "Matt020100",
          "body": "You know who else uses TSMC? Intel (their fabs cant get out the latest node), Nvidia, and Apple. Like let’s not be dense on purpose because of brand loyalty. It’s a bad look.",
          "score": 5,
          "created_utc": 1736528409.0,
          "replies": [
            {
              "id": "m6pifij",
              "author": "Mediocre_Bit_405",
              "body": "Just pointing out AMD shouldn’t be talking shit when they nearly went Bankrupt.",
              "score": 1,
              "created_utc": 1736663991.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m6gly1z",
          "author": "Darknessie",
          "body": "Pmsl, nice way to look like a chump.",
          "score": 1,
          "created_utc": 1736540285.0,
          "replies": [
            {
              "id": "m6pi9ik",
              "author": "Mediocre_Bit_405",
              "body": "Try Depends,  you might have an issue.",
              "score": 1,
              "created_utc": 1736663899.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}