{
  "post": {
    "title": "Possible ban on Chinese-made drones dismays U.S. scientists | Switching to costlier, less capable drones could impede research on whales, forests, and more",
    "author": "chrisdh79",
    "id": "1hgagoc",
    "score": 2655,
    "created_utc": 1734441654.0,
    "selftext": "",
    "num_comments": 378,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hgagoc/possible_ban_on_chinesemade_drones_dismays_us/"
  },
  "comments": [
    {
      "id": "m2hndl6",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1734441655.0,
      "replies": []
    },
    {
      "id": "m2hr4q2",
      "author": "jakgal04",
      "body": "I work in public safety and this looming threat of banning Chinese made drones is something that would seriously affect us more than people know. The fact of the matter is, there's not a single decent US made drone that we can use as a viable replacement. \n\nWe currently have a Matrice 300, two Matrice 30T's, two Mavic 3 Enterprises and an Avata. We have at least 2-3 wins a month with these things, whether it's finding a missing person in the woods, finding a boater overboard, or sending the drones in ahead of police for emergency situations. \n\nWe have a Skydio that's so horribly bad that it never leaves its case. There's a company that takes Mavic's, guts them and adds in US made components but the interface is horrible, the latency is a disaster and its not reliable at all. Other than that, everything else is extremely overpriced and significantly outdated technology.",
      "score": 592,
      "created_utc": 1734443198.0,
      "replies": [
        {
          "id": "m2hy3np",
          "author": "GrynaiTaip",
          "body": "> There's a company that takes Mavic's, guts them and adds in US made components \n\nUkrainians take DJI drones and upload their own domestic software on them, so that the russians couldn't use DJI-made trackers to locate them.",
          "score": 304,
          "created_utc": 1734445881.0,
          "replies": [
            {
              "id": "m2ik2sq",
              "author": "MyReddittName",
              "body": "Seems like a business opportunity. Overwriting Chinese software with a custom made one but keeping the hardware components.",
              "score": 169,
              "created_utc": 1734453293.0,
              "replies": [
                {
                  "id": "m2iovh8",
                  "author": "OrganicKeynesianBean",
                  "body": "This is literally how smartphones work lol.\n\nThe pearl-clutching over drones is insane.",
                  "score": 166,
                  "created_utc": 1734454819.0,
                  "replies": [
                    {
                      "id": "m2jvy0s",
                      "author": "ensoniq2k",
                      "body": "A German far right newspaper company sells Google Pixel but installs Graphene OS beforehand. That'll be 500 bucks then.",
                      "score": 35,
                      "created_utc": 1734468448.0,
                      "replies": [
                        {
                          "id": "m2nxtug",
                          "author": "arguing_with_trauma",
                          "body": "why wouldn't people just buy a pixel\n\noh you're talking about nitrophone. theyre a security company, not a...whatever you're on about",
                          "score": 1,
                          "created_utc": 1734533409.0,
                          "replies": [
                            {
                              "id": "m2q6v4o",
                              "author": "ensoniq2k",
                              "body": "No it's actually the Kopp Verlag, which is a fear mongering far right news publisher",
                              "score": 6,
                              "created_utc": 1734559050.0,
                              "replies": [
                                {
                                  "id": "m2qjupy",
                                  "author": "arguing_with_trauma",
                                  "body": "Shit I'll have to look into that, I had only passingly heard of that phone. Thx",
                                  "score": 2,
                                  "created_utc": 1734563410.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m2jnum3",
                      "author": "Glittering-Path-2824",
                      "body": "right? this is america ffs, we’ll figure out a hack by hook or by crook",
                      "score": 25,
                      "created_utc": 1734465846.0,
                      "replies": [
                        {
                          "id": "m2le96y",
                          "author": "AppropriateTouching",
                          "body": "Or get bought out by an outside nation.",
                          "score": 15,
                          "created_utc": 1734487320.0,
                          "replies": [
                            {
                              "id": "m2n7ngp",
                              "author": "Wheeler-The-Dealer",
                              "body": "I was thinking private equity, but I guess both can be true.",
                              "score": 3,
                              "created_utc": 1734522065.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m2lns04",
                          "author": "Glittering-Path-2824",
                          "body": "thank you for the award kind stranger u/shaorii",
                          "score": 0,
                          "created_utc": 1734490947.0,
                          "replies": [
                            {
                              "id": "m2ndnbj",
                              "author": "CantRememberPass10",
                              "body": "Take those awards as well - they are useless",
                              "score": 1,
                              "created_utc": 1734525189.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m2mihfj",
                          "author": "SirEnderLord",
                          "body": "Yep, just look at prohibition lol",
                          "score": 1,
                          "created_utc": 1734505554.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m2j801u",
                      "author": "LowDownSkankyDude",
                      "body": "Drones, working with smart phones and wifi, to see where people are, all the time, feels like a legitimate concern to me",
                      "score": 2,
                      "created_utc": 1734460864.0,
                      "replies": [
                        {
                          "id": "m2jg3ed",
                          "author": "munche",
                          "body": "They don't need a drone to know where you are all the time\n\nIf bluetooth is on on your phone it's pinging readers all over the place to track what aisles you linger on in a store. If you drive a vehicle there are vast networks of private and government owned license plate readers that log every single vehicle going by. This isn't even getting into the fact that basically every app on your phone, store loyalty card or anything you can think of is harvesting as much data as humanly possible about you and selling it off en masse. You're already being tracked all the time, by basically everything you interact with. \n\nWe need a much more coherent data privacy policy than \"China bad\"",
                          "score": 54,
                          "created_utc": 1734463403.0,
                          "replies": [
                            {
                              "id": "m2jtaqb",
                              "author": "LowDownSkankyDude",
                              "body": "Yeah, I'm not trying to imply that drones are the issue, rather that they're an expansion of the issue. The more ways to track the worse tracking is going to get, and the harder it will be to reign it in. A point I think we're well beyond",
                              "score": 8,
                              "created_utc": 1734467604.0,
                              "replies": [
                                {
                                  "id": "m2k8i6y",
                                  "author": "munche",
                                  "body": "The problem is, we need sweeping data privacy reform for \\*everyone\\* and these bullshit moves against China Only don't actually help. You think those data brokers won't sell all of this information to any foreign government who asks? Why wouldn't they? They ban DJI drones so the American company that just got handed the market can do all of the nefarious data gathering things we worried about and sell it to China, or anyone else, for profit. Hooray. Meanwhile the consumer gets a worse product at a higher price, and their privacy is just as violated, if not moreso.",
                                  "score": 13,
                                  "created_utc": 1734472445.0,
                                  "replies": []
                                },
                                {
                                  "id": "m2k63qt",
                                  "author": "None",
                                  "body": "It’s already over. You aren’t reigning anything in and it will get much worse before the right people are in power to pause the progression.",
                                  "score": 5,
                                  "created_utc": 1734471683.0,
                                  "replies": []
                                },
                                {
                                  "id": "m2nyb6u",
                                  "author": "arguing_with_trauma",
                                  "body": "we're already being tracked by every other company and anybody can buy that information",
                                  "score": 1,
                                  "created_utc": 1734533579.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m2jokce",
                          "author": "Rage_Like_Nic_Cage",
                          "body": "The NSA is a far bigger threat and concern to the everyday American, especially under Trump.",
                          "score": 11,
                          "created_utc": 1734466077.0,
                          "replies": []
                        },
                        {
                          "id": "m2ji0ij",
                          "author": "HawterSkhot",
                          "body": "I hate to tell you, but all of that info is already known. You're right to be concerned, but drones are a symptom, not the problem.",
                          "score": 1,
                          "created_utc": 1734464011.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m2pdplr",
                      "author": "cladogenesis",
                      "body": "It is absolutely technically possible to embed hardware that gives an adversary full control over a device regardless of what software you load onto it. Smartphones are a case in point, since the baseband processor typically runs its own OS and has unsupervised access to RAM and other resources.\n\nIs the fear warranted? Absolutely. Is the policy worth the negative impacts? I don't know. I do know there's nothing magic about building a drone. The market can fill this gap with a little bit of time. The hardest part is the chips (which admittedly are a bit magical because of their complex international supply chains), but this hurdle is minimal compared to the much larger problem we need to solve with respect to our smartphones, PC's, cars, etc., relying on Chinese semiconductors.\n\nOne last thing: if Washington is hand-wringing about a potential digital threat from China, it's probably already a reality. The CCP can make stuff happen. (And we've probably been doing something similar to them.)",
                      "score": 0,
                      "created_utc": 1734550022.0,
                      "replies": [
                        {
                          "id": "m2rja5r",
                          "author": "Surefitkw",
                          "body": "I don’t think it’s particularly easy to do what DJI has done, especially not since cost of acquisition is going to be a key factor. Look at what happened to GoPro when they tried to compete. \n\nI’m no expert, but I’ve read that DJI is a decade ahead of rivals and it has all the advantages of scale now. They are just superior drones, in every way. \n\nAre we going to nationally subsidize a U.S.-built alternative now? Because if the private sector tries it, they’re going to get murdered like GoPro. \n\nThe requirement to build and crew ships used for domestic transport in the United States has NOT worked out particularly well and now this is basically proposing to do the same thing. Yes if your only option is an American-made drone with 60% of the performance at 200% of the cost, some industries will just be forced to eat that cost. But that isn’t going to magically incubate a DJI-worthy U.S. drone-maker; it will result in lazy, expensive manufacturing just like we see with domestic shipping and transportation builds via the Jones Act.",
                          "score": 3,
                          "created_utc": 1734576458.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m2ipxft",
                  "author": "Onceforlife",
                  "body": "Thing is Ukrains survival depends on this, whereas in the good ol’ US of A, it’s more of a political and also lobbying move to do it.\n\nSince Trump is always an ass to Ukraine about them not offering anything back, how about ask for their source code so US government can also override the drones? Even that’s ridiculous, cause I know in the pentagon there must be multiple teams capable of doing this.",
                  "score": 26,
                  "created_utc": 1734455154.0,
                  "replies": [
                    {
                      "id": "m2l7nky",
                      "author": "lurkinglurkerwholurk",
                      "body": "Because there’s the danger that the replacement software also have their own spyware and cutoff triggers. /s\n\n(I put /s, but chances are high this is coming out from an actual politician’s mouth someday)\n\nOn a side note, good on the Ukrainians for jailbreaking the drones with domestically made software.",
                      "score": 4,
                      "created_utc": 1734484880.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m2l782x",
                  "author": "lurkinglurkerwholurk",
                  "body": "Turnaround on Chinese “knockoff” products is fair play, eh?",
                  "score": 1,
                  "created_utc": 1734484719.0,
                  "replies": []
                },
                {
                  "id": "m2syhj4",
                  "author": "BenificialInsect",
                  "body": "Take their product and make it our own.  Just like they do with our products...",
                  "score": 1,
                  "created_utc": 1734604527.0,
                  "replies": []
                },
                {
                  "id": "m2jh1ua",
                  "author": "grain_delay",
                  "body": "Yea, because when have we ever seen a hardware backdoor before /s",
                  "score": 1,
                  "created_utc": 1734463704.0,
                  "replies": [
                    {
                      "id": "m2jnd29",
                      "author": "MyReddittName",
                      "body": "That can be tested for. Monitoring the amount of outbound network packets and testing for unexpected outbound signals will show if there is a hardware backdoor.",
                      "score": 9,
                      "created_utc": 1734465690.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m2khsbo",
                  "author": "BaronVonMunchhausen",
                  "body": "Almost as if these restrictions and tariffs could push forward development and industry in the US. It's crazy! Who would've thunk!",
                  "score": -2,
                  "created_utc": 1734475514.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2oaget",
              "author": "blueman0007",
              "body": "That’s one thing to hack a quick patch to disable the RemoteID feature on an existing firmware, it’s a totally different game to recreate a firmware from scratch.",
              "score": 2,
              "created_utc": 1734537654.0,
              "replies": []
            },
            {
              "id": "m2ixetf",
              "author": "livahd",
              "body": "That’s the move. I could totally see the reasoning behind the caution of using Chinese drones, especially when DJI has integrated social media to share your footage. Who knows what they have the ability to do with gps and HD footage. I’d have no problem flashing it to a domestic platform that’s comparable if it came down to it.",
              "score": 5,
              "created_utc": 1734457540.0,
              "replies": [
                {
                  "id": "m2izbwk",
                  "author": "GrynaiTaip",
                  "body": "> Who knows what they have the ability to do \n\nEverything. DJI drones broadcast not just their own GPS coordinates, but also those of the operator. Russia really liked this feature, they could  aim their artillery at operators rather than trying to shoot down the drones, so Ukraine had to quickly figure out how to change the software.",
                  "score": 11,
                  "created_utc": 1734458137.0,
                  "replies": [
                    {
                      "id": "m2l2y5a",
                      "author": "Nissan-S-Cargo",
                      "body": "That’s literally to comply with US law lol",
                      "score": 15,
                      "created_utc": 1734483139.0,
                      "replies": [
                        {
                          "id": "m2nct9a",
                          "author": "GrynaiTaip",
                          "body": "Yes but they do it everywhere, even if they're sold in Asia.",
                          "score": 0,
                          "created_utc": 1734524781.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m2jawot",
                      "author": "livahd",
                      "body": "Yea, didn’t DJI specifically make that software for “law enforcement “?",
                      "score": 10,
                      "created_utc": 1734461766.0,
                      "replies": [
                        {
                          "id": "m2jsljt",
                          "author": "jjayzx",
                          "body": "Not DJI, it is now a requirement for anything flying over 250 grams in the US to have Remote ID (RID).",
                          "score": 18,
                          "created_utc": 1734467380.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2s1zb4",
              "author": "hbomb57",
              "body": "DJIs at least used to have some sketchy shit in their software. This has been an issue for about 10 years. 8 years ago some people were raising alarms about how good they were, but usable for even remotely sensitive work. Any potential military replacements were killed by dumb requirements. Like resistance to extended submergence in salt water or mcode gps or name another thing that's incompatible with \"low cost\". But, we've been reflashing dji drones for quite a few years also. That being said you won't find dji in my home.",
              "score": 1,
              "created_utc": 1734584449.0,
              "replies": []
            },
            {
              "id": "m2kzecw",
              "author": "lodelljax",
              "body": "They, the Chinese made this more difficult recently.",
              "score": 1,
              "created_utc": 1734481846.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2i1pfp",
          "author": "razrielle",
          "body": "Yup, we had a DJI Inspire 2 with a FLIR cam to do some survival training. When the military banned the use of DJI drones it sat in its box unless I borrowed it to help the fire department I volunteered for in SAR ops.",
          "score": 21,
          "created_utc": 1734447183.0,
          "replies": []
        },
        {
          "id": "m2j9tc8",
          "author": "pmjm",
          "body": "I'm only familiar with drones in the context of photography and cinematography but I agree with you. The Chinese drones are lightyears ahead of stuff designed domestically (which end up being manufactured in China anyway).\n\nThe sad truth is that our lawmakers don't care about our use cases. They're pushing a narrative and their political base is eating it up. Retirees are the largest voting block and they are largely clueless about our modern world, especially in tech. So the politicians don't care how many lives these policies affect or cost, they're going to do this and grandstand about it as if they're heroes.",
          "score": 24,
          "created_utc": 1734461426.0,
          "replies": [
            {
              "id": "m2mwo85",
              "author": "Bayesian11",
              "body": "Their narrative is everything china made is based on technology stolen from the US. If you're willing to pay a premium you can buy American counterparts which are of better quality.",
              "score": 1,
              "created_utc": 1734515046.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2ize9i",
          "author": "-GameWarden-",
          "body": "I work for a federal agency and we’ve had to use the Parrot ANACFI USA gov model and it works.\n\nThe guys who do use it much more than me do say it’s usable, but a step down. \n\nObviously it’s way more expensive so for small or state agencies it’s a big purchase. But that always what you get when something is Fully TAA, NDAA and Berry Compliant",
          "score": 13,
          "created_utc": 1734458157.0,
          "replies": [
            {
              "id": "m2j1eqn",
              "author": "jakgal04",
              "body": "This was our experience when we trialed it as well. Its \"okay\" but feels like a decent step back at 3x the price compared to our M3E. The biggest drawback for us was the transmission power. The Anafi seemed to suffer horribly in urban environments with signal interference. Our DJI lineup doesn't miss a beat.",
              "score": 12,
              "created_utc": 1734458793.0,
              "replies": [
                {
                  "id": "m2kzb3p",
                  "author": "thrownawaymane",
                  "body": "DJI treats FCC guidelines on radio power output as a loose framework and not the law.",
                  "score": 1,
                  "created_utc": 1734481814.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2sbxjk",
              "author": "NotObviouslyARobot",
              "body": "Speaking of Parrot drones, the Parrot Disco was amazing.  Some madlad actually hacked it and managed to do a full length flight between two of the Hawaiian Islands on a single battery.",
              "score": 1,
              "created_utc": 1734589658.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2hw4zu",
          "author": "Lord_Tsarkon",
          "body": "Isn’t this because the American made good stuff is only used for military? (Make more money off government than regular people)\n\nEven if the Chinese are taking your Chinese drone data as long as it’s forests and saving people and looking at whales who fuckin cares?  If you work on Military base or defense program than ban those there then.  Simple",
          "score": 38,
          "created_utc": 1734445150.0,
          "replies": [
            {
              "id": "m2hxjr1",
              "author": "Mama_Skip",
              "body": "I don't think banning the Chinese drones is necessarily the bad idea - the bad idea is doing so without first incentivizing domestic drone production to replace it in an easy transition.",
              "score": 91,
              "created_utc": 1734445676.0,
              "replies": [
                {
                  "id": "m2hxt03",
                  "author": "Twistybred",
                  "body": "So much this. We need to start making things that don’t suck in the US.",
                  "score": 38,
                  "created_utc": 1734445771.0,
                  "replies": [
                    {
                      "id": "m2i6inr",
                      "author": "m3thodm4n021",
                      "body": "We make a ton of stuff that doesn't suck in the US. Consumer electronics are generally not one of those things though.",
                      "score": 20,
                      "created_utc": 1734448858.0,
                      "replies": [
                        {
                          "id": "m2jry4u",
                          "author": "Mama_Skip",
                          "body": "I work in design. We *assemble* some consumer grade products in the US, but practically every plastic, metal, and electronic component that makes it up will generally still be manufactured east and southeast Asia. \n\nOnly products we fully manufacture ourselves top to bottom level are either simpler, nearly artisan products like leather or wood, or hyper customized skunkwork/classified elite/gov't type jobs and I'd bet even those rely heavily on Asian sourcing.",
                          "score": 24,
                          "created_utc": 1734467169.0,
                          "replies": []
                        },
                        {
                          "id": "m2j8adt",
                          "author": "Twistybred",
                          "body": "But we also make a lot of things that suck.",
                          "score": 3,
                          "created_utc": 1734460953.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m2i1xsd",
                      "author": "Zymbobwye",
                      "body": "Not possible. \n\nThe government will just put a bounty out for high quality drones that only a multibillion dollar tech company will ever be able to afford to develop and then make the barrier to entry for smaller scale tech companies impossible because the billion dollar company had hundreds of millions of dollars from US citizens tax dollars to help them alleviate R&D costs before they get the full benefit of developing and selling the product.",
                      "score": 18,
                      "created_utc": 1734447265.0,
                      "replies": [
                        {
                          "id": "m2iujxa",
                          "author": "MJOLNIRdragoon",
                          "body": "Not winning a government contract doesn't stop a company from being able to make a civilian oriented product.",
                          "score": 2,
                          "created_utc": 1734456633.0,
                          "replies": [
                            {
                              "id": "m2j2ptl",
                              "author": "zchen27",
                              "body": "Not winning a government contract can mean you going bankrupt before you can even get the civilian oriented product off of the CAD drawing.",
                              "score": 13,
                              "created_utc": 1734459205.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m2n04wl",
                  "author": "Whiterabbit--",
                  "body": "americans can't seem to produce anything for the cost and quality that the chinese are pumping out. we still have the innovation, but even american companies can't decouple manufacturing from china.",
                  "score": 1,
                  "created_utc": 1734517397.0,
                  "replies": []
                },
                {
                  "id": "m2i6tpu",
                  "author": "Yancy_Farnesworth",
                  "body": "This is one of those rare instances where specific tariffs could be beneficial. Only if it's done in concert with allies against Chinese made drones.\n\nThe CCP's playbook has always been to fund businesses through massive government incentive programs and undercut the rest of the world to end competition. It's quite literally a government funded monopoly. The only real way to fight that is to specifically make their products more expensive.",
                  "score": -7,
                  "created_utc": 1734448963.0,
                  "replies": [
                    {
                      "id": "m2ifg4q",
                      "author": "SETHW",
                      "body": "they also save a lot of overhead by limiting maximum profit companies can take.. that \"playbook\" you describe could be said about usa, france, germany, etc just the same with the exception that prices dont fall because legal corruption allows executives to pocket the majority of the subsidies as bonuses and inflate profits for shareholders.\n\nI mean fuck the CCP for a lot of reasons but we shouldnt be punishing them for figuring out that theres an advantage to prices better reflecting the real costs of production. if anything we need our representative government to better represent people and act as a counterbalance to the greed sick motives of corporations. instead it's all completely captured and all value is being sucked away into a few very rich pockets with very little output to show for it. Honestly the west feels like russia with oligarchs these days.",
                      "score": 25,
                      "created_utc": 1734451808.0,
                      "replies": [
                        {
                          "id": "m2ilmh6",
                          "author": "Yancy_Farnesworth",
                          "body": "The CCP does not limit how much profit their companies can make, in particular the ones selling to the global market. They do have some price controls in place, but those deal with domestic markets and not foreign ones.\n\nYes, the playbook has been used to some extent by other countries. But generally speaking not to the extent that the CCP does. You are underestimating the extent of government subsidy the CCP puts toward these initiatives. Rare earth metals for example are an area where the CCP has explicitly dumped on the market in order to put competitors out of business. Hell, they explicitly crashed REE markets when the US was reopening a mine a decade ago and immediately increased prices after that mine went out of business.\n\nTo say that the US is anything like the Russian situation is seriously insane. To draw any comparison to the Russian oligarchs and the amount of power they have over the government is nuts. You're either dramatically underestimating the amount of corruption the Russian government has or severely overestimating how rife it is in the US. The US by no means is a paragon of non-corruption, but Russia is quite literally a kleptocratic state built on a foundation of state owned enterprises sold to specific individuals.",
                          "score": -3,
                          "created_utc": 1734453787.0,
                          "replies": [
                            {
                              "id": "m2jgz9n",
                              "author": "munche",
                              "body": "Haven't been keeping up with the news lately? \n\nThe Richest man in the world is currently bragging about all of the government agencies he is going to dismantle\n\nBasically every branch of government is going to be led by a billionaire who has a vested interest in profiting off their work rather than letting it be for public good\n\nWhat exactly do you think the end goal is there",
                              "score": 20,
                              "created_utc": 1734463681.0,
                              "replies": [
                                {
                                  "id": "m2jvdan",
                                  "author": "Yancy_Farnesworth",
                                  "body": "OK. That doesn't negate my point? More than one thing can be bad and corrupt. That doesn't justify anyone else doing what they're doing. No system is perfect. Instead of trying to deflect away from that, it's better that it's out in the open so that we can work on addressing it.",
                                  "score": -2,
                                  "created_utc": 1734468267.0,
                                  "replies": [
                                    {
                                      "id": "m2k81zc",
                                      "author": "munche",
                                      "body": "You just said that it's insane to equate the corruption in the US with the oligarchy of Russia, when we're watching the oligarchs of tomorrow get confirmed into the cabinet of the US President and they are publicly bragging about how they're going to privatize every part of the US government they can to enrich themselves. You seem to think this isn't a big deal",
                                      "score": 18,
                                      "created_utc": 1734472303.0,
                                      "replies": [
                                        {
                                          "id": "m2o42cz",
                                          "author": "Yancy_Farnesworth",
                                          "body": "Did I ever claim it's not a big deal? It certainly is. And the point is that we're not at the point of Russia yet. And there are still safeguards in place that will reign in Trump and his ilk. There are things that can be done to turn it around peacefully. The only way to turn that around in Russia is a violent revolution unless Putin decides to cede power.",
                                          "score": 1,
                                          "created_utc": 1734535550.0,
                                          "replies": [
                                            {
                                              "id": "m2q7n0p",
                                              "author": "munche",
                                              "body": "What safeguards? The people who spent the last 6 months warning us about the destruction of our democracy are smiling and doing photo ops and bragging about how willing to work with Trump's team they are. \n\nThere's nobody guarding the gates. Trump is openly going to loot and privatize as much of the government as humanly possible and they can't even be bothered to muster up a protest against the cabinet nominees. \n\nJust watching a car careen towards a cliff at 100mph and shrugging saying \"i'm sure it'll be fine\"",
                                              "score": 1,
                                              "created_utc": 1734559294.0,
                                              "replies": [
                                                {
                                                  "id": "m2u1el1",
                                                  "author": "Yancy_Farnesworth",
                                                  "body": "This isn't the first time we have corrupt people in the position of president and it wont be the last. To say that there are no safeguards ignores how the government functions and the sheer number of people who actually believe in the rule of law that serve in the government. Trump is only one person. He is temporary and he can only appoint temporary people into positions of power. He can't seize control of the government and turn it into a dictatorship.\n\nAnd that's my point. The entire history of the US is a tug of war balancing act. Sometimes it regresses, sometimes it advances. There's a reason why the US has been historically referred to as an imperfect union and a grand experiment. No reasonable person claims it is perfect, no reasonable person thinks it's an autocratic dictatorship like Russia or China.",
                                                  "score": 1,
                                                  "created_utc": 1734621889.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m2meni9",
                          "author": "Kierenshep",
                          "body": "It also helps that environmental regulations and labour laws are lax in China compared to other nations, and wages are significantly lower and suppressed.\n\nKinda hard to fight near slave labour with little to no expensive oversight.",
                          "score": -2,
                          "created_utc": 1734503290.0,
                          "replies": [
                            {
                              "id": "m2mw8r1",
                              "author": "TrumpDesWillens",
                              "body": "Slave labor doesn't allow them to manufacture drones by the millions.  Their cost of labor is the same as Mexico now, it is their manufacturing capacities and scale that allows them to out-produce others.  Anyone even using the words \"slave labor\" in talking about manufacturing in 2024 doesn't know a thing about manufacturing.",
                              "score": 5,
                              "created_utc": 1734514751.0,
                              "replies": [
                                {
                                  "id": "m2p6vbb",
                                  "author": "rasheeeed_wallace",
                                  "body": "Blaming slave labor is the ultimate coping mechanism. Otherwise people would have to admit that other countries can do certain stuff better than us",
                                  "score": 5,
                                  "created_utc": 1734547880.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m2mrf69",
                              "author": "SETHW",
                              "body": "that's a fact, a more ideal system will aggressively regulate or otherwise account for external costs in the processes better than any country has done so far",
                              "score": 1,
                              "created_utc": 1734511397.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m2jgo1q",
                      "author": "munche",
                      "body": "Except for if they can't afford it already you're just pricing them out of the market they can afford, so the problem in the OP remains",
                      "score": 5,
                      "created_utc": 1734463583.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m2i3e1c",
                  "author": "EddardStank_69",
                  "body": "This will disrupt the market and leave a vacuum for a quality drone company to fill. We’ll have shitty drones for quite some time, but if/when the ban is implemented it won’t take long for a reliable brand to come into existence. \n\nAgain, the market alone would reward them for simply trying",
                  "score": -6,
                  "created_utc": 1734447773.0,
                  "replies": [
                    {
                      "id": "m2j2en0",
                      "author": "Draxx01",
                      "body": "Banning a superior product doesn't create a newer better product. It just means the guy making a POS now has no competition and now less incentive to make better shit.",
                      "score": 18,
                      "created_utc": 1734459107.0,
                      "replies": [
                        {
                          "id": "m2mwdtp",
                          "author": "TrumpDesWillens",
                          "body": "Those companies will then not innovate and be surprised when in 15 years all of Africa and South America is using Chinese drones.  This is happening in the car industry too.",
                          "score": 2,
                          "created_utc": 1734514849.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m2idu5m",
                      "author": "SillyGoatGruff",
                      "body": "Or you'll get a market flooded with equally shitty tesla drones on the back of corrupt subsidies",
                      "score": 13,
                      "created_utc": 1734451285.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2irnud",
              "author": "jwbaynham",
              "body": "What company makes the drones for the US military? Seems like an investment opportunity",
              "score": 2,
              "created_utc": 1734455711.0,
              "replies": []
            },
            {
              "id": "m2iiud0",
              "author": "Acceptable-Truck3803",
              "body": "The good US stuff is $$$$. That’s the issue when you are battling for the best tools with the best cost for the American tax payer.",
              "score": 1,
              "created_utc": 1734452897.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2i21qj",
          "author": "nagi603",
          "body": "Look, unless it impacts the weapons industry, it is of no consequence for the ruling bodies.",
          "score": 3,
          "created_utc": 1734447304.0,
          "replies": []
        },
        {
          "id": "m2r27hr",
          "author": "MRB0B0MB",
          "body": "Fellow drone pilot here, Skydio is indeed crap. I haven’t flown a platform made by the West that is viable compared to DJI.",
          "score": 3,
          "created_utc": 1734570103.0,
          "replies": []
        },
        {
          "id": "m2iikxe",
          "author": "TheCoolOnesGotTaken",
          "body": "I think the people pushing this do not have any concern over public safety or scientific research. Your concerns are not concerning to them.",
          "score": 10,
          "created_utc": 1734452815.0,
          "replies": []
        },
        {
          "id": "m2m3qu5",
          "author": "Phoenix547",
          "body": "We looked at the [IF800](https://www.inspiredflight.com/if800.php) a few months ago, but came to the same conclusions... While it has similar dimensions and payload capacity to the Matrice 300, the sensor package and software looked bad, the build quality was bad, and the price was worse than the Matrice.",
          "score": 2,
          "created_utc": 1734497590.0,
          "replies": []
        },
        {
          "id": "m2k8zsq",
          "author": "Dylanator13",
          "body": "It really sucks that rather than actually making better stuff here we decide just to ban competition. DJI is great. Why can no one here make a competitive drone? Are we just too busy funneling R&D money into ceos pockets?",
          "score": 3,
          "created_utc": 1734472600.0,
          "replies": [
            {
              "id": "m2ntje7",
              "author": "GeneralizedFlatulent",
              "body": "No it's also the shareholders won't someone think of them too",
              "score": 1,
              "created_utc": 1734531833.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2kid44",
          "author": "SilverSheepherder641",
          "body": "At least the ban won’t affect existing dji drones, but still dumb. They aren’t banning any other Chinese made drones, just DJI.",
          "score": 1,
          "created_utc": 1734475713.0,
          "replies": []
        },
        {
          "id": "m2kqruy",
          "author": "istareatscreens",
          "body": "\"there's not a single decent US made drone that we can use\" - that is a problem that needs fixing.",
          "score": 1,
          "created_utc": 1734478710.0,
          "replies": [
            {
              "id": "m2mwq7i",
              "author": "T00MuchSteam",
              "body": "And the fix should be to encourage American drone makers to do better, not shoot their competitors in the knee so that American manufacturers come out on top by being the only ones still be able to stand up. \n\nMake a good product that someone would *want* to buy.",
              "score": 3,
              "created_utc": 1734515085.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2l3bxn",
          "author": "True-End-882",
          "body": "Asking from a place of humble honest curiosity and patriotism, what can we (‘murica) do better with our drones? Please answer me.",
          "score": 1,
          "created_utc": 1734483277.0,
          "replies": []
        },
        {
          "id": "m2lfmt9",
          "author": "McPhage",
          "body": "The thing is: being years behind on drone tech is really bad for the US.  Drone technology is the future.  So these bans need to go along with dumping billions of dollars into domestic drone companies.",
          "score": 1,
          "created_utc": 1734487836.0,
          "replies": [
            {
              "id": "m2n0kjk",
              "author": "Whiterabbit--",
              "body": "we also have huge problems with FAA and overregulation. what people are able to do around the world with drones are completely blocked by unnecessary regulations in the US. I am not saying we don't keep our airspace safe, but we need to regulate based on the developing technologies. if we had more freedom to use drones in the US more innovation would have come about to advance the technology in many directions.",
              "score": 0,
              "created_utc": 1734517684.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2llp7h",
          "author": "Relevant-Doctor187",
          "body": "Def a trend when Chinese products are restricted we find that the chief complaint is price and quality. Which is a shame.",
          "score": 1,
          "created_utc": 1734490149.0,
          "replies": []
        },
        {
          "id": "m2n7oyu",
          "author": "None",
          "body": "“Public Safety”. I sure do hope the police state is able to acquire high quality drones for our supervision. ",
          "score": 1,
          "created_utc": 1734522089.0,
          "replies": []
        },
        {
          "id": "m2my1iz",
          "author": "McDudeston",
          "body": "National security > your research",
          "score": 0,
          "created_utc": 1734515981.0,
          "replies": []
        },
        {
          "id": "m2i4i9c",
          "author": "ASubsentientCrow",
          "body": "US companies should just do what Chinese ones do and blatantly ignore patents and copyright",
          "score": -3,
          "created_utc": 1734448167.0,
          "replies": [
            {
              "id": "m2mwse0",
              "author": "T00MuchSteam",
              "body": "Apparently two wrongs make a right",
              "score": 2,
              "created_utc": 1734515126.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2n89xw",
          "author": "rendingmelody",
          "body": "If you work in public safety and use chinese equipment in any sense, I wonder if your ignorant of all the instances with tech like network switches and things being backdoored or if your just lying.\n\n\nAny company with any sense wouldnt do that, let alone any that deal with security.",
          "score": -1,
          "created_utc": 1734522416.0,
          "replies": []
        },
        {
          "id": "m2j8ss4",
          "author": "None",
          "body": "[deleted]",
          "score": -5,
          "created_utc": 1734461112.0,
          "replies": [
            {
              "id": "m2jcokz",
              "author": "Bacon4Lyf",
              "body": "What the fuck has search and rescue using drones got to do with police",
              "score": 6,
              "created_utc": 1734462323.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2ktaxa",
          "author": "gregkiel",
          "body": "innate theory aromatic square dependent wide flag pocket six towering\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": -3,
          "created_utc": 1734479634.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2i7xvt",
      "author": "None",
      "body": "Or we could make better drones and not suck at things after awhile…just a thought",
      "score": 41,
      "created_utc": 1734449345.0,
      "replies": [
        {
          "id": "m2if0od",
          "author": "Cpt_OceanMan",
          "body": "Surely it's a good idea for America to be reliant on another world superpower's technology, right?",
          "score": 4,
          "created_utc": 1734451669.0,
          "replies": []
        },
        {
          "id": "m2kg4vi",
          "author": "fawlty_lawgic",
          "body": "It's a bit more complicated than that, because the CCP is basically subsidizing their products and making it impossible to really compete because of cost. A US company could make a comparable or even better product, but not that would ever be remotely close in terms of price.",
          "score": 1,
          "created_utc": 1734474955.0,
          "replies": [
            {
              "id": "m2lierj",
              "author": "None",
              "body": "[removed]",
              "score": 9,
              "created_utc": 1734488892.0,
              "replies": [
                {
                  "id": "m2lklj4",
                  "author": "fawlty_lawgic",
                  "body": "I’m not opposed to that myself, but things like this often get used as political footballs and if one side pushes hard for it, the other side will (usually) push hard against it because “everything the other side wants to do is BAD”. And this is one of the ways where being a democracy is something of a hinderance. The CCP can easily do it because they are an authoritarian regime in full control. Not saying I would prefer our government be like theirs, but that is a reason why we may not be able to do it even though they can. We argue and fight about everything in this country. Sometimes that’s good, sometimes it’s not.",
                  "score": 4,
                  "created_utc": 1734489728.0,
                  "replies": [
                    {
                      "id": "m2nnq2e",
                      "author": "sirhoracedarwin",
                      "body": "Um tiktok is set to be banned in about a month because of overwhelming bipartisan support. Subsidizing the drone industry could easily get bipartisan support here, especially if it were pushed as a public safety and national security issue.\n\nIf there's one thing both sides agree on, it's Chinese fear mongering.",
                      "score": 3,
                      "created_utc": 1734529570.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2lrx9w",
              "author": "Aaron_Hamm",
              "body": "So banning the Chinese ones will fix that then...",
              "score": 4,
              "created_utc": 1734492567.0,
              "replies": [
                {
                  "id": "m2lve3d",
                  "author": "fawlty_lawgic",
                  "body": "No and I didn’t say that. These are wholly separate issues. They’re not banning them because they’re subsidized, they’re banning them because it’s a national security matter. On the other hand, people might not mind the ban if there was a viable US made alternative, but there isn’t a US alternative because of how DJI had been subsidized. These are separate issues and the only one conflating them is you.",
                  "score": -1,
                  "created_utc": 1734493960.0,
                  "replies": [
                    {
                      "id": "m2nhjfu",
                      "author": "Aaron_Hamm",
                      "body": "I'm saying that...\n\nLol",
                      "score": 0,
                      "created_utc": 1734526982.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m2o85fw",
                  "author": "mortaneous",
                  "body": "No, but this situation is exactly what tariffs are for, bringing the cost of a foreign good up to near parity with the domestic competition.",
                  "score": -1,
                  "created_utc": 1734536904.0,
                  "replies": [
                    {
                      "id": "m2oeg3u",
                      "author": "Aaron_Hamm",
                      "body": "I'm in support of the ban",
                      "score": 0,
                      "created_utc": 1734538952.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m2ht2qs",
      "author": "Unsimulated",
      "body": "All in favor of bringing jobs home and not abundantly funding those who would seek to be dictators to the world.    But you can't just cut off supply.    You have to build your own production capacity first.",
      "score": 133,
      "created_utc": 1734443962.0,
      "replies": [
        {
          "id": "m2hwyvt",
          "author": "CoreParad0x",
          "body": "That's a problem with a lot of policies I've seen floating about lately, like Trumps tariffs. Look, I'm all for more US-made stuff. In some cases like processors and other advanced computing components, I think it's actually a national security issue that the US and our allies in general can't manufacture these things to the same degree.\n\nBut this is all brute force and it's just going to fuck shit up in the mean time. I find it hard to believe there isn't a way to legislate incentives to bringing US manufacturing of this stuff here, and have more US based companies pop up, that isn't just kicking the entire system in the nuts.\n\nThis kind of stuff looks a lot more like corruption than an honest attempt at solving the problem. You can't spin up fabs and manufacturing in general overnight.",
          "score": 79,
          "created_utc": 1734445459.0,
          "replies": [
            {
              "id": "m2i5rte",
              "author": "ThePowerOfStories",
              "body": "> I find it hard to believe there isn’t a way to legislate incentives to bringing US manufacturing of this stuff here, and have more US based companies pop up, that isn’t just kicking the entire system in the nuts.\n\nLike, say, Biden’s 2022 [CHIPS Act](https://en.wikipedia.org/wiki/CHIPS_and_Science_Act).",
              "score": 47,
              "created_utc": 1734448603.0,
              "replies": [
                {
                  "id": "m2i7y1a",
                  "author": "The_Parsee_Man",
                  "body": "Or Biden's tariffs \n\nhttps://www.cnn.com/2024/09/13/politics/china-tariffs-biden-trump/index.html",
                  "score": 5,
                  "created_utc": 1734449346.0,
                  "replies": [
                    {
                      "id": "m2jbi0j",
                      "author": "WestonP",
                      "body": "Yup. Semiconductors getting increased to 50% (from Trump's 25%) starting Jan 1st too.\n\nThe de minimis exemption was nice while it lasted, but Temu and similar garbage flooding our markets has ruined it for everyone. Between utilizing direct-to-consumer sales to get the de minimis exemption (and fly under the radar on regulatory compliance), subsidized international postage rates, and devaluing their own currency, they really stacked the deck in their favor so egregiously that something absolutely had to be done. That's something that both Biden and Trump agree upon, at least in principle.\n\nIt's not to say we really have any moral high ground on how we conduct our business, or that we should hate the Chinese for doing the same things that we'd probably do in their situation, but it's a simple matter of protecting our own interests.",
                      "score": 12,
                      "created_utc": 1734461950.0,
                      "replies": []
                    },
                    {
                      "id": "m2idx76",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -1,
                      "created_utc": 1734451312.0,
                      "replies": [
                        {
                          "id": "m2iyft6",
                          "author": "Rage_Like_Nic_Cage",
                          "body": "> China attempting to flood the market, eliminate competition in order to dominate the market and gimp other nation's EV capability\n\nThat is a wild way to phrase “chinese companies built cheap electric cars and the U.S. blocked their sales because they would dominate the market since American automakers dropped the ball at making EVs”",
                          "score": 10,
                          "created_utc": 1734457861.0,
                          "replies": []
                        },
                        {
                          "id": "m2il82n",
                          "author": "The_Parsee_Man",
                          "body": "Biden kept and expanded Trump's tariffs. So your context is missing context.\n\n>Trump implemented sweeping tariffs on about $300 billion of Chinese-made products when he was in office. President Joe Biden has kept those tariffs in place and, after the USTR finished a multiyear review earlier this year, decided to increase some of the rates on about $15 billion of Chinese imports.",
                          "score": 10,
                          "created_utc": 1734453658.0,
                          "replies": [
                            {
                              "id": "m2ivygo",
                              "author": "None",
                              "body": "Love this cause many items increased in price, tools and etc. Yet people rooted for Trump as he was increasing costs, and Biden era inflation, biden was booed as he never directly increased costs. \n\n\nMAGA crowd is genuinely stupid.",
                              "score": 7,
                              "created_utc": 1734457078.0,
                              "replies": [
                                {
                                  "id": "m2iy6dx",
                                  "author": "Awkward_Pangolin3254",
                                  "body": "The man *told* them to their *faces* the first thing he was going to do when he took office was make things more expensive (in the form of tariffs). They still voted for him, because it's a cult.",
                                  "score": 9,
                                  "created_utc": 1734457779.0,
                                  "replies": [
                                    {
                                      "id": "m2k5sby",
                                      "author": "jb32647",
                                      "body": "No, but he said the other countries will pay the tariffs! Somehow, despite that not being how tariffs work…",
                                      "score": 2,
                                      "created_utc": 1734471582.0,
                                      "replies": [
                                        {
                                          "id": "m2kar2i",
                                          "author": "NickCharlesYT",
                                          "body": "Other countries will \"pay\" a \"price\" for the tariffs, but the US customers will **pay the price** financially when they ultimately need something that's either no longer available or too expensive to buy. The other countries \"pay\" when sales slow/stop as a result.\n\nSo we were basically told half of the story, from a point of view that is not our own as consumers. Enough for it to pass in politics, unfortunately...",
                                          "score": 1,
                                          "created_utc": 1734473167.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2i8bey",
              "author": "Biscuits4u2",
              "body": "Those manufacturing jobs are never coming back to the US. All companies have to do is raise prices and wait out the Trump administration for a few years. People who think blanket tariffs are going to magically switch our economy back into a manufacturing powerhouse are kidding themselves. Even if those companies did open factories here, they would be heavily automated and would only employ a small fraction of the workers who would have been required decades ago.",
              "score": 22,
              "created_utc": 1734449472.0,
              "replies": [
                {
                  "id": "m2jhioa",
                  "author": "munche",
                  "body": "Also uhhh where do you think the factories are going to get materials\n\nHow is the US factory going to be competitive when there are huge tariffs on all of their raw goods they don't face if they build elsewhere in the world",
                  "score": 9,
                  "created_utc": 1734463852.0,
                  "replies": [
                    {
                      "id": "m2n38dh",
                      "author": "TheTerrasque",
                      "body": "I read a comment some years ago from someone claiming to be part of that kind of industry. It's not just raw materials, but everything. Like for example screws. In China, in most cases you had several manufacturers in the same city. So you just walked over and talked with them, and got a good deal. And that was for everything needed.\n\nIf you're going to move end product production to US you already have a massive logistics nightmare sourcing and transporting all the hundreds of different small things you need for the end product. It's not \"just\" moving over a factory, it's the whole supporting infrastructure for that factory too.",
                      "score": 2,
                      "created_utc": 1734519405.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m2ifb0a",
                  "author": "no_shoes_are_canny",
                  "body": "It's not about manufacturing jobs, it's about manufacturing production. Cheaper, mostly automated manufacturing is what they want. The goal is cheaper domestic production, not an increase in employment.",
                  "score": -5,
                  "created_utc": 1734451763.0,
                  "replies": [
                    {
                      "id": "m2ihbs6",
                      "author": "Biscuits4u2",
                      "body": "Domestic production is never going to be cheaper than virtual slave labor in a third world country. And I guess you haven't been listening to the drivel coming out of the MAGA politicians' mouths talking about all the sweet manufacturing jobs they're going to bring back. This is total delusional thinking.",
                      "score": 10,
                      "created_utc": 1734452415.0,
                      "replies": [
                        {
                          "id": "m2j11wk",
                          "author": "rasheeeed_wallace",
                          "body": "Your mode of thinking is outdated if you still believe that manufacturing is driven by cheapness of labor.",
                          "score": -4,
                          "created_utc": 1734458679.0,
                          "replies": [
                            {
                              "id": "m2jvt1b",
                              "author": "Biscuits4u2",
                              "body": "This is the most hilarious thing I've read all day. Cheap labor is literally the reason all of those manufacturing jobs went overseas.",
                              "score": 5,
                              "created_utc": 1734468405.0,
                              "replies": [
                                {
                                  "id": "m2jx5bb",
                                  "author": "rasheeeed_wallace",
                                  "body": "That must be why all these companies are rushing to take advantage of uber cheap Afghan labor and rushing to establish factories in Afghanistan.",
                                  "score": -4,
                                  "created_utc": 1734468825.0,
                                  "replies": [
                                    {
                                      "id": "m2k6nmb",
                                      "author": "Biscuits4u2",
                                      "body": "Not even sure what point you're trying to make here.",
                                      "score": 4,
                                      "created_utc": 1734471859.0,
                                      "replies": [
                                        {
                                          "id": "m2mx7v2",
                                          "author": "TrumpDesWillens",
                                          "body": "If cheap labor was all that is needed for mass manufacturing, why are there no companies moving to the poorest parts of the world to manufacture?  The answer is that cheap labor is not the reason.  China out-competes the world in manufacturing because of scale, investment in infrastructure, concentration of educated people at the place of manufacturing, and vertically-integrated supply chains (like how BYD owns their own lithium and cobalt operations in Central Africa.)\n\nYou know what point he was trying to make and you are playing dumb arguing in bad-faith.",
                                          "score": 2,
                                          "created_utc": 1734515422.0,
                                          "replies": [
                                            {
                                              "id": "m2my4po",
                                              "author": "Biscuits4u2",
                                              "body": "Oh, you mean like playing dumb and pretending cheap labor isn't at the tippy top of the reasons companies move offshore? And where did I say cheap labor was the only factor? Sure, there are others. You'd be pretty ignorant to claim it isn't very often the primary motivator for relocating manufacturing and service operations to developing countries where they can get away with paying much less. I realize you're trying to sound smart here, but saying something like \"cheap labor is not the reason\" has the opposite effect.",
                                              "score": -1,
                                              "created_utc": 1734516042.0,
                                              "replies": [
                                                {
                                                  "id": "m3p8e4d",
                                                  "author": "TrumpDesWillens",
                                                  "body": "Cheaper labor is no longer the most important",
                                                  "score": 2,
                                                  "created_utc": 1735105432.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "m2katcn",
                                          "author": "rasheeeed_wallace",
                                          "body": "Condolences",
                                          "score": -1,
                                          "created_utc": 1734473187.0,
                                          "replies": [
                                            {
                                              "id": "m2kc0jo",
                                              "author": "Biscuits4u2",
                                              "body": "Yeah you got nothin",
                                              "score": -1,
                                              "created_utc": 1734473583.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "m2l4tz8",
                                      "author": "weissbieremulsion",
                                      "body": "right and we're seeing all companies rushing to produce in the ultra cheap US because even the price of Power, permits and everything else isnt cheaper in China. \n\nIf your theory would be true, there would be no need for external Intervention. \n\n\n\nand yes we already started using other countries for there cheap labour, like for clothing from Bangladesch.",
                                      "score": 1,
                                      "created_utc": 1734483824.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m2jtpc4",
                              "author": "Snuffleupuguss",
                              "body": "It literally is, why do you think wage inflation is something the government wants to bring down? It makes the cost of labour too expensive\n\nManufacturing production is literally driven by their input costs I.e. wages and materials\n\nIn an ideal world, a factories inputs would be incredibly cheap to allow them to get a bigger percentage return on the sale of the end product. Why do you think manufacturing went to India and china? Why do you think a lot of big CEOs complain about minimum wage laws?\n\nOf course there are other factors, but cost of labour is a huge one",
                              "score": 2,
                              "created_utc": 1734467736.0,
                              "replies": [
                                {
                                  "id": "m2jvn67",
                                  "author": "rasheeeed_wallace",
                                  "body": "Do you think manufacturing is just a black box where you input materials and labor and out comes a product? Here are some things that matter more than labor cost for manufacturing: infrastructure, technology, skill/know how, upstream supply chain, and ability to scale. Otherwise you would see a very strong correlation between cheap labor and manufacturing capacity. There are so many countries in the world with very cheap labor and no manufacturing capacity.",
                                  "score": 3,
                                  "created_utc": 1734468353.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2i3n5u",
              "author": "None",
              "body": "The economy is global now. Reverting to the 1950s style of domestic manufacturing isn't possible. There's a significant \"brain drain\" in the US manufacturing sector plus labor is extraordinarily higher than in Asia or Africa. Thus to get the engineers, scientists, and talented machine operators you have to pay for them. Food manufacturing, for example, has the lowest profit margin I've personally seen. Most of the safety and quality leaders in medium to smaller companies are not technically sound and/or cannot do root cause evaluations. This is why there are tons of food recalls at the moment. I used to do independent auditing in manufacturing for safety and quality as a career.\n\nYou are correct. This is all reactionary and won't have the desired effect politicians think it will.   We will end up paying more for items that aren't half as good for 5+ years. I don't see politicians desiring to weather the public backlash for half that time frame.",
              "score": 13,
              "created_utc": 1734447863.0,
              "replies": [
                {
                  "id": "m2i738r",
                  "author": "CoreParad0x",
                  "body": "Yeah I agree. To me, it would make sense to find a way to create demand for US-based manufacturing of specific critical items, like drugs, CPUs and PCBs, etc. If not directly in the US, at least in our actual allies.\n\n> You are correct. This is all reactionary and won't have the desired effect politicians think it will. We will end up paying more for items that aren't half as good for 5+ years. I don't see politicians desiring to weather the public backlash for half that time frame.\n\nYeah I agree. And if anything I think most of this brute-force crap is really just set to fail and allow certain people to benefit from kickbacks for exemptions, among other things. Most of these companies which will be effected aren't going to invest in shifting to US manufacturing, they will simply raise their prices as necessary and keep it off shore. I don't see it changing without significant investment and incentives from the government to actually do it. Hell, in some cases I think there are certain things we simply can't make here. Things like certain agricultural products, if I remember right. And to add to that, we still have to source the materials for it all, which if we have them here is even more time to spin up mines and such for. And that's all besides the labor and brain drain issues you've mentioned.\n\nIt's definitely more complex of an issue than \"lol tariffs and ban foreign products\" will solve.\n\n> Food manufacturing, for example, has the lowest profit margin I've personally seen. Most of the safety and quality leaders in medium to smaller companies are not technically sound and/or cannot do root cause evaluations. This is why there are tons of food recalls at the moment. I used to do independent auditing in manufacturing for safety and quality as a career.\n\nThat's interesting, I don't know too much about that area. Personally this new administration has me fairly concerned about where food safety might go, I feel like it may get even worse.",
                  "score": 3,
                  "created_utc": 1734449055.0,
                  "replies": [
                    {
                      "id": "m2ilelw",
                      "author": "None",
                      "body": "The Food branch of the FDA is severely under-resourced to the point they can't enforce regulations preemptively before adverse events. Pet/animal food is particularly bad in this regard. USDA bends to business influence (Boar's Head) just as easily.  \n\nAll food in general relies on audits that occur once per year and are easily planned for. For example, you can keep your facility filthy until your audit window of 90 days and then go back to business as usual after the audit. You can hand select documentation to the auditor. The audit industry has also lowered its standards to require only 2 years of industry experience instead of being an industry comprised of a more seasoned workforce. This is because the company being audited pays for the audit and can refuse to have the same auditor for the following audit if they don't like the result. \n\nSo yeah regulations at this time will just exasperate the growing problems.",
                      "score": 2,
                      "created_utc": 1734453717.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m2lp446",
                  "author": "None",
                  "body": "I could potentially see it working in a situation where manufacturing is almost entirely automated here though, and that’s kind of always been the goal anyways.",
                  "score": 1,
                  "created_utc": 1734491464.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2i2i6h",
              "author": "nagi603",
              "body": "Not caring one bit about consequences is the very heart of populism. Say big things that sound good if you have your brain turned off. Then say another thing so they don't have a minute to reflect and find the very obvious flaws. Repeat ad nauseam.",
              "score": 4,
              "created_utc": 1734447463.0,
              "replies": []
            },
            {
              "id": "m2ixxdn",
              "author": "Awkward_Pangolin3254",
              "body": ">This kind of stuff looks a lot more like corruption\n\nBecause that's all he knows.",
              "score": 1,
              "created_utc": 1734457701.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2i4wtu",
          "author": "RikiWardOG",
          "body": "except in many cases we don't even have the ability to build our own production or at least not in a timely or cost effective manor.",
          "score": 9,
          "created_utc": 1734448305.0,
          "replies": []
        },
        {
          "id": "m2i8wrr",
          "author": "NorysStorys",
          "body": "‘Not abundantly funding those who would seek to be dictators’ and you’re wanting to buy US when everyone and their mothers already kissing Cheeto benitos ring even after all the proto-dictator rhetoric? Interesting take.",
          "score": 14,
          "created_utc": 1734449673.0,
          "replies": [
            {
              "id": "m2kj059",
              "author": "Mythic-Insanity",
              "body": "China has literal concentration camps where they “reeducate” political dissidents if they don’t outright murder them, your TDS has progressed to full blown brain worms.",
              "score": -9,
              "created_utc": 1734475934.0,
              "replies": [
                {
                  "id": "m2kjccs",
                  "author": "SDHJerusalem",
                  "body": "And the U.S. is funding an apartheid ethnostate actively invading Syria, what's your point.",
                  "score": 4,
                  "created_utc": 1734476051.0,
                  "replies": [
                    {
                      "id": "m2klgkd",
                      "author": "Mythic-Insanity",
                      "body": "I don’t think you understand what a dictatorship is because funding a proxy war doesn’t make a country a dictatorship. You tried to make a point and you should be proud of that, maybe next time you’ll make a good one.",
                      "score": -2,
                      "created_utc": 1734476788.0,
                      "replies": [
                        {
                          "id": "m2km1jg",
                          "author": "SDHJerusalem",
                          "body": "America actively supports and props up multiple dictatorships. The Pakistani military junta, for instance.",
                          "score": 5,
                          "created_utc": 1734476992.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m2l79o9",
                  "author": "awesomeoh1234",
                  "body": "Hi they actually don’t!",
                  "score": -1,
                  "created_utc": 1734484735.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m2jo7l0",
          "author": "RockAndGames",
          "body": "Unlike the USA, that doesn't want to dictate what happens on the world? We all love a free market and capitalism until we don't benefit the most from it.",
          "score": 6,
          "created_utc": 1734465962.0,
          "replies": []
        },
        {
          "id": "m2i4348",
          "author": "ASubsentientCrow",
          "body": "You can't build capacity of people won't buy it. Supply side shit is the same shit that Republicans have been trying for decades",
          "score": 4,
          "created_utc": 1734448019.0,
          "replies": []
        },
        {
          "id": "m2iqff2",
          "author": "whilst",
          "body": "But bringing jobs home now means funding someone who would seek to be a dictator :\\",
          "score": 2,
          "created_utc": 1734455314.0,
          "replies": []
        },
        {
          "id": "m2hy6aw",
          "author": "None",
          "body": "That ship has sailed unfortunately.",
          "score": 2,
          "created_utc": 1734445909.0,
          "replies": []
        },
        {
          "id": "m2iwssa",
          "author": "Chronotaru",
          "body": "The problem is that in a corporate kleptocracy that is capitalism, this cannot be done directly. As such often the stick must come first. The only other way is to put the change sometime in the future, but this doesn't always have the desired effect.",
          "score": 2,
          "created_utc": 1734457347.0,
          "replies": []
        },
        {
          "id": "m2k86yj",
          "author": "IIIIlllIIIIIlllII",
          "body": "Problem is that even if you build production capacity you still wont be competitive. Can't compete with the price of Chinese labor.\n\nIts why you can't buy a Chinese EV. US has plenty of capability to build cars and EVs, but the Chinese cars are just cheaper and better.",
          "score": 1,
          "created_utc": 1734472347.0,
          "replies": [
            {
              "id": "m2n0tnx",
              "author": "Whiterabbit--",
              "body": "we are years behind in research for  battery technology.",
              "score": 1,
              "created_utc": 1734517852.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2kf1an",
          "author": "treemanos",
          "body": "It's typical, refuse to invest then get mad that you don't have the benefits of having invested.",
          "score": 1,
          "created_utc": 1734474585.0,
          "replies": []
        },
        {
          "id": "m2kiriu",
          "author": "pennywitch",
          "body": "You can and should cut off supply if it is a giant national security problem. \n\nThis is a problem that will be dealt with. The longer it is put off, the higher the cost will be.",
          "score": 1,
          "created_utc": 1734475851.0,
          "replies": []
        },
        {
          "id": "m2ls22w",
          "author": "Aaron_Hamm",
          "body": "I mean, you can... They're quadcopters, not medicines",
          "score": 1,
          "created_utc": 1734492622.0,
          "replies": []
        },
        {
          "id": "m2hxs44",
          "author": "None",
          "body": "[deleted]",
          "score": -3,
          "created_utc": 1734445762.0,
          "replies": [
            {
              "id": "m2izhew",
              "author": "Rage_Like_Nic_Cage",
              "body": "> There are legitimate security concerns about the majority of drones being Chinese in origin.\n\nThis Red Scare 2.0 is getting really tiring at this point. China sucks, but acting like everything being produced there is part of some super secret surveillance state to spy on every inch of Western governments is borderline fantastical thinking.",
              "score": 17,
              "created_utc": 1734458184.0,
              "replies": [
                {
                  "id": "m2jl2nf",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -8,
                  "created_utc": 1734464970.0,
                  "replies": [
                    {
                      "id": "m2jo6y6",
                      "author": "Rage_Like_Nic_Cage",
                      "body": "Remember how in 2022 Russia completely embarrassed themselves by invading Ukraine and utterly failing at the quick overthrowing everyone thought they were capable of? Russia has proven Russia is no threat to anyone outside of their immediate smaller neighbors. \n\nIf you think Russia is actually a threat (outside of nukes, which is a different point), it’s no wonder you think China is a sPoOkY boogeyman. The NSA with all its advance tech can’t even adequately spy on their own people. What makes you think that’s something China is capable of doing it any better?",
                      "score": 4,
                      "created_utc": 1734465957.0,
                      "replies": [
                        {
                          "id": "m2kfmma",
                          "author": "fawlty_lawgic",
                          "body": "They embarrassed themselves with Ukraine, sure, but their influence campaign against US voters has been nothing short of spectacular. They may not have the brute force or infrastructure when it comes to military strength & operational efficiency, but they know how to use free speech to really manipulate people into doing things against their best interest, or even believing that they are some \"based\" right-wing utopia of a country.",
                          "score": 2,
                          "created_utc": 1734474784.0,
                          "replies": []
                        },
                        {
                          "id": "m2lsnwe",
                          "author": "Aaron_Hamm",
                          "body": "Look up Foundations of Geopolitics. \n\nIt's the current Russian playbook, it's working, and it has nothing to do with winning a war...",
                          "score": 1,
                          "created_utc": 1734492864.0,
                          "replies": []
                        },
                        {
                          "id": "m2k6qn9",
                          "author": "jb32647",
                          "body": "Because China has less (not zero, less) institutional rot than Russia? Because it’s actually investing in advanced military technology? Because China actually has maritime power projection?",
                          "score": -3,
                          "created_utc": 1734471886.0,
                          "replies": [
                            {
                              "id": "m2kklv7",
                              "author": "Rage_Like_Nic_Cage",
                              "body": "I wasn’t the one bringing up Russia lol. It was a stupid compassion to begin with",
                              "score": 1,
                              "created_utc": 1734476485.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m2nxm62",
                      "author": "Dry_Artichoke_7768",
                      "body": "Least paranoid American",
                      "score": 0,
                      "created_utc": 1734533333.0,
                      "replies": [
                        {
                          "id": "m2nzd28",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 1,
                          "created_utc": 1734533945.0,
                          "replies": [
                            {
                              "id": "m2o0bwk",
                              "author": "Dry_Artichoke_7768",
                              "body": "He’s dumber than I thought",
                              "score": 0,
                              "created_utc": 1734534281.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2j940m",
              "author": "DasReap",
              "body": "I'm curious how you think the drones would be able to transmit any amount of meaningful data without us knowing? It's not like they can just stream video to some satellite somewhere and then straight to China. I fly drones and I assure you, I wish consumer drones were half as advanced as everyone who is scared of them thinks they are. \n\nI use DJI products and I don't have to connect a single thing to any network or GPS to fly my drone, although I know their main drones do require GPS to fly. Anyone who flies drones commercially or as a hobby does not want a ban as it effectively completely kills what we do. There is NO equal replacement.",
              "score": 3,
              "created_utc": 1734461208.0,
              "replies": [
                {
                  "id": "m2jkk2c",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -5,
                  "created_utc": 1734464809.0,
                  "replies": [
                    {
                      "id": "m2k53jp",
                      "author": "DasReap",
                      "body": "Proves that they have what capability, exactly? I'm not sure you're even understanding the article you just linked me lol.",
                      "score": 3,
                      "created_utc": 1734471364.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2hz3nd",
              "author": "101ina45",
              "body": "I don't see why this would matter when they already have satellites.",
              "score": 6,
              "created_utc": 1734446253.0,
              "replies": [
                {
                  "id": "m2i7q32",
                  "author": "Yancy_Farnesworth",
                  "body": "Satellites can't do everything or be everywhere at once. There are plenty of signals that satellites can't detect that a low flying drone could.\n\nOr you can just look at the US military. It arguably has the most extensive satellite coverage in the world with probably the best optics. Yet the military still operates tons of intel gathering drones with cameras. They have advantages.",
                  "score": 3,
                  "created_utc": 1734449270.0,
                  "replies": []
                },
                {
                  "id": "m2hz7np",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 3,
                  "created_utc": 1734446293.0,
                  "replies": [
                    {
                      "id": "m2i4ves",
                      "author": "warpedgeoid",
                      "body": "Yes, this is true. UAVs can get closer and often approach with a better angle than a satellite can. They can also loiter above a target while recording, which is much trickier for satellites. However, a quality comparison between a military satellite image (better than 20cm resolution) and a commercial UAV image might shock you. The former hit the upper limit of resolution allowed by physics long ago.\n\nI do wonder how people think DJI are transmitting their images back to China?",
                      "score": 9,
                      "created_utc": 1734448292.0,
                      "replies": []
                    },
                    {
                      "id": "m2i6797",
                      "author": "Nerezza_Floof_Seeker",
                      "body": "Actual surveillance satellites can view down to ~10-15cm resolution, thats plenty enough for general surveillance. If youre doing something specific and need more detail, such as that which can be provided by a loitering drone, youre going to want your own assets on the ground there and banning chinese drones wouldnt really stop that.",
                      "score": 7,
                      "created_utc": 1734448750.0,
                      "replies": [
                        {
                          "id": "m2kfs10",
                          "author": "fawlty_lawgic",
                          "body": "can they see inside buildings?",
                          "score": 0,
                          "created_utc": 1734474834.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m2i44kp",
                      "author": "Suzzie_sunshine",
                      "body": "I can see what's growing in my garden on google maps. This is just stupid.",
                      "score": 4,
                      "created_utc": 1734448033.0,
                      "replies": [
                        {
                          "id": "m2kft62",
                          "author": "fawlty_lawgic",
                          "body": "what about what's in your house",
                          "score": -1,
                          "created_utc": 1734474845.0,
                          "replies": [
                            {
                              "id": "m2kgco2",
                              "author": "Suzzie_sunshine",
                              "body": "pictures of my grow room are on FB.",
                              "score": 2,
                              "created_utc": 1734475028.0,
                              "replies": [
                                {
                                  "id": "m2kjpfh",
                                  "author": "fawlty_lawgic",
                                  "body": "Your grow room? What about your bedroom, or your bathroom? The point is satellites can’t see inside buildings, and even though YOU may choose to post pictures on social media, you’re still choosing what you post and what you don’t. There’s also lots of people that don’t post their stuff on social media.",
                                  "score": 0,
                                  "created_utc": 1734476175.0,
                                  "replies": [
                                    {
                                      "id": "m2ly0ia",
                                      "author": "Suzzie_sunshine",
                                      "body": "I've ever only flown outside so never thought about it. Still, not much value in that really. What are they gonna do, shoot my toilet?",
                                      "score": 1,
                                      "created_utc": 1734495033.0,
                                      "replies": [
                                        {
                                          "id": "m2m46ca",
                                          "author": "fawlty_lawgic",
                                          "body": "You may only fly outside but I’m guessing you have your drone inside your house right? Is it really a stretch to imagine that they could enable the camera without you realizing it’s on? A lot of people worry about their phones listening to them or potentially being able to record them with the cameras, whether that’s realistic or likely to happen, it certainly seems possible. I think the same possibility exists with drones or any of these devices that have camera’s or microphones. Again, not saying it’s likely or that the average person has things that foreign governments would be interested in spying on, I’m just saying the potential is there. Also keep in mind that it’s not always the company that people worry about, sometimes the concern is that hackers could compromise these devices and then do something like what I’m describing.",
                                          "score": 1,
                                          "created_utc": 1734497791.0,
                                          "replies": [
                                            {
                                              "id": "m2o0fxu",
                                              "author": "Suzzie_sunshine",
                                              "body": "Yes, it's a stretch to imagine they could remotely turn on the camera. It's in a box, with the battery removed. \n\nYou're too paranoid! We all have cameras on our phones for fuck sake, and video security which is pretty easily hackable.",
                                              "score": 1,
                                              "created_utc": 1734534321.0,
                                              "replies": [
                                                {
                                                  "id": "m2o2lle",
                                                  "author": "fawlty_lawgic",
                                                  "body": "Do you think everyone else keeps their drones in a box with the battery removed ALL THE TIME? There’s never a time when it’s out of the box with the battery in, ever?\n\nI may be too paranoid, but you’re too naive to think this could never happen.\n\nI know phones are hackable, I literally said that’s one of the fears. Some people think the company could take advantage of this stuff, others fear what hackers could do if they compromised the system. It doesn’t really matter who is the one doing it, the potential is there and it’s a legitimate concern. At least phones can’t fly around or crash into things on their own, they don’t have mobility. Drones do.",
                                                  "score": 1,
                                                  "created_utc": 1734535059.0,
                                                  "replies": [
                                                    {
                                                      "id": "m2o43w4",
                                                      "author": "Suzzie_sunshine",
                                                      "body": "They're going to hack your router long before your drone. No, this is silly. And good luck flying my drone indoors. There's no fucking way. Even if they manage to turn it on, they can't fly it. \n\nYou know what's a much more realistic threat? Apps on your phone. \n\nAnd what would they do with drone data? Physically attack the US? That's never going to happen. They can cause much more mayhem by hacking the grid, banking systems, traffic lights.... \n\nThis is not about national security. It's about fucking with the Chinese. Tiktok is way more of a security threat honestly, because it has full access to your phone.",
                                                      "score": 1,
                                                      "created_utc": 1734535565.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2kumpk",
              "author": "Most-Opportunity9661",
              "body": "Lol anyone who believes this is about national security and not trade protection, I have a thousand bridges to sell you",
              "score": 1,
              "created_utc": 1734480118.0,
              "replies": []
            },
            {
              "id": "m2i5fuz",
              "author": "RikiWardOG",
              "body": "ok cool, what's your solution? We certainly don't even make the chips for these drones domestically. Also who cares about a lousy GPS? Also you could simply review the firmware and code from the company to determine if there's anything malicious. These blanket bans make zero sense and are knee jerk reactions by people who don't have a basic understanding of technology.",
              "score": -2,
              "created_utc": 1734448489.0,
              "replies": []
            },
            {
              "id": "m2ludhw",
              "author": "Ok_Smell_5379",
              "body": "There’s a legitimate security concern with the NSA building back doors to our devices.",
              "score": 0,
              "created_utc": 1734493552.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m2hua8o",
      "author": "GreatnessToTheMoon",
      "body": "Can we stop punishing China every time they leg up us in certain industry’s? Removing cheaper options makes us all poorer. If domestic companies can’t compete let them fail",
      "score": 105,
      "created_utc": 1734444435.0,
      "replies": [
        {
          "id": "m2hvzus",
          "author": "None",
          "body": "Gotta keep pretending that China can't innovate and only copies the US. How else will people feel superior.",
          "score": 85,
          "created_utc": 1734445095.0,
          "replies": [
            {
              "id": "m2jr6v9",
              "author": "giritrobbins",
              "body": "Adam Bry has said that the first customers for skydio stuff was DJI.",
              "score": 2,
              "created_utc": 1734466924.0,
              "replies": []
            },
            {
              "id": "m2i2x32",
              "author": "nagi603",
              "body": "TBF, it's a combo of US companies bringing all manufacturing to wherever it's cheapest, give out ALL secrets and then act surprised or more accurately, don't care one bit. The Chinese are capable of R&D, do so, but the western companies are giving them a very significant head start too. It does not help that China is also successfully poaching all talent it really wants, because hey, layoffs, job insecurity, etc.",
              "score": 3,
              "created_utc": 1734447610.0,
              "replies": [
                {
                  "id": "m2izwpq",
                  "author": "Rage_Like_Nic_Cage",
                  "body": "I love that “poaching” in this case means things like offering people better paying jobs or better benefits. Maybe western companies should be more competitive instead of always chasing the never ending goal of increasing shareholder value",
                  "score": 48,
                  "created_utc": 1734458318.0,
                  "replies": [
                    {
                      "id": "m2j5nxj",
                      "author": "None",
                      "body": "Yep. Especially ironic if taking an American viewpoint because that's the country that does the most talent poaching of all.",
                      "score": 24,
                      "created_utc": 1734460131.0,
                      "replies": []
                    },
                    {
                      "id": "m2rjz8s",
                      "author": "None",
                      "body": "oatmeal punch selective dog wipe license amusing price saw fuzzy\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                      "score": 2,
                      "created_utc": 1734576727.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m2j1uas",
                  "author": "JesDoit-today",
                  "body": "Remember the unions, \n yea I member, \nMember Nixon opened relations with china \nYea I remember,\nDidn't us companies open factories over there, \nYeah, I member,\nDidn't they make cheap crap that made in the USA look awesome, \nYeah,yeah I remember,\nDidn't the us allow manufacturing to be exported for even the good stuff America made,\n...yeah,I member.",
                  "score": 5,
                  "created_utc": 1734458930.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m2jg1tv",
          "author": "AffectionateBother47",
          "body": "Unfortunately America needs a “big bad guy” to go against to justify financially hurting their citizens",
          "score": 24,
          "created_utc": 1734463389.0,
          "replies": [
            {
              "id": "m2kcaqf",
              "author": "grphelps1",
              "body": "Obviously China isn’t an angel, but I’ve never bought the image of them that our most hawkish politicans are selling. They really want us to believe they are the next Nazi Germany lol",
              "score": 27,
              "created_utc": 1734473677.0,
              "replies": [
                {
                  "id": "m2l10xa",
                  "author": "barkyu",
                  "body": "They kinda are. (Concentration camps of ethnic minorities) (aggression towards neighbors)\nChina is not our ally.",
                  "score": -19,
                  "created_utc": 1734482439.0,
                  "replies": [
                    {
                      "id": "m2llrbo",
                      "author": "EndStorm",
                      "body": "You mean like putting kids in cages?  That kind of thing?",
                      "score": 9,
                      "created_utc": 1734490171.0,
                      "replies": []
                    },
                    {
                      "id": "m2l2c6a",
                      "author": "not_nisesen",
                      "body": "Americans always need a boogeyman to justify their insane military spending",
                      "score": 17,
                      "created_utc": 1734482916.0,
                      "replies": [
                        {
                          "id": "m2l3ifs",
                          "author": "barkyu",
                          "body": "Incursions into the South China Sea by their naval vessels in other counties waters is the Americans? Doing military drills surrounding a different sovereign nation is the Americans? Sending Muslims in the east of the country to concentration camps and using SA as a form of torture is the Americans? The boot licking for an authoritarian regime is insane you are so lucky to live in a country where you can use the internet and you’re praising a regime that censors everything their people see?",
                          "score": -10,
                          "created_utc": 1734483341.0,
                          "replies": [
                            {
                              "id": "m2l8xfd",
                              "author": "not_nisesen",
                              "body": "I’m literally in China right now (Chengdu) and I’m using Reddit. Get your head out of your ass",
                              "score": 11,
                              "created_utc": 1734485355.0,
                              "replies": [
                                {
                                  "id": "m2nyegu",
                                  "author": "Dry_Artichoke_7768",
                                  "body": "Same. What a complete buffoon.",
                                  "score": 2,
                                  "created_utc": 1734533611.0,
                                  "replies": []
                                },
                                {
                                  "id": "m2l97ro",
                                  "author": "barkyu",
                                  "body": "Go to google and look up “1989 Tiananmen Square protests and massacre” see how free you really are bud",
                                  "score": -9,
                                  "created_utc": 1734485462.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m2lj7jp",
                              "author": "unassumingdink",
                              "body": "How many full scale wars have they lied their citizens into in the last 40 years?",
                              "score": 7,
                              "created_utc": 1734489199.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m2lbv37",
                      "author": "donquixote2u",
                      "body": "If you wanna see those a bit closer to home,  wait for the next presidential inauguration.",
                      "score": 7,
                      "created_utc": 1734486434.0,
                      "replies": []
                    },
                    {
                      "id": "m2ucw54",
                      "author": "ilyich_commies",
                      "body": "How dare China build their country right next to all our overseas military bases!!!\n\nAlso many dozens of countries have investigated these so-called concentration camps, and not a single one has found any evidence that they exist. China builds schools for rural ethnic minorities and we call them re-education camps, they build factories and we call them forced labor camps.",
                      "score": 1,
                      "created_utc": 1734625614.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2kgfbx",
              "author": "fawlty_lawgic",
              "body": "Kinda like the republicans need a \"big bad guy\" to go against to justify financially hurting their voters?",
              "score": 1,
              "created_utc": 1734475053.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2kuaci",
          "author": "SupaSneak",
          "body": "Well… then I guess it depends on what makes them cheaper",
          "score": 1,
          "created_utc": 1734479993.0,
          "replies": []
        },
        {
          "id": "m2n0zg6",
          "author": "Whiterabbit--",
          "body": "the current trend is that globalization was a mistake. but globalization is what has enabled the tremendous increase in wealth and standard of living around the world.",
          "score": 1,
          "created_utc": 1734517957.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2i7gud",
      "author": "Zippier92",
      "body": "DJTjr will save the day with his new gig on the board of a Florida drone company. \n\nI never even knew he was an expert in drones. \n\n.. better /s this one for the dense among us.",
      "score": 4,
      "created_utc": 1734449184.0,
      "replies": []
    },
    {
      "id": "m2hngvt",
      "author": "chrisdh79",
      "body": "From the article: When he wants to learn the secrets of a whale, Iain Kerr, CEO of the conservation nonprofit Ocean Alliance, sends out a flying SnotBot. The device—a consumer drone from the Chinese company Da Jiang Innovations (DJI) fitted with Velcro and petri dishes—swoops close to a whale’s blowhole. Then, when the animal ejects a good blast of snot, it scoops up the spray, along with the wealth of biological data within: DNA, hormones, and oodles of microbes. The SnotBot offers a noninvasive and much cheaper way to learn about the endangered giants compared with traditional biopsy missions, Kerr says.\n\nBut increased tensions between the United States and China may put the next generation of SnotBots and other research drones used by U.S. academic scientists at risk. Provisions in the U.S. National Defense Authorization Act (NDAA), released on 7 December and expected to be voted into law, would trigger a 1-year countdown for U.S. agencies to assess the security threat of drone equipment from Chinese companies like DJI. If a product is determined to be a risk, it would be prohibited from operating on U.S. communications infrastructure.\n\nMany scientists are alarmed at the possibility that they might have to give up a tool they say has become vital. “Rarely do you have a situation where someone says you have to stop using something without a replacement,” Kerr says. “It seems like lunacy to me.”\n\nWhen he wants to learn the secrets of a whale, Iain Kerr, CEO of the conservation nonprofit Ocean Alliance, sends out a flying SnotBot. The device—a consumer drone from the Chinese company Da Jiang Innovations (DJI) fitted with Velcro and petri dishes—swoops close to a whale’s blowhole. Then, when the animal ejects a good blast of snot, it scoops up the spray, along with the wealth of biological data within: DNA, hormones, and oodles of microbes. The SnotBot offers a noninvasive and much cheaper way to learn about the endangered giants compared with traditional biopsy missions, Kerr says.\n\nBut increased tensions between the United States and China may put the next generation of SnotBots and other research drones used by U.S. academic scientists at risk. Provisions in the U.S. National Defense Authorization Act (NDAA), released on 7 December and expected to be voted into law, would trigger a 1-year countdown for U.S. agencies to assess the security threat of drone equipment from Chinese companies like DJI. If a product is determined to be a risk, it would be prohibited from operating on U.S. communications infrastructure.\n\nMany scientists are alarmed at the possibility that they might have to give up a tool they say has become vital. “Rarely do you have a situation where someone says you have to stop using something without a replacement,” Kerr says. “It seems like lunacy to me.”",
      "score": 13,
      "created_utc": 1734441694.0,
      "replies": [
        {
          "id": "m2lt5sy",
          "author": "None",
          "body": "[deleted]",
          "score": 4,
          "created_utc": 1734493062.0,
          "replies": [
            {
              "id": "m2m52z4",
              "author": "None",
              "body": "Oh how the world has fallen",
              "score": 2,
              "created_utc": 1734498219.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m2jb4f5",
      "author": "ispshadow",
      "body": "We seemingly can’t manufacture a bunch of different things in the technology space that our country needs. We are utterly bound to an adversary to provide us with those things and they can make the decision how we can use them or if we can use them at all.\n\nWe *should* be treating that as a **fucking national emergency**.",
      "score": 13,
      "created_utc": 1734461832.0,
      "replies": [
        {
          "id": "m2kgn5h",
          "author": "fawlty_lawgic",
          "body": "We can manufacture them. What we can't do is compete on price, because the CCP is subsidizing DJI and their products. If a US company made comparable products and sold them for what it cost to actually produce them, they would be 2-3x as much as DJI's.",
          "score": -2,
          "created_utc": 1734475125.0,
          "replies": [
            {
              "id": "m2l2l0e",
              "author": "not_nisesen",
              "body": "Then maybe the US government needs to get its stick out its ass and start subsidizing its own domestic manufacturing industries too. Except by now it would probably be too little too late",
              "score": 6,
              "created_utc": 1734483005.0,
              "replies": [
                {
                  "id": "m8fopp2",
                  "author": "fawlty_lawgic",
                  "body": "Do you know why we can't do that? Hint: it has to do with the kind of government we have, vs. the kind that China has.",
                  "score": 1,
                  "created_utc": 1737499809.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2l3asc",
              "author": "Nissan-S-Cargo",
              "body": "If they’re so important America should start subsidizing them then.",
              "score": 2,
              "created_utc": 1734483266.0,
              "replies": [
                {
                  "id": "m8foq3e",
                  "author": "fawlty_lawgic",
                  "body": "Do you know why we can't do that? Hint: it has to do with the kind of government we have, vs. the kind that China has.",
                  "score": 1,
                  "created_utc": 1737499812.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m2iopsu",
      "author": "Heavykiller",
      "body": "I’m surprised it’s not already a thing. Company I work for is looking into ways to use drones for wildfire prevention. \n\nProcurement has been messy because we can’t use Chinese-made drones so we’ve been looking for other vendors and surprise, it’s way more expensive than we originally estimated. We’re not even looking at U.S. vendors but vendors from other countries like Australia.",
      "score": 6,
      "created_utc": 1734454769.0,
      "replies": []
    },
    {
      "id": "m2mlt1f",
      "author": "mr_herz",
      "body": "That’s how you create local jobs though.",
      "score": 3,
      "created_utc": 1734507653.0,
      "replies": []
    },
    {
      "id": "m2ihnq9",
      "author": "PremierBromanov",
      "body": "the sinophobia in the west is crazy",
      "score": 38,
      "created_utc": 1734452521.0,
      "replies": [
        {
          "id": "m2irg6b",
          "author": "SituationalCloud",
          "body": "Reddit is essentially the propaganda wing of the US state department. Consent being manufactured right here, right now.",
          "score": 22,
          "created_utc": 1734455642.0,
          "replies": []
        },
        {
          "id": "m2im3xf",
          "author": "blastradii",
          "body": "Remember the Chinese Exclusion Act?",
          "score": 13,
          "created_utc": 1734453940.0,
          "replies": []
        },
        {
          "id": "m2jlaka",
          "author": "Eldestruct0",
          "body": "An authoritarian government that is hostile to the west and likes to claim independent nations and international territory as its own? Can't imagine why western nations wouldn't want to be reliant on such an entity.",
          "score": -10,
          "created_utc": 1734465038.0,
          "replies": [
            {
              "id": "m2ke4pk",
              "author": "PremierBromanov",
              "body": "> claim independent nations and international territory as its own? \n\nthe west would NEVER",
              "score": 20,
              "created_utc": 1734474286.0,
              "replies": []
            },
            {
              "id": "m2nyv8d",
              "author": "Dry_Artichoke_7768",
              "body": "The west is shocked Pikachu when another world power decides to utilize their might lol",
              "score": 0,
              "created_utc": 1734533774.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2j7xol",
          "author": "Bob-Sacamano_",
          "body": "Do you call every instance of defense a phobia? You should educate yourself on China’s very public long term goals of disrupting the US as a world power.\n\nhttps://www.brookings.edu/articles/the-long-game-chinas-grand-strategy-to-displace-american-order/",
          "score": -14,
          "created_utc": 1734460844.0,
          "replies": [
            {
              "id": "m2j9q1j",
              "author": "PremierBromanov",
              "body": "surely the brookings institute will tell us how objectively correct the west is",
              "score": 13,
              "created_utc": 1734461398.0,
              "replies": [
                {
                  "id": "m2jlca6",
                  "author": "Bob-Sacamano_",
                  "body": "This has nothing to do with the west being right or wrong and everything to do with China’s global strategy. Plenty of non-partisan and international members acknowledge China’s long term strategy of establishing itself as the global leader. You think that is obtained via noble measures?",
                  "score": -11,
                  "created_utc": 1734465053.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m2j9z5q",
          "author": "None",
          "body": "China is literally hacking our telecoms infrastructure as we speak. ",
          "score": -12,
          "created_utc": 1734461476.0,
          "replies": [
            {
              "id": "m2l33xy",
              "author": "not_nisesen",
              "body": "You telling me the US can’t defend itself against hackers? Even with its insane military spending? Maybe it should start looking inwards first",
              "score": 5,
              "created_utc": 1734483196.0,
              "replies": [
                {
                  "id": "m2l5bmc",
                  "author": "None",
                  "body": "Nobody can really defend against hackers. ",
                  "score": -4,
                  "created_utc": 1734484006.0,
                  "replies": [
                    {
                      "id": "m2l97qb",
                      "author": "not_nisesen",
                      "body": "If that is true (which it isn’t), what was the point of your comment? China hacking the US is just a normal part of modern day state sponsored espionage. The US is also doing the same thing to China (in addition to its own allies)",
                      "score": 4,
                      "created_utc": 1734485462.0,
                      "replies": [
                        {
                          "id": "m2mchsg",
                          "author": "RedFranc3",
                          "body": "No，even its own allies",
                          "score": 0,
                          "created_utc": 1734502068.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2jam7s",
              "author": "PremierBromanov",
              "body": "god damn, they're in the mainframe",
              "score": 5,
              "created_utc": 1734461676.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m2ib0bc",
      "author": "Einheri42",
      "body": "I guess the US will just have to start making good shit then.",
      "score": 10,
      "created_utc": 1734450368.0,
      "replies": [
        {
          "id": "m2it3ws",
          "author": "opeth10657",
          "body": "Why make good shit when you can just get the government to ban competition?",
          "score": 28,
          "created_utc": 1734456171.0,
          "replies": [
            {
              "id": "m2j0cku",
              "author": "Rage_Like_Nic_Cage",
              "body": "The invisible hand of the free market strikes again!",
              "score": 8,
              "created_utc": 1734458455.0,
              "replies": [
                {
                  "id": "m2khijy",
                  "author": "fawlty_lawgic",
                  "body": "The NOT free market of China and the CCP is literally what has benefited DJI so much and made them the market leader.\n\nYou guys are literally comparing a product produced in a market that ISN'T free (but it IS subsidized) and then complaining that one made in the free market can't compete... \n\nIt's fucking hilarious.",
                  "score": -9,
                  "created_utc": 1734475422.0,
                  "replies": [
                    {
                      "id": "m2kkgy7",
                      "author": "Rage_Like_Nic_Cage",
                      "body": "The US is a neither a free market nor unsubsidized either.  It’s cute you think it is though!",
                      "score": 6,
                      "created_utc": 1734476439.0,
                      "replies": [
                        {
                          "id": "m2kksqg",
                          "author": "fawlty_lawgic",
                          "body": "Well, sure, if you want to quibble about that, but it’s definitely more free than china’s is, and you’re really dodging the broader point here. It seems like you’re criticizing the US market for not being more free, because it can’t make a product as good as the one made in a NOT free market. Do you not comprehend the irony or contradiction?\n\nHow about this - would you prefer a market like china’s has, if it meant we made products as good as DJI? Would you take that trade-off?",
                          "score": -2,
                          "created_utc": 1734476553.0,
                          "replies": [
                            {
                              "id": "m2kog1y",
                              "author": "Rage_Like_Nic_Cage",
                              "body": "Why is is an “unfair advantage” for China to subsidize drone production? If the U.S. cares so much, why don’t they subsidize their own drone production, rather than blocking competition?",
                              "score": 10,
                              "created_utc": 1734477852.0,
                              "replies": [
                                {
                                  "id": "m2l2qjo",
                                  "author": "not_nisesen",
                                  "body": "Bc China bad /s",
                                  "score": 7,
                                  "created_utc": 1734483061.0,
                                  "replies": []
                                },
                                {
                                  "id": "mbdz3fp",
                                  "author": "fawlty_lawgic",
                                  "body": "sorry for the late response here.\n\nFirst of all, who said the US does care so much - not sure where that came from. Second, they don't subsidize it for a few reasons, one is because Americans (especially one political party) is ideologically opposed to government subsidies, and the other side really is ideologically opposed to subsidies for companies, especially anything having to do with military. Getting both sides to agree on something like this is f'ing impossible. If the Dem's came out supporting subsidies for drone manufacturers, republicans would oppose it instinctively because Dem's want it, and the GOP just kneejerk opposes anything the Dem's want, whether they would normally agree w/ it or not. If the GOP supported it, Dem's MIGHT support it, but now with the current administration there would be a lot of concerns about conflicts of interest and double dipping and blah blah blah. Basically the short answer is, politics. CCP doesn't have that problem because they aren't a democracy.",
                                  "score": 1,
                                  "created_utc": 1738885793.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2jukpa",
              "author": "Einheri42",
              "body": "Sometimes you need a bit help, especially when the enemy government funds their stuff so they can force you out of the business.",
              "score": 0,
              "created_utc": 1734468015.0,
              "replies": []
            },
            {
              "id": "m2kh1ek",
              "author": "fawlty_lawgic",
              "body": "How hilarious that you say this when we are talking about DJI. Why do you think they are so good and so competitive in the first place? Is that just the \"free market\" at work? Or do they have some help from their government?",
              "score": 0,
              "created_utc": 1734475259.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2lic3p",
          "author": "Lorpius_Prime",
          "body": "Import bans and restrictions tend to make domestic alternatives even shittier, since they take away competitive pressures to improve.",
          "score": 1,
          "created_utc": 1734488863.0,
          "replies": [
            {
              "id": "m2mofza",
              "author": "Einheri42",
              "body": "So, the US should just respond with economic warfare and also find the industry so they can continue to compete while in the red? ",
              "score": 2,
              "created_utc": 1734509371.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m2hom7r",
      "author": "iambiggzy",
      "body": "Skydio stock rises",
      "score": 8,
      "created_utc": 1734442177.0,
      "replies": [
        {
          "id": "m2hr7yi",
          "author": "diacewrb",
          "body": "Unlike their drones, there are so many complaints about them online.\n\nThey even left the consumer market.",
          "score": 38,
          "created_utc": 1734443233.0,
          "replies": []
        },
        {
          "id": "m2hsnkt",
          "author": "Dr_Salacious_B_Crumb",
          "body": "The Skydio XD2s I fielded in the US military sucked, for what it’s worth. \n\nThe DJI Mavic 2Es from 2019 we had left over before the stop on DoD purchase of them easily outperformed them, minus the quality of the thermal and vis camera on the Skydios. But a camera is good for shit if you can reliably fly the drone.",
          "score": 27,
          "created_utc": 1734443794.0,
          "replies": [
            {
              "id": "m2i3c30",
              "author": "nagi603",
              "body": "IIRC the thermal vision being bad is because the US was extremely protective of thermal vision systems and China had to do catching-up. Now we have had $100-150 usably-for-mobile low-res USB-C thermal vision cameras from ali for a few years, and they aren't getting worse.",
              "score": 3,
              "created_utc": 1734447755.0,
              "replies": [
                {
                  "id": "m2i4q6x",
                  "author": "Dr_Salacious_B_Crumb",
                  "body": "The thermal was good, 640 vs 160 for the 2E was massive for us. Flying that thing at night was aided greatly by the new thermal. \n\nBut having a near nonfunctional drone with the Skydio meant the thermal resolution didn’t matter for shut. The trainers that came to my unit were flabbergasted we meant to fly the drone at night. It’s like it hadn’t occurred to them. Getting the drone turned on and ready for night flight was about a 5 minute process each boot up, and that’s if the initialization with the sensors actually worked and didn’t warrant a restart of the system and redoing the whole process.",
                  "score": 6,
                  "created_utc": 1734448242.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m2hu52u",
          "author": "STR4NGE",
          "body": "Skydio doesn’t have stock.  However, UMAC (rotor riot) does. Guess who became a member of their board? DJT jr.  I rode that stock to a ten bagger and laughed and proceeded to buy 5 dji air units.  Stock up now fellas. If they’re banning Tik-Tok, DJI is next. My portfolio is banking on it.",
          "score": 7,
          "created_utc": 1734444379.0,
          "replies": [
            {
              "id": "m2kgvc9",
              "author": "fawlty_lawgic",
              "body": "Yes good for you. There's tons of ways to make money off the stupidity of Americans, you just have to keep throwing away all hope of them doing something rational and logical.",
              "score": 1,
              "created_utc": 1734475202.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2hsss8",
          "author": "LSDemon",
          "body": "Skydio isn't publicly traded.",
          "score": 3,
          "created_utc": 1734443852.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2jao12",
      "author": "Phresh-Jive",
      "body": "Just go buy a NJ convenience store drone?\nSize of SUVs, fly as high as planes, fast as F15’s.\nEasily accessible to hobbyists!",
      "score": 2,
      "created_utc": 1734461692.0,
      "replies": []
    },
    {
      "id": "m2iwesd",
      "author": "None",
      "body": "Is it a real thing that China could potentially collect data, visuals or potentially take control over the drones by the way they are built or programmed?\n\nJust curious?",
      "score": 4,
      "created_utc": 1734457224.0,
      "replies": [
        {
          "id": "m2j0qoq",
          "author": "Rage_Like_Nic_Cage",
          "body": "Probably not. Just from a logistical point it would be very impractical. Especially since it wouldn’t be nearly as efficient as what the NSA can do to spy on our own civillains.",
          "score": 4,
          "created_utc": 1734458579.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2kavp5",
      "author": "Nyx_Antumbra",
      "body": "We can't compete with a country that invests in itself and its people so we have to ban the things they produce.",
      "score": 4,
      "created_utc": 1734473209.0,
      "replies": []
    },
    {
      "id": "m2kkniz",
      "author": "misterguydude",
      "body": "How about we stop fighting and just work together??",
      "score": 2,
      "created_utc": 1734476501.0,
      "replies": []
    },
    {
      "id": "m2lpj11",
      "author": "DamCrawBugs420",
      "body": "What happened to capitalism",
      "score": 2,
      "created_utc": 1734491624.0,
      "replies": [
        {
          "id": "m7cat41",
          "author": "TheRealClovis",
          "body": "That's only for when US is winning.",
          "score": 1,
          "created_utc": 1736976188.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2i6h4y",
      "author": "Dale-Wensley",
      "body": "Maybe andruil will make some consumer hardware",
      "score": 1,
      "created_utc": 1734448844.0,
      "replies": []
    },
    {
      "id": "m2iykrf",
      "author": "Tacotuesday8",
      "body": "I get the intent here but are we confidant US companies can keep pace with a Chinese made company? If DJI for example was in the US, it would be one thing but do we have an amazing US drone company that will push the envelope?",
      "score": 1,
      "created_utc": 1734457904.0,
      "replies": []
    },
    {
      "id": "m2jbexf",
      "author": "ksixnine",
      "body": "Mmm, if only the government would subsidize the US drone industry to fix this problem..",
      "score": 1,
      "created_utc": 1734461924.0,
      "replies": []
    },
    {
      "id": "m2ju70k",
      "author": "None",
      "body": "You can reflash them, but that means you need those nerds on staff.  The challenge is data (knowledge) is power, and China giving us free shit at the price of cheap shit is giving China the economic upper hand, with like every silver platter and naked hotties feeding you, upper hand.   This is strategic.",
      "score": 1,
      "created_utc": 1734467894.0,
      "replies": []
    },
    {
      "id": "m2juljg",
      "author": "Jimmybuffett4life",
      "body": "Oh well",
      "score": 1,
      "created_utc": 1734468022.0,
      "replies": []
    },
    {
      "id": "m2k0hc6",
      "author": "kakureru",
      "body": "I recently learned there are chinese drone companies that have a separate firmware for government / industrial abroad clints. I did not know this until I was talking to a surveying department of said corporation. Same drone 4x+ the price.",
      "score": 1,
      "created_utc": 1734469891.0,
      "replies": []
    },
    {
      "id": "m2ka5b3",
      "author": "Drroringtons",
      "body": "With all the “alien” drones in the sky, pulling mad vectors and insane speeds with absurd battery times. I think the US will be fine. 😂",
      "score": 1,
      "created_utc": 1734472969.0,
      "replies": []
    },
    {
      "id": "m2l1mdt",
      "author": "yannynotlaurel",
      "body": "Just steal their tech then and stop whining. You’re not in Europe where even breathing is regulated by law in Brussels.",
      "score": 1,
      "created_utc": 1734482655.0,
      "replies": []
    },
    {
      "id": "m2l4byw",
      "author": "Western_Upstairs_101",
      "body": "Can’t they force people to register legal drones and put a chip on the drones that emit a signal they can use to verify the owner. Then enact some serious penalties for law breakers. Also need a special policing unit to go after illegal drones, and capable equipment to affect this result.",
      "score": 1,
      "created_utc": 1734483639.0,
      "replies": []
    },
    {
      "id": "m2lcb3r",
      "author": "Alienhaslanded",
      "body": "But they make the best ones",
      "score": 1,
      "created_utc": 1734486600.0,
      "replies": []
    },
    {
      "id": "m2lny3f",
      "author": "nunnapo",
      "body": "Bro, we are about to bring back polio.  Your drone is going to be a kite soon.",
      "score": 1,
      "created_utc": 1734491012.0,
      "replies": []
    },
    {
      "id": "m2lqcco",
      "author": "Rooboy66",
      "body": "Not the **whales**???!!!",
      "score": 1,
      "created_utc": 1734491941.0,
      "replies": []
    },
    {
      "id": "m2lqgh9",
      "author": "zestzebra",
      "body": "Scientists, keep and maintain the drones you now have.",
      "score": 1,
      "created_utc": 1734491986.0,
      "replies": []
    },
    {
      "id": "m2lr6p9",
      "author": "None",
      "body": "Sounds like a job for Mexican cartels.  The decades-long war on drugs has been so successful, how could this possibly fail?",
      "score": 1,
      "created_utc": 1734492277.0,
      "replies": []
    },
    {
      "id": "m2lrssz",
      "author": "None",
      "body": "What about Archer, saw that they got a 2 billion dollar contract from the military.",
      "score": 1,
      "created_utc": 1734492519.0,
      "replies": []
    },
    {
      "id": "m2m6nkb",
      "author": "Thisguysaphony_phony",
      "body": "But it will stop the Chinese.",
      "score": 1,
      "created_utc": 1734498985.0,
      "replies": []
    },
    {
      "id": "m2mqlur",
      "author": "Important-Wasabi-166",
      "body": "No! My affordable 200mph FPV drones! Y’all the same dumb mfs that bought all the TP during covid. Educate yourself and cut the media out. If the drone was gonna strike all you would hear is whiz and game over fam. They are looking for someone and they will find them before they go away.",
      "score": 1,
      "created_utc": 1734510829.0,
      "replies": []
    },
    {
      "id": "m2ny4x1",
      "author": "jimmyjamws1108",
      "body": "Sorry whales . They are spying on us . Might as well come to terms with the fact we are going to fall back a little bit until more reliable supply chains and friendly manufacturers come to market.",
      "score": 1,
      "created_utc": 1734533518.0,
      "replies": []
    },
    {
      "id": "m2ogjzw",
      "author": "p1gnone",
      "body": "yuh, but then murican businessmen can gouge us , and 'create' wealth for themselves..",
      "score": 1,
      "created_utc": 1734539625.0,
      "replies": []
    },
    {
      "id": "m2qjxrv",
      "author": "Tyrol_Aspenleaf",
      "body": "I mean we could just build better cheaper drones ourselves, which banning Chinese drones would encourage. I think that’s the point, encourage our own industry and lower security risk at the same time.",
      "score": 1,
      "created_utc": 1734563441.0,
      "replies": []
    },
    {
      "id": "m2rkrk8",
      "author": "LonelySquad",
      "body": "Oh no.",
      "score": 1,
      "created_utc": 1734577032.0,
      "replies": []
    },
    {
      "id": "m2vu8f0",
      "author": "Nemo_Shadows",
      "body": "Fraudulent propaganda.\n\nN. S",
      "score": 1,
      "created_utc": 1734643319.0,
      "replies": []
    },
    {
      "id": "m33qe16",
      "author": "monologue_adventure",
      "body": "It’s gonna be foolish….",
      "score": 1,
      "created_utc": 1734764006.0,
      "replies": []
    },
    {
      "id": "m2holpu",
      "author": "Y34rZer0",
      "body": "Yeah, boycotting anything remotely intelligent from China isn’t a bad idea",
      "score": -12,
      "created_utc": 1734442171.0,
      "replies": [
        {
          "id": "m2hqgag",
          "author": "mmmjeep",
          "body": "Jack Ma would be very upset that people aren’t boycotting him.",
          "score": 7,
          "created_utc": 1734442929.0,
          "replies": [
            {
              "id": "m2hso4s",
              "author": "Britz10",
              "body": "Why would he be upset if he were making money?",
              "score": 2,
              "created_utc": 1734443800.0,
              "replies": [
                {
                  "id": "m2hst1w",
                  "author": "mmmjeep",
                  "body": "I’m calling him not remotely intelligent. Rip my joke.",
                  "score": 2,
                  "created_utc": 1734443855.0,
                  "replies": [
                    {
                      "id": "m2hsxkv",
                      "author": "Britz10",
                      "body": "Oh I missed it I guess",
                      "score": 1,
                      "created_utc": 1734443905.0,
                      "replies": [
                        {
                          "id": "m2ht2vy",
                          "author": "mmmjeep",
                          "body": "Thanks for tuning in.",
                          "score": 3,
                          "created_utc": 1734443963.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m2hrlht",
          "author": "TheOnlyNemesis",
          "body": "There's a good chance most devices you use have chips from China in them.",
          "score": 6,
          "created_utc": 1734443381.0,
          "replies": []
        },
        {
          "id": "m2hp07z",
          "author": "Irapotato",
          "body": "What device are you posting from, friend?",
          "score": 11,
          "created_utc": 1734442339.0,
          "replies": [
            {
              "id": "m2hr5rc",
              "author": "Sylvurphlame",
              "body": "And how do we define “from China?”",
              "score": 9,
              "created_utc": 1734443209.0,
              "replies": []
            },
            {
              "id": "m2hphki",
              "author": "masteeJohnChief117",
              "body": "Better not be a huawei!!!",
              "score": 5,
              "created_utc": 1734442539.0,
              "replies": []
            },
            {
              "id": "m2hrrox",
              "author": "Y34rZer0",
              "body": "A pine phone",
              "score": -4,
              "created_utc": 1734443447.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2htpqe",
          "author": "bessie1945",
          "body": "It’s a horrible idea. It won’t be long until their technology is superior and they refuse to share with us. This is a Cold War we should avoid.",
          "score": 6,
          "created_utc": 1734444212.0,
          "replies": [
            {
              "id": "m2hty3a",
              "author": "Y34rZer0",
              "body": "I don’t think it’s at all likely China would pass up on any opportunities to be in position to steal more IP. everything they are doing indicates it",
              "score": -13,
              "created_utc": 1734444303.0,
              "replies": [
                {
                  "id": "m2hz25n",
                  "author": "VietOne",
                  "body": "No different these days than the US and other countries exploiting China for it's cheap labor and lacking regulations.\n\n\nIt's not stealing when it's freely given to them. Can't complain that a country with lacking regulations has lacking regulations when it no longer benefits you as much.",
                  "score": 8,
                  "created_utc": 1734446238.0,
                  "replies": [
                    {
                      "id": "m2i0hjc",
                      "author": "Y34rZer0",
                      "body": "Maybe, but the level of hacking and theft of IP they manage is HUUUGE",
                      "score": -7,
                      "created_utc": 1734446750.0,
                      "replies": [
                        {
                          "id": "m2i0wn3",
                          "author": "VietOne",
                          "body": "How's that any different than the US? History has shown some of the largest technological improvements were from the US taking scientists from other countries and bringing them to the US.",
                          "score": 8,
                          "created_utc": 1734446899.0,
                          "replies": [
                            {
                              "id": "m2i1mgi",
                              "author": "Y34rZer0",
                              "body": "Because they tried to steal from my place of work. We found a virus in the LISP routines in Autocad that was exporting blueprints to a university in China, no kidding.     \nApparently it was because we had done contracting construction work for the Australia  RAAF",
                              "score": -3,
                              "created_utc": 1734447153.0,
                              "replies": [
                                {
                                  "id": "m2iir5d",
                                  "author": "VietOne",
                                  "body": "And the US has been known to hack and steal information from other countries as well. The CIA is well known to infiltrate and spy on enemies and allies and steal information for decades.\n\n\nIt's almost as of everyone is doing it!",
                                  "score": 6,
                                  "created_utc": 1734452869.0,
                                  "replies": [
                                    {
                                      "id": "m2iw9ff",
                                      "author": "None",
                                      "body": "[removed]",
                                      "score": -3,
                                      "created_utc": 1734457176.0,
                                      "replies": [
                                        {
                                          "id": "m2j4pax",
                                          "author": "VietOne",
                                          "body": "Sure, but fuck all the countries that wanted to exploit them too. They wanted to be able to exploit but not be exploited themselves and they accepted that risk.",
                                          "score": 4,
                                          "created_utc": 1734459828.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m2hsdvu",
      "author": "AlexHimself",
      "body": "The Chinese government subsidizes their drone industry so that they will be in the lead. If our government did the same, we would have just as capable drones.",
      "score": -5,
      "created_utc": 1734443689.0,
      "replies": [
        {
          "id": "m2hzqrd",
          "author": "VietOne",
          "body": "The US government subsidizes almost every company and product used by military and government agencies and their products aren't always at the same level. Not only does the US government end up paying 10-20x the price, it's not any better either.",
          "score": 25,
          "created_utc": 1734446486.0,
          "replies": [
            {
              "id": "m2ifuhs",
              "author": "AlexHimself",
              "body": "Terrible analogy. Do anything other than weapons.",
              "score": -13,
              "created_utc": 1734451935.0,
              "replies": [
                {
                  "id": "m2iievq",
                  "author": "VietOne",
                  "body": "All government agencies subsidize the development of products used by them, not just military.",
                  "score": 5,
                  "created_utc": 1734452762.0,
                  "replies": [
                    {
                      "id": "m2iiwip",
                      "author": "AlexHimself",
                      "body": "No, they don't. Do you see any office supply subsidies?\n\nThe Chinese government directly subsidizes all sorts of things to corner markets. They did it with certain minerals too. They do it with electricity and things. Our government does not do the same thing China does.",
                      "score": -5,
                      "created_utc": 1734452917.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2khc6a",
              "author": "fawlty_lawgic",
              "body": "Yes well, the US doesn't OWN all US companies the way the CCP does. Not really apples to apples.",
              "score": -8,
              "created_utc": 1734475361.0,
              "replies": [
                {
                  "id": "m2kq4dw",
                  "author": "homanagent",
                  "body": "> Yes well, the US doesn't OWN all US companies the way the CCP does\n\nHow are you this dumb? What propaganda were you fed that makes you genuinely believe the Chinese government OWNS ALL COMPANIES IN CHINA?\n\nThat anti-China propaganda they're feeding you day in day out is making you kookoo, as soon as I saw see phrases like CCP instead of China/gov I knew you were screwed.",
                  "score": 13,
                  "created_utc": 1734478468.0,
                  "replies": [
                    {
                      "id": "m2kqs52",
                      "author": "fawlty_lawgic",
                      "body": "You knews it? Lol\n\nLook, I don’t know how many truly private companies there are in China, because I feel like they can’t really be trusted to give accurate figures on that, just like they can’t really be trusted to give accurate info about their government, because it’s not a free society. Could there be some privately owned companies? Sure. Does it really matter though? Meaning could they ever stop the CCP from taking them over if they decide they wanted to be involved? Thats why to me it’s kind of a moot point. But yeah I’m the dumb one here. At least I’m not projecting like you are.",
                      "score": -5,
                      "created_utc": 1734478713.0,
                      "replies": [
                        {
                          "id": "m2ksq5c",
                          "author": "homanagent",
                          "body": "> Look, I don’t know how many truly private companies there are in China\n\nGood, progress: you finally admitted you don't know.\n\nNow I'll give you a hint: the current China is more capitalist than the US.",
                          "score": 8,
                          "created_utc": 1734479422.0,
                          "replies": [
                            {
                              "id": "m2kstuh",
                              "author": "fawlty_lawgic",
                              "body": "Source: CCP propaganda channel on TikTok\n\n🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣",
                              "score": -7,
                              "created_utc": 1734479460.0,
                              "replies": [
                                {
                                  "id": "m2l2pdn",
                                  "author": "2Legit2quitHK",
                                  "body": "I have a strong feeling you never been to China and don’t know sht about China. And I am guessing you are a Fox News viewer and Trump voter",
                                  "score": 7,
                                  "created_utc": 1734483049.0,
                                  "replies": [
                                    {
                                      "id": "m2l4ipw",
                                      "author": "fawlty_lawgic",
                                      "body": "Completely wrong on all accounts. Been to both Beijing and Shanghai, although it was a few years ago. And I strongly hate Trump. Most of my current knowledge on China has come from the PBS show Frontline and their supplemental interviews that they post online. If you think that is a bad source of info, I’d hate to see what you consider a good source, but I’m pretty sure I know more about China than most. \n\nI actually love DJI and their products and I don’t really want them to get banned, but I can’t deny that China is not an ally, and this company represents a big security risk. I can see a lot of reasons for why we wouldn’t want them being in control of these assets, although I think TikTok should be banned regardless of WHO owns it. It’s just a net negative for society, but it’s even worse cause China owns it. \n\nAnyway yeah you’re wrong. You can be liberal/ leftist and still paranoid of China.",
                                      "score": -1,
                                      "created_utc": 1734483707.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "m2l39xn",
                                  "author": "not_nisesen",
                                  "body": "🙄🙄",
                                  "score": 2,
                                  "created_utc": 1734483257.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m2ne2nw",
      "author": "Pingon25",
      "body": "ANYTHING “made in China” (especially tech) should be banned from entering any US territory.",
      "score": 1,
      "created_utc": 1734525393.0,
      "replies": []
    },
    {
      "id": "m2irpsi",
      "author": "Goodgoditsgrowing",
      "body": "Unless it impedes searching for oil and mineral deposits to mine, that’s going to fall on deaf ears in about a month",
      "score": 1,
      "created_utc": 1734455729.0,
      "replies": []
    },
    {
      "id": "m2j1sdx",
      "author": "HabANahDa",
      "body": "Oh. But we owned China!!…. 🙄",
      "score": 1,
      "created_utc": 1734458913.0,
      "replies": []
    },
    {
      "id": "m2j54c0",
      "author": "CrudelyAnimated",
      "body": "If switching to costlier American-made [fill in the blank] because cheaper Chinese-made [fill in the blank] is so bad and dismaying and such a hindrance to progess and the economy, maybe America shouldn't have just voted to put tariffs on everything we import. This is exactly what tariffs do. We've been buying cheap instead of developing our own. Time to grow our own industry.",
      "score": 1,
      "created_utc": 1734459959.0,
      "replies": []
    },
    {
      "id": "m2k0c1c",
      "author": "kristinalyn2001",
      "body": "Florida already did this to our detriment:https://www.local10.com/news/local/2023/04/05/floridas-ban-of-chinese-drones-leaves-local-fire-police-scrambling-to-rebuild-fleets/",
      "score": 1,
      "created_utc": 1734469843.0,
      "replies": []
    },
    {
      "id": "m2k8iak",
      "author": "GagOnMacaque",
      "body": "I'm pretty sure there's going to be a lot of affordable, well-made Ukrainian drones in the future.",
      "score": 1,
      "created_utc": 1734472446.0,
      "replies": [
        {
          "id": "m2l3uu5",
          "author": "2Legit2quitHK",
          "body": "How? If Ukraine wins why would they dispose of the drone fleet that helped to beat Russia and will be useful to deter another conflict? If Russia wins, why would it sell drones that it cannot procure easily due to sanctions.",
          "score": 1,
          "created_utc": 1734483465.0,
          "replies": [
            {
              "id": "m2l6zaj",
              "author": "GagOnMacaque",
              "body": "Ukraine has a bunch of technicians who have a lot of hours constructing drones for various purposes.  Their expertise will be used in private, commercial and military sectors.",
              "score": 1,
              "created_utc": 1734484628.0,
              "replies": [
                {
                  "id": "m557sow",
                  "author": "2Legit2quitHK",
                  "body": "They modify the drones. Drones not manufactured from scratch in Ukraine",
                  "score": 1,
                  "created_utc": 1735885817.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m2kgdid",
      "author": "olympic-dolphin",
      "body": "How is it the same country that made re-usable rockets can’t make high grade affordable commercial/consumer drones?",
      "score": 1,
      "created_utc": 1734475036.0,
      "replies": [
        {
          "id": "m2kpvwe",
          "author": "hindusoul",
          "body": "We got used to cheap",
          "score": 1,
          "created_utc": 1734478380.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2kv7hs",
      "author": "mmck386",
      "body": "Oh well. America first! /s",
      "score": 1,
      "created_utc": 1734480330.0,
      "replies": []
    },
    {
      "id": "m2kupaj",
      "author": "DeceiverX",
      "body": "I mean, DJI specifically is suspicious as fuck admittedly.\n\nAmazing technology and miles ahead of anything we produce, but their software packages are extremely sketchy.\n\nTheir app got taken down from Google Play and the Apple store for security problems, and they require firmware downloads and installation of their non-drone/offline action cameras through your phone through their sideload app store.  You literally can't even turn the devices on until you download their app.\n\nI had to use a secure VM to work around massive glaring security problems for ces by the manufacturer just to power on my $400 camera, and I actively recommend against them now for this reason. That much isn't fucking okay by anyone.",
      "score": -1,
      "created_utc": 1734480144.0,
      "replies": []
    },
    {
      "id": "m2i3y6a",
      "author": "None",
      "body": "[deleted]",
      "score": -4,
      "created_utc": 1734447971.0,
      "replies": [
        {
          "id": "m2i8m8v",
          "author": "The_Parsee_Man",
          "body": "I'm in favor of banning smart TVs on general principle. I just want a dumb monitor with speakers. Everything smart my television does just makes it worse.",
          "score": 1,
          "created_utc": 1734449575.0,
          "replies": []
        },
        {
          "id": "m2ibev7",
          "author": "dora3mon",
          "body": "Do you own a mirror?",
          "score": 1,
          "created_utc": 1734450502.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2igczz",
      "author": "PloddingAboot",
      "body": "Does Tesla make drones?",
      "score": 0,
      "created_utc": 1734452101.0,
      "replies": []
    },
    {
      "id": "m2jylnz",
      "author": "InTheWallCityHall",
      "body": "How can the US “ the greatest” country in the world , not make a drone ?",
      "score": 0,
      "created_utc": 1734469287.0,
      "replies": []
    },
    {
      "id": "m2ie95t",
      "author": "jpStormcrow",
      "body": "Ban them. I've had to pull out tons of equipment from bans. Why stop now.",
      "score": 0,
      "created_utc": 1734451420.0,
      "replies": []
    },
    {
      "id": "m2k6dz5",
      "author": "milelongpipe",
      "body": "Well, then pick the best local made one and let the competition begin.",
      "score": 0,
      "created_utc": 1734471774.0,
      "replies": []
    },
    {
      "id": "m2m50wy",
      "author": "None",
      "body": "Ok, but you understand the reasoning right?  Right??",
      "score": 0,
      "created_utc": 1734498191.0,
      "replies": []
    },
    {
      "id": "m2mx4ch",
      "author": "heosb738",
      "body": "When you look at the consequences associated with china backdooring your whale snot drone and capturing all the national secrets contained within said snot, I’d say a blanket ban on any and all use cases is a really pragmatic information security strategy, particularly given that the research isn’t really critical to that field in the first place. /s",
      "score": 0,
      "created_utc": 1734515356.0,
      "replies": []
    },
    {
      "id": "m2ncpc0",
      "author": "AdministrativeAct902",
      "body": "Or, just hear me out here, don’t ban the Chinese made drones and start making comparable US made drones? \n\nThis “ban a foreign product” stuff is such a cop out to actually improving manufacturing and engineering standards.",
      "score": 0,
      "created_utc": 1734524727.0,
      "replies": []
    },
    {
      "id": "m2j7oek",
      "author": "Miserable-Result6702",
      "body": "Everything from China should be banned.",
      "score": -4,
      "created_utc": 1734460763.0,
      "replies": [
        {
          "id": "m2l35hn",
          "author": "2Legit2quitHK",
          "body": "lol like you have any real say in this",
          "score": 1,
          "created_utc": 1734483213.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2htcjw",
      "author": "Slytherin23",
      "body": "Ukrainian drones will be cheap if the war ends.",
      "score": -3,
      "created_utc": 1734444069.0,
      "replies": [
        {
          "id": "m2jd2cu",
          "author": "Bacon4Lyf",
          "body": "They’re all Chinese DJI drones",
          "score": 5,
          "created_utc": 1734462445.0,
          "replies": [
            {
              "id": "m2jl78c",
              "author": "Slytherin23",
              "body": "You're saying China is supplying both sides?",
              "score": 0,
              "created_utc": 1734465010.0,
              "replies": [
                {
                  "id": "m2l3bfr",
                  "author": "2Legit2quitHK",
                  "body": "It’s a consumer product. Buy it online.",
                  "score": 1,
                  "created_utc": 1734483272.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m2hq1r3",
      "author": "Pikeman212a6c",
      "body": "The market will adjust to the high demand and lack of supply. It will be a short term disruption to whatever extent it is actually enforced.",
      "score": -13,
      "created_utc": 1734442767.0,
      "replies": [
        {
          "id": "m2hsv6j",
          "author": "ITividar",
          "body": "Good thing that won't take years or anything...",
          "score": 9,
          "created_utc": 1734443878.0,
          "replies": [
            {
              "id": "m2hu8ju",
              "author": "Pikeman212a6c",
              "body": "They’re not mining equipment. There are drone start ups around the world that will rush to sell to the U.S. market. It would obviously be a disruption but it won’t take years.",
              "score": -7,
              "created_utc": 1734444417.0,
              "replies": [
                {
                  "id": "m2hux2i",
                  "author": "ITividar",
                  "body": "Why would they when there's a slew of tariffs incoming for anything not made in the US?",
                  "score": 11,
                  "created_utc": 1734444679.0,
                  "replies": [
                    {
                      "id": "m2i25at",
                      "author": "Pikeman212a6c",
                      "body": "Trump lives for what the market says. I don’t see across the board tariffs actually happening. He is just doing his normal thing of manufacturing a fake crisis to try to demand concessions. But it seems pretty clear world leaders see him coming the second time around. In the end I’m sure some pile on things will hit China and maybe a couple of protectionist sops to the Steel or auto industries might happen. But overall I expect the grandiose tariff plans will flop like most of his big projects.",
                      "score": 0,
                      "created_utc": 1734447339.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m2j27pl",
      "author": "Unhappy-Jaguar5495",
      "body": "The oblivion is just as capable as the dji fpv drone and sturdier. Just upgrade it to hd/digital",
      "score": -1,
      "created_utc": 1734459046.0,
      "replies": []
    },
    {
      "id": "m2jwrni",
      "author": "Glidepath22",
      "body": "What a ridiculous headline. Believe or not we can learn to more capable drone.",
      "score": -1,
      "created_utc": 1734468706.0,
      "replies": []
    },
    {
      "id": "m2l1x86",
      "author": "CharlieDmouse",
      "body": "Tough",
      "score": -1,
      "created_utc": 1734482766.0,
      "replies": []
    },
    {
      "id": "m2hs6cp",
      "author": "Aergia-Dagodeiwos",
      "body": "Costlier but not less capable. I compared some, and the Chinese drones tended to act strangely and inconsistently. Remote-controlled ones worked fairly well, though, but had major durability issues.",
      "score": -9,
      "created_utc": 1734443605.0,
      "replies": []
    },
    {
      "id": "m2kxft5",
      "author": "Nofanta",
      "body": "Long overdue.  Communists are our enemy.  We should have no relations at all with them.  Good first step.",
      "score": -5,
      "created_utc": 1734481138.0,
      "replies": [
        {
          "id": "m2l408s",
          "author": "2Legit2quitHK",
          "body": "Vietnam entered the chatroom",
          "score": 2,
          "created_utc": 1734483520.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2ktqst",
      "author": "gregkiel",
      "body": "beneficial direction memorize rock squeeze offer detail spectacular frame entertain\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "score": -3,
      "created_utc": 1734479795.0,
      "replies": []
    },
    {
      "id": "m2hpeug",
      "author": "orangpelupa",
      "body": "The snotbot drone in action https://youtu.be/IPUYtYP8BwE?si=r1f6W5d-pCq9fo_y\n\n\nSeems it should be compatible with other drones, like skydio, etc ",
      "score": -5,
      "created_utc": 1734442508.0,
      "replies": []
    },
    {
      "id": "m2hp73e",
      "author": "Y34rZer0",
      "body": "It’s called a Pine Phone",
      "score": -6,
      "created_utc": 1734442420.0,
      "replies": []
    },
    {
      "id": "m2i0pas",
      "author": "None",
      "body": "[deleted]",
      "score": -6,
      "created_utc": 1734446827.0,
      "replies": []
    }
  ]
}