{
  "post": {
    "title": "The end of an era: Dell will no longer make XPS computers",
    "author": "wickedplayer494",
    "id": "1hvbj3z",
    "score": 3460,
    "created_utc": 1736201690.0,
    "selftext": "",
    "num_comments": 550,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hvbj3z/the_end_of_an_era_dell_will_no_longer_make_xps/"
  },
  "comments": [
    {
      "id": "m5rsk3k",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736201692.0,
      "replies": []
    },
    {
      "id": "m5rxkq3",
      "author": "HobbesNJ",
      "body": "\"The new marketing tactics also align with Dell's (and virtually every other PC brand’s) efforts to push so-called “AI PCs” onto consumers. Per Terwilliger:\n\n>\n\nAre consumers really clamoring for AI, or are marketers just convinced it makes them look cutting edge?",
      "score": 1972,
      "created_utc": 1736203249.0,
      "replies": [
        {
          "id": "m5s1nqh",
          "author": "Gunfreak2217",
          "body": "It’s all garbage right now but yes it’s marketing. TVs are pushing AI so hard right now and it’s just like….. wtf…. Their ambient light sensors that dynamically adjust brightness are now being marketed as AI. Like… we’ve had this tech for years now… but now all of a sudden it’s AI? What a joke.",
          "score": 1227,
          "created_utc": 1736204544.0,
          "replies": [
            {
              "id": "m5s7wnu",
              "author": "NickCharlesYT",
              "body": "And it's still just as bad as it was before it was called \"AI\" too. I always have to turn it off on my TV because its own screen brightness causes it to start hunting for the correct \"ambient\" brightness mode.",
              "score": 343,
              "created_utc": 1736206588.0,
              "replies": [
                {
                  "id": "m5somg8",
                  "author": "kurotech",
                  "body": "What you don't like the HDR rave mode",
                  "score": 176,
                  "created_utc": 1736212121.0,
                  "replies": [
                    {
                      "id": "m5tldq3",
                      "author": "None",
                      "body": "My Sony TV's ambient sensor was very distracting, never the brightness I wanted. I turned it off early.",
                      "score": 36,
                      "created_utc": 1736223639.0,
                      "replies": [
                        {
                          "id": "m60h089",
                          "author": "GeronimoJak",
                          "body": "Mine is off and it still does it and I cannot figure the fuck out why.",
                          "score": 1,
                          "created_utc": 1736319099.0,
                          "replies": [
                            {
                              "id": "m61p9w5",
                              "author": "BababooeyHTJ",
                              "body": "Oh, I’m assuming you have an oled and happens on full screen brightness. It’s one of their burn in protections. Definitely noticeable and kinda aggressive.",
                              "score": 1,
                              "created_utc": 1736343687.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m5up9t9",
                      "author": "thefunkybassist",
                      "body": "I must say I had some AIpilepsy from it",
                      "score": 9,
                      "created_utc": 1736246174.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5sgw4w",
                  "author": "okwowandmore",
                  "body": "The tv knows what colors it is displaying. Why is it relying on an external sensor? Just process internally based on output? You could do this inside its own brains already.",
                  "score": 31,
                  "created_utc": 1736209563.0,
                  "replies": [
                    {
                      "id": "m5stbed",
                      "author": "cutelyaware",
                      "body": "The darker it gets in the room the less brightness it needs to project.",
                      "score": 43,
                      "created_utc": 1736213681.0,
                      "replies": []
                    },
                    {
                      "id": "m5t8rtb",
                      "author": "Dreadpiratemarc",
                      "body": "Not about color.  It’s brightness.  Just like your phone automatically turns up the brightness of the screen when you’re outside and turns it down when you’re in the dark.",
                      "score": 29,
                      "created_utc": 1736218982.0,
                      "replies": [
                        {
                          "id": "m5ui3zv",
                          "author": "Hendlton",
                          "body": "My phone used to do that until they pushed an update and now it's so bad that I had to turn that feature off. Samsung should just stop making updates for their phones. I swear they broke more features over time than they added.",
                          "score": 1,
                          "created_utc": 1736241456.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m5shs7f",
                      "author": "NickCharlesYT",
                      "body": "I don't know, I didn't make the thing. I would guess they didn't add enough (or any) compensation for the light the tv itself is giving out in a dimly lit room. It's not a cheap TV either, it's an LG OLED",
                      "score": 25,
                      "created_utc": 1736209858.0,
                      "replies": []
                    },
                    {
                      "id": "m5t7o8g",
                      "author": "Yodiddlyyo",
                      "body": "\"If you think we're going to spend time and money writing more code for leds when you can just use a slightly worse, waaaay cheaper light sensor...\" - their product team",
                      "score": 8,
                      "created_utc": 1736218605.0,
                      "replies": []
                    },
                    {
                      "id": "m5uge0l",
                      "author": "nagi603",
                      "body": "Because it's bolted-on and \"easy\" (but also shitty) solution to a management requirement, none of whom actually know what model or even brand of TV they most frequently use.\n\nFrankly, having a single sensor is probably faster and easier to set up than having to process the supposedly protected video stream. (We have to have DRM everywhere, lest one hollywood exec misses out on another golden toilet bowl.)",
                      "score": 3,
                      "created_utc": 1736240309.0,
                      "replies": []
                    },
                    {
                      "id": "m5uxowf",
                      "author": "Celemourn",
                      "body": "The tv knows what colors it’s displaying because it knows what colors it isn’t displaying. By subtracting the colors it is displaying from the colors it isn’t displaying, it arrives at a deviance. The deviance, when added to the colors it is displaying while accounting for the colors it isn’t displaying, yields the colors it will soon be displaying.",
                      "score": 3,
                      "created_utc": 1736251076.0,
                      "replies": []
                    },
                    {
                      "id": "m5uufud",
                      "author": "BlitzSam",
                      "body": "Whenever i hear AI, i treat it as market speak for “we want to gather your data”. AI-fying basic analog features is a big red flag that the company is justifying shoving in computing power. That computing power is inevitably going to be used for data scraping",
                      "score": 4,
                      "created_utc": 1736249300.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5viczc",
                  "author": "Ab47203",
                  "body": "On some TVs there's an option to mitigate or disable the function....locked inside of a secret fuckin menu that customers can't access without buying a special remote.",
                  "score": 1,
                  "created_utc": 1736259826.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5shd9i",
              "author": "Xylamyla",
              "body": "Investors are really excited about AI and are pushing for it to be in all marketing. That’s why you see even the likes of Apple suddenly pushing hard for AI, despite your average consumer not being very enthusiastic about it.",
              "score": 60,
              "created_utc": 1736209719.0,
              "replies": [
                {
                  "id": "m5sqphu",
                  "author": "SafetyMan35",
                  "body": "It’s 3D televisions all over again!\n\nAI has potential but it’s not quite ready for prime time yet.   Now, if you could get a pair of Augmented reality goggles with AI built in so I could look at an electric receptacle and it would tell me how to change it, or I could look at my car engine and it would walk me through changing my air filter or oil or spark plugs you have a highly marketable product.",
                  "score": 61,
                  "created_utc": 1736212819.0,
                  "replies": [
                    {
                      "id": "m5tbeiv",
                      "author": "JaggedMetalOs",
                      "body": ">  Now, if you could get a pair of Augmented reality goggles with AI built in so I could look at an electric receptacle and it would tell me how to change it\n\n\nMFW every time I go to plug something in AI Clippy asks if I want to change the outlet.",
                      "score": 25,
                      "created_utc": 1736219908.0,
                      "replies": [
                        {
                          "id": "m5ucotl",
                          "author": "ITFOWjacket",
                          "body": "Just hold both triggers to engage How-To Mode\n\nLike entering Combat Mode in Assassin’s Creed.",
                          "score": 1,
                          "created_utc": 1736237873.0,
                          "replies": []
                        },
                        {
                          "id": "m5ujg1e",
                          "author": "nagi603",
                          "body": "Electrocution basically guaranteed, lol.",
                          "score": 1,
                          "created_utc": 1736242355.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m5u6x7f",
                      "author": "clockworkpeon",
                      "body": "Microsoft was trying to do this with the Hololens. but they realized it would be too expensive for consumers, so they scrapped the consumer version and now they're selling them to the military for like $80k a pop.",
                      "score": 9,
                      "created_utc": 1736234296.0,
                      "replies": []
                    },
                    {
                      "id": "m5w6vlm",
                      "author": "IamGimli_",
                      "body": "...except no company wants you repairing your own products, so all it would do is give you Amazon links to buy a new one or a shortcut to schedule a dealer appointment.",
                      "score": 3,
                      "created_utc": 1736267597.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5smxrf",
                  "author": "modstirx",
                  "body": "Which is funny because, if the public isn’t enthusiastic about, than less people will buy the product, then they wonder why",
                  "score": 9,
                  "created_utc": 1736211563.0,
                  "replies": [
                    {
                      "id": "m5t42n7",
                      "author": "Montana_Gamer",
                      "body": "This is all to drive up shareholder value. Did you think the stock market cared about reality?",
                      "score": 15,
                      "created_utc": 1736217351.0,
                      "replies": [
                        {
                          "id": "m5vctmq",
                          "author": "None",
                          "body": "Good old pump and dump... When it fizzles, do you think the next big pink elephant they chase with a net is IA? \"Like AI, but 975% more handy!\"",
                          "score": 2,
                          "created_utc": 1736257778.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m5syhhl",
                  "author": "None",
                  "body": "Even apple?! If apple is chasing trends, clearly we're in the end times.",
                  "score": 8,
                  "created_utc": 1736215422.0,
                  "replies": [
                    {
                      "id": "m5ujhbz",
                      "author": "nagi603",
                      "body": "They have been for some time now in a few important fields, even before AI picked up.",
                      "score": 6,
                      "created_utc": 1736242379.0,
                      "replies": [
                        {
                          "id": "m5xcd3y",
                          "author": "Bouboupiste",
                          "body": "Everyone forgot about the apple car. Or the apple newton (remember the PDA fad?). Or the failed console.",
                          "score": 1,
                          "created_utc": 1736279633.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m5wobut",
                  "author": "thisischemistry",
                  "body": "I'll buy the product that doesn't trumpet AI over the product that does. In general, I don't enjoy fads and buzzwords like that. Use precise language about the features of your product, not some overloaded marketing term.",
                  "score": 1,
                  "created_utc": 1736272693.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5scla7",
              "author": "QueezyF",
              "body": "Just give me a good picture and don’t drop my WiFi connection. Goddamn.",
              "score": 46,
              "created_utc": 1736208141.0,
              "replies": [
                {
                  "id": "m5tceg5",
                  "author": "captainshrapnel",
                  "body": "No kidding.  And quit running smart apps on a fucking potato.  For like a penny more I'm sure they could harness the power of a blackberry pearl and make shit 1000x more responsive.",
                  "score": 40,
                  "created_utc": 1736220260.0,
                  "replies": [
                    {
                      "id": "m5ur7y2",
                      "author": "cataath",
                      "body": "But I'd they did that, that TV would still be able to run apps released three or four years from now, and you wouldn't need a new TV to be able to do the \"next big thing\". They can't have you not spending $800-1200 every four years.",
                      "score": 9,
                      "created_utc": 1736247385.0,
                      "replies": []
                    },
                    {
                      "id": "m5x194a",
                      "author": "TheOneWhoMixes",
                      "body": "I have a Samsung TV, about 4-5 years old now, but it was top of the line when I bought it. The smart interface is nearly unusable now.\n\nNow I just use it as a dumb TV with an Apple TV box connected. It's extremely fast, no interface lag now.\n\nThe only time I deal with the Samsung interface is to switch the input to my PC. No exaggeration, with Apple TV I can open Netflix, scroll to a show, and have it going *faster* than the Samsung interface can process the 3 button presses it takes to switch to PC.\n\nFirst world problem? Sure. But damn, a TV with all extra apps uninstalled shouldn't take more than 15 seconds just to switch HDMI inputs.",
                      "score": 2,
                      "created_utc": 1736276412.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5wotxa",
                  "author": "thisischemistry",
                  "body": "People allow their TVs to connect to the internet??? No thanks, I'd rather have the dumbest TV ever. All I want it to do is display what I feed into its HDMI.\n\nAfter all the times TV manufacturers have loaded interfaces up with ads and updated their OS with user-hostile stuff, I don't know how anyone can trust them at all.",
                  "score": 1,
                  "created_utc": 1736272836.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5s8aia",
              "author": "TechSupportTime",
              "body": "It's the same shit that companies were doing with calling everything \"smart\" and \"connected features\"",
              "score": 80,
              "created_utc": 1736206718.0,
              "replies": [
                {
                  "id": "m5t0m97",
                  "author": "Neckbeards_Gonewild",
                  "body": "It's the \"internet of things\" of the present day.",
                  "score": 23,
                  "created_utc": 1736216159.0,
                  "replies": []
                },
                {
                  "id": "m5stqyh",
                  "author": "cutelyaware",
                  "body": "It's more like recognizing that GPUs which were meant for gaming happened to be exactly what was needed for AI. We may not be running a lot of LLMs locally right now, but that will hopefully change soon, so it really will all be AI.",
                  "score": -14,
                  "created_utc": 1736213826.0,
                  "replies": [
                    {
                      "id": "m5ten6x",
                      "author": "m3thodm4n021",
                      "body": "No thanks.",
                      "score": 9,
                      "created_utc": 1736221041.0,
                      "replies": []
                    },
                    {
                      "id": "m5trdkr",
                      "author": "SolidOshawott",
                      "body": "Why would I want an LLM on my TV?",
                      "score": 6,
                      "created_utc": 1736226209.0,
                      "replies": [
                        {
                          "id": "m5tuvi6",
                          "author": "cutelyaware",
                          "body": "Do you currently have a GPU on your TV?",
                          "score": -3,
                          "created_utc": 1736227829.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m5to65v",
                      "author": "TheTacoWombat",
                      "body": "Sounds terrible",
                      "score": 6,
                      "created_utc": 1736224817.0,
                      "replies": [
                        {
                          "id": "m5tql0j",
                          "author": "cutelyaware",
                          "body": "Don't use it",
                          "score": -4,
                          "created_utc": 1736225858.0,
                          "replies": [
                            {
                              "id": "m5wp1ud",
                              "author": "thisischemistry",
                              "body": "Don't use a device with an LLM? Sounds about right to me.",
                              "score": 1,
                              "created_utc": 1736272900.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m5woyfn",
                      "author": "thisischemistry",
                      "body": "No thanks.",
                      "score": 1,
                      "created_utc": 1736272872.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5sf560",
              "author": "None",
              "body": "I swear anything that could be described as \"smart\" technology is called AI now. Am I going to call my hue lights AI powered because they come with a default day/night schedule? No.",
              "score": 24,
              "created_utc": 1736208987.0,
              "replies": [
                {
                  "id": "m5tcui4",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 12,
                  "created_utc": 1736220421.0,
                  "replies": [
                    {
                      "id": "m5ua7n2",
                      "author": "cbzoiav",
                      "body": "It turns on when it has a good idea!",
                      "score": 1,
                      "created_utc": 1736236312.0,
                      "replies": []
                    },
                    {
                      "id": "m5v9a1t",
                      "author": "Jusanden",
                      "body": "It already exists. In the nanoleaf and govee apps, you can describe a scene and it will use gen AI to create a color palette for you. \n\nIt’s… honestly not the dumbest feature in the world.",
                      "score": 1,
                      "created_utc": 1736256388.0,
                      "replies": [
                        {
                          "id": "m5w791y",
                          "author": "IamGimli_",
                          "body": "I beg to differ.",
                          "score": 1,
                          "created_utc": 1736267708.0,
                          "replies": []
                        },
                        {
                          "id": "m5wp8kt",
                          "author": "thisischemistry",
                          "body": "You mean they've come up with *dumber* things? I didn't think they could sink lower…",
                          "score": 1,
                          "created_utc": 1736272954.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m5vlmfd",
                  "author": "tejanaqkilica",
                  "body": "It's all about marketing and perception, always has been.\n\nAs a side project, I tried to retrofit Self Driving on my 2013, Golf Mk7, 2.0 TDI with 6 Speed Manual transmission and the end result was what I call \"Full autonomous self driving, zero touch, no input required, Ai based, relocation assistant, with big data and block chain capable, NFT Ai\".\n\nAnd the surpassing bit is that it works flawlessly. You just need to get in the car and it will take you to work by yourself, of course if it doesn't you're required to take over, but other than that it works perfectly.",
                  "score": 1,
                  "created_utc": 1736260972.0,
                  "replies": [
                    {
                      "id": "m5wpf3a",
                      "author": "thisischemistry",
                      "body": "So you hired a driver?",
                      "score": 1,
                      "created_utc": 1736273008.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5tqwys",
              "author": "SolidOshawott",
              "body": "Companies that have existed for 40+ years are putting out ads saying things like \"our processes are AI-first from the ground up\".\n\nWe're officially in the \"bubblesort is AI\" era.",
              "score": 14,
              "created_utc": 1736226004.0,
              "replies": [
                {
                  "id": "m7b1apg",
                  "author": "1doughnut",
                  "body": "Awesome! So I can now say that I was already programming AI software back in grade school LOL",
                  "score": 2,
                  "created_utc": 1736963282.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5soiyd",
              "author": "kurotech",
              "body": "It's not the AI they want you to buy it for that's just the only positive they have to spin on it all they want you to buy the new smart tech so it can harvest more of your data and provide them direct access to you for marketing it's also why all these new TVs need a always on connection",
              "score": 11,
              "created_utc": 1736212090.0,
              "replies": []
            },
            {
              "id": "m5srk78",
              "author": "tooclosetocall82",
              "body": "It’s like when HDTVs came out, and suddenly every thing was HD. The worst part was computer monitors got worse because they already exceeded HD resolutions, so they lowered the resolutions and marketed them as being better.",
              "score": 17,
              "created_utc": 1736213102.0,
              "replies": [
                {
                  "id": "m5trj94",
                  "author": "SolidOshawott",
                  "body": "Ah yes, the dark era of 1366x768",
                  "score": 11,
                  "created_utc": 1736226281.0,
                  "replies": [
                    {
                      "id": "m5wkxcf",
                      "author": "cgaWolf",
                      "body": "1080p was a downgrade, and that draught lasted over a decade :x",
                      "score": 1,
                      "created_utc": 1736271716.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5z36o3",
                  "author": "trainbrain27",
                  "body": "[https://tiamat.tsotech.com/hd-sucks](https://tiamat.tsotech.com/hd-sucks)\n\nThey still sell 15\" laptops (real laptops, not chromebooks) that are only 768 pixels high.\n\nLaptops were better than that twenty years ago.  Before HD, LCDs were 1920x1200 (better than 1080p), 1600x1200 (4:3), or just 1680x1050.  The IBM T220 monitor was 3840x2400, but it was roughly $6000, and your graphics card wasn't good enough to handle it.",
                  "score": 1,
                  "created_utc": 1736298916.0,
                  "replies": [
                    {
                      "id": "m5z4f1c",
                      "author": "tooclosetocall82",
                      "body": "lol. My company just recently sent me a 32” monitor for my office. I was excited until I saw that it’s 1080p… like why bother even making that in 2024? It’s still sitting in the box.",
                      "score": 2,
                      "created_utc": 1736299325.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5t53fl",
              "author": "Tokishi7",
              "body": "That’s pretty big here in korea. Seems like everything is called AI now and the old people eat it up. A lot of people do because they just don’t know better. Phones, fridges, TVs, the washers, etc. The first thing sales people say is something something AI. Give me a break",
              "score": 7,
              "created_utc": 1736217713.0,
              "replies": [
                {
                  "id": "m5w5bgf",
                  "author": "tsturte1",
                  "body": "My fridge doesn't need to keep a list nor does it need wi-fi",
                  "score": 1,
                  "created_utc": 1736267135.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5ut7jm",
              "author": "_franciis",
              "body": "Had a discussion with someone about the quality of ”AI” in a film the other day. They meant CGI. Anything computery is AI now.",
              "score": 7,
              "created_utc": 1736248585.0,
              "replies": []
            },
            {
              "id": "m5stizw",
              "author": "andy_nony_mouse",
              "body": "I want my AI 3D smart TV",
              "score": 6,
              "created_utc": 1736213752.0,
              "replies": []
            },
            {
              "id": "m5uhoj3",
              "author": "Helpmehelpyoulong",
              "body": "Ai is just marketing speak for in-built systems to invade your privacy, harvest your data and target advertising as far as I’m concerned. I’ve yet to see a single product with Ai in the marketing that made me think it adds value to the end user. Take the new Surface Pro for example “yeah let’s take away the screen capture button and make it into an Ai assistant shortcut for our shitty Cortana Ai” which literally no-one asked for. So now people buy the new tablet and use an older keyboard as a workaround.",
              "score": 4,
              "created_utc": 1736241170.0,
              "replies": []
            },
            {
              "id": "m5stwph",
              "author": "Rabo_McDongleberry",
              "body": "I keep saying it's \"Blockchain\" all over again. Lol",
              "score": 7,
              "created_utc": 1736213879.0,
              "replies": []
            },
            {
              "id": "m5t8259",
              "author": "mtbmike",
              "body": "It can tell when you’re angry so go easy there",
              "score": 3,
              "created_utc": 1736218736.0,
              "replies": []
            },
            {
              "id": "m5u0bil",
              "author": "Langolas",
              "body": "that brightness adjusting has to adjust enough so the camera can see you and report back to the ad serving AI overlords! Is that a pint of Ben and Jerry's LG sees in your hand?! Better tell the Overlords!",
              "score": 2,
              "created_utc": 1736230568.0,
              "replies": []
            },
            {
              "id": "m5uq9iq",
              "author": "VeganCaramel",
              "body": "TV sales have been laughable for a long time.  \n  \nThey started making CRT TV's with flat glass just because the public had been trained like monkeys, by LCD screen marketing, to respond to the keywords \"flat screen\".  \n  \nThey started swapping their gas backlights with LED backlights just so they could print \"LED\" on the box, because the public had already been trained by the LED/OLED marketing.",
              "score": 2,
              "created_utc": 1736246797.0,
              "replies": []
            },
            {
              "id": "m5v96we",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1736256353.0,
              "replies": [
                {
                  "id": "m5w82nt",
                  "author": "IamGimli_",
                  "body": "“I’m sorry, Dave, I’m afraid I can’t do that”",
                  "score": 1,
                  "created_utc": 1736267949.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5vezan",
              "author": "MadR__",
              "body": "Wake me up when TVs with AI can automatically mute themselves during commercials. I am hammering for that tech.",
              "score": 1,
              "created_utc": 1736258589.0,
              "replies": [
                {
                  "id": "m5w89aq",
                  "author": "IamGimli_",
                  "body": "That'll be a $35 a month subscription service that doesn't work half the time.",
                  "score": 1,
                  "created_utc": 1736268003.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5vfomg",
              "author": "cinnapear",
              "body": "I bought my parents AI hand warmers for Christmas.",
              "score": 1,
              "created_utc": 1736258853.0,
              "replies": []
            },
            {
              "id": "m5vpqk8",
              "author": "oh_my_account",
              "body": "Chat bots yesterday - now AI. Lol",
              "score": 1,
              "created_utc": 1736262348.0,
              "replies": []
            },
            {
              "id": "m5w8ray",
              "author": "RwYeAsNt",
              "body": "It's cause old rich people are dumb as rocks. Their eyes light up when they read \"AI\" anything, and they throw investment money at it.",
              "score": 1,
              "created_utc": 1736268150.0,
              "replies": []
            },
            {
              "id": "m5wtbhp",
              "author": "AgencyBasic3003",
              "body": "That was the case even before the AI hype. My Samsung washing machine from 2021 is using “AI” to optimize the washing process whatever that means.",
              "score": 1,
              "created_utc": 1736274146.0,
              "replies": []
            },
            {
              "id": "m604axs",
              "author": "MWH1980",
              "body": "Reminds me of the push for 3DTV’s, but I don’t think this fad is going to die out in 5 years.",
              "score": 1,
              "created_utc": 1736312677.0,
              "replies": []
            },
            {
              "id": "m5u9dp0",
              "author": "Relevant-Doctor187",
              "body": "With the average American having a 6th grade reading level they’re just marketing to the average idiot who likes fancy words.",
              "score": 1,
              "created_utc": 1736235791.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5s1fnj",
          "author": "ChrisFromIT",
          "body": ">or are marketers just convinced it makes them look cutting edge?\n\nThe latter, likely. A study that appeared recently that found that including AI in the marketing material negatively impacted the public perceptions of the product.\n\nhttps://www.tandfonline.com/doi/full/10.1080/19368623.2024.2368040#abstract",
          "score": 145,
          "created_utc": 1736204471.0,
          "replies": [
            {
              "id": "m5t9c8u",
              "author": "lowcrawler",
              "body": "Actively the reason I didn't get the s24",
              "score": 16,
              "created_utc": 1736219183.0,
              "replies": []
            },
            {
              "id": "m5vp39q",
              "author": "donnysaysvacuum",
              "body": "It must be investors pushing to protect their investments.",
              "score": 1,
              "created_utc": 1736262135.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5s191u",
          "author": "coffeeshopslut",
          "body": "AI feels like the 2025 version of \"3D\"",
          "score": 149,
          "created_utc": 1736204412.0,
          "replies": [
            {
              "id": "m5si5db",
              "author": "versusgorilla",
              "body": "It's 3D, it's Wearables, it's Voice Assistants, it's VR, it's AR, it's Crypto, it's NFTs, and now it's AI, know what all these things have in common with one another? They're buzzwords to trick short sighted investors into not panicking and cutting the guts out of a business and selling it for parts before they risk a quarter where they don't grow *to what was expected*. Someone predicted a 15% growth? You're on target for only 10% growth? Panic and sell everything. \n\nThat's what they want to avoid, so they all take whatever popular buzzword is being buzzed about and they go insane and put it in everything. \n\nSomewhere buried behind all these things is a legit product that has a purpose, but then you get this bullshit market saturation where everyone is chasing in an attempt to be the next \"Facebook\" who manage to take something new like \"Social Media\" and corner it and make billions before the bubble bursts. \n\nThen we're left it broken shells of former products. Defunct Stadia hardware for an abandoned streaming service. Expensive Apple AR headsets that are too cumbersome to use regularly. TVs with the 3D button that doesn't do anything anymore. NBA NFT \"trading cards\" that lost so much value that no one can even be bothered. Ten thousand cryptocurrencies that will never be worth anything. \n\nAll fucking garbage. And now it's going to be products that have \"AI Features\" that won't work when Google and Apple and Amazon shut down their bullshit AI services when they realize it's not making them any money and ChatGPT already cornered that market. \n\nAnd by then, we'll be on to the next thing, Smart Contact Lenses or some shit that seems cool at first but just fucking sucks and costs too much and no one will develop for and it will become more trash.",
              "score": 98,
              "created_utc": 1736209981.0,
              "replies": [
                {
                  "id": "m5tbpip",
                  "author": "nuclearpiltdown",
                  "body": "This comment needs to be put in a Museum of Technology of the 21st century. When we look back on its story, this will be what is written on a big plaque at the entrance to the 2005-20xx section.",
                  "score": 25,
                  "created_utc": 1736220012.0,
                  "replies": [
                    {
                      "id": "m5tids6",
                      "author": "versusgorilla",
                      "body": "We loved straight through the Information Age and rolled right into Capitalism devouring everything it can before anything actually beneficial can develop.",
                      "score": 2,
                      "created_utc": 1736222444.0,
                      "replies": []
                    },
                    {
                      "id": "m5vzff7",
                      "author": "NinjaLion",
                      "body": "the saturation of the smartphone was the last true technological shift in the public lifestyle in (2009 ish).\n\neverything /u/versusgorilla posted has been a corporate attempt to replicate that change, and all have failed dramatically. \n\nthe timeline reveals how bad the stagnation has been(very arguable what belongs on this, this is just my take):\n\ncommodore 64, home computing: 1983\n\nnokia 3210, first popular cellphone: 1999(+15 years)\n\nAOL cd internet, prolific available internet: 1999 (+0!)\n\nflatscreen television, peak tv addiction: 2005(+6)\n\niphone 3g, the first HUGE smartphone: 2009 (+4)\n\nNOTHING YET: 2025 (+16)\n\nwe are nearing the largest gap in true technological proliferation that we have seen since the advent of home computing... you can stretch it out with a few notables, but really we havent seen jack shit",
                      "score": 4,
                      "created_utc": 1736265373.0,
                      "replies": [
                        {
                          "id": "m5w1v2o",
                          "author": "versusgorilla",
                          "body": "What I find fascinating was that push way back to get durable and low-power laptops to the developing world as a way to spread internet access to developing nations, and you don't really hear about it anymore.  It's like the capitalists realized that there wasn't as much money in that as they initially thought, so efforts just ended.  It felt like that was the end of the altruistic internet and we'd moved into the era of just trying to squeeze the blood out of the stones that were already hooked in. \n\nIt feels like that, getting the entire world connected, may have been that next big leap.  But it didn't happen, so we've just been left with companies trying to create something and then the big money venture capitalists trying to turn it into the next big money maker, and it hasn't happened.  Like you said, there's been a 16 plus year gulf where they've been trying to make all the dumb tech I've mentioned into the next thing.  \n\nFuck, I forgot flexible screens!  Maybe that'll finally take off and not just be a kinda shittier version of a solid screen phone.",
                          "score": 0,
                          "created_utc": 1736266109.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m5tqvj9",
                      "author": "GuessIllPissOnIt",
                      "body": "Agree",
                      "score": 1,
                      "created_utc": 1736225987.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5taqb2",
                  "author": "Gizmo45",
                  "body": "Do you know they have smart goggles for swimming these days? You're not too far off!",
                  "score": 1,
                  "created_utc": 1736219673.0,
                  "replies": []
                },
                {
                  "id": "m5w8w2r",
                  "author": "IamGimli_",
                  "body": "You forgot The Cloud(tm)!",
                  "score": 1,
                  "created_utc": 1736268189.0,
                  "replies": [
                    {
                      "id": "m5w9yv2",
                      "author": "versusgorilla",
                      "body": "The Cloud! In another comment I just remembered flexible and foldable screens, as if those will ever be better than a normal ass solid cellphone screen",
                      "score": 1,
                      "created_utc": 1736268507.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5suwkk",
                  "author": "arrivederci117",
                  "body": "Those smart glasses aren't actually a gimmick. The New Orleans terrorist used them to record footage and analyze points of attack. I can see militaries or ISIS buy a bunch for their purposes.",
                  "score": -4,
                  "created_utc": 1736214210.0,
                  "replies": [
                    {
                      "id": "m5t0e8j",
                      "author": "fishforce1",
                      "body": "I don't see how smart glasses are even relevant... aside from being new.  I don't think most people would bat an eye these days if he was walking down the street recording with a cell phone or GoPro.",
                      "score": 10,
                      "created_utc": 1736216081.0,
                      "replies": []
                    },
                    {
                      "id": "m5sx8wn",
                      "author": "versusgorilla",
                      "body": "That's kinda my point, buried in all these ideas is a legitimate purpose. Bitcoin could have been a legitimate non governmental decentralized currency but instead it became a gimmick and a product for scammers and con artists. That isn't to say it doesn't work and people haven't had success there, it's just not what all the hype was about. \n\nVR is def cool when it's done right, but it's expensive and costs never came down, so no one develops for it, so you have an expensive machine with minimal software or games. Not to say there aren't dope experiences there, but it wasn't what the hype was. \n\nAnd it's gonna happen with AI, ChatGPT is genuinely amazing but also, it's not quite there and probably won't ever be there. It still makes insane errors and leaps in basic shit and it can't do hands. Plus, no one has successfully explained why we need it at all. \n\nAnd before anyone figures out why my Amazon shopping app needs an AI button, we'll be on to the next thing.",
                      "score": 6,
                      "created_utc": 1736215000.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5s30fm",
              "author": "None",
              "body": "Disney XD DVD.",
              "score": 13,
              "created_utc": 1736204980.0,
              "replies": [
                {
                  "id": "m5s7fxs",
                  "author": "Filter55",
                  "body": "XD DVD Model S",
                  "score": 4,
                  "created_utc": 1736206434.0,
                  "replies": [
                    {
                      "id": "m5stxm4",
                      "author": "StrategicBlenderBall",
                      "body": "XD DVD Model S Plaid PRO MAX 8K RTX AI+",
                      "score": 6,
                      "created_utc": 1736213888.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5sdjal",
              "author": "Ted-Chips",
              "body": "The Betamax of LaserDisc.",
              "score": 2,
              "created_utc": 1736208455.0,
              "replies": []
            },
            {
              "id": "m5t6rm7",
              "author": "WyoGuy2",
              "body": "tie coordinated obtainable salt shocking lip spark start slap glorious\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 3,
              "created_utc": 1736218291.0,
              "replies": [
                {
                  "id": "m5toomv",
                  "author": "TheTacoWombat",
                  "body": "I mean AI as a concept goes back to the 60s. Lots of things have been called AI that weren't.",
                  "score": 8,
                  "created_utc": 1736225035.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5sjdwe",
              "author": "YoureGrammerIsWorsts",
              "body": "Even though I don't use AI much and am generally skeptical of it right now, I think that's really underselling it. Think of it more like any big jump in technology, the first 5ish years are about trying to cram it in as a solution to existing problems. But to actually utilize it, you have to rethink the problems.\n\nTake steam engines for example: When they first came out, places literally just replaced their waterwheels with steam engines and honestly didn't get that great of improvements out of them. It wasn't until they built factories away from rivers (so you didn't have to worry about flooding and closer to raw materials to lower transportation costs) or laid out in more logical ways (you don't have to build everything around one central crankshaft) that steam engines actually became really valuable to production.\n\nYou can use the same idea about computers in general, or the internet, or almost any new technology. Give it time",
              "score": 3,
              "created_utc": 1736210389.0,
              "replies": []
            },
            {
              "id": "m5t47ap",
              "author": "Kundrew1",
              "body": "AI is actually very useful for certain things. Its scope is limited but it’s having a huge impact in certain areas. That said I think the value is in business applications and not in consumer electronics or most consumer facing applications",
              "score": 1,
              "created_utc": 1736217396.0,
              "replies": []
            },
            {
              "id": "m5sefi1",
              "author": "tanstaafl90",
              "body": "There are some fantastic applications with some sophisticated algorithms that work very well. Most of it just seems like a way to sell a mediocre programs as \"cutting edge\".",
              "score": 1,
              "created_utc": 1736208751.0,
              "replies": []
            },
            {
              "id": "m5t9byl",
              "author": "thedm96",
              "body": "Except C-Levels are salivating over it making everyone homeless.",
              "score": 1,
              "created_utc": 1736219180.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5s73k5",
          "author": "dead_fritz",
          "body": "Irs all meaningless. Most AI stuff right now is run in cloud and anyone actually doing their own Ai work probably has a desktop with better parts for it.",
          "score": 37,
          "created_utc": 1736206320.0,
          "replies": [
            {
              "id": "m5s9jjp",
              "author": "suicidaleggroll",
              "body": "Yeah this is what gets me.  AI can be very helpful, but the tiny models are not that.  In order to be legitimately useful it needs to be one of the big powerful models running on thousands of dollars worth of GPUs, which companies can't just sneak into a laptop.  So either:\n\n1. They're integrating tiny models that can run in real time on a laptop without major impacts to form factor or battery life, in which case it's guaranteed to be useless.\n\n2. They're just shipping the requests off to the big cloud servers anyway, which they can already do on any computer right now, so nothing is changing.",
              "score": 16,
              "created_utc": 1736207130.0,
              "replies": [
                {
                  "id": "m5ttesk",
                  "author": "oldmaninparadise",
                  "body": "Yeah. Friend is so excited for new iPhone w AI. said, new phone is calculating directions on waze SO much faster. Didn't want to tell him that is not working like that....\n\nBrother wants to wait for a new AI laptop. He uses a browser to read the news and check his investments.",
                  "score": 7,
                  "created_utc": 1736227140.0,
                  "replies": [
                    {
                      "id": "m5v5mkw",
                      "author": "teh_fizz",
                      "body": "Yeah but now the AI can generate custom emojis!\n\nGod what a shit feature that is.",
                      "score": 3,
                      "created_utc": 1736254861.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5syto4",
                  "author": "flamingtoastjpn",
                  "body": "This is not really correct. The benefit of edge AI is to use it for basic things like iPhone’s image searching. You don’t introduce latency or have to have an internet connection, and for stuff like that it works fine. What you see marketed as “AI enabled” hardware is just adding an NPU to offload work from the CPU without having to touch the GPU. We’ve been adding boring stuff like this to computers for ages it’s just the investors have a buzzword for it this time",
                  "score": 8,
                  "created_utc": 1736215537.0,
                  "replies": [
                    {
                      "id": "m5trs3y",
                      "author": "GuessIllPissOnIt",
                      "body": "And a very good counter argument, damn I love the smart part of Reddit",
                      "score": 3,
                      "created_utc": 1736226392.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5t937p",
                  "author": "Krumpopodes",
                  "body": "That's not really true at all, many of the small models are really good. They wouldn't be able to train those small models without having the large datacenter scale models available to help. That still isn't the lie that \"ai pcs' are telling  - It's that NPUs are in any way capable of running even those small models at this time. It's just a promise that they are pushing enough of them onto the market that libraries for them will be adopted by people developing Local LLM tooling. It's entirely dominated by nvidia/cuda right now, if you want to run llms locally on a laptop you do it on an nvidia dedicated GPU and you will get 10x or more tokens per second than on on cpu/npu ( or you use a decked out apple silicon macbook pro and run a bigger model in system ram, but that is pretty damn expensive comparatively)",
                  "score": 2,
                  "created_utc": 1736219092.0,
                  "replies": [
                    {
                      "id": "m5tab4c",
                      "author": "kc5ods",
                      "body": "in what universe? every small model i tried is hot garbage.",
                      "score": 0,
                      "created_utc": 1736219525.0,
                      "replies": [
                        {
                          "id": "m5tvm2r",
                          "author": "Krumpopodes",
                          "body": "For the tasks that are actually useful they are great, the 'promise of AI' with all its 'agentic' blah blah blah is what is garbage, right now. The things that AI is pretty good at like code-completion or summaries can be done quite well with a small model. And no, the 'I tried one local llm model and it couldn't replace my junior grade engineer' anecdote is not how you come to a general conclusion. \n\nYour limited experience does not apply transitively to the universe.",
                          "score": 2,
                          "created_utc": 1736228184.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m5trmgs",
                  "author": "GuessIllPissOnIt",
                  "body": "Under rated and very relevant comment",
                  "score": 1,
                  "created_utc": 1736226322.0,
                  "replies": []
                },
                {
                  "id": "m5veda5",
                  "author": "mattindustries",
                  "body": "Tiny models can be useful, and even more accurate. Tiny LLMs are less useful. Whisper can now run on device in a browser which is cool. We are in a weird time, where everyone things anything Ai is an LLM, which comes on the heels of all ML being called Ai. There have been date time parsers built on phrase tables since before LLMs.",
                  "score": 1,
                  "created_utc": 1736258357.0,
                  "replies": [
                    {
                      "id": "m5vg7n2",
                      "author": "suicidaleggroll",
                      "body": "People think the AI they’re putting in these laptops is an LLM because that’s what companies are advertising is as, personal assistants that can do anything.  If all it is is an image indexer or date time parser, companies need to be clearer about what its purpose and capabilities are.",
                      "score": 1,
                      "created_utc": 1736259048.0,
                      "replies": [
                        {
                          "id": "m5vlpkm",
                          "author": "mattindustries",
                          "body": "I haven't seen their promo material, what are they advertising as far as capabilities? Many things can be done without an LLM, like way better searching for emails/files using GloVe and average cosine similarity. Throw in some RAG for notes app and you are already in a better place. Add a phrase table and whisper to do faster offline calendar creation...wouldn't need to run all of the time and could start up fast if storing in parquet files. \n\nI guess my point is, a collection of focussed models can feel pretty great as far as the user experience.",
                          "score": 1,
                          "created_utc": 1736261003.0,
                          "replies": [
                            {
                              "id": "m5xh0a1",
                              "author": "suicidaleggroll",
                              "body": "> what are they advertising as far as capabilities?\n\nThat's the thing, they don't list specific capabilities, they just advertise it as a do-everything personal assistant, unrestricted.  At least from the marketing materials I've seen.",
                              "score": 1,
                              "created_utc": 1736280993.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m5sd0v1",
          "author": "None",
          "body": "It’s so they have an excuse to increase prices. Nobody asked for this shit",
          "score": 13,
          "created_utc": 1736208284.0,
          "replies": []
        },
        {
          "id": "m5si14v",
          "author": "heisenberg070",
          "body": "I am positively repulsed by products that relabel mundane shit as AI. Just call a spade a spade, guys. Sadly, that’s not how marketing works.",
          "score": 11,
          "created_utc": 1736209942.0,
          "replies": [
            {
              "id": "m5y7nu5",
              "author": "kebaball",
              "body": "Just call a spade ai spade? What is this AI Spade you’re referring to and where can I, as a consumer who doesn’t need any spade, buy one?",
              "score": 1,
              "created_utc": 1736288713.0,
              "replies": [
                {
                  "id": "m5yzu9j",
                  "author": "heisenberg070",
                  "body": "Not sure if you are being sarcastic but calling a spade a spade is an idiom. It means to tell the truth about something and to not beat around the bush (another idiom).",
                  "score": 1,
                  "created_utc": 1736297802.0,
                  "replies": [
                    {
                      "id": "m69aruo",
                      "author": "kebaball",
                      "body": "But an AI Spade would automatically identify the bush so you wouldn’t beat around it. I’ll stop trolling.",
                      "score": 1,
                      "created_utc": 1736444516.0,
                      "replies": [
                        {
                          "id": "m69e28q",
                          "author": "heisenberg070",
                          "body": "Haha, good one. Sometimes you can’t tell if someone is not a native English speaker or is just trolling.",
                          "score": 1,
                          "created_utc": 1736445456.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m5slffy",
          "author": "Xelanders",
          "body": "It’s marketing for shareholders, not marketing for customers.",
          "score": 6,
          "created_utc": 1736211063.0,
          "replies": []
        },
        {
          "id": "m5sjlds",
          "author": "Remic75",
          "body": "Definitely marketing. AI only tells shareholders and investors that “we’re up with the times!” \n\nAI has its uses, but currently on-device AI is garbage, especially when ChatGPT just a click away.",
          "score": 6,
          "created_utc": 1736210457.0,
          "replies": []
        },
        {
          "id": "m5rzeso",
          "author": "QuickQuirk",
          "body": "NVidia are paying them to try convince consumers that they need them.",
          "score": 23,
          "created_utc": 1736203827.0,
          "replies": []
        },
        {
          "id": "m5sdq3x",
          "author": "popeter45",
          "body": "we are now at the tech cycle \"make everybody have it so we can push up prices\" stage\n\nsame thing happened with 3D when to get a good TV without 3D was a struggle at one point\n\nusually a sign a marketing thing is about to go out of style fast",
          "score": 4,
          "created_utc": 1736208518.0,
          "replies": []
        },
        {
          "id": "m5sgk86",
          "author": "WannaBpolyglot",
          "body": "It reminds me of when all tvs were pushing 3D for some reason",
          "score": 2,
          "created_utc": 1736209453.0,
          "replies": []
        },
        {
          "id": "m5sh1e8",
          "author": "Relative_Walk_936",
          "body": "Reminds me of the 3D TV hype.",
          "score": 2,
          "created_utc": 1736209612.0,
          "replies": []
        },
        {
          "id": "m5sk4ud",
          "author": "None",
          "body": "Pure marketing",
          "score": 2,
          "created_utc": 1736210636.0,
          "replies": []
        },
        {
          "id": "m5sgixs",
          "author": "None",
          "body": "Unless OpenAI makes dedicated software for ChatGPT I can install and manage myself, I don't want AI on my laptop.\n\nCopilot is a lemon by comparison. Barely helpful and outright annoying.",
          "score": 3,
          "created_utc": 1736209441.0,
          "replies": []
        },
        {
          "id": "m5sl72c",
          "author": "None",
          "body": "If you aren’t saying AI every new product pitch you are essentially obsolete. I personally hate it but almost all companies are relying on AI nowadays",
          "score": 1,
          "created_utc": 1736210987.0,
          "replies": []
        },
        {
          "id": "m5smo04",
          "author": "harsh2193",
          "body": "As much as I like shitting on marketers, they don't decide these things.\n\nStuff like this comes from market analysts or product managers. Or leaders from those divisions who either believe in, or wanna cash in on, the AI hype train, mostly to appease shareholders.",
          "score": 1,
          "created_utc": 1736211473.0,
          "replies": []
        },
        {
          "id": "m5sp4pi",
          "author": "rusmo",
          "body": "Seeding a PC with something that will firehose all user activity on it to the mothership is a marketer’s wet dream. And then they’ll charge you a subscription fee to use it. And you’ll pay.",
          "score": 1,
          "created_utc": 1736212288.0,
          "replies": []
        },
        {
          "id": "m5sq5up",
          "author": "Borbit85",
          "body": "I've been hearing this term but my ancient thinkpad that is struggling to play a video while I'm browsing Reddit does just fine when I use ChatGPT.\n\nCan anyone ELI5 what is an AI-PC? Does it run the AI itself? It's all over the news how bad AI is for the environment because it uses insane amounts of compute power and energy. So I don't think it can run properly on a cheap laptop no?",
          "score": 1,
          "created_utc": 1736212637.0,
          "replies": []
        },
        {
          "id": "m5suz81",
          "author": "Bubba89",
          "body": "“We gave them no choices except stuff we branded with ‘AI’…and now look how much they’re buying AI!”",
          "score": 1,
          "created_utc": 1736214235.0,
          "replies": []
        },
        {
          "id": "m5svfwz",
          "author": "Jamothee",
          "body": "AI is just marketings latest darling buzzword.",
          "score": 1,
          "created_utc": 1736214389.0,
          "replies": []
        },
        {
          "id": "m5swxav",
          "author": "scottz657",
          "body": "As someone who has done sales at an electronics store, the latter. I had most customers give me an instant NO to the Copilot+ PCs when they came out last year.",
          "score": 1,
          "created_utc": 1736214892.0,
          "replies": []
        },
        {
          "id": "m5sy0fi",
          "author": "Nomad_Red",
          "body": "What exactly is the difference in hardware between AI and non-AI PC?",
          "score": 1,
          "created_utc": 1736215259.0,
          "replies": []
        },
        {
          "id": "m5t0i24",
          "author": "Prowler1000",
          "body": "I mean, I genuinely want more AI tools to run locally. Things like auto-correct/auto-complete on mobile could benefit from an (ironically) very small large language model.\n\nA laptop having real tensor compute power would also be great for things like spelling or grammar checking, translation, and even auto-captioning or transcribing.\n\nBut since most manufacturers (any?) don't have any sort of experience with custom silicon, let alone tensor processing and AI acceleration, the only \"AI\" they'll have will be what Intel/AMD/Nvidia include on their chips.",
          "score": 1,
          "created_utc": 1736216118.0,
          "replies": []
        },
        {
          "id": "m5t0sxf",
          "author": "kKiLnAgW",
          "body": "What id like to know is, wtf does putting “AI” in the chip even mean? I cannot be the only one. What advantage will AI bring to running x86 architecture?",
          "score": 1,
          "created_utc": 1736216224.0,
          "replies": [
            {
              "id": "m5tqj82",
              "author": "Stormfrosty",
              "body": "It’s this https://youtu.be/sJltBQ4MOHA. AI is just matmuls, which are just mathematical if statements.",
              "score": 2,
              "created_utc": 1736225837.0,
              "replies": [
                {
                  "id": "m5u2ms0",
                  "author": "kKiLnAgW",
                  "body": "Interesting, much thanks!",
                  "score": 1,
                  "created_utc": 1736231822.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m5t0tga",
          "author": "truethug",
          "body": "The sad thing is most of the “AI” is not done on the computer anyway. Like adobe cloud and ChatGPT.",
          "score": 1,
          "created_utc": 1736216230.0,
          "replies": []
        },
        {
          "id": "m5t5i9z",
          "author": "MillwrightTight",
          "body": "There are AI *vacuums* now. Ugh. Give it a rest",
          "score": 1,
          "created_utc": 1736217857.0,
          "replies": []
        },
        {
          "id": "m5t8e16",
          "author": "audigex",
          "body": "There are some useful things being done with AI but the vast majority right now is just whatever gimmicks they can shoe in\n\nSome of the photo stuff is cool (removing objects, expanding the background a bit), and some of it is arguably very useful (improved night mode on cameras, combining multiple photos so that nobody is blinking or looking away). Upscaling can be really quite impressive. There’s value there\n\nI can also see the value in transcribing a lecture, handwriting recognition etc, and live translation is promising, and there’s TONS of potential for relatively niche but incredibly valuable accessibility stuff (smart glasses reading train station signs for partially sighted people etc)\n\nBut a lot is just nonsense. Apple’s new “emails into 4 separate inbox streams”, for example, just makes it worse and I’ll die on this hill. Nor do I need my phone to guess at a summary of my notifications or emails and then try to guess which are most important… no, stop it. Similarly the smart focus stuff where it guesses which notifications to hide is even worse - it can hide important things\n\nImage generation and the writing from a prompt stuff… maybe occasionally useful for a placeholder image or text while prototyping but useless for anything important because you have to check and re-write it anyway\n\nI guess what I’m trying to say is that while I can see value in some of what AI is doing, it’s being shoved down our throats in gimmicky ways and I really don’t see consumers crying out for it. We’d much rather see it happening organically while retaining a focus on usability and quality",
          "score": 1,
          "created_utc": 1736218848.0,
          "replies": []
        },
        {
          "id": "m5tae3i",
          "author": "NizarNoor",
          "body": "It's a manufactured demand, not an organic one. It's what the big shareholders want to make happen. They've already placed big bets on AI being the next big thing for this/next generation of tech. They tried the same with VR last generation (10-15 years ago) but it didn't really catch on in a big way like they imagined.",
          "score": 1,
          "created_utc": 1736219554.0,
          "replies": []
        },
        {
          "id": "m5tbw2s",
          "author": "J_elias95",
          "body": "A re-branding nightmare for the consumer. Why do it? The AI PC has been a major flop. Why the change? The failure rate on Intel's 13th and 14th gen chips?",
          "score": 1,
          "created_utc": 1736220077.0,
          "replies": []
        },
        {
          "id": "m5tfztx",
          "author": "TirelessGuardian",
          "body": "What is an AI pc?",
          "score": 1,
          "created_utc": 1736221531.0,
          "replies": []
        },
        {
          "id": "m5th59y",
          "author": "toooutofplace",
          "body": "kinda like how everything in 2000 was \"X-TREME\" lol",
          "score": 1,
          "created_utc": 1736221967.0,
          "replies": []
        },
        {
          "id": "m5tod48",
          "author": "User1539",
          "body": "Honestly, I think it's going to be both. \n\nYes, the 'everything is AI' is bullshit. No one needs AI controlled seat warmers, even if there were such a thing. \n\nI do think your grandmother wants her computer to be able to work through an issue with her, like the Star Trek ship's computer. I honestly think that's where this is going, and I do honestly think people will like it when we get there. \n\nThis is a transition period, but when you can ask your computer 'Why aren't you seeing that second monitor that I just hooked up?' and have it actually make meaningful suggestions like 'Hmm ... let me check my settings to make sure I'm looking for a second monitor. Oh, I see it, but it's not turned on. Are you sure you plugged it in, and it's getting power?' and you reply 'Yes, the red light is on. It's definitely on.', and the computer says 'Are you sure that's a data cable and not just a charging cable? Maybe try another cable to be sure?', etc, etc ... because people find computers difficult, and having a little personality inside the computer, that will help use it, is probably going to take off once it gets good. \n\nHow many times have you looked at Photoshop, or GIMP, and thought 'How do I cut out this face and make the background transparent?'. Except now you'll literally just say 'Hey, computer, walk me through the process of cutting out this face and making the background behind it transparent', and it'll respond 'Okay, is this what you want?' then do it for you. \n\nThe 'skill' involved in using a computer could become entirely moot, when your computer is also its own assistant. \n\nI do think people actually want THAT, and that's why they're installing TPU chips in laptops. \n\nThe rest is bullshit. The hype is insane, and you just have to ignore it until we reach some equilibrium with what we actually want and what we can actually do.",
          "score": 1,
          "created_utc": 1736224900.0,
          "replies": []
        },
        {
          "id": "m5twg04",
          "author": "garry4321",
          "body": "I mean, it’s not a lie. It’s artificial intelligence. As in not real. It’s artificial features that aren’t actually real features. \n\nWhen you see artificial beef flavor, you ain’t getting any actual beef. It’s now just a legal term for lying.",
          "score": 1,
          "created_utc": 1736228590.0,
          "replies": []
        },
        {
          "id": "m5txecr",
          "author": "InverstNoob",
          "body": "It's the new HD/4k hype word",
          "score": 1,
          "created_utc": 1736229057.0,
          "replies": []
        },
        {
          "id": "m5txnkp",
          "author": "noobqns",
          "body": "To some degree yes, in the smartphone sphere   \n\nS23 > S24 went full on AI thing and despite the former being all Snapdragon SoC and S24 being a SD/Exynos split, S24 series had a good ~15% sale bump despite no other upgrade to the phone",
          "score": 1,
          "created_utc": 1736229183.0,
          "replies": []
        },
        {
          "id": "m5u0c5g",
          "author": "drfsupercenter",
          "body": "Yeah, nobody wants AI and I'm tired of pretending otherwise\n\nJust give me a laptop without that stupid copilot key",
          "score": 1,
          "created_utc": 1736230577.0,
          "replies": []
        },
        {
          "id": "m5u5lwg",
          "author": "Dickulture",
          "body": "So instead of XPS, Dell will start offering XAI?  /s",
          "score": 1,
          "created_utc": 1736233515.0,
          "replies": []
        },
        {
          "id": "m5u6v0c",
          "author": "Fickle_Competition33",
          "body": "Generative AI is groundbreaking, period. The problem is that only the technology is out there, and takes a while before people come up with really cool and innovative uses for it. However, companies want to capitalize on the term \"AI\" as much as possible and too soon ...",
          "score": 1,
          "created_utc": 1736234260.0,
          "replies": []
        },
        {
          "id": "m5u7b8s",
          "author": "snowflake37wao",
          "body": "Neither. Their AI models told them it would be a good idea. When pressed they didnt recognize “trust me bro” in reply was the AI hallucinating.",
          "score": 1,
          "created_utc": 1736234532.0,
          "replies": []
        },
        {
          "id": "m5ug4ec",
          "author": "nagi603",
          "body": "> Are consumers really clamoring for AI, or are marketers just convinced it makes them look cutting edge?\n\nThe marketers do not cater to consumers. They market towards clueless goldfish-memory shareholders.",
          "score": 1,
          "created_utc": 1736240132.0,
          "replies": []
        },
        {
          "id": "m5urdj5",
          "author": "thekernel",
          "body": "I personally love the copilot key where the right control used to be on my laptop that brings up copilot every time i hit it.",
          "score": 1,
          "created_utc": 1736247482.0,
          "replies": []
        },
        {
          "id": "m5utarn",
          "author": "Stahlin_dus_Trie",
          "body": "It is because the CEO and business type of people are always chasing the next big thing. They don't really understand any of it on a technical level but they hear AI often enough in their circles that they start thinking they really have to get on board in order to not miss out on the next big thing.\n\nThey exist in a weird bubble and have no idea what normal users want. I for example would be happy if my 1000$ super AI smart phone would ask me the day before a national holiday whether I really want to be woken up at 6am from my regular alarm clock. But I guess this fetaure is way too advanced for AI in 2025.",
          "score": 1,
          "created_utc": 1736248639.0,
          "replies": []
        },
        {
          "id": "m5utxf5",
          "author": "NotOSIsdormmole",
          "body": "Honestly I see AI in a product name and it makes me not want to buy it",
          "score": 1,
          "created_utc": 1736249004.0,
          "replies": []
        },
        {
          "id": "m5v04x5",
          "author": "Zeraphicus",
          "body": "I saw a post on here from someone at an \"ai company\".  They did not know anything what a patch panel was.   They said their entire company was sales.\n\nI dont know who is paying these people, I suspect its venture capital money.",
          "score": 1,
          "created_utc": 1736252322.0,
          "replies": []
        },
        {
          "id": "m5v13bw",
          "author": "Vaestmannaeyjar",
          "body": "I don't know, I recently bought an ARM Surface Laptop with AI labeling all over it... but all I wanted was a macbook quality build with Windows as an OS, and I got what I wanted. But I use the AI button like once a week at most.",
          "score": 1,
          "created_utc": 1736252790.0,
          "replies": []
        },
        {
          "id": "m5v9iol",
          "author": "KiNgPiN8T3",
          "body": "I believe we are at the top of the peak of the Gartner Hype Cycle at the moment. I for one look forward to the trough of disillusionment. (And then the point where we actually use AI for useful shit and not everything…)",
          "score": 1,
          "created_utc": 1736256484.0,
          "replies": []
        },
        {
          "id": "m5vfln7",
          "author": "epsilona01",
          "body": "> Are consumers really clamoring for AI, or are marketers just convinced it makes them look cutting edge?\n\nIt's the SMART TV of computers.",
          "score": 1,
          "created_utc": 1736258822.0,
          "replies": []
        },
        {
          "id": "m5vhhna",
          "author": "stew9703",
          "body": "Like with smart tvs more than likely theres some back end pay method (ads)",
          "score": 1,
          "created_utc": 1736259514.0,
          "replies": []
        },
        {
          "id": "m5wo0zk",
          "author": "theecommandeth",
          "body": "Dell, dell pro, dell pro max. Lol they are trying to pull away Apple users",
          "score": 1,
          "created_utc": 1736272606.0,
          "replies": []
        },
        {
          "id": "m5x1swu",
          "author": "MaleficentMachine154",
          "body": "In my final year of college last year, our lecturers made us \"implement AI in some capacity\" into our final year project because that's what was trending. Nevermind the fact we had never had a single class on AI, so yeah it's like this self fulfilling metastatic internal thing that idiots in industry keep feeding into because they're mid level management who need to be \"seen\" to keep up with current trends \n\nIt's fuckin infuriating",
          "score": 1,
          "created_utc": 1736276572.0,
          "replies": []
        },
        {
          "id": "m5sixe2",
          "author": "aldebxran",
          "body": "AI companies are scrambling to get AI everywhere they can so they can get a revenue stream from other companies because consumers can't give enough of a shit about AI to pay for it.",
          "score": 1,
          "created_utc": 1736210239.0,
          "replies": [
            {
              "id": "m5t600e",
              "author": "Pristine-Donkey4698",
              "body": "I pay for chatgpt and use it (secretly)  pretty much every day at work. There's plenty of people out there like me",
              "score": -1,
              "created_utc": 1736218028.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5shco5",
          "author": "casillero",
          "body": "Yes they are. YOU think AI is chatgpt.\n\nAI is working on blurring the background of your Teams and zoom video calls. m365 copilot is now AI. Windows Copilot is now AI. Say something like, how do I change my display settings to make it look sharper will lead you to where you can do that, eventually will do it itself, that is AI.  Say something like find that picture or where's this email, that's AI \n\nIt's not just chat stuff you ask on a website.\n\nThink of it as. A few years ago they added embedded chips to handle graphics. Now they have embedded chips that can handle 'ai tasks' and when they are doing AI stuff, they are complimenting your graphics. It's a win.",
          "score": -4,
          "created_utc": 1736209714.0,
          "replies": []
        },
        {
          "id": "m5sk8wz",
          "author": "None",
          "body": "![gif](giphy|RSOUOj8H9A3Xq)",
          "score": -1,
          "created_utc": 1736210674.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5ryhx0",
      "author": "retronintendo",
      "body": "Let's scrap our only product with a positive reputation!",
      "score": 1185,
      "created_utc": 1736203540.0,
      "replies": [
        {
          "id": "m5s0zw0",
          "author": "None",
          "body": "[deleted]",
          "score": 382,
          "created_utc": 1736204331.0,
          "replies": [
            {
              "id": "m5s7tml",
              "author": "Uncertn_Laaife",
              "body": "And being used only for the Word, Excel, and a browser.",
              "score": 89,
              "created_utc": 1736206560.0,
              "replies": [
                {
                  "id": "m5uftgl",
                  "author": "blazze_eternal",
                  "body": "With 8 gigs of ram that's all it's good for...",
                  "score": 17,
                  "created_utc": 1736239930.0,
                  "replies": [
                    {
                      "id": "m5xqp3k",
                      "author": "seamus_quigley",
                      "body": "8 gigs is not good for Excel use.",
                      "score": 1,
                      "created_utc": 1736283759.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5vcpfh",
                  "author": "tacojohn48",
                  "body": "That's like 99% of corporate PCs.",
                  "score": 3,
                  "created_utc": 1736257732.0,
                  "replies": [
                    {
                      "id": "m5wwkue",
                      "author": "ineververify",
                      "body": "Nah corporate bulk buys optiplex and latitude.  3 year lease or swapped out before warranty expires.",
                      "score": 1,
                      "created_utc": 1736275081.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5s9qd8",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -1,
                  "created_utc": 1736207194.0,
                  "replies": [
                    {
                      "id": "m5seu3n",
                      "author": "fattmann",
                      "body": "Working for one of the largest public water utilities in the United States - yeah, there's maybe two departments that are relying on one or two other enterprise software.",
                      "score": 5,
                      "created_utc": 1736208885.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5w4c3i",
              "author": "_TechFTW_",
              "body": "Hold on there's no i7 anymore, it's core ultra 7, Intel nuked their best known product name too",
              "score": 9,
              "created_utc": 1736266844.0,
              "replies": []
            },
            {
              "id": "m5tl9ef",
              "author": "another_design",
              "body": "Can I get a v6 turbo in that thing?",
              "score": 4,
              "created_utc": 1736223590.0,
              "replies": []
            },
            {
              "id": "m5z3yxx",
              "author": "dlepi24",
              "body": "Don't forget the Pro Plan Plus!",
              "score": 2,
              "created_utc": 1736299178.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5tw0bf",
          "author": "mr_bots",
          "body": "Read the article. They’re scrapping the name XPS along with Inspiron, Precision, and Latitude. Going to be: Dell, Dell Pro, and Dell Pro Max now. Seems the tech industry is just on a market naming change bandwagon this year.",
          "score": 52,
          "created_utc": 1736228376.0,
          "replies": [
            {
              "id": "m5v9o2q",
              "author": "Jusanden",
              "body": "If not for brand recognition, that naming scheme does actually make more sense. \n\nI’m not all that familiar with dells lineup and I couldn’t tell you which old brand was supposed to be better than the other. But it’s obvious with the rebrand.",
              "score": 19,
              "created_utc": 1736256544.0,
              "replies": [
                {
                  "id": "m5vvwip",
                  "author": "AnticitizenPrime",
                  "body": "What the hell did 'XPS' mean in the first place?\n\nEveryone in this thread is acting like this is some stupid idea but I had no idea what any of the names mean anyway.",
                  "score": 8,
                  "created_utc": 1736264307.0,
                  "replies": [
                    {
                      "id": "m5w14h6",
                      "author": "Malvania",
                      "body": "Extreme Performance System. It was their high-end laptops.",
                      "score": 1,
                      "created_utc": 1736265885.0,
                      "replies": [
                        {
                          "id": "m61zrlk",
                          "author": "PancAshAsh",
                          "body": "The funny thing is Dell's build quality is so bad now they aren't even reliably good laptops.",
                          "score": 1,
                          "created_utc": 1736347479.0,
                          "replies": [
                            {
                              "id": "m627so9",
                              "author": "mr_bots",
                              "body": "Does anyone have reliably good laptops on the windows side? They all feel cheap and poorly put together and under any load are hair dryers running near 100C. My new ThinkPad feels fine but has been in service more than I’ve used it. My ROG Ally has been fine and feels fine but kind of hard and small to use as a laptop.",
                              "score": 2,
                              "created_utc": 1736350088.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m5vo62s",
                  "author": "CharlesP2009",
                  "body": "Good old corporations following each other around. The naming scheme is very much like Apple’s for their phones. \n\nKinda like streaming services doing the “+” thing.",
                  "score": 5,
                  "created_utc": 1736261831.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m66l4v6",
              "author": "seitung",
              "body": "Dell\n\n*we can be boring as shit too*",
              "score": 1,
              "created_utc": 1736401488.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5sh4ib",
          "author": "None",
          "body": "Lol real, Dell just became HP. No good products, just relying on the brand name.",
          "score": 77,
          "created_utc": 1736209640.0,
          "replies": [
            {
              "id": "m5sicbu",
              "author": "ShiftyThePirate",
              "body": "I mean...HP is better than Dell at this moment, which is weird to say. Old XPS were insanely good, I even have an old XPS 12 from like...jesus 2006? Once they bought out Alienware it seemed like XPS just went to shit, and so did Alienware, which wasn't that good to start with.",
              "score": 53,
              "created_utc": 1736210045.0,
              "replies": [
                {
                  "id": "m5sj9jt",
                  "author": "AtomicSymphonic_2nd",
                  "body": "Alienware’s laptops have made good improvements IMHO. In comparison to Asus, which has sunk on reliability recently.",
                  "score": 15,
                  "created_utc": 1736210349.0,
                  "replies": [
                    {
                      "id": "m5u5c1l",
                      "author": "-IoI-",
                      "body": "I'm less inclined to agree with you after my shit day working on an Alienware X14 R2",
                      "score": 11,
                      "created_utc": 1736233355.0,
                      "replies": []
                    },
                    {
                      "id": "m5v8q8i",
                      "author": "chrislomax83",
                      "body": "I was always a massive advocate for XPS and they were great machines. \n\nThat was until one year, around 2016, I bought a top of the range XPS for work and I had some issues with the fan. \n\nI could physically hear the fan hitting the shell of the machine. I went through so much support and they determined…it was a software issue. \n\nAbout a month back and forward and they finally take it back into repair and installed a new fan. \n\nAbout 2 months later, the mouse button wouldn’t click down. Again…software issue. Like seriously, I physically cannot press the mouse down. \n\nAnother month and they take it back into repair. \n\nAll this time, I’m waiting weeks for them to send it back in a fixed state so I’m relying on old hardware. \n\nWhen the screen finally went then I couldn’t be bothered with it anymore and got a new machine. Opted for XPS again in my stupidity putting it down to a bad build. \n\nI stopped using DELL after that when I went to price up a new one and they’d doubled in price. God knows if that meant they’d doubled in build quality or just sticking the same old crap in for a higher markup.",
                      "score": 8,
                      "created_utc": 1736256168.0,
                      "replies": [
                        {
                          "id": "m5xuzy7",
                          "author": "AtomicSymphonic_2nd",
                          "body": "I hear ya on that!! I’m wondering if there’s any brand of laptop that is reliable today at this point. I know there’s Frameworks and maybe System76, but those tend to be laptops for Linux.\n\nMaybe Lenovo is good?",
                          "score": 1,
                          "created_utc": 1736284989.0,
                          "replies": [
                            {
                              "id": "m5xx2ur",
                              "author": "chrislomax83",
                              "body": "I’m a dev, I made the jump to Mac when I could. \n\nIt’s not ideal as my office desktop is a PC and I have to switch between operating systems but Mac does a good job to be honest. \n\nOnce it’s all setup, I very rarely have to fix anything on it. \n\nI’ve had my M1 for about 3 years now, the battery life is still fantastic, I don’t have any issues with speed, build quality is pretty good. I got Apple Care when I bought it for any issues that arise. \n\nMy go to laptops used to be: Lenovo (until it was bought out), Dell (until they went crap). \n\nI really wouldn’t know where to turn to these days though for a Microsoft laptop",
                              "score": 1,
                              "created_utc": 1736285588.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m7b37mq",
                          "author": "1doughnut",
                          "body": "I'm 100% with you. I've been with dell for 20yrs now, all the way back to my high school days. Back then, \"customization\" was actually that, and the builds were reliable. Fast forward to today and my brand new 8960 which developed BIOS issues within a month of regular use (no weird programs, etc).   \n  \nDell: Did you install 3rd party hardware?   \nMe: Yes, I added a Samsung 990 PRO  \nDell: Oh, well that's not compatible with your dell, so you need to talk to them  \nMe: My XPS isn't compatible with one of the highest rated makes/models of SSD on the market? And this is somehow relating to the BIOS?  \nDell: Correct\n\nI then remove the SSD and call again:  \nDell: Oh, that's a software issue.   \nMe: Windows BIOS is considered a software issue?  \nDell: Yes. You can pay an extra $200 to upgrade your support, and then we'll look at it.\n\nYeah.",
                          "score": 1,
                          "created_utc": 1736963823.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m5vd6fc",
                      "author": "TryingT0Wr1t3",
                      "body": "I agree with the part that ASUS quality sunked.",
                      "score": 2,
                      "created_utc": 1736257914.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5ssulw",
                  "author": "MisterSnippy",
                  "body": "I always went XPS as a prebuilt and then upgraded. They had some genuinely solid stuff to build off of without having to build an entire computer.",
                  "score": 7,
                  "created_utc": 1736213526.0,
                  "replies": [
                    {
                      "id": "m5ta1th",
                      "author": "blamenixon",
                      "body": "Same goes for the old Studio line. Back in 2010, I found one on Craigslist for less than $100 and eventually swapped out everything but the screen. Even bought an upgraded motherboard with an i7. \"FrankenDell\" unfortunately bit the dust last year and I haven't gotten around to figuring out what the fix is.",
                      "score": 6,
                      "created_utc": 1736219433.0,
                      "replies": []
                    },
                    {
                      "id": "m5u61rg",
                      "author": "anethma",
                      "body": "You make it sound like you have to part the red sea to get a computer build. \n\nIt takes like ten minutes in a normal sized case. 30 in SFF. \n\nNot really saving much time or effort getting prebuilt quality parts to build off of.",
                      "score": 1,
                      "created_utc": 1736233777.0,
                      "replies": [
                        {
                          "id": "m5ye8iu",
                          "author": "ShiftyThePirate",
                          "body": "Sorry, if I give you a cpu, cooler, gpu, ram, ssd, another ssd, a psu, a case, maybe some stupid lighting, and a motherboard you can get it up and running in ten minutes? Let alone, 30? I call bullshit.",
                          "score": 1,
                          "created_utc": 1736290735.0,
                          "replies": [
                            {
                              "id": "m5zipz8",
                              "author": "anethma",
                              "body": "In a full sized case? Sure. Plop the CPU in, snap/screw the cooler on it, snap the ram in, screw the mobo into the case, snap in the video card and 1-2 screws, nvme and 1 screw, plug in the front cables, install psu 4 screws and plug in the 4 cables. Throw in any extra fans but often cases just come with em. A little longer if your cooler is a liquid cooler. \n\nMAYBE it would be 15. Build my SFF case (Dan A4 H20) which was maybe a billion times more fiddly and it took 30-40 minutes. \n\nEither way, give it an hour if you need a crazy amount of time. That is an hour every 2-4 years you need to do it, it really isn't that hard and certainly not worth getting Dell OEM parts.",
                              "score": 1,
                              "created_utc": 1736304250.0,
                              "replies": [
                                {
                                  "id": "m5zucny",
                                  "author": "ShiftyThePirate",
                                  "body": "An hour sounds better, 15 minutes is a damn lie, unless you know the layout of the case and do the same components all the time. There is \\*always\\* a factor when it comes to building a computer that you might not get, so don't be basic about it and make it sound that \\*easy.\\* Because you are lying to every PC builder. Did you even think of the other screws you need to base-plate the mother board, and even off-set the CPU? You mentioned a few screws and are missing about 14 others, with adjustment.",
                                  "score": 1,
                                  "created_utc": 1736308509.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m5w8msh",
                  "author": "ChoMar05",
                  "body": "HP has Printers, which really impact the brand negatively.  Unless Dell branches into seal clubbing and integrates it in their user experience, I think HP is still seen an worst company for professional equipment.",
                  "score": 1,
                  "created_utc": 1736268113.0,
                  "replies": []
                },
                {
                  "id": "m8lwnv8",
                  "author": "niceguy_eac",
                  "body": "What laptops would you recommend these days that are very capable of high demand activity eg video editing etc",
                  "score": 1,
                  "created_utc": 1737580273.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5vy48c",
              "author": "AintNobody-",
              "body": "On the consumer end. Precision business machines are very good.",
              "score": 1,
              "created_utc": 1736264980.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5s834b",
          "author": "NickCharlesYT",
          "body": "Dell hasn't had much of a positive reputation even on XPS machines for a while now, unfortunately. There was a time when Dell was the first brand I looked towards in laptops. Now? Forget it, I wouldn't want a new one if they were the last laptop brand on earth...",
          "score": 47,
          "created_utc": 1736206649.0,
          "replies": [
            {
              "id": "m5sjtt9",
              "author": "MysteriousDesk3",
              "body": "They still get good reviews in tech media, which is where most of the positive reputation comes from.",
              "score": 10,
              "created_utc": 1736210535.0,
              "replies": []
            },
            {
              "id": "m5tiq46",
              "author": "koleke415",
              "body": "I got an XPS 15 laptop in 2022 and it's still amazing, the body is strong and sleek, runs super well, no issues at all, best laptop ive ever had. Not saying I'll buy another one (obviously I can't if XPS's are dead) but everything i looked up at the time, including recommendations from an IT friend pointed me towards what I got and it's been a great choice.",
              "score": 10,
              "created_utc": 1736222577.0,
              "replies": [
                {
                  "id": "m5tjqam",
                  "author": "NickCharlesYT",
                  "body": "I'm glad you had a positive experience, obviously not everyone has the same deal I did. I think what I found through my own research after the fact is essentially their top end spec is too much for their designs, and they're forced to limit power and thermals also suffer as a result. But this would be consistent for any laptop with the same hardware and a similar thermal design. My problem stemmed from the fact that they advertised the full performance of the i9 chip and gpu I bought instead of the actual performance of the machine, and furthermore they provided very inaccurate battery life metrics claiming \"up to 9 hours\" while the reality was you could sit idle at a web browser and run the battery completely out in just 2. There was literally no way to even get half the advertised battery life with their top spec, yet their *dedicated page* for that model made the same claims.\n\nMy last good PC was a Dell XPS 8300 tower, so it's not like I went into the XPS laptop expecting it to be bad, in fact quite the opposite. I just didn't get what was marketed to me and what I therefore expected of the machine and it didn't fit my use case as a result. The final nail in the coffin for me though was their complete disregard support wise. The support team I worked with did not try to find a solution, nor did they offer an exchange or refund for what could only be two possibilities: a defective laptop, or an obvious case of false advertising. They tried to spin it the other way and blame me for apparently believing their own specs and performance metrics. I don't take kindly to that, so dell is now on my shit list until further notice and they will not be getting any more money from me...",
                  "score": 1,
                  "created_utc": 1736222971.0,
                  "replies": [
                    {
                      "id": "m5tk6ka",
                      "author": "koleke415",
                      "body": "Weird, I have an i7 and 3080ti in mine, 4k touchscreen and the battery still lasts 3 or 4 hours of watching shows or even longer if I'm just browsing. It runs most games really well too, not at full settings, but I've played every from gta5, Forza horizon 5, diablo 4 and more and with no issues as long as I don't expect to play ultra on everything.",
                      "score": 3,
                      "created_utc": 1736223153.0,
                      "replies": [
                        {
                          "id": "m5tkbz2",
                          "author": "NickCharlesYT",
                          "body": "Not here. I think the best battery life I ever got was just over 2 hours for light web browsing. For gaming it lasted less than an hour, provided it survived the first few seconds without a power limit shutdown first. I believe that specific unit was borked, but I never got a chance to try a replacement because Dell's support utterly failed me on that.",
                          "score": 2,
                          "created_utc": 1736223214.0,
                          "replies": [
                            {
                              "id": "m5tkhz8",
                              "author": "koleke415",
                              "body": "I don't even bother to game with it unplugged, I don't expect that to last long. When I first got it it would last like 7 or 8 hours for simple browsing and videos, and now it's closer to 3 or 4, but still pretty good as far as I'm concerned",
                              "score": 2,
                              "created_utc": 1736223282.0,
                              "replies": [
                                {
                                  "id": "m5tkssi",
                                  "author": "NickCharlesYT",
                                  "body": "I can do gaming on battery just fine on my MBP now, so at least somebody figured it out. Just never expected it to be Apple lol. Played some transport fever 2 the other day and it lasted nearly 3 hours, from 80% because I forgot to charge it before I left. The crazy thing is I have the \"worst\" MBP for this too - the 14\" with the binned M4 Max, meaning there's only a 74wh battery powering their second most powerful soc. Most recommend you go to the 16x for the 100whr battery, but I need it to fit in my bag so 14\" as the only option, and I needed the max chip for it's dual media engines. Been pleasantly surprised so far. Granted I don't do crazy AAA titles or anything but I didn't on the XPS either and, well, I already explained those results...",
                                  "score": 2,
                                  "created_utc": 1736223404.0,
                                  "replies": [
                                    {
                                      "id": "m5tl5re",
                                      "author": "koleke415",
                                      "body": "Yeah but how many games can you even play on a Mac? Plus I have never hated anything as much as I hate Mac OS. Not saying mac's are bad computers, but they're overpriced as hell, can't stand the OS, closed ecosystem and limit software. Just me though, lots of people love them",
                                      "score": 2,
                                      "created_utc": 1736223548.0,
                                      "replies": [
                                        {
                                          "id": "m5tlc27",
                                          "author": "None",
                                          "body": "[removed]",
                                          "score": 1,
                                          "created_utc": 1736223620.0,
                                          "replies": [
                                            {
                                              "id": "m5tlek1",
                                              "author": "koleke415",
                                              "body": "Fair enough!",
                                              "score": 1,
                                              "created_utc": 1736223648.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5ssvdh",
              "author": "mindracer",
              "body": "I have dell XPS 13 and 15 and we all have dell latitudes at work.  Knock on wood no one has any problems. I love my xps'es, your opinion is crazy to me",
              "score": 39,
              "created_utc": 1736213533.0,
              "replies": [
                {
                  "id": "m5sty0j",
                  "author": "NickCharlesYT",
                  "body": "My last XPS gave me nothing but problems, constant issues with power limit throttling even when plugged in, and it would shut itself off if I tried to do anything intensive on it on battery. Dell support told me it was \"normal\" and essentially told me not to use my laptop on battery. That's what I get for buying their top end i9 machine with an upgraded GPU I guess. Didn't make that mistake again, bought a macbook pro with the M4 Max the next time around. It gives me no hardware problems, just have to deal with the OS now which I'm personally not a fan of...",
                  "score": 18,
                  "created_utc": 1736213891.0,
                  "replies": [
                    {
                      "id": "m5thw9i",
                      "author": "TheGreenMileMouse",
                      "body": "Our xps have been an expensive nightmare. Same issues, over heating, can’t even run google sheets without freezing, battery life is an hour.",
                      "score": 9,
                      "created_utc": 1736222258.0,
                      "replies": [
                        {
                          "id": "m5u1a7s",
                          "author": "cowabungass",
                          "body": "This sounds like an old one they used to have.  I forget which model but my buddy had one in 2012.  There was two components at fault.  One inside the charging brick for the laptop and one onboard.  Turned out it was the chip on his board and he got a free motherboard replacement, broke a clip on install and so he got a free bezel too.\n\nedit - Forgot to mention the onboard chip was causing it to not realize it was charging or something of that nature and it caused odd issues while running.  Very similar to yours and OP.",
                          "score": 1,
                          "created_utc": 1736231083.0,
                          "replies": [
                            {
                              "id": "m5vn5bi",
                              "author": "NickCharlesYT",
                              "body": "This was a model from last year. I actually had to sell it for parts while *under warranty* because Dell's support refused to acknowledge the issue and tried to gaslight me. I ultimately gave up on it.",
                              "score": 1,
                              "created_utc": 1736261491.0,
                              "replies": [
                                {
                                  "id": "m8ttfed",
                                  "author": "cowabungass",
                                  "body": "I firmly believe that specific chip was unnecessary and only served to produce repairs.",
                                  "score": 1,
                                  "created_utc": 1737679444.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m5u4snw",
                  "author": "ralphonsob",
                  "body": "I am always confused by what the differences are supposed to be between the Precision/Latitude and XPS ranges. I know the former are targeted at companies and the latter at private buyers ... but, why? Some weird differences with touch screen technologies, making stylus purchases difficult, but what else? And, why? Just, why?",
                  "score": 1,
                  "created_utc": 1736233044.0,
                  "replies": []
                },
                {
                  "id": "m5ui717",
                  "author": "Javimoran",
                  "body": "I've been 5 years now with an XPS 13 for work (mind you we got these because they used to have Linux support and you could get them with Ubuntu pre installed) and except for having to replace the battery, It has been great.",
                  "score": 1,
                  "created_utc": 1736241515.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5sqk1p",
              "author": "Flimzes",
              "body": "Dell made really godawful laptops for many many years, then they made mediocre laptops with a few gems sprinkled in.\nThe xps line was the star since they introduced it, and it is a shame to see them go.",
              "score": 7,
              "created_utc": 1736212768.0,
              "replies": []
            },
            {
              "id": "m5t1uc1",
              "author": "I_AmA_Zebra",
              "body": "What’s your go to?",
              "score": 1,
              "created_utc": 1736216585.0,
              "replies": [
                {
                  "id": "m5t6w8b",
                  "author": "NickCharlesYT",
                  "body": "I was forced to switch to apple after researching pretty much everything on the market and coming to the conclusion that there just wasn't a \"great\" windows laptop that had both high power components AND good battery life. I bought their M4 Max MBP late last year. Thankfully most of what I need it for (video editing and audio production on the go) is just compatible. I also play games in my downtime, and there's *enough* support for games I own to enjoy on a flight, for example. But I am NOT a fan of their OS in general...",
                  "score": 0,
                  "created_utc": 1736218336.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5tjb7p",
              "author": "pandaSmore",
              "body": "Gives a whole new meaning to\n\n![gif](giphy|Akry6V17RGH60)",
              "score": 1,
              "created_utc": 1736222806.0,
              "replies": []
            },
            {
              "id": "m5tzmwb",
              "author": "Pitiful-Climate8977",
              "body": "Their market is corporations that buy new laptops every 2-3 years",
              "score": 1,
              "created_utc": 1736230203.0,
              "replies": []
            },
            {
              "id": "m5v646z",
              "author": "f700es",
              "body": "Dell XPS 8950 desktop here. Rock solid and zero issues.",
              "score": 1,
              "created_utc": 1736255073.0,
              "replies": []
            },
            {
              "id": "m5vavlm",
              "author": "chewytime",
              "body": "Hmm. What happened? I had been using a XPS as my main computer for the last decade but had to replace it a couple of months ago bc the battery drained too quickly and heated up way too much. I remember back in the day it was like the unanimous top Windows laptop for years. When I went researching this time it was on like no one’s list.",
              "score": 1,
              "created_utc": 1736257025.0,
              "replies": []
            },
            {
              "id": "m5vjt75",
              "author": "cocktails4",
              "body": "At least their monitors are still good...for now.",
              "score": 1,
              "created_utc": 1736260339.0,
              "replies": []
            },
            {
              "id": "m5w077h",
              "author": "Funny_Alternative_55",
              "body": "The only laptops I buy at this are business ones (Thinkpads or Latitudes) cause at least they put a damn metal frame in there. I’ve had to epoxy at least three laptops together due to the plastic chassis cracking after only a year or so of use.",
              "score": 1,
              "created_utc": 1736265606.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5sqpx0",
          "author": "None",
          "body": "[deleted]",
          "score": 10,
          "created_utc": 1736212822.0,
          "replies": [
            {
              "id": "m5srf6m",
              "author": "Viper67857",
              "body": "\"Repair\" meaning get rid of the viruses he got from clicking ads on porn sites? Just teach dad how to factory restore from the backup partition. 😂",
              "score": -8,
              "created_utc": 1736213056.0,
              "replies": [
                {
                  "id": "m5srko1",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 10,
                  "created_utc": 1736213106.0,
                  "replies": [
                    {
                      "id": "m5vxyn4",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -1,
                      "created_utc": 1736264934.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m5tj2wg",
          "author": "pandaSmore",
          "body": "Don't the latitudes have a positive reputation?",
          "score": 1,
          "created_utc": 1736222716.0,
          "replies": []
        },
        {
          "id": "m5tzblo",
          "author": "Randyd718",
          "body": "Aren't their monitors well regarded?",
          "score": 1,
          "created_utc": 1736230039.0,
          "replies": []
        },
        {
          "id": "m5u34kt",
          "author": "Radulno",
          "body": "Also let's simply our lines by making it even more confusing. Like seriously do they think that shit is clear?",
          "score": 1,
          "created_utc": 1736232099.0,
          "replies": []
        },
        {
          "id": "m5uyil4",
          "author": "None",
          "body": "I don’t understand why it’s got a good reputation. I have a work issued XPS and half the time it doesn’t recognize its own battery.",
          "score": 1,
          "created_utc": 1736251507.0,
          "replies": []
        },
        {
          "id": "m5vu1sv",
          "author": "Neovison_vison",
          "body": "They were terrible, thermal management was always horrible due to premium-ness, fork over function. So they would bake themselves slowly till every component fried",
          "score": 1,
          "created_utc": 1736263726.0,
          "replies": []
        },
        {
          "id": "m5xiicn",
          "author": "deef1ve",
          "body": "Seriously! Great laptops. WTF?",
          "score": 1,
          "created_utc": 1736281430.0,
          "replies": []
        },
        {
          "id": "m5suq98",
          "author": "FastRedPonyCar",
          "body": "The Precision notebooks were better honestly. They were basically XPS’s with more usable ports and more configurable options.\n\nWe bought about half a dozen of each the last couple years and while we never had problems from the XPS’s, the extra ports and higher end CPU options on the precisions came in handy for several users.",
          "score": 1,
          "created_utc": 1736214151.0,
          "replies": []
        },
        {
          "id": "m5tfiqs",
          "author": "zap_p25",
          "body": "XPS, positive? First time I’ve ever heard that…because the XPS line has always been junk.",
          "score": -5,
          "created_utc": 1736221359.0,
          "replies": []
        },
        {
          "id": "m5s1xyi",
          "author": "None",
          "body": "[removed]",
          "score": -66,
          "created_utc": 1736204635.0,
          "replies": [
            {
              "id": "m5s2ldo",
              "author": "EngineeringNo753",
              "body": "He didn't say it was worth the money, he said the XPS line has a positive rep.",
              "score": 29,
              "created_utc": 1736204847.0,
              "replies": [
                {
                  "id": "m5s3371",
                  "author": "meowmeowsss",
                  "body": "No it doesn't. \n\n\nIt's paid reviews and some who have never owned a pc because they can't afford one.\n\n\nAny person who cam build their own pc will agree, any person who can't afford a pc with decent credit will always leave a positive review because it feels like they got something better than what it's worth.\n\n\nTo add to this you'd be amazed what Dell (and other companies) will pay to remove negative reviews .",
                  "score": -60,
                  "created_utc": 1736205005.0,
                  "replies": [
                    {
                      "id": "m5s5mi9",
                      "author": "EngineeringNo753",
                      "body": "Why are you comparing a laptop,which has a great rep as a business laptop, to building a desktop PC lmao.\n\nYou about to rock up to a business meeting with your desktop? Stop being dumb.",
                      "score": 29,
                      "created_utc": 1736205830.0,
                      "replies": [
                        {
                          "id": "m5s8oft",
                          "author": "meowmeowsss",
                          "body": "They are both the samething you idiot. Laptops are only upgradable so much but they are all trash coming from dell. I'm sorry you can't understand this.",
                          "score": -42,
                          "created_utc": 1736206845.0,
                          "replies": [
                            {
                              "id": "m5sg8ug",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 11,
                              "created_utc": 1736209350.0,
                              "replies": [
                                {
                                  "id": "m5sjq3q",
                                  "author": "meowmeowsss",
                                  "body": "I'm sorry your having regrets now. \n\n\nEnjoy your over priced crap.",
                                  "score": -7,
                                  "created_utc": 1736210501.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m5swmoi",
                              "author": "EngineeringNo753",
                              "body": "So every single business also used to use Thinkpads, are they also trash? Because they moved from Thinkpads to XPS. \n\nI have zero clue why you are so angry over such an obvious thing lmao",
                              "score": 2,
                              "created_utc": 1736214792.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5s3vj4",
              "author": "frosted_mango_",
              "body": "Calm the fuck down princess.",
              "score": 22,
              "created_utc": 1736205260.0,
              "replies": []
            },
            {
              "id": "m5s4mdj",
              "author": "narwhal_breeder",
              "body": "The XPS laptops were genuinely nice pieces of kit when I used them professionally, but that was 4 years ago.   \n\"YoU CaN BuILD a DEsKToP FoR LeSS MonEY\" Lmao no shit.",
              "score": 19,
              "created_utc": 1736205502.0,
              "replies": []
            },
            {
              "id": "m5s2xaq",
              "author": "BatHickey",
              "body": "*you’re",
              "score": 10,
              "created_utc": 1736204952.0,
              "replies": []
            },
            {
              "id": "m5tva3z",
              "author": "JournalistExpress292",
              "body": "I bought a Dell XPS 13 PLUS last year and it has been spectacular. My only issue is heat and battery life. I will say I am surprised at how easy it is to change the battery, great to know I can keep this laptop running for years on end, very sustainable which I like.  Also, the design is awesome.",
              "score": 1,
              "created_utc": 1736228025.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m5rxarz",
      "author": "GrimeyCoral",
      "body": "Ah yes, I can’t wait for my new Dell Pro Max Premium 17! I can’t believe you still have the Dell Pro Plus 16",
      "score": 186,
      "created_utc": 1736203163.0,
      "replies": [
        {
          "id": "m5stliw",
          "author": "retro_slouch",
          "body": "Oh boy I sure hope it's made with the lowest grade consumer plastics known to man",
          "score": 42,
          "created_utc": 1736213775.0,
          "replies": [
            {
              "id": "m5u2d62",
              "author": "P1h3r1e3d13",
              "body": "A Dell-contracted repair tech told me, while disassembling my Inspiron E1705 (same chassis as OG XPS):  \n“If it doesn't snap, crackle, and pop, it's not a Dell!”",
              "score": 29,
              "created_utc": 1736231674.0,
              "replies": [
                {
                  "id": "m5u2zns",
                  "author": "retro_slouch",
                  "body": "Incredible.",
                  "score": 4,
                  "created_utc": 1736232021.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m5u2hja",
          "author": "P1h3r1e3d13",
          "body": "But is the Dell Pro Premium actually better than the Dell Pro Max Plus?",
          "score": 1,
          "created_utc": 1736231742.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5s4iln",
      "author": "OrbitalHangover",
      "body": "Dell, Dell Pro, Dell Pro Max sounds awfully similar to M4, M4 Pro, M4 Max (branding used for all Apple Silicon series).\n\nApple also has an Ultra branding, so Dell better get onto that pronto.",
      "score": 170,
      "created_utc": 1736205468.0,
      "replies": [
        {
          "id": "m5tzmoe",
          "author": "dakotanorth8",
          "body": "Still better than Sony product naming conventions.",
          "score": 11,
          "created_utc": 1736230200.0,
          "replies": [
            {
              "id": "m5vkt7r",
              "author": "cocktails4",
              "body": "I own a lot of Sony stuff and yeh...the naming is usually not great. Headphones in particular. WF-1000XM5 and WH-1000XM5, which is the earbud and which is the over the ear? Fuck if I can remember, and I own one of them.\n\nAt least their cameras are reasonably named. Or at least no worse than anybody else.",
              "score": 18,
              "created_utc": 1736260693.0,
              "replies": [
                {
                  "id": "m5yuf8e",
                  "author": "someguy7734206",
                  "body": "Their game consoles are better named than Microsoft's, at least.",
                  "score": 2,
                  "created_utc": 1736296028.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m5wh4bo",
          "author": "Beetin",
          "body": "This was redacted for privacy reasons",
          "score": 1,
          "created_utc": 1736270605.0,
          "replies": []
        },
        {
          "id": "m5s685d",
          "author": "haarschmuck",
          "body": "Apple has zero legal/trademark claim to any of those words.",
          "score": -43,
          "created_utc": 1736206030.0,
          "replies": [
            {
              "id": "m5s6fd3",
              "author": "OrbitalHangover",
              "body": "I didn't say they have a trademark. I did however imply it's lame to copy someones branding.",
              "score": 63,
              "created_utc": 1736206097.0,
              "replies": [
                {
                  "id": "m5u3anb",
                  "author": "Radulno",
                  "body": "They don't though, it doesn't even really work like that. Dell Pro aren't necessary superior to Dell (just that). And you got Base, Plus, Premium model inside each line and different sizes.\n\nIt's a confusing mess lol",
                  "score": 1,
                  "created_utc": 1736232192.0,
                  "replies": [
                    {
                      "id": "m5u51bb",
                      "author": "OrbitalHangover",
                      "body": "Lfmao https://www.engadget.com/computing/dell-dumps-its-pc-brands-to-be-more-like-apple-194524781.html",
                      "score": 2,
                      "created_utc": 1736233184.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5tz9su",
                  "author": "GoldElectric",
                  "body": "apple isnt the first to use the \"pro\" branding though",
                  "score": -6,
                  "created_utc": 1736230013.0,
                  "replies": [
                    {
                      "id": "m5u4x4n",
                      "author": "OrbitalHangover",
                      "body": "its not about “pro”. It’s about 3 names - standard (no name), pro, and max. If you can’t see that is identical to apple’s AS naming, then I don’t know what else to say. \n\nI mean it’s blatantly obvious. Engadget even said it directly to Michael Dell’s face.\nhttps://www.engadget.com/computing/dell-dumps-its-pc-brands-to-be-more-like-apple-194524781.html",
                      "score": 5,
                      "created_utc": 1736233117.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5s79xv",
              "author": "HeKnee",
              "body": "Wouldnt it be confusing if all car models were some similar variation instead of giving them names?  I hate lexus numbering, love the toyota naming.",
              "score": 12,
              "created_utc": 1736206379.0,
              "replies": [
                {
                  "id": "m5s7spw",
                  "author": "OrbitalHangover",
                  "body": "Toyota Rav4 Pro Max Ultra 2025 air?",
                  "score": 8,
                  "created_utc": 1736206551.0,
                  "replies": []
                },
                {
                  "id": "m5sic1k",
                  "author": "ryushiblade",
                  "body": "Toyota bZ4X, baby!",
                  "score": 3,
                  "created_utc": 1736210042.0,
                  "replies": [
                    {
                      "id": "m5ssx2i",
                      "author": "HeKnee",
                      "body": "You mean the brz?  The gt?  Gt86?",
                      "score": 0,
                      "created_utc": 1736213549.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m5s1itq",
      "author": "pressedbread",
      "body": "At least we now know how bad things have been at XPS department to come out with the last iteration of XPS 13... They replaced the top keyboard row with a touchpad, Non-mechanical keys for Esc and Delete and F row.  This was non-starters for anyone that actually uses their computer for work.\n\nSo what does an XPS user buy now?   Microsoft Surface?",
      "score": 341,
      "created_utc": 1736204499.0,
      "replies": [
        {
          "id": "m5sgatf",
          "author": "mycroft-holmie",
          "body": "That touchpad for the function keys blew my mind. How did they make the same OBVIOUS mistake Apple made with the Touch Bar? It did work for Apple. Why the eff would Dell expect it would work for them 5 years later?\n\n(Edit: omg. Some day I’ll manage to write something that doesn’t have obvious typos. 🤦‍♂️)",
          "score": 201,
          "created_utc": 1736209367.0,
          "replies": [
            {
              "id": "m5sj1qw",
              "author": "tofu_b3a5t",
              "body": "🤚n’t✋\n\nExcuse me stranger, but I think you dropped this.\n\n\nAs for Dell, I think they dropped this \n🤚🧠✋",
              "score": 164,
              "created_utc": 1736210279.0,
              "replies": [
                {
                  "id": "m5tubjv",
                  "author": "solonit",
                  "body": "100% the decision was made by some nepo hired in upper management, that was the only one impressed by Apple, so they wanted same thing for it to be seen as their own ‘contribution’ and ‘genius idea’. \n\nI meant just look at the new naming scheme.",
                  "score": 27,
                  "created_utc": 1736227565.0,
                  "replies": []
                },
                {
                  "id": "m5ulqka",
                  "author": "luckybarrel",
                  "body": "What are you?!\n\nWHAT ARE YOU?!\n\n🍞🧠🍞",
                  "score": 1,
                  "created_utc": 1736243888.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5txtzc",
              "author": "arrty",
              "body": "They must have hired the guy apple fired",
              "score": 10,
              "created_utc": 1736229271.0,
              "replies": []
            },
            {
              "id": "m5y7pd2",
              "author": "maniacmartin",
              "body": "I have this XPS. It is not as bad as I thought it would be. But obviously I'd prefer a physical row of keys.",
              "score": 2,
              "created_utc": 1736288726.0,
              "replies": []
            },
            {
              "id": "m5tt6qv",
              "author": "whatwhatwhodat",
              "body": "Yes.  This fucking sucks.",
              "score": 1,
              "created_utc": 1736227036.0,
              "replies": []
            },
            {
              "id": "m5toqgu",
              "author": "gubber-blump",
              "body": "Sue me, but I think the touch bar is good on a MacBook after they brought back the physical escape key. It can do everything the function keys do, with additional useful functionality that replaces the blank or infrequently used function keys (why does search need a dedicated key??).",
              "score": 1,
              "created_utc": 1736225057.0,
              "replies": [
                {
                  "id": "m5uzn5b",
                  "author": "mycroft-holmie",
                  "body": "The physical escape key was a major improvement. But all the software development tools I use make heavy use of function keys (f5, f10, f11, etc) all the time. Having an actually button makes work a lot easier. And *that* is why I decided to not buy another XPS15 and instead buy a Lenovo. (I also use a MacBook Pro all the time too)",
                  "score": 6,
                  "created_utc": 1736252081.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m5srhsg",
          "author": "CatProgrammer",
          "body": "Framework 13 if you like repairability.",
          "score": 58,
          "created_utc": 1736213080.0,
          "replies": [
            {
              "id": "m5sy4o6",
              "author": "xd1936",
              "body": "Adore mine!",
              "score": 7,
              "created_utc": 1736215300.0,
              "replies": []
            },
            {
              "id": "m5tplba",
              "author": "Otakeb",
              "body": "System76 laptops are amazing too.",
              "score": 6,
              "created_utc": 1736225422.0,
              "replies": []
            },
            {
              "id": "m5uhcce",
              "author": "cujo67",
              "body": "Was interested till I saw the screen specs.  2.8k seems a bit restrictive, my old think 2019 xps 13 had 4k oled, you’d think they could at least have that as a part addon but didn’t see it.  Still intriguing but damn, disappointed tbh seeing the screen.",
              "score": 4,
              "created_utc": 1736240945.0,
              "replies": [
                {
                  "id": "m5uhkhp",
                  "author": "CatProgrammer",
                  "body": "4K at that size is just dumb. And while I like OLEDs I'm still wary about getting a computer with an OLED screen. The main reason is sourcing though, they're a small company and the 2.8K screen is itself higher resolution than the Framework 13 originally came with. ",
                  "score": 4,
                  "created_utc": 1736241094.0,
                  "replies": [
                    {
                      "id": "m647unr",
                      "author": "cujo67",
                      "body": "Hmm?\n“4K at that size” is not dumb.  The iPad Pro M4 has a pixel density of 264 pi while the iPad Mini 6&7 have 326 ppi, which looks noticeably sharper while viewing high res photos.   I’ve got the Dell XPS Plus with the 3.5k display which looks phenomenal, yet to experience burn-in.  Again it’s still disappointing that 2.8k is the maximum resolution, seeing as it’s a company marketing  swappable components to not include a higher end display, even if it did cost more, I’d pay for the upgrade.  Not having it as an option unfortunately steers me into the direction of Dell which I’d rather not do, but not many are making tandem oled displays yet.",
                      "score": 2,
                      "created_utc": 1736371282.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5w7h7w",
              "author": "_Lucille_",
              "body": "I like the framework, but imo their value proposition is just not good enough for general public.\n\nAnd until framework is mainstream or has a better logistics network, getting the parts for repair is still going to take a while. Take something as common and simple as a keyboard replacement for example: ordering a new framework keyboard will have it shipped out from Taiwan and generally takes a week; meanwhile, your local repair store may already have a keyboard lying around for a dell and you can have it replaced within 24 hours.",
              "score": 3,
              "created_utc": 1736267775.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5swdvm",
          "author": "TheSpamGuy",
          "body": "Thinkpad?",
          "score": 39,
          "created_utc": 1736214709.0,
          "replies": [
            {
              "id": "m5tmahs",
              "author": "None",
              "body": "My workplace buys E15's, they are mostly pretty good but still lemons in the batch with mobos that die just out of warranty, broken USB-C ports, half plugged keyboards. Touchscreens always have a percentage of duds no matter who the manufacturer is.",
              "score": 6,
              "created_utc": 1736224018.0,
              "replies": [
                {
                  "id": "m5ub80n",
                  "author": "mcdithers",
                  "body": "The E series is pretty terrible.  I only buy P, T, and X series for my users.",
                  "score": 12,
                  "created_utc": 1736236941.0,
                  "replies": []
                },
                {
                  "id": "m5ubdx6",
                  "author": "None",
                  "body": "We only buy the P, T, and X series of Thinkpads. Nothing else.",
                  "score": 8,
                  "created_utc": 1736237043.0,
                  "replies": []
                },
                {
                  "id": "m5tqw86",
                  "author": "Wierd657",
                  "body": "That's also the E series",
                  "score": 5,
                  "created_utc": 1736225996.0,
                  "replies": [
                    {
                      "id": "m5u6qfp",
                      "author": "TheSpamGuy",
                      "body": "Isn’t E series equivalent to Dell Inspiron, T series to Latitude and Carbon series to XPS?",
                      "score": 1,
                      "created_utc": 1736234184.0,
                      "replies": [
                        {
                          "id": "m5v2ffm",
                          "author": "None",
                          "body": "[deleted]",
                          "score": -2,
                          "created_utc": 1736253427.0,
                          "replies": [
                            {
                              "id": "m5v7od3",
                              "author": "Wierd657",
                              "body": "This is ridiculous",
                              "score": 2,
                              "created_utc": 1736255737.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5vozt6",
              "author": "kaqqao",
              "body": "I can't get over ThinkPad's dumb esthetics",
              "score": 1,
              "created_utc": 1736262103.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5swt0z",
          "author": "dusksloth",
          "body": "Had one of those XPS cross my desk a couple months ago. I went from \"oh the f keys are replaced with a touch bar? That's neat\" to \"good this is fucking stupid\" within 10 seconds of trying to use it.",
          "score": 12,
          "created_utc": 1736214852.0,
          "replies": []
        },
        {
          "id": "m5so155",
          "author": "venktesh",
          "body": "Asus Zenbook",
          "score": 17,
          "created_utc": 1736211927.0,
          "replies": [
            {
              "id": "m5spssy",
              "author": "pressedbread",
              "body": "Not bad.  My XPS 13 is about 4 years old now, hopefully it can last another 4 before I have to seriously look into this.  Reliability (with any brand) seems to just be about the silicone lottery and which various ports failing I can live with or not.",
              "score": 9,
              "created_utc": 1736212516.0,
              "replies": []
            },
            {
              "id": "m5stxgm",
              "author": "TheCudder",
              "body": "The screen on those things suck. I ordered an Asus Zenbook & a Surface Laptop, fully wanting to keep the ZenBook because of the additional ports and a few other things, but that screen color quality was sad in comparison. I sent the ZenBook back and kept the Surface Laptop.",
              "score": 2,
              "created_utc": 1736213887.0,
              "replies": []
            },
            {
              "id": "m5tgkva",
              "author": "None",
              "body": "I loved my zenbook but the thinness of it was the flaw for me. The frame got bent from being carried in a bag. Ended up buying a thinkpad",
              "score": 1,
              "created_utc": 1736221752.0,
              "replies": []
            },
            {
              "id": "m5u8tsr",
              "author": "burtmacklin15",
              "body": "Not if you ever need to actually use the warranty",
              "score": 0,
              "created_utc": 1736235449.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5s5lwp",
          "author": "narwhal_breeder",
          "body": "If the last 3 companies i've worked at are any indications, they're switching to Macbooks. Linux on XPS -> M series macs.",
          "score": 52,
          "created_utc": 1736205825.0,
          "replies": [
            {
              "id": "m5snutu",
              "author": "techcentre",
              "body": "macOS? No thanks.",
              "score": 32,
              "created_utc": 1736211870.0,
              "replies": [
                {
                  "id": "m5so9b7",
                  "author": "narwhal_breeder",
                  "body": "Yeah I was skeptical too, now I *really* dont want to ever have to go back to writing software on anything else.",
                  "score": 46,
                  "created_utc": 1736212001.0,
                  "replies": [
                    {
                      "id": "m5t2v19",
                      "author": "IIIIlllIIIIIlllII",
                      "body": "Interesting. I hate development on Mac. Installing XCode in and of itself is a pita",
                      "score": 22,
                      "created_utc": 1736216933.0,
                      "replies": [
                        {
                          "id": "m5t4099",
                          "author": "narwhal_breeder",
                          "body": "Really? I've had to install XCode to build some iOS native modules but I remember it basically being one click and done, and then \\`*xcode*\\-select --*install*\\` for the CLI tools. I dont really work with XCode much, mostly backend work with a lot of scientific computing packages. Compiles fast, runs fast, no WSL layer, no need to fix the little \"linux issues\" that cropped up constantly on Ubuntu/Arch.\n\nI do miss i3 though.\n\nI still have an Ubuntu box with a couple of 3090s thats used for ML training, but I dont really work *in*  it anymore. I just SSH from my mac and kick stuff off to run. Linux is still great to do work *with* but I don't find it particularly pleasant to do work *on.* At least when a Mac comes, right out of the box, 99% usable for software development.",
                          "score": 13,
                          "created_utc": 1736217328.0,
                          "replies": [
                            {
                              "id": "m5tz8o6",
                              "author": "aakoss",
                              "body": "Aerospace and yabai have window management just like i3. Some say Aerospace does it better.",
                              "score": 4,
                              "created_utc": 1736229996.0,
                              "replies": []
                            },
                            {
                              "id": "m5tbngr",
                              "author": "IIIIlllIIIIIlllII",
                              "body": "Yea, Macs are great for work when you get ssh into a real box from the Mac to do the hard work 😊",
                              "score": -9,
                              "created_utc": 1736219992.0,
                              "replies": [
                                {
                                  "id": "m5tc2y3",
                                  "author": "narwhal_breeder",
                                  "body": "Yeah the \"hard work\":\n\n    $> git pull\n    $> ./run_training.py",
                                  "score": 8,
                                  "created_utc": 1736220145.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m5tndml",
                          "author": "mindvape",
                          "body": "Installing Xcode is literally exactly like installing any other application on Mac. It's basically a single click. Also, unless by \"development on Mac\" you mean \"developing for macOS\" I don't know why you would be using XCode anyways.",
                          "score": 2,
                          "created_utc": 1736224478.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m5sx5wx",
                      "author": "mario61752",
                      "body": "Mac is exceptional for work. Save for some software compatibility headaches for M laptops (which is 99% of the time fine nowadays) they are just such battery-efficient and user-friendly machines.",
                      "score": 23,
                      "created_utc": 1736214971.0,
                      "replies": [
                        {
                          "id": "m5u4jxh",
                          "author": "Kaptain_Napalm",
                          "body": "I don't agree they're \"exceptional\". The machines themselves are great but I really don't like the OS. Maybe it's just because I'm too set in my ways on Linux but after trying to do a bit of dev on Mac I find myself constantly fighting the os to get shit working the way I want it. The performance is fine, but the user experience is really bad.  \n\nAlso no proper touch screen support, which sucks big time in my line of work.",
                          "score": 7,
                          "created_utc": 1736232904.0,
                          "replies": []
                        },
                        {
                          "id": "m5tadlt",
                          "author": "Terapr0",
                          "body": "Really depends what you’re working on. As someone who does mechanical design and 3D modelling there is no software support for any of the programs I use. \n\nI own a MacBook Pro and use it for some personal photo editing, but much prefer Windows over MacOS. To each their own though, pros and cons to both systems, I just find Mac doesn’t have as much native software support for the work I do. Might be different for other professions though",
                          "score": 17,
                          "created_utc": 1736219550.0,
                          "replies": [
                            {
                              "id": "m5u1u14",
                              "author": "reinhardtmain",
                              "body": "Ultimate blend is a windows desktop and a Mac laptop. \n\nAt least I’ve found that to be the case. \n\nMy file system is in iCloud tho, just cuz I’m tired of nas shenanigans as a new father.",
                              "score": 1,
                              "created_utc": 1736231384.0,
                              "replies": []
                            },
                            {
                              "id": "m5tbdmm",
                              "author": "narwhal_breeder",
                              "body": "What software do you use that isnt available on Mac? Genuinely curious. The only thing i've run into is some windows only firmware SDKs, but they were pretty old. I know some CAD kernels like whats under CATIA are ancient, and probably difficult to port to a new arch, but Parasolid was ported a long time ago.",
                              "score": 1,
                              "created_utc": 1736219899.0,
                              "replies": [
                                {
                                  "id": "m5tji3u",
                                  "author": "IdownvoteTexas",
                                  "body": "Like zero of our architectural blueprint stuff runs on a mac. Scada/catia, hell even revit/inventor dont have mac ports do they? \n\nI guess i get a lenovo toughbook when this dell dies? Idk.",
                                  "score": 14,
                                  "created_utc": 1736222881.0,
                                  "replies": [
                                    {
                                      "id": "m5tkgwe",
                                      "author": "narwhal_breeder",
                                      "body": "Inventor/Revit no, but I think Autodesk is trying to devest from them. AutoCAD/Fusion does.\n\nDell will probably keep its precision lineup I would think, and thats usually the pick for CAD shops if they've got a good dell rep.",
                                      "score": 1,
                                      "created_utc": 1736223270.0,
                                      "replies": [
                                        {
                                          "id": "m5tmguc",
                                          "author": "IdownvoteTexas",
                                          "body": "I think Autodesk does have a good DWG viewer for mac, that would actually get us somewhere; but autocad mep or revit are definitely common for commercial or industrial prints. Idk maybe if I got a mac and covered it with some ibew and dewalt stickers it would blend in",
                                          "score": 2,
                                          "created_utc": 1736224091.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "m5tei3k",
                                  "author": "Terapr0",
                                  "body": "Solidworks is the big one, but also MasterCAM, Robotmaster, NestFab, Vectric Aspire and a few others. Most of these could theoretically be run using bootcamp or an emulator, but the performance goes to absolute shit. I’ve tried running Solidworks on my MacBook Pro with bootcamp and it was borderline unusable.",
                                  "score": 15,
                                  "created_utc": 1736220991.0,
                                  "replies": [
                                    {
                                      "id": "m5tg480",
                                      "author": "narwhal_breeder",
                                      "body": "Oh yep, thats a big one.",
                                      "score": 2,
                                      "created_utc": 1736221577.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "m5wbb3o",
                                      "author": "Cloudraa",
                                      "body": "ever tried parallels? only real option for productivity in those sorts of apps imo",
                                      "score": 1,
                                      "created_utc": 1736268900.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "m5ugwql",
                                  "author": "Konexian",
                                  "body": "OS X support for Microsoft Office is super subpar, too, and that suite runs the entire professional world. Can’t use a Mac in professional services.",
                                  "score": 1,
                                  "created_utc": 1736240653.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m5v1sq1",
                          "author": "Happy_Harry",
                          "body": "Not if you're the IT dept that has to manage the.",
                          "score": 3,
                          "created_utc": 1736253128.0,
                          "replies": []
                        },
                        {
                          "id": "m5u5psw",
                          "author": "flac_rules",
                          "body": "Exceptional besides the tiny factor of a massive amount of the actual software to do work isn't available on MacOS",
                          "score": 2,
                          "created_utc": 1736233580.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m5u5qlg",
                      "author": "yashdes",
                      "body": "Yeah just got a MacBook 16 from work and man it is way better than even my personal XPS 17. Less graphics power probably but the battery life is amazing, and I def have less weird issues than on windows.",
                      "score": 0,
                      "created_utc": 1736233594.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5t1yx5",
                  "author": "Toph_is_bad_ass",
                  "body": "macOS is way better for most software dev than windows",
                  "score": 3,
                  "created_utc": 1736216628.0,
                  "replies": [
                    {
                      "id": "m5t4g8f",
                      "author": "techcentre",
                      "body": "That's literally the only good thing about it.",
                      "score": -9,
                      "created_utc": 1736217484.0,
                      "replies": [
                        {
                          "id": "m5t4pdv",
                          "author": "Toph_is_bad_ass",
                          "body": "I mean the shell actually being sane out of the box is also pretty good.",
                          "score": 4,
                          "created_utc": 1736217574.0,
                          "replies": [
                            {
                              "id": "m5tzsgs",
                              "author": "A_Right_Proper_Lad",
                              "body": "You're likely going to do most development inside WSL, and that shell works entirely as expected.",
                              "score": -4,
                              "created_utc": 1736230285.0,
                              "replies": [
                                {
                                  "id": "m62j630",
                                  "author": "Toph_is_bad_ass",
                                  "body": "Yeah but it's extra baggage when Windows should just have a sane shell. I mean you also can't even fork a process in windows. It's insane.",
                                  "score": 1,
                                  "created_utc": 1736353540.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m5vs6ic",
                  "author": "kaqqao",
                  "body": "MacOS is indeed awful usability wise, but after a few years of working on it, Linux and Windows both feel so unbelievably unreliable that I'll take the sucky usability with gusto. Linux is always in flux. If it's not Wayland then it's something else uprooting your working setup and resetting you back to endless tinkering just to get things working again. Windows is at all times one update away from crawling to a halt with 90% CPU usage at rest for no reason at all. While MacOS will behave exactly like it did the day you installed it, even 5 years after the fact. Awkward UI be darned, it's the only OS that values your time and sanity.",
                  "score": 0,
                  "created_utc": 1736263137.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m5t0fm0",
          "author": "yertle38",
          "body": "Likely. I’m on my third XPS 13 and I’ve been eyeing the Surface Laptops. They never quite had what I needed, but the new ones look solid.",
          "score": 3,
          "created_utc": 1736216094.0,
          "replies": []
        },
        {
          "id": "m5twla6",
          "author": "swentech",
          "body": "Yeah what do I buy know if I want a high end laptop. I was always a Dell guy but seems like I should look elsewhere.",
          "score": 2,
          "created_utc": 1736228660.0,
          "replies": []
        },
        {
          "id": "m5u8lvu",
          "author": "None",
          "body": "I suggest Asus zenbook. Thin, Light, great screen, high performance, and normal price",
          "score": 2,
          "created_utc": 1736235316.0,
          "replies": [
            {
              "id": "m66mhxo",
              "author": "pressedbread",
              "body": "This ASUS Zenbook A14 looks really good., and lightweight!\n\nI hope my laptop lasts few years longer but its good to see solid alternative",
              "score": 1,
              "created_utc": 1736402184.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5ud9b8",
          "author": "jlaine",
          "body": "And try to complain about it and get buried in a swarm of nothing.\n\nIt was fucking embarrassing. (still is, I frequently have to massage my touchpad into not sticking down - paid a premium price for premium shit.)",
          "score": 2,
          "created_utc": 1736238242.0,
          "replies": []
        },
        {
          "id": "m5uwjdw",
          "author": "_franciis",
          "body": "It’s a shame, I picked up a super cheap XPS13 9310 (I think) from a liquidation sale on eBay and it’s awesome. Targeted it because it’s the last model before they turned them into MacBook dupes and the reviews started to tank.\n\nThe guts, shell, keyboard, screen, battery, and weight are all good. Why change the formula?",
          "score": 2,
          "created_utc": 1736250464.0,
          "replies": []
        },
        {
          "id": "m5weblb",
          "author": "RingRingBanannaPhone",
          "body": "New ones have returned to a normal keyboard with a normal touch pad. Work in IT and that version of XPS was a complete nightmare. Touch pad occasionally needs a full restart. Screen failures constantly. Keyboard LEDs going very quick",
          "score": 2,
          "created_utc": 1736269786.0,
          "replies": []
        },
        {
          "id": "m5wpuiu",
          "author": "AwesomeWhiteDude",
          "body": ">So what does an XPS user buy now? \n\nSeems like they completely jettisoned that keyboard, weird function touch row, and the only usb-c ports aspect\n\nSo still a dell I guess?",
          "score": 2,
          "created_utc": 1736273134.0,
          "replies": []
        },
        {
          "id": "m5swaz1",
          "author": "TOOOOOOMANY",
          "body": "A precision? It’s the same laptop but better..",
          "score": 3,
          "created_utc": 1736214682.0,
          "replies": [
            {
              "id": "m5sy155",
              "author": "stogie-bear",
              "body": "Precision? Don’t you mean Dell Pro Max Premium? Or is it Pro Premium? The new names are so confusing. ",
              "score": 5,
              "created_utc": 1736215266.0,
              "replies": [
                {
                  "id": "m5t33mg",
                  "author": "TOOOOOOMANY",
                  "body": "Shouldn’t be too bad, makes sense I think\nDell - home line (Inspiron)\nDell Pro - business line (latitude and OptiPlex)\nDell Pro Max - high performance business line (precision)\n\nNever understood why XPS existed when it was a near mirror copy of the precision line. \n\nNew product line kinda feels like Apple naming convention and once you know it, it’s simple enough \n\nWas harder knowing optiplex latitude precision Inspiron xps etc",
                  "score": 0,
                  "created_utc": 1736217016.0,
                  "replies": [
                    {
                      "id": "m5tatn5",
                      "author": "lowcrawler",
                      "body": "What's higher... \"Premium\" or \"plus\" ?\n\nI hate naming schemes that aren't obvious.  Like my health insurance had \"standard\" and \"regular\" plans... Wtf.",
                      "score": 1,
                      "created_utc": 1736219704.0,
                      "replies": [
                        {
                          "id": "m5xxfo4",
                          "author": "TOOOOOOMANY",
                          "body": "Lol it's just pro and pro max iirc, ezpz",
                          "score": 1,
                          "created_utc": 1736285690.0,
                          "replies": [
                            {
                              "id": "m5y0fm5",
                              "author": "lowcrawler",
                              "body": "And each line has it's own set of names.. nothing, plus, premium. \n\nSo what is the best computer?  A Dell Premium or a Dell Pro?  A Dell pro max... Or dell pro Premium? Etc...  A bunch of words that all mean \"good\".",
                              "score": 1,
                              "created_utc": 1736286559.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m66n3qc",
              "author": "pressedbread",
              "body": "My integrated graphics and i5 processor with 8 gigs of ram is still killing it as an internet machine with occasional image editing, or Indi game.  I've owned a precision, I no longer need a precision.\n\nI'm not power hungry at this point, more looking for stability with good thermal management (quiet), and best in class size/weight/build.",
              "score": 1,
              "created_utc": 1736402496.0,
              "replies": [
                {
                  "id": "m67z2b1",
                  "author": "TOOOOOOMANY",
                  "body": "MacBook air with silcion processor for sure bounds ahead of the pack there \n\nThermal management so good it doesn't have a fan.",
                  "score": 0,
                  "created_utc": 1736429424.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m5sqv4p",
          "author": "Flimzes",
          "body": "Macbook, Hp Zbook Studio.",
          "score": 2,
          "created_utc": 1736212871.0,
          "replies": []
        },
        {
          "id": "m5sur87",
          "author": "iwellyess",
          "body": "MacBook",
          "score": 2,
          "created_utc": 1736214160.0,
          "replies": []
        },
        {
          "id": "m5tl4p7",
          "author": "None",
          "body": "A Lenovo.",
          "score": 1,
          "created_utc": 1736223536.0,
          "replies": []
        },
        {
          "id": "m5ufbfl",
          "author": "titpetric",
          "body": "A KVM and a PC",
          "score": 1,
          "created_utc": 1736239599.0,
          "replies": []
        },
        {
          "id": "m5vde17",
          "author": "TryingT0Wr1t3",
          "body": "Lenovo T, Ts or P line.",
          "score": 1,
          "created_utc": 1736257993.0,
          "replies": []
        },
        {
          "id": "m5vnt83",
          "author": "lmaccaro",
          "body": "I have a Samsung galaxy book pro. It’s pretty good as a competitor to xps.",
          "score": 1,
          "created_utc": 1736261711.0,
          "replies": []
        },
        {
          "id": "m5spf0o",
          "author": "sanctaidd",
          "body": "HP elitebook and spectre are pretty nice. Full allum. chassis, I believe.",
          "score": 1,
          "created_utc": 1736212392.0,
          "replies": [
            {
              "id": "m5srsr2",
              "author": "pressedbread",
              "body": "After the whole fiasco with their printers holding people hostage for ink, I'm concerned about the bloatware they would shove in any PC.  In business setting I haven't really seen any HPs in the wild in many years.",
              "score": 1,
              "created_utc": 1736213182.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5trw54",
          "author": "Vazhox",
          "body": "Alienware",
          "score": 0,
          "created_utc": 1736226443.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5s8ban",
      "author": "lodemeup",
      "body": "No one cares about AI more than people who want to sell you shit with AI shoved in it.",
      "score": 163,
      "created_utc": 1736206726.0,
      "replies": [
        {
          "id": "m5si4yh",
          "author": "None",
          "body": "[deleted]",
          "score": 46,
          "created_utc": 1736209977.0,
          "replies": [
            {
              "id": "m5u4499",
              "author": "danmac0817",
              "body": "It's the smart home all over again except there's even less value for the average end user.  At least with smart devices you immediately saw what purpose it served.\n\nThey don't even elaborate in their marketing beyond saying \"comes with AI/built for AI\" and mentioning some feature that already exists like a chat prompt or auto brightness.",
              "score": 13,
              "created_utc": 1736232656.0,
              "replies": [
                {
                  "id": "m63kbbw",
                  "author": "alpacnologia",
                  "body": "most smart tech, while overengineered and prone to breaking, has some accessibility aspects worth using if you need them\n\ngenerative AI is just a slop maker. no tangible benefits to its use, subpar results at best, just a pointless and expensive tech with no future (if AGI is ever happening, it’s not from this base)",
                  "score": 1,
                  "created_utc": 1736364440.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m5ts32t",
          "author": "akotlya1",
          "body": "This is literally 50% of the value of AI. The other 50% of the value is its ability to give the wealthy access to skills without giving the skilled access to wealth.",
          "score": 6,
          "created_utc": 1736226531.0,
          "replies": []
        },
        {
          "id": "m5t47pu",
          "author": "fifteengetsyoutwenty",
          "body": "But with AI I can ask my stupid questions there instead of Reddit 🤣",
          "score": 3,
          "created_utc": 1736217400.0,
          "replies": [
            {
              "id": "m5wx96i",
              "author": "wbruce098",
              "body": "It’s much less judgy and condescending, and sources its answer from Reddit anyway!",
              "score": 2,
              "created_utc": 1736275275.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5wwiw8",
          "author": "ThisTooWillEnd",
          "body": "I work as a software developer and the rare exception is a subset of devs who think it's the coolest shit ever.\n\nThe last couple projects I've worked on were related to AI, but both because the client was looking for some way to cram AI into something that did not need it or benefit from it, and will not enhance user experience in any way.\n\nI'm patiently waiting for this trend to die. I'm also glad I didn't invest any time or energy into learning NFT tech, or crypto tech, etc.",
          "score": 2,
          "created_utc": 1736275066.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5scuye",
      "author": "Aurakol",
      "body": "At work we're forced to buy Dell laptops and pcs. ALL of the newer pcs (7020 SFF and 5550 laptops) that we've ordered since they forced us to have been absolute ass. Freezing randomly while doing light work, getting stuck on the windows lock screen requiring a hard reboot, barely able to run a spreadsheet.\n\nAbsolute ass.",
      "score": 39,
      "created_utc": 1736208229.0,
      "replies": [
        {
          "id": "m5vlf9d",
          "author": "cocktails4",
          "body": "We use Surface laptops and the performance is total ass. But I realized that it's because of whatever security software the company installs. My processor is pegged at 100% for hours every day while this software does....I don't fucking know what. I kept my old desktop just so I have something reliable to use when my laptop goes on it's daily security vacation.",
          "score": 8,
          "created_utc": 1736260904.0,
          "replies": []
        },
        {
          "id": "m5tiadw",
          "author": "TheGreenMileMouse",
          "body": "Yes. Same for us. I can’t even run a v lookup on mine, it freezes and I have to force it to shut down",
          "score": 5,
          "created_utc": 1736222408.0,
          "replies": []
        },
        {
          "id": "m5w8wna",
          "author": "Nicktune1219",
          "body": "During my internship I had a dell, probably a latitude but I don’t remember. They had some stupid software feature to adjust brightness based on what you were looking at. This applied for secondary monitors as well. But it would increase the brightness when looking at a white page and decrease the brightness when looking at a dark page. I went through literally every setting and checked and unchecked things and it still happened. I couldn’t see anything at my desk that was a dark page when the sun was shining, and then if I switched to a white page I would be blinded.",
          "score": 4,
          "created_utc": 1736268194.0,
          "replies": []
        },
        {
          "id": "m5zbape",
          "author": "None",
          "body": "The original XPS was fantastic. My company switch to them and we loved them. Too bad they let the quality slide.",
          "score": 1,
          "created_utc": 1736301656.0,
          "replies": []
        },
        {
          "id": "m5tcuuw",
          "author": "ant1992",
          "body": "I’ve always been an advocate to not buy dell products since I was like 12 years old. They’ve always been and always will be complete shit",
          "score": -6,
          "created_utc": 1736220424.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5t4ryz",
      "author": "madmax_br5",
      "body": "I used to work for Dell in the PC division up until a year ago. Generally speaking, leadership has not a clue what they are doing, and even less imagination.",
      "score": 33,
      "created_utc": 1736217599.0,
      "replies": [
        {
          "id": "m5u2pm6",
          "author": "CoachDonut82",
          "body": "I worked in small business sales in the early 2010s and we weren't even allowed to build out XPS systems for our customers in IDD. Eventually you learned some workarounds but you couldn't always get them exactly what they wanted, and it was real fun to tell someone they couldn't spend $2000 with you and had to hand them off to consumer sales, in which case they couldn't use their business line of credit to buy the computer, either. So many pissed off customers in such a short time.\n\n\nAlso it took leadership around a year or so after I started to realize that giving us a copy of the current sales flyer they mailed out on our desk was a good idea. It was always fun to come in on a Monday to a bunch of calls for whatever bundle was in the flyer they just sent out, and we had no way of knowing what they were talking about other than asking them to give us the code on the ad or having them explain the specs so we could find it on the Dell website.\n\n\nBeen a clown company for a long time.",
          "score": 5,
          "created_utc": 1736231865.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5s3or4",
      "author": "von_schmid",
      "body": "Can AI just go away",
      "score": 140,
      "created_utc": 1736205199.0,
      "replies": [
        {
          "id": "m5t3xq9",
          "author": "SniperPilot",
          "body": "No. —this comment made by ChatGPT",
          "score": 43,
          "created_utc": 1736217303.0,
          "replies": [
            {
              "id": "m5td0ox",
              "author": "smurficus103",
              "body": "https://youtu.be/pRWjLLpwnOM",
              "score": -2,
              "created_utc": 1736220482.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5ssyfg",
          "author": "teefj",
          "body": "Go awai",
          "score": 15,
          "created_utc": 1736213560.0,
          "replies": []
        },
        {
          "id": "m5yvzhx",
          "author": "someguy7734206",
          "body": "It's here to stay. My speculation is that, like the Internet before it, there are obviously going to be lots of companies and products trying to get into the trend and shoving AI everywhere they possibly can, and the vast majority of them will fail, causing something akin to the Dotcom crash. But AI has already proven very useful for billionaires, corporations, and hostile foreign governments, among many others, to cause great amounts of damage to society, so it will continue to be used and developed further.",
          "score": 2,
          "created_utc": 1736296537.0,
          "replies": [
            {
              "id": "m5z0335",
              "author": "code____sloth",
              "body": "Yeah it’s ability to completely destroy an entire population’s ability to separate fact from falsehood online is the wet dream of every despotic regime lol. Stop playing the cat and mouse game of trying to censor everything online and instead just pollute the internet with so much absolute horse shit that finding put anything useful becomes impossible ",
              "score": 2,
              "created_utc": 1736297883.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5trypv",
          "author": "akotlya1",
          "body": "The world of finance needs to keep finding new opportunities to invest trillions of dollars. AI, regardless of its actual properties, represents such an opportunity with its ability to infect any platform for existing software and its new reliance on massive infrastructure and energy to support it. The only thing that will kill it will be its failure to generate revenue (like blockchain before), or if people fundamentally reject it - which the world of finance is doing everything it can to eliminate the choice.",
          "score": 3,
          "created_utc": 1736226476.0,
          "replies": []
        },
        {
          "id": "m5u32i5",
          "author": "KidNueva",
          "body": "AI has been incredibly useful for me in my day to day life. I am in the progress of installing an offline AI bot on my old computer to access and look for information on my local hard drives, both on the local PC and other PC’s connected to the same network. \n\n\nBut one thing I do wish, I wish companies would stop pushing it so hard as a replacement for other great features or as the main selling point.",
          "score": 3,
          "created_utc": 1736232067.0,
          "replies": [
            {
              "id": "m5z2a2z",
              "author": "code____sloth",
              "body": "I’m sorry but can you elaborate on this? I’ve been desperately trying to see a valuable use case for AI for normal people like me ever since it started getting shoved up all our collective asses. And so far everything I’ve seen has been either nothing at all or something that’s only useful to people who aren’t very tech proficient.\n\nI’ve got five computers and a big file server at home, dozens of terabytes of files all over the place. But I could find any of them in a few seconds on demand because I’ve been good about keeping everything organized, and failing that I’ll just use an indexed search. What does AI provide that adds benefit to you here?",
              "score": 1,
              "created_utc": 1736298614.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5z0niw",
          "author": "code____sloth",
          "body": "We have a literal entire AI department at the law firm where I work lol. It has proven occasionally useful at summarizing legal briefs but it also consistently references cases that don’t exist and other shit that, to me, makes it entirely unreliable for work with stakes as high as this. But to the people getting paid to shove AI up all our asses these are just minor stumbling blocks. \n\nEvery meeting is just a bunch of shit about how 18% of employees are driving 80% of chatGPT usage, and other euphemistic garbage that handily avoids mentioning that the other 82% of employees don’t use it at all. And it’s costing the firm over $100k per month. I’m so tired of it man. ",
          "score": 1,
          "created_utc": 1736298070.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5s217a",
      "author": "Speedy059",
      "body": "I got an XPS since it allowed me to upgrade the memory and nvme, do they have any other models that doesn't solder the components on like XPS???",
      "score": 29,
      "created_utc": 1736204665.0,
      "replies": [
        {
          "id": "m5s5r1f",
          "author": "RChamy",
          "body": "Does G-series count?",
          "score": 6,
          "created_utc": 1736205872.0,
          "replies": []
        },
        {
          "id": "m5stzv2",
          "author": "i_hump_cats",
          "body": "Which XPS let you swap memory?\n\nThe 2017 XPS13 I bought had a replaceable drive but soldered memory.",
          "score": 4,
          "created_utc": 1736213908.0,
          "replies": [
            {
              "id": "m5t3480",
              "author": "wazpys",
              "body": "I have the 15\" and I've changed drive, ram and Wi-Fi card. Maybe it was only soldered on the 13?",
              "score": 2,
              "created_utc": 1736217021.0,
              "replies": [
                {
                  "id": "m5tcc4n",
                  "author": "613codyrex",
                  "body": "The 13s had LPDDR4 as well as the older 2 in 1 XPS 15s like the 9575. LPDDR always is soldered on. \n\nThe XPS 15 (like the 9500/9510/9520) but also the rare XPS 17 have standard DDR4/DDR5 which is upgradable. \n\nThe new (but also not new anymore I guess?) XPS 16 and 14 are actually LPDDR5x which means non-upgradable. \n\nI can’t remember exactly when Dell killed the M.2 E key slot for WiFi/bluetooth cards. I think you probably have an old XPS 15 9570? Every XPS 15 after that one dropped the swappable WIFI card for a second M.2 NVMe SSD slot. \n\nAll XPS have upgradable storage IIRC.",
                  "score": 4,
                  "created_utc": 1736220238.0,
                  "replies": [
                    {
                      "id": "m5teh1l",
                      "author": "wazpys",
                      "body": "Yeah, it's the 9570 I have, just double checked. Switched out the battery 3 times so far, trying to make it last as long as possible. Just can't find another laptop I like as much! The biggest complaint I've had is the shitty webcam, and the placement of it, during the whole remote covid era. Apart from the battery problems of course :)",
                      "score": 2,
                      "created_utc": 1736220980.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5teoaw",
              "author": "miversen33",
              "body": "XPS 9510 allows it. I have one, its fantastic. I don't plan on upgrading the machine anytime soon (I just replaced the battery last fall) but when I did I was going to go with an XPS. Lol rip me I guess",
              "score": 1,
              "created_utc": 1736221052.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5unwpw",
          "author": "According_Net3630",
          "body": "Same. Upgraded my xps15 13th gen to 32gb ram and put a 2tb nvme in as a second drive.\n\nDell precision is similar if you want to stick with Dell.",
          "score": 1,
          "created_utc": 1736245301.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5rxxem",
      "author": "tu_tu_tu",
      "body": ">Dell’s announcement today described as “designed for play, school, and work,” Dell Pro branding “for professional-grade productivity,” or be Dell Pro Max products, which are “designed for maximum performance.\"\n\nWas it an Apple or a chineese marketer who bited Dell?",
      "score": 67,
      "created_utc": 1736203360.0,
      "replies": [
        {
          "id": "m5rzj51",
          "author": "Snipedzoi",
          "body": "We'll have the Dell 3gs soon",
          "score": 16,
          "created_utc": 1736203865.0,
          "replies": []
        },
        {
          "id": "m5s1013",
          "author": "HiFiGuy197",
          "body": "Where’s my Dell SE?",
          "score": 7,
          "created_utc": 1736204332.0,
          "replies": []
        },
        {
          "id": "m5t7wkj",
          "author": "wombat1",
          "body": "Ha, you reminded me of how some Chinese car brands are using this nomenclature. I shit you not, I know someone who drives a Chery Tiggo 7 Pro Max. What makes a car \"pro\"? You use it for a profession? Is it suited to the Uber driver or the budding racer?",
          "score": 1,
          "created_utc": 1736218684.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5rtuua",
      "author": "bduxbellorum",
      "body": "So we’re going backwards…to when Dell retired the “extreme performance series” line in 2006 after acquiring Alienware only to revive it in 2010 when they needed a new more serious seeming product line to sell to upscale consumers.",
      "score": 59,
      "created_utc": 1736202089.0,
      "replies": [
        {
          "id": "m5rwwoj",
          "author": "None",
          "body": "The XPS line has, I believe, been around for more than 20 years in general.\n\n20 years for laptops, over 30 years for desktops.",
          "score": 18,
          "created_utc": 1736203039.0,
          "replies": [
            {
              "id": "m5ry6t9",
              "author": "bduxbellorum",
              "body": "You’re right that in 1993 there was a line of “extreme performance system” computers from Dell, but they were phased out when they acquired Alienware in 2006. That era was one that i specifically remember dell and hp focusing on numeric model numbers with “pro” as the main way to call out their more serious workstation laptops etc…\n\nXPS was revived in 2010 as a separate product line which they needed to escape a frumpy reputation of their design and build in the preceding years. \n\nI guess you can say this is more of a cyclic phenomenon, rather than a strictly regressive one 🤷",
              "score": 12,
              "created_utc": 1736203442.0,
              "replies": [
                {
                  "id": "m5s8oh9",
                  "author": "NickCharlesYT",
                  "body": "I saw an early '93 or '94 XPS workstation tower recently, what a beastly rig that was...I think it had a 486 in it and was like twice the size of a modern mid-tower ATX machine, flipped horizontally for good measure too.\n\nEDIT: This was the one I saw, the \"Dell Dimension XPS 466V\" or a similar variant: https://vintagecomputer.net/browse_thread.cfm?id=626",
                  "score": 4,
                  "created_utc": 1736206845.0,
                  "replies": []
                },
                {
                  "id": "m5ryl6z",
                  "author": "None",
                  "body": "I also heard the current XPS laptops were kind of toasty, and a niche product.",
                  "score": 3,
                  "created_utc": 1736203569.0,
                  "replies": [
                    {
                      "id": "m5u6u9b",
                      "author": "Oscaruit",
                      "body": "I had a i9 with a 1050. That thing was fast, until it throttled 5 seconds into opening anything with a bit of weight. Re-pasting seemed to help a little, but thermal throttling was terrible. Never again.",
                      "score": 1,
                      "created_utc": 1736234248.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5s89oa",
                  "author": "tylerbrainerd",
                  "body": "The Studio XPS 13 was all about trying to compete with the fashion vibes of that era's apple laptops and heavily marketed towards college students.\n\nI kind of miss it, but it was a terrible laptop.",
                  "score": 2,
                  "created_utc": 1736206711.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m5yxuwz",
          "author": "black3rr",
          "body": "huh… never knew XPS stood for “extreme perfomance series”… and it feels kinda funny when the top-of-the-line XPS laptops were actually branded as Dell Precision…",
          "score": 1,
          "created_utc": 1736297152.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5sguh0",
      "author": "BFaus916",
      "body": "They should have never fired that kid for smoking weed. He was the best pitchman ever and could still play that role.",
      "score": 11,
      "created_utc": 1736209548.0,
      "replies": []
    },
    {
      "id": "m5t8ha5",
      "author": "hondaprobs",
      "body": "Somewhat misleading headline. If you read the article they are just rebranding XPS \"Dell Pro Max\" which sounds worse IMO but hopefully they keep the aesthetics at least.",
      "score": 18,
      "created_utc": 1736218879.0,
      "replies": []
    },
    {
      "id": "m5sqdhc",
      "author": "AC_CJ",
      "body": "I feel like this is a mistake. When I think of “dell” I think of an alright computer. But when I hear XPS I usually associate it with a better product.",
      "score": 6,
      "created_utc": 1736212707.0,
      "replies": []
    },
    {
      "id": "m5sa29m",
      "author": "DizzyLime",
      "body": "I have a Dell XPS 9510 and it's possibly the worst bang for buck laptop that I've ever had. Whiny high pitched fan noise, constant overheating and fan running on high, battery degraded to 50% within a couple of years despite battery protection features enabled, windows modern standby issues where the laptop turns itself on at night despite disabling every automatic update option...\n\nGranted most of these issues were resolved by installing linux on it, but I shouldn't have to install an unsupported OS on a £2000 (when new) laptop just to get it functional.  \n\nI also had an older generation XPS 13 at work and it also had overheating and fan noise issues.\n\nUnless there's a radical shift in their quality, I'll never buy a dell again.",
      "score": 17,
      "created_utc": 1736207304.0,
      "replies": [
        {
          "id": "m5t364k",
          "author": "Terribad13",
          "body": "I use a 9510 for work and personally love it. I'm an engineer and do a lot of numerical processing and 3D modeling work with it and never had any issues. The fan is relatively quiet and I've never had it overheat, although it does get hot. My only real complaint is that it doesn't shut down properly, but I think that is a Windows issue.\n\nI use it with a WD19 dock. It runs 2 monitors and various small peripherals without issues. I can't comment on battery life since it lives plugged in.",
          "score": 7,
          "created_utc": 1736217040.0,
          "replies": [
            {
              "id": "m5ydsq5",
              "author": "chadhindsley",
              "body": "Same",
              "score": 1,
              "created_utc": 1736290597.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5swq1m",
          "author": "bardezart",
          "body": "My job exclusively uses Dell laptops. I’m the in-house designer for them (hired in 2020) and up until a couple years ago was working on a near specced out XPS. Took 2y for that laptop to not be able to keep up with the work I do regularly. Luckily, before my boss left she pushed through my request for an M2 Max MacBook Pro. IT hates having to deal with my laptop when the rare issue pops up but I think if I still had that XPS I would’ve tomahawked it through a wall by now.",
          "score": 3,
          "created_utc": 1736214823.0,
          "replies": [
            {
              "id": "m5wnq1g",
              "author": "Kepabar",
              "body": "Can confirm, your IT department despises that MacBook.",
              "score": 1,
              "created_utc": 1736272519.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5ukxp5",
          "author": "splitframe",
          "body": "I have an XPS 15 9550 from 2015 that served me really well until the CPU just wasn't fast enough anymore. Still good as an office machine. Never had any problems and the Battery is still in OK shape 70% of the original capacity or something after 10 years.",
          "score": 1,
          "created_utc": 1736243354.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5sli9e",
      "author": "learnedhandgrenade",
      "body": "My 2020 XPS 15 7590k is without a doubt the worst computer I have owned in 30 years of buying computers. It was serviced 4 times in the first three years of ownership. It’s a Laptop of Theseus. Pretty sure only the bottom half of the chassis and SSD are original.\n\nRunning Civilization in strategy view on low settings? 100C core temps. Opening Outlook? 100C core temps. CTRL+ALT+DEL? Believe it or not, 100C core temps.",
      "score": 6,
      "created_utc": 1736211089.0,
      "replies": []
    },
    {
      "id": "m5s8n9b",
      "author": "ToMorrowsEnd",
      "body": "Dell XPS machines have been low grade dog food cince 2020 and have not gotten any better.    Lets put it this way, The company I work for has been a Dell Partner for decades, we switched to Lenovo 100% due to the constant problems and failures with all dell products for the past 4 years.  My current 1 year old XPS is now on it's 3rd motherboard.  and I cant wait for IT to let me yeet this trash.",
      "score": 12,
      "created_utc": 1736206834.0,
      "replies": [
        {
          "id": "m5sdeie",
          "author": "Moltak1",
          "body": "My 2017 xps 15 9560 sucks balls, they got away with so much crap",
          "score": 4,
          "created_utc": 1736208410.0,
          "replies": [
            {
              "id": "m5tsdt0",
              "author": "-effortlesseffort",
              "body": "my 2020 xps keeps blue screening",
              "score": 1,
              "created_utc": 1736226666.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5sioz2",
          "author": "savvymcsavvington",
          "body": "I'm still bitter how incredibly shit their CPU options were ~5 years ago, so few cores.. the laptop was a slug within the first year of use",
          "score": 3,
          "created_utc": 1736210162.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5sn6xt",
      "author": "beeporn",
      "body": "What is the best higher end non-gaming windows laptop these days?",
      "score": 8,
      "created_utc": 1736211648.0,
      "replies": [
        {
          "id": "m5ubn0r",
          "author": "None",
          "body": "ThinkPad P series.",
          "score": 7,
          "created_utc": 1736237203.0,
          "replies": []
        },
        {
          "id": "m5td1x7",
          "author": "613codyrex",
          "body": "You basically play a roulette depending on what you care about and who are you willing to give a chance to. \n\nThe HP Zbook Studio has always been a competitor to the XPS 15/Precision 55XX series laptop. It didn’t give me *too* many problems but I still liked my XPS 15 more. \n\nLenovo doesn’t particularly have anything interesting with a decent form factor and ASUS is probably the only other competitor with their ProArt laptops which are supposed to be good. \n\nOf course if you’re looking to compromise on the fancy aluminum designs n stuff, Framework laptops are a good option if you don’t mind the AMD GPUs on those.\n\nLaptops are kinda one of those “when not if” situations for defects and failures. All will eventually fail so you either get a framework and cross your fingers frameworks supports your device for long enough to have it fail, or you buy warranties with the big brands and cross your fingers you get a workable service agent.",
          "score": 7,
          "created_utc": 1736220495.0,
          "replies": []
        },
        {
          "id": "m5tlm69",
          "author": "breakspirit",
          "body": "Reddit won't like it and I know you specified Windows laptops, but Apple's Macbooks are currently untouchable.  It's a damn shame because there's no technical reason that has to be the case.  I own many computers and I probably use my M1 Macbook more than anything else just because everything else has some kind of annoying bullshit problem.",
          "score": 16,
          "created_utc": 1736223736.0,
          "replies": [
            {
              "id": "m5vhrvx",
              "author": "beeporn",
              "body": "It is crazy that there are no other higher end non gaming laptops that can compete with MacBook",
              "score": 3,
              "created_utc": 1736259616.0,
              "replies": []
            },
            {
              "id": "m5vmi9s",
              "author": "tejanaqkilica",
              "body": "I have a colleague who says the same, I wouldn't believe it at first as I find it unlikely, especially in our line of work, but then I saw what he did and I agree, Apple MacBook was amazing as a terminal where all it did was RDP to a Windows VM in order to actually get some work done.\n\nLol",
              "score": 3,
              "created_utc": 1736261275.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5u4xww",
          "author": "beijingspacetech",
          "body": "Framework? They're continuously upgradeable",
          "score": 2,
          "created_utc": 1736233129.0,
          "replies": []
        },
        {
          "id": "m5vedso",
          "author": "TryingT0Wr1t3",
          "body": "Lenovo ThinkPad T, Ts or P lines. These are the best for Windows, very portable, good battery life, comfortable keyboard.",
          "score": 1,
          "created_utc": 1736258363.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5s0dlw",
      "author": "AusGeno",
      "body": "They've been making the same old shitty overheating, crap battery life Intel laptops with less ports on the 'Pro' models than the entry level models and occasionally dabbling with gimmicky shit like invisible touchpads but instead of taking the effort to make better laptops they're just copying Apples naming convention and I'm kind of blown away by disappointment.",
      "score": 7,
      "created_utc": 1736204131.0,
      "replies": []
    },
    {
      "id": "m5sbz2k",
      "author": "Sabermatrixx",
      "body": "Was told this a bit ago from Dell, think they'll regret dumping all the product names.\n\nWas blown away when they mentioned killing off legit all their long standing brands.",
      "score": 3,
      "created_utc": 1736207937.0,
      "replies": []
    },
    {
      "id": "m5sgqqs",
      "author": "PsychicSpore",
      "body": "Wow! XPS M1530 was my first ever laptop, gifted to me by my grandmother for my 12th birthday. Probably the most profound device I’ve owned in terms of my internet and tech literacy.",
      "score": 3,
      "created_utc": 1736209513.0,
      "replies": []
    },
    {
      "id": "m5w09f1",
      "author": "iWETtheBEDonPURPOSE",
      "body": "Man this hits home a little bit. My very first \"gaming\" PC was an XPS Desktop back in 2005-ish. 1GB RAM, 7800GTX, I don't remember the CPU but it was a Pentium D. And can't forget the SoundBlaster Xtreme soundcard. Duel 300GB hard drives.",
      "score": 3,
      "created_utc": 1736265624.0,
      "replies": []
    },
    {
      "id": "m5uqea2",
      "author": "grafknives",
      "body": "XPS, AND Inspiron AND Latitude, AND Precision. \n\nThey get rid of all internal \"brands\". And as much as we might hate it out of sentiment (although who likes Dell :D), it \"makes sense\".\n\nThe guys in the boardroom want to hear that Dell is no longer a PC hardware manufacturer,  but they are AI player, and they will create their own enviroment, like ... Like that company that uses \n\n\n\"pro max\" on their products",
      "score": 5,
      "created_utc": 1736246879.0,
      "replies": []
    },
    {
      "id": "m5rzf2r",
      "author": "DLiltsadwj",
      "body": "Love my XPS despite hating the keyboard and touchpad action.",
      "score": 5,
      "created_utc": 1736203830.0,
      "replies": []
    },
    {
      "id": "m5s1ncj",
      "author": "HGLatinBoy",
      "body": "Took longer than expected. I thought for sure after buying Alienware they would retire XPS",
      "score": 2,
      "created_utc": 1736204541.0,
      "replies": []
    },
    {
      "id": "m5shkcj",
      "author": "work4work4work4work4",
      "body": "As someone who used to be \"premier\" technical support for XPS systems only in that twilight period where Dell kind of wanted to buy Alienware, and kind of wanted to just roll their own Alienware, it's the end of an era.\n\nHell, if they still existed in the same way they did back then, I'd still recommend them to people as it's still just as rare to be able to get US-based technical support from knowledgeable people specifically familiar with your model of PC, and empowered to make sure they got you back up in running in the shortest order possible. Probably one of the few \"support contracts\" for individuals in the business that was actually worth it.\n\nShout out to thousands of people I walked through reseating their own memory in a desktop PC for the first time to avoid long technician delays, and to the couple of frequent fliers who were kind enough to raise hell for a few weeks after the no-notice shut down/layoff of our entire department.",
      "score": 2,
      "created_utc": 1736209785.0,
      "replies": [
        {
          "id": "m5slm5a",
          "author": "The_RealAnim8me2",
          "body": "I remember when Alienware was a quirky little PC manufacturer in Miami just off the 826. You could see them spray painting the cases those weird colors in the parking lot. Like literally had cases hanging from ropes in the parking lot and spraying them.\n\nWhen Dell announced they were buying them I was shocked.",
          "score": 3,
          "created_utc": 1736211125.0,
          "replies": [
            {
              "id": "m5tpuga",
              "author": "Bombero_911",
              "body": "The two founding dudes hit the jackpot!",
              "score": 1,
              "created_utc": 1736225531.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m5sqg71",
      "author": "O-parker",
      "body": "Never owned a Dell I didn’t have problems with …oh wait there was one Inspiron laptop that served me well.",
      "score": 2,
      "created_utc": 1736212732.0,
      "replies": []
    },
    {
      "id": "m5u54qz",
      "author": "WisdomDota",
      "body": "GOOD. They were dogshit. Riddled with issues and dell not giving a fuck.",
      "score": 2,
      "created_utc": 1736233239.0,
      "replies": []
    },
    {
      "id": "m5uoi2s",
      "author": "Disastrous_Chain7148",
      "body": "My xps13 gets blue screen several times during a day. Too expensive for a piece of junk.",
      "score": 2,
      "created_utc": 1736245680.0,
      "replies": []
    },
    {
      "id": "m5us38e",
      "author": "badger906",
      "body": "Yay more Ai gimmick crap",
      "score": 2,
      "created_utc": 1736247917.0,
      "replies": []
    },
    {
      "id": "m5usg1d",
      "author": "DangerousAd1731",
      "body": "It's how our IT department got better computers back in the day approved lol",
      "score": 2,
      "created_utc": 1736248133.0,
      "replies": []
    },
    {
      "id": "m5v4ny6",
      "author": "Fickle-Elk-5897",
      "body": "the consumer is literally not asking for AI tho...",
      "score": 2,
      "created_utc": 1736254444.0,
      "replies": []
    },
    {
      "id": "m5v6br5",
      "author": "QuadraMum",
      "body": "And weed is now legal!",
      "score": 2,
      "created_utc": 1736255165.0,
      "replies": []
    },
    {
      "id": "m5vd93t",
      "author": "The_Owl_Man_1999",
      "body": "I guess the bright side of the rebranding is they can't keep reusing older names over and over, I've got an old insanely expensive desktop replacement Inspiron my school tossed out that shares a name with a modern lower end model so it's annoying finding stuff for it.",
      "score": 2,
      "created_utc": 1736257942.0,
      "replies": []
    },
    {
      "id": "m5wxfe5",
      "author": "Akaza_Dorian",
      "body": "XPS is now called “Dell Premium” in case anyone wonders.",
      "score": 2,
      "created_utc": 1736275324.0,
      "replies": []
    },
    {
      "id": "m5wyhxc",
      "author": "blake-young",
      "body": "Dell still made computers?",
      "score": 2,
      "created_utc": 1736275629.0,
      "replies": []
    },
    {
      "id": "m5tsbxk",
      "author": "kinoki1984",
      "body": "XPS was the last good work PC out there. Thankfully I get to choose Apple. But when I got to decide PC, XPS was the only choice. Sad day.",
      "score": 2,
      "created_utc": 1736226642.0,
      "replies": []
    },
    {
      "id": "m5u2e5o",
      "author": "FrankieTheAlchemist",
      "body": "Is it just me or is every single company just throwing away all of their good shit and really leaning into garbage?",
      "score": 3,
      "created_utc": 1736231689.0,
      "replies": []
    },
    {
      "id": "m5v2e96",
      "author": "Seiren-",
      "body": "That’s a shame, always wanted one but could never justify the expense..",
      "score": 3,
      "created_utc": 1736253412.0,
      "replies": []
    },
    {
      "id": "m5tavdf",
      "author": "landswipe",
      "body": "They killed it with the capacitive touch escape, lost my business.",
      "score": 3,
      "created_utc": 1736219721.0,
      "replies": []
    },
    {
      "id": "m5usple",
      "author": "Gypsyrocker",
      "body": "Dude. You’re not gettin a Dell.",
      "score": 3,
      "created_utc": 1736248293.0,
      "replies": []
    },
    {
      "id": "m5snvtf",
      "author": "Amachar928",
      "body": "I saw Dell XPS computers in F.E.A.R.’s expansion packs.",
      "score": 2,
      "created_utc": 1736211879.0,
      "replies": []
    },
    {
      "id": "m5vb40o",
      "author": "HG21Reaper",
      "body": "Wow, the end of an era. The XPS line was really good and I always wanted one.",
      "score": 2,
      "created_utc": 1736257116.0,
      "replies": []
    },
    {
      "id": "m5s9x1k",
      "author": "salzgablah",
      "body": "Bummer. Easily upgraded nvme and ram, with such tiny bezels. The xps line will be missed.",
      "score": 1,
      "created_utc": 1736207256.0,
      "replies": []
    },
    {
      "id": "m5smv83",
      "author": "defconz",
      "body": "This was probably the last XPS I was going to get anyway. We had a good run.",
      "score": 1,
      "created_utc": 1736211540.0,
      "replies": []
    },
    {
      "id": "m5spnd4",
      "author": "dramafan1",
      "body": "Title should have gave more context.\n\nThey’ll still make laptops, they’re just rebranding their entire laptop product naming system.",
      "score": 1,
      "created_utc": 1736212465.0,
      "replies": []
    },
    {
      "id": "m5sqf2s",
      "author": "USB-SOY",
      "body": "XPS was what makes dell",
      "score": 1,
      "created_utc": 1736212722.0,
      "replies": []
    },
    {
      "id": "m5ssewn",
      "author": "Most_Purchase_5240",
      "body": "THE END OF AN ERA no less",
      "score": 1,
      "created_utc": 1736213382.0,
      "replies": []
    },
    {
      "id": "m5sttnq",
      "author": "PrimaryRecord5",
      "body": "First we had “everything connected to the cloud” shoved down our throats and now this??? No thanks\n\nEnough with the AI stuff",
      "score": 1,
      "created_utc": 1736213851.0,
      "replies": []
    },
    {
      "id": "m5surpw",
      "author": "adamdoesmusic",
      "body": "Oh, just go all the way with the overplayed, annoying branding trends already! Where’s the *Dell One*?",
      "score": 1,
      "created_utc": 1736214164.0,
      "replies": []
    },
    {
      "id": "m5sx6fg",
      "author": "neltorama",
      "body": "Wait, does that mean my 9510 will be a collectors item soon?",
      "score": 1,
      "created_utc": 1736214976.0,
      "replies": []
    },
    {
      "id": "m5t1f2j",
      "author": "InternationalGrand50",
      "body": "Bought a top of the range xps years ago. Screen went first in a couple of months and then had over heating issues. Both times had to have an engineer come out and replace the main board. \nAlso had them at my work, nothing but issues. Ended up going with other brands like HP and Asus. No issues with them. Good riddance to Xps,  and Dell for that matter.",
      "score": 1,
      "created_utc": 1736216438.0,
      "replies": []
    },
    {
      "id": "m5t1uxt",
      "author": "cokefizz",
      "body": "AI PCs are the new 3D TVs",
      "score": 1,
      "created_utc": 1736216590.0,
      "replies": []
    },
    {
      "id": "m5t2i3d",
      "author": "uid0x45",
      "body": "Mine blue screens every reboot…. And reboots when it wants, buttons be damned.",
      "score": 1,
      "created_utc": 1736216810.0,
      "replies": []
    },
    {
      "id": "m5t3b7z",
      "author": "Wazza17",
      "body": "Had a Dell XPS retired it after 10 years as it was too expensive to repair. Amazing workhorse",
      "score": 1,
      "created_utc": 1736217090.0,
      "replies": []
    },
    {
      "id": "m5t3ulx",
      "author": "SniperPilot",
      "body": "Damn. I kinda like my XPS",
      "score": 1,
      "created_utc": 1736217274.0,
      "replies": []
    },
    {
      "id": "m5t4bpu",
      "author": "PB-n-AJ",
      "body": "A sad day. I had gotten the original Inspiron XPS back in 2004. A magnificent 11 pound beast with a battery subwoofer that could run Doom 3 on medium/high settings. My window to Counter-Strike Source, World of Warcraft, countless emulators, Albino Blacksheep, NewGrounds... absolute *legend* of a machine that spearheaded the line to come.  \n  \nGodspeed, XPS.",
      "score": 1,
      "created_utc": 1736217439.0,
      "replies": []
    },
    {
      "id": "m5t9k8u",
      "author": "None",
      "body": "it's all marketing, now all of a sudden AI powered laptops? gtfo this isn't gonna last long, they should've released an Alienware portable console instead of taking this off the market.",
      "score": 1,
      "created_utc": 1736219260.0,
      "replies": []
    },
    {
      "id": "m5tdoxy",
      "author": "markofthebeast143",
      "body": "So basically, they’ve cut out the SPS to just try to stick to the names Max or pro",
      "score": 1,
      "created_utc": 1736220708.0,
      "replies": []
    },
    {
      "id": "m5tihvq",
      "author": "802islander",
      "body": "![gif](giphy|7k2LoEykY5i1hfeWQB)",
      "score": 1,
      "created_utc": 1736222488.0,
      "replies": []
    },
    {
      "id": "m5to1h8",
      "author": "Smile_Space",
      "body": "We are rapidly approaching AI max stupid, and once we reach max stupid with AI we'll see a contraction of the AI buzzword and stock market economy driving the stupid.",
      "score": 1,
      "created_utc": 1736224762.0,
      "replies": []
    },
    {
      "id": "m5tt078",
      "author": "whatwhatwhodat",
      "body": "Good because their most recent line of xps laptops suck ass.  Nothing but problems with the ones we bought recently.",
      "score": 1,
      "created_utc": 1736226951.0,
      "replies": []
    },
    {
      "id": "m5twmby",
      "author": "aceofrazgriz",
      "body": "XPS was always lacking compared to Latitude, so whats the guff? On the corporate side, we'll no longer have execs asking for XPS laptops due to name recognition and ending up supporting consumer grade hardware.\n\nBut yeah the naming scheme is complete trash. \"Dell\" \"Dell Pro Plus\" \"Dell Pro Premium\" \"Dell Pro MAX whatever\".... uuuuugggggghhh",
      "score": 1,
      "created_utc": 1736228674.0,
      "replies": []
    },
    {
      "id": "m5txdns",
      "author": "rebeldefector",
      "body": "The current offerings are horrible\n\nYou want bigger than 15”? Or maybe a ten key?\n\nThat will be $4000",
      "score": 1,
      "created_utc": 1736229047.0,
      "replies": []
    },
    {
      "id": "m5tzgmi",
      "author": "fullload93",
      "body": "Who the hell is buying Dell computers nowadays except for companies? I haven’t bought a Dell computer since 2005. However my company used to use Dell and recently they switched over to HP instead.",
      "score": 1,
      "created_utc": 1736230112.0,
      "replies": []
    },
    {
      "id": "m5u0dya",
      "author": "drfsupercenter",
      "body": "I think Dell got the date for April Fool's Day wrong",
      "score": 1,
      "created_utc": 1736230603.0,
      "replies": []
    },
    {
      "id": "m5u30si",
      "author": "rudyattitudedee",
      "body": "Too bad. I really like mine. Works well and is 4 years old, still a champ.",
      "score": 1,
      "created_utc": 1736232039.0,
      "replies": []
    },
    {
      "id": "m5u3h16",
      "author": "bindermichi",
      "body": "\"British motoring journalist being surprised and swiftly moving on to the next topic\"",
      "score": 1,
      "created_utc": 1736232292.0,
      "replies": []
    },
    {
      "id": "m5u4jdn",
      "author": "PoorMansTonyStark",
      "body": "Meh. There goes the only linux-supporting notebook which somewhat looks and feels like a macbook. It's back to the middle-ages for linux-users! What a rubbish world.",
      "score": 1,
      "created_utc": 1736232896.0,
      "replies": []
    },
    {
      "id": "m5u5bwi",
      "author": "CzechWhiteRabbit",
      "body": "Oh my God. Is a retired psychologist/And full stack programmer, what the hell! Pretty soon computers in their AI are going to have artificial existential crisises about their purpose and being.",
      "score": 1,
      "created_utc": 1736233353.0,
      "replies": []
    },
    {
      "id": "m5u800t",
      "author": "MrNerd82",
      "body": "I've exclusively bought their XPS line for the past... 15 years or so?\n\nFrom work to light gaming on the road.   Guess that's all done.   I flat refuse to give dell money now if this is the type of shit they want to peddle. \n\nif you have to describe a product as \"Ultra max pro plus plus BBC XXL\" laptop.... nope.   I will literally buy anything else now (except HP) lol",
      "score": 1,
      "created_utc": 1736234948.0,
      "replies": []
    },
    {
      "id": "m5u9nml",
      "author": "cait_elizabeth",
      "body": "Wait so if someone was to buy one of these before they’re off market which would you recommend?",
      "score": 1,
      "created_utc": 1736235963.0,
      "replies": []
    },
    {
      "id": "m5udwpf",
      "author": "Enough-Meaning1514",
      "body": "Shame really. I liked the XPS line-up. Never considered buying one because the performance it delivered never justified the price but I liked using them when companies gave them as company laptops. In that regard, I understand why Dell decided to drop the line up. I suspect not many individuals can afford them and companies could get pretty much the same experience with Dell's Latitude lineup.",
      "score": 1,
      "created_utc": 1736238674.0,
      "replies": [
        {
          "id": "m5vai3r",
          "author": "ratonbox",
          "body": "Last series was shit, I’m happy my workplace moved on the the Lenovo X1.",
          "score": 3,
          "created_utc": 1736256875.0,
          "replies": [
            {
              "id": "m5vsay0",
              "author": "Enough-Meaning1514",
              "body": "In comparison, the X1 is a superior product.",
              "score": 1,
              "created_utc": 1736263177.0,
              "replies": [
                {
                  "id": "m5w2baq",
                  "author": "ratonbox",
                  "body": "I just got mine a few weeks ago, I like it so far.",
                  "score": 1,
                  "created_utc": 1736266245.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m5uhrvh",
      "author": "Mr_Lumbergh",
      "body": "I won’t miss them. After owning two Dells I’ve learned not to buy them.",
      "score": 1,
      "created_utc": 1736241231.0,
      "replies": []
    },
    {
      "id": "m5vmfl8",
      "author": "samz22",
      "body": "I remember when I was in hs, these were comparable to Mac’s. They just had dropped the new models but then they went touch screen and 2in 1 I think and just lowered their value to a hp🥲",
      "score": 1,
      "created_utc": 1736261250.0,
      "replies": []
    },
    {
      "id": "m5vq8p5",
      "author": "Atomic_meatballs",
      "body": "I just bought an 8960 desktop. It's a solid machine - I am very pleased with it. \n\nAs a consumer, I do not see any value in this rebranding. Smells of desperation.",
      "score": 1,
      "created_utc": 1736262513.0,
      "replies": []
    },
    {
      "id": "m5vt4s7",
      "author": "Shifted4",
      "body": "I turn off the AI stuff. Not sure if people actually want or care about it but I certainly don't. They have found a way to suck up even more private data than they already were to train their AI.",
      "score": 1,
      "created_utc": 1736263438.0,
      "replies": []
    },
    {
      "id": "m5vvb4u",
      "author": "mikeboucher21",
      "body": "Well I mean alienware has pretty much been an XPS since dell bought them. So seems more like a rebranding.",
      "score": 1,
      "created_utc": 1736264122.0,
      "replies": []
    },
    {
      "id": "m5w22zf",
      "author": "MisterFingerstyle",
      "body": "I don’t want AI anything. I have apple gear and have opted out of all of it. If I need AI I can find it online.",
      "score": 1,
      "created_utc": 1736266174.0,
      "replies": []
    },
    {
      "id": "m5wug1k",
      "author": "captainthor",
      "body": "I had a Dell XPS Win 10 PC. It was the shortest lived PC I ever had, and gave me more software and hardware problems than any other PC (and I've been using Windows since 2001, and owned all the major brands I believe). USB ports would play musical chairs about stopping functioning, and stuff like that. I spent lots of time troubleshooting the thing the last year or two I had it. Finally the hard drive died (or else something else with the machine made it inaccessible). Oh, and it arrived at my house with the graphics card inside not properly seated. Googling the problem led me to mucking around with the drivers (I ran on the motherboard Intel graphics in the meantime), and ended up screwing up the drivers somehow, so that even after manually reseating the card, I never could get the card to work.\n\nThis PC had rave reviews in the major PC magazines.",
      "score": 1,
      "created_utc": 1736274467.0,
      "replies": []
    },
    {
      "id": "m5wzum0",
      "author": "RepostStat",
      "body": "getting rid of the only Dell laptop that most consumers could name is truly insane",
      "score": 1,
      "created_utc": 1736276015.0,
      "replies": []
    },
    {
      "id": "m5x6j8l",
      "author": "MadAkay",
      "body": "good.. overpriced trash",
      "score": 1,
      "created_utc": 1736277952.0,
      "replies": []
    },
    {
      "id": "m5xx6gq",
      "author": "andersonle09",
      "body": "[Ironic that this was the ad promoted on this thread.](https://imgur.com/a/BtCbr4S)",
      "score": 1,
      "created_utc": 1736285617.0,
      "replies": []
    },
    {
      "id": "m5yaloo",
      "author": "PsychologicalArm107",
      "body": "They had a fantastic run.",
      "score": 1,
      "created_utc": 1736289610.0,
      "replies": []
    },
    {
      "id": "m5yd6yt",
      "author": "maniacmartin",
      "body": "Why don't they just go ahead and rename it to the DellBook whilst they're at it.",
      "score": 1,
      "created_utc": 1736290409.0,
      "replies": []
    },
    {
      "id": "m5yre5j",
      "author": "tofuchrispy",
      "body": "This is so stupid. I never had one but XPS is the thing I remember! Man it’s a brand it’s recognition. They throw it away… well then suffer you idiots. \n\nLike Lenovo ending „thinkpad“ or smth…",
      "score": 1,
      "created_utc": 1736295038.0,
      "replies": []
    },
    {
      "id": "m60vgif",
      "author": "linux_n00by",
      "body": "and thinkpads getting removed their trackpoints",
      "score": 1,
      "created_utc": 1736328064.0,
      "replies": []
    },
    {
      "id": "m63pp9f",
      "author": "None",
      "body": "Damn. I have an XPS and it’s been great.",
      "score": 1,
      "created_utc": 1736366000.0,
      "replies": []
    },
    {
      "id": "m6cihir",
      "author": "lynk_messenger",
      "body": "I keep getting ads on tiktok for a \"revolutionary, ai-powered washing machine\". I couldn't think of anything more useless.",
      "score": 1,
      "created_utc": 1736480925.0,
      "replies": [
        {
          "id": "m6dcr4v",
          "author": "spinosaurs70",
          "body": "Internet of things is stupid already.",
          "score": 1,
          "created_utc": 1736495565.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5rvsma",
      "author": "looncraz",
      "body": "Good, the branding mostly just confused people.\n\nBut they really should just get rid of the XPS and Precision engineering teams or have them migrate to use the Latitude team design language.  There's no reason those systems have to be so difficult to disassemble and repair.",
      "score": -2,
      "created_utc": 1736202692.0,
      "replies": [
        {
          "id": "m5rzal2",
          "author": "None",
          "body": "“the branding mostly just confused people” methinks you probably haven’t read the article where they describe the new naming conventions…",
          "score": 19,
          "created_utc": 1736203790.0,
          "replies": []
        },
        {
          "id": "m5twrt2",
          "author": "aceofrazgriz",
          "body": "Inspiron = Consumer\n\nXPS  = Prosumer\n\nLatitude = Enterprise\n\nPrecision = Higher-Performance Enterprise\n\n\nPretty cut an dry.",
          "score": 2,
          "created_utc": 1736228750.0,
          "replies": []
        },
        {
          "id": "m5tdce6",
          "author": "613codyrex",
          "body": "The precision and XPS laptops are so much easier to disassemble than their latitude????? \n\nAt least I don’t have to fight with garbage Phillips head screws and weak ass plastic to crack open an XPS or precision laptop.",
          "score": 1,
          "created_utc": 1736220596.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5t87qt",
      "author": "juststart",
      "body": "Dead company",
      "score": 0,
      "created_utc": 1736218789.0,
      "replies": []
    },
    {
      "id": "m5s8t6k",
      "author": "danmickla",
      "body": "Did \"XPS\" ever mean anything to anyone anyway?  Wasn't it always a meaningless brand?",
      "score": 1,
      "created_utc": 1736206888.0,
      "replies": [
        {
          "id": "m5ss1zz",
          "author": "iamasatellite",
          "body": "I had one through work like 15 years ago and it was pretty sweet\n\n\nI have one through work now and it's pretty stupid ",
          "score": 2,
          "created_utc": 1736213265.0,
          "replies": [
            {
              "id": "m5svfhx",
              "author": "danmickla",
              "body": "cool, so, on the sweet-stupid measurement scale, with two examples, XPS is meaningless",
              "score": 0,
              "created_utc": 1736214385.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m5scvpw",
      "author": "haahaahaa",
      "body": "So making a Macbook clone didn't work well enough.  They had to rename it to match Apples branding to really get the point through.",
      "score": 1,
      "created_utc": 1736208236.0,
      "replies": []
    },
    {
      "id": "m5sl2bx",
      "author": "None",
      "body": "I have yet to be shown a single use for AI that actually helps me and doesn’t just make my life harder",
      "score": 1,
      "created_utc": 1736210944.0,
      "replies": []
    },
    {
      "id": "m5t23us",
      "author": "ltmikepowell",
      "body": "They are making Dell, Dell Pro, and Dell Pro Max.",
      "score": 1,
      "created_utc": 1736216675.0,
      "replies": []
    },
    {
      "id": "m5tflag",
      "author": "ramriot",
      "body": "In this century has dell actually ever made a laptop or notebook computer?\n\nIsn't all their production done overseas under licence & contract?",
      "score": 1,
      "created_utc": 1736221384.0,
      "replies": []
    },
    {
      "id": "m5ukzh7",
      "author": "alkrk",
      "body": "Thinkpad to go!",
      "score": 1,
      "created_utc": 1736243387.0,
      "replies": []
    },
    {
      "id": "m5upw0a",
      "author": "Paltenburg",
      "body": "Whyyyy... like, what is their business model at all?\n\nMore serious question: What laptop do I get if I want a MacBook, but with Windows? (and I'm not getting a macbook and installing windows on it)",
      "score": 1,
      "created_utc": 1736246562.0,
      "replies": [
        {
          "id": "m5v2cpv",
          "author": "siliconeNerd",
          "body": "Asus ProArt P16",
          "score": 1,
          "created_utc": 1736253392.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5sa99r",
      "author": "DJSugarSnatch",
      "body": "Dell should just crawl off in the swamp of forgotten garbage along with the Alienware line of theirs.\n\nBeen garbage for a long time. Nothing had changed.\n\nIf you buy a Dell, I figure you're missing your frontal lobe.",
      "score": -4,
      "created_utc": 1736207369.0,
      "replies": []
    },
    {
      "id": "m5skdrd",
      "author": "mantcona",
      "body": "Dell still makes computers?",
      "score": 0,
      "created_utc": 1736210719.0,
      "replies": []
    },
    {
      "id": "m5t0k88",
      "author": "dezerx212256",
      "body": "No more Xtream Pieces of Shite.",
      "score": 0,
      "created_utc": 1736216139.0,
      "replies": []
    },
    {
      "id": "m5tfzxc",
      "author": "ErgoProxy0",
      "body": "Worse than HP laptops imo. I went jury duty a couple years ago and the prosecutor had one of these. Sound wasn’t loud, it had trouble loading a cd and I think it even rebooted once",
      "score": 0,
      "created_utc": 1736221532.0,
      "replies": [
        {
          "id": "m5uhakd",
          "author": "NobleRotter",
          "body": "Opposite of my experience. I wanted a change from XPS as I felt they'd gone downhill. Tried both Lenovo and HP as alternatives and felt both were considerably worse. Small sample but it sent me back to XPS",
          "score": 1,
          "created_utc": 1736240912.0,
          "replies": [
            {
              "id": "m5vgoua",
              "author": "ErgoProxy0",
              "body": "HP laptops always gave out on me somehow after 2 or so years. I went with Asus and so far the only issue I have after a few years is heating issues",
              "score": 1,
              "created_utc": 1736259224.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m5tojh0",
      "author": "digibeta",
      "body": "Dear accountants and marketeers. Stop ruining things for us with your incompetence. Thank you!",
      "score": 0,
      "created_utc": 1736224975.0,
      "replies": []
    },
    {
      "id": "m5u999h",
      "author": "ITGuy7337",
      "body": "I've had XPS laptops for years and years. They were always pretty good, but I think slowly the build quality has degraded.",
      "score": 0,
      "created_utc": 1736235714.0,
      "replies": []
    }
  ]
}