{
  "post": {
    "title": "Aluminum PP-1 turntable plays vinyl records without tonearm",
    "author": "diacewrb",
    "id": "1j3dcb3",
    "score": 145,
    "created_utc": 1741102199.0,
    "selftext": "",
    "num_comments": 32,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1j3dcb3/aluminum_pp1_turntable_plays_vinyl_records/"
  },
  "comments": [
    {
      "id": "mfzes66",
      "author": "skriefal",
      "body": "Initially I thought that this used a laser or other optical mechanism to read the grooves.  There are cartridges that attach to traditional tonearms that do this, and which connect to an external box to convert the digital/optical signals to an analog signal.\n\nBut the [specs](https://www.waiting-for-ideas.com/projects/pp-1-by-waiting-for-ideas) state that this uses a 0.4 x 0.7 mil elliptical stylus.  A pretty basic elliptical stylus - that presumably lifts upwards from below the LP on a linear tonearm, playing the bottom side of the LP.\n\nThis may be interesting for $1000.  But not for $6000.",
      "score": 105,
      "created_utc": 1741105579.0,
      "replies": [
        {
          "id": "mg09scw",
          "author": "noblecloud",
          "body": "So basically it's like a CD player where it reads from underneath but with a styles instead of a laser?",
          "score": 42,
          "created_utc": 1741114145.0,
          "replies": [
            {
              "id": "mg0ddz0",
              "author": "skriefal",
              "body": "I suppose it is like that, yes.  Both use a \"sensor\" (laser, stylus) that moves along a linear track while playing the disc.\n\nAnd this turntable probably also has a laser or optical sensor.  Which would be used to detect the gaps between the tracks on the LP for the next track / previous track feature.  There were turntables in the '80s that did this and it worked fairly well iirc, but could glitch when playing clear (non-black) LPs.",
              "score": 19,
              "created_utc": 1741115145.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mg7xwxt",
          "author": "fleemfleemfleemfleem",
          "body": "> But not for $6000.\n\nThe audiophile world is just that way. \n\nYou get people to buy into the idea that a vinyl record is somehow better than a digital file. Then they need to get $3000 speakers, then they need $5000 in treatment for the room. Then they need $200 cables for reasons that defy physics. Then they need to upgrade the player since there's no sense in pairing $3000 speakers with an $80 player. Then for the $6000 player, no reason to cheap out on the amplifier... \n\nMeanwhile they'd have gotten better sound out of a file on their phone and $300 headphones. \n\nSound quality is inherently subjective and highly sensitive to placebo effect, so you can't use data to convince people who shelled out $14200 to listen to a scratched up 50 year old record that it doesn't sound that good. They know what they hear.",
          "score": 9,
          "created_utc": 1741210443.0,
          "replies": [
            {
              "id": "mg8rti2",
              "author": "skriefal",
              "body": "I used to be an audiophile and am still a sorta-fringe kinda-audiophile.  Never really cared about expensive cables though (esp. expensive power cables), or the pseudo-science accessories like the magic crystals/stones and such.\n\nI suspect that most audiophiles wouldn't buy this turntable.  They'd prefer to spend the $6K on something from VPI, Rega, or similar; and a *nice* phono cartridge.",
              "score": 2,
              "created_utc": 1741219525.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mfzlnzj",
      "author": "dustofdeath",
      "body": "So it's a underside linear needle player?\nSo instead of light weight arm, the entire disk presses on the needle?",
      "score": 24,
      "created_utc": 1741107457.0,
      "replies": [
        {
          "id": "mfzvxt5",
          "author": "tampering",
          "body": "LOL i was going to say the same thing. The whole reason the arm floats over the disc is to minimize the possibility of a weight causing damage to the media as it plays.\n\nDoes the engineerof this record player have a future in making deep sea submarines out of carbon fiber reinforced PVC?",
          "score": 14,
          "created_utc": 1741110293.0,
          "replies": []
        },
        {
          "id": "mg6572u",
          "author": "Regular_Ram",
          "body": "The vinyl rests on a turn table where the label is, it’s not resting on the stylus. The stylus coming from the bottom could theoretically exert 0 force.",
          "score": 6,
          "created_utc": 1741192467.0,
          "replies": []
        },
        {
          "id": "mg04j5j",
          "author": "skriefal",
          "body": "> So it's a underside linear needle player?\n\nIt seems so.",
          "score": 2,
          "created_utc": 1741112666.0,
          "replies": [
            {
              "id": "mg0jd66",
              "author": "sonysony86",
              "body": "lol I read undersea linear needle player 🤣",
              "score": 1,
              "created_utc": 1741116797.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mfz6nig",
      "author": "fuzzbox000",
      "body": "So does it read by laser? Is it horizontal tracking? Article leaves a lot of information unknown for $6k.",
      "score": 21,
      "created_utc": 1741103326.0,
      "replies": []
    },
    {
      "id": "mfzfzko",
      "author": "None",
      "body": "Hmm, no mention of the cartridge.\n\n\"USB and speaker ports\"\n\nIs this some gimmick? No high end turntable has those electronics.",
      "score": 11,
      "created_utc": 1741105909.0,
      "replies": [
        {
          "id": "mfzmb1f",
          "author": "_Administrator",
          "body": "is no highend. is haute couture",
          "score": 16,
          "created_utc": 1741107629.0,
          "replies": [
            {
              "id": "mg06uzg",
              "author": "skriefal",
              "body": "Yes - form over function.  If that's what someone is looking for and $6K isn't a problem for them, then fine.  For most things, I prefer function over form (well, maybe a *little* bit of form is okay...).",
              "score": 4,
              "created_utc": 1741113331.0,
              "replies": [
                {
                  "id": "mg09aqv",
                  "author": "_Administrator",
                  "body": "this player will be a dust magnet, and yes it looks kool, but it is soo impractical",
                  "score": 1,
                  "created_utc": 1741114010.0,
                  "replies": [
                    {
                      "id": "mg0akua",
                      "author": "skriefal",
                      "body": "Yeah, dust could be an issue.  Turntables without dust covers weren't uncommon in the past (and still exist in the high end space) - but that was usually 'fixed' by placing a hanky or similar on top of the turntable when not in use.  Someone who lays out the coin for this turntable probably won't want a hanky, bandana, or towel detracting attention from their work of art.",
                      "score": 3,
                      "created_utc": 1741114365.0,
                      "replies": [
                        {
                          "id": "mg0deks",
                          "author": "_Administrator",
                          "body": "I use an old baby cloth and have a dust cover. And it is stil dusty. I have no money for decent hvac. Will buy airpurifier next month though",
                          "score": 2,
                          "created_utc": 1741115149.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mfzvel3",
      "author": "Soulstar909",
      "body": "You know what else doesn't use a tonearm? Everything from cassette players onwards.",
      "score": 5,
      "created_utc": 1741110147.0,
      "replies": []
    },
    {
      "id": "mfz4scy",
      "author": "igby1",
      "body": "$6,000 \n\nhttps://www.theverge.com/news/621863/waiting-for-ideas-pp-1-turntable-solid-aluminum-vinyl-record",
      "score": 6,
      "created_utc": 1741102800.0,
      "replies": []
    },
    {
      "id": "mfzx554",
      "author": "WMU_FTW",
      "body": "Half the comments in here\n\n \"they lie, it must have a tonearm!!\".  \n\nThe other half \"it uses laser/optical pickup\"\n\nThe article \"uses a hidden tone arm and elliptical stylis.  These are hidden from view by a set of doors when not in use\".",
      "score": 4,
      "created_utc": 1741110627.0,
      "replies": [
        {
          "id": "mg004dh",
          "author": "fuzzbox000",
          "body": "Am I missing something? I did a search on the word \"tone\" and \"elliptical\" and didn't find either. \n\nAnd in case anyone is listening, a hidden tonearm is different than \"no tonearm\"",
          "score": 5,
          "created_utc": 1741111449.0,
          "replies": [
            {
              "id": "mg25jev",
              "author": "WMU_FTW",
              "body": "Try searching as one word \"tonearm\".\n\nElliptical will only be found in the article itself I think, though maybe one commenter used the word.",
              "score": 2,
              "created_utc": 1741133720.0,
              "replies": [
                {
                  "id": "mgahcio",
                  "author": "fuzzbox000",
                  "body": "You must be reading a different article than me. I see 8 instances of \"tonearm\", all referring to how it doesn't have one.",
                  "score": 2,
                  "created_utc": 1741243772.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mg2k8ia",
      "author": "Y-27632",
      "body": "When paying $6000 mostly for esthetics, I'd expect knobs/buttons aligned with their openings...",
      "score": 2,
      "created_utc": 1741138460.0,
      "replies": []
    },
    {
      "id": "mfza1pc",
      "author": "None",
      "body": "political physical quaint encouraging quack grey automatic normal cats summer\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "score": 7,
      "created_utc": 1741104271.0,
      "replies": [
        {
          "id": "mfzc3xm",
          "author": "Drizznarte",
          "body": "If it is read with a laser it's still analogue !",
          "score": 2,
          "created_utc": 1741104841.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mfzf4n8",
      "author": "ughnotanothername",
      "body": "Looks neat but I don’t see anything mentioning *how* it reads the disc.",
      "score": 3,
      "created_utc": 1741105675.0,
      "replies": []
    },
    {
      "id": "mgcuz2j",
      "author": "the_loneliest_noodle",
      "body": "This isn't new tech. It's been done a few times before, and it's always been a bad idea. It makes the stylus much more difficult to upgrade/replace, and limits the stylus to a weird niche form factor so people who are about sound can't use their stylus of choice.\n\n\nThis has been done for a fraction of the price and wasn't successful even then. ",
      "score": 2,
      "created_utc": 1741280262.0,
      "replies": []
    },
    {
      "id": "mg3ikg8",
      "author": "CatchaRainbow",
      "body": "Amstrad sold exactly this in the 1980s?",
      "score": 1,
      "created_utc": 1741150502.0,
      "replies": []
    },
    {
      "id": "mg3tm4t",
      "author": "None",
      "body": "So an analogy cd player…",
      "score": 0,
      "created_utc": 1741155564.0,
      "replies": []
    },
    {
      "id": "mg518qr",
      "author": "CDavis10717",
      "body": "Does dust distort the sound or does software ignore that, a problem with earlier laser tone arms that basically killed the market for devices like this.\n\nIf so, just give me the MP3’s of the album from a massive library similar to the now-defunct www.mp3.com from 20yrs ago.",
      "score": 0,
      "created_utc": 1741179657.0,
      "replies": []
    }
  ]
}