{
  "post": {
    "title": "Reviewers report GeForce RTX 5090 for laptops is 50 percent slower than desktop version",
    "author": "chrisdh79",
    "id": "1jo0nl5",
    "score": 1852,
    "created_utc": 1743419391.0,
    "selftext": "",
    "num_comments": 182,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jo0nl5/reviewers_report_geforce_rtx_5090_for_laptops_is/"
  },
  "comments": [
    {
      "id": "mko0und",
      "author": "w1n5t0nM1k3y",
      "body": "The 5090 is a 600w GPU. Why even pretend that a laptop is ever going to have anything close o equivalent. Hey really should just have a completely different line of GPUs for laptops with different names so consumers don't get confused or mislead.",
      "score": 841,
      "created_utc": 1743419648.0,
      "replies": [
        {
          "id": "mko4cto",
          "author": "None",
          "body": "[deleted]",
          "score": 355,
          "created_utc": 1743421355.0,
          "replies": [
            {
              "id": "mkpnacz",
              "author": "fmaz008",
              "body": "It would be so much simpler if NVidia kept the series aligned so the rops/cores were equal, nd just not offer 5090 on laptops.\n\nThe mobile 5090 should be called a 5070 (or whatever the specs actually correspond to).\n\n... but I guess they can sell the fake 5090 for more so who cares.",
              "score": 37,
              "created_utc": 1743439811.0,
              "replies": [
                {
                  "id": "mkrtsld",
                  "author": "creative_usr_name",
                  "body": "It's worse than that because equal rops/cores could still have different power budgets on different laptops. The best thing for consumers would be to match laptop naming as closely as possible to desktop performance.",
                  "score": 11,
                  "created_utc": 1743464131.0,
                  "replies": []
                },
                {
                  "id": "mktw9pc",
                  "author": "_Dreamer_Deceiver_",
                  "body": "Or do what they do with CPUs and just stick a U on the end",
                  "score": 1,
                  "created_utc": 1743500305.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mkp925f",
              "author": "afternever",
              "body": "And burninating their thatched roof cottages",
              "score": 37,
              "created_utc": 1743435543.0,
              "replies": [
                {
                  "id": "mkpeyh1",
                  "author": "Zamzummin",
                  "body": "I said consummate V’s! CONSUMMATE!",
                  "score": 22,
                  "created_utc": 1743437299.0,
                  "replies": [
                    {
                      "id": "mks4041",
                      "author": "radicalbiscuit",
                      "body": "DAGRON",
                      "score": 5,
                      "created_utc": 1743467812.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mkrd092",
                  "author": "3-DMan",
                  "body": "Teen Girl Squad in shambles",
                  "score": 4,
                  "created_utc": 1743458389.0,
                  "replies": []
                },
                {
                  "id": "mkrhqrv",
                  "author": "EterneX_II",
                  "body": "Behold! My Burninator!!",
                  "score": 4,
                  "created_utc": 1743459992.0,
                  "replies": []
                },
                {
                  "id": "mku4e3q",
                  "author": "Dragon_yum",
                  "body": "![gif](giphy|g84EyzElhVoD6)",
                  "score": 3,
                  "created_utc": 1743505191.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mkq5i9f",
              "author": "3dgemaster",
              "body": "It's misleading only if you were born yesterday. In terms of laptop GPUs it's still the best thing out there. The fact that it's less powerful than its desktop counterpart is not exactly breaking news, this has been the case since forever.",
              "score": -15,
              "created_utc": 1743445184.0,
              "replies": [
                {
                  "id": "mkqlfdb",
                  "author": "Lemonrays",
                  "body": "You're literally on r/Gadgets. You have an interest in this topic; pick some random schmuck off the street and ask them to tell you what the difference between laptop and desktop GPU's is. It's misleading to most consumers not heavily invested in the conversations at hand. Don't be disingenuous just because you think everyone shares the same knowledge as you.",
                  "score": 14,
                  "created_utc": 1743449965.0,
                  "replies": [
                    {
                      "id": "mkqp1gg",
                      "author": "3dgemaster",
                      "body": "Valid point. But I'd argue the people you are referring to are the same people who don't really care much, as they can't tell one GPU from another.",
                      "score": -7,
                      "created_utc": 1743451025.0,
                      "replies": [
                        {
                          "id": "mkrhazi",
                          "author": "LneWolf",
                          "body": "Those are the people who would be mislead into buying a “5090” thinking it’s the same card as the desktop version. Because they’re literally the same fucking name. It doesn’t matter that they “don’t care”. Their money isn’t worth less. It isn’t okay to fool a group of buyers because they aren’t nerds.",
                          "score": 8,
                          "created_utc": 1743459840.0,
                          "replies": [
                            {
                              "id": "mkt4f7s",
                              "author": "3dgemaster",
                              "body": "I don't see it as fooling anyone. Once upon a time nvidia used to designate laptop chips with an M, for that very reason. But your average user doesn't care. They don't look at the M and think well this probably means it's less powerful than the one without an M. I think this is whole thing is classic rage bait. Don't get me wrong tho, nvidia is plenty capable of being scummy with their naming schemes. I just don't see it here.",
                              "score": -3,
                              "created_utc": 1743482594.0,
                              "replies": [
                                {
                                  "id": "mkt4nj6",
                                  "author": "LneWolf",
                                  "body": "You’re a fool to think naming two products the same thing, while one is significantly less powerful isn’t deceiving the consumer. You need to rethink your mental gymnastics. I’m not continuing this further with you.",
                                  "score": 9,
                                  "created_utc": 1743482712.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mkr6hxq",
                  "author": "Specialist-Rope-9760",
                  "body": "The product isn’t the issue. It’s the intentionally misleading naming.",
                  "score": 3,
                  "created_utc": 1743456291.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mkrb847",
              "author": "None",
              "body": "[removed]",
              "score": -13,
              "created_utc": 1743457811.0,
              "replies": [
                {
                  "id": "mkrv0t4",
                  "author": "jcdoe",
                  "body": "You are accurate, but you’re also being a jerk.  And it isn’t called for.\n\nNvidia does their best to hide that little m, and the only reason they use the same naming scheme as their desktop cards is to confuse consumers.",
                  "score": 8,
                  "created_utc": 1743464556.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mko2bwv",
          "author": "alman12345",
          "body": "I’m fairly certain they do it both because the “mobile 5090” is the best they could squeeze into a laptop chassis while maintaining decent boost clocks and because it sells for more when people think they’re getting a 90 class.",
          "score": 75,
          "created_utc": 1743420382.0,
          "replies": [
            {
              "id": "mkohira",
              "author": "Trisa133",
              "body": "Laptops can only handle 160w sustained tdp. So even if they actually give you the real 5090 chip, the most power that chip will get is 100w. It may not even reach 60% of the performance. \n\nThe laptops that can go 200+ watts had dual power supply.",
              "score": 12,
              "created_utc": 1743426733.0,
              "replies": [
                {
                  "id": "mkop0zg",
                  "author": "sk3tchcom",
                  "body": "That’s just not true. The RAZER Blade 14 has a 230W power supply and there’s behemoth laptops with 330W power supplies.\n\nEDIT: I misunderstood what they were referring to and got clarity - thanks!",
                  "score": 8,
                  "created_utc": 1743429351.0,
                  "replies": [
                    {
                      "id": "mkounnr",
                      "author": "andynator1000",
                      "body": "It's charging brick is 230W, but you're still only getting 140W to the GPU.",
                      "score": 23,
                      "created_utc": 1743431154.0,
                      "replies": [
                        {
                          "id": "mkouxtq",
                          "author": "sk3tchcom",
                          "body": "Ah right - TDP to the CPU or GPU not all",
                          "score": 8,
                          "created_utc": 1743431244.0,
                          "replies": [
                            {
                              "id": "mkozz81",
                              "author": "Trisa133",
                              "body": "TDP is thermal dissipation. You can have a 800 watt psu if you want. It will throttle after it heats up. The big laptops can dissipate more than 200w if the fans are screaming but none can dissipate a sustained 300w afaik",
                              "score": 12,
                              "created_utc": 1743432792.0,
                              "replies": [
                                {
                                  "id": "mkpaq90",
                                  "author": "Eteel",
                                  "body": "Back in the day I had the MSI GT72 Dominator Pro G. It was a huge, heavy laptop with a single 230W power supply unit. It didn't actually get that hot, but that's because it was huge with a lot of space for air ventilation. It's definitely not an office laptop, but people who are buying laptops like that aren't buying them for the office.\n\nI believe there was a dragon edition with 980M SLI which had dual power supplies. That one was one hell of a laptop.",
                                  "score": 3,
                                  "created_utc": 1743436044.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mkoyy8r",
                      "author": "rokman",
                      "body": "A lappy with a 330w power supply must have been one hot puppy to keep on your legs",
                      "score": 4,
                      "created_utc": 1743432483.0,
                      "replies": [
                        {
                          "id": "mkp318p",
                          "author": "sk3tchcom",
                          "body": "Haha yes I don’t bother with that size",
                          "score": 2,
                          "created_utc": 1743433715.0,
                          "replies": []
                        },
                        {
                          "id": "mkrdiox",
                          "author": "3-DMan",
                          "body": "\"Run faster, puppies!  My FPS are tanking!!\"",
                          "score": 1,
                          "created_utc": 1743458560.0,
                          "replies": []
                        },
                        {
                          "id": "mkpx446",
                          "author": "yoweigh",
                          "body": "Lol, \"lappy\" has been the network hostname of my primary mobile machine for two decades now. Typing UNC paths is so much easier with that muscle memory in my fingers. I also used a surface pro 3 for a while and called it tabby, and my desktop is called toppy. 😛\n\n*I think I originally got lappy from Strong Bad!",
                          "score": 1,
                          "created_utc": 1743442710.0,
                          "replies": [
                            {
                              "id": "mksau6p",
                              "author": "_RADIANTSUN_",
                              "body": "You'd love Strong Bad Emails from HomeStarRunner",
                              "score": 2,
                              "created_utc": 1743470335.0,
                              "replies": [
                                {
                                  "id": "mkseprp",
                                  "author": "yoweigh",
                                  "body": "That's where I got it from! I was in high school when homestar was a thing.",
                                  "score": 1,
                                  "created_utc": 1743471800.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mkoi1a3",
                  "author": "alman12345",
                  "body": "Honestly I’d be surprised if it reached 60, the issue with such large silicon is that it reaches a point of extremely diminished performance when the power envelope is restricted too far. Coincidentally, this is also usually why manufacturers decide that an actual 202 die isn’t even worth it and go with the 203 die instead. It’s in the same vein as why the Steam Deck’s APU can do some pretty amazing things with a very restrictive power envelope even compared to newer and more advanced silicon like the Z1E or even the HX370.",
                  "score": 1,
                  "created_utc": 1743426923.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mko9cx7",
          "author": "Mainbaze",
          "body": "600W keeps sounding so insane to me. That’s half a microwave, or half a water kettle running all your gaming hours.\n\nThen you also have the CPU and screen + misc",
          "score": 50,
          "created_utc": 1743423540.0,
          "replies": [
            {
              "id": "mkojrcq",
              "author": "locofspades",
              "body": "And surprisingly, my energy bill hasnt skyrocketed or anything in the 2 years ive had mine lol",
              "score": 9,
              "created_utc": 1743427545.0,
              "replies": [
                {
                  "id": "mkqcszt",
                  "author": "Inprobamur",
                  "body": "It's not gonna run 100% most of the time.",
                  "score": 16,
                  "created_utc": 1743447378.0,
                  "replies": []
                },
                {
                  "id": "mkomssb",
                  "author": "Mainbaze",
                  "body": "Well it’s definitely gonna be noticeable if you game every day, but if you’re a 5090 customer to start with it’s likely not too bad lol (like 200$ per year if 3h a day)",
                  "score": 8,
                  "created_utc": 1743428613.0,
                  "replies": [
                    {
                      "id": "mkop49l",
                      "author": "locofspades",
                      "body": "My 4090 build was my first pc in decades, and im def gaming daily lol (i put like 12 hrs into schedule 1 this weekend alone ha ha) but my bill hasnt increased any noticable amount vs the energy price hikes everyones dealing with.  Also my wifes got a 4070 build (granted she prefers her ps5 lol) n my sons gaming on his pc.",
                      "score": 2,
                      "created_utc": 1743429381.0,
                      "replies": [
                        {
                          "id": "mkqclcz",
                          "author": "dreadcain",
                          "body": "The cost is generally more noticeable in summer when the extra heat is working against your ac rather than supplementing your heater",
                          "score": 5,
                          "created_utc": 1743447316.0,
                          "replies": [
                            {
                              "id": "mkqcvi4",
                              "author": "locofspades",
                              "body": "Ha ha, jokes on them, my basememt runs cold, year round",
                              "score": 3,
                              "created_utc": 1743447400.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mkpk2vf",
                          "author": "Trendiggity",
                          "body": "I have a 10700 and 4070 build that's been running off a 500W PSU for years, the 4070 is a great card if you're worried about wattage. It runs 15c cooler than the 2060 that it replaced too lol",
                          "score": 1,
                          "created_utc": 1743438837.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mkpm84l",
                  "author": "haarschmuck",
                  "body": "Plug a kill-a-watt into your gaming pc and you would be surprised how little power they consume when not gaming.",
                  "score": 5,
                  "created_utc": 1743439490.0,
                  "replies": [
                    {
                      "id": "mkqyfvq",
                      "author": "tripletaco",
                      "body": "I argue the opposite. My 7700X/4080 is [idling right now](https://imgur.com/a/wilUfwO) at 185 watts. \n\nEdit: LOL at the downvotes. Why?!?",
                      "score": 0,
                      "created_utc": 1743453809.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mkp5qyf",
              "author": "sali_nyoro-n",
              "body": "More modest whole gaming PCs can run on 600W just fine and still get good performance.",
              "score": 1,
              "created_utc": 1743434540.0,
              "replies": []
            },
            {
              "id": "mkqsf42",
              "author": "7thhokage",
              "body": "That's a whole high end, mid tier rigs whole PSU, not actual consumption either, that's with headroom.",
              "score": 1,
              "created_utc": 1743452021.0,
              "replies": []
            },
            {
              "id": "mkr65sw",
              "author": "bionku",
              "body": "I have a 700w microwave that I am quite happy with, thank you very much.",
              "score": 1,
              "created_utc": 1743456184.0,
              "replies": [
                {
                  "id": "mkr7kru",
                  "author": "Mainbaze",
                  "body": "haha well slow cooking is probably better!",
                  "score": 1,
                  "created_utc": 1743456637.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mkopjy6",
              "author": "None",
              "body": "[deleted]",
              "score": -1,
              "created_utc": 1743429522.0,
              "replies": [
                {
                  "id": "mkpfq7v",
                  "author": "Zephyrical16",
                  "body": "Dang just did the math and if I game 4 hours every day for a month assuming my PC somehow uses its entire 750W power supply, it's only going to cost me about $5 a month.  I can't imagine x6-10 the electricity price of what I have now.",
                  "score": 7,
                  "created_utc": 1743437528.0,
                  "replies": [
                    {
                      "id": "mkpn31g",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -3,
                      "created_utc": 1743439749.0,
                      "replies": [
                        {
                          "id": "mkpvd6x",
                          "author": "jjayzx",
                          "body": "1000 watt psu doesn't mean 1000 watt of usage.",
                          "score": 4,
                          "created_utc": 1743442202.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mkpmkh2",
                  "author": "haarschmuck",
                  "body": "That seems a bit excessive.\n\nLet’s say $0.15 kW/hr. 8 hours of gaming a day and let’s say for those 8 hours of gaming a day the pc is using 1kW.\n\nThats $32 a month.",
                  "score": 1,
                  "created_utc": 1743439592.0,
                  "replies": [
                    {
                      "id": "mkpo4rz",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 2,
                      "created_utc": 1743440066.0,
                      "replies": [
                        {
                          "id": "mkptxwh",
                          "author": "Dt2_0",
                          "body": "California is also an outlier in the states as far as energy costs. Below 15 cents per kWh is pretty standard across most of the US.",
                          "score": 1,
                          "created_utc": 1743441789.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mko1qqq",
          "author": "GregSimply",
          "body": "What would be the point of that? Can’t have customers make informed purchase decisions.",
          "score": 14,
          "created_utc": 1743420090.0,
          "replies": []
        },
        {
          "id": "mko1xqw",
          "author": "Steve_10",
          "body": "Naw, just wire the chip direct to mains supply, what could go wrong...",
          "score": 6,
          "created_utc": 1743420188.0,
          "replies": [
            {
              "id": "mko2m60",
              "author": "w1n5t0nM1k3y",
              "body": "A C13 plug right into the back of the GPU would be a better solution than the 12 pin PCIE power connector.",
              "score": 6,
              "created_utc": 1743420522.0,
              "replies": [
                {
                  "id": "mko4xqq",
                  "author": "wintermoon007",
                  "body": "something something LTT video on this exact topic",
                  "score": 3,
                  "created_utc": 1743421618.0,
                  "replies": [
                    {
                      "id": "mkobjvb",
                      "author": "PaulR79",
                      "body": "LTT is a very poor source now. He's never been the best for real technical stuff but things like not bothering to check what a manufacturer claims when you have a thing called \"Labs\" seems lazy at best.",
                      "score": -7,
                      "created_utc": 1743424447.0,
                      "replies": [
                        {
                          "id": "mkodscw",
                          "author": "wintermoon007",
                          "body": "So you would rather trust a manufacturer’s *claims* rather than a third party’s tests? And specifically for PSU’s i would very very much disagree that labs is “lazy at best”",
                          "score": 1,
                          "created_utc": 1743425334.0,
                          "replies": [
                            {
                              "id": "mktwpjb",
                              "author": "PaulR79",
                              "body": "You misunderstood what I meant but that's on me for being lazy in my reply. I meant the complete opposite of what you picked up.\n\nLTT asked the manufacturers a question about the power all running through a single line to the plug then trusted the manufacturer's (likely PR) response without verifying it themselves. They have Labs available to test and confirm what the manufacturers claimed but didn't bother to do so.",
                              "score": 3,
                              "created_utc": 1743500596.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mkojdrb",
                          "author": "flowersonthewall72",
                          "body": "LTT is tech news and entertainment. Always has always will. Don't hate them because you don't understand the content they make. \n\nAnd do I understand that correctly, you have a problem with independent third party testing?",
                          "score": -1,
                          "created_utc": 1743427408.0,
                          "replies": [
                            {
                              "id": "mkopkjx",
                              "author": "diuturnal",
                              "body": ">And do I understand that correctly, you have a problem with independent third party testing?\n\nIt's all over one part of a video where they reached out to MSI to see if a card was receiving all 6 pins of power to one plane. Instead of verifying if that was true, they just emailed the company and went with it. It had zero impact on the video, and they removed it when they were called out for not double checking.",
                              "score": 1,
                              "created_utc": 1743429527.0,
                              "replies": [
                                {
                                  "id": "mkorih3",
                                  "author": "flowersonthewall72",
                                  "body": "So this one event discounts everything else they've done? \n\nI'm asking this in good faith, I'm not licking LTTs boots. I want to know where the line is drawn, because it really seems like LTT is held to a standard that is well above what we expect from literally any other company. \n\nLTT is trying to break into this new test and V&V role in the industry. They have made mistakes, and the community is rightfully calling them out. But all I see is LTT working to correct them while the community calls them lazy and frauds. I just don't get it. Don't like them if you want, but at least have some moral consistency and backbone.",
                                  "score": 1,
                                  "created_utc": 1743430158.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mktw0hf",
                              "author": "PaulR79",
                              "body": "I understand the content and how he does it but when you have a large audience you're going to influence people and he will be taken as knowing what he (and his team) are talking about.\n\nWhat I don't understand is why they accepted a manufacturer's PR response to a technical question rather than check it before reporting the result.",
                              "score": 1,
                              "created_utc": 1743500132.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mkp5uiv",
                  "author": "sali_nyoro-n",
                  "body": "Voodoo Volts' time has finally come.",
                  "score": 1,
                  "created_utc": 1743434570.0,
                  "replies": []
                },
                {
                  "id": "mko6eyl",
                  "author": "NuclearLunchDectcted",
                  "body": "There was a GPU that did something like that back in the 2ks. Voodoo3 I think? Wasn't a C13 plug, but the GPU had its own power supply that plugged directly into the wall.",
                  "score": 1,
                  "created_utc": 1743422275.0,
                  "replies": [
                    {
                      "id": "mkodrm4",
                      "author": "NePa5",
                      "body": "> Voodoo3\n\nClose, it was the 5 not the 3.\n\nhttps://en.wikipedia.org/wiki/Voodoo_5",
                      "score": 2,
                      "created_utc": 1743425326.0,
                      "replies": []
                    },
                    {
                      "id": "mko6vd2",
                      "author": "w1n5t0nM1k3y",
                      "body": "That  might make more sense. Having a separate power supply for the GPU and rest for the system could make things more affordable because a giant 1000+ watt power supply is more complicated and possibly more expensive than a couple of more basic powers supplies.",
                      "score": 3,
                      "created_utc": 1743422475.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mko7ul7",
              "author": "BellsOnNutsMeansXmas",
              "body": "Overvolt to 240\n\n![gif](giphy|eHFvUzriIkuU6tHuOJ)",
              "score": 2,
              "created_utc": 1743422900.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkqigqr",
          "author": "buckX",
          "body": "Misleading seems to pretty clearly be the point.\n\n---\n\n***Laptop 5090:***\n\nCuda Cores: 10496\n\nTexture mapping unit: 328\n\nRender output unit: 128\n\nRay tracing cores: 82\n\nTensor cores: 328\n\nStreaming multiprocessors: 82\n\nBus Width: 256-bit\n\n---\n\n***Desktop 5080:***\n\nCuda Cores: 10752\n\nTexture mapping unit: 336\n\nRender output unit: 112\n\nRay tracing cores: 84\n\nTensor cores: 336\n\nStreaming multiprocessors: 84\n\nBus Width: 256-bit\n\n---\n\n***Desktop 5090:***\n\nCuda Cores: 21,760\n\nTexture mapping unit: 680\n\nRender output unit: 176\n\nRay tracing cores: 170\n\nTensor cores: 680\n\nStreaming multiprocessors: 170\n\nBus Width: 512-bit\n\n---\n\nEven without getting into clock rates, the architecture of the Mobile 5090 looks a hell of a lot more like a 5080 than a 5090. It certainly doesn't help customers who end up staring at a game that recommends a 5060 wondering if their laptop 5070 will cut it or not.\n\nFar better to have the number be a reliable measure of overall performance and just have the understanding you'll never fit a 90 into a laptop.",
          "score": 3,
          "created_utc": 1743449068.0,
          "replies": []
        },
        {
          "id": "mkosg9j",
          "author": "Takeoded",
          "body": "GTX 8xx (like GTX 880M) was laptop-exclusive. (allegedly because Nvidia R&D botched something)",
          "score": 2,
          "created_utc": 1743430458.0,
          "replies": []
        },
        {
          "id": "mkob5xc",
          "author": "edmc78",
          "body": "Totally agreed - different product line.",
          "score": 1,
          "created_utc": 1743424290.0,
          "replies": []
        },
        {
          "id": "mkodw1w",
          "author": "MaroonIsBestColor",
          "body": "They used to 10 years ago. It was called the 800 GTX series.",
          "score": 1,
          "created_utc": 1743425374.0,
          "replies": []
        },
        {
          "id": "mkp8wnr",
          "author": "elton_john_lennon",
          "body": "> so consumers don't get confused or mislead.\n\nThat is the entire reason they did it, it's not as if someone accidentally leaned on a keyboard at nVidia HQ and pressed 90 instead of 80. They know exactly what they are doing.",
          "score": 1,
          "created_utc": 1743435495.0,
          "replies": []
        },
        {
          "id": "mkq5kjj",
          "author": "MC_chrome",
          "body": ">Hey really should just have a completely different line of GPUs for laptops with different names so consumers don't get confused or mislead.\n\nIsn’t that what the M & Max-Q variants used to be?",
          "score": 1,
          "created_utc": 1743445202.0,
          "replies": []
        },
        {
          "id": "mkqar3h",
          "author": "ze_Doc",
          "body": "They used to do exactly this with mobile GPUs. 50 series is trash all around",
          "score": 1,
          "created_utc": 1743446763.0,
          "replies": []
        },
        {
          "id": "ml73aly",
          "author": "Osiris_Raphious",
          "body": "But then how can they upsell to the idiot consumer and make huge profits? \nhttps://au.msi.com/Promotion/2025-rtx50-gaming-laptops/nb?gad_source=2&gclid=Cj0KCQjwytS-BhCKARIsAMGJyzpAlOgxcDYElfYcEQH0gI9N62SutUu4rfPT93R2AA0SwRlpDuChzxEaAmjsEALw_wcB",
          "score": 1,
          "created_utc": 1743686762.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mko13hy",
      "author": "kickthecommie",
      "body": "It's the same chip from a desktop 5080 and maxes out at 20-25% the wattage of a 5090, honestly kinda impressive It's able to reach half the performance but absolutely not worth it either way, retailers are charging like $5000 for a 5090 laptop.",
      "score": 304,
      "created_utc": 1743419770.0,
      "replies": [
        {
          "id": "mko2hgv",
          "author": "alman12345",
          "body": "That’s the most disgusting part, it’s about 20%-25% more performant than the 4080 mobile from 2 years ago and I got that in a used 2024 G16 for $2200 with some nice storage upgrades.",
          "score": 99,
          "created_utc": 1743420458.0,
          "replies": [
            {
              "id": "mko3hyw",
              "author": "Otaraka",
              "body": "I seem to remember a term leading is bleeding somewhere.  In this case more full on haemophilia admittedly.",
              "score": 16,
              "created_utc": 1743420949.0,
              "replies": [
                {
                  "id": "mkqj4z8",
                  "author": "The_Quackening",
                  "body": "\"if it bleeds, it leads\" \n\nThis is a saying referring to how the advent of 24h news became more sensationalized.",
                  "score": 1,
                  "created_utc": 1743449270.0,
                  "replies": [
                    {
                      "id": "mkqy48e",
                      "author": "Otaraka",
                      "body": "Sorry it was meant to be leading is bleeding ie new stuff costs a lot.  It was a bit late.  I could swear I’ve seen this used in other tech forums, but I can’t find it when I search it.  The only references I can find is to leadership being painful. ",
                      "score": 2,
                      "created_utc": 1743453713.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mkrg97n",
                  "author": "StretchRhys",
                  "body": "What?",
                  "score": 1,
                  "created_utc": 1743459481.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mkog43i",
          "author": "drmirage809",
          "body": "The fact they managed to squeeze that kinda performance out of something in a laptop is pretty impressive. I can only imagine the noise the fans will make when you push the thing. And I assume it cannot maintain that kinda performance without thermal throttling. Still, impressive.",
          "score": 20,
          "created_utc": 1743426214.0,
          "replies": [
            {
              "id": "mks2qau",
              "author": "Cless_Aurion",
              "body": "I mean... Is it? My laptop 8 years ago with a 1070 performed on par its desktop counterpart. In fact, I won the silicon lottery, and sometimes it matched a 1070ti desktop so... Yeah.",
              "score": -2,
              "created_utc": 1743467343.0,
              "replies": [
                {
                  "id": "mkztag2",
                  "author": "rachnar",
                  "body": "The laptop 1070 packed more than the desktop 1070 but ran much slower speeds IRC. I was able to OC mine past desktop 1070 speeds and it was INSANE how good it was (ofc you needed a proper laptop for it, and the alienware i had was an amazing one). It was the cpu holding me back in thay model not the gpu. At least until one of the fans died and the battery nearly blew up... I might have pushed it too much admitedly. After replacement it was as good as new again.",
                  "score": 2,
                  "created_utc": 1743583701.0,
                  "replies": [
                    {
                      "id": "mkzwbat",
                      "author": "Cless_Aurion",
                      "body": "Exactly!\nFor me the CPU wasn't an issue since it was one of those laptops/barebones that also have desktop CPU and had a full fat 7700K running on it :D\n\n\nReplaced it after like almost 7 years of heavy use",
                      "score": 1,
                      "created_utc": 1743585804.0,
                      "replies": [
                        {
                          "id": "mkzx64p",
                          "author": "rachnar",
                          "body": "Yeah that's beefier than the i7-8750h i had in mine, not complaining though i got it through a deal which made it (much) cheaper than alternatives for me. And the alienware chassis really was a marvel tbh, but the noise did suck, was like a low power vaccum cleaner when gaming unsurprisingly.",
                          "score": 2,
                          "created_utc": 1743586393.0,
                          "replies": [
                            {
                              "id": "mkzxo9h",
                              "author": "Cless_Aurion",
                              "body": "Lucky you!\nMan, computers back then we're affordable as hell. I think I paid like... 2k for mine? Being 17“ too. Nowadays same tier de stop is like 3000 or 3500 for sure.",
                              "score": 1,
                              "created_utc": 1743586737.0,
                              "replies": [
                                {
                                  "id": "mkzxz3m",
                                  "author": "rachnar",
                                  "body": "I got mine with 1tb ssd i think for 1400 or 1500. And yeab they really were.. I'd love to upgrade my current setup, my rx5700xt was never great for 3440x1440 but now it's starting to seriously struggle but the prices.... I really hope amd can surprise us in the coming weeks. If only they could do in the gpu market what they did with ryzen :(",
                                  "score": 1,
                                  "created_utc": 1743586941.0,
                                  "replies": [
                                    {
                                      "id": "mkzzq0o",
                                      "author": "Cless_Aurion",
                                      "body": "Yeah... I was able to get my hands on a msrp 4090 on launch but... It's right now on the repair shop 💀\n\n5700xt treated you we, time to upgrade to the new 9700xt, looks pretty dope tbh!",
                                      "score": 1,
                                      "created_utc": 1743588072.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mkp4lv3",
          "author": "BenadrylChunderHatch",
          "body": "It should honestly be illegal to take a 5080 chip, put it in a laptop and call it a 5090, but I'm not really surprised at this point.",
          "score": 19,
          "created_utc": 1743434194.0,
          "replies": [
            {
              "id": "mkr80sg",
              "author": "Shkkzikxkaj",
              "body": "They’ve being doing that kind of thing for decades with laptop GPUs.",
              "score": 3,
              "created_utc": 1743456780.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkp6rjp",
          "author": "sali_nyoro-n",
          "body": "I guess it's a case of diminishing returns where past a certain point you start needing greater wattage increases for a given performance increase. PC parts have largely hit a wall for scaling lately so it's not surprising we're back to an early-2000s style wattage contest at the top end where you need 4-5× more power for 2× more performance.",
          "score": 3,
          "created_utc": 1743434845.0,
          "replies": []
        },
        {
          "id": "mkqgstf",
          "author": "repocin",
          "body": "Tbf, gaming laptops have always been an absolute scam in terms of performance for the money.",
          "score": 2,
          "created_utc": 1743448567.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mko0pky",
      "author": "None",
      "body": "[deleted]",
      "score": 140,
      "created_utc": 1743419576.0,
      "replies": [
        {
          "id": "mkofjoj",
          "author": "Mr_Engineering",
          "body": "Yes.\n\nThe mobile 5090 uses the GB203 die, which is the same die as the desktop 5070 Ti and desktop 5080.\n\nThe desktop 5090 uses the GB202 die, which is much larger and insanely power hungry.\n\nSame story with previous generations. Mobile 4090 used the AD103 die, desktop 4090 used the AD102 die. Mobile 3080 used the GA103 die which is also used by the desktop 3070 Ti, desktop 3080 and 3090 used the GA102 die.",
          "score": 64,
          "created_utc": 1743426000.0,
          "replies": [
            {
              "id": "mkqsj1y",
              "author": "None",
              "body": "[deleted]",
              "score": 4,
              "created_utc": 1743452053.0,
              "replies": [
                {
                  "id": "mkreb59",
                  "author": "Mr_Engineering",
                  "body": "Correct. They are power limited",
                  "score": 3,
                  "created_utc": 1743458824.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mkow4xu",
          "author": "evangelism2",
          "body": "Yes, alot of people learning that laptop GPUs or a 50xx mobile, is usually the equivalent of a step down in the product stack of the desktop equivalents. This isn't new",
          "score": 57,
          "created_utc": 1743431619.0,
          "replies": [
            {
              "id": "mkp7ke4",
              "author": "sali_nyoro-n",
              "body": "They used to give the mobile GPUs different designations, then stopped doing that with the 1000 series because they felt the performance gap between the desktop and mobile versions of the chips were fairly minimal. That's not really the case anymore though, so they should bring back clear \"Mobile chip\" designations.",
              "score": 41,
              "created_utc": 1743435084.0,
              "replies": [
                {
                  "id": "mkq04ue",
                  "author": "abdulj07",
                  "body": "I support this. We’ve regressed back to “980m” era.",
                  "score": 15,
                  "created_utc": 1743443596.0,
                  "replies": []
                },
                {
                  "id": "mkp8ole",
                  "author": "evangelism2",
                  "body": "Yeah, probably.",
                  "score": 3,
                  "created_utc": 1743435425.0,
                  "replies": []
                },
                {
                  "id": "mksub6a",
                  "author": "Chriscic",
                  "body": "Nvidia has never had a shred of marketing integrity. They view it as just business, and they will push it as far as they possibly can.",
                  "score": 2,
                  "created_utc": 1743477885.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mktrlnv",
          "author": "CosmicCreeperz",
          "body": "It is literally a 5080 chip clocked down to a much lower power level.  Ie total BS marketecture to call it a 5090 in any way.",
          "score": 1,
          "created_utc": 1743497104.0,
          "replies": []
        },
        {
          "id": "mkuol7y",
          "author": "terorvlad",
          "body": "Nooo, it's worse. A power starved thermally throttled 5080",
          "score": 1,
          "created_utc": 1743513821.0,
          "replies": []
        },
        {
          "id": "mko1t3b",
          "author": "GregSimply",
          "body": "GamersNexus had a video on that very recently. You should check it out, if you have the time.",
          "score": -30,
          "created_utc": 1743420122.0,
          "replies": [
            {
              "id": "mkob6qc",
              "author": "None",
              "body": "[removed]",
              "score": 2,
              "created_utc": 1743424299.0,
              "replies": [
                {
                  "id": "mkoumn1",
                  "author": "dyshuity",
                  "body": "How is their comment useless? And please explain how yours is any more useful?",
                  "score": 7,
                  "created_utc": 1743431145.0,
                  "replies": [
                    {
                      "id": "mkp08jb",
                      "author": "evangelism2",
                      "body": "Theres isnt useful either, but the original post could have included a link to the video at the very least.\n\nhttps://youtu.be/RmVpy6Vzpsc?si=1dN5QTKJgMAraXt8&t=1186",
                      "score": 8,
                      "created_utc": 1743432868.0,
                      "replies": []
                    },
                    {
                      "id": "mkpb9y6",
                      "author": "Znuffie",
                      "body": "The commenting user is assigning homework.\n\nInclude a video link, or summarize the video. Saying that $randomYouTuber recently explained something is useless.",
                      "score": -2,
                      "created_utc": 1743436206.0,
                      "replies": [
                        {
                          "id": "mkq4vwb",
                          "author": "3dgemaster",
                          "body": "I get what you're saying and I even agree that including the link would have been polite. But GM is hardly a random youtuber. Anyone who's into PC HW is more than familiar with their work. So while I get where you're coming from, I think the guy doesn't deserve all the downvotes. I'm more than capable of looking up the video, should I want to. And so is everyone else.",
                          "score": 4,
                          "created_utc": 1743444999.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mko5eb5",
      "author": "supersam552",
      "body": "So would that mate it an RTX 2545?",
      "score": 118,
      "created_utc": 1743421826.0,
      "replies": [
        {
          "id": "mkobsc8",
          "author": "PaulR79",
          "body": "Get out.",
          "score": 24,
          "created_utc": 1743424543.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkp63x3",
      "author": "sali_nyoro-n",
      "body": "They should really just bring back the \"M\" suffix for laptop GPUs like what they had for the GTX 900 series and earlier, or call it an RTX 5085 or something with such a huge performance gap.",
      "score": 18,
      "created_utc": 1743434648.0,
      "replies": []
    },
    {
      "id": "mkplzpe",
      "author": "haarschmuck",
      "body": "Obviously.\n\nLaptop chips are always like this. You cannot beat the laws of thermodynamics unless you want a laptop with 1kW power brick.\n\n\nDumb article.",
      "score": 71,
      "created_utc": 1743439418.0,
      "replies": [
        {
          "id": "mkt6obi",
          "author": "rpkarma",
          "body": "So they should be named differently. 5090m is nice and simple.",
          "score": 17,
          "created_utc": 1743483774.0,
          "replies": []
        },
        {
          "id": "ml9jj7q",
          "author": "ilyich_commies",
          "body": "The average gaming laptop buyer probably won’t know this. It’s pretty fair to assume that two chips with the same name are in fact the same chip, so it’s dishonest for NVIDIA to name them like this.",
          "score": 1,
          "created_utc": 1743713083.0,
          "replies": []
        },
        {
          "id": "mkqu55u",
          "author": "None",
          "body": "[deleted]",
          "score": -4,
          "created_utc": 1743452530.0,
          "replies": [
            {
              "id": "mkr1s3u",
              "author": "iKeepItRealFDownvote",
              "body": "Please show me a MacBook Pro that has the performance equivalent to a 5090 let alone a 4090",
              "score": 6,
              "created_utc": 1743454810.0,
              "replies": [
                {
                  "id": "mkrblwz",
                  "author": "MountainofPolitics",
                  "body": "Incorrect use of “let alone” there.",
                  "score": -7,
                  "created_utc": 1743457934.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mkr58c2",
              "author": "2Rhino3",
              "body": "The MacBook M series chips are amazing for what they are, but they can’t compare to a high quality Nvidia card in terms of graphics & overall gaming quality.",
              "score": 3,
              "created_utc": 1743455887.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mko8gmt",
      "author": "AlphaTangoFoxtrt",
      "body": "I mean, yes?\n\nA laptop running a 600W GPU is going to have battery life measured in minutes before it becomes an incendiary device.\n\nLaptops, even \"gaming\" laptops, are not for high end performance. They sacrifice performance for size and portability.",
      "score": 68,
      "created_utc": 1743423161.0,
      "replies": [
        {
          "id": "mkoumu4",
          "author": "TravelingMonk",
          "body": "Finally the end of \"high-end gaming laptop\" moniker.",
          "score": 16,
          "created_utc": 1743431147.0,
          "replies": []
        },
        {
          "id": "mkql9hy",
          "author": "None",
          "body": "[deleted]",
          "score": 4,
          "created_utc": 1743449915.0,
          "replies": [
            {
              "id": "ml7mch7",
              "author": "HiddenoO",
              "body": "They're not calling it a 5090m though, they're calling it a 5090, suggesting it's the same chip which it's not.",
              "score": 1,
              "created_utc": 1743692711.0,
              "replies": []
            },
            {
              "id": "mks75xm",
              "author": "haarschmuck",
              "body": "Not even just 3 or 4 generations, it has always been like this as far as I know.\n\nA reasonable person who is in the market for a gaming laptop would not expect that laptop to have equal performance to a desktop that is significantly larger. \n\nAnd to be fair unless I’m missing something here Nvidia has always made the distinction clear in the specs. My laptop has a “1660ti mobile” GPU.",
              "score": 0,
              "created_utc": 1743468971.0,
              "replies": [
                {
                  "id": "mkszcz5",
                  "author": "Vernichtungsschmerz",
                  "body": "They only seem high end because they are expensive and sound good. I’m coming from a 2019 1070 so it all sounds so amazing. I also don’t have 2000 for a laptop. So I’ll keep playing The Sims even though it drains my battery as I play.",
                  "score": 1,
                  "created_utc": 1743480143.0,
                  "replies": []
                },
                {
                  "id": "mkvrdza",
                  "author": "absk251",
                  "body": "Right? I remember when i got a laptop with GTX 280M, I was like damn, a 280 in a laptop, only to be hugely underwhelmed by performance. That was like in 2010. Now that i think of it, kinda weird to remember that nvidia had 3 digit naming scheme.",
                  "score": 1,
                  "created_utc": 1743526274.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mkpiaty",
      "author": "No-Bother6856",
      "body": "They have been doing this for a while now, the laptop sku has little to do with the desktop one. Seems they are just cashing in on the name recognition from the desktop model",
      "score": 4,
      "created_utc": 1743438297.0,
      "replies": []
    },
    {
      "id": "mks9p04",
      "author": "Placed-ByThe-Gideons",
      "body": "50% of the performance for 100% price. \nLaptop buyers beware.",
      "score": 4,
      "created_utc": 1743469909.0,
      "replies": []
    },
    {
      "id": "mkq2tty",
      "author": "AnimeMeansArt",
      "body": "That's expected, no?",
      "score": 3,
      "created_utc": 1743444385.0,
      "replies": []
    },
    {
      "id": "mkrzuk1",
      "author": "NahCuhFkThat",
      "body": "slower than almost every top tier 4090 laptop as well.",
      "score": 3,
      "created_utc": 1743466281.0,
      "replies": []
    },
    {
      "id": "mks6210",
      "author": "xdeltax97",
      "body": "Laptop GPU’s are always inferior to the full size.",
      "score": 3,
      "created_utc": 1743468562.0,
      "replies": []
    },
    {
      "id": "mkocp6m",
      "author": "MrNerdHair",
      "body": "In other news, water is wet.",
      "score": 8,
      "created_utc": 1743424905.0,
      "replies": []
    },
    {
      "id": "mkr2hdp",
      "author": "iKeepItRealFDownvote",
      "body": "This is like the 3rd article on seen in this. Journalist trying to find something else to rag on Nvidia for when this has been a thing with laptops for the last 3 generations.  Goes to show journalist don’t do their homework and research on wattages because no way anyone thinks a laptop can provide that type of power on a laptop battery.",
      "score": 2,
      "created_utc": 1743455027.0,
      "replies": [
        {
          "id": "mks9a7d",
          "author": "ComputerSong",
          "body": "I dunno, my laptop with a 3080 was pretty righteous when it was new.  And of course it’s still very good.",
          "score": -1,
          "created_utc": 1743469756.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkrl48p",
      "author": "livevicarious",
      "body": "It would be better for consumers to label the mobile variants closer to desktop counterparts performance. Butttttt the reality the “value” would appear lower to consumers if all they could buy is a 5070. They need to at least put on their packaging a side by side with the desktop equivalent so people who aren’t familiar with this issue aren’t misled.",
      "score": 2,
      "created_utc": 1743461160.0,
      "replies": []
    },
    {
      "id": "mktpfm4",
      "author": "ThePr0vider",
      "body": "yeah...that's how laptops always are? this isn't news. Laptops are the crappy watered down versions of desktops with overheating problems. By the time you're getting to the point of desktop hardware in laptops, you're just having a laptop for the memes because it'll weigh 4kg",
      "score": 2,
      "created_utc": 1743495575.0,
      "replies": []
    },
    {
      "id": "mku1vgl",
      "author": "konpla11",
      "body": "How is this news and not common sense",
      "score": 2,
      "created_utc": 1743503788.0,
      "replies": []
    },
    {
      "id": "mko92r1",
      "author": "manyeggplants",
      "body": "That's because it's a different GPU\n\n\n/thread",
      "score": 3,
      "created_utc": 1743423421.0,
      "replies": [
        {
          "id": "mkocpy7",
          "author": "CamiloArturo",
          "body": "True, but that’s exactly the issue I believe. Naming it the same as the desktop version it does make it look like a “similar” GPU. The fact it is 50% slower kind of makes the case either for a different branding completely to avoid deceiving the general public.  Yes, for building PC fans it’s of no concern but for most regular people it is a deceive tactic",
          "score": 7,
          "created_utc": 1743424913.0,
          "replies": [
            {
              "id": "mkpmx0x",
              "author": "haarschmuck",
              "body": "But it has always been done this way. My laptop has a 1660ti mobile.",
              "score": 2,
              "created_utc": 1743439698.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mkogew8",
      "author": "Christopher135MPS",
      "body": "And this is news because…..?\n\nIt’s a tiny metal case, with tiny cooling and tiny PSU. \n\nIt would be more newsworthy if someone thought a laptop GPU was ever going to rival a desktop version",
      "score": 3,
      "created_utc": 1743426324.0,
      "replies": [
        {
          "id": "mktko5t",
          "author": "SnowGryphon",
          "body": "I think the golden age of laptop GPUs was the GTX 1000 series - if i recall right, the mobile GTX 1070 actually had more ROPs than the desktop 1070, and was clocked only slightly slower. That meant a mild overclock could beat the desktop",
          "score": 1,
          "created_utc": 1743492315.0,
          "replies": [
            {
              "id": "mktwj5w",
              "author": "Christopher135MPS",
              "body": "How did it handle sustained use though? My 1660 6gb super could run for hours and hours at near 100% usage. I’d be surprised if a laptop could manage a 6 hour gaming session without any thermal throttling.",
              "score": 1,
              "created_utc": 1743500478.0,
              "replies": [
                {
                  "id": "mkudvlr",
                  "author": "SnowGryphon",
                  "body": "Pretty well depending on the laptop really! I've seen old thicc bois go for hours with barely a drop - though they did weigh like 2.5 to 3kg back then",
                  "score": 2,
                  "created_utc": 1743509641.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mko0xf2",
      "author": "CMDR_omnicognate",
      "body": "I can't say as i'm surprised, trying to squeeze a basically 600W gpu into a laptop was never going to work",
      "score": 1,
      "created_utc": 1743419687.0,
      "replies": []
    },
    {
      "id": "mkp0qby",
      "author": "SmokeNinjas",
      "body": "Shock horror! To absolutely nobody that understands how much power and heat a gpu will kick out….into a laptop shell",
      "score": 1,
      "created_utc": 1743433015.0,
      "replies": []
    },
    {
      "id": "mkpscqs",
      "author": "RailGun256",
      "body": "well yeah thats to be expected. that being said its still overpriced as all hell",
      "score": 1,
      "created_utc": 1743441324.0,
      "replies": []
    },
    {
      "id": "mkpwutm",
      "author": "franker",
      "body": "I want to buy a new laptop and have no idea what the fuck to buy any more.  My current laptop is a Windows 7 laptop that I got from work around 2010.  I have no idea how it's still running but I just back up the few docs I type on it and use it for light email/web browsing.   I have dreams of getting into all the AI shit when I retire soon.  Is this the \"AI shit\" laptop I'm supposed to buy then? (shrug)",
      "score": 1,
      "created_utc": 1743442635.0,
      "replies": []
    },
    {
      "id": "mkpzor4",
      "author": "Low-Opening25",
      "body": "why is that a surprise? I  mean no laptop in existence is going to be able to pull off 600W GPU, not even on power supply, and that’s not even considering cooling issues, ergo 50% is a very decent performance.",
      "score": 1,
      "created_utc": 1743443464.0,
      "replies": []
    },
    {
      "id": "mkq8ixl",
      "author": "kalirion",
      "body": "How does it compare to the laptop 4090? Was the laptop 4090 more than 50% the performance of the desktop version?",
      "score": 1,
      "created_utc": 1743446091.0,
      "replies": []
    },
    {
      "id": "mkqa3dv",
      "author": "Webetradinstonks",
      "body": "What if I add more t paste",
      "score": 1,
      "created_utc": 1743446564.0,
      "replies": []
    },
    {
      "id": "mkqi3xb",
      "author": "QWERTYtheASDF",
      "body": "Article is captain obvious but frankly I am pleasantly surprised that it's able to achieve half the speed of the desktop version while consuming only 175w which is less than half of the 575w on the desktop 5090.",
      "score": 1,
      "created_utc": 1743448961.0,
      "replies": [
        {
          "id": "mkr1t00",
          "author": "_IM_NoT_ClulY_",
          "body": "Desktop cards are usually pushed well into diminishing returns",
          "score": 1,
          "created_utc": 1743454818.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkqifsa",
      "author": "MysteriousWon",
      "body": "But how much faster is it than my TI-82?",
      "score": 1,
      "created_utc": 1743449060.0,
      "replies": []
    },
    {
      "id": "mkr8eaj",
      "author": "nipsen",
      "body": "Pffffhh hahahah",
      "score": 1,
      "created_utc": 1743456900.0,
      "replies": []
    },
    {
      "id": "mktdp01",
      "author": "Hostile-Panda",
      "body": "About the same drop as the 4090 v 4090 laptop then",
      "score": 1,
      "created_utc": 1743487810.0,
      "replies": []
    },
    {
      "id": "mkuvvx7",
      "author": "Shadowlance23",
      "body": "In other news, the army is complaining because their guns are smaller than the ones the navy has mounted on their battleships.",
      "score": 1,
      "created_utc": 1743516410.0,
      "replies": []
    },
    {
      "id": "mkyuaa0",
      "author": "Mackadelik",
      "body": "Is this actually bad though? I read somewhere on Google that someone compared the 4090 laptop with desktop and found the desktop gfx card to be 75% faster and desktop cpu to be 15% faster. So a card that is only 50% slow might not be that bad? Im desktop all the way, but is 5090 better than other cards in this sense?",
      "score": 1,
      "created_utc": 1743563652.0,
      "replies": []
    },
    {
      "id": "mkzw0km",
      "author": "elAhmo",
      "body": "As expected?",
      "score": 1,
      "created_utc": 1743585599.0,
      "replies": []
    },
    {
      "id": "ml2ywh5",
      "author": "neoblufalcon",
      "body": "A laptop GPU is half as powerful as a desktop GPU for the sake of portability.  In other news, water is wet.",
      "score": 1,
      "created_utc": 1743624525.0,
      "replies": []
    },
    {
      "id": "mkoufje",
      "author": "tallyretro",
      "body": "is this not common knowledge? obviously the laptop version will be less powerful",
      "score": 1,
      "created_utc": 1743431083.0,
      "replies": []
    },
    {
      "id": "mkovj4d",
      "author": "LadBooboo",
      "body": "I've always thought the mobile SKU is just the level of performance expected for mobile devices. Like for example the \"4090 mobile\" is not the same as the \"4090 desktop\" but just denotes that there isn't a better GPU from Nvidia for mobile devices.",
      "score": 1,
      "created_utc": 1743431428.0,
      "replies": []
    },
    {
      "id": "mkod81h",
      "author": "Kvicksilver",
      "body": "I thought deceptive marketing was illegal?",
      "score": 0,
      "created_utc": 1743425113.0,
      "replies": []
    },
    {
      "id": "mkojjfx",
      "author": "Agitated-Ad-504",
      "body": "Why are we surprised a laptop doesn’t perform as well as a desktop? 😂",
      "score": -3,
      "created_utc": 1743427465.0,
      "replies": [
        {
          "id": "mkos3al",
          "author": "SamYeager1907",
          "body": "Mobile 1080s performed very close to desktop ones, and they even had 1080s with identical performance in larger laptops too. \n\nWhen nVidia had a good generation, the performance gap is negligible. The issue is that 5xxx is a performance flop. Raising wattage is the laziest way to increase performance.",
          "score": 7,
          "created_utc": 1743430343.0,
          "replies": [
            {
              "id": "mkou3za",
              "author": "Agitated-Ad-504",
              "body": "We are not talking about 1080s. This is about the 5090. You’re talking about technology from almost 10 years ago.",
              "score": -10,
              "created_utc": 1743430981.0,
              "replies": [
                {
                  "id": "mkp8isz",
                  "author": "elton_john_lennon",
                  "body": "> You’re talking about technology from almost 10 years ago.\n\n..to make a point that your argument of mobile being worse than desktop is being invalid, since \"desktop more powerful than mobile\" wasn't always the case.\n\n^^^^^^.\n\nIt's not about technology, it's about naming things. If it performs as 80 card it should be named 80 card, regardless if it is 1000 2000 or 6000 series.",
                  "score": 4,
                  "created_utc": 1743435375.0,
                  "replies": []
                },
                {
                  "id": "mkpm25u",
                  "author": "GunnerTardis",
                  "body": "Laptop 4060 had identical performance to the Desktop 4060 if you want a recent example.",
                  "score": 2,
                  "created_utc": 1743439439.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mko3wje",
      "author": "ToMorrowsEnd",
      "body": "Are these reviewers that stupid? Duh, you dont have a 600W Gpu in your laptop.   if they actually looked at the details they would have seen it's a 5080 in reality with marketing hype stapled onto it.",
      "score": -12,
      "created_utc": 1743421145.0,
      "replies": [
        {
          "id": "mko5ew0",
          "author": "phillz91",
          "body": "That's the point though, right? The reviewers are doing their job by pointing out that the mobile 5090 is nowhere near the desktop version because Nvidia will continue to market it as if it is to people who don't know any better and manufacturers who charge as if it has a full 5090 in there.\n\nTo you they are pointing out the obvious, but most people would not know the difference between them since Nvidia insists on calling it a 90 class chip. The same people who may look up a review before buying one.",
          "score": 30,
          "created_utc": 1743421833.0,
          "replies": [
            {
              "id": "mko7tak",
              "author": "JBWalker1",
              "body": "Didn't GPU manufacturers used to just put an \"M\" at the end to show that it's a mobile version? Seems like the obvious solution and would still have the \"5080\" in it which is the important part. It is the same graphics card/processors after all isn't it? Just massively underclocked to keep the heat down. Makes no difference to me because obviously laptop versions are a slowed down version but to a person new to pc gaming it'll help them a lot. Would help with googling too. \n\nI dont think it really does help them much more from the marketing side compared to if they put an \"M\" at the end so they should just do it.",
              "score": 1,
              "created_utc": 1743422884.0,
              "replies": [
                {
                  "id": "mkoikb1",
                  "author": "joanfiggins",
                  "body": "It's marketing bullshit that is just meant to mislead some lesser knowing consumers.\n\nThere's a good chunk of people buying expensive laptops and not understanding that the GPU isn't the same as the desktop version. That group wants a gaming PC but is intimidated by building a desktop so they get a laptop instead. \n\nMy cousin bought a 3070 laptop and used it for like 6 months. He came over with it and my 3060ti desktop was beating his in performance by like 5 to 10 percent in a game we were playing. Then he put on his undervolt/overclock settings, and so did I, and the gap increased to 10 to 15 percent. He assumed 3070 is faster than 3060ti because the number is higher. That's the type of person they are trying to trick.",
                  "score": 5,
                  "created_utc": 1743427113.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mkp4yx0",
      "author": "THEREALCABEZAGRANDE",
      "body": "Have you seen how physically large any high end desktop card is? It's twice as thick as the laptop it'd be going into. No shit the mobile version won't be as powerful. Do people really expect them to be equivalent?",
      "score": 0,
      "created_utc": 1743434305.0,
      "replies": []
    },
    {
      "id": "mkp7x5z",
      "author": "saposapot",
      "body": "Besides what everyone else already explained, laptop performance is very variant on each model.\n\nYou can have a 5090 in a model with good cooling and good performance and a very different result in another model.\n\nInstead of blaming manufacturers for using the same name, I think we should blame them for not enforcing laptop makers to guarantee a baseline performance for their GPU with a proven cooling solution that fits their requirements",
      "score": 0,
      "created_utc": 1743435192.0,
      "replies": []
    },
    {
      "id": "mkpiuav",
      "author": "EducationallyRiced",
      "body": "I guess it’s because it would melt on people anyways",
      "score": 0,
      "created_utc": 1743438462.0,
      "replies": []
    },
    {
      "id": "mkpund3",
      "author": "Alinea86",
      "body": "Everything revolving around the 50 series cards have made it clear as day that they aren't worth your money and yet people are a bunch of surprised Pikachu's when you continue to get shit results",
      "score": 0,
      "created_utc": 1743441994.0,
      "replies": []
    },
    {
      "id": "mkrghvr",
      "author": "M4c4br346",
      "body": "That makes it a 4080 with 24gb vram and half the power. Not terrible, aside from the price.",
      "score": 0,
      "created_utc": 1743459563.0,
      "replies": []
    },
    {
      "id": "mko6f1g",
      "author": "SolarDynasty",
      "body": "And water is wet.",
      "score": -4,
      "created_utc": 1743422276.0,
      "replies": []
    }
  ]
}