{
  "post": {
    "title": "Huawei Tops China Smartphone Market for First Time in Years",
    "author": "None",
    "id": "1m16w9j",
    "score": 548,
    "created_utc": 1752653285.0,
    "selftext": "",
    "num_comments": 46,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1m16w9j/huawei_tops_china_smartphone_market_for_first/"
  },
  "comments": [
    {
      "id": "n3esudp",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1752653285.0,
      "replies": []
    },
    {
      "id": "n3eycu2",
      "author": "LongjumpingBaker5041",
      "body": "I’ve tried this tri-fold phone. It’s really thin and feels great in the hand, but honestly, I have no idea what the point of tri-folds or even four- or five-fold designs for.",
      "score": 106,
      "created_utc": 1752656525.0,
      "replies": [
        {
          "id": "n3ezvjj",
          "author": "hitmonng",
          "body": "![gif](giphy|mCClSS6xbi8us)",
          "score": 64,
          "created_utc": 1752657408.0,
          "replies": []
        },
        {
          "id": "n3f7gd2",
          "author": "Stussygiest",
          "body": "I guess watching videos are better. You dont get the black bars on top or bottom. I have a normal folding phone and the ratio for videos is not the best. Large black bars. \n\nPeople who use excel or other apps that benefits horizontal view. When i use excel, i have to scroll which is annoying. \n\nHaving multiple apps open at once. \n\nIm guessing someone who does use a phone for business would benefit from this best. For normal folks, having better video ratio is not worth it.\n\nEdit: Forgot to mention, reading books/comics is amazinggg on a foldable phone. Not sure if a trifold would make it better. Probably not.",
          "score": 31,
          "created_utc": 1752661607.0,
          "replies": [
            {
              "id": "n3fsoog",
              "author": "external72",
              "body": "I use fold 6 as my work phone. I can remote into my PC and it’s great on bigger screen. Our ERP is also web based which too works great and sheets are a no brainer. I also need to show people catalogs, price lists etc and I can open it and show it to them. Plus I can annotate stuff with the pen but that’s going away which is unfortunate. \n\nAlso not great for watching vids for sure but that’s not my use case so it works for me. When I need to I just half fold it and have videos on top screen and controls on bottom/flat one. Not great for someone who consumes all their media on their phone or don’t have an option to use a iPad/laptop/TV.",
              "score": 7,
              "created_utc": 1752670430.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3kf4t1",
          "author": "Knotted_Hole69",
          "body": "My pornography will be upgraded thats how",
          "score": 7,
          "created_utc": 1752722341.0,
          "replies": []
        },
        {
          "id": "n3g6elj",
          "author": "mrheosuper",
          "body": "The same point of single fold phone: Bigger screen in small footprint",
          "score": 6,
          "created_utc": 1752674843.0,
          "replies": [
            {
              "id": "n3h16k4",
              "author": "ackermann",
              "body": "Bigger screen in your pocket",
              "score": 1,
              "created_utc": 1752684851.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3hufo5",
          "author": "Mixeygoat",
          "body": "It’s incredible for displaying photos or videos. For photographers or people who use drones, it’s amazing to be able to share the photos/videos with friends and family",
          "score": 3,
          "created_utc": 1752692817.0,
          "replies": []
        },
        {
          "id": "n3i1i13",
          "author": "alidan",
          "body": "normal phone ratios are good to get quick info from, 1 fold is great to have actual screen space to watch or read something.\n\nmost people want a tablet sized device they can fit in their pocket. but most people aren't willing to spend 1k+ on a fold design that has built in mechanical obsolesce.",
          "score": 3,
          "created_utc": 1752694802.0,
          "replies": []
        },
        {
          "id": "n3h8tv5",
          "author": "makiui",
          "body": "Trifold the only foldable formfactor that makes sense",
          "score": 3,
          "created_utc": 1752686915.0,
          "replies": [
            {
              "id": "n3hunic",
              "author": "Headbanger",
              "body": "I find phones with one hinge alright, but the price and durability repel me.",
              "score": 3,
              "created_utc": 1752692879.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3f4vfu",
          "author": "theemptyqueue",
          "body": "The problem these phones are trying to solve isn’t really a problem for most.  The problem these folding phones are solving is how to get a tablet sized screen into a pocket instead of a backpack or purse.  One of the big issues with folding phones are that they’re a lot more fragile than bar phones in regard to their screens and their chassis.",
          "score": 1,
          "created_utc": 1752660236.0,
          "replies": []
        },
        {
          "id": "n3f9igy",
          "author": "Rooilia",
          "body": "Iirc there wasn't a folding screen phone yet that withstood normal usage without breaking prematurely. But i am not up to date.",
          "score": -4,
          "created_utc": 1752662665.0,
          "replies": [
            {
              "id": "n3fn42i",
              "author": "QoLTech",
              "body": "The last several Galaxy Folds have definitely passed that bar. I've had them all since the 2nd one and have never had an issue. Some people do, but probably not much more than the flagship S line.",
              "score": 10,
              "created_utc": 1752668429.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3jqmen",
          "author": "crymachine",
          "body": "Honestly all anyone needs to do is make a fold out 7\" tablet display and keep a 16:9 aspect ratio and it'd probably be a hit.\n\nThe Pura X is 17:10? I think and that's a huge hit. Just make a device that's good to watch content on and make another device that's 10\" or more with a good stylus for pdf nerds and profit.",
          "score": 0,
          "created_utc": 1752713267.0,
          "replies": []
        },
        {
          "id": "n3htac1",
          "author": "Blumcole",
          "body": "It's jusr a gadget looking for a market. I guess the chinese are trying to innovate on these types of features.",
          "score": -1,
          "created_utc": 1752692495.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3fx2ox",
      "author": "Kingstad",
      "body": "I loved my previous phone Huawei P30\nBut I've increasingly tried to vote with my wallet in an increasingly unstable world and I boycott companies/countries that seem down right evil.\nI was about to use my DJI drone the other day and found out the app for controlling it had been removed from the play store over security concerns?",
      "score": 13,
      "created_utc": 1752671902.0,
      "replies": [
        {
          "id": "n3gcrar",
          "author": "subversivecliche",
          "body": "Out of curiosity, what's your current phone?",
          "score": 10,
          "created_utc": 1752676695.0,
          "replies": [
            {
              "id": "n3gve88",
              "author": "Kingstad",
              "body": "Well I was going to get the Fairphone for some of the following reasons: its European and we should support and build up our own tech companies to avoid dependence on increasingly hostile powers. It attempts to make a phone as ethically as possible, no exploitation etc. This includes environmental concerns. Its a modular phone meant to last and opening it to swap battery/parts is trivial.\nHowever I reasoned with myself that getting a used phone is quite good too, though I think it's the tech loving side of me that did most to push that argument as I got a Samsung galaxy s24 ultra, which is basically still a new phone. I dont have much beef with South Korea yet. \nI must say however that I've had very little use for its various fancy features so far",
              "score": 0,
              "created_utc": 1752683190.0,
              "replies": [
                {
                  "id": "n3kdocv",
                  "author": "X145E",
                  "body": "tldr was thinking with fairphone, but s24u used has better value ",
                  "score": 2,
                  "created_utc": 1752721754.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n40gxfc",
      "author": "Euro7star",
      "body": "Huawei also recently made a deal with Spain's govt to manage Spain's intelligence agency wiretaps",
      "score": 1,
      "created_utc": 1752940076.0,
      "replies": []
    },
    {
      "id": "n3ho6qz",
      "author": "markarth69",
      "body": "Is there a source other than Bloomberg and their paywall",
      "score": 1,
      "created_utc": 1752691097.0,
      "replies": [
        {
          "id": "n3ijydi",
          "author": "jasonisnuts",
          "body": "Mirror https://archive.is/x1qon",
          "score": 2,
          "created_utc": 1752699891.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3fke3s",
      "author": "AreYouPurple",
      "body": "Wasnt huawei the ones caught putting backdoor chips in everything?",
      "score": -23,
      "created_utc": 1752667393.0,
      "replies": [
        {
          "id": "n3fufma",
          "author": "bigriggs24",
          "body": "They were banned to eliminate the competition as they had more advanced 5G tech at the time iirc",
          "score": 36,
          "created_utc": 1752671021.0,
          "replies": [
            {
              "id": "n3fuy76",
              "author": "gchaudh2",
              "body": "They were also banned from India for a while. They are still not allowed to some extent. Their whole shtick was to enter the market at an insanely low price, in part subsidized by the chinese govt to undercut rivals and establish dominance in the respective foreign market. Some countries eventually saw through it and banned them. ",
              "score": 7,
              "created_utc": 1752671197.0,
              "replies": [
                {
                  "id": "n3jr0s9",
                  "author": "crymachine",
                  "body": "Ah, like Google did with their Android Nexus phones, or Uber and Lyft, or Amazon, or Walmart. Dang eastern country trying to make a profit over time after building a brand name and reputation for themself.",
                  "score": 12,
                  "created_utc": 1752713413.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n3fn2bv",
          "author": "Gabelschlecker",
          "body": "As far as I know, despite offering access to the source code and other stuff, nothing was ever found.",
          "score": 25,
          "created_utc": 1752668412.0,
          "replies": [
            {
              "id": "n3fs900",
              "author": "AreYouPurple",
              "body": "I remember when all that started hitting.  I worked in a top 25 company at the time and we removed every device in the company using any chips from Huawei.   So many things!",
              "score": -17,
              "created_utc": 1752670279.0,
              "replies": [
                {
                  "id": "n3jr6bk",
                  "author": "crymachine",
                  "body": "So? They just wasted a ton of tech and wrote it off as a tax deduction then and nothing changed?",
                  "score": 9,
                  "created_utc": 1752713468.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n3fzfjj",
          "author": "LupusDeusMagnus",
          "body": "I don’t think so. I think America accused them of that, but America isn’t exactly a sane country, much less devoid of its own interests. Don’t remember if anything came out of that. They are banned in America, Japan and Australia, but the reasons depend.\n\nThey do have restrictions in other countries, derived not from tampering with their equipment, but due to their business practices like bribery, forging documents, money laundering… which are all par for the course for tech industries, but they are bad at it and got caught.",
          "score": 6,
          "created_utc": 1752672671.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3gxg6h",
      "author": "terrytw",
      "body": "Who the fuck can compete with a brand that represents the country, in a fanatic nationalist country?",
      "score": -18,
      "created_utc": 1752683803.0,
      "replies": [
        {
          "id": "n3kkv5l",
          "author": "mr_ji",
          "body": "People are utterly indifferent to the government in China.",
          "score": 9,
          "created_utc": 1752724737.0,
          "replies": [
            {
              "id": "n3ko5fl",
              "author": "_RADIANTSUN_",
              "body": "This is the harsh truth that a lot of American analysis of China completely misses. The smartest thing the CCP has ever done is making itself in recent decades close to completely invisible in the daily lives of the insanely massive population of China. As a result Average Chinese people don't give a fuck about politics in general. They are literally busy doing other stuff. Americans by and large are hugely absorbed in politics as a major part of their lives and can't even imagine this.",
              "score": 15,
              "created_utc": 1752726184.0,
              "replies": [
                {
                  "id": "n3l9bv7",
                  "author": "ThomzLC",
                  "body": "This.",
                  "score": 2,
                  "created_utc": 1752736687.0,
                  "replies": []
                },
                {
                  "id": "n40hps6",
                  "author": "Euro7star",
                  "body": "This is 100% incorrect holy shit. You dont know anything about Chinese people.",
                  "score": 1,
                  "created_utc": 1752940319.0,
                  "replies": [
                    {
                      "id": "n436kog",
                      "author": "_RADIANTSUN_",
                      "body": "It's actually 100% correct and the nation of China and I are boys, we grew up together",
                      "score": 1,
                      "created_utc": 1752972299.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n3ijcyd",
          "author": "Xanchush",
          "body": "Apparently the US, who is also a fanatic nationalist country.",
          "score": 12,
          "created_utc": 1752699731.0,
          "replies": [
            {
              "id": "n3jqtec",
              "author": "crymachine",
              "body": "Not if you ask this dude who gets their news from the 6 mega corporation stations that have no geopolitical information or news.",
              "score": 8,
              "created_utc": 1752713338.0,
              "replies": []
            },
            {
              "id": "n3jn6uw",
              "author": "terrytw",
              "body": "If US is at 10 China is at 100 in terms of nationalism. Also Apple does not even remotely represents the US, does anyone calling out Apple's bullshit anti-consumer behaviors getting doxxed by a million people online and called traitors?",
              "score": -8,
              "created_utc": 1752712037.0,
              "replies": [
                {
                  "id": "n3jnfw9",
                  "author": "Xanchush",
                  "body": "I thought we were talking about something completely irrelevant such as fanatical nationalism like MAGA? Are we talking about something completely different again? I'm confused. Your emotions aren't facts. Please go read a book or better yet touch grass.",
                  "score": 9,
                  "created_utc": 1752712128.0,
                  "replies": []
                },
                {
                  "id": "n3l9u9h",
                  "author": "ThomzLC",
                  "body": "Ah yes, because nothing says ‘100x more nationalist’ like quietly going about your life and not caring what the government’s up to. Meanwhile in the U.S., calling someone un-American just means they voted differently.",
                  "score": 3,
                  "created_utc": 1752736974.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3llwl7",
      "author": "rainnor",
      "body": "cheap phone, great for burners. For your side piece, not the CCP.",
      "score": -2,
      "created_utc": 1752743862.0,
      "replies": []
    }
  ]
}