{
  "post": {
    "title": "Porch pirates appear to be using AT&T data to track iPhones",
    "author": "a_Ninja_b0y",
    "id": "1gu72uh",
    "score": 4372,
    "created_utc": 1731943162.0,
    "selftext": "",
    "num_comments": 206,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gu72uh/porch_pirates_appear_to_be_using_att_data_to/"
  },
  "comments": [
    {
      "id": "lxrs1cv",
      "author": "mobrocket",
      "body": "My guess is:\n\nCurrent or former employee who still has network access\n\nOr someone who is able to log in as an employee due to name a reason \n\nMy guess is ATT is like many companies who view good IT security just as an expense and not as a necessary asset",
      "score": 1537,
      "created_utc": 1731945187.0,
      "replies": [
        {
          "id": "lxrsxyp",
          "author": "VagSmoothie",
          "body": "It’s definitely internal fraud. \nSomeone on the ‘inside’ has access to tracking and passes it off to the thieves for a cut. \n\nBanks are quite good at tracking this kind of thing; logging which employee accounts are accessing which customer accounts and doing a trace back to find the culprit. \n\nI doubt that telecoms have ever really needed to do this type of thing, so it’s gonna be a while before they can put a stop to it.",
          "score": 531,
          "created_utc": 1731945475.0,
          "replies": [
            {
              "id": "lxsduex",
              "author": "akaender",
              "body": "I built an integration to their backend API a few years ago for an internal company portal so that employees could self-service manage their employee paid mobile plans/devices.  I ran into an issue where the integration was failing against their test environment that they had given us credentials for to test ordering devices, etc without actual transactions happening.\n\nSo I escalate and eventually end up on a call with a lead developer on their side and he says \"oh yea, the test environment has been broken for years and no one knows how to fix it.  Just test in production\", which is *not* a good idea so I challenged back \"If I run these test transactions through production won't that result in charges being applied to our account and devices shipped?  how do I flag them as test transactions so that this doesn't happen?\" to which he confidently replies \"Just use this fake address to the North Pole, we have this hard coded in production to automatically cancel the order.  This is how we test internally\".\n\nI take this info back to my management and told them no fuckin way was I going to use my own corporate pcard to run these tests against their prod because I had zero confidence in that working out well for me.  My manager thinks it'll be fine though so gives me his pcard and I'm like okay, whatever, you get to deal with the fallout of this.\n\nYou can probably guess what happened next.  I ran a small test batch of 10 device orders.  We received 4 cancel emails and 6 YOUR ORDER HAS SHIPPED emails.  My boss gets 6x iPhone charges on his pcard for devices shipped with tracking numbers to a fake address at the north pole.  They were unable to cancel those orders because the address was invalid, yet the billing and labels had been printed somehow and the devices left the warehouse never to be seen again.  Fortunately since they never showed as delivered we were able to charge back the billing.\n\nAll that to say... their backend is likely compromised in so many ways that this article doesn't surprise me at all.",
              "score": 208,
              "created_utc": 1731951885.0,
              "replies": [
                {
                  "id": "lxt4sa9",
                  "author": "mccoyn",
                  "body": "Fun fact, the lead developer lives in the North Pole.",
                  "score": 71,
                  "created_utc": 1731959996.0,
                  "replies": [
                    {
                      "id": "lxtc1jz",
                      "author": "mrkstu",
                      "body": "Fun fact, this is how Santa gets iPhones for Christmas.",
                      "score": 56,
                      "created_utc": 1731962226.0,
                      "replies": [
                        {
                          "id": "lxx5vdh",
                          "author": "doyletyree",
                          "body": "God DAMMIT, I knew there was something fishy about that guy.",
                          "score": 9,
                          "created_utc": 1732021704.0,
                          "replies": []
                        },
                        {
                          "id": "lxxhzld",
                          "author": "None",
                          "body": "DUH!! My 6 year old knows this /s",
                          "score": 1,
                          "created_utc": 1732026256.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lxwh9t4",
                  "author": "None",
                  "body": "Not a telecom company, but my first job in IT at a community college had their help desk \"database\" *cough* running on nothing more then a shaky instance of a access database/clunky front end.\n\nWas being trained to do printer support (hardware level mainly, fixing the beasts/clearing issues rather then computer level, but still would setup network printers) and found that out when the person teaching me would have to \"wait\" for the database. The other back end support folks would \"rotate\" access to it quickly when the main support line wasn't ringing to get tickets if they lost them, needed to add notes/close/delete, didn't auto print, etc.\n\nAs is the norm with your average institution, too many folks demanded access to it and they lost the ability to fully keep a lid on it (rather then upgrade it, guess the status quo was better)\n\nSo one day they can't get into it. We had 3 main campus locations and many satellite locations in town, out of town, and wayyyy out of town. Turns out one of the wayyyyyy out of town locations had a power tripper demanding access to this patchy system of ill repute/poor design and then just... disappeared? (went to lunch most likely)\n\nThat was a hilarious mess. Always had my own work to do between printers or my primary purpose for getting hired in (shuffling box trucks of equipment around for rolling upgrades) but the sheer annoyance/panic of everyone just in the office i'm working in alone i'll never forget \"Hey, is your instance closed?\" Yeah!\" \"yours?\" \"YEAH\" \"yours?!\" \"YES!\"",
                  "score": 10,
                  "created_utc": 1732008135.0,
                  "replies": []
                },
                {
                  "id": "lxtx8xw",
                  "author": "Funny_Alternative_55",
                  "body": "The carrier’s system probably sent them to North Pole, AK lol",
                  "score": 15,
                  "created_utc": 1731968713.0,
                  "replies": []
                },
                {
                  "id": "lxxiqog",
                  "author": "PriorWriter3041",
                  "body": "It's a \"fake\" address. That's what I would have said, too :D",
                  "score": 1,
                  "created_utc": 1732026521.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxs3r7n",
              "author": "Justinieon13",
              "body": "It’s internal fraud for sure. In 2017 I was an AT&T employee. I called our internal AT&T number to setup a directv employee account and once I hung up, within 5 minutes I got a scam call out of Jamaica claiming it was the employee hotline and needed to verify card information for my purchase I just made. Except it wasn’t a purchase and payment was not needed. They had my name and employee ID. They rely heavily on 3rd party call centers that do very little in terms of information security.",
              "score": 328,
              "created_utc": 1731948835.0,
              "replies": [
                {
                  "id": "lxs6p8o",
                  "author": "mobrocket",
                  "body": "WTF....",
                  "score": 88,
                  "created_utc": 1731949736.0,
                  "replies": []
                },
                {
                  "id": "lxsub85",
                  "author": "Lotronex",
                  "body": "I worked at one of the 3rd party call centers for ATT from ~2010-2015.  ATT actually closed our WFH program down because one of the other centers was caught selling customer info like that.  But it's so much cheaper they don't really care.",
                  "score": 95,
                  "created_utc": 1731956835.0,
                  "replies": []
                },
                {
                  "id": "lxsayl9",
                  "author": "VagSmoothie",
                  "body": "WOW! That’s nuts.",
                  "score": 29,
                  "created_utc": 1731951022.0,
                  "replies": []
                },
                {
                  "id": "lxu9pii",
                  "author": "0O0O0OOO0O0O0",
                  "body": "Jamaican call centers are known for this. People get jobs there because selling customer info pays more than the actual paycheck.",
                  "score": 25,
                  "created_utc": 1731972895.0,
                  "replies": []
                },
                {
                  "id": "lxtou7h",
                  "author": "Cluelesswolfkin",
                  "body": "Can confirm. Same thing for me but it was Optimum.",
                  "score": 15,
                  "created_utc": 1731966089.0,
                  "replies": [
                    {
                      "id": "lxufty0",
                      "author": "sirhecsivart",
                      "body": "Optimum’s phone support went downhill once they moved customer care out of Newark.",
                      "score": 2,
                      "created_utc": 1731975024.0,
                      "replies": [
                        {
                          "id": "lxujquz",
                          "author": "cocktails4",
                          "body": "I can't imagine support much worse than what Optimum currently provides. I was so happy when I finally got to cancel my service a couple years back. Verizon 5G Home customer service is 100% real Americans.",
                          "score": 1,
                          "created_utc": 1731976386.0,
                          "replies": [
                            {
                              "id": "lxul6x2",
                              "author": "sirhecsivart",
                              "body": "I would say Verizon Wireless support. Verizon Wireline and Home 5G is good, but wireless is horrible since Verizon Wireless and Wireline are run like 2 separate companies.",
                              "score": 5,
                              "created_utc": 1731976891.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lxudngu",
                  "author": "microcandella",
                  "body": "3rd party call center for at&t's supposedly broke up monopoly in the 90's.  Our targets?  Unlisted numbers of homeowners! (aka rich, old  and private) Our top 'service' was a very fancy voicemail system at $4500 \"installed\" then $650/month.",
                  "score": 5,
                  "created_utc": 1731974269.0,
                  "replies": []
                },
                {
                  "id": "lxtgkc2",
                  "author": "apocalypsebuddy",
                  "body": "A 5 minute window sounds like someone has hooked into an API and the info is being automatically passed to someone. ",
                  "score": 17,
                  "created_utc": 1731963585.0,
                  "replies": []
                },
                {
                  "id": "lxww3gz",
                  "author": "MAXSuicide",
                  "body": "> 3rd party call centers\n\nEvery western nation that does this - to India, Jamaica, whatever 3rd world - unfortunately goes the way you describe. Spam/scam. \n\nHaving said that, though, I worked a job where a guy had come from a call centre here in the UK that was specifically made to call up old people and keep them on the line for x amount of time in order to 1) provide unnecessary services to them 2) run up a big ol' phone bill.",
                  "score": 2,
                  "created_utc": 1732017250.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxrw1q9",
              "author": "mobrocket",
              "body": "We had a similar leak in my company \n\nAlmost 3 months undetected \n\nBut our IT is shit, we underpay and have constant turnover, especially people leaving for better jobs",
              "score": 74,
              "created_utc": 1731946462.0,
              "replies": [
                {
                  "id": "lxss0y7",
                  "author": "nagi603",
                  "body": "> But our IT is shit, we underpay and have constant turnover, especially people leaving for better jobs\n\nSo, same or better as AT&T?",
                  "score": 14,
                  "created_utc": 1731956149.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxsyu1i",
              "author": "rebbsitor",
              "body": "They definitely should up their internal security, but it's strange this is still happening.  I mean they could just require a signature on delivery.  That AT&T doesn't require a signature for a $1,000+ item is nuts.",
              "score": 14,
              "created_utc": 1731958193.0,
              "replies": [
                {
                  "id": "lxt53tg",
                  "author": "mccoyn",
                  "body": "If the phone gets returned for no signature, that's AT&T's problem.  If it is delivered and stolen, that's your problem.",
                  "score": 10,
                  "created_utc": 1731960093.0,
                  "replies": [
                    {
                      "id": "lxtb356",
                      "author": "rebbsitor",
                      "body": "The opposite actually.  If someone's not there to sign for a package, FedEx will redeliver it or hold it for pickup.  Or worst case return it if no one ever gets it, but at least they don't lose the phone.\n\nA company is legally responsible for delivery of a product to the customer (not their doorstep).  If it gets stolen off a porch, the company has to file an insurance claim for it or eat the cost.  They may try to convince someone it's their problem, but legally the seller is on the hook for it.\n\nPretty much every other company does signatures on items like that for this reason. AT&T is the oddball here.",
                      "score": 15,
                      "created_utc": 1731961935.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lxwzock",
                  "author": "edvek",
                  "body": "That wouldn't stop much unfortunately. When you order directly from Samsung they always require a signature. One time through FedEx I had to go pick it up at their center because I missed it as I was at work. The other time it was UPS and the guy just dropped it off and left. Wasn't a big deal as I was home but he didn't even attempt to get my signature even though the shipping and all that clearly stated a signature was required.\n\nLazy/employees who don't care/still using COVID rules will just drop the package and leave. If they have to take it back that means they have to return again to attempt delivery. Why come back when I can just come once?",
                  "score": 2,
                  "created_utc": 1732019005.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxrztft",
              "author": "mark-haus",
              "body": "ISPs not taking their security in any domain   seriously is practically a truism. This tracks with their history",
              "score": 30,
              "created_utc": 1731947639.0,
              "replies": [
                {
                  "id": "lxt6ear",
                  "author": "Lint_baby_uvulla",
                  "body": "Oh.  So like having a [public facing API](https://www.reddit.com/r/australia/comments/xp2e8n/a_very_sophisticated_cyber_attack_david_pope_27922/) to a test environment with no security or rate-limiting, using production data, and, let’s make the database increment new records by one.  \n\n[Thanks Optus, your 9.8 million customers are fucked.](https://www.upguard.com/blog/how-did-the-optus-data-breach-happen)",
                  "score": 12,
                  "created_utc": 1731960493.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxt1s9q",
              "author": "Sawses",
              "body": "> Banks are quite good at tracking this kind of thing; logging which employee accounts are accessing which customer accounts and doing a trace back to find the culprit. \n\nThere's no excuse for any organization with secure data to *not* log this. The actual cost of it is minuscule, and the benefit is that you can basically solve any of these problems by giving one person with a decent head on their shoulders access to the data.",
              "score": 13,
              "created_utc": 1731959088.0,
              "replies": [
                {
                  "id": "lxu60cm",
                  "author": "Takemyfishplease",
                  "body": "What if that one person is the scammer tho? Didn’t that happen to the cia in the Cold War?",
                  "score": 1,
                  "created_utc": 1731971608.0,
                  "replies": [
                    {
                      "id": "lxu70q5",
                      "author": "Sawses",
                      "body": "Fair enough.\n\nTwo people selected at random, and a third person auditing both of them.",
                      "score": 1,
                      "created_utc": 1731971959.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lxstggz",
              "author": "Sherifftruman",
              "body": "Probably the same people that used to sell carrier unlocks on eBay until they cracked down on that.",
              "score": 7,
              "created_utc": 1731956577.0,
              "replies": []
            },
            {
              "id": "lxt32s7",
              "author": "mephi5to",
              "body": "Internal fraud is great. We once opened a credit card in HomeSence or similar shop to get X% discount. But didn’t use it in store. 2 weeks later had a charge on it - we haven’t even remove sticker from it and called to “activate” it. Ha!",
              "score": 9,
              "created_utc": 1731959479.0,
              "replies": []
            },
            {
              "id": "lxu9hgk",
              "author": "None",
              "body": "Ship an AirTag as an “iPhone”",
              "score": 2,
              "created_utc": 1731972816.0,
              "replies": []
            },
            {
              "id": "lxuhs0u",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1731975700.0,
              "replies": [
                {
                  "id": "lxwi90p",
                  "author": "hughk",
                  "body": "My signature done by finger painting is very deniable.\n\nI quite like the use of a one time numeric code for reducing fraud. Recipient gets the number and then has to give it to the delivery person before the item is released.",
                  "score": 2,
                  "created_utc": 1732008803.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxujxhm",
              "author": "RustySheriffsBadge1",
              "body": "They can and they do. You would be surprised at how deep our corporate investors can go. (Work at a major telecom company)",
              "score": 1,
              "created_utc": 1731976450.0,
              "replies": []
            },
            {
              "id": "lxwn5io",
              "author": "Tigerballs07",
              "body": "The major telecommunications company's have internal fraud and criminal investigation teams that are huge only they generally are focused on sim swapping rings. They 100 percent have the ability to track account access and could and probably will track this down.\n\n\nI know this for reasons I can't disclose.",
              "score": 1,
              "created_utc": 1732012039.0,
              "replies": [
                {
                  "id": "lxzrogr",
                  "author": "Usual-Housing4218",
                  "body": "Disclose it. They don’t know your Reddit. Don’t let corporations scare you!",
                  "score": 1,
                  "created_utc": 1732051103.0,
                  "replies": [
                    {
                      "id": "lxzyank",
                      "author": "Tigerballs07",
                      "body": "I mean what I said isn't 'negative' if anything its a positive. But I'm also not about to disclose who I work for.",
                      "score": 1,
                      "created_utc": 1732053095.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ly40fz7",
              "author": "TheRealLRonHoyabembe",
              "body": "It’s internal theft from the delivery carrier. Cell providers use intranets. You can’t access the network without being in site (their processing tablets tend to be geofenced). The theft is happening from the delivery carriers. I know this because as a former cellular provider rep we had return devices go missing that were hand delivered to fedex/ups/usps locations and never made it out of those locations. They’re being stolen in transit by drivers who are telling buddies what stops have phones. The boxes they’re shipped in are super easy to identify. They all look the same.",
              "score": 1,
              "created_utc": 1732116432.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxsb0ti",
          "author": "Stimbes",
          "body": "I agree. When I read the title I was thinking something like SS7 but since it’s just AT&T I think you’re right about it being internal employee(s) or a contractor with this same kind of access.",
          "score": 10,
          "created_utc": 1731951041.0,
          "replies": []
        },
        {
          "id": "lxslkab",
          "author": "tubezninja",
          "body": "Without a doubt it's gotta be disgruntled AT&T employees, most likely working retail. Their pay is based heavily off commissions, and they have increasingly unrealistic quotas and metrics they have to meet.\n\nThe system is heavily skewed to ~~force~~ motivate store salespeople to make sales.  If you go into a brick and mortar cell carrier store for help with your account or to just get a new SIM card, you'll discover pretty quickly that none of the staff there will want to help you unless they can *sell* you something. If you walk away from the store without buying anything, it counts negatively on their metrics.\n\nAnd, it's not enough to *just* sell you a new phone. Doing *just* that is also a negative. They also have to try and push a a new line of service on your account. Device insurance. Their family location tracking add-on.  Pet and car trackers that also require separate lines of service. Accessories like chargers, screen protectors, cases and cables (all of which you might already have or can get cheaper somewhere else).  Each sales employee has to sell a certain number of these.  If not, they not only miss out on commission, but they could be shown the door if they don't hit their quotas.\n\nIf you notice every once in a while, people will post on r/ATT, r/Verizon or r/tmobile about how they left a store and discovered they got got charged more than they were told, and their account has add-ons and lines they didn't ask for, this is why. The customer probably needed something basic, and the employee had their back to the wall because they're required to upsell.  So they crammed what they could onto that customer's account, maybe confused the customer with a bunch of doublespeak, and hoped they wouldn't notice long enough for it to stick to their metrics.\n\n**TL;DR: When you already have to be unethical to keep your job, it's not that far of a reach to start selling out customer data you have access to, so someone else can go for device thefts.**\n\nThis is why I tell people to avoid going into a brick and mortar phone shop unless there's some reason you absolutely have to.  If you're buying a new phone, buy it unlocked direct from the company that makes it if you can (like the Apple Store, or direct from Google/Samsung/whatever).  It sucks for anyone working at these shops who maybe don't have any other choice, but going in there puts you in a grift that's a pain to get out of, and your personal data is also at risk too when you're on the employees' radar and they have reason to  access it.",
          "score": 12,
          "created_utc": 1731954210.0,
          "replies": [
            {
              "id": "lxtjj06",
              "author": "mikka1",
              "body": "> And, it's not enough to just sell you a new phone. Doing just that is also a negative. They also have to try and push a a new line of service on your account. Device insurance. \n\nLOL, we had a recent story in one of the local immigrant groups from a guy who left *a bit puzzled* after he visited AT&T office just to get his first line in the US, and left with $438/mo services (4 lines etc. etc.).",
              "score": 3,
              "created_utc": 1731964479.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxwwy7w",
          "author": "SmokinOil",
          "body": "I fully believe this I have att and had a phone stolen off the porch and that has never happened except the one time I was waiting for a replacement phone not one package and my girl orders shit all the time …. But they did send me another one no problem still a pain in the ass though having to wait another week",
          "score": 5,
          "created_utc": 1732017680.0,
          "replies": [
            {
              "id": "lxyczl6",
              "author": "UncoolSlicedBread",
              "body": "I went over to my sisters house a week ago to sit around and wait for their phones to arrive during the day. FedEx gave a time between 9-10am, a random car pulled up along the yard across the road and sat there for a good hour. They’re just on their phone in the spot across the way. \n\nFedEx switched the delivery time to 2-4pm and about the time my sister gets the notification, the dude takes off.",
              "score": 2,
              "created_utc": 1732035969.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxssplt",
          "author": "oboshoe",
          "body": "Here's the thing about hackers:   They all have day jobs.\n\nAnd those day jobs are ~~sometimes~~ usually in cyber security roles.",
          "score": 8,
          "created_utc": 1731956351.0,
          "replies": [
            {
              "id": "lxtfr3y",
              "author": "adrian783",
              "body": "case in point: Thomas A. Anderson",
              "score": 1,
              "created_utc": 1731963342.0,
              "replies": [
                {
                  "id": "lxu6dqj",
                  "author": "asspajamas",
                  "body": "mr anderson.....",
                  "score": 1,
                  "created_utc": 1731971737.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lxs9he7",
          "author": "Alimayu",
          "body": "Someone did this to me. I was standing in line at the grocery store in Atlanta and someone commented on my internet history in full gangstalker format. I had to complain about it to an Executive. \n\nThey were actually hacking cell towers in Atlanta and Blacking out coverage in parts of Atlanta. \n\nThis is why I dropped AT&T",
          "score": 9,
          "created_utc": 1731950579.0,
          "replies": [
            {
              "id": "lxsdebh",
              "author": "BeardBootsBullets",
              "body": "It’s unlikely that they are jamming cell towers, or at least it’s unlikely that they’ll get away with it. The FCC Office of Investigations takes their job very seriously, and they will quickly respond if AT&T even mutters anything about someone jamming cell towers. There was a case of some nut job driving a car with a hardwired cell jammer installed, and the FCC tracked him down because he had inadvertently passed cell towers while doing so. $48,000 fine. \n\nhttps://www.fcc.gov/document/48k-penalty-proposed-against-individual-cell-jammer-investigation-0",
              "score": 13,
              "created_utc": 1731951752.0,
              "replies": [
                {
                  "id": "lxsfxyg",
                  "author": "Alimayu",
                  "body": "They didn't get away with it. It stopped shortly after. ",
                  "score": 1,
                  "created_utc": 1731952511.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxsaijk",
              "author": "mobrocket",
              "body": "That's a federal crime and you can get severe punishment because it could impact First Responder/ 911",
              "score": 2,
              "created_utc": 1731950889.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxs98t8",
          "author": "srfrosky",
          "body": "The see all regulations, not just security as expenses.\n\nWhat could we possibly gift telecoms for Xmas that could make all those pesky expenses go away? 🎁",
          "score": 2,
          "created_utc": 1731950507.0,
          "replies": []
        },
        {
          "id": "lxw13km",
          "author": "thanatossassin",
          "body": "Definitely not in-store or sales, they don't have access to any of that information. Has to be within the supply chain, warehouse or logistics.",
          "score": 1,
          "created_utc": 1731997818.0,
          "replies": []
        },
        {
          "id": "lxw3c9v",
          "author": "Xenophonii10",
          "body": "Dude the amount of internal abuses at phone companies is insane. I was literally scammed by a Verizon store into getting a phone they told me was covered.. it wasn’t. On top of that scammers “leakers” of music and porn and such pay off phone store employees to get access to celebs’ phone numbers to do sim swapping and it’s pervasive as hell.",
          "score": 1,
          "created_utc": 1731999121.0,
          "replies": []
        },
        {
          "id": "lxta2ba",
          "author": "Hopeful-Sir-2018",
          "body": "> Current or former employee who still has network access\n\nIf only we had tech privacy laws. While stalking is one thing.. if we had laws that would anonymize data and users and hold companies accountable for failure to comply - it would go pretty far.\n\nBut the alphabet agencies love being able to grab information anytime they want and for any reason they want - so they view privacy and security as a threat. So companies have zero incentive to value either of those.",
          "score": 1,
          "created_utc": 1731961623.0,
          "replies": []
        },
        {
          "id": "lxx6ygs",
          "author": "soytuamigo",
          "body": "> My guess is ATT is like many companies who view good IT security just as an expense and not as a necessary asset\n\nThat's not fair. That someone is exploiting a vulnerability does not translate to \"company doesn't care about security\". All companies are vulnerable to having their system compromised. Criminals only have to succeed once yaad yada",
          "score": 0,
          "created_utc": 1732022143.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxrq7tu",
      "author": "durielvs",
      "body": "Here in Argentina they deliver the product to you in hand, they don't leave it lying at your door.\nHow much is the savings so that companies leave products that can cost thousands of dollars at your door?",
      "score": 267,
      "created_utc": 1731944606.0,
      "replies": [
        {
          "id": "lxruy0w",
          "author": "ElevatedLegend",
          "body": "I live in the US and for electronics over a certain price most of these companies do make you sign for the package so it is delivered in hand.\n\nThat did not stop someone from stealing the iPhone I bought through my carrier, as I got an empty iPhone box delivered to my house that they wanted me to sign for. Someone stole it before it even arrived to the shipper so the shipper box was intact but the iPhone box was ripped open.",
          "score": 139,
          "created_utc": 1731946113.0,
          "replies": [
            {
              "id": "lxsvxnt",
              "author": "Dmage22",
              "body": "I've ordered two iPhone 16 pro last month.   \n\nUPS delivered one, walked up to the door, dropped it off at the gate, rang the bell and walked away.   \n\nFedEx \"delivered\" the second one, ran up to the gate, slapped the \"we missed you\" note, and ran away. Didn't even ring the doorbell or anything . We were waiting in living room for delivery the entire day, we ran out the gate when we saw his truck, but he was too fast and drove away.",
              "score": 55,
              "created_utc": 1731957322.0,
              "replies": [
                {
                  "id": "lxvasac",
                  "author": "ruffznap",
                  "body": "> ran up to the gate, slapped the \"we missed you\" note, and ran away\n\nI so badly wish shipping companies would crack down on employees doing this shit. They SO often do this with signature required packages. It's annoying as hell.",
                  "score": 42,
                  "created_utc": 1731985927.0,
                  "replies": [
                    {
                      "id": "lxvjaw1",
                      "author": "DadJokeBadJoke",
                      "body": "The employees are often doing it because they're held to ridiculous standards by their employers.",
                      "score": 28,
                      "created_utc": 1731989245.0,
                      "replies": []
                    },
                    {
                      "id": "lxvemzw",
                      "author": "PocketNicks",
                      "body": "I get almost all my packages delivered to my local post office, about a 3 minute walk from my home. There's always someone there to sign for it, no missed delivery. Doesn't cost me anything. I get an email notification from the post office within minutes of the delivery and I can pick it up same day if I get there before they close.",
                      "score": 10,
                      "created_utc": 1731987401.0,
                      "replies": [
                        {
                          "id": "ly3m49m",
                          "author": "notjordansime",
                          "body": "Same, except my post office is about 7km away. I live in a rural town, so the post office is also a liquor store (rare in Ontario, most liquor stores are dedicated establishments that ONLY sell alcohol). Always fun to go pick up my estrogen and wine at the same location lmfao",
                          "score": 3,
                          "created_utc": 1732111561.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lxvv828",
                      "author": "Mcpisspants38",
                      "body": "Did it to me with a couch last week. Waited all day at home 2k couch. Truck pulled up. I think it’s backing into the driveway to back up the driveway.  Nope. He didn’t feel like driving up the long windy driveway and was just turining around to leave. By the time I got in my car to chase after him he was gone. Like what a fucking asshole. \n\nTwo days later. Redelivery. This time I drove down in advance and waited in my car as they approached. I could tell the two guys were already planning to fuck this one as they didn’t just turn into the driveway. I jump out and was like “go up to the house with the truck”. They looked thoroughly annoyed that I was there at the bottom so they couldn’t just leave. You can’t see the house from the street so I guess they are afraid to just drive up a private driveway without knowing if they can turn around but too fucking bad. You can back down if you have too. They were also aware there was a incident report for the first attempt.",
                      "score": 2,
                      "created_utc": 1731994662.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lxxmvr6",
                  "author": "digital43",
                  "body": "FedEx is just a group of thieves lurking around until someone has to ship a phone for trade in or receive a phone from new purchase. There are so many reports of them doing this no joke",
                  "score": 5,
                  "created_utc": 1732027934.0,
                  "replies": [
                    {
                      "id": "lxxoox6",
                      "author": "Dmage22",
                      "body": "Coincidentally, I also had an experience dropping off a phone at FedEx to send in for trade in. I got an email later saying they received an empty box... 😂",
                      "score": 2,
                      "created_utc": 1732028524.0,
                      "replies": []
                    },
                    {
                      "id": "lxxuvt8",
                      "author": "Vallamost",
                      "body": "Still better than UPS, UPS will charge you to send emails at their stores.",
                      "score": 2,
                      "created_utc": 1732030507.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lxxbskc",
                  "author": "jeandlion9",
                  "body": "Thats what happens when routes are timed by management",
                  "score": 2,
                  "created_utc": 1732024001.0,
                  "replies": []
                },
                {
                  "id": "lxxh3w0",
                  "author": "Dwarfinator1",
                  "body": "As a disabled person who can't just up and walk/drive to the post office, the shit that FedEx person did is astronomically infuriating. I had a recent encounter with DHL just refusing to fucking deliver or even come to our apartment it was so fucking annoying.",
                  "score": 2,
                  "created_utc": 1732025940.0,
                  "replies": []
                },
                {
                  "id": "lxy440d",
                  "author": "LetThemEatVeganCake",
                  "body": "When I ordered mine through AT&T, FedEx didn’t even try to take it to my house! They just sent it to a distribution center and made me go there to pick it up. No notification that I needed to do that or anything - I only noticed because I went snooping on the tracking info wondering where it was. The guy at FedEx said they had too many stolen, so weren’t even attempting delivery anymore for any phones from AT&T, since they won’t pay for signature service. It wasn’t neighborhood-specific either, just everything coming out of that distribution center.",
                  "score": 2,
                  "created_utc": 1732033327.0,
                  "replies": []
                },
                {
                  "id": "lxvekzs",
                  "author": "PocketNicks",
                  "body": "I get almost all my packages delivered to my local post office, about a 3 minute walk from my home. There's always someone there to sign for it, no missed delivery. Doesn't cost me anything. I grt an email notification from the post office within minutes of the delivery and I can pick it up same day if I get there before they close.",
                  "score": 0,
                  "created_utc": 1731987380.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxwrqjw",
              "author": "mkhush02",
              "body": "We here have a thing called open box delivery where the delivery person opens it right in front of you and then you can choose wether to accept it or not",
              "score": 3,
              "created_utc": 1732014867.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxrtn8z",
          "author": "Nacho_Dan677",
          "body": "FedEx drivers in the US could literally see you and still not care and mark it as a missed delivery. I don't think in the US a driver will ever be forced or feel that they have to actually deliver the package until they are paid more.",
          "score": 82,
          "created_utc": 1731945699.0,
          "replies": [
            {
              "id": "lxs5d9n",
              "author": "Drone314",
              "body": "Literally yesterday. I was standing outside of my garage and the fedex guy pulled in front of my mailbox and bumped the package in the flower bed. Like dude...I'm standing right there. They are the worst.",
              "score": 27,
              "created_utc": 1731949327.0,
              "replies": []
            },
            {
              "id": "lxs5q3o",
              "author": "Pauly_Amorous",
              "body": "I live in an apartment complex where the front office doesn't accept packages. If packages aren't small enough to fit in the mail room lockers, drivers just leave packages by the door, and 99% of the time, they don't knock. So if you don't work from home like I do, you could have a $1,000 phone just sitting out in the breezeway for hours.",
              "score": 13,
              "created_utc": 1731949437.0,
              "replies": []
            },
            {
              "id": "lxrwv0n",
              "author": "trainbrain27",
              "body": "There are several layers between FedEx and the folks that (refuse to) deliver your packages.\n\nThey've intentionally subcontracted it out so much that they can either dodge responsibility or make you talk to AIs and underpaid undertrained call center workers until you give up.",
              "score": 34,
              "created_utc": 1731946719.0,
              "replies": [
                {
                  "id": "lxv0tnv",
                  "author": "Swastik496",
                  "body": "good thing it’s not your problem. \n\nChargeback and make it the merchant’s problem. \n\nTheir lawyers will deal with Fedex’s lawyers if package theft becomes a big enough issue",
                  "score": 4,
                  "created_utc": 1731982332.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxviwkf",
              "author": "StateChemist",
              "body": "At work we use UPS and FedEx both.\n\nLiterally all of our bullshit complaints are on Fedex.",
              "score": 3,
              "created_utc": 1731989081.0,
              "replies": []
            },
            {
              "id": "lxt8rnc",
              "author": "None",
              "body": "Half the time, any mail carriers coming through on a Sunday will just mark that the mailbox was inaccessible and not even drive down our street.\n\nIt’s wild that the employees for these companies have gotten so obviously lazy, when nowadays every house has a camera out front.\n\nI guess that footage would have an impact if they allowed you to share it. No one lets you report issues with your driver. I guess it’s cheaper to put in an insurance claim here and there for package issues than it is to hire enough people to keep your business reputable.",
              "score": 5,
              "created_utc": 1731961227.0,
              "replies": [
                {
                  "id": "lxt9jgw",
                  "author": "Nacho_Dan677",
                  "body": "It's not even about hiring enough people. People just simply aren't compensated enough as prices go up. While I don't like not receiving what I paid for I certainly also do dislike not getting paid enough more. It's wrong for them to do but with potentially unrealistic delivery goals and driving times I can certainly see why some drivers may choose to mark something as not delivered mailbox inaccessible.",
                  "score": 1,
                  "created_utc": 1731961462.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxvb175",
              "author": "ExpatMeNow",
              "body": "I’ve got 2 phones sitting in the Fed Ex place that I have to go and get myself tomorrow because twice now they claimed to have attempted delivery. Like fuck they did. I’m home all day and have a ring doorbell as well. Liars. 😡",
              "score": 4,
              "created_utc": 1731986020.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxta98w",
          "author": "Hopeful-Sir-2018",
          "body": "I'm in Texas. Apple usually requires you to sign at the door.\n\nI've had them leave it at the door and sign my own name on my behalf. Locally one dude caught a USPS dude signing people's names and not even stopping. Just out-right stealing it.\n\nIt's fuckin' wild.",
          "score": 5,
          "created_utc": 1731961681.0,
          "replies": [
            {
              "id": "lxy953p",
              "author": "BusyUrl",
              "body": "I'm in Texas also and our mailman is legend for just not trying to get a signature and tossing shit in the box or at the door anyway.  Drives me crazy.",
              "score": 1,
              "created_utc": 1732034833.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxrvj0x",
          "author": "None",
          "body": "That would be seen as weird in US. We don’t want to be bothered. Being forced to answer the door to accept a package is against one of the constitutional amendments or 10 commandments. Something like that.",
          "score": 0,
          "created_utc": 1731946299.0,
          "replies": []
        },
        {
          "id": "lxrrexv",
          "author": "mobrocket",
          "body": "Probably enough usually than paying for a signature \n\nThis spike might change that",
          "score": 1,
          "created_utc": 1731944988.0,
          "replies": []
        },
        {
          "id": "lxuy59y",
          "author": "WeeklyBanEvasion",
          "body": "Most people aren't home during the day to accept a package, but they could ship it to a nearby store",
          "score": 1,
          "created_utc": 1731981379.0,
          "replies": []
        },
        {
          "id": "lxve6s8",
          "author": "PocketNicks",
          "body": "I live in Canada and in the last 20 years I've never had a delivery left at my door. Always in hand or they leave it at the post office for me to collect. Never had a package stolen, only had 2 packages go missing and the sellers replaced them.",
          "score": 1,
          "created_utc": 1731987229.0,
          "replies": [
            {
              "id": "lxvz2ym",
              "author": "CarryOnRTW",
              "body": "I live in Canada and in the last 20 years I've had at least 30 packages left at the door.  Never had a package stolen or missing.  I do know people here who have though.",
              "score": 2,
              "created_utc": 1731996690.0,
              "replies": [
                {
                  "id": "lxwmtyu",
                  "author": "PocketNicks",
                  "body": "Probably depends where you live. I've always lived in a city, where a package would easily be seen by 100 people walking past in the first hour it was left on a doorstep. No chance it gets left there. I know plenty of people in suburbia that have your experience though.",
                  "score": 1,
                  "created_utc": 1732011832.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lxte7aw",
          "author": "VirtualLife76",
          "body": "It would cost a bunch. What happens of they are not home, and the time it takes to wait for someone to answer the door, both add up to a lot of time when it's X1000 doors. Especially since they have more packages than they can deliver in a day anyway.",
          "score": 1,
          "created_utc": 1731962880.0,
          "replies": []
        },
        {
          "id": "lxup6mv",
          "author": "ernyc3777",
          "body": "FedEx and UPS delivery drivers are highly compensated but they’re also highly scrutinized so they are often rushing to get their deliveries done. \n\nAlso, the companies don’t require signatures I guess.",
          "score": 0,
          "created_utc": 1731978291.0,
          "replies": [
            {
              "id": "lxv4l6e",
              "author": "the_Q_spice",
              "body": "I wouldn’t say “highly”. \n\nFedEx Express gets paid better than Ground/Home, who aren’t even corporate employees. \n\nUPS is a pretty mixed bag. \n\nAt FedEx Express we are rushing because unlike basically anyone else - all our deliveries have deadlines within a day (0930 (or earlier in some markets), 1030, 1200/1330, 1700, and 2000/2200) and if we fail to meet them - the customer gets a full refund.",
              "score": 1,
              "created_utc": 1731983683.0,
              "replies": [
                {
                  "id": "lxv8zw4",
                  "author": "ernyc3777",
                  "body": "I have several friends who work for UPS and they’re all pulling in around $100k less than 5 years in. And thus FedEx is pretty competitive. \n\nMaybe a stronger union here than other areas.",
                  "score": 0,
                  "created_utc": 1731985262.0,
                  "replies": [
                    {
                      "id": "lxvb33w",
                      "author": "ruffznap",
                      "body": "The VAST majority of UPS employees aren't making anywhere NEAR 100k/yr.\n\nThe folks who are, are VERY lucky.",
                      "score": 2,
                      "created_utc": 1731986041.0,
                      "replies": [
                        {
                          "id": "lxwisp1",
                          "author": "hughk",
                          "body": "Depends on how many iPhones they can sell.",
                          "score": 2,
                          "created_utc": 1732009179.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lxsip5v",
      "author": "sbvp",
      "body": "My new but defective iPhone 14 pro was sent back to apple for an applecare replacement and I received an email later saying they received an empty box and I would be charged $1K plus. I was worried about this happening so after resetting it i signed in to just enable FMI before sending it back and sent applecare a screenshot from FMI maps of it in a random street near the UPS hub in the city i sent it back to. Applecare released the hold. I think a ups driver stole it.",
      "score": 131,
      "created_utc": 1731953344.0,
      "replies": [
        {
          "id": "lxsxsl1",
          "author": "None",
          "body": "Thieves gonna steal, but there's something extra ballsy about stealing items with global tracking built right into them.  Maybe if there were some actually penalties to it it might make people hesitate.",
          "score": 68,
          "created_utc": 1731957880.0,
          "replies": [
            {
              "id": "lxtfysh",
              "author": "sbvp",
              "body": "Apple required fmi to be disabled in order to create a return or exchange. But once the return was created fmi can be turned back on. So I did. Most people do not though.",
              "score": 40,
              "created_utc": 1731963406.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxv7e1j",
          "author": "incubusfox",
          "body": "> I think a ups driver stole it.\n\nI don't understand this fascination people have with blaming people who are working a career making bank that took them *years* to achieve.\n\nDid a warehouse worker steal it? Probably, we have a constant turnover in our warehouses and there's always idiots who don't consider the benefits of the job they're throwing away.\n\nDid a driver? lol fuck no, a first year driver brings home enough to buy one every week, by year 4 when they top out their salary has more than doubled.",
          "score": 8,
          "created_utc": 1731984685.0,
          "replies": [
            {
              "id": "lxvbenz",
              "author": "OfficialUberZ",
              "body": "A first year driver earns enough to buy one a week yet they have been working years to achieve it?\n\nPeople steal shit they could easily afford all the time.",
              "score": 17,
              "created_utc": 1731986162.0,
              "replies": [
                {
                  "id": "lxve1cm",
                  "author": "incubusfox",
                  "body": "Unless no one else in the building wants to drive, they can only hire 1 outside person to become a driver for every 6 people they hire from inside the building.\n\nSo yes, almost all UPS drivers have waited years to go driving while toiling away in the warehouse.",
                  "score": 6,
                  "created_utc": 1731987171.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ly5sbxs",
              "author": "sbvp",
              "body": "I mainly was thinking from the perspective of an apple employee that It likely would not have happened once the box arrived at the applecare warehouse. I suppose somewhere between coming off the plane and going onto the UPS truck for delivery would make the most sense. My bad",
              "score": 1,
              "created_utc": 1732140096.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lxrqnv9",
      "author": "Delayed_Wireless",
      "body": "Reason why I pay for a private mailbox. My items will be there safely until I pick them up.",
      "score": 48,
      "created_utc": 1731944749.0,
      "replies": [
        {
          "id": "lxs419m",
          "author": "joshuag71",
          "body": "I’m aware this obviously doesn’t work for everyone but I always have anything of any real value delivered to me at work, not at home. Had a couple packages go missing and just said “screw it, I’m at work during the day so I might as well just have these things delivered to where I am at the time instead of where I’m going to be later”.",
          "score": 24,
          "created_utc": 1731948920.0,
          "replies": [
            {
              "id": "lxuaw2h",
              "author": "LetsJerkCircular",
              "body": "Same. I’m at work five days a week. On the off-chance that anything is delivered when I’m not there, the coworker who gets it texts me and puts it in my locker.\n\nIf it gets delivered to the house, it’s sitting on the stoop all day, or I come home to the old “sorry we missed you” sticker.",
              "score": 5,
              "created_utc": 1731973308.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxsz7ck",
          "author": "VaporCarpet",
          "body": "You can also go to the store for your new phone.  And you don't have to wait for shipping...",
          "score": 7,
          "created_utc": 1731958304.0,
          "replies": [
            {
              "id": "m0ldhvg",
              "author": "as_i_wander",
              "body": "Last time I bought a phone my carrier would not allow store pickup option only delivery much to my dismay, so that's not always possible",
              "score": 1,
              "created_utc": 1733429639.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lxrnulx",
      "author": "spikeember",
      "body": "Why not change the name back to theirs? Porch pirates is too polite.",
      "score": 69,
      "created_utc": 1731943836.0,
      "replies": [
        {
          "id": "lxrqc4q",
          "author": "arwinda",
          "body": "*thieves",
          "score": 50,
          "created_utc": 1731944645.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxrr78m",
      "author": "cmfreeman",
      "body": "Wild solution here.... Require signatures",
      "score": 50,
      "created_utc": 1731944920.0,
      "replies": [
        {
          "id": "lxs2h9m",
          "author": "ChafterMies",
          "body": "The drivers won’t even knock. I’ll be home all day and they’ll leave a note that says failed delivery. They are incentivized to make time and not happy customers.",
          "score": 59,
          "created_utc": 1731948450.0,
          "replies": [
            {
              "id": "lxv8ws9",
              "author": "incubusfox",
              "body": "As a driver, this is a mixed bag.\n\nI knocked on a door on Friday for a pickup, her Ring camera saw me, her dogs heard me and barked, *my supervisor witnessed it while standing by the package car*, yet she still yelled at me when I was delivering my next stop 4 houses down about how I didn't knock.",
              "score": 6,
              "created_utc": 1731985230.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxsby89",
          "author": "lump77777",
          "body": "I’ve watched my mailman (from my front windows) put a failed delivery slip in my mailbox when it’s cold or rainy out.",
          "score": 25,
          "created_utc": 1731951320.0,
          "replies": [
            {
              "id": "lxsgtmi",
              "author": "This_aint_my_real_ac",
              "body": "Saw mine out in front to deliver my package, let them do the job and went to the porch to get it. Nothing.\n\nChecked the tracking, yup, delivered to mailbox. We have community mail boxes in one location for 20 or so houses. Okay, but why stop in front of my house. Grab the mailbox key and head out the door.\n\nPackage was sitting smack dab in the middle of my driveway.",
              "score": 6,
              "created_utc": 1731952773.0,
              "replies": [
                {
                  "id": "lzvuz1e",
                  "author": "StandUpForYourWights",
                  "body": "My guy drives all the way down my 400 foot driveway, knocks and waits. If we aren’t home he signs for me and puts it in the stash box I built for him. He’s fucking awesome. I love you Canada Post guy whose name I won’t divulge!",
                  "score": 1,
                  "created_utc": 1733068469.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lxrt7ob",
          "author": "Menn1021",
          "body": "I’ve  seen videos where the guy walks up to the door and signs for it and leaves.",
          "score": 6,
          "created_utc": 1731945561.0,
          "replies": []
        },
        {
          "id": "lxuptcx",
          "author": "allllusernamestaken",
          "body": "my new problem is that FedEx drivers will mark my packages as signed for and then drop them at the mailbox.",
          "score": 1,
          "created_utc": 1731978513.0,
          "replies": []
        },
        {
          "id": "lxx19oo",
          "author": "edvek",
          "body": "That prevents nothing. I've had items that required a signature and the driver walks up, scans, and drop my package and leaves. They didn't get a signature, they faked it/lied. And I've had times where it was required and they posted a missed delivery slip and I'm home... Cars in the driveway and everything.\n\nYou will neve beat lazy/employees who don't care. The only solution to that is have a policy that states \"if a signature is required and you don't get one and there's proof of it, like video camera, you will be immediately terminated and blacklisted for life.\"\n\nObviously this will never happen. I had an issue with UPS and a package said signature needed. I got an update as \"undelivered.\" The guy never even came to my house. I called UPS to let them know and they said \"the supervisor will look into it and call you.\" Never called. I understand everyone there is very busy and under a lot of pressure but one thing I cannot tolerate are lies. If an employee is willing to lie for something small they're willing to lie all the time to keep their job.",
          "score": 1,
          "created_utc": 1732019740.0,
          "replies": []
        },
        {
          "id": "lxuz6cq",
          "author": "WeeklyBanEvasion",
          "body": "Could you imagine the number of angry iPhone users upset that they keep missing their phone delivery?",
          "score": -2,
          "created_utc": 1731981742.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxspce1",
      "author": "FrenzalRhomb1",
      "body": "Here’s my thoughts on this as someone that orders iPhones from AT&T for work a lot…\nWhen you place the order you get an email confirmation with the address and Fedex tracking number, the only way to know the address is thru this email, the tracking number when checked on fedex.com just says the city and the approx delivery time of “by 5:30 pm”, for example. I suspect these theives have access to Fedex’s internal systems and can see the sender is AT&T and obviously the recipient’s address, they would also have more info on the driver’s route to know more closely the delivery time so they don’t have to sit in front of a random house for 8 hours.\n\nthe package label doesn’t say it is from AT&T, its just some random address. \n\nAlso, I was accepting a large iPad delivery from a Fedex driver at work and I said to him “yay, the iPads finally arrived” and he told me to never tell a Fedex employee that as some of them will steal valuable items.",
      "score": 7,
      "created_utc": 1731955348.0,
      "replies": [
        {
          "id": "lxum2hd",
          "author": "khag",
          "body": "Yeah I personally think the \"insider(s)\" selling information are in FedEx not ATT.",
          "score": 1,
          "created_utc": 1731977195.0,
          "replies": []
        },
        {
          "id": "lxv66lq",
          "author": "the_Q_spice",
          "body": "Y’all *do* realize we have literally no info on what is inside boxes right?\n\nI only know a few warehouse addresses that Apple sends stuff from because recipients told me what it was - but then again, we also get medical devices and other random stuff from those same warehouse addresses. \n\nThe only time we know is if it is an international shipment - because the shipper has to provide an itemized customs invoice. \n\nAt least at my station, we also have only been getting 1 company’s devices stolen (how they tracked this issue) - AT&T’s\n\nSo if we or UPS are at fault - please explain why only 1 company is being affected - when we deliver for all of them…",
          "score": 1,
          "created_utc": 1731984257.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxt500i",
      "author": "Numerous-Loquat-1161",
      "body": "They are following FedEx drivers. Neighbor just had two phones stolen within minutes of the delivery.",
      "score": 10,
      "created_utc": 1731960061.0,
      "replies": [
        {
          "id": "lxtvxrq",
          "author": "GregAbbottsTinyPenis",
          "body": "They are working with delivery drivers* ftfy",
          "score": 6,
          "created_utc": 1731968290.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxsa4ge",
      "author": "aaronhayes26",
      "body": "Why would you ever steal an iPhone? These can all be remotely bricked at this point, can they not?",
      "score": 9,
      "created_utc": 1731950770.0,
      "replies": [
        {
          "id": "lxsf9lc",
          "author": "ImSoRude",
          "body": "Most stolen phones are used for parts, locked software doesn't mean shit if you're being stripped for internals",
          "score": 18,
          "created_utc": 1731952308.0,
          "replies": [
            {
              "id": "lxsy44h",
              "author": "Drtysouth205",
              "body": "Most of the important parts of the iPhone are serialized and are actually disabled also. It’s why the right to repair ppl get mad at Apple alot.",
              "score": 16,
              "created_utc": 1731957977.0,
              "replies": [
                {
                  "id": "lxuf8hp",
                  "author": "Candle1ight",
                  "body": "The disable is only respected in the west, they're sold in China",
                  "score": 4,
                  "created_utc": 1731974820.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lxtvux0",
          "author": "GregAbbottsTinyPenis",
          "body": "Carriers can get them blocked from the major North American networks. Send it out of US, MX, or CA service areas and you can get around it. DHS gets involved with these device theft rings a decent amount.",
          "score": 5,
          "created_utc": 1731968264.0,
          "replies": []
        },
        {
          "id": "lxsaexe",
          "author": "nearcatch",
          "body": "The remote brick I think only works if the carrier respects it, and apparently Chinese carriers don’t.",
          "score": 1,
          "created_utc": 1731950858.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxtrc9b",
      "author": "I_Hate_Traffic",
      "body": "We got an iPad stolen in 10 minutes after delivery and we never had this issue before getting constant packages from Amazon. Some shady stuff. Either FedEx employees are in it or someone else knows what's in these boxes.",
      "score": 4,
      "created_utc": 1731966848.0,
      "replies": []
    },
    {
      "id": "lxv5swz",
      "author": "steve_mobileappdev",
      "body": "I have a level of package-theft paranoia that’s a little compulsive. I’ve got a cheap $25 lightbulb style cam looking outside, and on the morning that I’m expecting any delivery that day, I carry my iPad everywhere from kitchen to bathroom to office, keeping a lookout for a truck pulling up.  \nWhen that happens, As soon as I look out my front door window and see them walk back to the truck after delivering – to avoid imposing on them any kind of unwanted social stress - I open the door promptly and receive package.",
      "score": 4,
      "created_utc": 1731984121.0,
      "replies": []
    },
    {
      "id": "lxru07m",
      "author": "Ok-Seaworthiness4488",
      "body": "New AT&T jingle: *reach out and steal someone's (iPhone)*",
      "score": 6,
      "created_utc": 1731945813.0,
      "replies": [
        {
          "id": "lxtvld3",
          "author": "GregAbbottsTinyPenis",
          "body": "I worked in a phone stores for several years. This happens with every carrier. Thieves aren’t using carrier data to track phones. Thieves are working with drivers they follow and take packages immediately after delivery. The packages are incredibly easily identifiable. It’s difficult to breach a system remotely and have someone on the ground to intercept a package in perfect timing. It’s simple to have a driver send a text to let someone know they have devices on their route.",
          "score": 1,
          "created_utc": 1731968178.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxuaxb7",
      "author": "What-the-Gank",
      "body": "This is why you get important items deliver your work place if it's practical to do so. My boss gets alot of packages this time of year for Xmas prep...",
      "score": 3,
      "created_utc": 1731973320.0,
      "replies": [
        {
          "id": "lxw152v",
          "author": "ttak82",
          "body": "Agreed with this. It sucks in cases where you rely on company transit to go home and the delivery guy is coming after office hours. Have to constantly remind them to deliver in the right time.",
          "score": 1,
          "created_utc": 1731997842.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxw7738",
      "author": "firebuttman",
      "body": "Retail stores are the source of much of the SIM-swap fraud. There's a huge turnover because once they get caught they are fired. Does not matter if an account is password protected. Managers are in on the fraud or the bad guys find the manager's creds and get access. Another way is social engineering the customer care reps.",
      "score": 2,
      "created_utc": 1732001464.0,
      "replies": []
    },
    {
      "id": "lxx5jdy",
      "author": "minarima",
      "body": "Anyone else seen that video of two porch pirates going after the same phone immediately after it’s left by the delivery driver?",
      "score": 2,
      "created_utc": 1732021565.0,
      "replies": []
    },
    {
      "id": "lxy7udm",
      "author": "candykhan",
      "body": "This has been happening with Google Fi devices for years. Empty delivery boxes, \"lost\" replacements, etc. \n\nThe carrier will turn their hold into a charge because they didn't get the phone back. It's up to the consumer to notice & harangue them to reverse the charge. \n\nIt happened to me. No idea why it took 2.5 months for the charge to reverse. Google never disagreed that it was FedEx's fault & I should not have been charged. They even said a refund was totally justified. They just wouldn't do it. \n\nOh sorry, they said: \"Only the billing department can refund a charge, but we cannot transfer you to billing. No, the billing department does not have a direct number.\" \n\nMind boggling how this kind of BS is allowed. A carrier's billing department has no direct phone line or way to transfer? Do they communicate by notes passed under doors? Clearly that's a lie, but why bother lying? The cost of paying someone to agree with me on all those calls would have paid for multiple phones in labor hours.",
      "score": 2,
      "created_utc": 1732034449.0,
      "replies": []
    },
    {
      "id": "lxrzwm6",
      "author": "lupin_bebop",
      "body": "It’s definitely some disgruntled former employee(s), current employee who has been corrupted (or planted). AT&T has pissed off and laid off a LOT of people to line their executives’ pockets. They also have lax cybersecurity practices/standards. “Rogue AT&T employees”? Nah. It’s “currently employed AT&T associates.” This is internal, and I think AT&T knows it, they just can’t admit it, because then they are the problem. \n\nThis is yet another reason to get you iPhone via Apple (who forces you to sign for it, and only uses carrier data for activation) rather than your carrier. That’s me, though. I’ve always bought my iPhones via Apple, because I don’t have to deal with carrier BS that way, for one, and I get what I want from the source. I do understand that I’m lucky to live within 20 minutes of a few Apple stores, so that is convenient and lucky.",
      "score": 6,
      "created_utc": 1731947667.0,
      "replies": [
        {
          "id": "lxt7p2r",
          "author": "Beneficial_Company51",
          "body": "Where do you even get “They also have lax cybersecurity practices/standards.” From?",
          "score": 3,
          "created_utc": 1731960895.0,
          "replies": [
            {
              "id": "lxv1ghg",
              "author": "lupin_bebop",
              "body": "My dad. Who worked for MaBell and AT&T. Helped build the 911 backbone for their cellular network. Also helped build their IT and internal network backbones. I believe him when he says something like that. He doesn’t do so out-of-pocket.",
              "score": 0,
              "created_utc": 1731982558.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxsa6ho",
          "author": "nearcatch",
          "body": "Sometimes you don’t get a choice. I took advantage of an upgrade program AT&T had that let me trade in three iPhone 13 Pros for three iPhone 16 Pros for zero cost. Had to receive them however AT&T sent it. One phone was sent using UPS, one using FedEx, one using USPS. AT&T didn’t require signatures for anything. FedEx one got stolen.",
          "score": 3,
          "created_utc": 1731950787.0,
          "replies": [
            {
              "id": "lxsl5tm",
              "author": "lupin_bebop",
              "body": "I am aware of that program. They will usually let you do it at an Apple Store, too. (I used to work at Apple, so I’m aware of what can be done in store.) It’s not always true, but usually, they can usually match carrier deals.\n\nI also mentioned that I understood that I’m lucky to be near Apple Stores. Im aware not everyone has that convenience. The website still exists, though. *shrug* Again, I’m just lucky with proximity.",
              "score": 1,
              "created_utc": 1731954089.0,
              "replies": [
                {
                  "id": "lxu9uwv",
                  "author": "nearcatch",
                  "body": "I didn’t know Apple would price match carrier deals. Probably would’ve done that.",
                  "score": 3,
                  "created_utc": 1731972948.0,
                  "replies": [
                    {
                      "id": "lxv9cbz",
                      "author": "None",
                      "body": "I stopped buying iPhones directly from AT&T years ago, simply after dealing with one AT&T rep that was so infuriatingly dumb and high pressure. I trade in with Apple online with Apple online or at an Apple Store. So much easier.",
                      "score": 2,
                      "created_utc": 1731985388.0,
                      "replies": []
                    },
                    {
                      "id": "ly0wvwb",
                      "author": "lupin_bebop",
                      "body": "Yep. You can always check. Apple can’t do *every* promo, but most carrier promos, they do. Give it a shot.",
                      "score": 1,
                      "created_utc": 1732064662.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lxsj3pz",
      "author": "hawksdiesel",
      "body": "Deliver it to someone or noone at all. Lock box or a person. Leaving it on a porch is dumb. People steal.",
      "score": 4,
      "created_utc": 1731953468.0,
      "replies": [
        {
          "id": "lxuzld6",
          "author": "WeeklyBanEvasion",
          "body": "Imagine taking a day off work just to get your iPhone in the mail",
          "score": 2,
          "created_utc": 1731981890.0,
          "replies": []
        },
        {
          "id": "lxskby1",
          "author": "Smartnership",
          "body": "> noone\n\nIs the ‘e’ silent?",
          "score": 1,
          "created_utc": 1731953839.0,
          "replies": [
            {
              "id": "lxskz6p",
              "author": "hawksdiesel",
              "body": "what do you think?",
              "score": -5,
              "created_utc": 1731954034.0,
              "replies": [
                {
                  "id": "lxslnb6",
                  "author": "Smartnership",
                  "body": "Noon or Noonie?",
                  "score": 1,
                  "created_utc": 1731954235.0,
                  "replies": [
                    {
                      "id": "lxsn3d1",
                      "author": "hawksdiesel",
                      "body": "whos?",
                      "score": -2,
                      "created_utc": 1731954668.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lxu5gh8",
      "author": "Hottentott14",
      "body": "Can someone explain to me - an ignorant European - why porch deliveries of packages are seemingly so extremely ubiquitous in the US despite all I've heard about it for the last ten years being rampant porch piracy? I'm lucky enough to live in a country there this seemingly isn't that big of a problem, though there's been an increase the last few years. And thus fewer people are using that delivery method, as there are 15 other options without that risk. Why hasn't the US simply moved away from unguarded deliveries? Whenever I hear about it, it's presented as a law of nature with absolutely no solution. And that's just not the case.",
      "score": 2,
      "created_utc": 1731971418.0,
      "replies": [
        {
          "id": "lxv1tbs",
          "author": "Swastik496",
          "body": "because it’s not the customer’s problem.\n\ncredit card consumer protections are very strong and amex will be happy to make sure It’s the merchant’s problem",
          "score": 3,
          "created_utc": 1731982684.0,
          "replies": []
        },
        {
          "id": "lxum2p8",
          "author": "Straight-Ad6926",
          "body": "Porch deliveries are very common in the U.S. and there are a few reasons for this. One major factor is convenience. Many people prefer having packages delivered directly to their homes rather than having to pick them up from a central location or locker. The sheer size and population density of the U.S. make centralized delivery points less practical in many areas. While porch piracy is a known issue, there are several measures being taken to combat it. Some people use security cameras or video doorbells to monitor their porches. Others have packages delivered to secure lockers or use services that allow deliveries to be made inside their homes or garages. Some delivery companies are offering more flexible delivery options to minimize the risk of theft. It’s not that there’s no solution but it’s a balance between convenience and security and different people and areas are adopting various strategies to address the problem.",
          "score": 1,
          "created_utc": 1731977197.0,
          "replies": []
        },
        {
          "id": "lxvaru3",
          "author": "incubusfox",
          "body": "Another reason is just how *many* packages are delivered each day.\n\nMy UPS hub had 57k volume on Friday across 4 delivery centers and it's only a medium sized hub covering the northern section of a major city ranking the top 30 by population, there's a center covering the downtown area and another center on the other side of the city covering the southern expanse of this area.\n\nAll told it's about 180 drivers in my building I believe, each driving anywhere from 100-250 stops though a good amount of those are to businesses.\n\nTo do what you're suggesting would truly be a paradigm shift. And to be honest, you're hearing a ton about porch piracy but in most of the country it isn't actually a thing.",
          "score": 0,
          "created_utc": 1731985923.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxufpsf",
      "author": "top_value7293",
      "body": "I think we are all going to have to get lockboxes to have packages put in. Amazon drivers could have master keys or something. I dunno. Something needs done about these thieves.",
      "score": 2,
      "created_utc": 1731974985.0,
      "replies": [
        {
          "id": "lxv9ca8",
          "author": "PrometheusSmith",
          "body": "You have to have a TSA approved lock to secure most luggage on an airline flight. It's a secure lock with a master key, like you're suggesting.\n\nI can buy the 002 and 007 TSA keys for $9 on Covert Instruments. The 007 is the most recent and common key pattern.",
          "score": 1,
          "created_utc": 1731985387.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxscyu5",
      "author": "Figsnbacon",
      "body": "I recently had 4 new iPhones delivered from ATT but I chose to have them delivered to a UPS store because for whatever reason, UPS always delivers my items to the next door neighbor, even though both of us have huge address numbers in the front of our yards as well as on the house itself. So happy I paid the 6 bucks to do this one.",
      "score": 1,
      "created_utc": 1731951624.0,
      "replies": []
    },
    {
      "id": "lxsoytc",
      "author": "Better-Challenge-503",
      "body": "I myself when ordering something expensive i us my work address.",
      "score": 1,
      "created_utc": 1731955234.0,
      "replies": []
    },
    {
      "id": "lxt2z0a",
      "author": "ThannBanis",
      "body": "This is why I get them delivered to my office.",
      "score": 1,
      "created_utc": 1731959448.0,
      "replies": []
    },
    {
      "id": "lxufvyt",
      "author": "None",
      "body": "Sounds like an inside job.",
      "score": 1,
      "created_utc": 1731975043.0,
      "replies": []
    },
    {
      "id": "lxvynzl",
      "author": "mgonzales3",
      "body": "Just add Google analytics to see who is tracking the shipment.",
      "score": 1,
      "created_utc": 1731996462.0,
      "replies": []
    },
    {
      "id": "lxw34bb",
      "author": "Xenophonii10",
      "body": "Smart.",
      "score": 1,
      "created_utc": 1731998990.0,
      "replies": []
    },
    {
      "id": "lxw39e3",
      "author": "None",
      "body": "This whole “leaving packages on the porch” is wild to see. Can’t y’all just pick them up at the pick up point?",
      "score": 1,
      "created_utc": 1731999074.0,
      "replies": [
        {
          "id": "lzyyk25",
          "author": "CormoranNeoTropical",
          "body": "There is no pick-up point.",
          "score": 1,
          "created_utc": 1733104709.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxxhm7p",
      "author": "Hakaisha89",
      "body": "I still dont understand why there are no post offices to avoid this.",
      "score": 1,
      "created_utc": 1732026123.0,
      "replies": []
    },
    {
      "id": "lxyv1lf",
      "author": "None",
      "body": "If all those items are being tracked by the same person internally, it won’t be long until AT&T finds out who is providing the info.",
      "score": 1,
      "created_utc": 1732041278.0,
      "replies": []
    },
    {
      "id": "lxzplve",
      "author": "CaptLuker",
      "body": "Porch pirates are slacking. Every iPhone that hits the Memphis FedEx facility is “lost” before the pirates can get it.",
      "score": 1,
      "created_utc": 1732050479.0,
      "replies": []
    },
    {
      "id": "lxzq6ph",
      "author": "espressocycle",
      "body": "Freaking AT&T. They let someone get an iPhone and tablet using my identity without actually pinging my credit, then sold the debt so I only found out when they put it on my credit report.",
      "score": 1,
      "created_utc": 1732050652.0,
      "replies": []
    },
    {
      "id": "lxzwo49",
      "author": "Jake24601",
      "body": "All the good scams are always taken.",
      "score": 1,
      "created_utc": 1732052606.0,
      "replies": []
    },
    {
      "id": "lxzz66u",
      "author": "Obvious-Pianist-7767",
      "body": "What are porch pirates?  That sounds racist but I’m not sure why",
      "score": 1,
      "created_utc": 1732053361.0,
      "replies": [
        {
          "id": "ly1t5pi",
          "author": "CdnBison",
          "body": "When a package is delivered by Amazon UPS etc, they usually just leave it on the porch. Porch pirates come along and swipe the package before the owner can take it inside.",
          "score": 2,
          "created_utc": 1732076620.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ly646ig",
      "author": "Camera_dude",
      "body": "When I bought an expensive monitor, I used a delivery option to have it delivered to a local store then picked it up there.\n\nMy neighborhood is quiet and low crime, but there’s zero protection against a porch pirate and lots of random contractors driving around and people walking by.  The monitor was big enough that I knew it would be shipped in its own box rather than a plain brown box.\n\nIt’s always a good idea to think about the delivery if it is a high value item.",
      "score": 1,
      "created_utc": 1732147298.0,
      "replies": []
    },
    {
      "id": "lzhh5cq",
      "author": "RealPersonResponds",
      "body": "They follow UPS and FedEx trucks and grab the packages after delivery.",
      "score": 1,
      "created_utc": 1732838231.0,
      "replies": []
    },
    {
      "id": "lxu5ftz",
      "author": "user11711",
      "body": "Had this happen to me. They took the phone within minutes of it delivering.",
      "score": 1,
      "created_utc": 1731971412.0,
      "replies": []
    },
    {
      "id": "lxvemcf",
      "author": "silent_fungus",
      "body": "I’ve never understood how people don’t go to an authorized dealer when making such a high priced purchase.",
      "score": 1,
      "created_utc": 1731987394.0,
      "replies": [
        {
          "id": "lzyyld8",
          "author": "CormoranNeoTropical",
          "body": "Where would that be?",
          "score": 1,
          "created_utc": 1733104722.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxswv4j",
      "author": "NookEBetts",
      "body": "People who do this kind of stuff are beyond stupid, yeah you were smart enough to figure out how to track iPhones from AT&T and steal them from peoples porches, but apparently you aren’t smart enough to know that the iPhone is already linked to the person’s icloud account that bought it, and can be tracked to your home.\n\nThis is one of the many reasons I own an iPhone because they’re practically theft proof\n\nEdit : 20 bucks says the person was generation z",
      "score": -4,
      "created_utc": 1731957601.0,
      "replies": [
        {
          "id": "lxsxskp",
          "author": "Drtysouth205",
          "body": "The phone isn’t linked to any iCloud account until it’s signed in on the first time, however Apple knows the imei and can just blacklist the phone making it useless.",
          "score": 5,
          "created_utc": 1731957880.0,
          "replies": []
        },
        {
          "id": "lxxncbx",
          "author": "pirate742",
          "body": "20$ says you're gen z",
          "score": 0,
          "created_utc": 1732028084.0,
          "replies": [
            {
              "id": "lxxqf2a",
              "author": "NookEBetts",
              "body": "I’ll be 40 in February…",
              "score": 1,
              "created_utc": 1732029088.0,
              "replies": [
                {
                  "id": "lxxryyc",
                  "author": "Datguyovahday",
                  "body": "Well, so you’re a boomer who just gave away a good bit of your birthday on the Internet",
                  "score": -1,
                  "created_utc": 1732029585.0,
                  "replies": [
                    {
                      "id": "lxytu3z",
                      "author": "NookEBetts",
                      "body": "Millenial*",
                      "score": 0,
                      "created_utc": 1732040921.0,
                      "replies": [
                        {
                          "id": "lxyzoru",
                          "author": "Datguyovahday",
                          "body": "It’s a mindset. I’m a millennial too",
                          "score": 2,
                          "created_utc": 1732042633.0,
                          "replies": [
                            {
                              "id": "lxz0xrb",
                              "author": "NookEBetts",
                              "body": "No, not at all, i’m very much technologically inclined. I literally moonlight as an IT tech. 😅\n\nMaybe it’s different for AT&T but every time I order a new Apple product through Verizon wireless it’s automatically set up and linked through my iCloud account so when I turn on the phone all I really have to do is activate the line, everything else is already there, Its also traceable during delivery . And being aware and weary  of porch Pirates , I never miss a package delivery. But again, that’s just me",
                              "score": 1,
                              "created_utc": 1732043005.0,
                              "replies": [
                                {
                                  "id": "lxz82ba",
                                  "author": "Datguyovahday",
                                  "body": "And I’m saying as someone who had att phone stolen by porch pirates five minutes after it was delivered, you can’t trace it until you activate it you big silly billy.",
                                  "score": 1,
                                  "created_utc": 1732045197.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lxuv491",
      "author": "raiderMoes",
      "body": "Damn. That is a little bit clever.",
      "score": 0,
      "created_utc": 1731980341.0,
      "replies": []
    },
    {
      "id": "lxwv3ip",
      "author": "rupauls_tuck",
      "body": "This is another example of one of America's systems clearly being extremely flawed, but nothing will change because it's 'how it is in america' and they can't imagine doing it differently.",
      "score": 0,
      "created_utc": 1732016734.0,
      "replies": []
    },
    {
      "id": "lxxiqdg",
      "author": "None",
      "body": "Porch pirate sound like a slur",
      "score": 0,
      "created_utc": 1732026518.0,
      "replies": [
        {
          "id": "lzyyh2m",
          "author": "CormoranNeoTropical",
          "body": "???",
          "score": 1,
          "created_utc": 1733104681.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxsqnfm",
      "author": "throwaguey_",
      "body": "This is why I always get mine delivered by their service that also sets it up for you.",
      "score": -1,
      "created_utc": 1731955741.0,
      "replies": []
    },
    {
      "id": "lxrs8z1",
      "author": "lordraiden007",
      "body": "If you’re ordering an item that you can’t afford losing, and you aren’t requiring a signature, picking it up from a safe location, or having it delivered to a private mailbox directly, I kind of don’t have a ton of sympathy for you. The only things you should be fine with being dropped unceremoniously on your front porch are things you’re fine with possibly losing.",
      "score": -19,
      "created_utc": 1731945254.0,
      "replies": [
        {
          "id": "lxrwvvm",
          "author": "None",
          "body": "Up to the company shipping it to add signature. Verizon always does.",
          "score": 5,
          "created_utc": 1731946726.0,
          "replies": []
        },
        {
          "id": "lxrx36s",
          "author": "trainbrain27",
          "body": "That's certainly a take.\n\nOn the other hand, if I pay for an item, it must be delivered successfully or refunded.",
          "score": 6,
          "created_utc": 1731946791.0,
          "replies": [
            {
              "id": "lxrxgnh",
              "author": "lordraiden007",
              "body": "But it is being delivered successfully, to your porch, which is what you agreed to. It’s always an option to just go buy it in a store or report a private mailbox as your address.",
              "score": -11,
              "created_utc": 1731946907.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}