{
  "post": {
    "title": "Take-Two chairman and CEO Strauss Zelnick has said that he’s “not worried” about the potential performance issues related to Grand Theft Auto 6 on Xbox Series S.",
    "author": "a_Ninja_b0y",
    "id": "1gml1bs",
    "score": 109,
    "created_utc": 1731079435.0,
    "selftext": "",
    "num_comments": 32,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gml1bs/taketwo_chairman_and_ceo_strauss_zelnick_has_said/"
  },
  "comments": [
    {
      "id": "lw3hw4e",
      "author": "MaryUwUJane",
      "body": "the devs released gta 5 on ps3 why should they worry lol",
      "score": 73,
      "created_utc": 1731081596.0,
      "replies": [
        {
          "id": "lw7s8yx",
          "author": "None",
          "body": "[deleted]",
          "score": -14,
          "created_utc": 1731135963.0,
          "replies": [
            {
              "id": "lw938hc",
              "author": "ArsonHoliday",
              "body": "It very much was not. Unless you are specifically talking about GTO.",
              "score": 4,
              "created_utc": 1731162393.0,
              "replies": [
                {
                  "id": "lwaf7u7",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -2,
                  "created_utc": 1731178253.0,
                  "replies": [
                    {
                      "id": "lwakx5t",
                      "author": "None",
                      "body": "Played at launch and absolutely not true.\n\nThe only \"last gen\" thing about GTA V on the 360 was that it came on three discs.",
                      "score": 1,
                      "created_utc": 1731180095.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lw4ukzq",
      "author": "shalol",
      "body": "GTA V originally came out on the Xbox 360 and PS3. A 1060 Could run GTA V on Ultra settings 60 FPS.\n\nBack when AAA graphics were half decently optimized",
      "score": 49,
      "created_utc": 1731095860.0,
      "replies": [
        {
          "id": "lw7sr80",
          "author": "wondermorty",
          "body": "you didn’t play gta 4 lol, 360/ps3 was the worst generation",
          "score": 7,
          "created_utc": 1731136278.0,
          "replies": [
            {
              "id": "lw8ouhy",
              "author": "FreezenXl",
              "body": "Gta 4 sucked on PC. You needed to have AT LEAST core2quad cpus to run it without it dropping to 20 fps.",
              "score": 9,
              "created_utc": 1731156361.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lw4wxgo",
      "author": "None",
      "body": "Rockstar is generally pretty good at optimization, hopefully that’s still the case. I’ve got an X, so S performance doesn’t matter much to me either way.",
      "score": 17,
      "created_utc": 1731096577.0,
      "replies": []
    },
    {
      "id": "lw3ouaa",
      "author": "augustocdias",
      "body": "Let’s wait until someone more hands on talks about it. Management talking about stuff they have no idea is not news",
      "score": 29,
      "created_utc": 1731083625.0,
      "replies": [
        {
          "id": "lw5ia3r",
          "author": "brokenmessiah",
          "body": "People are so quick to forget the \"Cyberpunk runs suprisingly good\" talk",
          "score": 7,
          "created_utc": 1731103136.0,
          "replies": [
            {
              "id": "lw6v1zf",
              "author": "orangpelupa",
              "body": "It does run surprisingly good tho, once the context of the development rush was published. ",
              "score": 3,
              "created_utc": 1731120187.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw6bhkm",
          "author": "Smiley_Dub",
          "body": "💯 all I can say is at the time I was not worried because we had processes and tracking on schedule *HOWEVER* events....blah blah blah",
          "score": 1,
          "created_utc": 1731113050.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw3cn00",
      "author": "resil_update_bad",
      "body": "But I thought the series s was the scapegoat for everything????",
      "score": 16,
      "created_utc": 1731080051.0,
      "replies": [
        {
          "id": "lw3exdz",
          "author": "NuPNua",
          "body": "Only because people who spent 500 quid on a console or 700+ on a graphics card are insecure about their purchase when the same games run on a 250 machine, so create a narrative that if it wasn't for that pesky Series X holding gaming back, they'd be getting cutting edge experiences that transcend what we thought games could be. When the truth is we'd be getting largely the same stuff with one less SKU.",
          "score": -23,
          "created_utc": 1731080730.0,
          "replies": [
            {
              "id": "lw44tr6",
              "author": "None",
              "body": "TBH the S is great for people who mainly play indie games and don't care about high resolutions (like me), I LOVE small form factor tech, I would definitely buy one if I didn't already have a Nintendo console.",
              "score": 13,
              "created_utc": 1731088250.0,
              "replies": []
            },
            {
              "id": "lw3xwd6",
              "author": "TheOneWhoDings",
              "body": "Developers have delayed games because they had to scale back for the series s. Stfu.",
              "score": -19,
              "created_utc": 1731086241.0,
              "replies": [
                {
                  "id": "lw4szof",
                  "author": "Ceftiofur",
                  "body": "When will GTA VI be launched on PC?",
                  "score": 14,
                  "created_utc": 1731095384.0,
                  "replies": [
                    {
                      "id": "lwbc4b5",
                      "author": "Bootychomper23",
                      "body": "After consoles have sold billions and we bend over and let them fuck us and double dip. Rockstar has our number.",
                      "score": 1,
                      "created_utc": 1731188992.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lw3edp5",
      "author": "wicktus",
      "body": "I am on PS5 but frankly in this economy (and outlook..) a 250-300$ console with a gamepass subscription makes 1080/1440p modern gaming accessible to many potential people, especially people who just want to chill on FIFA, EA sports college football etc\n\nI just wish they'd added 2 more GB of gaming-dedicated RAM because my limited understanding is that it was the root cause of some issues for Baldur's Gate 3 and things like that\n\n  \nIf T2 says the game is set for 2025 and no problem for the serie S, it's good, I hope they'll keep saying it next year \\^\\^",
      "score": 11,
      "created_utc": 1731080568.0,
      "replies": [
        {
          "id": "lw5ins0",
          "author": "brokenmessiah",
          "body": "This economy is probably the reason why subscriptions left and right are nose diving. People are looking at their bank statements and trimming the fat and paying 20$ a month for Game Pass is absolutely not making the cut for people, same with PS Plus and Netflix.",
          "score": 4,
          "created_utc": 1731103256.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw5hsho",
      "author": "brokenmessiah",
      "body": "Even if he had a reason to be concerned, he’d never admit it—doing so would only draw unnecessary attention and spark the wrong kind of debate around the game.\n\n\n\nI know Series S defenders may not want to hear this, but I’ll say it anyway: if you own a Series S, you shouldn’t even be questioning how games will perform on it. The Series S simply isn’t meant for those focused on high performance.",
      "score": 5,
      "created_utc": 1731102982.0,
      "replies": [
        {
          "id": "lw6qfqc",
          "author": "andDevW",
          "body": "If you start thinking down that road you'll end up spending more money and buying a PS. Xbox isn't for users who want the best of anything **it's the least expensive console**.",
          "score": 0,
          "created_utc": 1731118438.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw6dhls",
      "author": "spinabullet",
      "body": "Lmao CEO. Sit down and let your engineers tell us, then we'd believe it.",
      "score": 2,
      "created_utc": 1731113753.0,
      "replies": []
    },
    {
      "id": "lw60him",
      "author": "Marcysdad",
      "body": "He's not. Series S players on the other hand? We'll have to see",
      "score": 1,
      "created_utc": 1731109185.0,
      "replies": []
    },
    {
      "id": "lw8d8ti",
      "author": "prateeksaraswat",
      "body": "What is production but another qa environment.",
      "score": 1,
      "created_utc": 1731149788.0,
      "replies": []
    },
    {
      "id": "lw5dhaj",
      "author": "Blackpapalink",
      "body": "I am, since Dan Houser stepped down after RDR2 released.",
      "score": 1,
      "created_utc": 1731101645.0,
      "replies": []
    },
    {
      "id": "lw52oxz",
      "author": "None",
      "body": "if it'll work on the Steamdeck, it'll work on the Series S",
      "score": 1,
      "created_utc": 1731098348.0,
      "replies": []
    },
    {
      "id": "lw8exko",
      "author": "Dan-in-Va",
      "body": "For the 6 people that one one",
      "score": 1,
      "created_utc": 1731150877.0,
      "replies": [
        {
          "id": "lwrsia3",
          "author": "BrewKazma",
          "body": "Xbox series s outsells series x, by far. 75% of this gen are series s vs 25% X.",
          "score": 2,
          "created_utc": 1731429935.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw7vlqc",
      "author": "kaydeejay1995",
      "body": "I'm 99% sure it'll run just fine. Think of what a fantastic experience GTA5 was on the 360/PS3. 6 will be fine on S/X and base PS5.",
      "score": 0,
      "created_utc": 1731138075.0,
      "replies": []
    },
    {
      "id": "lw6xnkn",
      "author": "andDevW",
      "body": "**The reality is that without a PS5 exclusivity deal in place GTA6 needs to drop on both PS4 and PS5.** Fact is that Rockstar could make a game titled GTA6 and sell that game for $60 on PS2, PS3, PS4 or PS5. Until Sony kills off the PS4 there's no reason for Rockstar to voluntarily make less money when it's clear that the focus is on sales rather than delivering a standardized GTA6 experience.",
      "score": -3,
      "created_utc": 1731121176.0,
      "replies": [
        {
          "id": "lw7g018",
          "author": "ChelseaG12",
          "body": "PlayStation secured marketing exclusivity for GTA 5. Sony and R* gave GTA online players $1 million a month until the PS5 version was released. I'm sure there's something in the pipeline. PlayStation has always gotten exclusive content or timed exclusives.  They used to get CoD exclusive content. \n\nRockstar wants a streamlined experience. Having GTA 6 on old hardware wouldn't make sense. Everything they are working on wouldn't be possible on old consoles. If you look at TT's investor relations you will see that they're doing just fine. GTA is keeping them profitable. They can afford to lose money on other franchises.\n\n\nSony will definitely phase out first party titles for PS4 but third parties are still making games. The last game for PS2 was released in 2013, PES 2014. PlayStation 3 is online to this day. They have no real reason to end support for PS4. They'll still push updates and keep the store up. It has millions of active users. GTA 6 will probably be the game to make people upgrade their consoles.",
          "score": 2,
          "created_utc": 1731129140.0,
          "replies": []
        }
      ]
    }
  ]
}