{
  "post": {
    "title": "Apple, Lenovo lead losers in laptop repairability analysis",
    "author": "moeka_8962",
    "id": "1iuihb1",
    "score": 1547,
    "created_utc": 1740112224.0,
    "selftext": "",
    "num_comments": 153,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1iuihb1/apple_lenovo_lead_losers_in_laptop_repairability/"
  },
  "comments": [
    {
      "id": "mdxrjcj",
      "author": "UnnamedStaplesDrone",
      "body": "As someone who works at a repair depot i find Lenovo to be the easiest OEM to get parts for, and they're extremely easy to take apart and put back together.. at least the thinkpads. You can replace the whole bottom half of the laptop in 20 minutes which would take a good hour or so on an Apple. A lot of their units have replaceable keyboards which you can literally swap out in 2 minutes if you take your time. HP aint bad either however they have some ridiculously outdated serializating processes for their system boards etc.  \n\nDell is by far, by FAR the worst. They use an AI chatbot to screen out our warranty claims, and if you can't really get parts from them if the unit is out of warranty.  Fuck Dell",
      "score": 442,
      "created_utc": 1740113717.0,
      "replies": [
        {
          "id": "mdxx0ra",
          "author": "charlie22911",
          "body": "Toddler spilled my tea on my Lenovo Legion Pro 7i Gen 8, saved it by immediately powering it off, removing the back, and disconnecting the battery. Everything was fine after cleaning and drying the mainboard, but the keyboard was absolutely cooked. What’s sucks is the keyboard on this model is integral to the palm rest, as is the trackpad. It required purchasing the entire palm rest/keyboard/trackpad assembly for nearly $300, and complete disassembly from the bottom-up to get it done.\nNOT fun. But it’s as good as new, and it now stays in my office away from the toddler.",
          "score": 105,
          "created_utc": 1740115990.0,
          "replies": [
            {
              "id": "mdxxkdi",
              "author": "UnnamedStaplesDrone",
              "body": "Yeah a lot of their models DO have the integrated palm rest/keyboard style. 300 isnt bad though, if that were apple you'd be paying 700 at least.",
              "score": 34,
              "created_utc": 1740116229.0,
              "replies": [
                {
                  "id": "mdzwemq",
                  "author": "NoTearsOnlyLeakyEyes",
                  "body": "Just had to replace the palm rest on my Ideapad S-340-15API. Spent $50 drop shipping the plastic palm rest from China, just to realize the keyboard is heat staked to the palm rest... Had to spend another $70 for the combo. Other than that it's really easy to take apart and there are a ton of replacement components even 5 years later.\n\nHowever they fucking soldered 4gb of ram to the motherboard. At least make it fucking 8gb....So now I'm running 12gb on a 4gb and 8gb stick. It came with a slow ass hdd too, so I threw a SSD in there. I've also swapped out the screen for ~$100 because the stock one suuuuuucked. That wasn't too difficult either, but I did absolutely mangle the old screen trying to peel it off the chassis. This is a 5 year old laptop now though. I wouldn't be surprised if newer ones have more heat staked and glued in components.\n\nIf I hadn't bought it refurbished in 2020 for half price, I never would have bought it. I had to sink $200+ into it just to make it usable, and from what I hear their Ideapads haven't gotten any better.",
                  "score": 7,
                  "created_utc": 1740149855.0,
                  "replies": [
                    {
                      "id": "me1uvuo",
                      "author": "accidental-poet",
                      "body": "Buy a used budget laptop, didn't check the specs, get a used budget laptop with shit specs and you're surprised?",
                      "score": 4,
                      "created_utc": 1740169732.0,
                      "replies": []
                    },
                    {
                      "id": "me0d17x",
                      "author": "Iron627",
                      "body": "idk dude I'm using an ideapad rn and it's a pretty good experience.. tho I can't speak on the repairability, haven't done anything damaging _yet_",
                      "score": 1,
                      "created_utc": 1740154673.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "me1zmlx",
                  "author": "MinimumArmadillo2394",
                  "body": "My screen's bottom lightbar cracked and technitians claimed they had to replace the whole monitor. Bill was $850",
                  "score": 1,
                  "created_utc": 1740171213.0,
                  "replies": []
                },
                {
                  "id": "me0uz0m",
                  "author": "SamYeager1907",
                  "body": "Depends, I would have Apple replace battery when the keyboard had an issue, Apple charges $250 for the battery but replaced the entire body of the laptop which is fused with the battery. So you get a brand new bottom case, keyboard, touchpad, touchbar and battery for $250. Pretty sweet deal. \n\nApple only charges $89 for iPhone batteries too, and their batteries are amazing. I wish my Android had that, my only options are shitty third party knockoff batteries that don't last as long and I have to replace it myself or in a third party shop (tbf I have a OnePlus phone, I'm not exactly depending on their support for it).",
                  "score": 0,
                  "created_utc": 1740159647.0,
                  "replies": [
                    {
                      "id": "me10zh8",
                      "author": "UnnamedStaplesDrone",
                      "body": "For us, we are only able to get the customer the discounted top case price if the diagnostic tests tell us SPECIFICALLY that the battery is bad. We cant just willy nilly say \"battery is bad, discounted top case pls\" the Apple store most likely has a lot more leeway in this. For us, if Apple catches us doing stuff like that they will charge US for the part a few months later when they dig into our repairs.",
                      "score": 1,
                      "created_utc": 1740161304.0,
                      "replies": [
                        {
                          "id": "me11vbh",
                          "author": "SamYeager1907",
                          "body": "There are multiple ways to get around this tho. I knew an AASP that would do it and a lot more shady stuff on top than helped the customers at the cost of Apple.\n\nBut if you wanna be a straight shooter, you can do mail in repair, basically say your battery life sucks and they'll replace it with the discounted topcase. They don't seem to check much on the mail in repairs. \n\nApple store is a hit or miss depending on the manager who sets the tone, some are lenient, others strict.",
                          "score": 1,
                          "created_utc": 1740161551.0,
                          "replies": [
                            {
                              "id": "me15ymv",
                              "author": "UnnamedStaplesDrone",
                              "body": "there are ways around it of course but for us not worth the debit memos that Apple sends every month or when you get audited. 10s of thousands of dollars of fines isn't worth the trouble.",
                              "score": 1,
                              "created_utc": 1740162679.0,
                              "replies": [
                                {
                                  "id": "me1a0c6",
                                  "author": "SamYeager1907",
                                  "body": "Have they always been this strict with audits? Because 2019-2021 I used to have an AASP mass replace broken screen or very damaged Macs with new screens and bodies citing existing recalls. It was a shady setup yeah and they obvs told me not to tell anyone who was doing it for me, but it benefitted us both. \n\nThen Apple stopped the screen recall but I was still getting bodies&batteries replaced.",
                                  "score": 1,
                                  "created_utc": 1740163802.0,
                                  "replies": [
                                    {
                                      "id": "me1a89r",
                                      "author": "UnnamedStaplesDrone",
                                      "body": "tbh im not sure, i've worked here since '22. Is that AASP still in business? They might have gotten audited and their license pulled.",
                                      "score": 1,
                                      "created_utc": 1740163863.0,
                                      "replies": [
                                        {
                                          "id": "me1fcbf",
                                          "author": "SamYeager1907",
                                          "body": "Yep, they're still there. \n\nBut it does sound like maybe by '2022 it changed and auditing began to be more pervasive.",
                                          "score": 1,
                                          "created_utc": 1740165309.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mdyrjbf",
              "author": "Butgut_Maximus",
              "body": "A full sized closet fell on my open Y-50 (years ago) laptop. One corner slightly dented, just pulled it back.  \n\nThis laptop still lives.",
              "score": 5,
              "created_utc": 1740132819.0,
              "replies": []
            },
            {
              "id": "mdyztyy",
              "author": "thirstyross",
              "body": "A thinkpad would have taken that spill like a champ, just saying.  I've spilled a can of soda across my thinkpad keyboard and literally took it outside and just turned the hose on it.  Still works great.",
              "score": 3,
              "created_utc": 1740137464.0,
              "replies": [
                {
                  "id": "me2s4ph",
                  "author": "orangpelupa",
                  "body": "Some laptop have spill rrsidtsnt keyboard ",
                  "score": 1,
                  "created_utc": 1740179603.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mdzun5u",
              "author": "Mr_Horsejr",
              "body": "Lenovo keyboards used to be incredibly easy to replace or service. They changed back in what—2013 or so? And now you have to remove the entire damn system board to replace",
              "score": 1,
              "created_utc": 1740149307.0,
              "replies": [
                {
                  "id": "me0vwgy",
                  "author": "SamYeager1907",
                  "body": "A lot of laptops used to be easier to replace, but times have changed. People want thinner, lighter laptops. Also aluminum unibody construction like Apple uses has a much more premium feel than the flexing of many plastic layers. Laptops are built different now.",
                  "score": 3,
                  "created_utc": 1740159901.0,
                  "replies": [
                    {
                      "id": "me1gfwa",
                      "author": "Mr_Horsejr",
                      "body": "They are. Replete with soldered in un-swappable components.",
                      "score": 1,
                      "created_utc": 1740165620.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "me0m2e4",
              "author": "1sttimeverbaldiarrhe",
              "body": "ThinkPad's used to come with keyboard drainage holes for spills. Not sure if the newer models still have them.\n\nhttps://www.youtube.com/watch?v=d7cvi00OZDM",
              "score": 1,
              "created_utc": 1740157186.0,
              "replies": []
            },
            {
              "id": "me30vy1",
              "author": "ProfessorPetrus",
              "body": "Make sure to get your toddler a throwaway bluetooth keyboard for them so they can work with mommy and daddy.",
              "score": 1,
              "created_utc": 1740182489.0,
              "replies": []
            },
            {
              "id": "me3mn87",
              "author": "Ne3M",
              "body": "Forgot my Thinkpad outside overnight...  And it rained. I kid you not, powered it on and it worked fine.",
              "score": 1,
              "created_utc": 1740192996.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdxse7l",
          "author": "username_elephant",
          "body": "Gotta remember Lenovo makes considerably more non ThinkPads than ThinkPads though. At least, more lines. Not sure about more units but there's probably a fairly bimodal distribution.",
          "score": 62,
          "created_utc": 1740114055.0,
          "replies": [
            {
              "id": "mdxt5a6",
              "author": "UnnamedStaplesDrone",
              "body": "Yeah i understand. We get their ideapads now and then and they're quite a bit chintzier. Most of our clients are corporations so we deal with the enterprise stuff for the most part.",
              "score": 28,
              "created_utc": 1740114360.0,
              "replies": [
                {
                  "id": "mdyrlsr",
                  "author": "mark-haus",
                  "body": "I wonder if framework computers will enter enterprises more since they're very easy to replace parts for and they have a parts marketplace. I imagine they don't manufacture them at a high enough volume yet though.",
                  "score": 5,
                  "created_utc": 1740132859.0,
                  "replies": [
                    {
                      "id": "mdzbkva",
                      "author": "Throwaway-tan",
                      "body": "Repairability is more of a consumer and SME thing. For large enterprise they'll usually just have a service agreement with whoever is supplying them and that company is responsible for repair or replacements.\n\nFramework are also not a particularly established brand, a lot of businesses would be wary of entering long term agreements with any business that could shutter at a moment's notice.",
                      "score": 4,
                      "created_utc": 1740142722.0,
                      "replies": []
                    },
                    {
                      "id": "mdzle9m",
                      "author": "SnooChipmunks2079",
                      "body": "Enterprises replace when the warranty ends. They don’t care about repairs or upgrades.\n\nCurrent Thinkpads don’t even have removable batteries.",
                      "score": 5,
                      "created_utc": 1740146295.0,
                      "replies": [
                        {
                          "id": "me0knsb",
                          "author": "I_Automate",
                          "body": "My ThinkPad doesn't have a hot swappable battery but I can still change it out in less than 15 minutes. \n\nThat still counts as a win for me, compared to other units",
                          "score": 2,
                          "created_utc": 1740156799.0,
                          "replies": [
                            {
                              "id": "me3lqm1",
                              "author": "SnooChipmunks2079",
                              "body": "If I have to take out more than one screw I don’t like it.",
                              "score": 1,
                              "created_utc": 1740192668.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "me05xbb",
              "author": "fairlyoblivious",
              "body": "They make tons of lines, but they move SHIT TONS of Thinkpads to businesses. For every person out there buying a Yoga there's a company buying 60 Thinkpads during a hardware refresh.",
              "score": 6,
              "created_utc": 1740152650.0,
              "replies": []
            },
            {
              "id": "me14esr",
              "author": "None",
              "body": "it's all the same board architecture.",
              "score": 1,
              "created_utc": 1740162251.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdxzgqi",
          "author": "Ghozer",
          "body": "Except (at least in my experience) Lenovo repairs are incapable of completing them properly and actually cause more issues than you originally sent it in for... then screw you over when you complain (so you end up with an unrepaired, useless, expensive broken laptop) and say it was reported stolen so they are sending it back unrepaired....",
          "score": 11,
          "created_utc": 1740117093.0,
          "replies": [
            {
              "id": "mdy04uk",
              "author": "UnnamedStaplesDrone",
              "body": "lmao yeah their official repair depots can be awful.  we're a 3rd party authorized depot and don't really run into problems like that. the biggest issue IMO is sometimes they send techs used parts that may have been in a liquid spill situation. they clean the boards up, hopefully replace any burnt parts and send it to be reused... so you install it and it now fries a whole bunch of other components and you've made troubleshooting it now almost impossible.. and these PC OEMs only want you to replace 1 part (5 parts if you have accidental damage coverage).. you can't shotgun a bunch of parts into it (Apple will actually let you shotgun like 10 parts under warranty if you really make a case for it). and every time you perform repeat service within 30 days, it affects metrics/bonus payouts so they are financially incentivized to at least stall you for a month if you keep having repeat issues. \n\nAgain Dell is the worst, they've sent us i dont know how many liquid damaged, corroded and sticky residue having system boards expecting us to install them. we just send them back.",
              "score": 6,
              "created_utc": 1740117403.0,
              "replies": [
                {
                  "id": "mdz5uff",
                  "author": "ToMorrowsEnd",
                  "body": "Dell on location repair techs always have used parts.  Had my work laptop repaired and the dude swapped out 4 motherboards until it worked.  not a single one was sealed or even in a static bag.",
                  "score": 3,
                  "created_utc": 1740140337.0,
                  "replies": []
                },
                {
                  "id": "mdy1lr5",
                  "author": "Ghozer",
                  "body": "Yeah, I do repairs myself to an extent (Unless they are under warranty obv) and I just don't bother with Dells, I have worked in authorized service centers before too and know what you mean about that :D\n\nThe lenovo repair I was talking about wasn't one of their branded mainline stuff either (it was Medon, which they own) but it should still have been covered, but they just wiped their hands with it.... annoyingly if I hadn't sent it back, I could have probably fixed it myself - but what they sent back (and I ended up with) was in a worse condition (bigger/worse fault) than I originally sent!",
                  "score": 1,
                  "created_utc": 1740118107.0,
                  "replies": []
                },
                {
                  "id": "mdy3z0s",
                  "author": "Pantim",
                  "body": "Well great, I'm waiting for a refurb Leveno Legion to show up at my door. I was assuming that it being refurbished meant that they went over it with a fine tooth comb and made sure everything was on top shape.",
                  "score": 1,
                  "created_utc": 1740119271.0,
                  "replies": [
                    {
                      "id": "mdyzuno",
                      "author": "Isolasjon",
                      "body": "The coffee stains act like thermal pad no problem -Lenovo",
                      "score": 2,
                      "created_utc": 1740137474.0,
                      "replies": []
                    },
                    {
                      "id": "me06adi",
                      "author": "UnnamedStaplesDrone",
                      "body": "to tell you the truth i can't remember Lenovo sending me a damaged system board where it happens about 40% of the time with Dell.",
                      "score": 1,
                      "created_utc": 1740152752.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mdy43xy",
              "author": "sayko666",
              "body": "This. My daugbters ideapad ruined because of the hinges. They got hardened as time passed to the point breaking the screen from inside. I learnt that (from another brands technician) it is a known issue but since the screen is broken the first thing they said was it is broken because of user error (user hit the screen). Thats a $900 laptop and they want $400 to fix it. It has 7 months of guarantee remaing. Bought laptop 1.5 years ago, so it sucks.\n\nWe bought maybe 20-25 lenovo monitors for office. Only 1 of them was faulty and got replaced pretty soon. But never buying a lenovo laptop again.",
              "score": 3,
              "created_utc": 1740119341.0,
              "replies": [
                {
                  "id": "mdy7afz",
                  "author": "UnnamedStaplesDrone",
                  "body": "ideapads are junk, I agree with you there. the palm rest studs that the lcd assy screws into break easily.",
                  "score": 3,
                  "created_utc": 1740121005.0,
                  "replies": []
                },
                {
                  "id": "me0rrdq",
                  "author": "WeepingAgnello",
                  "body": "This bullshit right here is why I will never buy a 2 in 1 from anyone ever.",
                  "score": 2,
                  "created_utc": 1740158765.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mdxs61v",
          "author": "tifosiv122",
          "body": "Agreed, I find Lenovo very easy to repair and find parts for. Had issues with their ssds but they aren't the manufacturer of them so it's hard to blame them.",
          "score": 14,
          "created_utc": 1740113965.0,
          "replies": [
            {
              "id": "mdxsr1i",
              "author": "UnnamedStaplesDrone",
              "body": "biggest issue i find with the thinkpads are the usb-c ports crapping out and a lot of times they're not removable and are soldered on (yes i know you can resolder new ones, but we have to do stuff by Lenovo's book). \nOne, they need to recess and protect the ports a little better using the chassis of the laptop like the Dell XPS and Macbook Pros do, and two they need to make them easily removable. They do on the X1 Carbons but only the X1 Carbons and im not sure why. Apple you can just replace your I/O boards and they're only 15$ a pop, not even any serialization needed.",
              "score": 12,
              "created_utc": 1740114201.0,
              "replies": [
                {
                  "id": "mdxt7dj",
                  "author": "tifosiv122",
                  "body": "X1 carbons are the best IMO - rock solid machines. I know what you mean the XPS and MacBook Pros have the metal body.",
                  "score": 4,
                  "created_utc": 1740114383.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mdxzuwe",
          "author": "dominus_aranearum",
          "body": "I get tons of Dell laptops (mostly various Latitudes) that are out of warranty as an e-waste scrapper. I probably have 300-400 in my shop right now. How much of a market do you think there would be for parts?",
          "score": 3,
          "created_utc": 1740117273.0,
          "replies": [
            {
              "id": "mdy70id",
              "author": "UnnamedStaplesDrone",
              "body": "not much. the LCDs and system boards though are probably worth selling if theyre higher end and in good condition. check out ebay.\nwe can find used parts all day im talking OEM refurbished parts. Lenovo and HP will gladly sell you whatever, at least for a few years. Dell for whatever reason tells you to pound sand for most things.",
              "score": 2,
              "created_utc": 1740120858.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdzbkgk",
          "author": "redzaku0079",
          "body": "Dell used to have really good warranty coverage. At least for their business machines. I heard they had gone to shit but didn't believe it was this bad.",
          "score": 3,
          "created_utc": 1740142717.0,
          "replies": [
            {
              "id": "me0gwbt",
              "author": "H0vis",
              "body": "Random opinion on the Internet, I've had to deal with them a few times in the UK. They're usually prompt and pretty good. Had one where the guy asked me to install the replacement part myself, and to be fair it was a CPU fan so I let it go, another where the guy put the computer back together but it had some shit hanging out. Had to tuck it's guts back in, that wasn't great. Usually fine though.",
              "score": 2,
              "created_utc": 1740155754.0,
              "replies": [
                {
                  "id": "me0k756",
                  "author": "redzaku0079",
                  "body": "I dealt with them a lot about 15 years ago. Their business warranty was fantastic. It had to be, for the amount of machines we were returning each week. At one point, they simply started sending us new machines as we got off the phone with them. We were told to send back the faulty ASAP, but we could send them after the replacements arrived.",
                  "score": 2,
                  "created_utc": 1740156670.0,
                  "replies": [
                    {
                      "id": "me0mtcu",
                      "author": "H0vis",
                      "body": "We had a bit of that too, before I started there.\n\nBusiness 101 is that if you've got a customer ordering machines by the hundred you play the long game, you want to be the people they call when those hundreds of computers need replacing in a few years.\n\nThing with business laptops is they are fast, dirty expendables, maybe with a decent spec and features, but they're not needed to last. As long as most of them work most of the time it's not a big deal.",
                      "score": 1,
                      "created_utc": 1740157395.0,
                      "replies": [
                        {
                          "id": "me0x1lq",
                          "author": "redzaku0079",
                          "body": "My longest lasting machines are my business machines. You know which machines really suck for durability and ability to repair? Consumer models. Those are seemingly disposable computers. There are some that are better than others, sure. But when it comes to a laptop I want to use for a long time, I would much rather pickup a used business machine than a new consumer machine most of the time.",
                          "score": 2,
                          "created_utc": 1740160216.0,
                          "replies": [
                            {
                              "id": "me0zb7r",
                              "author": "H0vis",
                              "body": "I tend to agree, but I would point out that for every business computer that seems happy to live forever, there's always bunch that probably never quite worked right from day one and gave their IT teams constant trouble, or others that dumpstered themselves after two weeks and needed to be replaced, and loads that seem to have an innate sense for their warranty expiration and then start falling to bits.",
                              "score": 1,
                              "created_utc": 1740160834.0,
                              "replies": [
                                {
                                  "id": "me10y3w",
                                  "author": "redzaku0079",
                                  "body": "Very true. Dell latitude 6xx family comes to mind. There are others but man, that series left quite a negative impression.",
                                  "score": 2,
                                  "created_utc": 1740161294.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "me59e95",
              "author": "Couldabeenameeting",
              "body": "It’s not that bad, no. I’ve gotten multiple Dell laptops repaired onsite next business day in the past few months without any issue, working with US-based support. Someone is always talking about a company going to shit based on a bad experience. Support for everything tech related is worse than it used to be, but at least for desktop/server/networking OEMs it’s not that bad yet. You want real pain, try calling Microsoft (unless you’re a large company with huge yearly spend).",
              "score": 1,
              "created_utc": 1740222029.0,
              "replies": [
                {
                  "id": "me5k8px",
                  "author": "redzaku0079",
                  "body": "I've never bought ms hardware so I don't have the experience. Maybe one day I'll get around to buying a surface. The one time I've ever dealt with their support was to recover a key for Windows xp. It was easy peasy. But that was ages ago.",
                  "score": 1,
                  "created_utc": 1740227574.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "me0fbh0",
          "author": "tacmac10",
          "body": "Lenovo and Apple just didn’t pay off the reviewer like the other brands did, these articles are all paid to play just like everything else in tech “journalism”.",
          "score": 3,
          "created_utc": 1740155313.0,
          "replies": []
        },
        {
          "id": "mdyxz1v",
          "author": "FalsePhoenix",
          "body": "Dell tech direct for parts and claims is much much easier these days we have found",
          "score": 2,
          "created_utc": 1740136488.0,
          "replies": []
        },
        {
          "id": "me1i9do",
          "author": "AmazingELF74",
          "body": "My Dell is just as repair-oriented as a framework. Unfortunately it’s ten years old and the year after they started going in the other direction.",
          "score": 2,
          "created_utc": 1740166131.0,
          "replies": []
        },
        {
          "id": "mdyosch",
          "author": "UltraWafflez",
          "body": "How about asus?",
          "score": 1,
          "created_utc": 1740131185.0,
          "replies": [
            {
              "id": "mdz5ylz",
              "author": "ToMorrowsEnd",
              "body": "they fail so much they are easy to fix because you have to constantly.",
              "score": 2,
              "created_utc": 1740140388.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdz4d19",
          "author": "AdSoggy9515",
          "body": "Hell yea brother. FUCK DELL",
          "score": 1,
          "created_utc": 1740139670.0,
          "replies": []
        },
        {
          "id": "mdzfngg",
          "author": "billythygoat",
          "body": "Do you think if I work my full time job til 3 pm, someone would like to hire me part time a few times a week to do some tech repair like this in a shop?",
          "score": 1,
          "created_utc": 1740144262.0,
          "replies": []
        },
        {
          "id": "mdzg75h",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1740144465.0,
          "replies": [
            {
              "id": "me0585p",
              "author": "UnnamedStaplesDrone",
              "body": "Because they weren't cooperating with the French, by the sound of it.",
              "score": 1,
              "created_utc": 1740152451.0,
              "replies": [
                {
                  "id": "me09e0j",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1740153628.0,
                  "replies": [
                    {
                      "id": "me09hk5",
                      "author": "UnnamedStaplesDrone",
                      "body": "Read the article",
                      "score": 1,
                      "created_utc": 1740153656.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mdzk2hh",
          "author": "rtb001",
          "body": "Dells are also oddly designed too. My workplace gave me a couple of AIOs which were super slow but I had to remove the hard drive so they can dispose of the work data. Turns out they were super slow because they were essentially laptop mobo, RAM, and crappy 5400 rpm HDs stuffed into an AIO chassis, and now work much better with some additional ram and SSDs.\n\nBut anyway,  it takes me a good 20 minutes to take apart the first AIO, screws all over the chassis,  some sort of screwed on bracket inside, screws in the hard drive caddy etc. Then I started working on the second AIO, which looks almost identical to the first,  and it is COMPLETELY tool less disassembly! Pull a couple of tabs on the bottom and the whole thing just comes apart nicely. Even the HD caddy was tool less! \n\nWell why aren't ALL of their AIOs designed like this then?!?",
          "score": 1,
          "created_utc": 1740145846.0,
          "replies": []
        },
        {
          "id": "me0978n",
          "author": "DespairTraveler",
          "body": "I have Lenovo legion and assembly/disassembly of it is a breeze. They are designed to be very modular and easy to replace parts, unlike many modern notebook companies who cram things so you either can’t do it yourself or need to destroy parts of notebook to access inner workings.",
          "score": 1,
          "created_utc": 1740153574.0,
          "replies": []
        },
        {
          "id": "me0g3z6",
          "author": "cbrworm",
          "body": "This.  I'll take a Lenovo repair anyday over most others.  IMO, Lenovo's Thinkpads are the easiest to repair and to get parts for.",
          "score": 1,
          "created_utc": 1740155534.0,
          "replies": []
        },
        {
          "id": "me149z6",
          "author": "None",
          "body": "But Lenovo \"refurbished\" parts are absolutely hot dog water. \n\nI also worked in a repair facility. the failure rate for replaced parts was abysmal!",
          "score": 1,
          "created_utc": 1740162214.0,
          "replies": [
            {
              "id": "me15rnh",
              "author": "UnnamedStaplesDrone",
              "body": "havent had a big issue with lenovo parts tbh. better than buying random parts off ebay at least.",
              "score": 1,
              "created_utc": 1740162625.0,
              "replies": []
            }
          ]
        },
        {
          "id": "me21mq9",
          "author": "TeaDrinkerAddict",
          "body": "I don’t know how hard it is to repair my broken Lenovo monitor, because instead they just sent me a new one with a shipping box to put the old one in, no questions asked.",
          "score": 1,
          "created_utc": 1740171786.0,
          "replies": []
        },
        {
          "id": "me33ajr",
          "author": "wookieSLAYER1",
          "body": "How’s ASUS? I have an old ROG from 2011 that works ok but definitely way slower than when I first got it and been wondering about how it would be to work on it as a newbie",
          "score": 1,
          "created_utc": 1740183295.0,
          "replies": []
        },
        {
          "id": "me33lrw",
          "author": "50bucksback",
          "body": "This wasy first thought. ThinkPads are great\n\nIdeaPads have soldered in RAM",
          "score": 1,
          "created_utc": 1740183399.0,
          "replies": []
        },
        {
          "id": "me3y51b",
          "author": "Healthy_Jackfruit_88",
          "body": "Really depends on the product line, for instance I bought my wife a ThinkPad from on of Lenovo’s refurbished enterprise resellers and it works like a beast with some great upgrade options and only paid $250. She won’t be playing modern games on it but it works for what she needs it to do for her.\n\nBuying from resellers that have enterprise contracts is kinda the way to go because with some minor exceptions those laptops have seen light duty and are amazing for the price.",
          "score": 1,
          "created_utc": 1740197403.0,
          "replies": []
        },
        {
          "id": "meas3ja",
          "author": "xeenexus",
          "body": "Fuck that, my Dell is in warranty, and I can’t get fucking parts. Waiting 3 months so far for a new keyboard for a G16.",
          "score": 1,
          "created_utc": 1740290176.0,
          "replies": []
        },
        {
          "id": "meb9nvs",
          "author": "FriedKicker",
          "body": "It's the same for thinkbooks.",
          "score": 1,
          "created_utc": 1740299936.0,
          "replies": []
        },
        {
          "id": "mec8l12",
          "author": "SandKeeper",
          "body": "To provide another perspective on Dell:\n\nI work for my college’s IT department, managing 4,000–5,000 Dell machines across campus. While warranty claims can be tedious, finding parts outside of warranty isn’t an issue. Dell has a parts lookup tool by serial number, and we regularly source parts for 4–5 year old devices through their site or Amazon before sending requests to procurement.\n\nSo, saying you can’t get Dell parts out of warranty is just wrong. Here’s an example of an older All-in-One system with available replacement parts: [Old All In One](https://www.dell.com/support/product-details/en-us/servicetag/0-OGFnQzBLVjY2UU1MZ0taRHpJS3R3Zz090/upgrade)\n\nAlso, Dell’s driver tool is awesome and they do a much better job on bios update tools than other brands in my opinion.\n\nTL;DR:\n\nDell parts are available well beyond warranty through a third party or them—we order them all the time. Their driver tool is great, too.",
          "score": 1,
          "created_utc": 1740318415.0,
          "replies": [
            {
              "id": "medikhx",
              "author": "UnnamedStaplesDrone",
              "body": "Ok. Now try finding the parts for this https://www.dell.com/en-us/shop/pfydresults/268466?categoryId=8490\n\nOther than generic parts like SSDs and network cards you can buy anywhere (actually looks like they have the battery available there, at least!). Gets to be a pain in the ass. Whereas Lenovo they basically have everything listed on their website, in plain view easily found.  \n\nI was exaggerating a bit when I say you can't find parts, you can, we use Parts People all the time, but that just introduces more possible failure points as you get used parts that are sometimes defective.",
              "score": 1,
              "created_utc": 1740332862.0,
              "replies": [
                {
                  "id": "mefcdao",
                  "author": "SandKeeper",
                  "body": "This is a motherboard option for that particular laptop: [link](https://www.dell.com/en-us/shop/dell-motherboard-assembly-battery-reserve-coin-bios-intel-celeron-3865u/apd/9f4gd/pc-accessories?tfcid=91049735&&gacd=9684992-1102-5761040-266906002-0&dgc=ST&SA360CID=71700000117208879&gclsrc=aw.ds&gad_source=1&gbraid=0AAAAADllXQfJRaM5ff-F9VUtsGVxWR8cp&gclid=Cj0KCQiAq-u9BhCjARIsANLj-s1awjwboWy3RYR6Dh2Z7s42dKBgB8ijBfjN0Dv8vvjyZSjTH70XgRwaAtL3EALw_wcB)\n\nIf you don’t type in an exact serial number to: [dell support](https://www.dell.com/support/home/en-us?app=drivers)\n\nIt won’t show you unit specific parts. There are a lot of revisions of different models for dell so you have put the serial number in to get results.\n\nI do understand though. It’s frustrating because it isn’t simple from a user standpoint as Lenovos is for sure.\n\nI believe Dell is culling their entire current lineup in favor of 9 skus only for their laptops and 9 skus only for their desktops. This should hopefully simply their system a little.\n\nIt’s going to be Dell, Dell Pro, Dell Pro Max\n\nWith then their being an optional additional identifier with the plus and premium. Rounding it out to give 9 total.\n\nThen it’s just dependent on the year.\n\nI do agree though that I wish Dell had a better system for checking for parts. They do exist but they won’t show without a specific serial number.",
                  "score": 0,
                  "created_utc": 1740352424.0,
                  "replies": [
                    {
                      "id": "mefpsqz",
                      "author": "UnnamedStaplesDrone",
                      "body": "I input specific serial numbers on a daily basis and am given barely any options for parts. It's not a one-off. It's just Dell wanting their users to buy new systems rather than repair. A lot of our customers buy $3-4k laptops so if you can buy a new system board and install it for them for around 800 its well worth it to them. \n\nThat system board in your link isn't even the correct board for that model.",
                      "score": 0,
                      "created_utc": 1740356921.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mecf4o7",
          "author": "chan_babyy",
          "body": "Lenovo’s warrantee was great, didn’t purchase any protection but it had 2yr accidental warrantee, $600 saved, they paid shipping. easily upgradable, fuck mac",
          "score": 1,
          "created_utc": 1740320839.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdxtilq",
      "author": "haarschmuck",
      "body": "This is a pretty garbage article. \n\nThey are comparing consumer devices to business devices. In the dell category is vostro/latitude which are not consumer devices. Yet in the HP column it's consumer gaming laptops? It's widely known that Dells business line is far more repairable than their consumer line.",
      "score": 162,
      "created_utc": 1740114509.0,
      "replies": [
        {
          "id": "me0huna",
          "author": "H0vis",
          "body": "Yeah. At my work I had to turn about a couple of hundred absolutely beshitted business Dells into about a hundred Dells that could go a few more years and it wasn't that hard, and I didn't even need a soldering iron to do it.\n\nThe big point of failure for these laptops (other than the battery, which, obviously, is a battery) was the USB-C port for charging/dock connection. I'm hearing that current, or maybe upcoming Dells, are having the USB-C as a replaceable component rather than fixed to the motherboard so they'll be even better.",
          "score": 13,
          "created_utc": 1740156018.0,
          "replies": [
            {
              "id": "me1gai1",
              "author": "_still_truckin_",
              "body": "We use Dell at work specifically because they are easy to repair, and we can cannibalize them to make Frankenmachines.",
              "score": 4,
              "created_utc": 1740165577.0,
              "replies": []
            },
            {
              "id": "me3sioy",
              "author": "2_bit_tango",
              "body": "Had dell Inspiron for 10 years. Thing was a tank, loved it. Bought a new one 2 years ago and it was trash. Ended up with a replacement xps and while nice, was not worth the price tag they had on the stupid thing. Still had the trackpad issue but not nearly as often… fml. Warranty expired because they dragged their feet and made me fight them for every frickin problem. Computer the xps replaced is my worst computer ever, xps is meh. Bought my parents an Asus after being a dell fan for years. The prices on the dell business ones are priced ridiculously, but I would consider one of those.\n\nMy work ~10 years ago rolled out Lenovo yogas and one other brand, never have I dealt with so much warranty shit than with those in the first year we had those rolled out. So idk if I can bring myself to buy a Lenovo or a dell lol.",
              "score": 2,
              "created_utc": 1740195181.0,
              "replies": []
            }
          ]
        },
        {
          "id": "me1802t",
          "author": "Juswantedtono",
          "body": "Aren’t Latitudes also marketed/sold to consumers?",
          "score": 1,
          "created_utc": 1740163247.0,
          "replies": []
        },
        {
          "id": "me3klvb",
          "author": "FLATLANDRIDER",
          "body": "We have started purchasing more Dell laptops because their repair portal is extremely easy. You can just type in the parts you need and they ship it right to you. You can even get set up to perform warranty repairs yourself instead of sending them to Dell or having a tech come out. \n\nLenovo has good parts availability, but the entire warranty process is much more tedious.",
          "score": 1,
          "created_utc": 1740192254.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdyqexk",
      "author": "terminalchef",
      "body": "That’s why I bought a Framework laptop.",
      "score": 22,
      "created_utc": 1740132150.0,
      "replies": [
        {
          "id": "me1fmyf",
          "author": "bogglingsnog",
          "body": "I need more than 3 kinds of ports on each side. If I could get multi-port blocks I would totally go for it. I need double USB modules. And a full size SD reader. And where's the 3.5mm audio?",
          "score": 6,
          "created_utc": 1740165393.0,
          "replies": [
            {
              "id": "me1orxv",
              "author": "missmuffin__",
              "body": "> And where's the 3.5mm audio?\n\nThat comes out of the box already.",
              "score": 3,
              "created_utc": 1740167966.0,
              "replies": []
            },
            {
              "id": "mfbv3o0",
              "author": "Flat_reddituser",
              "body": "They sell a full sized card reader. And it's an open design thing, so you can design your own dual USB module.",
              "score": 2,
              "created_utc": 1740780232.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdzb77g",
          "author": "redzaku0079",
          "body": "Does it have trackpoint yet?",
          "score": 5,
          "created_utc": 1740142573.0,
          "replies": [
            {
              "id": "me12zp7",
              "author": "missmuffin__",
              "body": "If there was any demand for it there would be a 3rd party part.\n\nLooks like no-one wants it.",
              "score": 6,
              "created_utc": 1740161858.0,
              "replies": [
                {
                  "id": "me20v44",
                  "author": "sypwn",
                  "body": "I'd love a framework, but I can't deal with a modern buttonless trackpad. I need the precision and feedback of physical left, right, and middle click buttons. Trackpoints provide these physical buttons, and thus it's one of the main reasons I'm locked into Thinkpads these days.",
                  "score": 3,
                  "created_utc": 1740171566.0,
                  "replies": []
                },
                {
                  "id": "me1c7s8",
                  "author": "newsflashjackass",
                  "body": "I gather, then, that Framework laptops do not have trackpoint yet.",
                  "score": 1,
                  "created_utc": 1740164419.0,
                  "replies": [
                    {
                      "id": "me1fh2s",
                      "author": "blackalls",
                      "body": "Not only does it not have a trackpoint yet, but almost no one seems to care, which belies the question, why are you both so obsessed with this digitally manipulating this weird spongy nub.... oh, never mind.",
                      "score": 3,
                      "created_utc": 1740165347.0,
                      "replies": [
                        {
                          "id": "me1ixzt",
                          "author": "newsflashjackass",
                          "body": "I understand trackpoint is of the greatest importance to touch typists because it allows them to move the cursor without removing their hands from the home row.\n\nhttps://simple.wikipedia.org/wiki/Home_row",
                          "score": 1,
                          "created_utc": 1740166324.0,
                          "replies": [
                            {
                              "id": "me25h58",
                              "author": "blackalls",
                              "body": "I am a touch typist, my RSI gets inflamed if I just look at a trackpoint.",
                              "score": 2,
                              "created_utc": 1740172882.0,
                              "replies": [
                                {
                                  "id": "me2wf6l",
                                  "author": "newsflashjackass",
                                  "body": "You may need to settle for an input approach that necessitates removing your hands from the home row to move the cursor.",
                                  "score": 1,
                                  "created_utc": 1740181013.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mhfyxev",
                          "author": "Individual-Pay9662",
                          "body": "It's handy. I constantly misclick on my buttonless trackpad, and the trackpoint let's me wear gloves and use my laptop.",
                          "score": 1,
                          "created_utc": 1741809800.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mdz728t",
      "author": "Aleashed",
      "body": "I had to replace the clock battery on a Dell Inspiron R17 and I couldn’t remove the motherboard from the case after nearly taking it completely apart.\n\nI had to bend the motherboard like 30 degrees to somehow get my fingers/tools in there and knock the dead battery out and then install a new one. Thankfully it still works but who hides the battery under a corner you can’t reach without a full disassembly…",
      "score": 6,
      "created_utc": 1740140867.0,
      "replies": [
        {
          "id": "me0sprf",
          "author": "stridered",
          "body": "People who want you to charge you a brand new laptop price instead of a 50 dollar replacement part.",
          "score": 3,
          "created_utc": 1740159027.0,
          "replies": [
            {
              "id": "me0zjp0",
              "author": "Aleashed",
              "body": "Clock batteries CR32 are like $1 😤\n\nIt doesn’t help that the actual battery died years ago so it actually drains the clock battery.",
              "score": 3,
              "created_utc": 1740160900.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mdxr7dv",
      "author": "dertechie",
      "body": "Interesting that Apple is sitting very middle of the pack in the French Repair scores.  They mostly just got hammered by the disassembly score which the article weighed higher as “what customers think of when they think of repairability”.  \n\nSo they’re apparently not that bad once you get past the hermetic seals and multitude of weird screws.",
      "score": 26,
      "created_utc": 1740113585.0,
      "replies": [
        {
          "id": "me065xp",
          "author": "FacepalmFullONapalm",
          "body": "Replacing things on the whole isn’t too bad on MacBooks nowadays. Not even the battery, in opposition to 2015’s removal process (still have nightmares lol). Fans, boards, batteries, usb-c daughterboards, etc are all easy to get out with a bit of patience. You don’t have to do the weird pry dance to get the back off, assuming you have the right screw bits. \n\nIt’s moreso the serialization of components, lack of programming utilities that fix things like True Tone and sensors on replacement parts, and the fact that they solder important stuff like the internal ssd. For that reason alone, they’re on my shit list. Internal storage should always be salvageable.",
          "score": 14,
          "created_utc": 1740152717.0,
          "replies": []
        },
        {
          "id": "mdxue91",
          "author": "OrbitalHangover",
          "body": "What hermetic seal and multitude of weird screws? \n\nThey just use pentalobe screws on the outer case which any decent pc repairer should have a set. When I bought a 3rd party MBP replacement battery they even included a pentalobe screwdriver in the box.",
          "score": 21,
          "created_utc": 1740114867.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdz1zf0",
      "author": "disciples_of_Seitan",
      "body": "Apple insisting on non-expandable specs purely to fuck the customers.\n\nAs as sidenote: I replaced the top-case of my macbook pro and all in all it took me like 5 hours lol. It's truly a shitshow with all the different kinds of screws and the riveted keyboard.",
      "score": 15,
      "created_utc": 1740138546.0,
      "replies": [
        {
          "id": "me2s9mz",
          "author": "InclinationCompass",
          "body": "It’s to keep all the repair revenue in house",
          "score": 1,
          "created_utc": 1740179646.0,
          "replies": []
        },
        {
          "id": "me03eju",
          "author": "ShenAnCalhar92",
          "body": "> It’s truly a shitshow with all the different kinds of screws\n\nOh my god can you imagine a manufacturing and assembly process that uses **multiple kinds of screws**? It’s almost as if they believe that attaching different things in different circumstances justifies different methods of attachment! /s",
          "score": -5,
          "created_utc": 1740151929.0,
          "replies": [
            {
              "id": "me06dby",
              "author": "fairlyoblivious",
              "body": "Yes, they all used to be that way, but all non-Apple brands fixed it like a decade ago.",
              "score": 8,
              "created_utc": 1740152776.0,
              "replies": []
            },
            {
              "id": "me06rjt",
              "author": "HiddenoO",
              "body": "Making unique screwheads nobody has a screwdriver for doesn't magically make the screws better at holding things together.\n\nYou're either completely ignorant about what \"different kinds of screws\" actually means or you're plain astroturfing for Apple here.",
              "score": 7,
              "created_utc": 1740152889.0,
              "replies": []
            },
            {
              "id": "me04w2q",
              "author": "disciples_of_Seitan",
              "body": "Don't give me this apologia shit lol. They could definitely unify a lot of them with minimal effort - like most other laptop manufacturers have done.",
              "score": 4,
              "created_utc": 1740152357.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mdyz4bb",
      "author": "ohboyohboyohboy1985",
      "body": "If it is not on ifixit dot com I'm not buying it. Typing on a Nokia phone I can repair, for example.",
      "score": 8,
      "created_utc": 1740137095.0,
      "replies": []
    },
    {
      "id": "me0bkql",
      "author": "eman717",
      "body": "Here to add my 2021 Lenovo Legion keyboard is failing and i'll be disassembling and reapplying the ptm7950 to my laptop this weekend to repair it because their official repair center wouldn't, turns out it's not under warranty according to their hardware manual. \n\nIf I gotta end up fixing it myself, why buy new? Lesson learned, thanks Lenovo!",
      "score": 2,
      "created_utc": 1740154254.0,
      "replies": []
    },
    {
      "id": "me1hldo",
      "author": "FilthyStatist1991",
      "body": "Still better than HP in my opinion.",
      "score": 2,
      "created_utc": 1740165943.0,
      "replies": []
    },
    {
      "id": "me2dd26",
      "author": "Rex_Steelfist",
      "body": "r/framework Would like a word.",
      "score": 2,
      "created_utc": 1740175121.0,
      "replies": []
    },
    {
      "id": "me5l2ae",
      "author": "CutsAPromo",
      "body": "Why would anyone buy apple in 2025 xD",
      "score": 2,
      "created_utc": 1740227938.0,
      "replies": []
    },
    {
      "id": "me60q0d",
      "author": "inwerp",
      "body": "From the component-level repair perspective, Lenovo is a piece of garbage.\n\n1. Some devices use internally programmed USB-C controllers. If you don’t have the firmware, you can’t flash a clean one to fix a very basic charging circuit repair, which is easy on most PC laptops and all Macs.\n\n2. Modern devices tend to use Lenovo ThinkEngine as an SIO chip, which means if it dies, you need to find a donor to fix it.\n\n3. **WORST shit.** They have been using low-temp solder for a few years now, with a melting point of around 138°C. It is fragile as shit—it dies if the mainboard bends (it fucking bends as you type on the keyboard or grab the laptop by a corner). This leads to all sorts of ripped BGA issues—memory, CPU, SIO, and inrush MOSFETs literally soldering themselves off the board (which has become a signature problem on certain Lenovo devices).\n\n4. **Even worse shit.** **Compound.**\n\nBecause of point 3, Lenovo decided to glue chips onto the board with an extremely hard adhesive. It’s way tougher than on iPhones, Macs, or even automotive devices. On newer devices, it hardens further when heated. This makes trivial repairs **extremely** difficult. Some adhesive variants are thermally unstable, which means: you solder a GDDR chip near the GPU, keep everything around it as cool as possible, but remember the 138°C solder? You finish the job, and now the chips around it need reballing too because the solder popped out from the compound.\n\nRemoving chips on some devices is extremely challenging. I have a **Lenovo X1 Carbon Gen 9** here, which just needs a simple SIO reballing (it only turns on if you press on the chip, which is a 100% easy fix on any device except Lenovo). Most likely, I will have to **drill it away**, since pulling it under heat would likely damage the PCB and rip off lots of pads. So instead of a 30-minute job (including disassembly), it becomes a **“hard case”** simply because of its manufacturing design.\n\nI happen to know someone who has access to Lenovo’s internal remanufacturing kitchen—Lenovo themselves **have no adhesive removal method**. If they need to remove a CPU from a board, they **CNC-drill it away**.\n\nTo sum it up—yes, Lenovo is the **shittiest brand to fix** if you do component-level repair.",
      "score": 2,
      "created_utc": 1740233851.0,
      "replies": []
    },
    {
      "id": "me8xmtu",
      "author": "concretecrown85",
      "body": "The Microsoft Surface has entered the chat",
      "score": 2,
      "created_utc": 1740265336.0,
      "replies": []
    },
    {
      "id": "mdyj2d9",
      "author": "Live_Bug_1045",
      "body": "Me who just got a Lenovo legion:\n\n![gif](giphy|32mC2kXYWCsg0)",
      "score": 2,
      "created_utc": 1740127741.0,
      "replies": [
        {
          "id": "mdyn8ji",
          "author": "SerDavos02",
          "body": "I love my legion. It has served me well for many years before I upgrade to pc!",
          "score": 4,
          "created_utc": 1740130252.0,
          "replies": [
            {
              "id": "mdynkfx",
              "author": "Live_Bug_1045",
              "body": "I hope I do the same. Except for a fan bearing going bad in the first month (warranty did it's job quite good) it was business as usual. And of course windows being windows.",
              "score": 3,
              "created_utc": 1740130453.0,
              "replies": []
            }
          ]
        },
        {
          "id": "me0c4h9",
          "author": "dimsumwitmychum",
          "body": "I find it hard to belive Lenovo would make repairability worse on its Legion line than ThinkPad, even though there is a huge delta in quality between different Lenovo lines. They know enthusiasts are buying Legions and enthusiasts love to tinker.",
          "score": 3,
          "created_utc": 1740154412.0,
          "replies": []
        },
        {
          "id": "mezgyem",
          "author": "whatisthisicantodd",
          "body": "Legions are pretty easy to repair, IMO. Spilled my tea on my laptop the other day and my trackpad started glitching out. It took me like 20 mins to tear everything down, clean it up, and put it back together.",
          "score": 3,
          "created_utc": 1740615634.0,
          "replies": []
        },
        {
          "id": "me1uedw",
          "author": "accidental-poet",
          "body": "The article is bullshit. I own an IT company which supports businesses. We provide all our clients with Lenovo ThinkPads. I have several of my own and a Legion as well.  \n\nThinkPads are a breeze to repair. Like two whole screws must be removed to replace the keyboard on a T16 simple.  \n\nLegions are more complex because well, they're more complex, but not incredibly so.  \n\nIt's all publicly available with a simple search:\n\nhttps://support.lenovo.com/us/en/solutions/ht516547-self-repair-guides-landing-page",
          "score": 2,
          "created_utc": 1740169586.0,
          "replies": []
        }
      ]
    },
    {
      "id": "me01v9z",
      "author": "UntitledTrack4",
      "body": "im convinced that apple pays their egineers more if they can make things less repairable.",
      "score": 1,
      "created_utc": 1740151483.0,
      "replies": [
        {
          "id": "me04ru9",
          "author": "ShenAnCalhar92",
          "body": "In the sense that they’d reward an engineer for a design that uses less total space, which would naturally tend to make things less accessible? Sure.\n\nPacking things into a smaller space makes it harder to disassemble, repair, and upgrade. Consumers have historically prioritized smaller form factor over repairability, so why would a company do the exact opposite of what consumers want?",
          "score": 7,
          "created_utc": 1740152324.0,
          "replies": [
            {
              "id": "me1lh20",
              "author": "mailslot",
              "body": "Because Redditors want to cosplay as electronics repairmen using only a Phillips head screwdriver.",
              "score": 3,
              "created_utc": 1740167037.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mdxzij0",
      "author": "Shadowhawk109",
      "body": "Apple has *never* cared about laptop repairability.\n\nThis is combined fantastically with the lack of upgradable parts, and charging double the price for half the amount of RAM / SSD storage.",
      "score": 6,
      "created_utc": 1740117115.0,
      "replies": [
        {
          "id": "me0kg32",
          "author": "ChiefStrongbones",
          "body": "> double the price for half the amount of RAM / SSD storage.\n\nThat's a lie.  It's closer to 4x the price for a quarter the RAM/storage.  Apple charges [$400 for 16GB](https://www.apple.com/shop/buy-mac/mac-mini/apple-m4-chip-with-10-core-cpu-and-10-core-gpu-16gb-memory-256gb) of memory which is worth $25.",
          "score": 2,
          "created_utc": 1740156739.0,
          "replies": []
        },
        {
          "id": "me04241",
          "author": "ShenAnCalhar92",
          "body": "**Laptop manufacturers** have never cared about laptop repairability, or upgradeability.\n\nThat’s because **consumers** have, on the whole, cared less about repairability or upgradeability compared to other things like size, form, price, etc",
          "score": 4,
          "created_utc": 1740152119.0,
          "replies": []
        },
        {
          "id": "mdycvkx",
          "author": "ThatGuyTheyCallAlex",
          "body": "Notebooks have never been that repairable, especially not SOCs. They’re too small to *not* be SOCs, which comes with the benefit of enhanced performance especially in Apple’s case.",
          "score": 3,
          "created_utc": 1740124108.0,
          "replies": []
        },
        {
          "id": "mdyakmm",
          "author": "SolidOshawott",
          "body": "Never say never, MacBooks pre 2013 were pretty modular and repairable.\n\nTo be frank, I don't mind the non-repairability so much as long as the laptop is good and reliable, which modern MacBooks are. (Yes the RAM is overpriced, just buy twice as much as you think you need and forget about it for a decade)",
          "score": 0,
          "created_utc": 1740122805.0,
          "replies": [
            {
              "id": "mdyxyod",
              "author": "supermitsuba",
              "body": "I just upgraded a MacBook Air from 2013.  I replaced the battery, ssd and cleaned up the thermal paste.  Outside of the ram, that's all you can ask for.  \n\nSSD interface needing an adapter wasn't great however.",
              "score": 2,
              "created_utc": 1740136482.0,
              "replies": []
            }
          ]
        },
        {
          "id": "me07089",
          "author": "FacepalmFullONapalm",
          "body": "I seem to recall one of their PowerBooks, or iBook?, was marketed as a very repairable laptop in comparison to others at the time, but they immediately followed it up with another model that began a downward trend of a metric shitton of screws and bleeding fingers.",
          "score": 1,
          "created_utc": 1740152958.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdz6k3w",
      "author": "shakergeek",
      "body": "In other news… water is wet.",
      "score": 1,
      "created_utc": 1740140649.0,
      "replies": []
    },
    {
      "id": "me14wbc",
      "author": "x42f2039",
      "body": "As someone that repairs my own shit, I find MacBooks the easiest to do",
      "score": 1,
      "created_utc": 1740162385.0,
      "replies": []
    },
    {
      "id": "me22vin",
      "author": "bezerko888",
      "body": "Actually some hp laptop are getting more repairable than lenovo. Apple are the same old hypocrites.",
      "score": 1,
      "created_utc": 1740172140.0,
      "replies": []
    },
    {
      "id": "me2qd37",
      "author": "Hybrid_Divide",
      "body": "Framework FTW.",
      "score": 1,
      "created_utc": 1740179041.0,
      "replies": []
    },
    {
      "id": "me5l8yq",
      "author": "AccomplishedIgit",
      "body": "This title is hilarious. Knowingly leading a bunch of losers working on repairs like that, why not hire winners instead?",
      "score": 1,
      "created_utc": 1740228020.0,
      "replies": []
    },
    {
      "id": "me6ekfv",
      "author": "CrazyBrosCael",
      "body": "These companies should be massively fined for creating unrepairable/irreplaceable/quickly obsolete e-waste. \n\nYou’re telling me some of these guys are still making 2core, 4GB ram laptops running windows 11?",
      "score": 1,
      "created_utc": 1740238290.0,
      "replies": []
    },
    {
      "id": "meab6p9",
      "author": "QuantumQuantonium",
      "body": "Lenovo is the Apple of non apple laptops when it comes to universally compatible parts, aka they have unnecessary hardware locks preventing for example letting me upgrade my laptops WiFi with any WiFi card. Honestly the only other company thats more picky and paranoid towards \"\"compatibility\"\" is apple.",
      "score": 1,
      "created_utc": 1740282843.0,
      "replies": []
    },
    {
      "id": "mdzztde",
      "author": "G8M8N8",
      "body": "Framework FTW",
      "score": 1,
      "created_utc": 1740150883.0,
      "replies": []
    },
    {
      "id": "mdxrqu8",
      "author": "ManySockets",
      "body": "![gif](giphy|6nWhy3ulBL7GSCvKw6)",
      "score": 0,
      "created_utc": 1740113799.0,
      "replies": []
    },
    {
      "id": "mdxo1uw",
      "author": "None",
      "body": "[deleted]",
      "score": -9,
      "created_utc": 1740112399.0,
      "replies": [
        {
          "id": "mdxqmc5",
          "author": "albinorhino55",
          "body": "They have earned their reputation. Not sure if you even read the article, but they were ranked worst in repairability.",
          "score": 6,
          "created_utc": 1740113356.0,
          "replies": []
        },
        {
          "id": "mdxqgjq",
          "author": "cat_prophecy",
          "body": "Well we know someone didn't read the article. \n\nGranted it's a stupid ass headline. But the first sentence is literally.\n\n>Apple and Lenovo had the lowest laptop repairability scores in an analysis.\n\nSo yeah, Apple is still doing Apple shit.",
          "score": 12,
          "created_utc": 1740113293.0,
          "replies": []
        },
        {
          "id": "mdxoeu2",
          "author": "superninjax",
          "body": "Huh? ",
          "score": 5,
          "created_utc": 1740112525.0,
          "replies": []
        },
        {
          "id": "mdxrc6r",
          "author": "Mr_November112",
          "body": "Go back to school brother",
          "score": 2,
          "created_utc": 1740113638.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdz5hf1",
      "author": "ToMorrowsEnd",
      "body": "Then you have an ASUS laptop that you have to repair constantly as they just constantly break something.   Dear god for an $1800 laptop their ROG laptops are just complete trash. so they are \"repairable\" because you will have to many times during the 6 months you own it before you are tired of spending money fixing the damned thing. Lol the dumbasses that never owned one downvoting. They are crap kiddies and anyone that owns one knows this.",
      "score": -4,
      "created_utc": 1740140177.0,
      "replies": []
    }
  ]
}