{
  "post": {
    "title": "Logitech MX Master 4: First picture of new mouse leaked ahead of imminent launch",
    "author": "dapperlemon",
    "id": "1l18y3p",
    "score": 766,
    "created_utc": 1748838320.0,
    "selftext": "",
    "num_comments": 229,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1l18y3p/logitech_mx_master_4_first_picture_of_new_mouse/"
  },
  "comments": [
    {
      "id": "mvjd105",
      "author": "kushangaza",
      "body": "Ah, a reddit thread about an article about a reddit thread.\n\nAnyways, I have a MX Master 2 and 3. They are great mice. This picture looks roughly the same, not much to say about it",
      "score": 594,
      "created_utc": 1748839582.0,
      "replies": [
        {
          "id": "mvjfza3",
          "author": "Webfarer",
          "body": "Based. I think you shouldn’t become a tech journalist.",
          "score": 219,
          "created_utc": 1748841050.0,
          "replies": [
            {
              "id": "mvk8gvf",
              "author": "legohax",
              "body": "Use ChatGPT to stretch that into 2,000 words and call it a week",
              "score": 149,
              "created_utc": 1748857723.0,
              "replies": [
                {
                  "id": "mvklpdc",
                  "author": "daddylo21",
                  "body": "Add in how your family has been using Logitech MX mice since their inception and it's now become a family tradition to pass the used ones down to the younger kin on the anniversary of buying the mouse. Get into the real nitty gritty of it.",
                  "score": 29,
                  "created_utc": 1748864412.0,
                  "replies": [
                    {
                      "id": "mvl0wlj",
                      "author": "gredr",
                      "body": "Also some basic information about what a mouse is and why someone would use one. Don't name the mouse in the headline, and don't name it in the first 200 words of the article.",
                      "score": 21,
                      "created_utc": 1748870305.0,
                      "replies": [
                        {
                          "id": "mvmayll",
                          "author": "S0LO_Bot",
                          "body": "‘This new Logitech mouse is projected to shake up the industry’\n\n\nThe new mouse, unveiled in 2025, is a continuation of Logitech’s time-honored tradition…",
                          "score": 8,
                          "created_utc": 1748884058.0,
                          "replies": [
                            {
                              "id": "mvmivrp",
                              "author": "gredr",
                              "body": "I'm commenting on the way \"articles\" are put together these days to keep eyeballs on the page longer, not on this article in particular.",
                              "score": 2,
                              "created_utc": 1748886251.0,
                              "replies": [
                                {
                                  "id": "mvmrj7f",
                                  "author": "S0LO_Bot",
                                  "body": "Yeah I understand. I was trying to replicate that feel lol. These are not actual quotes.",
                                  "score": 2,
                                  "created_utc": 1748888694.0,
                                  "replies": [
                                    {
                                      "id": "mvmyoxs",
                                      "author": "gredr",
                                      "body": "Ah, right. Given my misunderstanding, you nailed it :)",
                                      "score": 1,
                                      "created_utc": 1748890747.0,
                                      "replies": [
                                        {
                                          "id": "mvuc2zj",
                                          "author": "deadregime",
                                          "body": "This interaction was beautiful.",
                                          "score": 2,
                                          "created_utc": 1748985942.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mvopjte",
                              "author": "alc4pwned",
                              "body": "You've got to phrase it as a question though. 'Will this new mouse dominate the competition??'",
                              "score": 1,
                              "created_utc": 1748910142.0,
                              "replies": [
                                {
                                  "id": "mvtm7oy",
                                  "author": "caffeinater",
                                  "body": "Yeah but is Amazon almost giving it away for free?",
                                  "score": 1,
                                  "created_utc": 1748978369.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mvm92co",
                      "author": "HideyoshiJP",
                      "body": "Add an anecdote about one child  not knowing how to double click because his broken mouse was doing that on its own.",
                      "score": 2,
                      "created_utc": 1748883524.0,
                      "replies": []
                    },
                    {
                      "id": "mvksc1c",
                      "author": "MetalBeerSolid",
                      "body": "The great heirloom ",
                      "score": 3,
                      "created_utc": 1748867161.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mvw9vv3",
                  "author": "nayophoto",
                  "body": "And insert trump and Elon in headlines on your tech blog for clicks…. Even though it has nothing to do with tech.",
                  "score": 1,
                  "created_utc": 1749010747.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mvjgdar",
          "author": "Starfox-sf",
          "body": "Mine is MX Anywhere 2. Capable of BT and Unifying, had it for nearly a decade or so.",
          "score": 20,
          "created_utc": 1748841249.0,
          "replies": [
            {
              "id": "mvjkhrd",
              "author": "Fidelius90",
              "body": "Impressive. My mx3 looks like it has leprosy.",
              "score": 22,
              "created_utc": 1748843429.0,
              "replies": [
                {
                  "id": "mvjtqtj",
                  "author": "Bloody_Sunday",
                  "body": "Exactly like my own MX3. Just about its only flaw, and occasionally a need to have a higher DPI. But otherwise perfect, imo. \n\nIts battery life, after ages off owning one, is still uncanny and unaffected. Fully ergonomic with its buttons, layout and palm curves exactly where I want them.\n\nHas also served me well for gaming too. Super comfy layout, buttons and curves. Other than a tiny latency and not super accurate DPI, I have felt no need to get any other gaming mouse (and I've tried quite a few).",
                  "score": 6,
                  "created_utc": 1748848696.0,
                  "replies": []
                },
                {
                  "id": "mvjy8ys",
                  "author": "ThatMisterOrange",
                  "body": "The oil from people's skin affects plastic in different ways.",
                  "score": 5,
                  "created_utc": 1748851434.0,
                  "replies": []
                },
                {
                  "id": "mvkg7d4",
                  "author": "fraseyboo",
                  "body": "You can get stickers for the MX3 pretty cheaply off sites like AliExpress, might be worth looking into if you want to refresh it slightly. You can also get new PTFE pads for the bottom too.\n\nWith my MX Master (gen 1) the action button was constantly pressed due to the rubber fatigue, I ended up removing the rubber around it and 3D printing a new cover.",
                  "score": 2,
                  "created_utc": 1748861859.0,
                  "replies": []
                },
                {
                  "id": "mvlfmoa",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1748875034.0,
                  "replies": [
                    {
                      "id": "mvlkina",
                      "author": "NBAccount",
                      "body": "I also have the OG master. It's still in great shape, but the left button double clicks on every press. The keyboard that came with it (mx5500) still works beautifully.",
                      "score": 1,
                      "created_utc": 1748876468.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mvkmb99",
              "author": "dingleberry-38",
              "body": "Anywheres are the best choice",
              "score": 1,
              "created_utc": 1748864679.0,
              "replies": [
                {
                  "id": "mvkmz9p",
                  "author": "Small_Editor_3693",
                  "body": "They are WAY too small imo",
                  "score": 1,
                  "created_utc": 1748864969.0,
                  "replies": [
                    {
                      "id": "mvkn4us",
                      "author": "dingleberry-38",
                      "body": "Ol big hands over here 👈",
                      "score": 3,
                      "created_utc": 1748865034.0,
                      "replies": [
                        {
                          "id": "mvknh0x",
                          "author": "Small_Editor_3693",
                          "body": "I’ve got tiny hands. Still have to grip it in a weird 3 finger grip",
                          "score": 1,
                          "created_utc": 1748865178.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mvmowje",
                  "author": "ccai",
                  "body": "The lack of a horizontal scroll wheel makes it a far lesser option for many. \n\nMy wife has no issue with her MX Anywhere 2S as she wanted a more compact mouse. It makes little to no difference to her  work flow as it primarily consists of reading/creating documents and emailing. Meanwhile, I benefit greatly from the horizontal scrolling on the daily to readily access out of view column values on spreadsheets and DB tables. Easy access of X/Y axis scrolling is just so much more efficient for my workflow.\n\nIf size and horizontal scroll wheels aren't dealbreakers, the Logitech M720 Triathlon is about half the price of the Mx Anywhere - it just isn't rechargeable via USB. A single AA battery lasts months and months even with heavy use. It works well with rechargeable NiMH batteries as well. I find the ergonomics to be better on the M720 as well when compared to the Anywhere series. As for size it sits between the MX Anywhere and the MX Master.",
                  "score": 1,
                  "created_utc": 1748887936.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mvjlj3l",
          "author": "Digital_loop",
          "body": "I still have a working mx master, thing just won't quit!",
          "score": 8,
          "created_utc": 1748843991.0,
          "replies": [
            {
              "id": "mvkez0z",
              "author": "LilMoWithTheGimpyLeg",
              "body": "Shame about the rubber surface. As someone in the original thread mentioned: it would be nice if you could replace it when it gets worn out.",
              "score": 7,
              "created_utc": 1748861260.0,
              "replies": []
            },
            {
              "id": "mvm0fms",
              "author": "stempoweredu",
              "body": "I'm on the other side.  I owned an original MX Master and an MX Master 2, and I just won't buy them anymore.\n\n* Their lifespan isn't considerably longer than other, much less expensive Logitech offerings.  (And notably, *all* mice seem to have far shorter lifespans than they used to, and I baby my mice.)\n* The feature set isn't game-changing.  I struggle to find a need for the horizontal scroll wheel on a regular basis.\n* Ergonomics - The MX Master came out at a time when most ergonomic-focused mice lacked any other premium features.  This is no longer the case, and indeed, many average mice have excellent ergonomics.\n* Resolution / Polling: I'm a CAD guy and gamer, so high DPI matters to me. The sensors in even run-of-the-mill mice have gotten to the point that they're more than fine.\n* Logitech is absurdly obstinate about taking the device-switch button off of the bottom and putting it on top of the mouse.  This is why I daily drive the MX720, so I can seamlessly switch between laptop, desktop, and more.\n* It lacks the features that matter to me - Replaceable batteries, easily removable parts for cleaning.\n\nAll in all, the MX Master became an overpriced, unnecessary spectacle.  I'm much happier with my 720.",
              "score": 2,
              "created_utc": 1748881057.0,
              "replies": [
                {
                  "id": "mvm0rha",
                  "author": "Digital_loop",
                  "body": "Horizontal scrolling is a game changer for hen working with spreadsheets",
                  "score": 1,
                  "created_utc": 1748881153.0,
                  "replies": [
                    {
                      "id": "mvm2cof",
                      "author": "stempoweredu",
                      "body": "As someone who lives a life of spreadsheets, I disagree - using a mouse *at all* while in spreadsheets is a massive slowdown.  Keyboard & shortcuts!",
                      "score": -2,
                      "created_utc": 1748881611.0,
                      "replies": [
                        {
                          "id": "mvmq0ie",
                          "author": "ccai",
                          "body": "> I disagree - using a mouse at all while in spreadsheets is a massive slowdown.\n\nThen that's irrelevant to you whether or not you have a horizontal scroll wheel. The inclusion doesn't slow you down as it's not a forced feature that disables your kb shortcuts, it's not an either or situation.\n\nNot everyone edits spreadsheets - many just use them to view data from generated reports, so KB shortcuts don't speed up workflow for everyone who works with spreadsheets. I agree with /u/Digital_loop - it's amazing to scroll in X/Y axis with ease in spreadsheets and db tables for those of us that view them more than edit or create them.",
                          "score": 2,
                          "created_utc": 1748888253.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mwh0trb",
                  "author": "emiliabow",
                  "body": "Same!  The g502x ended up way better for me.",
                  "score": 1,
                  "created_utc": 1749295023.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mvjpub7",
          "author": "vpsj",
          "body": "I have the 2 and it's slowly getting worse and worse. I also hate that I have to keep a ~~mini~~ micro usb cable just to charge it.\n\nShould I wait for the 4 or buy the 3? Or get one of those Razer mice?",
          "score": 8,
          "created_utc": 1748846430.0,
          "replies": [
            {
              "id": "mvkkvrj",
              "author": "ccai",
              "body": ">\tI have to keep a mini usb cable just to charge it.\n\nMicrousb - If you’re a bit handy and know how to solder, it’s not a super difficult process to convert it to usb-c. It’s a matter of disassembling, clipping off the port and soldering two wires, the hardest part is filing the hole larger for the new port.",
              "score": 6,
              "created_utc": 1748864050.0,
              "replies": []
            },
            {
              "id": "mvmusrl",
              "author": "995a3c3c3c3c2424",
              "body": "I upgraded to a 3 a while back to get USB C, and it was fine for a while but then the left button started double-clicking itself when I only single-clicked, which seems to be a common problem with the 3. So I switched back to the old 2 that I still had lying around…",
              "score": 3,
              "created_utc": 1748889639.0,
              "replies": []
            },
            {
              "id": "mvjrvtt",
              "author": "Trippydippy1",
              "body": "Like a comment in this thread said there's has leprosy I can say the same and seen the rubber degraded on anothers 3, there's something about it which is worse then the 2. Still very good and lasted for a few years at this point of daily use just looks ugly now.",
              "score": 2,
              "created_utc": 1748847590.0,
              "replies": []
            },
            {
              "id": "mw31b8a",
              "author": "BobRoonee",
              "body": "why would that be? literally all motherboards have USB A connections.",
              "score": 1,
              "created_utc": 1749099671.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mvkiald",
          "author": "Fredasa",
          "body": "I can save some people a click and note that it is manifestly not for left-handers.",
          "score": 5,
          "created_utc": 1748862864.0,
          "replies": [
            {
              "id": "mvl1ag7",
              "author": "gredr",
              "body": "Answering the important questions. I'll stick with the MX Anywhere, I guess.",
              "score": 2,
              "created_utc": 1748870440.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mvjt4ey",
          "author": "ctyldsley",
          "body": "Why do they always randomly get laggy using the dongle!? Doesn't matter if it's the 2 or 3 they both exhibit the behaviour on different machines. Unplug replug fixes it but then it'll do it randomly again.",
          "score": 5,
          "created_utc": 1748848318.0,
          "replies": [
            {
              "id": "mvkayn3",
              "author": "Newtronic",
              "body": "I have found it depends on the internal configuration of the USB.   Some computers share the USB port across all peripherals including the internal ones, and this can cause lags and stuttering.  Some USB’s are shared and other might not be, so try different ports.",
              "score": 5,
              "created_utc": 1748859128.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mvk3htg",
          "author": "oshinbruce",
          "body": "Its the same mouse but logitech hiked the prices due to all the tariff stuff. Yay!",
          "score": 2,
          "created_utc": 1748854701.0,
          "replies": []
        },
        {
          "id": "mw3120v",
          "author": "BobRoonee",
          "body": "same. the 3 is the best. 3S wast the worst. had to return it. the range sucked, lag and skipping all the time. going from RF Unifying receiver to bluetooth Bolt was a bad move.",
          "score": 2,
          "created_utc": 1749099543.0,
          "replies": []
        },
        {
          "id": "mvp1goo",
          "author": "NealCaffreyx9",
          "body": "I have the 3 and it’s incredible. Worth the initial pain of $100.",
          "score": 1,
          "created_utc": 1748914428.0,
          "replies": []
        },
        {
          "id": "mvqssl8",
          "author": "OfficeSalamander",
          "body": "I like the MX Anywhere which is pretty similar. Master feels a bit big to me, but otherwise definitely my favorite type of mice",
          "score": 1,
          "created_utc": 1748945365.0,
          "replies": []
        },
        {
          "id": "mwd4wnv",
          "author": "Steel_Reign",
          "body": "I'd love it if they'd stop using cheap Chinese switches. I have a 6-year old Logitech mouse that still works but all of my latest ones have succumbed to the double click issue in under a year.",
          "score": 1,
          "created_utc": 1749236017.0,
          "replies": []
        },
        {
          "id": "mvjnwn1",
          "author": "dbabon",
          "body": "I love them too I just wish they were wired 😭",
          "score": 0,
          "created_utc": 1748845322.0,
          "replies": [
            {
              "id": "mvjpbwc",
              "author": "OMGlookatthatrooster",
              "body": "Can you not use it plugged in?",
              "score": 8,
              "created_utc": 1748846134.0,
              "replies": [
                {
                  "id": "mvpkqml",
                  "author": "dbabon",
                  "body": "Plugged in just charges it. It doesn’t allow wired control.",
                  "score": 2,
                  "created_utc": 1748921735.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mvjpzvg",
              "author": "kushangaza",
              "body": "It's been a while since I tried, but if I remember correctly they do work as USB mice if you plug them in with the cable attached. No wireless connection necessary",
              "score": 6,
              "created_utc": 1748846516.0,
              "replies": [
                {
                  "id": "mvjr7vx",
                  "author": "Spyder638",
                  "body": "This is incorrect. Source: recently got locked out of my PC when my dongle stopped working (which both my keyboard and mouse make use of). Tried to go wired to at least connect via Bluetooth but nothing worked.\n\nEdit: to be clear, you can charge your mouse using a wire and still use the mouse, but the communication is still 100% wireless.",
                  "score": 3,
                  "created_utc": 1748847211.0,
                  "replies": [
                    {
                      "id": "mvkdm3y",
                      "author": "GregLittlefield",
                      "body": "That doesn't sound right. I have a 3s at work and a 2s at home and both work fine when plugged in to recharge.",
                      "score": 1,
                      "created_utc": 1748860565.0,
                      "replies": [
                        {
                          "id": "mvke8a1",
                          "author": "Spyder638",
                          "body": "Plugging them in and charging while in use is fine, but it’s still communicating with your devices wirelessly. If you turn off Bluetooth and don’t have a dongle in your devices, you will not be able to use the mouse.",
                          "score": 6,
                          "created_utc": 1748860886.0,
                          "replies": [
                            {
                              "id": "mvkevaj",
                              "author": "GregLittlefield",
                              "body": "I see. That's weird. Why did they do it like that?",
                              "score": 2,
                              "created_utc": 1748861208.0,
                              "replies": [
                                {
                                  "id": "mvkfimb",
                                  "author": "Spyder638",
                                  "body": "Who knows, but it’s really silly, especially if you want to use these via bluetooth (which is reasonable saying there are quite a lot of people, myself included, who experience some sort of lag/stutter with the unifying dongle). It means if you need to switch BT off & on, you’re gonna need another means to switch it back on.",
                                  "score": 3,
                                  "created_utc": 1748861525.0,
                                  "replies": []
                                },
                                {
                                  "id": "mvl4pbv",
                                  "author": "Ripdog",
                                  "body": "Because it would be a whole lot of duplicated circuitry, likely an extra chip, and more complexity in the firmware to handle a USB mode. Presumably they judged it wouldn't be worth the cost when very few people would use it or choose to buy the mouse due to USB mode existing.",
                                  "score": 1,
                                  "created_utc": 1748871602.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mvnwbo1",
                              "author": "grutus",
                              "body": "Same with their mx keys keyboard",
                              "score": 1,
                              "created_utc": 1748900502.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mvpknma",
                  "author": "dbabon",
                  "body": "I wish that were true. It would make so much sense.",
                  "score": 1,
                  "created_utc": 1748921699.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mvmfjj8",
              "author": "GfxJG",
              "body": "Genuine question: Why? I charge mine literally 2 hours (if even that) every other month - Is that really such a deal-breaker for you that you'd prefer the downsides to a wired mouse?",
              "score": 1,
              "created_utc": 1748885332.0,
              "replies": [
                {
                  "id": "mvpe1gq",
                  "author": "dbabon",
                  "body": "Its not charging that bothers me. I just genuinely hate bluetooth. So many factors about my environment, workspace, whichever computer I’m using, etc, make it really unreliable IMO. I’ve been in some really crucial work moments where I found my mouse just suddenly not connecting (full battery), or unable to be recognized on a new system, etc. It drives me crazy especially because I love the mouse so much otherwise.",
                  "score": 1,
                  "created_utc": 1748919049.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mvlb5qt",
          "author": "ContentSecretary8416",
          "body": "The grip will become sticky in the same amount of time as all the rest of them. \n\nThey work great. Just that grip always feels terrible",
          "score": 0,
          "created_utc": 1748873680.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mvje9i4",
      "author": "None",
      "body": "[deleted]",
      "score": 185,
      "created_utc": 1748840187.0,
      "replies": [
        {
          "id": "mvjg0o2",
          "author": "None",
          "body": "[deleted]",
          "score": 58,
          "created_utc": 1748841070.0,
          "replies": [
            {
              "id": "mvjh52f",
              "author": "CosmicCreeperz",
              "body": "They use that stupid rubberized soft touch plastic that starts seeping/separating after a while.  Mine was gross eventually as well.  It’s like planned obsolescence, so annoying when companies use it.",
              "score": 68,
              "created_utc": 1748841645.0,
              "replies": [
                {
                  "id": "mvl549v",
                  "author": "Blankcarbon",
                  "body": "It does feel really nice though- wish there was a way to have a more permanent usage of it.",
                  "score": 9,
                  "created_utc": 1748871740.0,
                  "replies": [
                    {
                      "id": "mvlqc2e",
                      "author": "CosmicCreeperz",
                      "body": "Yeah, it’s not a matter of being cheap - it is actually used in high end products.  They just don’t think about the long term durability I guess.  My 18 year old 911 radio knobs are getting sticky! I’m just using it as an excuse to get the new OEM PCM upgrade ;)",
                      "score": 7,
                      "created_utc": 1748878160.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mvkduga",
                  "author": "C-C-X-V-I",
                  "body": "Piano black has entered chat",
                  "score": 5,
                  "created_utc": 1748860685.0,
                  "replies": []
                },
                {
                  "id": "mvkex8u",
                  "author": "blackbright22",
                  "body": "Happened to my Steelseries Diablo III mouse. Had to chuck it away. Won't buy from Steelseries again because of that. \n\nAlso the Batman Arkham Batarang 360 controller I had went all sticky on the handles. Stupid plasticiser.",
                  "score": 5,
                  "created_utc": 1748861235.0,
                  "replies": [
                    {
                      "id": "mvmd0p2",
                      "author": "got-trunks",
                      "body": "I think my rival also returned to oil.",
                      "score": 2,
                      "created_utc": 1748884631.0,
                      "replies": []
                    },
                    {
                      "id": "mvliv1g",
                      "author": "CosmicCreeperz",
                      "body": "Yeah it’s so annoying the random stuff it shows up on.  I have a 10 year old Paradigm sub where the stand is getting sticky.  I basically scrubbed it with a semi-abrasive dish pad until the coating mostly came off.  Looks exactly the same, I don’t even see the point of why they used it there.\n\nAnd weirder and more annoying, the knobs on my car radio.",
                      "score": 1,
                      "created_utc": 1748875987.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mvmm1r8",
                  "author": "Fidelio",
                  "body": "Put some isopropyl alcohol on a paper towel and rub the sticky rubber coating to remove it.",
                  "score": 1,
                  "created_utc": 1748887123.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mvuj8ku",
              "author": "rooftops",
              "body": "G604 here, I am developing callouses on the area where the rubber grip has worn down to the shell 🥲",
              "score": 1,
              "created_utc": 1748988153.0,
              "replies": []
            },
            {
              "id": "mvq1tzq",
              "author": "oromis95",
              "body": "Dude, either you've owned G502s longer than me (a decade), or your hands are nasty. Own 4 G502s, game daily, they look brand new.",
              "score": -1,
              "created_utc": 1748929695.0,
              "replies": [
                {
                  "id": "mvti6j6",
                  "author": "oshatokujah",
                  "body": "Well duh, if you’re rotating between 4 mice of course they’re lasting longer than the normal folk who use one.",
                  "score": 1,
                  "created_utc": 1748976826.0,
                  "replies": []
                },
                {
                  "id": "mvti9cf",
                  "author": "oshatokujah",
                  "body": "Well duh, if you’re rotating between 4 mice of course they’re lasting longer than the normal folk who use one.",
                  "score": 1,
                  "created_utc": 1748976855.0,
                  "replies": [
                    {
                      "id": "mvv1f5n",
                      "author": "oromis95",
                      "body": "I have an office job, so assume 8 hours I use 1, go home and game with the other. That's normal 2 mice over 10 years. I'd say that's normal/heavy usage regardless.",
                      "score": 1,
                      "created_utc": 1748994154.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mvjx2p0",
          "author": "_LV426",
          "body": "Every high-end mouse I’ve owned has done this and I keep my hands clean/don’t use moisturisers and stuff at my desk. Something in the matt finish rubber they use doesn’t agree with my skin clearly haha. My Corsair and G9X mouse looks disgusting but it still works fine so I’m reluctant to get yet another new mouse.\n\nMy MX2 is completely fine though 😀",
          "score": 13,
          "created_utc": 1748850731.0,
          "replies": []
        },
        {
          "id": "mvjg1y6",
          "author": "ArchusKanzaki",
          "body": "I change from Master 3 and Master 3S, and it seems to be abit more durable. However, rubber coating will peel at some point, even if you don't have sandpaper on hand. Hope they changed it to something more durable.",
          "score": 19,
          "created_utc": 1748841088.0,
          "replies": []
        },
        {
          "id": "mvjis7d",
          "author": "KingofSkies",
          "body": "I do have dirty hands, my workstation is in a warehouse. And it is absolutely weird how the texture is getting in a spot. Melting is right. Thought maybe I cleaned it with something too harsh.",
          "score": 7,
          "created_utc": 1748842508.0,
          "replies": []
        },
        {
          "id": "mvk7ymo",
          "author": "MagicBoyUK",
          "body": "Weird. I'm on an 8 year old MX Master and it's been fine. Bit shiny on the buttons, no sign of sticky. Got a 5 year old MX Master 2 as a spare for when it decides to take retirement and that's fine too.",
          "score": 3,
          "created_utc": 1748857431.0,
          "replies": [
            {
              "id": "mvkbk6e",
              "author": "redditclm",
              "body": "My MX 1 also lasted 8 years. The MX 3 got all ugly looking after 2 years. Clearly much crappier materials.",
              "score": 1,
              "created_utc": 1748859458.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mvliqqc",
          "author": "_haha_oh_wow_",
          "body": "Do you use hand lotion frequently? I've seen stuff like buttons and covers start to get messed up over time. I think there might be something in the lotion that affects synthetic materials. You might also just naturally produce more oils/acids from you skin if you don't use lotion.\n\nMy MX Master 2, MX Anywhere, MX Vertical, and MX Marathons are all still in good shape after years of service and are in pretty good condition.",
          "score": 3,
          "created_utc": 1748875952.0,
          "replies": []
        },
        {
          "id": "mvn9531",
          "author": "attrackip",
          "body": "I cleaned my white version after 2 years of use, it's perfectly acceptable. Things need cleaning.",
          "score": 2,
          "created_utc": 1748893773.0,
          "replies": []
        },
        {
          "id": "mvnnodu",
          "author": "Simmangodz",
          "body": "No need to fix. It's part of the subscription cost.",
          "score": 2,
          "created_utc": 1748897927.0,
          "replies": []
        },
        {
          "id": "mvjx2fm",
          "author": "Kep0a",
          "body": "All of the logitech mice are very disposable. My MX1 got rough too, and my G305 and becoming creaky as well.",
          "score": 3,
          "created_utc": 1748850726.0,
          "replies": []
        },
        {
          "id": "mvkdvqd",
          "author": "qa3rfqwef",
          "body": "It’s one of the reasons I went with their Pro X Superlight 2 DEX (mouthful of a name). It doesn’t have any built-in rubber on the sides. Instead, it comes with optional rubber adhesive grips you can stick on both sides of the mouse and on the left and right click buttons.\n\nWhen I first saw them, I figured they’d feel cheap and be kind of crap, but honestly, it’s a clever idea and works really well.",
          "score": 1,
          "created_utc": 1748860704.0,
          "replies": []
        },
        {
          "id": "mvljjbo",
          "author": "Hovie1",
          "body": "This has been an issue with Logitech mice for a long, long time.",
          "score": 1,
          "created_utc": 1748876184.0,
          "replies": []
        },
        {
          "id": "mvm98tp",
          "author": "Kilmoore",
          "body": "Ah, interesting. I was just wondering why mine has a worn bit on it. I guess it's actually a quality issue.",
          "score": 1,
          "created_utc": 1748883574.0,
          "replies": []
        },
        {
          "id": "mvqzm6r",
          "author": "scrubzor",
          "body": "Don’t worry, the buttons will crap out long before the material will. Logitech quality has gone way downhill. I had a Logitech mx518 that lasted me probably 10 years. Yet somehow I need to buy a new Logitech G502 every 1-2 years.",
          "score": 1,
          "created_utc": 1748948798.0,
          "replies": []
        },
        {
          "id": "mvrklp1",
          "author": "AmericanBillGates",
          "body": "You have clean xenonorph oils.\n\nIn all seriousness consider a visit to a veterinarian.",
          "score": 1,
          "created_utc": 1748956889.0,
          "replies": []
        },
        {
          "id": "mwtj429",
          "author": "thatgeekywhiteguy",
          "body": "The reason that this happens is that human skin oils are slightly acidic, so it very slowly breaks down the rubberized coating.",
          "score": 1,
          "created_utc": 1749472123.0,
          "replies": []
        },
        {
          "id": "mvjpzdh",
          "author": "vpsj",
          "body": "Ahh.. And I thought that I was getting it dirty",
          "score": 1,
          "created_utc": 1748846508.0,
          "replies": []
        },
        {
          "id": "mvkosfh",
          "author": "ToMorrowsEnd",
          "body": "It's low end rubber,  a lot of devices suffer from it and they wont change it as it encourages you to replace it often.",
          "score": 1,
          "created_utc": 1748865730.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mvjc2xh",
      "author": "the908bus",
      "body": "Do I have to pay a monthly sub for it?",
      "score": 238,
      "created_utc": 1748839123.0,
      "replies": [
        {
          "id": "mvjj0pa",
          "author": "None",
          "body": "[deleted]",
          "score": 61,
          "created_utc": 1748842634.0,
          "replies": [
            {
              "id": "mvjplib",
              "author": "__-_-_--_--_-_---___",
              "body": "This gif works for literally every situation ",
              "score": 10,
              "created_utc": 1748846291.0,
              "replies": [
                {
                  "id": "mvjsm4b",
                  "author": "PM_ME_YOUR_PAUNCH",
                  "body": "https://giphy.com/gifs/9t6xpYZ9npJmM",
                  "score": 6,
                  "created_utc": 1748848013.0,
                  "replies": []
                },
                {
                  "id": "mvju21r",
                  "author": "theemptyqueue",
                  "body": "![gif](giphy|S6HEz4XChX8boa5uuo)",
                  "score": 5,
                  "created_utc": 1748848886.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mvlaqlb",
          "author": "SUPRVLLAN",
          "body": "*Would you like to purchase an additional 1,000 clicks for $1.99?*",
          "score": 7,
          "created_utc": 1748873550.0,
          "replies": []
        },
        {
          "id": "mvkxltx",
          "author": "slowpokefastpoke",
          "body": "Only if you want to unlock scroll wheel functionality",
          "score": 4,
          "created_utc": 1748869136.0,
          "replies": []
        },
        {
          "id": "n0lrsdb",
          "author": "FezAndSmoking",
          "body": "Is it a Samsung or Apple excrement?",
          "score": 1,
          "created_utc": 1751301912.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mvjdzlh",
      "author": "TangerineX",
      "body": "Man I just want them to bring back the MX518.",
      "score": 23,
      "created_utc": 1748840052.0,
      "replies": [
        {
          "id": "mvjfs5y",
          "author": "eestionreddit",
          "body": "again?",
          "score": 3,
          "created_utc": 1748840950.0,
          "replies": []
        },
        {
          "id": "mvjube6",
          "author": "NameShortage",
          "body": "I'm still using mine from 2006. The scroll wheel 100% responsive but it's still the best mouse I've ever used. I'm going to be so sad the day it dies.",
          "score": 3,
          "created_utc": 1748849044.0,
          "replies": []
        },
        {
          "id": "mvqxsg4",
          "author": "idontwanttofthisup",
          "body": "I found mine yesterday while going through boxes! I fragged so many people using it I just had to keep it as a souvenir.",
          "score": 1,
          "created_utc": 1748947943.0,
          "replies": []
        },
        {
          "id": "mvjoibl",
          "author": "Zandalaria",
          "body": "They did a few years ago. I have one.",
          "score": 1,
          "created_utc": 1748845662.0,
          "replies": [
            {
              "id": "mvm5wgx",
              "author": "flitzpiepe3000",
              "body": "I tried it but somehow the remake was not as good as the OG 518.",
              "score": 3,
              "created_utc": 1748882633.0,
              "replies": [
                {
                  "id": "mvm7at9",
                  "author": "Zandalaria",
                  "body": "Not sure if you’re like me and went to using smaller mice over the years, but I couldn’t get used to it. Using a G Pro wireless now. I suppose the 518 is a good back up haha.",
                  "score": 1,
                  "created_utc": 1748883030.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mvk3l49",
              "author": "Erikthered00",
              "body": "Which you can’t get any more. I’ll keep repairing my 3 G400s’ (which. Is just an MX518 in a new colour and sensor)",
              "score": 1,
              "created_utc": 1748854758.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mvjpnca",
      "author": "RickGrindskin",
      "body": "MAKE ANOTHER G600 LOGITECH IM BEGGING",
      "score": 17,
      "created_utc": 1748846321.0,
      "replies": [
        {
          "id": "mvjyokh",
          "author": "bugmush",
          "body": "and another G9x, too",
          "score": 2,
          "created_utc": 1748851703.0,
          "replies": []
        },
        {
          "id": "mvlkdr6",
          "author": "sanctaidd",
          "body": "The g604s are selling for crazy money on the secondhand market, most of the originals are falling apart, hopefully we get a successor soon. This mouse is fairly similar so maybe there is hope.",
          "score": 2,
          "created_utc": 1748876429.0,
          "replies": []
        },
        {
          "id": "mvl2evz",
          "author": "blackhawk867",
          "body": "I've had mine for 10 years now and I'm terrified for when it eventually dies",
          "score": 1,
          "created_utc": 1748870828.0,
          "replies": []
        },
        {
          "id": "mvr5plm",
          "author": "nokafein",
          "body": "That thing needs a proper redesign. I had to give mine to the little brother because it fucked my wrist and ring finger with that extra button. It's great idea on the paper but ring finger not grabbing but resting on that form factor ruins the ring finger and every single nerve and muscle that is attached to it :D",
          "score": 1,
          "created_utc": 1748951438.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mvjaohb",
      "author": "internetlad",
      "body": "Yep that's a mouse",
      "score": 67,
      "created_utc": 1748838447.0,
      "replies": []
    },
    {
      "id": "mvjebaj",
      "author": "signfang",
      "body": "Hope they've improved the durability of its weak-ass switches. Mine died like 1.5 years of light use.",
      "score": 37,
      "created_utc": 1748840212.0,
      "replies": [
        {
          "id": "mvjpc0s",
          "author": "iDestroyedYoMama",
          "body": "Mine stopped left-clicking after 1 year of full time work use.",
          "score": 14,
          "created_utc": 1748846136.0,
          "replies": []
        },
        {
          "id": "mvjg4kw",
          "author": "nagi603",
          "body": "There is an [interesting video](https://www.youtube.com/watch?v=v5BhECVlKJA) out there that correctly points out the reason: they under-volt the switches in the name of battery life.\n\nSo unless they somehow design completely new switches or slash the battery life, it's gonna be the same.",
          "score": 21,
          "created_utc": 1748841126.0,
          "replies": [
            {
              "id": "mvjgdmr",
              "author": "signfang",
              "body": "So.... it's one of those planned obsolescences?",
              "score": 8,
              "created_utc": 1748841253.0,
              "replies": [
                {
                  "id": "mvjhxzg",
                  "author": "nagi603",
                  "body": "Probably more of a \"optimize out the one thing we do not advertise or even list in our specs sheet: operating a component well outside its rated specifications, shortening lifetime.\" But hey, x month battery life can be listed everywhere!\n\nIn the meanwhile, I still have 3 Performance MX mice (1 main, formerly 1 office, now 2 backups) with only a **single** dead switch (fixed). Some on their 3rd AA battery. But oh, the tragedy of having to insert the charging cable once or twice a week.",
                  "score": 10,
                  "created_utc": 1748842062.0,
                  "replies": [
                    {
                      "id": "mvle2eo",
                      "author": "FilteringAccount123",
                      "body": "Yeah I don't understand why battery life would be such a big bragging point on the non-anywhere model. I'd gladly trade some battery life for things like a higher polling rate or other QoL things. Or just have a performance mode/endurance mode switch.",
                      "score": 1,
                      "created_utc": 1748874563.0,
                      "replies": [
                        {
                          "id": "mvosgx0",
                          "author": "zzazzzz",
                          "body": "because its their only market advantage. no other mouse comes even close to logitechs battery life. other than that you can find a mouse in every single stat that outperforms logitech. \n\nand just from personal experience, every one of my failing switches that double clicked ect was physical damage to the switch not any undervolting causing damage. and all of them i fixed with some superglue to fill out the indent on the switch. so i am kind of dubious on the undervolting causing the issue. even more so given that many ppl have changed their switches to third party ones and did not ecounter the issue again.",
                          "score": 4,
                          "created_utc": 1748911194.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mvk2lgv",
          "author": "BroKick19",
          "body": "Same mine too. The rubber coating is also very weak",
          "score": 3,
          "created_utc": 1748854147.0,
          "replies": []
        },
        {
          "id": "mvl1q8s",
          "author": "bdixisndniz",
          "body": "Still waiting on my IT dept for replacement. Been a month lol. For a mouse.",
          "score": 1,
          "created_utc": 1748870592.0,
          "replies": []
        },
        {
          "id": "mvl3zuk",
          "author": "wreeper007",
          "body": "Just replaced the switch on my wife’s and my 602, still need to do my 604. Wasn’t difficult but the disassembly of the 602 was a slog. So many screws",
          "score": 1,
          "created_utc": 1748871364.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mvkqn75",
      "author": "jaymz168",
      "body": "You're welcome guys!  A week ago I finally bought an MX Master 3S for working on the road after years of it sitting in my Amazon wish list.",
      "score": 6,
      "created_utc": 1748866490.0,
      "replies": []
    },
    {
      "id": "mvjgt7v",
      "author": "nicman24",
      "body": "does it have the gaming sensor? it is the only thing it was missing for me",
      "score": 12,
      "created_utc": 1748841476.0,
      "replies": [
        {
          "id": "mvji1ct",
          "author": "HakimeHomewreckru",
          "body": "Yeah, my Master 3S suffers from immense sensor skipping when doing fast flicks. I haven't seen a mouse do that in 10 years.",
          "score": 9,
          "created_utc": 1748842112.0,
          "replies": []
        },
        {
          "id": "mvlcg4e",
          "author": "None",
          "body": "[deleted]",
          "score": 0,
          "created_utc": 1748874075.0,
          "replies": [
            {
              "id": "mvn9dbf",
              "author": "UpsetKoalaBear",
              "body": "It’s not for gaming. It’s for the polling rate.\n\nUse a MX Master on a 120hz display and it looks like it’s lagging. Most high end work laptops, like my work provided Mac, have a 120hz display. It’s becoming normal now.",
              "score": 3,
              "created_utc": 1748893839.0,
              "replies": []
            },
            {
              "id": "mvnj8m1",
              "author": "whatninu",
              "body": "I could deal with it for gaming if the polling rate was higher. It would suck for competitive fps still but as it stands even Minecraft feels awful",
              "score": 2,
              "created_utc": 1748896659.0,
              "replies": []
            },
            {
              "id": "mvlul2n",
              "author": "nicman24",
              "body": "LoL I have both",
              "score": 1,
              "created_utc": 1748879368.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mvjho4k",
          "author": "MechKeyboardScrub",
          "body": "It's an enterprise mouse that's 140 grams. \n\nHopefully it's better than 125, but it seems pretty unlikely they're going to switch to a 1k sensor. Idk why you'd use it for gaming.",
          "score": -5,
          "created_utc": 1748841919.0,
          "replies": [
            {
              "id": "mvji13p",
              "author": "nicman24",
              "body": "I like them big, I like them chunky\n\nI like them big, I like them plumpy\n\nI like them round, with something, something",
              "score": 10,
              "created_utc": 1748842108.0,
              "replies": [
                {
                  "id": "mvjpuo7",
                  "author": "eclectic_radish",
                  "body": ">I like them round, with\n\nthe rubber all funky!",
                  "score": 2,
                  "created_utc": 1748846436.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mvjfx1y",
      "author": "ArchusKanzaki",
      "body": "Hoping that they changed the rubber coating to something more durable.\n\nAlso, hoping that there will be a button to easily change device that is NOT on the bottom of the mouse.\n\nAnd lastly, better polling rate and ways to store mouse profile inside the mouse. Do all 3, and I will line-up for pre-order.",
      "score": 10,
      "created_utc": 1748841018.0,
      "replies": []
    },
    {
      "id": "mvjf8ak",
      "author": "KrookedDoesStuff",
      "body": "I just want Logitech to either make the G600 again, or a good successor for it",
      "score": 9,
      "created_utc": 1748840672.0,
      "replies": [
        {
          "id": "mvjjtdx",
          "author": "ffxivdia",
          "body": "God I wish they would keep making this. I don’t think I can ever play FFXIV with any other mouse.",
          "score": 3,
          "created_utc": 1748843058.0,
          "replies": [
            {
              "id": "mvjqcv3",
              "author": "frozengrandmatetris",
              "body": "I beat the crap out of my first G600 and bought two more thinking that they will be dumb and discontinue it. guess I was right. there's always some mouse on the market that has everything the G600 has minus one or two critical features and it's so frustrating",
              "score": 2,
              "created_utc": 1748846721.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mvk26vr",
      "author": "little_hoe",
      "body": "LOGITECH BRING ME BACK MY G604 GOAT",
      "score": 3,
      "created_utc": 1748853898.0,
      "replies": []
    },
    {
      "id": "mvk65rb",
      "author": "VonArmin",
      "body": "I love my master 3, I really hope they ditch the horrible rubber coating though.",
      "score": 3,
      "created_utc": 1748856344.0,
      "replies": []
    },
    {
      "id": "mvjawgb",
      "author": "root_b33r",
      "body": "Cool mines broke, guess I’ll get this when it comes out, hopefully the keyboard gets an update too",
      "score": 10,
      "created_utc": 1748838555.0,
      "replies": []
    },
    {
      "id": "mvjhbt2",
      "author": "Minionz",
      "body": "I hope they increase the polling rate. The main thing holding it back for me.",
      "score": 2,
      "created_utc": 1748841742.0,
      "replies": []
    },
    {
      "id": "mvmqne6",
      "author": "illBelief",
      "body": "Still no left right rocker on the scroll wheel?! Come on Logitech... Your lower end MX mice have it",
      "score": 2,
      "created_utc": 1748888437.0,
      "replies": []
    },
    {
      "id": "mvrfzsd",
      "author": "Jlx_27",
      "body": "Yikes thats ugly.",
      "score": 2,
      "created_utc": 1748955327.0,
      "replies": [
        {
          "id": "n0ls3lu",
          "author": "FezAndSmoking",
          "body": "Stick to the super functional Magic Mouse.",
          "score": 1,
          "created_utc": 1751302003.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mvjcis8",
      "author": "JakeEngelbrecht",
      "body": "Don’t care unless they release a bluetooth G600",
      "score": 5,
      "created_utc": 1748839334.0,
      "replies": []
    },
    {
      "id": "mvjdzmf",
      "author": "anon8422",
      "body": "Awesome news, hope they don't make it lighter. I like heavy mice",
      "score": 3,
      "created_utc": 1748840052.0,
      "replies": []
    },
    {
      "id": "mvjfosw",
      "author": "dibidi",
      "body": "they should bring back the tilt wheel",
      "score": 4,
      "created_utc": 1748840902.0,
      "replies": []
    },
    {
      "id": "mvkbc1t",
      "author": "redditclm",
      "body": "Did they fix the rubber coating or will it now rub off in less than a year? And buttons that stop working, etc.",
      "score": 3,
      "created_utc": 1748859335.0,
      "replies": []
    },
    {
      "id": "mvjbh08",
      "author": "HansBooby",
      "body": "huge ‘news’",
      "score": 3,
      "created_utc": 1748838828.0,
      "replies": []
    },
    {
      "id": "mvjcbhk",
      "author": "Galileominotaurlazer",
      "body": "Fuck logitech, they tried to make a mouse a subscription, done buying anything from that company.",
      "score": 3,
      "created_utc": 1748839237.0,
      "replies": [
        {
          "id": "mvjcu0v",
          "author": "PeterDTown",
          "body": "Come again now for big fudge?",
          "score": 7,
          "created_utc": 1748839487.0,
          "replies": []
        },
        {
          "id": "mvjgl2r",
          "author": "mattbladez",
          "body": "They didn’t try. The CEO said, [in an interview on the Decoder](https://www.theverge.com/2024/8/6/24214857/logitech-subscription-mouse-decoder-podcast-hanneke-faber):\n\n>“The forever mouse, I think, is one of the things that we’d like to get to”",
          "score": 5,
          "created_utc": 1748841358.0,
          "replies": []
        },
        {
          "id": "mvjevp7",
          "author": "SO245",
          "body": "I was just going to say 'is this the one where you pay per click?'",
          "score": 2,
          "created_utc": 1748840494.0,
          "replies": []
        },
        {
          "id": "mvjlwpr",
          "author": "whlthingofcandybeans",
          "body": "What exactly are you referring to?",
          "score": 1,
          "created_utc": 1748844199.0,
          "replies": [
            {
              "id": "mvl0cs5",
              "author": "Abigail716",
              "body": "The CEO of the company suggested a possible future device that's designed to last forever and would be based on a subscription model.",
              "score": 3,
              "created_utc": 1748870113.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mvjnp46",
      "author": "andreibirsan92",
      "body": "I loved my mx master2 but both copies I had failed after 2 years . Gave up on logitech products since",
      "score": 2,
      "created_utc": 1748845203.0,
      "replies": [
        {
          "id": "mvjojqw",
          "author": "TheJohnSB",
          "body": "Still using my MX1 and my MX3. Sorry you got a dud.",
          "score": 3,
          "created_utc": 1748845685.0,
          "replies": [
            {
              "id": "mvouaga",
              "author": "InclinationCompass",
              "body": "Been using my mx3 heavily for 5.5 years now. It still works perfectly. The material is pretty worn, though. I have brand new one for backup too.",
              "score": 2,
              "created_utc": 1748911847.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mvldb9m",
      "author": "lucellent",
      "body": "I feel like a minority here but this is one of the worst mice I've used. It's so bulky and heavy, the scroll button too, and it felt sluggish when using both USB connection and bluetooth. No other USB/BT mouse does that for me except this one.",
      "score": 2,
      "created_utc": 1748874337.0,
      "replies": []
    },
    {
      "id": "mvjey5q",
      "author": "tsunamionioncerial",
      "body": "Well I guess I know they haven't changed anything significant when mine breaks.",
      "score": 1,
      "created_utc": 1748840529.0,
      "replies": []
    },
    {
      "id": "mvjf1nl",
      "author": "Aleyla",
      "body": "The article lists the following problems with the 3s:\n\n>the Logitech MX Master 3S has a polling rate of just 125Hz via Bluetooth and the USB dongle, which can feel sluggish on fast monitors with refresh rates of 240Hz or more.   \n   \nSluggish?  The mx master isn’t sold as a gaming mouse.  It is targeted towards developers and other creative professionals.  \n   \n>Additionally, the Darkfield laser sensor works on many surfaces such as glass, but has a resolution of only 8,000 DPI..   \n   \nWhich is more than enough for the target market.   \n   \n>At just under 5 oz, the MX Master 3S also weighs more than twice as much as some high-end gaming mice.  \n   \nAgain, not a gaming mouse.  Also highly subjective - I very much appreciate the higher weight.  Far better than the cheap feel from lighter mice.    \n   \n>Lastly, Logitech doesn’t offer the option to store the USB dongle inside the mouse, which can be practical when transporting or using the mouse on the go.   \n  \nThe only time I needed to pull the usb thing out of my laptop is when I’ve replaced the laptop.    Not having onboard storage for the dongle is not an issue for the target market.   \n    \nThere’s plenty of gaming mice.  The article writer should kindly fuck off and stick with one of those.",
      "score": 1,
      "created_utc": 1748840578.0,
      "replies": []
    },
    {
      "id": "mvjjhkr",
      "author": "ChoMar05",
      "body": "Let me just say that I recently got a keychron, and that's a really good mouse. Has the \"old style\" mechanic  detachable scroll wheel, a great sensor, feels good, comes with USB-A and C receivers, and supports Bluetooth.",
      "score": 1,
      "created_utc": 1748842884.0,
      "replies": [
        {
          "id": "mw0xg2a",
          "author": "CiloTA",
          "body": "What’s the full name of it?",
          "score": 1,
          "created_utc": 1749072387.0,
          "replies": [
            {
              "id": "mw3dwyi",
              "author": "ChoMar05",
              "body": "Mine is the Keychron M6, but they got several",
              "score": 1,
              "created_utc": 1749106321.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mvjlc7x",
      "author": "whlthingofcandybeans",
      "body": "Don't see any reason to upgrade, it looks nearly identical.",
      "score": 1,
      "created_utc": 1748843889.0,
      "replies": []
    },
    {
      "id": "mvjpbf2",
      "author": "fightmaxmaster",
      "body": "My MX master 3 is wearing out slightly. And **loud**, but hasn't been worth replacing with the 3S. If this makes the 3S cheaper I'll be happy.",
      "score": 1,
      "created_utc": 1748846127.0,
      "replies": []
    },
    {
      "id": "mvjqr6u",
      "author": "Amidatelion",
      "body": "I have a Logitech Marathon from 2017. I have changed the batteries twice, with the latest being Dec 2024.   \n\nNo real incentive to buy anything else with build quality declining across the board.",
      "score": 1,
      "created_utc": 1748846948.0,
      "replies": []
    },
    {
      "id": "mvjtpd6",
      "author": "TheRabidDeer",
      "body": "Left handed mouse when?\n\nI really want a good left handed Logitech G502 style mouse but it just... doesn't exist. Of all the mice they make for handedness, the only one is the shitty uncomfortable looking Logitech Lift. Everything else out there is just an ambi mouse which is what I use now.",
      "score": 1,
      "created_utc": 1748848670.0,
      "replies": []
    },
    {
      "id": "mvk2et4",
      "author": "Swizzy88",
      "body": "Shame the Logitech software is by far the worst part of the product.",
      "score": 1,
      "created_utc": 1748854033.0,
      "replies": []
    },
    {
      "id": "mvkawe2",
      "author": "0815andstuff",
      "body": "Another MX Master… is there now a lefthanded version of the new model? Guess i will be disappointed again…",
      "score": 1,
      "created_utc": 1748859092.0,
      "replies": []
    },
    {
      "id": "mvkfa51",
      "author": "Aware_Shirt",
      "body": "It’s same same but different ?",
      "score": 1,
      "created_utc": 1748861411.0,
      "replies": []
    },
    {
      "id": "mvkrghf",
      "author": "ohiocodernumerouno",
      "body": "Where are all the buttons? I need at least 4 thumb buttons.",
      "score": 1,
      "created_utc": 1748866816.0,
      "replies": []
    },
    {
      "id": "mvkyjr9",
      "author": "PotentialParamedic61",
      "body": "IF it has internal non replaceable battery then NO!!!",
      "score": 1,
      "created_utc": 1748869473.0,
      "replies": []
    },
    {
      "id": "mvkyxsb",
      "author": "saarlac",
      "body": "Releases from the manufacturer are not leaks.",
      "score": 1,
      "created_utc": 1748869614.0,
      "replies": []
    },
    {
      "id": "mvl84tw",
      "author": "Enderkr",
      "body": "Huh.\n\nYup. It's a mouse.",
      "score": 1,
      "created_utc": 1748872725.0,
      "replies": []
    },
    {
      "id": "mvl8xn0",
      "author": "Samwellikki",
      "body": " New G600 type? No?\n\nWake me when I don’t have to import a mouse they still make but won’t sell here",
      "score": 1,
      "created_utc": 1748872981.0,
      "replies": []
    },
    {
      "id": "mvlcxcz",
      "author": "basec0m",
      "body": "Um... received one last week.",
      "score": 1,
      "created_utc": 1748874220.0,
      "replies": []
    },
    {
      "id": "mvlsggw",
      "author": "EscapeFacebook",
      "body": "I'll keep my mx2, and buy another.",
      "score": 1,
      "created_utc": 1748878764.0,
      "replies": []
    },
    {
      "id": "mvm0iiz",
      "author": "alidan",
      "body": "need a g13 and g600 successor.",
      "score": 1,
      "created_utc": 1748881081.0,
      "replies": []
    },
    {
      "id": "mvm4vmu",
      "author": "baerp",
      "body": "If they upgraded to a higher dpi sensor I’m happy. ",
      "score": 1,
      "created_utc": 1748882342.0,
      "replies": []
    },
    {
      "id": "mvm8dv7",
      "author": "Svnty",
      "body": "Hope they fixed the scroll wheel, it's absolutely trash, they use a hall effect sensor for the scroll but the polling rate (don't know how to call it) is too slow for fast precise scrolling, biggest downside of this mouse.",
      "score": 1,
      "created_utc": 1748883335.0,
      "replies": []
    },
    {
      "id": "mvma79c",
      "author": "binky779",
      "body": "spoiler alert, it looks just like the MX1, 2, and 3.",
      "score": 1,
      "created_utc": 1748883843.0,
      "replies": []
    },
    {
      "id": "mvmfqdx",
      "author": "tattikaslice",
      "body": "Had used the mx2 which was one of the best mice I had.\nUntil I got the swiftpoint Z. Wish there was a wireless version of that",
      "score": 1,
      "created_utc": 1748885383.0,
      "replies": []
    },
    {
      "id": "mvmjer4",
      "author": "IgnoreMeBot",
      "body": "Logitech customer support is non existent. Buy them if you want a product that you can never get help on",
      "score": 1,
      "created_utc": 1748886396.0,
      "replies": []
    },
    {
      "id": "mvmlitu",
      "author": "monkeymugshot",
      "body": "Damn I was just about MX 3 today... should I just wait? Or are these releases typically months later?",
      "score": 1,
      "created_utc": 1748886979.0,
      "replies": []
    },
    {
      "id": "mvmpn1c",
      "author": "notta_3d",
      "body": "I could never use the overly expensive MX 3 because of the lag. It was unusable. I don't understand why these wireless mice don't give an option to go corded as well.",
      "score": 1,
      "created_utc": 1748888146.0,
      "replies": []
    },
    {
      "id": "mvn6gnc",
      "author": "ChefCurryYumYum",
      "body": "I've liked every Logitech mouse I've bought over the last 20 or so years. \n\nThey have all died on me within no more than 3 years of ownership.\n\nI don't buy Logitech mice anymore.",
      "score": 1,
      "created_utc": 1748892996.0,
      "replies": []
    },
    {
      "id": "mvna62f",
      "author": "UpsetKoalaBear",
      "body": "They need to add a higher polling rate. \n\nAll the MX Masters look like shit on a 120hz display and that’s becoming more common on workplace laptops now. It constantly feels like it’s lagging.",
      "score": 1,
      "created_utc": 1748894069.0,
      "replies": []
    },
    {
      "id": "mvny7ci",
      "author": "shhh_its_us",
      "body": "I refuse to buy another Logitech product. I used to love their devices but the company is going to hell",
      "score": 1,
      "created_utc": 1748901071.0,
      "replies": []
    },
    {
      "id": "mvorfqq",
      "author": "ItsColeOnReddit",
      "body": "Im rocking a 3 and I don’t see why I would need to upgrade other then a bit of visible wear",
      "score": 1,
      "created_utc": 1748910822.0,
      "replies": []
    },
    {
      "id": "mvotdft",
      "author": "I_pee_in_shower",
      "body": "What more can they add to it? Is there a limit to act a mouse can be? I bet they add an AI button.",
      "score": 1,
      "created_utc": 1748911521.0,
      "replies": []
    },
    {
      "id": "mvoxepz",
      "author": "w_benjamin",
      "body": "Oh boy, oh boy..., life doesn't get any better than this...",
      "score": 1,
      "created_utc": 1748912963.0,
      "replies": []
    },
    {
      "id": "mvpf274",
      "author": "three_s-works",
      "body": "We do mouse rumors?",
      "score": 1,
      "created_utc": 1748919445.0,
      "replies": []
    },
    {
      "id": "mvq5kul",
      "author": "justarugga",
      "body": "I’ve since moved on to vertical mice after the MX series didn’t help my RSI pain.",
      "score": 1,
      "created_utc": 1748931717.0,
      "replies": []
    },
    {
      "id": "mvqcduc",
      "author": "OneForAllOfHumanity",
      "body": "Oh look, it looks like the 3, and the 2 and pro and all the other MX variants...  who would've guessed",
      "score": 1,
      "created_utc": 1748935620.0,
      "replies": []
    },
    {
      "id": "mvqwnqe",
      "author": "Bionic_Ferir",
      "body": "Yep, that's a mouse!",
      "score": 1,
      "created_utc": 1748947394.0,
      "replies": []
    },
    {
      "id": "mvr9lqz",
      "author": "mkygod",
      "body": "I don't get why the Master 4 is shaped in a way that the left button is longer than the right button when your middle finger extends out farther than your index finger.",
      "score": 1,
      "created_utc": 1748952982.0,
      "replies": []
    },
    {
      "id": "mvrba4w",
      "author": "QuantumQuantonium",
      "body": "Logitech, please,\n\n\nG604 successor.",
      "score": 1,
      "created_utc": 1748953617.0,
      "replies": []
    },
    {
      "id": "mw1lx6o",
      "author": "Gorbitron1530",
      "body": "Praying for 1000hz polling",
      "score": 1,
      "created_utc": 1749080217.0,
      "replies": []
    },
    {
      "id": "mwddydc",
      "author": "anmolshah03",
      "body": "Hoping for the horizontal scroll to improve, it's simply tough to handle, almost slippery.\nHas bee very similar experience with 2s, 3 and 3s",
      "score": 1,
      "created_utc": 1749238761.0,
      "replies": []
    },
    {
      "id": "mwn88su",
      "author": "Sh33zl3",
      "body": "Lefthanded please thankyou",
      "score": 1,
      "created_utc": 1749385045.0,
      "replies": []
    },
    {
      "id": "mvjfjju",
      "author": "4kVHS",
      "body": "Let me guess, the dongle will still be USB-A?",
      "score": 1,
      "created_utc": 1748840828.0,
      "replies": [
        {
          "id": "mvjg9fj",
          "author": "ArchusKanzaki",
          "body": "USB-A dongle is preferable honestly. You can plug it into monitor's USB port.\n\nAs for laptop, bluetooth is available. Its an office mouse after all.",
          "score": 12,
          "created_utc": 1748841195.0,
          "replies": [
            {
              "id": "mvjh8xq",
              "author": "4kVHS",
              "body": "USB-C is tiny and can easily be adapted to USB-A in a compact form factor. But going USB-A to USB-C requires a bulky adapter, making it stick out more. It’s not 2005 anymore. Logitech needs to start using USB-C on everything.",
              "score": 10,
              "created_utc": 1748841700.0,
              "replies": [
                {
                  "id": "mvjhmut",
                  "author": "ArchusKanzaki",
                  "body": "Yeah, but USB-C is too tiny imo. I have a Yubikey 5C for work in my laptop, and its so tiny it’s difficult to take it out of the slot. Not sure how much Logitech will be able to shrink down the receiver too given that smaller receiver also means smaller antenna. I think there are pros and cons but I do think that sticking with USB-A is still easier, the likely desktop user probably will prefer that.",
                  "score": -9,
                  "created_utc": 1748841901.0,
                  "replies": [
                    {
                      "id": "mvjly4z",
                      "author": "Eurynom0s",
                      "body": "Wut. This has nothing to do with the size of USB-C vs USB-A, your job just gave you the smallest Yubikey. You can have very flush USB-A dongles too.",
                      "score": 3,
                      "created_utc": 1748844221.0,
                      "replies": [
                        {
                          "id": "mvjmrgc",
                          "author": "ArchusKanzaki",
                          "body": "My point is that, Logitech's dongle is also fairly flush already and barely bigger than the USB-A port its occupying. I don't think I want the USB dongle to be smaller than it already is.",
                          "score": 0,
                          "created_utc": 1748844675.0,
                          "replies": [
                            {
                              "id": "mvodncj",
                              "author": "TheStealthyPotato",
                              "body": "If your complaint is that USB-A is barely big enough, then perhaps you'd prefer the USB-C with USB-A adapter. And then the people who want a small USB-C dongle can be happy too.",
                              "score": 2,
                              "created_utc": 1748906070.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mvjhl3z",
              "author": "mrheosuper",
              "body": "BT is slow to use on new device(or multiple device). Also much more unreliable. I cant count how many times i have to borrow a mouse so i can re pair my stupid bluetooth mouse because somehow they disconnected.\n\nSo yes, i fucking hate Bluetooth mouse.",
              "score": 2,
              "created_utc": 1748841876.0,
              "replies": [
                {
                  "id": "mvjhtf7",
                  "author": "ArchusKanzaki",
                  "body": "Idk about your mouse, but I use Master 3S with my laptop on bluetooth as 2nd device. My 1st one is paired with the dongle to my desktop. It works very reliably and I don’t see any dropouts, and I’ve been using it for years now.",
                  "score": 7,
                  "created_utc": 1748841995.0,
                  "replies": [
                    {
                      "id": "mvjin9b",
                      "author": "mrheosuper",
                      "body": "Oh boy dont get me start on the pos mouse called mx master 3.\n\nFirst, they are supposed to be office mouse, but they are extremely, extremely loud. I swear the entire office can hear every FUCKING single click i made.\n\nSecond, no where to store the dongle. I can accept that if the mouse was small and slim, but did you look at the size of it, fucking huge mouse. They cant find a place to store your dongle ?\n\nThird: no onboard memory, so you need to install their stupid software whenever you change your computer or else you stuck with default macro.\n\nYou know what worse ?, their more budget mouse(mx590) has everything: A place to store dongle and silent click, also come with replaceable battery.",
                      "score": -6,
                      "created_utc": 1748842433.0,
                      "replies": [
                        {
                          "id": "mvjk0h9",
                          "author": "ArchusKanzaki",
                          "body": "Look, I'm not against you, and I actually kinda agree with you on second and third point, but I will point-out that they fixed your first point on the 3S variant along with adding 8000 DPI sensor. Its silent now, and the silence really makes me contemplate on whether to replace my own Anywhere 3.... I made another post saying that I would line-up for pre-order, if they put onboard memory, increase the polling rate (not asking for 1000.... but 125 is too low), and put in something that makes me able to switch device without lifting-up entire mouse. I am ok with heavy mouse, I am not ok with needing to lift them up to switch device. \n\nAlso, I do have the M720 Triathlon.... but while its like 80-90% of MX Master, its still not MX Master. The sensor is definitely a step below MX Master, along with the scroll wheel definitely feeling worse and functioning worse (no auto-switch between ratcheting and infinite). The thumb rest position is also worse. I do like that the switch device button is on-top though and there is a place for dongle.... but that's kinda it.",
                          "score": 2,
                          "created_utc": 1748843164.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mvji0rn",
              "author": "pyrospade",
              "body": "follow this guy for the worst takes in tech",
              "score": -1,
              "created_utc": 1748842104.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mvjfz16",
      "author": "grogi81",
      "body": "At least someone follows the principle of not fixing what ain't broken ...",
      "score": 1,
      "created_utc": 1748841046.0,
      "replies": []
    },
    {
      "id": "mvk82xk",
      "author": "Stooovie",
      "body": "Oh look, it's a mouse",
      "score": 1,
      "created_utc": 1748857501.0,
      "replies": []
    },
    {
      "id": "mvnhq9r",
      "author": "RoytripwireMerritt",
      "body": "Are they going to try to implement that Mouse-as-a-Service subscription plan? No thanks!",
      "score": 1,
      "created_utc": 1748896232.0,
      "replies": []
    },
    {
      "id": "mvjd6vs",
      "author": "No_Pea1499",
      "body": "My 2s is getting long in the tooth, so if it's not much more expensive than the 3s, might look into it.",
      "score": 0,
      "created_utc": 1748839660.0,
      "replies": []
    },
    {
      "id": "mvjf6se",
      "author": "KitchenNazi",
      "body": "Will pushing the button on the keyboard switch mouse inputs or do I need to pick up the mouse to do it? There’s 3rd party software out there that syncs the mouse and keyboard but Logitech can’t do it?",
      "score": 0,
      "created_utc": 1748840650.0,
      "replies": []
    },
    {
      "id": "mvjoqfo",
      "author": "AnsweringLiterally",
      "body": "Is this the one you have to pay a subscription service for after you buy it?",
      "score": 0,
      "created_utc": 1748845793.0,
      "replies": []
    },
    {
      "id": "mvjouga",
      "author": "MayIPikachu",
      "body": "No side to side scroll wheel, pass! I use that to cycle tabs. Sticking to my mx revolution",
      "score": 0,
      "created_utc": 1748845855.0,
      "replies": []
    },
    {
      "id": "mvl5mtr",
      "author": "IamPd_",
      "body": "If it ain't broke, don't fix it. The MX Master series has been solid for years.",
      "score": 0,
      "created_utc": 1748871910.0,
      "replies": []
    },
    {
      "id": "mvjfvyh",
      "author": "thxpk",
      "body": "Does it still have a mount Everest high lump",
      "score": -3,
      "created_utc": 1748841003.0,
      "replies": [
        {
          "id": "mvjhbhs",
          "author": "MechKeyboardScrub",
          "body": "Yes, the ergonomic mouse is still built to fit into your palm.",
          "score": 5,
          "created_utc": 1748841738.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mvjcz0p",
      "author": "Beefkins",
      "body": "Big if true.",
      "score": -1,
      "created_utc": 1748839555.0,
      "replies": []
    },
    {
      "id": "mvjegk7",
      "author": "high_everyone",
      "body": "It’s about time, people were getting anxious Logitech had peaked and we were getting ready to declare the Magic Mouse 2 the best thing ever and now this is here.  \n\nWhew.",
      "score": -2,
      "created_utc": 1748840284.0,
      "replies": []
    }
  ]
}