{
  "post": {
    "title": "PC Case Maker Hyte Halts Shipments to US Due to Trump's Tariffs",
    "author": "One-End1795",
    "id": "1k89zfo",
    "score": 4278,
    "created_utc": 1745663763.0,
    "selftext": "",
    "num_comments": 185,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1k89zfo/pc_case_maker_hyte_halts_shipments_to_us_due_to/"
  },
  "comments": [
    {
      "id": "mp4j00d",
      "author": "jc-from-sin",
      "body": "And they are American",
      "score": 495,
      "created_utc": 1745664097.0,
      "replies": [
        {
          "id": "mp4jec6",
          "author": "NorysStorys",
          "body": "All the US based system integrators are likely doing the same, there’s no way people are gonna buy an i3 or lower end Ryzen system for a grand when they were worth 400-500 a few months ago.",
          "score": 313,
          "created_utc": 1745664326.0,
          "replies": [
            {
              "id": "mp6x0go",
              "author": "Locke_and_Load",
              "body": "Gamer’s Nexus made a video about it already. All the major SIs are diverting shipments away from the US and jacking up prices on what’s already here. The US is screwed in computing for the general consumer for a bit.",
              "score": 188,
              "created_utc": 1745694213.0,
              "replies": [
                {
                  "id": "mp7g924",
                  "author": "geoff04",
                  "body": "For a bit? Lol yeah ok. Only temporary.",
                  "score": 44,
                  "created_utc": 1745700518.0,
                  "replies": [
                    {
                      "id": "mp7h74m",
                      "author": "Locke_and_Load",
                      "body": "I mean, demonstrably for a bit, then who knows! Most likely longer, but it starts with a bit.",
                      "score": 77,
                      "created_utc": 1745700820.0,
                      "replies": [
                        {
                          "id": "mp7sso2",
                          "author": "SpeedflyChris",
                          "body": "The market is still mostly working on the assumption (misguided or not) that nobody is *actually* stupid enough to do the things Trump has said he's going to do, and that he'll back down soon.\n\nProblem is, once you've forced the entire world to prioritise non-US supply chains and demonstrated that it's not possible to make long term plans in the US market, they're not going to come rushing back.",
                          "score": 87,
                          "created_utc": 1745704702.0,
                          "replies": [
                            {
                              "id": "mp8flx7",
                              "author": "ohiotechie",
                              "body": "Exactly and inside the US once $1k is the accepted price for something that used to be $500 just because the tariffs go away doesn’t mean it will go back to $500 - guaran-goddamn-tee it stays $1k if not more just because that’s what people have gotten used to paying.",
                              "score": 48,
                              "created_utc": 1745712677.0,
                              "replies": [
                                {
                                  "id": "mp9me51",
                                  "author": "Curious-Ebb-8451",
                                  "body": "Well that depends on competition really",
                                  "score": 2,
                                  "created_utc": 1745730403.0,
                                  "replies": [
                                    {
                                      "id": "mpa9qao",
                                      "author": "identicalBadger",
                                      "body": "It’s what happened with near everything during Covid. Supply chains recovered, inflation continued to rage while corporate profits spiked",
                                      "score": 26,
                                      "created_utc": 1745744248.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mpab2hr",
                                      "author": "NorysStorys",
                                      "body": "If you think the US economy works on honest competition capitalism, you are grossly naïve. The US has some of the weakest anti-trust and competition regulation as well as a track record of being very protectionist. The treasury typically acts based on who lobby’s (bribes the most) and you can bet your bottom dollar that everyone’s going to want keep everything at tariff prices and not reduce down to actual supply demand prices, it happened during/after covid it’ll happen again.",
                                      "score": 25,
                                      "created_utc": 1745745113.0,
                                      "replies": [
                                        {
                                          "id": "mpce10m",
                                          "author": "Curious-Ebb-8451",
                                          "body": "Well the consumer market was very strong during/after Covid due to stimulus and wage growth. Things are not going to play the same way this time so companies can't take advantage of price hikes because consumers will just stop buying. That's when competitors emerge. Its already noticeable right now when a lot of Target shoppers opt to go to Walmart instead.",
                                          "score": -3,
                                          "created_utc": 1745774735.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "mpawreh",
                                      "author": "ohiotechie",
                                      "body": "Airline companies started charging $50 for luggage in the early 2000s when jet fuel prices spiked. It was supposed to be because of the higher prices but 20 years later after fuel prices came down have they removed the fee?",
                                      "score": 8,
                                      "created_utc": 1745757007.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mpa40h5",
                              "author": "Jirekianu",
                              "body": "The other problem is that we haven't seen the actual ramifications of the tariffs disrupting logistics yet. Basically, may is when shit is truly going to hit the fan and be thoroughly fucked.  \n\nEven if the tariffs get completely cancelled and china doesn't do anything retaliatory? That's another 60-70 days of disruption to supply chains as the lack of materials takes that long to filter through.  It's like cutting off the flow of water upstream and it takes days for it to show at a town down the river. Even if you turn it on the second you see the flow taper off at the town it still has to travel that distance.",
                              "score": 9,
                              "created_utc": 1745740669.0,
                              "replies": []
                            },
                            {
                              "id": "mp8an2x",
                              "author": "LunDeus",
                              "body": "He’s already doubling down on lying about taking to china for a resolution…",
                              "score": 12,
                              "created_utc": 1745710846.0,
                              "replies": []
                            },
                            {
                              "id": "mp8pwya",
                              "author": "Killbot_Wants_Hug",
                              "body": "Nobody president has benefitted China more than Trump. There's great irony that he accused Democrats of being soft on China when through sheer stupidity he accelerated everything they've wanted.\n\nExports to the US only make up 3% of China GDP. They'd trade that for closer relations with the rest of the world and knowing they could attack Taiwan without reprisal from the US.",
                              "score": 10,
                              "created_utc": 1745716595.0,
                              "replies": []
                            },
                            {
                              "id": "mp99nxi",
                              "author": "naarwhal",
                              "body": "Yeah and just like groceries, they’ll probably never decrease prices. Thanks fuckin dumb ass Trump",
                              "score": 2,
                              "created_utc": 1745724449.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mp8f8ki",
                      "author": "DrDerpberg",
                      "body": "The upside (but also the reason nobody's actually gonna commit to changing their supply chains in any meaningful way) is Trump could wake up tomorrow and make it all go away. \n\nThen again, he could also make the tariffs one billion percent for the stuff you've already got on a boat from China and then you're better off dumping it into the sea.",
                      "score": 5,
                      "created_utc": 1745712537.0,
                      "replies": [
                        {
                          "id": "mpa1ava",
                          "author": "akeean",
                          "body": "Even if he'd \"make it all go away\", lasting damage to the US's position has been dealt, since the rest of the world is now more likely to seek more stable trade partnerships, at least while malicious ineptitude has the wheel.",
                          "score": 6,
                          "created_utc": 1745739013.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mp8c5jo",
                  "author": "Manaphy2007_67",
                  "body": "That's because China wants to act tough but they are actually a paper tiger.",
                  "score": -35,
                  "created_utc": 1745711393.0,
                  "replies": [
                    {
                      "id": "mp8k053",
                      "author": "TheAbstracted",
                      "body": "I see no scenario in which that could possibly be true. Despite popular American opinion to the contrary, China doesn't need our business.",
                      "score": 16,
                      "created_utc": 1745714351.0,
                      "replies": [
                        {
                          "id": "mp8l98q",
                          "author": "feudalle",
                          "body": "I think the last stat i saw was america buys around 15% of Chinese goods. Physical products have more value than paper money. The real thing is worfy about us if China cuts off rare earth metals. We only have one company that mines for it in the us and they send it to China for processing. Plus side my used s21 Samsung might be worth $1000 when the average new smart phone hits 5k.",
                          "score": 2,
                          "created_utc": 1745714818.0,
                          "replies": []
                        },
                        {
                          "id": "mp8mjty",
                          "author": "Manaphy2007_67",
                          "body": "we also don't need their business.",
                          "score": -18,
                          "created_utc": 1745715304.0,
                          "replies": [
                            {
                              "id": "mp8nu3w",
                              "author": "TheAbstracted",
                              "body": "Sure, but only by moving manufacturing to other countries that pay low wages. Seems to defeat the purpose.",
                              "score": 10,
                              "created_utc": 1745715790.0,
                              "replies": []
                            },
                            {
                              "id": "mp9uleh",
                              "author": "MadBullBen",
                              "body": "SO MANY products are made in china, unless the companies have factories in other countries it's so difficult to move quickly and almost impossible if you're a small business without a huge amount in the bank.",
                              "score": 2,
                              "created_utc": 1745734982.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpdgqbu",
              "author": "LordOverThis",
              "body": "They say they won’t but absolutely will; there were RX 6400 systems selling for north of $800 during the COVID and crypto shortage.\n\nIt’ll work out for me.  I cached a whole pile of shit right after the election and whatever didn’t sell for Christmas is now looking like it’ll fetch a premium in short order.\n\nAnd to get political about it: I voted for the woman who maybe laughed a bit too much at times but didn’t have a weird fixation on an antiquated and self-defeating economic policy, but once the outcome was decided I opted to make the most of what was almost certain impending stupidity.",
              "score": 3,
              "created_utc": 1745786604.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp50c35",
          "author": "Sopel97",
          "body": "ironic how the tariffs have the exact opposite effect of what was claimed they would achieve",
          "score": 107,
          "created_utc": 1745672083.0,
          "replies": [
            {
              "id": "mp5b7bz",
              "author": "Blue-Thunder",
              "body": "Well what do you expect from an administration who is running with the whole \"Tariffs are a tax cut for Americans\" lie.",
              "score": 89,
              "created_utc": 1745676070.0,
              "replies": []
            },
            {
              "id": "mp6qapn",
              "author": "Shiva-",
              "body": "An enormous part of this is 1.) the size of the tariffs and 2.) the unpredictability.",
              "score": 13,
              "created_utc": 1745692090.0,
              "replies": []
            },
            {
              "id": "mp7u25b",
              "author": "afrothundah11",
              "body": "They are to make the working class unable to survive and willing to take on the shitty jobs he’s trying to bring back",
              "score": 9,
              "created_utc": 1745705124.0,
              "replies": [
                {
                  "id": "mp8anba",
                  "author": "Madness_Reigns",
                  "body": "Crops aren't gonna harvest themselves with horrid conditions.",
                  "score": 1,
                  "created_utc": 1745710848.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mp54au1",
              "author": "blazze_eternal",
              "body": "I won't get too political, but they're having the exact effect this administration wants, which is why there are no exemptions for parts or even raw materials. Let's take a coffee shop for instance. There is absolutely no way move all operations for growing the plants to the US due to climate, and no exemptions have been put in place for coffee beans.\n\nTariffs are meant to be a precision tool to bolster a specific industry, not a blanket sales tax.",
              "score": 46,
              "created_utc": 1745673593.0,
              "replies": [
                {
                  "id": "mp6z6py",
                  "author": "daCampa",
                  "body": "Your last line says it all. They're meant to be a precision tool and not a blanket sales tax.\n\n\nAnd they're being applied as a blanket sales tax depending only on country of origin.",
                  "score": 32,
                  "created_utc": 1745694929.0,
                  "replies": []
                },
                {
                  "id": "mp5bcwe",
                  "author": "Blue-Thunder",
                  "body": "Except he is using it as a blanket sales tax as he used ChatGPT to make his tariff policy..",
                  "score": 43,
                  "created_utc": 1745676123.0,
                  "replies": []
                },
                {
                  "id": "mp8klwx",
                  "author": "twigboy",
                  "body": "Consolidation of American businesses. Kill off the new and small companies, bigger companies will swoop in and take over.",
                  "score": 6,
                  "created_utc": 1745714579.0,
                  "replies": [
                    {
                      "id": "mpda2fh",
                      "author": "LordOverThis",
                      "body": "You mean private equity will swoop in.",
                      "score": 1,
                      "created_utc": 1745784571.0,
                      "replies": [
                        {
                          "id": "mpdoi7h",
                          "author": "jamesdukeiv",
                          "body": "Eventually they’ll run out of companies to bundle debt into, and then what?",
                          "score": 3,
                          "created_utc": 1745789025.0,
                          "replies": [
                            {
                              "id": "mpehhfg",
                              "author": "LordOverThis",
                              "body": "I’ve spent a lot of time contemplating that.   Like, there are a finite number of companies that can be ruined and market spaces that can be killed…and what comes after that?\n\nI’m not sure they actually have a plan.  They’re almost underwear gnomes incarnate:  1) ruin companies; 2) profit; 3) ????",
                              "score": 2,
                              "created_utc": 1745798835.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mp9ao3j",
          "author": "None",
          "body": "[deleted]",
          "score": -3,
          "created_utc": 1745724872.0,
          "replies": [
            {
              "id": "mp9vwq9",
              "author": "MadBullBen",
              "body": "If the product cannot be made in the USA what do you want them to do? Can't setup a manufacturing plant as that's many millions which they don't have.\n\nThey have got an office, they ordered custom parts that are made specifically for them, did all the R&D, deal with support etc. \n\nThat also means that Nvidia, AMD, Apple and many other American companies are not American.",
              "score": 3,
              "created_utc": 1745735760.0,
              "replies": []
            },
            {
              "id": "mp9oxas",
              "author": "jc-from-sin",
              "body": "Yes.",
              "score": 2,
              "created_utc": 1745731766.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp7ptbb",
          "author": "mr_ji",
          "body": "American companies buying cheap shit from overseas and marking it up are exactly who the tariffs are targeting.",
          "score": -31,
          "created_utc": 1745703687.0,
          "replies": [
            {
              "id": "mp81fc3",
              "author": "Programmdude",
              "body": "And americans who buy things that can't be grown/produced there (coffee, cpu's/etc), and americans who build things produced from raw material the US doesn't have (pretty much everything, including your cars).\n\nThe tariffs aren't targeting anything, they're hitting every part of your economy at once, except for the very rare thing that is wholly 100% US based. Not even your agriculture is like that, since both fertiliser and farm equipment would be hit by tariffs.\n\nIt's essentially just a tax on every good that the US people pay for.",
              "score": 28,
              "created_utc": 1745707668.0,
              "replies": [
                {
                  "id": "mp9i0mi",
                  "author": "None",
                  "body": "[removed]",
                  "score": -27,
                  "created_utc": 1745728216.0,
                  "replies": [
                    {
                      "id": "mp9vcz5",
                      "author": "MadBullBen",
                      "body": "Explain then...Not everything can be made in the USA, and due to the lack of industry that's a 2 year minimum plan to setup manufacturing plus LOTS of money, most companies don't have that safety zone. You're literally on a post with a USA business that can no longer sell in the USA, and their CURRENT profit margin without tariffs on a $140 case is $5 because they are building market share, after tariffs they lose $95 on every sale... They also explained that only 3 manufacturers can even build their cases....",
                      "score": 7,
                      "created_utc": 1745735434.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp8cw6l",
              "author": "TheAlbinoAmigo",
              "body": "You cannot *make* a PC without cheap Chinese shit.\n\nWhere do you think all the basic componentry for a motherboard is made? Where in the US can a mobo manufacturer get all the plastics, PCBs, caps, coolers, ports and sockets from?\n\nOh, yeah, you *can't* do that in the US without driving the cost up to an absurdly prohibitive degree, and even then you aren't going to be doing it at scale for several years. \n\n'Stop using Chinese shit' is *not* a valid response to this.",
              "score": 16,
              "created_utc": 1745711663.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mp4jhlf",
      "author": "sithelephant",
      "body": "I strongly recommend the Gamers Nexus two hour video interviewing various people in the supply chain (including Hyte) \n\nhttps://www.youtube.com/watch?v=1W_mSOS1Qts \n\nThis goes into the details including remarkable access from some vendors, and why 'just build in america' isn't a practical option.\n\nTo keep the price the same, some vendors would have to basically go from making a 5% margin on sales, to a 60%+ loss on each unit.\n\nAn especially fun fact is that companies who do not manufacture much in the US, and have limited exposure in the US may be better able to maintain prices in the US by cross-subsidising from unaffected markets, whereas assemblers in the US have no option to do this. \n\nThe one vendor who had substantially moved production to US/canada began doing this _12_ years ago.",
      "score": 835,
      "created_utc": 1745664376.0,
      "replies": [
        {
          "id": "mp5lyxm",
          "author": "flatroundworm",
          "body": "Imagine being a US manufacturer trying to sell your product *outside the USA* now - you are paying massive tariffs on all your inputs and then trying to sell to Canadians that can buy from your non-American competition tariff free, plus your finished product may get hit by retaliatory tariffs upon entering Canada.",
          "score": 104,
          "created_utc": 1745679598.0,
          "replies": [
            {
              "id": "mp6qoph",
              "author": "Lusankya",
              "body": "As a Canadian, I'm not sure you appreciate how hostile a lot of our consumer base has become to American goods.  I can't paint the entire country with a single brush, but a *lot* of us are buying more expensive options to avoid sending any of our hard-earned money over the 49th.\n\nThere's definitely a \"buy Canada\" sentiment, but the primary motivation is \"buy anything but American.\" Your goods are becoming radioactive in our market.\n\nWe're not (yet) trariffing computer cases specifically, but we are trariffing assembled conputers and powered computer components at the same 25% the US hit us with.",
              "score": 94,
              "created_utc": 1745692209.0,
              "replies": [
                {
                  "id": "mp7ocs7",
                  "author": "CommodoreAxis",
                  "body": "I noticed something pretty telling when they restocked the “Proudly Made in Michigan USA” pretzels at the store. The store had received a shipment that was clearly for Canadian export, because it had the whole English label repeated in an unintelligible language on the front. Normally things are only in English or *maybe* Spanish where I’m at. \n\nI’d bet they saw the writing on the wall that selling something with “Proudly Made in Michigan USA” on the front of the package wouldn’t fly with the Canadians right now.",
                  "score": 18,
                  "created_utc": 1745703202.0,
                  "replies": [
                    {
                      "id": "mpaj2re",
                      "author": "SteveHeist",
                      "body": "That \"unintelligible language\"... was probably French.",
                      "score": 6,
                      "created_utc": 1745750149.0,
                      "replies": [
                        {
                          "id": "mpankg4",
                          "author": "Agouti",
                          "body": "Psh don't be silly, the French are a myth",
                          "score": 3,
                          "created_utc": 1745752621.0,
                          "replies": [
                            {
                              "id": "mpao23d",
                              "author": "SteveHeist",
                              "body": "I mean, yeah, the French *people* are a myth. The pretzels were headed to Quebec though which very much is a real place :D",
                              "score": 3,
                              "created_utc": 1745752878.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mpck36r",
                          "author": "CommodoreAxis",
                          "body": "Quebec is not real it cannot hurt me",
                          "score": 1,
                          "created_utc": 1745776508.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mp6r1dq",
                  "author": "flatroundworm",
                  "body": "Oh I’m also Canadian and wouldn’t buy USA made goods ever again unless there are literally zero alternatives or the USA has a full on revolution\n\nEdit: just saying the tariffs make us manufacturing hilariously uncompetitive even if you don’t care about politics - trump already killed the last American beer keg manufacturer with them last term.",
                  "score": 31,
                  "created_utc": 1745692317.0,
                  "replies": []
                },
                {
                  "id": "mp773qy",
                  "author": "RailGun256",
                  "body": "im American and im following this sentiment. not that big of a loss either. our domesric goods were never anything to write home about in the first place.",
                  "score": 2,
                  "created_utc": 1745697557.0,
                  "replies": [
                    {
                      "id": "mp7xdhl",
                      "author": "Lusankya",
                      "body": "Personally, it's not a big impact to me either. Apples are apples, flour is flour, toilet paper is toilet paper. I'm fortunate that I can pay an extra dollar for the package with the maple leaf on it.l without a second thought.\n\nBut professionally, these tariffs are maddening. Some of your industrial goods are top-shelf shit that I love working with.\n\nIt's frustrating that I have to settle for poor solutions using substandard gear from non-American vendors, as my clients won't let me use American parts any more.",
                      "score": 7,
                      "created_utc": 1745706270.0,
                      "replies": [
                        {
                          "id": "mp9wfm8",
                          "author": "MadBullBen",
                          "body": "Depending on the industrial goods, quite a few European goods are top quality too, although not sure about shipping time and cost.",
                          "score": 3,
                          "created_utc": 1745736072.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpaj117",
              "author": "SteveHeist",
              "body": "The video goes over Hyte's pricing structure in great detail, down to their margins (kudos to them for opening up that piece of info). They're getting hit with all these tariffs, and they physically \\*cannot afford\\* to sell them in the US. for a $100 case they're down something like $200.\n\nMoving shipments to Canada is likely 2 parts \"we can sell them at a $5 profit versus a $200 loss\" to 1 part \"well... if - and it's a big ***IF*** \\- the Trump White House gets it's head out of it's ass regarding tariffs, we can bring them into the US from Canada more easily than basically anywhere else\".",
              "score": 3,
              "created_utc": 1745750121.0,
              "replies": []
            },
            {
              "id": "mp9gabv",
              "author": "chronocapybara",
              "body": "Don't count on Canadians buying American for a while. Trump has us circling the wagons.",
              "score": 5,
              "created_utc": 1745727396.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp4kgbp",
          "author": "ChucklesInDarwinism",
          "body": "Yeah I watched it two days ago. impressive work by these guys and a lot of uncertainty for all those companies.",
          "score": 135,
          "created_utc": 1745664907.0,
          "replies": [
            {
              "id": "mp5yy4c",
              "author": "ThePrussianGrippe",
              "body": "It’s almost as if extreme instability is bad for economies.",
              "score": 59,
              "created_utc": 1745683675.0,
              "replies": []
            },
            {
              "id": "mp6tkye",
              "author": "DokMabuseIsIn",
              "body": "“‘We try to reroute them to different countries, different regions,’ one Hyte director says. ‘Currently, we are focusing on the EMEA region because we’re not bringing any product into the United States because of these tariffs.’”\n\nThis point is under-appreciated.  China still has large excess production capacity across multiple industries.\n\nIf the rich US market remains closed, China will need to dump the excess production in other markets — including developing countries — thus pushing them towards deindustrialization.",
              "score": 17,
              "created_utc": 1745693109.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp4lsrq",
          "author": "ChoMar05",
          "body": "Why would a company that isn't deep in the US market cross-subsidy its US business? Maybe to gain market share and increase its US Marketpenetration. But if you were leading a business, would you do that? When you can only plan until the president has the next bad game of golf? More likely, everyone that can afford to leave the US Market will do so if it's no longer profitable.",
          "score": 50,
          "created_utc": 1745665627.0,
          "replies": [
            {
              "id": "mp4zcnt",
              "author": "ArchusKanzaki",
              "body": "The thing that Trump is betting, is that every business want access to US consumers and US market, which is sorta true. US consumers have propensity to be able to both afford and willing to pay for more high-quality, expensive stuffs. Especially for PC customers, not many countries able to have as many enthusiasts with deep pockets as US market. If you go down the list of countries with big populations, see how many countries that both have the same income level, and similar population size.\n\nHowever, it is also true that companies may just up and go away from US, especially if those enthusiasts are driven out-of-market and no longer buying stuffs anyway. As much as US have lots of deep-pocket enthusiasts.... I don't think any US customers are prepared to pay 700$ for what used to be 300$ case. The thing is, nobody can forecast what will happen when the president does not have ironclad plan, or even ironclad will, so the best option is to literally just stand still until things happen, which like others have been saying, will cause another COVID-level shortages with companies stop shipping stuffs to US, driving local prices up, increasing inflation.",
              "score": 47,
              "created_utc": 1745671693.0,
              "replies": [
                {
                  "id": "mp5fwpi",
                  "author": "Durzel",
                  "body": "Problem is his bet is simplistic. They will want US market access, but not if it means losing money for the foreseeable future. If they don’t have the means to eat the tariffs burden for the next - 15 years or so - while companies try and replicate what exists in Shenzhen (end to end supply chain), then they have no choice. It’s either that or go out of business.\n\nTrump should’ve looked into subsidising these industries moving to the US, which would still be a decade+ long process, but he’s all stick - no carrot.\n\nIn the GN Hyte were remarkably candid about their razor thin margins. The way it was presented they’d have to increase the price of some of their stuff by 100% just to make the same amount of single digit dollar margin, post tariffs. They correctly realised that consumers aren’t going to tolerate that.",
                  "score": 42,
                  "created_utc": 1745677648.0,
                  "replies": [
                    {
                      "id": "mp5rozb",
                      "author": "Serialtoon",
                      "body": "I think Hyte showed all their cards because they are done with the US market and no longer care about that exposure. They seem very much ready to abandon it in favor of the rest of the world not run by a god damn toddler",
                      "score": 31,
                      "created_utc": 1745681402.0,
                      "replies": [
                        {
                          "id": "mp7vw3n",
                          "author": "Curious-Ebb-8451",
                          "body": "Probably the opposite. I think they DO care about the exposure and want to get more people informed that these tariffs are hurting US businesses. So that it doesn’t stay in place.",
                          "score": 10,
                          "created_utc": 1745705748.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mp50qac",
                  "author": "qtx",
                  "body": "> . US consumers have propensity to be able to both afford and willing to pay for more high-quality, expensive stuffs. Especially for PC customers, not many countries able to have as many enthusiasts with deep pockets as US market. \n\nThat's not really true though. Electronics are a lot cheaper in the US by default, that's why it may appear to be true that they buy more but if it were on the same level as other countries there wouldn't be much of a difference.",
                  "score": 17,
                  "created_utc": 1745672239.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mp4osmh",
              "author": "sithelephant",
              "body": "As you say, to gain market share, or at least be around in the US once the tarrifs get cancelled and your competitors have died.\n\nThe US is a large market. Maintaining access to this market is worth a fair bit. Especially if as a global corporation you can say fuckit and ship the products made in china to europe, instead of the US, and ship all your other factories products to the US, attracting only mild tarriff.\n\nBuut, your US based competitors who are largely reliant on china and have no existing relationship with other countries factories face extreme problems starting production in (say) India, versus someone who is already there, and has relationships with factories.",
              "score": 24,
              "created_utc": 1745667122.0,
              "replies": []
            },
            {
              "id": "mp5gv7o",
              "author": "NextWhiteDeath",
              "body": "It is a low risk way of growing market share. If you make a 1000 case but only sell 30 in the US then not increasing prices doesn't cost you a lot. At the same time you are now the price competative option in the market because you didn't raise prices while more exposed companies had to. Not raising prices only becomes expensive when you have grown your market share by which point you can increase prices like everyone else and stll be bigger then before.",
              "score": -1,
              "created_utc": 1745677964.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp65zy9",
          "author": "Spara-Extreme",
          "body": "There was a fascinating video by Silca where they basically stated that they had to stop building bicycle pumps in the US from the tariffs of the 1st administration because it was just cheaper to import from Asia then build in the US (at the time, aluminum imports were tariffed).\n\nNow, they just stopped importing stuff altogether.",
          "score": 11,
          "created_utc": 1745685909.0,
          "replies": []
        },
        {
          "id": "mp4mbb3",
          "author": "technoez",
          "body": "Thanks Steve",
          "score": 16,
          "created_utc": 1745665893.0,
          "replies": [
            {
              "id": "mp4vqvr",
              "author": "lechechico",
              "body": "Back to you Steve",
              "score": 16,
              "created_utc": 1745670219.0,
              "replies": [
                {
                  "id": "mp5fdmu",
                  "author": "Relevant-Doctor187",
                  "body": "I wonder if we all keep blaming Steven miller for the tariffs, Trump would fire him.",
                  "score": 1,
                  "created_utc": 1745677475.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mp51q0t",
          "author": "RottenPingu1",
          "body": "I like that you can extrapolate it to anything. Cars, boats, medical equipment...any multi component item. ..and that's frightening.\n\nHave an award.",
          "score": 7,
          "created_utc": 1745672620.0,
          "replies": []
        },
        {
          "id": "mp5urji",
          "author": "Small_Editor_3693",
          "body": "It’s literally in the article. What are you talking about",
          "score": 2,
          "created_utc": 1745682361.0,
          "replies": []
        },
        {
          "id": "mp7se0q",
          "author": "ScienceAndLience",
          "body": "This is 3 hours",
          "score": 1,
          "created_utc": 1745704561.0,
          "replies": []
        },
        {
          "id": "mpa60sx",
          "author": "None",
          "body": "[removed]",
          "score": 1,
          "created_utc": 1745741906.0,
          "replies": [
            {
              "id": "mpa6pfu",
              "author": "sithelephant",
              "body": "Only for export to countries with newly introduced retaliatory tarrifs.",
              "score": 1,
              "created_utc": 1745742336.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp6eg0t",
          "author": "luna-luna-luna",
          "body": "> two hour video\n\nnah im good, i understand how tariffs work",
          "score": -17,
          "created_utc": 1745688488.0,
          "replies": [
            {
              "id": "mp6shpi",
              "author": "VikingBorealis",
              "body": "It's worse. It's two hours of the most monotone drab voice on the internet of a person that couldn't sound interested in what he's talking about if it was his job... Oh wait... It is... \n\nHe desperately needs an on camera person\n\nAlso an editor to cut down his rants into the essential  5-10%",
              "score": -14,
              "created_utc": 1745692768.0,
              "replies": [
                {
                  "id": "mp756fo",
                  "author": "luna-luna-luna",
                  "body": "Oh man, 2 hours is longer than most movies and for it to be filled with that? That’s crazy lol just make separate videos of each interview.",
                  "score": -10,
                  "created_utc": 1745696921.0,
                  "replies": [
                    {
                      "id": "mp9xgar",
                      "author": "MadBullBen",
                      "body": "There's time stamps, if you're interested in a certain interview, skip to it.... No need to watch it all in one big lump either. Having separate videos would be really annoying.",
                      "score": 2,
                      "created_utc": 1745736681.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mp5iiol",
          "author": "None",
          "body": "[removed]",
          "score": -50,
          "created_utc": 1745678498.0,
          "replies": [
            {
              "id": "mp5jsmi",
              "author": "sithelephant",
              "body": "I note the last line. \n\nA long planned careful move can work. A sudden urgent need to make cases in the US with several weeks warning, and no certainty that the tarrifs will be here by November, never mind when the production actually gets started, in an industry where there is not massive amounts of capital or profit sloshing around - well, no.",
              "score": 28,
              "created_utc": 1745678909.0,
              "replies": []
            },
            {
              "id": "mp5zn0p",
              "author": "bal00",
              "body": "From an interview with the Formlabs CEO:\n\n> Max Lobovsky runs Formlabs, a Somerville company that sells a range of 3-D printers that can crank out prototypes and finished products in a range of materials. The lowest-end models sell for $3,500. The printers are made in China, with key components made in Vietnam. \n>\n>...\n>\n> To envision moving production of Formlabs’ sophisticated 3D printers to the U.S., Lobovsky says that it would require “millions of jobs worth of activity, and massive industrial infrastructure has shifted to the U.S. That’s Trump and other peoples’ goal. **But that would take decades. China could do it in five years. In America, it would take 20 years if we got serious about it.**”\n\nThere's also a world of difference between manufacturing a $3500+ device where a significant amount of value is in the R&D vs. making a $100 metal case where the cost of materials and labor is the most important factor.",
              "score": 30,
              "created_utc": 1745683893.0,
              "replies": [
                {
                  "id": "mp60e80",
                  "author": "None",
                  "body": "[removed]",
                  "score": -32,
                  "created_utc": 1745684134.0,
                  "replies": [
                    {
                      "id": "mp624gv",
                      "author": "bal00",
                      "body": "How would that help? The technology isn't suitable for cheap volume manufacturing, nor does it help you with everything else that goes into making a PC case, such as the metal work, glass, screws, machining etc.",
                      "score": 30,
                      "created_utc": 1745684681.0,
                      "replies": []
                    },
                    {
                      "id": "mpeh6dz",
                      "author": "Tobi97l",
                      "body": "Great now you would produce cases with a lesser quality at triple the cost or probably even more.",
                      "score": 1,
                      "created_utc": 1745798724.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mp4rnfc",
      "author": "thebenson",
      "body": "It's really going to suck once the current stock of items already in the U.S. runs out.\n\nIf the tariffs aren't removed, Americans aren't going to be doing any spending on non-necessary items for the foreseeable future.",
      "score": 106,
      "created_utc": 1745668444.0,
      "replies": [
        {
          "id": "mp50vdq",
          "author": "ArchusKanzaki",
          "body": "Oh, the thing is that it WILL suck already. Every company that cannot afford express shipping (like how Apple chartered airplanes to bring in 600 tons of iphone), is already stopping further order and stopping further shipping, because they cannot afford to suddenly needing to pay few tens of thousands when the goods arriving to port. That's the stock of goods that is supposed to come 3-6 months later based on each store's projection on when they will need goods. Think of COVID shortage, except self-inflicted now. \n\nAnd the worst thing is that, nobody knows how to price things right now, because the rates might change again, but if its pre-order then you will need to honor the prices you set or else you are just cheating customers. The \"brilliant tactic\" is just killing everyone right now.",
          "score": 49,
          "created_utc": 1745672294.0,
          "replies": [
            {
              "id": "mp76c6c",
              "author": "guisar",
              "body": "Can confirm… Our distributors and suppliers are doing the same.   I have no idea (minimum 90 days) how soon wells be able to “get our stuff” even if the tariffs are moved back to 10%.",
              "score": 6,
              "created_utc": 1745697304.0,
              "replies": []
            },
            {
              "id": "mp5vlqd",
              "author": "Ajreil",
              "body": " If companies believe that prices will double in a few months, they have a strong incentive to keep as much unsold inventory as possible. Just the threat of tariffs will send prices through the roof.",
              "score": 8,
              "created_utc": 1745682623.0,
              "replies": [
                {
                  "id": "mp60f3d",
                  "author": "ArchusKanzaki",
                  "body": "Nah, if the problem is just that price will double but they can still sell the products, companies will still ship products to US. They will just double the price, and expect customer to just deal with it.\n\nThe bigger problem is that.... Companies do not expect that customers will even be willing to buy and pay for the product, even if they ship it to US and pay the tariff cost. Nobody will pay 700$ for something like Hyte Y70. Customers will just not spend instead, so Hyte will be losing money on those cases they have paid upfront to import to US, and also needing to pay the warehousing cost. Stockpiling is not free. \n\nAnd the problem with the current tariff implementation is that, nobody really knows what the end goal is. If its bringing manufacturing back, then it will need to stay for long while because nobody setup factory and supply chain in a year or 2. If its punishing countries and extracting favorable deals (so maybe just wanting China or other countries to buy more stuffs), then tariff might not be in place for long. If the goal is to crash the US economy intentionally to refinance debts (as I recently heard some ppl were saying), then the tariff might be in place for long time too.... Each reasoning will make companies move in different way and since nobody knows, the only option for company is to just stand still, hoard as much cashflow as possible to sustain business, sold the remaining inventory and hope that they do not need to close shops 3-6 months later when they have nothing to sell.",
                  "score": 12,
                  "created_utc": 1745684141.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mp6897c",
              "author": "Missus_Missiles",
              "body": "Gut feel, apple will start charter air-freight. Chain of custody for a fast turn flight across the Pacific is much tighter than sitting on a cargo container for a few weeks, through various ports.",
              "score": 2,
              "created_utc": 1745686605.0,
              "replies": [
                {
                  "id": "mp6am3y",
                  "author": "ArchusKanzaki",
                  "body": "I think Tim Cook will be faster paying for more dinner with Trump (or buy TrumpCoin?) and get exemption instead of paying for chartered air freight. Cargo containers are slow, but it carries bunch of stuffs, and its the reason why individual shipping cost can be \"negligible\" in terms of overall product pricing, when the materials came from multiple different sources. Its one of the reason why globalization works",
                  "score": 2,
                  "created_utc": 1745687327.0,
                  "replies": [
                    {
                      "id": "mpf1ypa",
                      "author": "Missus_Missiles",
                      "body": "You seem to think they used sea freight to ship to the USA in the past. It's always been air.",
                      "score": 1,
                      "created_utc": 1745806427.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mp7myyr",
          "author": "DracoAdamantus",
          "body": "And the companies that this hurts the most are the small business, mom and pop shops. I’ve seen no less than 5 vendors that I absolutely love say that they’ll be shutting down in the next few months because they won’t be able to afford the tariffs.",
          "score": 9,
          "created_utc": 1745702735.0,
          "replies": []
        },
        {
          "id": "mp5jtwz",
          "author": "superduperpuppy",
          "body": "Even if tarrifs are removed, it's hard to see the global trade order going back to normal since U.S is now proving to be such a shitty business partner. Lots of intercontinental countries are trying to strike deals with each other that excludes the U.S.",
          "score": 12,
          "created_utc": 1745678920.0,
          "replies": [
            {
              "id": "mp65a5j",
              "author": "Proot65",
              "body": "Make no mistake. This is devastating for the entire global market, but this is all that can be done. Make hay elsewhere.\n\nIt’ll hurt the US the most though. Economically and reputationally.",
              "score": 5,
              "created_utc": 1745685685.0,
              "replies": []
            },
            {
              "id": "mp9um3y",
              "author": "mok000",
              "body": "In any case, even if the tariffs are completely revoked, trading with US will represent a greater risk meaning prices will be higher.",
              "score": 1,
              "created_utc": 1745734993.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp53ie4",
          "author": "quats555",
          "body": "Given our job market and the constant federal layoffs on top of that, a lot of America won’t be spending much of anything on non-necessary items regardless of tariffs.",
          "score": 8,
          "created_utc": 1745673299.0,
          "replies": []
        },
        {
          "id": "mp5589q",
          "author": "blazze_eternal",
          "body": "Many great US based small to medium businesses are going to go bankrupt. Really sad.",
          "score": 9,
          "created_utc": 1745673939.0,
          "replies": []
        },
        {
          "id": "mpa1v3m",
          "author": "akeean",
          "body": "Let's look back at how US consumers reacted to toilet paper purchases being restricted to 1 pack of several dozen rolls per purchase.\n\nThis will be so much worse. I bet they are banking on it to declare a national emergency to give Trump some additional powers \"to restore order\".",
          "score": 2,
          "created_utc": 1745739359.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp4jbn6",
      "author": "Tribolonutus",
      "body": "That orange monkey is so stupid it’s just hard to believe… and he’s a president of the USA! That is just astounding…",
      "score": 174,
      "created_utc": 1745664281.0,
      "replies": [
        {
          "id": "mp4ofge",
          "author": "RazorLou",
          "body": "He’s a Russian asset first and the President of the USA second. And honestly, as a Russian asset he’s been doing an incredible job.",
          "score": 106,
          "created_utc": 1745666947.0,
          "replies": [
            {
              "id": "mp54uia",
              "author": "None",
              "body": "A huge bunch of people in these type of subreddits voted for a convicted felon pathological lying rapist just because it might make their PC games less woke 😂 incels that will never get laid if their life depended on it. And these tariffs are just small a part of his insanity.",
              "score": 72,
              "created_utc": 1745673797.0,
              "replies": [
                {
                  "id": "mp58js8",
                  "author": "AscenDevise",
                  "body": "They could swap to Linux; that would give them a new / whenever they distro-hop.",
                  "score": 6,
                  "created_utc": 1745675145.0,
                  "replies": [
                    {
                      "id": "mp5yss5",
                      "author": "rivalary",
                      "body": "I don't know what a new / means, but I'd imagine that most people that are into Linux are not Republican. They're trying to escape being under Microsoft's thumb, which is a lot like being under Trump's rule.",
                      "score": 8,
                      "created_utc": 1745683629.0,
                      "replies": [
                        {
                          "id": "mp648x3",
                          "author": "AscenDevise",
                          "body": "That is known as 'root'. They could get their root multiple times a day, in fact. You make a very good point, however.",
                          "score": 5,
                          "created_utc": 1745685358.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mp5e4sa",
              "author": "EducationalNinja3550",
              "body": "He’s the the archetype of the loud ugly american. He was elected *twice* by the americans.\n\nIf he’s a russian asset, that means the entire us military and intelligence community were too inept to stop a third-rate power from infiltrating the country. Either way, the problem is the americans",
              "score": 22,
              "created_utc": 1745677064.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp4y15q",
          "author": "SniperPilot",
          "body": "Nah he’s not the president, he’s the king.",
          "score": -48,
          "created_utc": 1745671160.0,
          "replies": [
            {
              "id": "mp50dcp",
              "author": "Tribolonutus",
              "body": "He is the king of his toilet. (Picture that in your head, or use ai to generate)",
              "score": 12,
              "created_utc": 1745672097.0,
              "replies": []
            },
            {
              "id": "mp7m3dh",
              "author": "-Badger3-",
              "body": "Sic semper tyrannis",
              "score": 2,
              "created_utc": 1745702436.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mp8cnmf",
      "author": "FromSwedenWithHate",
      "body": "I am curious what will happen when the current electronics imported to the US are running out. China has already blocked all rare resource exports to the US, so what is the long term plan here according to the Trumpet? No rare earth resources, no electronics. Ukrainian rare earth metals? Ruzzia will make sure to bomb that.\n\nTrump want products to be produced in the US, but they don't have any of the resources available on their own soil? For a business man, Trumps stupidity shines through.. and it's hard to believe this man ever did anything productive in his life.\n\nOh well, more electronics for everyone else. Perfect.",
      "score": 11,
      "created_utc": 1745711577.0,
      "replies": [
        {
          "id": "mp9v543",
          "author": "mok000",
          "body": "US retailers are about to make orders for the Christmas shopping. And they don't know what the tariffs are going to be when those goods arrive, and consequently can't predict what the price will be for those Christmas presents.",
          "score": 3,
          "created_utc": 1745735304.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp589g6",
      "author": "aridneptune",
      "body": "Thanks Trump!",
      "score": 35,
      "created_utc": 1745675044.0,
      "replies": [
        {
          "id": "mp65kgl",
          "author": "Proot65",
          "body": "See. That was easy. Now you personally have peace with Russia.",
          "score": 9,
          "created_utc": 1745685774.0,
          "replies": [
            {
              "id": "mp6cxim",
              "author": "PaulR79",
              "body": "I don't see a suit in their reply.",
              "score": 5,
              "created_utc": 1745688026.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mp4ltre",
      "author": "Drtardis95",
      "body": "This will probably be the start of many more to come in the field.",
      "score": 16,
      "created_utc": 1745665641.0,
      "replies": []
    },
    {
      "id": "mp6wyw6",
      "author": "smackythefrog",
      "body": "The bum responsible for this wants to run again in 2028 lol",
      "score": 11,
      "created_utc": 1745694199.0,
      "replies": [
        {
          "id": "mp9hv2r",
          "author": "dfighter3",
          "body": "no, he wants to not have to run in 2028.",
          "score": 0,
          "created_utc": 1745728147.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp4k1rf",
      "author": "None",
      "body": "[removed]",
      "score": 61,
      "created_utc": 1745664686.0,
      "replies": [
        {
          "id": "mp5hpbo",
          "author": "Thoas-",
          "body": "What have sony done ?",
          "score": 8,
          "created_utc": 1745678236.0,
          "replies": [
            {
              "id": "mp5jgms",
              "author": "superduperpuppy",
              "body": "I think they're referring to how Sony is supposedly raising prices everywhere except the U.S to protect that country's market since they're supposedly a much larger. Even if the U.S is what caused this mess in the first place.",
              "score": 27,
              "created_utc": 1745678801.0,
              "replies": [
                {
                  "id": "mp5l3cw",
                  "author": "Thoas-",
                  "body": "Ah ok, shit move by Sony. Thanks for the information.",
                  "score": 11,
                  "created_utc": 1745679320.0,
                  "replies": [
                    {
                      "id": "mp6dh9o",
                      "author": "PaulR79",
                      "body": "Very. A new *digital-only* PS5 in the UK currently costs more than I paid for my disc-based PS5 1½ years ago.",
                      "score": 15,
                      "created_utc": 1745688192.0,
                      "replies": [
                        {
                          "id": "mpei1z8",
                          "author": "Tobi97l",
                          "body": "I bought a ps5 day one for 500€. The digital ps5 has now risen to the same price almost 5 years later.\nNormally electronics are getting cheaper over time not more expensive...",
                          "score": 2,
                          "created_utc": 1745799049.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mp6zasg",
                  "author": "Vlad_Yemerashev",
                  "body": "So far, it hasn't hit the point yet where we are seeing things like \"Sony now stopping all PS5 shipments to the US\" or \"China tells Microsoft it will no longer ship xbox consoles to the US\" or \"Nintendo cancels the Switch 2 release in the US until further notice - citing tafiffs.\"\n\nWhen *those* kinds of products are no longer being shipped, people will pay way more attention. Your average layman has not heard of of Hyte, or the various other lesser well-known companies that serve niche hobbies and interests, stopping shipments to the US. When big brand names with universal recognition follow suit, it will really turn up the heat.",
                  "score": 5,
                  "created_utc": 1745694966.0,
                  "replies": [
                    {
                      "id": "mp7qwlp",
                      "author": "lew_rong",
                      "body": "asdfasdf",
                      "score": 7,
                      "created_utc": 1745704055.0,
                      "replies": [
                        {
                          "id": "mp88o6x",
                          "author": "Vlad_Yemerashev",
                          "body": "It's less about affordability and more about if it's even flat out available for any price in the first place. There comes a point on if hardware gets so prohibitively expensive that shipments stop alltogether.\n\nResult is the same in the end with people not being able to get it.",
                          "score": 1,
                          "created_utc": 1745710152.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mpa0sea",
      "author": "akeean",
      "body": "[GamersNexus has a feature ](https://www.youtube.com/watch?v=1W_mSOS1Qts)where they interview Hyte and a bunch of other vendors responding to the situation, some of them longtime competitors.\n\nOne of Hyte's most popular case only nets them $5, while amazon and other retailers make $20+ off it (since they take a % based split), they estimate that in order to maintain $5 profit off that case with various tariffs, that case would have to go up from $100 to more than double, netting retailers huge profits, since they keep taking the same % based split based on final price.\n\nSince the situation is comically volatile, with tariffs being announced, exempted and re-announced-but-double, they an other choose to just not send anything to the US and instead sell those goods elsewhere in the world for now, as they could end up making huge losses or burn their industry contacts.\n\nBuying PC components (and other imported stuff) in the US is gonna suck over the next 6+ months (even getting an RMA for defective goods might become an issue) and likely will have permanently gotten worse, no matter if the US can get their governmental clownage under control soon.",
      "score": 7,
      "created_utc": 1745738695.0,
      "replies": [
        {
          "id": "mpa3rup",
          "author": "beerm0nkey",
          "body": "Six plus months IF there is immediate capitulation and reversal by an extreme narcissist president!",
          "score": 3,
          "created_utc": 1745740524.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp5u7zh",
      "author": "Intol3rance",
      "body": "Thanks Trumpanzee.",
      "score": 12,
      "created_utc": 1745682190.0,
      "replies": []
    },
    {
      "id": "mp5p3w7",
      "author": "jedidude75",
      "body": "[I did that](https://media4.giphy.com/media/v1.Y2lkPTc5MGI3NjExaXBwOWhmMXR4N2txdWZ5MG9uYTFqZHl0cGdndm1zMmEyb2hrN2F6eCZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/I3WAJgc0J61Xxkff5o/giphy.gif)",
      "score": 6,
      "created_utc": 1745680588.0,
      "replies": []
    },
    {
      "id": "mp67c1m",
      "author": "KingJTheG",
      "body": "NOOOO. I just fell to my knees in a Costco. I mean, I’m not currently building a PC but their products are so good",
      "score": 6,
      "created_utc": 1745686321.0,
      "replies": []
    },
    {
      "id": "mp7mhn6",
      "author": "Moorific",
      "body": "Had a feeling this would happen. Glad I upgraded my wife’s machine back in January",
      "score": 2,
      "created_utc": 1745702572.0,
      "replies": []
    },
    {
      "id": "mp8ty16",
      "author": "DamperBritches",
      "body": "They're going to have to wait it out and see what happens, as he changes his mind every 2 days or so",
      "score": 2,
      "created_utc": 1745718154.0,
      "replies": [
        {
          "id": "mpa3sox",
          "author": "beerm0nkey",
          "body": "Two minutes.",
          "score": 1,
          "created_utc": 1745740538.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpbstr5",
      "author": "letsgetregarded",
      "body": "Listen, you know you can pay trump instead. You pay trump personally a smaller amount. Then, boom, your company can be excluded from tariffs. You might be able to just publicly show support for trump. He doesn’t care about bringing money into the US. He only cares about his own personal gain.",
      "score": 2,
      "created_utc": 1745768233.0,
      "replies": []
    },
    {
      "id": "mpcnyyu",
      "author": "FlattenInnerTube",
      "body": "So much winning",
      "score": 2,
      "created_utc": 1745777687.0,
      "replies": []
    },
    {
      "id": "mp5nl7x",
      "author": "AtariAtari",
      "body": "The bots are in full force on this thread",
      "score": 7,
      "created_utc": 1745680108.0,
      "replies": [
        {
          "id": "mpa3zk5",
          "author": "beerm0nkey",
          "body": "Bots and little boys who can’t get laid because nobody wants to fuck a loser.",
          "score": 0,
          "created_utc": 1745740654.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp824ne",
      "author": "FGX302",
      "body": "I use one of those testbed frames. It's 15 years old. Just reuse an old case.",
      "score": 2,
      "created_utc": 1745707898.0,
      "replies": []
    },
    {
      "id": "mp6thq4",
      "author": "Alienhaslanded",
      "body": "Winning!",
      "score": 2,
      "created_utc": 1745693082.0,
      "replies": []
    },
    {
      "id": "mp9395q",
      "author": "xTomTom5",
      "body": "Damn I’ll need to pick mine up from microcenter tomorrow 😭",
      "score": 1,
      "created_utc": 1745721798.0,
      "replies": []
    },
    {
      "id": "mp95eo6",
      "author": "Bray_E",
      "body": "glad I bought my pc before this shit started happening",
      "score": 1,
      "created_utc": 1745722681.0,
      "replies": []
    },
    {
      "id": "mpd8ve3",
      "author": "S1DC",
      "body": "And it begins",
      "score": 1,
      "created_utc": 1745784198.0,
      "replies": []
    },
    {
      "id": "mpdx4qs",
      "author": "TheDkone",
      "body": "I am so glad i did a major upgrade at the beginning of the year.  no foresight, just dumb luck.",
      "score": 1,
      "created_utc": 1745791858.0,
      "replies": []
    },
    {
      "id": "mp8ngs9",
      "author": "shastaxc",
      "body": "Never heard of them",
      "score": -5,
      "created_utc": 1745715647.0,
      "replies": [
        {
          "id": "mp8x40j",
          "author": "rasz_pl",
          "body": "Means you dont have a desktop, or an ugly one.",
          "score": -8,
          "created_utc": 1745719368.0,
          "replies": [
            {
              "id": "mpa3v7f",
              "author": "beerm0nkey",
              "body": "You’re replying to a Cuck for Trump. Don’t waste your energy.",
              "score": 2,
              "created_utc": 1745740581.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mp55vmd",
      "author": "Cherry_Crusher",
      "body": "Never heard of them",
      "score": -59,
      "created_utc": 1745674179.0,
      "replies": []
    },
    {
      "id": "mp58a49",
      "author": "gundealsmademebuyit",
      "body": "Oh no…. Anyway",
      "score": -66,
      "created_utc": 1745675051.0,
      "replies": []
    },
    {
      "id": "mp80q1o",
      "author": "TreeChoppa8",
      "body": "Oh no! Now there are only 99,999 pc case sellers in the US!",
      "score": -13,
      "created_utc": 1745707431.0,
      "replies": [
        {
          "id": "mp9zh4h",
          "author": "MadBullBen",
          "body": "This is just one company and one example, there's going to be a lot more of that where this comes from.",
          "score": 2,
          "created_utc": 1745737895.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp4mzx4",
      "author": "None",
      "body": "[removed]",
      "score": -97,
      "created_utc": 1745666242.0,
      "replies": [
        {
          "id": "mp4qhm8",
          "author": "Roseking",
          "body": "I don't know if they were the first to do one, but in the past few years they had a case that had a diagonal corner that became pretty popular, as it was something different than just a square that most cases are.\n\nhttps://hyte.com/store/y60/cs-hyte-y60-ww",
          "score": 18,
          "created_utc": 1745667914.0,
          "replies": [
            {
              "id": "mp4r55w",
              "author": "Pilfercate",
              "body": "Maybe the first to mass produce one. Plenty of boutique manufacturers like lian li that does short runs of wild cases.",
              "score": -40,
              "created_utc": 1745668215.0,
              "replies": [
                {
                  "id": "mp51f7r",
                  "author": "OMGItsCheezWTF",
                  "body": "In the last few years Hyte have kind of become the goto for lots of these 'boutique' cases. They're pretty big these days.",
                  "score": 24,
                  "created_utc": 1745672505.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mp4plo2",
          "author": "Filter55",
          "body": "They make the y60 and y70 cases, which are probably their most well known products. You’ve probably seen them before if you browse any of the pc building subs.",
          "score": 37,
          "created_utc": 1745667501.0,
          "replies": [
            {
              "id": "mp4qgwx",
              "author": "Pilfercate",
              "body": "I think I've seen it once in a super cheap Costco deal posted on Reddit.  Thanks for the heads up.",
              "score": -67,
              "created_utc": 1745667905.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp4y063",
          "author": "None",
          "body": "[deleted]",
          "score": 51,
          "created_utc": 1745671150.0,
          "replies": [
            {
              "id": "mp55f8v",
              "author": "None",
              "body": "[removed]",
              "score": -52,
              "created_utc": 1745674011.0,
              "replies": [
                {
                  "id": "mp780sd",
                  "author": "Garconanokin",
                  "body": "Nice self own.",
                  "score": 7,
                  "created_utc": 1745697862.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mp51o7n",
      "author": "shart_of_destiny",
      "body": "I dont feel bad for them, sheet metal manufacturers are abundant around the world, they can ship ship there tooling to korea or the Philippines and be up and running again in a month. \n\nUnlike other companies whos supply chain is embedded deep in china.",
      "score": -71,
      "created_utc": 1745672601.0,
      "replies": [
        {
          "id": "mp663q8",
          "author": "Proot65",
          "body": "Methinks you’ve never done anything of substance before.",
          "score": 18,
          "created_utc": 1745685941.0,
          "replies": [
            {
              "id": "mpka0wh",
              "author": "noseshimself",
              "body": "He's certainly done substances before.",
              "score": 1,
              "created_utc": 1745880099.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp9ytdx",
          "author": "MadBullBen",
          "body": "In an interview, due to their design only 2/3 manufacturers in the world can make it which are all in china, most companies don't own any manufacturers or own any tooling at all, they do a deal with a existing factory and get them to make it as they already have everything needed.\n\nSo no, they cannot just simply move manufacturing to somewhere else....",
          "score": 1,
          "created_utc": 1745737494.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp57ueb",
      "author": "ChemicalHungry5899",
      "body": "We can 3d print cases locally if things get really bad, not too worried about PC cases when everything is made of glass VS the classic LIAN LI aluminum cases from about 10 years ago. In fact I would be more interested in buying a locally sourced 3d or metal printed case from some kids upstart anyways. Still sucks that the tarrifs are already having an affect though. Seriously if you haven't already start buying new tires, brake pads, medical equipment, soldering tips and important things you're going to need for the next few years asap as those items are going to become scarce soon! Basically anything that they didn't have in the last of us.",
      "score": -64,
      "created_utc": 1745674895.0,
      "replies": [
        {
          "id": "mp697vb",
          "author": "squary93",
          "body": "I can see your point but you forgot that 3d printers arent made from scratch in America as well and are as such, subject to tariffs too.\n\nIf a kid wanted to create something, the base costs of tools and materials is too high of a bar to entry. After all, a majority of Americans don't even have 1000 dollars as an emergency fund available.",
          "score": 16,
          "created_utc": 1745686900.0,
          "replies": []
        },
        {
          "id": "mp61pqk",
          "author": "its_always_right",
          "body": "Where are you going to get the material to 3d print the cases from? What about front panel IO electronics?",
          "score": 21,
          "created_utc": 1745684551.0,
          "replies": [
            {
              "id": "mpeivs9",
              "author": "Tobi97l",
              "body": "Let's start one step earlier. Where are you going to get a 3D Printer from...\nThey are not growing on trees in the US.",
              "score": 3,
              "created_utc": 1745799356.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp9zcpi",
          "author": "MadBullBen",
          "body": "Plastic 3d printing FDM is ugly and requires a lot of post processing and is slowing general, SLS 3d metal printing again is slow and expensive. Perfect for low volume expensive items, for good for mass production.",
          "score": 2,
          "created_utc": 1745737820.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp7cviu",
      "author": "LordOoPooKoo",
      "body": "🤣",
      "score": -5,
      "created_utc": 1745699438.0,
      "replies": []
    },
    {
      "id": "mp7aebh",
      "author": "Szriko",
      "body": "oh no, my doki case",
      "score": -7,
      "created_utc": 1745698642.0,
      "replies": []
    },
    {
      "id": "mp7jlvm",
      "author": "ChiefStrongbones",
      "body": "If we have to reuse our old PC cases, that's not the worst thing.",
      "score": -12,
      "created_utc": 1745701600.0,
      "replies": []
    }
  ]
}