{
  "post": {
    "title": "Acquisition sends thousands of Whistle pet trackers to IoT graveyard",
    "author": "diacewrb",
    "id": "1mdxtek",
    "score": 615,
    "created_utc": 1753957286.0,
    "selftext": "",
    "num_comments": 57,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1mdxtek/acquisition_sends_thousands_of_whistle_pet/"
  },
  "comments": [
    {
      "id": "n651drx",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1753957287.0,
      "replies": []
    },
    {
      "id": "n65eyc3",
      "author": "hudsoncider",
      "body": "They didn’t buy a company to expand their portfolio.\nThey bought a company to destroy their competition.",
      "score": 362,
      "created_utc": 1753963281.0,
      "replies": [
        {
          "id": "n65tfix",
          "author": "angeltay",
          "body": "This is what’s happening at my dad’s job rn. Their biggest competitor bought them out and got rid of all the extra features that made them stand out. The new owners will absolutely bleed clients but it doesn’t matter because they took out their enemy.",
          "score": 146,
          "created_utc": 1753968296.0,
          "replies": [
            {
              "id": "n679bq2",
              "author": "speculatrix",
              "body": "So your dad needs to form a new business and take all the best engineers and build something even better",
              "score": 43,
              "created_utc": 1753983056.0,
              "replies": [
                {
                  "id": "n67acun",
                  "author": "angeltay",
                  "body": "People they laid off from other companies after they bought them tried to do that, got sued for noncompete\n\nBut my dad knows that because that was his first thought haha",
                  "score": 23,
                  "created_utc": 1753983338.0,
                  "replies": [
                    {
                      "id": "n67bvg3",
                      "author": "Cav_vaC",
                      "body": "Move to California and the noncompete won’t be enforceable",
                      "score": 22,
                      "created_utc": 1753983752.0,
                      "replies": [
                        {
                          "id": "n67gtc9",
                          "author": "angeltay",
                          "body": "We’re already in California",
                          "score": 7,
                          "created_utc": 1753985091.0,
                          "replies": [
                            {
                              "id": "n67krnw",
                              "author": "Cav_vaC",
                              "body": "Then there’s no problem, noncompetes don’t exist in California no matter what the contract says",
                              "score": 30,
                              "created_utc": 1753986194.0,
                              "replies": [
                                {
                                  "id": "n67tkmj",
                                  "author": "lilroldy",
                                  "body": "Hell, even most states they dont hold up. Florida just passed some bullshit though ND made non-compete legal which is horse shit",
                                  "score": 14,
                                  "created_utc": 1753988699.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "n6b1g6d",
                              "author": "Tepigg4444",
                              "body": "REPORT THAT SHIT",
                              "score": 2,
                              "created_utc": 1754030217.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n67a3uk",
                  "author": "Coolbluegatoradeyumm",
                  "body": "💯 get in early and crush them",
                  "score": 7,
                  "created_utc": 1753983269.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n6ahre7",
              "author": "SupremeDictatorPaul",
              "body": "An alternate version of this is when a private equity firm buys the company, and then fires everyone not absolutely required to take money for the subscription service. They have zero interest in the long term of the company, their only goal is to squeeze all of the money out they can today, and let the company collapse once it can’t extract enough to make any more profit.",
              "score": 3,
              "created_utc": 1754020622.0,
              "replies": []
            },
            {
              "id": "n67kbwm",
              "author": "MR1120",
              "body": "That’s a next quarter problem.  Nevermind that shit.  Look at the line going up for this quarter!",
              "score": 1,
              "created_utc": 1753986072.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n65i5as",
          "author": "CampaignSure4532",
          "body": "This is the answer",
          "score": 29,
          "created_utc": 1753964459.0,
          "replies": []
        },
        {
          "id": "n6d3c8e",
          "author": "SkollFenrirson",
          "body": "Capitalism gonna capitalism.",
          "score": 1,
          "created_utc": 1754061207.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n654gn0",
      "author": "Whoisrefah",
      "body": "Not only this, but I’ve been a customer for 14 years with whistle.  I get an email last week telling me I have 45 days to migrate before they shut down.  \n\nNone of the whistle tacking history / achievements will migrate to Tractive.  There is NO way to archive or backup this data. \n\nWhats worse, all my Whistle dog trackers stopped updating location and activity on  the morning of July 29th, and the sync wheel just spins, but the collars never blink blue indicating a sync.  It’s like just shut off the backend without the 45 day grace period.  My subscription is still valid, just doesn’t work anymore.  Seems like Whistle told everyone to GTFO and walk away.\n\nwhistle was owned by M & M Mars.  They sure now how to piss off a long time customer.  Their communication is horrible around this acquisition.  \n\nFFS MARS and Tractive!",
      "score": 205,
      "created_utc": 1753958810.0,
      "replies": [
        {
          "id": "n65mngx",
          "author": "Zestyclose-Novel1157",
          "body": "I would send an email requiring a fix within 48 hours and then dispute the remaining value of the subscription when they don’t fix it.",
          "score": 77,
          "created_utc": 1753966051.0,
          "replies": [
            {
              "id": "n65rhr4",
              "author": "Whoisrefah",
              "body": "It won’t even reset, so it’s either dead technically or bricked.\n\n- it’s was bought June 30th 2024, so it’s OOW.\nNot uncommon for these to die, I’ve literally bought 5 of the trackers due to failure with this model for my two dogs.  About once every 18 months.  I’ve had serversl version of Tagg and Whitsle trackers, and this was the only model to fail about every 18 months.",
              "score": 25,
              "created_utc": 1753967670.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n666byq",
          "author": "Chuckelb",
          "body": "I have three whistles. They are all still working just like whistle/tractive said they would\n\nTractive is giving free devices for anybody with a whistle.  I'm pretty happy about it. Higher quality devices with more battery life and more features. Tracking # shows mine should arrive tomorrow. \n\nIn addition any subscription time you have left is rolling over to tractive. \n\nThis really all seems like a win to me. I'm pretty happy with it",
          "score": -39,
          "created_utc": 1753972170.0,
          "replies": [
            {
              "id": "n66k3c4",
              "author": "wileysegovia",
              "body": "Are you a rep for the company?",
              "score": 25,
              "created_utc": 1753976043.0,
              "replies": [
                {
                  "id": "n66o65d",
                  "author": "Chuckelb",
                  "body": "No. But I've been looking to get away from Whistle for awhile.  The constant failure of the trackers, the barely functional app, and the abysmal gps tracking.... they're almost more of a novelty than a functional tracker.  \n\nI've been interested in Fi trackers, but you have to use their collar, and I find their collars ugly. \n\n I have no experience with Tractive, for all I know they could be worse than Whistle. Their trackers have an IP rating though, instead of \"trust us bro, they're waterproof\". Tractive also uses 4G/LTE networks, instead of whistle 2G. Even in areas of good reception a Whistle tracker would take 3-5 minutes to report it's position if your dog was out of range of your home Wi-fi.",
                  "score": -5,
                  "created_utc": 1753977176.0,
                  "replies": [
                    {
                      "id": "n670lgm",
                      "author": "Vandrel",
                      "body": "I haven't used Whistle, this is honestly the first I've heard of it, but Tractive has been great in my experience. Been using it for years to keep tabs on a stray cat we kind of take care of and on foster dogs just in case we get one that tries to escape the fence. They've generally been pretty reliable, had one tracker stop working over the course of 3 years but we have the higher subscription tier which means they'll replace the tracker once per year if something happens to it so it didn't cost us extra. Sometimes the app struggles to connect to the tracker for live tracking but that might be more because of being in a semi-rural area.",
                      "score": 2,
                      "created_utc": 1753980695.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n66kxnk",
              "author": "GwenGunn",
              "body": "Found the employee.",
              "score": 7,
              "created_utc": 1753976280.0,
              "replies": [
                {
                  "id": "n671f41",
                  "author": "Chuckelb",
                  "body": "The employee of who? Whistle? Tractive?\n\nThe Whistles were garbage. I stuck with them because it's been too expensive and too much work to switch.  My family has a total of six different dogs with trackers, all with their subscriptions starting and stopping at different times. Switching would have meant $500ish in trackers using multiple apps for a couple years while subscriptions run out, our abandoning subscriptions and wasting that money \n\nThis is perfect for us. We get new trackers without spending the money, and the subscriptions are just transferred over to tractive.\n\nI have no idea if tractive trackers or the app are better, I've never used them, I'm happy with how the transfer has gone so far.  I had all six trackers ordered and subscriptions transferred in about 10 minutes.  The new trackers haven't arrived yet, so I can't speak to how well they work. Their specs are much better and I'm hopeful though.",
                  "score": 1,
                  "created_utc": 1753980922.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n659arf",
      "author": "Strawberry_Poptart",
      "body": "I switched to Fi a few years ago and haven’t looked back. They’re far better.",
      "score": 23,
      "created_utc": 1753960983.0,
      "replies": []
    },
    {
      "id": "n65cyh2",
      "author": "Bdr1983",
      "body": "Ridiculously wasteful.  \nYou buy a company to expand your portfolio, and then first thing you do is decide to just turn off the service?  \nI bet the customers are THRILLED by this, and everyone will jump to start using your service immediately.",
      "score": 58,
      "created_utc": 1753962510.0,
      "replies": [
        {
          "id": "n65t9oo",
          "author": "Hvarfa-Bragi",
          "body": "What i hear is they killed their biggest competitor and will get some to most of their customers.\n\nSeems like a fair trade for a little money, which is immaterial to large corps.",
          "score": 30,
          "created_utc": 1753968245.0,
          "replies": []
        },
        {
          "id": "n66xj8o",
          "author": "sonic10158",
          "body": "Monopolizing industries is the only thing that matters anymore",
          "score": 7,
          "created_utc": 1753979826.0,
          "replies": []
        },
        {
          "id": "n66uim8",
          "author": "EconomyDoctor3287",
          "body": "You buy a company to brick their product and then offer them a replacement for the standard fee of course.\n\n\nIt's business management 101 😎 ",
          "score": 5,
          "created_utc": 1753978969.0,
          "replies": []
        },
        {
          "id": "n65hq3p",
          "author": "Whoisrefah",
          "body": "Yeah…. That’s a BIG NOPE!!!!!",
          "score": 3,
          "created_utc": 1753964309.0,
          "replies": []
        },
        {
          "id": "n67qx6j",
          "author": "Calaheim_Koraka",
          "body": "Honestly for shit like this customers should be allowed to return owned devices for a significant percentage of the orginal purchas price. Oh want to nuke your competition. then pay for the proper recycling of all the hardware people bought.",
          "score": 1,
          "created_utc": 1753987943.0,
          "replies": []
        },
        {
          "id": "n666lx2",
          "author": "Chuckelb",
          "body": "The service isn't turned off. And all whistle subscribers are getting free devices and having our subscriptions extended",
          "score": -12,
          "created_utc": 1753972249.0,
          "replies": [
            {
              "id": "n666zsq",
              "author": "Bdr1983",
              "body": "I read from others that their devices already no longer work, so might be that.\nAnyways, it will be turned off, and the new service misses quite some functions.\nBesides that, it's insane to just throw away that many devices. Absolutely insane.",
              "score": 5,
              "created_utc": 1753972360.0,
              "replies": [
                {
                  "id": "n668ylf",
                  "author": "Chuckelb",
                  "body": "I have 3 whistle devices that are still working. Tractive is giving us new devices for free with better battery life and more features. (though physically they are a bit large for my taste).  There are a couple features the whistle had that tractive doesn't, but personally I think the tractive feature lineup is better. I'm sure others would disagree.  If I remember right, I'm trading whistle tracking how much my dog drinks, for tractive having bark monitoring and heart rate monitor. \n\nAnd instead of just throwing them away, taking them to an e waste recycler seems like a better idea to me",
                  "score": -3,
                  "created_utc": 1753972923.0,
                  "replies": [
                    {
                      "id": "n66cb7s",
                      "author": "Bdr1983",
                      "body": "Oh yes, please recycle them. But it's still very wasteful that these devices are going to be destroyed before end of life.",
                      "score": 5,
                      "created_utc": 1753973861.0,
                      "replies": [
                        {
                          "id": "n66kgpo",
                          "author": "Chuckelb",
                          "body": "The whistle devices were notoriously bad. I've had 9 of them over the last five years. Support always replaced them for free, so that's cool.  They would also lecture you not to get the devices get wet, even though they were advertised as waterproof. \n\nIt seems more wasteful to me to keep using a device with such a high failure rate that generated so much waste",
                          "score": 2,
                          "created_utc": 1753976147.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n65ijx8",
      "author": "scubachris",
      "body": "This shit use to be illegal.",
      "score": 55,
      "created_utc": 1753964603.0,
      "replies": [
        {
          "id": "n65tpu0",
          "author": "angeltay",
          "body": "We call it “enshitification”",
          "score": 11,
          "created_utc": 1753968388.0,
          "replies": []
        },
        {
          "id": "n65lfx6",
          "author": "ballrus_walsack",
          "body": "Another pile of shit in trumps America.",
          "score": 16,
          "created_utc": 1753965629.0,
          "replies": [
            {
              "id": "n65oe6o",
              "author": "scubachris",
              "body": "No, this started long before that.  It started with Reagan and has continued under every president since.  Most of the company mergers and massive companies would be considered monopolies until the SEC rule change that happened in the 80s.",
              "score": 36,
              "created_utc": 1753966642.0,
              "replies": [
                {
                  "id": "n6ag9hw",
                  "author": "NomadEsq",
                  "body": "The SEC doesn’t regulate monopolies. What rule are you talking about?",
                  "score": 1,
                  "created_utc": 1754019985.0,
                  "replies": []
                },
                {
                  "id": "n65pdc4",
                  "author": "ballrus_walsack",
                  "body": "I agree, but this particular pile of shit happened in trumps America.",
                  "score": -10,
                  "created_utc": 1753966965.0,
                  "replies": [
                    {
                      "id": "n666vdi",
                      "author": "parisidiot",
                      "body": "sure, but don't you want to know the actual reason why? it wasn't anything Trump did, these rules changed decades ago. trump is awful but do you not want to know history?",
                      "score": 8,
                      "created_utc": 1753972325.0,
                      "replies": [
                        {
                          "id": "n692wce",
                          "author": "ballrus_walsack",
                          "body": "I know. I was there.",
                          "score": 1,
                          "created_utc": 1754002118.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n66anns",
      "author": "karatekid430",
      "body": "This is why you don’t buy IoT happens every time",
      "score": 9,
      "created_utc": 1753973400.0,
      "replies": []
    },
    {
      "id": "n65ques",
      "author": "Switch_Lazer",
      "body": "Buy up the competition, corner the market, raise prices",
      "score": 8,
      "created_utc": 1753967456.0,
      "replies": []
    },
    {
      "id": "n66eys2",
      "author": "lev400",
      "body": "Purposely creating e-waste should be illegal.",
      "score": 4,
      "created_utc": 1753974609.0,
      "replies": []
    },
    {
      "id": "n65vp9t",
      "author": "NanditoPapa",
      "body": "Corporate grave-digging. Another “smart” device rendered dumb by acquisition logic.",
      "score": 3,
      "created_utc": 1753968999.0,
      "replies": []
    },
    {
      "id": "n675gnv",
      "author": "Okami0730",
      "body": "Yup I’m so disappointed to have lost some of my favorite Whistle health features. My boy suffers from seasonal allergies and the scratching feature was invaluable in assisting me in monitoring him and determining when/if he needed to go to the vet for a shot.",
      "score": 3,
      "created_utc": 1753982015.0,
      "replies": []
    },
    {
      "id": "n69ccrm",
      "author": "mega_vega",
      "body": "Check out the company Furtrieve! It’s a small startup that I used to work for based in Indiana. They make cellular pet trackers with many of the same features as whistle and tractive, and the company owner is an amazing human being who truly loves animals. Support local business!\n\nhttps://furtrieve.com",
      "score": 1,
      "created_utc": 1754005274.0,
      "replies": []
    },
    {
      "id": "n6k8z34",
      "author": "No_experience8177",
      "body": "They are so huge omg.",
      "score": 1,
      "created_utc": 1754157409.0,
      "replies": [
        {
          "id": "n6lweht",
          "author": "GenesiusValentine",
          "body": "I just got mine! They are so big! I have a bigger dog - I can’t imagine on a smaller dog.\nI really liked whistle and it worked for what I needed. My dog ran off a few times when a contractor left a gate open and without whistle we may not have found him. I also liked the health features - it was good to check on him when we left him w a pet sitter to ensure he was eating, sleeping regularly.\nWell I fell for the switch and signed up for Tractive so we’ll see. I’ve always been disappointed in whistles customer service on the few occasions I needed it and this last hurrah seems on par.\nBut yeah, first impression… it’s a bit much!",
          "score": 1,
          "created_utc": 1754177471.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n666o0g",
      "author": "parisidiot",
      "body": "eh I had a whistle and it wasn't what I would call a quality product, so i'm hopeful for the tractive",
      "score": 0,
      "created_utc": 1753972266.0,
      "replies": []
    },
    {
      "id": "n65t0f3",
      "author": "Equivalent-Log8854",
      "body": "I use AirTag on my dog’s collar",
      "score": -2,
      "created_utc": 1753968163.0,
      "replies": [
        {
          "id": "n675t31",
          "author": "Vivian_Stringer_Bell",
          "body": "That's not even the same use case.",
          "score": 4,
          "created_utc": 1753982109.0,
          "replies": []
        }
      ]
    }
  ]
}