{
  "post": {
    "title": "Meta Has Discontinued Its High-End VR Headset",
    "author": "BlueLightStruct",
    "id": "1hvsp4l",
    "score": 1060,
    "created_utc": 1736260372.0,
    "selftext": "",
    "num_comments": 148,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hvsp4l/meta_has_discontinued_its_highend_vr_headset/"
  },
  "comments": [
    {
      "id": "m5vjwl8",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736260373.0,
      "replies": []
    },
    {
      "id": "m5vm1ik",
      "author": "Chronotaru",
      "body": "The problem always was that the Quest 3 had several things that were better than the Pro, if the Pro was revised at the same time to be unambiguously better then it would still have a market position.\n\nIf they want another Pro headset they should release it at the same time as the Quest 4.",
      "score": 417,
      "created_utc": 1736261117.0,
      "replies": [
        {
          "id": "m5vqtgm",
          "author": "Sykes83",
          "body": "It’s not just “several things” that were better—the Quest 3 is better than the Quest Pro in almost every way. It has a higher resolution, better cameras, a faster CPU, and more. And it was half the price. Compared to the Pro the Quest 3 is missing the face and eye tracking, mini LED backlight, self-tracking on controllers, and a few other things, but they’re mostly minor things. The positioning of the Pro vs. the Quest 3 never really made much sense to me. Even when it first launched (before the Quest 3 was available) the Pro was a bit weird—they positioned it as an AR powerhouse and then equipped it with the world’s worst cameras.",
          "score": 184,
          "created_utc": 1736262701.0,
          "replies": [
            {
              "id": "m5w3078",
              "author": "Agrippanux",
              "body": "The Pro was launched early because Meta feared a holiday release of the AVP and wanted to get ahead of it. The Pro wasn’t ready and when the AVP was pushed back, Meta deprioritized it quickly.  The Pro has been an afterthought 3 months after it launched, they quickly pivoted to the Quest 3. \n\nSource: I run a VR game company.",
              "score": 103,
              "created_utc": 1736266450.0,
              "replies": [
                {
                  "id": "m5wuskn",
                  "author": "Lobsterbib",
                  "body": "I don't see what the galactic conflict between Xenomorphs and the Yautja has to do with any of this.",
                  "score": 54,
                  "created_utc": 1736274565.0,
                  "replies": [
                    {
                      "id": "m60rcvq",
                      "author": "Portlander_in_Texas",
                      "body": "Intergalactic conflict makes it sound bigger than it actually is. It's more like asshole hunters import a  dangerous invasive species to a planet to hunt. And with no natural predators the species propagates, eventually overwhelming local fauna. The Yaujta are just obnoxious trophy hunters.",
                      "score": 6,
                      "created_utc": 1736325394.0,
                      "replies": []
                    },
                    {
                      "id": "m5xh8a9",
                      "author": "gestalto",
                      "body": "Thought a similar thing. Didn't even know a new one was in the works.",
                      "score": 10,
                      "created_utc": 1736281059.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5xooqz",
                  "author": "Plank_With_A_Nail_In",
                  "body": "Running a game company doesn't give you knowledge of the inner  workings  of Meta ffs. Running a games company can just mean you and your two school friends burning through  your parents savings for all we know.",
                  "score": -34,
                  "created_utc": 1736283192.0,
                  "replies": [
                    {
                      "id": "m5y1vi9",
                      "author": "live_from_the_gutter",
                      "body": "Wet blanket award 🥇",
                      "score": 15,
                      "created_utc": 1736286975.0,
                      "replies": []
                    },
                    {
                      "id": "m603fgo",
                      "author": "Buttonskill",
                      "body": "Established SW partners often get reference boards and dev kits well in advance of release.  \n\nEven without that, 5 minutes spent in any collaborative external bug database will give you a pretty good idea of what platform or SKU a hardware vendor is prioritizing fixes for.",
                      "score": 9,
                      "created_utc": 1736312290.0,
                      "replies": []
                    },
                    {
                      "id": "m65o060",
                      "author": "Frenzie24",
                      "body": "Devs talk to each other and meta has traditionally had great dev support",
                      "score": 1,
                      "created_utc": 1736388112.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5vsfgy",
              "author": "Chronotaru",
              "body": "In general yes, Quest 3 is better in the things that matter, but that doesn't negate those things that are better on pro.  Eye tracking wouldn't be a minor thing if it actually was implemented on PC in most titles the way it is with PS5, and until it's actually on their biggest selling headsets that won't change. The controllers are a significant upgrade but if you want them they can be purchased separately, so why get a Pro for them?",
              "score": 20,
              "created_utc": 1736263215.0,
              "replies": [
                {
                  "id": "m631wcg",
                  "author": "BaconAlmighty",
                  "body": "and -  Quest Pro uses miniLED display tech, which provides greater contrast and richer color than is seen in the Quest 3.",
                  "score": 1,
                  "created_utc": 1736359139.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5xqb1a",
              "author": "nope_nic_tesla",
              "body": "I'm betting they manufactured too many Pros before the release of the Quest 3, so they just kept selling their inventory backlog until they ran out and now it's \"discontinued\"",
              "score": 4,
              "created_utc": 1736283647.0,
              "replies": []
            },
            {
              "id": "m64di4y",
              "author": "alidan",
              "body": "quest pro controllers are self tracking and dont require to be seen by the headset to track, how much this matters is debatable but it was a clear win, I believe it also had eye tracking for foveated rendering rather than relying on your eyes only being dead center.\n\nbut that's kind how halo products function, they come out, are the be all end all, and then you take what you can from them and put them in the lower end skus, quest 4 will likely have holocake lenses amd fingers crossed on oled display.",
              "score": 1,
              "created_utc": 1736372914.0,
              "replies": []
            },
            {
              "id": "m5xbap2",
              "author": "None",
              "body": "[deleted]",
              "score": 2,
              "created_utc": 1736279329.0,
              "replies": []
            },
            {
              "id": "m5y1jrs",
              "author": "joomla00",
              "body": "The quest pro has \"next gen\" features that werent that important to the average user.  Quest 3 really hit it out of the park with its overall package.  But personally I've given up on it at the moment.  $500 is about the right price, pancake lenses were a big improvement, but the screen and visual quality kicks me out of immersion.  Its a continuous reminder that this is an early gen product I'm strapping to my face.\n\nIt really needs quality miniled/OLED and eye trackers to get us to that next level of immersion.",
              "score": -5,
              "created_utc": 1736286881.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5zb8g5",
          "author": "Braidaney",
          "body": "I think this is a problem with consoles and products of this type in general, selling different versions of a product that vary slightly in price and slightly in quality confuses consumers and hurts the brand. If people buy the lower end product they’ll feel buyers remorse when they realize if they had just spent a bit more they could have had a better product, however that doesn’t mean they’re going to be willing to buy a whole new system more than likely they just get frustrated and lose all enthusiasm for trying out a newer product like vr.",
          "score": 2,
          "created_utc": 1736301635.0,
          "replies": []
        },
        {
          "id": "m5z424j",
          "author": "Rollertoaster7",
          "body": "Yeah it’d be perfect if they added eye/face tracking to a 4 pro model",
          "score": 1,
          "created_utc": 1736299207.0,
          "replies": [
            {
              "id": "m5z65r8",
              "author": "Chronotaru",
              "body": "They need to add it to the base model or there's no point.",
              "score": -1,
              "created_utc": 1736299913.0,
              "replies": [
                {
                  "id": "m64s0r1",
                  "author": "Felicity_Here",
                  "body": "Im not sure I expect that in the base model though. It is lower priced for a reason.",
                  "score": 2,
                  "created_utc": 1736377322.0,
                  "replies": [
                    {
                      "id": "m64sskt",
                      "author": "Chronotaru",
                      "body": "Sony made it happen. Because they did, most VR games on PS5 have foveated rendering.",
                      "score": 2,
                      "created_utc": 1736377574.0,
                      "replies": [
                        {
                          "id": "m64u34i",
                          "author": "Felicity_Here",
                          "body": "You make a good point....",
                          "score": 2,
                          "created_utc": 1736377999.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m606p42",
                  "author": "Rollertoaster7",
                  "body": "As budget headsets, keeping costs down is paramount, and the average meta user likely would prefer advances to be made to the weight, comfort, and battery life before they added several new cameras inside the headset, increasing cost, power consumption, etc.",
                  "score": 3,
                  "created_utc": 1736313761.0,
                  "replies": [
                    {
                      "id": "m60s2m0",
                      "author": "TheNorthComesWithMe",
                      "body": "Even if the hardware was decades better than the current state of the art, VR needs software. Unique input features locked behind the less popular model makes it less likely to be implemented in third party software.",
                      "score": 4,
                      "created_utc": 1736325854.0,
                      "replies": []
                    },
                    {
                      "id": "m610ts1",
                      "author": "Chronotaru",
                      "body": "And at the same time it's on PSVR2. Without it being on the most popular headset then developers won't implement foveated rendering in their games which means there's no point it being on the premium headset either.",
                      "score": 2,
                      "created_utc": 1736331504.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m5w286z",
      "author": "Zodaztream",
      "body": "I want a headset that is light enough, comfortable enough and great enough for working 8 hours a day in - then I would be sold on a vr headset.",
      "score": 47,
      "created_utc": 1736266218.0,
      "replies": [
        {
          "id": "m5x8vqb",
          "author": "TehOwn",
          "body": "We've got that already. You just can't take it off. Ever.",
          "score": 38,
          "created_utc": 1736278636.0,
          "replies": [
            {
              "id": "m5xag9m",
              "author": "SomeIrishGuy",
              "body": "Follow the white rabbit.",
              "score": 15,
              "created_utc": 1736279085.0,
              "replies": [
                {
                  "id": "m6020fi",
                  "author": "artsatisfied229",
                  "body": "You all look the same to me.",
                  "score": 4,
                  "created_utc": 1736311665.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m5vlyb8",
      "author": "pyrethedragon",
      "body": "I have a Meta Quest 2 and maybe 20 hours on it in the last year. It has a high initial interest for me, and some games are quite fun. But I just can’t get into the social part of it. Also gives me headaches after a while.",
      "score": 116,
      "created_utc": 1736261086.0,
      "replies": [
        {
          "id": "m5xb8zz",
          "author": "mx3goose",
          "body": "The pancake lens in the quest 3 took VR from \"this is fun for a little bit\" to \"I use this daily\" I didn't realize how terrible the layered frenzo lenses were until I used pancakes.",
          "score": 19,
          "created_utc": 1736279315.0,
          "replies": []
        },
        {
          "id": "m5vncyu",
          "author": "DrCalamity",
          "body": "It's a good budget PCVR headset but absolutely doesn't want you to use it that way.",
          "score": 42,
          "created_utc": 1736261562.0,
          "replies": [
            {
              "id": "m5x8lbq",
              "author": "TehOwn",
              "body": "Eh, with Steam Link, I found it incredibly easy to use, even over Wi-fi.\n\nThe only issue was one game that wouldn't work with SteamVR.",
              "score": 15,
              "created_utc": 1736278552.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5vvotj",
          "author": "TheRogueMoose",
          "body": "I use my Quest 3 for racing sims (via link cable) and Skyrim VR (airlink). The only time i ever do anything \"social\" is when my son wants us to play together (he uses my old Quest 2). \n\nUsually it's just us playing in \"social\" games, like Population One, RecRoom, etc.",
          "score": 11,
          "created_utc": 1736264240.0,
          "replies": [
            {
              "id": "m5woeqf",
              "author": "PM_Me_Cool_Cars_",
              "body": "How is the Quest 3 vs 2 for sim racing? Currently using the 2 and like it, but wondering if the 3 would be more comfortable and better quality.",
              "score": 4,
              "created_utc": 1736272716.0,
              "replies": [
                {
                  "id": "m5wrw95",
                  "author": "TheRogueMoose",
                  "body": "I got an aftermarket head strap for them both. So it's hard to say comfort wise as it was the first thing i did with them both lol. I hated the stock head strap. I have the Bobovr M3 Pro for my Quest 3 and love it. I also have the Kiwi design Upgraded Elite strap for the Quest 2, and loved it. Tho 3 years later it's starting to wear down.\n\nI found without the straps it would just hang down and dig into my cheeks and just really hurt. With the Bobovr strap on the 3, it doesn't even touch my face.\n\nQuality wise, much better in my opinion! I wasn't a huge fan of the fresnel lens in the older headsets. So much clearer/cleaner with pancake lenses.",
                  "score": 4,
                  "created_utc": 1736273731.0,
                  "replies": []
                },
                {
                  "id": "m5xuwca",
                  "author": "Fugueknight",
                  "body": "Never used a 2, but one limitation of the 3 (for sim racing in particular) is that the video encoding can cause a lower quality video signal than your system is capable of rendering or the headset is capable of displaying. I'm happy with my 3 for something like dirt rally, but it is a bit of a downgrade from my old reverb G2",
                  "score": 1,
                  "created_utc": 1736284961.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m5wlrc5",
          "author": "PenislavVaginavich",
          "body": "The Quest 3 is a major improvement - it's far better in almost every way to any other mixed reality or VR headset I've used - and I don't really get headaches with a good strap.But, it's still just not a super practical tool, for most people, as cool as it is. It's not immersive enough for things like movies - and YouTube 360 is mostly kind of a gimmick. There's just not enough good content out there to make it worthwhile for most people. Mine mostly sits charging in the corner, and I occasionally throw it on to play golf or table tennis, or to use as PCVR for Alyx. That's about it.",
          "score": 11,
          "created_utc": 1736271958.0,
          "replies": []
        },
        {
          "id": "m5x6ck9",
          "author": "Alchia79",
          "body": "I have the quest 2 as well from Christmas 2020.  We all used it a lot the first year.  I loved Supernatural & Beat Saber.  The kids loved the games.  Now only my youngest uses it.  The novelty wears off.  It feels so heavy and uncomfortable after a bit.",
          "score": 4,
          "created_utc": 1736277899.0,
          "replies": []
        },
        {
          "id": "m5vyerb",
          "author": "Abigail716",
          "body": "I would try out the Quest 3. I know quite a few people including myself that could not use the Q2 for very long without getting a terrible headache. But the three is way better, I'm now able to play it for hours without a problem at all. IMO the Q3 is the first VR headset worth buying that isn't just a novelty.",
          "score": 7,
          "created_utc": 1736265067.0,
          "replies": []
        },
        {
          "id": "m5w3gkc",
          "author": "djamp42",
          "body": "Do you need a Facebook account to use quest? I assume so.",
          "score": 1,
          "created_utc": 1736266586.0,
          "replies": [
            {
              "id": "m5w5zm5",
              "author": "byOlaf",
              "body": "No, I think you need a meta account but not sure. It doesn’t have to be linked to your Facebook.",
              "score": 9,
              "created_utc": 1736267334.0,
              "replies": []
            },
            {
              "id": "m5wepu9",
              "author": "River41",
              "body": "I made a new account with nothing on it just to link it to my quest account",
              "score": 2,
              "created_utc": 1736269902.0,
              "replies": [
                {
                  "id": "m5xcw2b",
                  "author": "blazelet",
                  "body": "Is there a way for those of us who set up our Oculus 8 years ago when it *had* to be a facebook account to untether them without losing years of purchases? I'd love to delete my FB but don't want to lose all my purchases.",
                  "score": 2,
                  "created_utc": 1736279784.0,
                  "replies": [
                    {
                      "id": "m5xeg32",
                      "author": "chewbadeetoo",
                      "body": "Yes there is , I was able to untether and still have my library. However I tend to not buy things on the oculus store if there is a choice.",
                      "score": 3,
                      "created_utc": 1736280238.0,
                      "replies": [
                        {
                          "id": "m604xmz",
                          "author": "blazelet",
                          "body": "I’ll look into this thank you",
                          "score": 1,
                          "created_utc": 1736312955.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m5xi9n2",
                      "author": "River41",
                      "body": "Not sure, definitely used to be the case but things may have changed.",
                      "score": 1,
                      "created_utc": 1736281361.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m5zjw68",
          "author": "AlwaysLateToThaParty",
          "body": "The primary thing i use my quest 2 for is watching 3D movies.",
          "score": 1,
          "created_utc": 1736304657.0,
          "replies": []
        },
        {
          "id": "m7hx2fm",
          "author": "climber531",
          "body": "i have had my Q2 since august 2024 and i have a few hundred hours. i bought the BoboVR strap and its super comfortable. haven't really tried the social aspect in any other way than playing golf with my brother. but its super fun for cardio and many interesting games. normally play 2h at a time and never felt any headache or fatigue, just get tired of playing the game after that long, same with a normal monitor.",
          "score": 1,
          "created_utc": 1737054102.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5vrksa",
      "author": "NeutralTarget",
      "body": "I remember VR setups in a mall arcade back in the mid 90s. It was like $5 to play. 10 years later another VR craze saying it's the gaming of the future, then another bringing us to today. The tech keeps getting better but the average Joe is not buying. Plus vertigo sucks.",
      "score": 41,
      "created_utc": 1736262943.0,
      "replies": [
        {
          "id": "m5w1dzc",
          "author": "MukdenMan",
          "body": "Yeah I remember playing one (I think at Navy Pier in Chicago) and it blew my mind. It was a tank battle game and the headset tracked where my head was looking which was completely new to me at the time. I thought a lot of games would be like that soon but didn’t happen.",
          "score": 15,
          "created_utc": 1736265964.0,
          "replies": [
            {
              "id": "m6775df",
              "author": "bremidon",
              "body": "Back in the mid-90s, I lived in Chicago.  They had one at North Pier (as well as a MechWarrior thing).  The game I played was some sort of on-rails shooter with a wild end boss.  I seem to remember that a full game to the end took about 15 minutes.  I was one of only a few people who could beat it, so that was always cool. :)",
              "score": 1,
              "created_utc": 1736414580.0,
              "replies": [
                {
                  "id": "m678vi3",
                  "author": "MukdenMan",
                  "body": "Maybe it was North Pier, and I think it was the mechwarrior one. The timeline makes sense.",
                  "score": 1,
                  "created_utc": 1736415719.0,
                  "replies": [
                    {
                      "id": "m679uie",
                      "author": "bremidon",
                      "body": "Played the MechWarrior one with my girlfriend at the time (now wife).  She actually beat me in that one, because I was laughing so hard.  Her mech had one of the legs shot off and she was hopping around like crazy, and I could barely see anything through the tears of laughter.",
                      "score": 1,
                      "created_utc": 1736416347.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m5wkdq0",
          "author": "-Badger3-",
          "body": "It’s in the same realm of gimmick as the Xbox Kinect or Wii controllers imo.\n\nLike, yeah, it can be a fun supplement to traditional gaming, but it’s too janky to be a staple.",
          "score": 10,
          "created_utc": 1736271556.0,
          "replies": [
            {
              "id": "m67d7tw",
              "author": "SuperSpecialAwesome-",
              "body": "Have you ever tried Beat Saber?",
              "score": 1,
              "created_utc": 1736418517.0,
              "replies": []
            },
            {
              "id": "m5zxb7k",
              "author": "zdiggler",
              "body": "I want to get high AF, sit on the couch and play games.. not fucking exercise!!",
              "score": 1,
              "created_utc": 1736309689.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5wwd2v",
          "author": "triadwarfare",
          "body": "I remember that too, but it feels like framerates were too slow. It's like those maze screensavers",
          "score": 6,
          "created_utc": 1736275019.0,
          "replies": []
        },
        {
          "id": "m5x2673",
          "author": "Enderkr",
          "body": "I can think of a half dozen amazing uses for AR/VR off the top of my head, but it sure seems like companies don't give a fuck about actual real world usage and instead keep pushing AR movies and bad video games. To say nothing of the hyper-limiting form factor of a massive pair of goggles on your face.",
          "score": 8,
          "created_utc": 1736276679.0,
          "replies": [
            {
              "id": "m60v5sr",
              "author": "TheNorthComesWithMe",
              "body": "You could probably also think of dozens of amazing uses for regular phone/web apps in the real world that *also* don't exist for the same reason. There's no money in it.",
              "score": 3,
              "created_utc": 1736327869.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5vz1iu",
          "author": "gwinerreniwg",
          "body": "I agree w/ all this.  I feel like the killer app is yet to come.  I've caught glimpses of the future from using the Apple Vision (also flawed in many ways), and the Quests but no one has managed to find the sweet spot yet.  I do think it's a matter of chasing hardware.\n\nFive years on or so, and the most entertainment we've had so far are Beat Saber and Richies Plank Experience.",
          "score": 7,
          "created_utc": 1736265256.0,
          "replies": [
            {
              "id": "m5whq0d",
              "author": "TheBroWhoLifts",
              "body": "Half Life Alyx was one of the most engaging and thrilling gaming experiences I've ever had. If there was more content on oar with that, it might attract a wider audience but the high price barrier to entry is going to be a problem. A decent PC is required to run titles like that.",
              "score": 15,
              "created_utc": 1736270782.0,
              "replies": [
                {
                  "id": "m5wxjyn",
                  "author": "wingspantt",
                  "body": "Alyx unfortunately isn't mass market enough. It's borderline horror, it is the third or fourth entry in a series of games from 20 years ago, meaning new/young gamers don't have any connection to the story. So the game is really good, but it is also very alienating.",
                  "score": 9,
                  "created_utc": 1736275361.0,
                  "replies": []
                },
                {
                  "id": "m5wo9d6",
                  "author": "kb_hors",
                  "body": "ehhh Alyx runs well in VR on an old 1660ti and a ryzen 2600. That's \"Decent\" for 2019.",
                  "score": 3,
                  "created_utc": 1736272673.0,
                  "replies": []
                },
                {
                  "id": "m5wmy32",
                  "author": "ajemik",
                  "body": "Sadly there's what, Alyx and if you want to stretch it, Boneworks. Other than that there's not much to really \"sell\" pcvr. I've bought quest 1 on release, still have it, but it sits in the box for whenever anything actually good releases. It's still a gimmick and despite how amazing Alyx was, VR still is a niche.",
                  "score": 3,
                  "created_utc": 1736272299.0,
                  "replies": [
                    {
                      "id": "m5wn4rk",
                      "author": "TheBroWhoLifts",
                      "body": "I will say we have been enjoying Walkabout Mini Golf immensely in our home and play nearly every day. A really fun title worth checking out!",
                      "score": 3,
                      "created_utc": 1736272353.0,
                      "replies": [
                        {
                          "id": "m5wnhud",
                          "author": "ajemik",
                          "body": "I might check that out then!\n\nBut the point is, other games feel \"gimmicky\" compared to Alyx, you know? Like you try to find an excuse to put the headset on rather than not being able to wait to play it. No idea if I'm expressing it well enough, but I hope I do haha",
                          "score": 1,
                          "created_utc": 1736272455.0,
                          "replies": [
                            {
                              "id": "m5won43",
                              "author": "TheBroWhoLifts",
                              "body": "Absolutely. Cartoonish, unpolished... Agreed. I even found Bone works to be really lacking and clunky, and I just didn't get it. The sandbox got old after a while and even though I'm pretty fit, the parkour shit was exhausting and frustrating! Maybe I didn't get far enough, but I really didn't get into it. Vail has some promise as a competitive first person shooter, but by far the greatest VR coop experience was Firewall: Zero Hour on the original PSVR... Wow what a game! And Moss, Super Hot, Astro Bot, and Statik Institute of Retention (fucking brilliant!!) deserve honorable mentions as well. Those are old games and not much on the PC really comes close... It's depressing. \n\nOh I just remembered! Resident Evil 4 is another one worth playing especially if you're nostalgic for the original which is 100% but in pretty thrilling VR. Oh and definitely check out Compound!! Man that game is fun as hell. Stylized, 8-bit-ish 90's vibe first person roguelite shooter. I still play it when I'm feeling the itch.",
                              "score": 1,
                              "created_utc": 1736272782.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m5xg4ic",
                  "author": "gwinerreniwg",
                  "body": "While I don't disagree this is a good app, is it really any different than any 3D shooter we've seen for the last 30y, some of which were available on early VR systems (and several of which were on Quest before Alyx too).  It's clear FPS are not the killer app and in fact are pretty boring and cliche at this point, despite the intuitive leap that such games should be better in VR.  While not wrong, it's not what a new pardigm needs to drive a new market, in my opinion of course.",
                  "score": 1,
                  "created_utc": 1736280733.0,
                  "replies": [
                    {
                      "id": "m5xiicp",
                      "author": "TheBroWhoLifts",
                      "body": "Have you actually played Alyx? It was made from the ground up to be only VR, and you can tell. I've played a ton of VR and no other titles have come close not only in technical/graphical terms but also interactivity, story, and environment. It's a masterpiece. And the community of creators makes it so that there is a ton of extra playability. Story, graphics, and interaction matter, and that game sets the gold standard",
                      "score": 1,
                      "created_utc": 1736281430.0,
                      "replies": [
                        {
                          "id": "m5xzkk0",
                          "author": "gwinerreniwg",
                          "body": "I do own Alyx - I’m not saying it’s not a good game, I enjoyed it. but they’re not breaking any new ground with the format, with what is basically VR half-life (how many decades old now?). It’s original like the new Star Wars series are.",
                          "score": -1,
                          "created_utc": 1736286310.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5wtojf",
              "author": "_bramwell_",
              "body": "Is it useable as a home TV replacement? Like sit on the sofa with the headset and watch a movie?\n\nI always figured that would be the killer use case. Big screen viewing in a personal footprint",
              "score": 3,
              "created_utc": 1736274250.0,
              "replies": [
                {
                  "id": "m5wxrw8",
                  "author": "wingspantt",
                  "body": "Yes but if you live with other people it feels weird to not know if you're actually alone in the room.",
                  "score": 7,
                  "created_utc": 1736275423.0,
                  "replies": [
                    {
                      "id": "m5yb525",
                      "author": "PrimeIntellect",
                      "body": "this is kind of the lynchpin that will make it never really take off\n\npeople are already struggling hard with too much screentime, and a new product that makes you in 100% screen is even worse, and essentially removes any chance with interacting with people around you",
                      "score": 4,
                      "created_utc": 1736289775.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5xf9u5",
                  "author": "gwinerreniwg",
                  "body": "I think it depends on your stage in life - As a single or young person perhaps, but its not a universal appeal: some ppl have equally good home theater systems, w/ surround and all the trimmings, others prefer the social interactions of having others visible and interacting in the room.",
                  "score": 3,
                  "created_utc": 1736280481.0,
                  "replies": [
                    {
                      "id": "m5zz9ng",
                      "author": "nerevisigoth",
                      "body": "There's also the terror of being licked by your dog when you're in VR.",
                      "score": 4,
                      "created_utc": 1736310498.0,
                      "replies": []
                    },
                    {
                      "id": "m60eont",
                      "author": "Responsible-Win5849",
                      "body": "Do you know anyone that uses the social interaction part? locking down/disabling everything I could was step 1 before even powering on my headset, but always curious if there are some people that actually want to run around with a hot mic all session.",
                      "score": 1,
                      "created_utc": 1736317814.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m60vpox",
              "author": "TheNorthComesWithMe",
              "body": "What's the killer app of a laptop? Or a smartphone? Or a monitor? \n\nIt's not about having one single killer app, but having a sufficient amount of usefulness.",
              "score": 3,
              "created_utc": 1736328232.0,
              "replies": [
                {
                  "id": "m61jkqs",
                  "author": "gwinerreniwg",
                  "body": "Laptop: Lotus 123/Excel\n\nSmartphone: “the app itself” as a concept, but arguably social media\n\nMonitor: the FPS concept (Quake/Doom)",
                  "score": 1,
                  "created_utc": 1736341396.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5ygx0u",
              "author": "None",
              "body": "This. The only thing I was interested in playing is Minecraft. Too bad Mojang deleted this feature so now the only way to play Minecraft in VR is on PC using Java edition mods which is fine for many but it sucks for me because I play on bedrock only since I am a console gamer. \n\n\nLike I have no other interesting things to do with a vr helmet.",
              "score": 2,
              "created_utc": 1736291599.0,
              "replies": []
            },
            {
              "id": "m5wnuf2",
              "author": "kb_hors",
              "body": "\"VR has no killer app\" is a strange thing for me to hear when I've owned a VR Headset since 2022 exclusively to run VRChat, which has a userbase big enough to pull 20k people to a weeklong online event and has an entire industry grown around it.\n\nIt *absolutely* has a killer app. Is it one most people want or need? No. But for those who do? Indispensable.",
              "score": 0,
              "created_utc": 1736272554.0,
              "replies": [
                {
                  "id": "m5wzgkt",
                  "author": "SimiKusoni",
                  "body": ">Is it one most people want or need? No.\n\nA \"killer app\" is an application that drives hardware sales to the point where it is the primary, or even sole, driver of a platforms success.\n\nThere are certainly popular applications for VR but there is nothing that has captured the market to that degree and I think you'd be hard pressed to make the argument that VRChat is significantly driving unit sales for VR headsets.",
                  "score": 12,
                  "created_utc": 1736275904.0,
                  "replies": [
                    {
                      "id": "m5zjg8o",
                      "author": "kb_hors",
                      "body": "I can make that argument incredibly easily because it's true. I've met hundreds of VR users, none of which did anything other than VRChat and a couple of other social VR experiences like that minigolf game (whatever it's called). That's the only reason to buy a VR Headset at all, it has no other practical use.\n\nYou can see this in the entire market around VR Accessories. Full body trackers are not for whatever Mark Facebook is advertising, they're for doing queer shit with furries.",
                      "score": 2,
                      "created_utc": 1736304502.0,
                      "replies": [
                        {
                          "id": "m60ff4o",
                          "author": "Responsible-Win5849",
                          "body": "And here I was wondering who on earth would want to waste time in virtual chatrooms beyond the usual preachers hunting children. Glad to see the 2nd life folks found another place to go.",
                          "score": 3,
                          "created_utc": 1736318221.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m5xjavj",
          "author": "gestalto",
          "body": "Q2+3 sold not far off the same amount as the Xbox series S/X in the same time period. People underestimate how quickly they are becoming mainstream. The sales are on par or thereabouts with Xbox, Xbox series, Gamecube and Wii U.",
          "score": 2,
          "created_utc": 1736281658.0,
          "replies": []
        },
        {
          "id": "m5wlof1",
          "author": "whewtang",
          "body": "This just comes across like you haven't tried anything since the 90s. \n\nGot psvr2 on sale over the holidays. Have been playing Gran Turismo 7 and it's excellent. \n\nBeing able to see the cars as if you're sitting in them, walking around them. Actually being able to distinguish the elevation changes of real race tracks. This isn't like a virtual boy or whatever.",
          "score": 1,
          "created_utc": 1736271935.0,
          "replies": [
            {
              "id": "m5xei85",
              "author": "rockman12x",
              "body": "Exactly what I think when I read comments like these. Clearly they haven’t even touched a modern headset. \n\nVertigo? What vertigo lol. Even better when they mention screen door effect\n\nI really wish every comment here had a disclaimer if they have even used a quest 3 or psvr2",
              "score": 0,
              "created_utc": 1736280256.0,
              "replies": [
                {
                  "id": "m60fpfb",
                  "author": "Responsible-Win5849",
                  "body": "vertigo/motion sickness can still happen with the newer headsets. My wife gets a bit of nausea after 20-30 minutes with the quest 3 while wearing glasses, waiting to see if the lens inserts help with that.",
                  "score": 4,
                  "created_utc": 1736318378.0,
                  "replies": []
                },
                {
                  "id": "m5ybad2",
                  "author": "PrimeIntellect",
                  "body": "I mean, that's basically why, nobody really cares or wants to buy this shit because the whole premise is just kind of dumb",
                  "score": 3,
                  "created_utc": 1736289821.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m5ww0mj",
          "author": "MajorFuckingDick",
          "body": "VR still isnt there for the average joe. The standalone games are awesome but most people don't want that level of activity for a game. Bringing back 3D gaming with a controller would be huge but thats another can of worms. Setting it up for PCVR has an entire box of issues on its own that someone who just wants to play games will be annoyed with. The amount of tinkering needed to access a lot of the things that enthusiast rave about is too much for most. \n\n\nA console headset that lets you play normal games in 3D rather than just Theater Mode is a huge potential market that I foresee being the boom. Personally watching my first 3D movie at home that rivaled or surpassed theater experience and racing with the direct feedback of my wheel sold me on VR forever. A lot of big players see the writing on the wall, but still cant crack the code. I want to say that the next console generation will have the stuff needed to bring it into every home but that feels naive.",
          "score": 1,
          "created_utc": 1736274919.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5vpx21",
      "author": "Mastoraz",
      "body": "They shot themselves in the foot releasing it so weakened just before the Quest 3. If it had the same SOC and same passthrough as Quest 3 the Quest Pro would be doing a lot better. And at $999 launch price instead of $1499.",
      "score": 21,
      "created_utc": 1736262407.0,
      "replies": [
        {
          "id": "m5vwdq5",
          "author": "TheRogueMoose",
          "body": "The Pro wasn't for gaming though. It was targeting the business sector... which has zero interest in it.",
          "score": 20,
          "created_utc": 1736264454.0,
          "replies": [
            {
              "id": "m5vwp46",
              "author": "Mastoraz",
              "body": "Yeah that too was idiotic lol. It put the pedestal even higher since it was targeted for that and yet underperformed remarkably with that hardware and software lack of support they had on it",
              "score": 10,
              "created_utc": 1736264551.0,
              "replies": []
            },
            {
              "id": "m5ymaob",
              "author": "FlyingBishop",
              "body": "Any realistic business use cases actually have higher requirements than gaming. Even just virtual desktop, you need 10x the specs to get an actually on par experience with conventional monitors. And of course the monitors cost 1/10th the price.",
              "score": 2,
              "created_utc": 1736293362.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m5zfoh7",
      "author": "mistercartmenes",
      "body": "![gif](giphy|cO39srN2EUIRaVqaVq)",
      "score": 7,
      "created_utc": 1736303193.0,
      "replies": []
    },
    {
      "id": "m5zxxuy",
      "author": "zdiggler",
      "body": "FUCK FACEBOOK AND EVERYTHING THEY MAKE AND STAND FOR.",
      "score": 13,
      "created_utc": 1736309945.0,
      "replies": []
    },
    {
      "id": "m5wxcnw",
      "author": "Ghozer",
      "body": "I have no desire for more mobility in VR than my CV1 Roomscale setup!",
      "score": 7,
      "created_utc": 1736275303.0,
      "replies": [
        {
          "id": "m5xeiun",
          "author": "None",
          "body": "I don't even know what CV1 roomscale is",
          "score": -1,
          "created_utc": 1736280261.0,
          "replies": [
            {
              "id": "m5xhdgs",
              "author": "axle66",
              "body": "The Oculus Rift Consumer Version 1. It was the PC desktop headset released by oculus before they were acquired by Facebook. If you get additional sensors you can do room scale with it.",
              "score": 4,
              "created_utc": 1736281101.0,
              "replies": [
                {
                  "id": "m60zbzk",
                  "author": "ghhfcbhhv",
                  "body": "Facebook acquired them before the release of the DK2.",
                  "score": 1,
                  "created_utc": 1736330551.0,
                  "replies": []
                },
                {
                  "id": "m5xwwtr",
                  "author": "None",
                  "body": "I see. Still no interest or utility for me whatsoever. \n\n3D printing, VR, EV, AI, whats next thing that has way too much hype than it eventually is.",
                  "score": -10,
                  "created_utc": 1736285539.0,
                  "replies": [
                    {
                      "id": "m60vtpj",
                      "author": "thrownawaymane",
                      "body": "All 4 of those technologies are changing the world. Plenty of money to be made by picking horses in each of those fields too. Additive manufacturing especially is just mainstream now.",
                      "score": 3,
                      "created_utc": 1736328305.0,
                      "replies": [
                        {
                          "id": "m60w7ul",
                          "author": "None",
                          "body": "\"Not as much as the hype said\"",
                          "score": -2,
                          "created_utc": 1736328566.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m5yf8xd",
                      "author": "SuicidalChair",
                      "body": "Like all of those things have tons of utility to everyone if they know what they can do and not just go into confused grandpa mode.",
                      "score": 7,
                      "created_utc": 1736291061.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m60i0qy",
      "author": "UgarMalwa",
      "body": "I used Meta Quest 3, honestly I found it impressive on what it could do and had fun playing it. Especially if you’re using apps like Youtube which lets you view the screen like a cinema and stuff. The 360° videos are also fire. Motion tracking/controls are fine, a bit like the Wii but actually more functional. \n\nThere are some negatives however:\n\nBattery life sucks; this isn’t the fault of the system though because of how it works. But you will notice that it will eat away after 30-mins to an hour.\n\nMeta-Horizon can be a cesspool of shitty worlds full of screaming children and trolls.\n\nMotion sickness happens especially when you’re standing.\n\nThe app store feels somewhat empty with A lot of garbage shovelware you’d expect from your IOS app.\n\nOh and obviously you can’t use it outside, not only is it dangerous since apps will obscure your vision, but the sun can also cause screen damage. There are work arounds, but there is not real reason to in the first place.\n\nI do have to give Meta credit however for the innovation of actually making something functional regardless of their questionable reputation.",
      "score": 4,
      "created_utc": 1736319681.0,
      "replies": []
    },
    {
      "id": "m5wqh52",
      "author": "sold_snek",
      "body": "People in this thread acting like this is some huge L for Meta. They discontinued because they don't need it anymore.",
      "score": 7,
      "created_utc": 1736273318.0,
      "replies": []
    },
    {
      "id": "m5wu8nz",
      "author": "None",
      "body": "I love VR. I wish more people used it.",
      "score": 3,
      "created_utc": 1736274409.0,
      "replies": []
    },
    {
      "id": "m60t3vl",
      "author": "ThisNameTakenTooLoL",
      "body": "It wasn't high end. It just had a high end-ish price.",
      "score": 2,
      "created_utc": 1736326524.0,
      "replies": []
    },
    {
      "id": "m60l5lr",
      "author": "l0veit0ral",
      "body": "Would have been best to leave Occulus alone and let them keep being brilliant instead of buying them and gutting the talent there and think Mark knew how to do VR better. SMDH",
      "score": 3,
      "created_utc": 1736321527.0,
      "replies": [
        {
          "id": "m60o3g2",
          "author": "GagOnMacaque",
          "body": "Oculus you got it itself once it was bought.  Meta didn't have to do anything.",
          "score": 0,
          "created_utc": 1736323316.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5ycgas",
      "author": "blackburnduck",
      "body": "Biggest problem with quest is meta itself. After spending hours diagnosing  40 quest 2 headsets and having to deal with the forced and terrible facebook integration, I simply refuse to purchase the product. The simple act of pairing remotes is a pain in the ass and feels like i’m back to the 80s.\n\nSwitch syncs with a click. BT sincs with a press. Quest? Takes a whole process and serial codes for every remore.\n\nThey may be the best overall headset nowadays, but I’m never getting a quest because of this shoddy forced social integration.",
      "score": 2,
      "created_utc": 1736290179.0,
      "replies": [
        {
          "id": "m5yfxst",
          "author": "SuicidalChair",
          "body": "Well which is it, the shoddy social integration or the bad controller pairing you do once or twice while owning it? And you used switch as an example when every time a Nintendo switch opens a new screen or menu it disconnects all the controllers and asks you to resync them for player number lol",
          "score": 0,
          "created_utc": 1736291284.0,
          "replies": [
            {
              "id": "m5yhtrq",
              "author": "blackburnduck",
              "body": "It is the same my man. You need to connect the social part to pair a controler.",
              "score": 3,
              "created_utc": 1736291893.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m5xxcm4",
      "author": "pandaSmore",
      "body": "Remember when it was just Oculus\n\n![gif](giphy|76x4gSMy8dT9u)",
      "score": 2,
      "created_utc": 1736285666.0,
      "replies": []
    },
    {
      "id": "m5zwr2t",
      "author": "zdiggler",
      "body": "no one wants to wear crap on their head to play games.\n\nBottom line.",
      "score": 2,
      "created_utc": 1736309463.0,
      "replies": []
    },
    {
      "id": "m5vpgkz",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1736262257.0,
      "replies": [
        {
          "id": "m5vteez",
          "author": "Ancient-Beat-1614",
          "body": "Just use the quest for pcvr then? The quest 2 and 3 are already far better than the rift, and have much bigger user bases.",
          "score": 6,
          "created_utc": 1736263523.0,
          "replies": [
            {
              "id": "m5vvhxh",
              "author": "None",
              "body": "[deleted]",
              "score": -2,
              "created_utc": 1736264181.0,
              "replies": [
                {
                  "id": "m5wbqwr",
                  "author": "Basscyst",
                  "body": "The reason you aren't seeing studios put out very many PC VR games is that the market is so much larger if you make a game that can run on the headset without PC support.  Prior to standalone headsets studios were developing games with the PC in mind, because that was the entire market.",
                  "score": 2,
                  "created_utc": 1736269029.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m5vvjtb",
          "author": "DarthBuzzard",
          "body": "> playing a version of Assassins Creed on Quest 2 that’s worse than a PlayStation 2 game.\n\nYou must have some amazing cherry picked memories of PS2 games, because nothing on PS2 looks remotely as good from a graphical fidelity standpoint.",
          "score": 5,
          "created_utc": 1736264197.0,
          "replies": []
        },
        {
          "id": "m5wf32h",
          "author": "-Sploosh-",
          "body": "You realize you can still use Quest headsets with your PC right? Either wired directly or wirelessly.\n\nI don’t think they’re worried about losing a fan base as Quest 2 & 3 have both sold far better than the Rift ever did.",
          "score": 3,
          "created_utc": 1736270009.0,
          "replies": []
        },
        {
          "id": "m5vs7vt",
          "author": "fgtswag",
          "body": "isnt the difference that the Oculus required a High End PC, whereas the Quest can run things by itself",
          "score": 2,
          "created_utc": 1736263149.0,
          "replies": [
            {
              "id": "m5vtq6l",
              "author": "Microharley",
              "body": "Yes but you can also hook the Quest up to a PC. Steam even has software supporting wireless with no sensors or wires needed.",
              "score": 7,
              "created_utc": 1736263625.0,
              "replies": [
                {
                  "id": "m5vu9w9",
                  "author": "fgtswag",
                  "body": "thats pretty cool",
                  "score": 3,
                  "created_utc": 1736263796.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m5vtlcs",
              "author": "None",
              "body": "[deleted]",
              "score": -1,
              "created_utc": 1736263584.0,
              "replies": [
                {
                  "id": "m5vud0g",
                  "author": "fgtswag",
                  "body": "wdym, are you saying that PCs cant run stuff now",
                  "score": 1,
                  "created_utc": 1736263823.0,
                  "replies": [
                    {
                      "id": "m5vwmgk",
                      "author": "TheRogueMoose",
                      "body": "They can, but Meta has completely abandoned what made Oculus great. Good, high-end games. They have closed most of their gaming studios.",
                      "score": 2,
                      "created_utc": 1736264528.0,
                      "replies": [
                        {
                          "id": "m5w1w52",
                          "author": "fgtswag",
                          "body": "ah that sucks. isn't like Pavlov and boneworks pretty good tho",
                          "score": 1,
                          "created_utc": 1736266117.0,
                          "replies": [
                            {
                              "id": "m5w2kxr",
                              "author": "TheRogueMoose",
                              "body": "Ya, but those aren't Meta/Oculus studios, they are small indy's",
                              "score": 1,
                              "created_utc": 1736266324.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m5z3sg7",
      "author": "Mysterious_Camera313",
      "body": "Yay!",
      "score": 1,
      "created_utc": 1736299118.0,
      "replies": []
    },
    {
      "id": "m60gbxf",
      "author": "iaymnu",
      "body": "There was a High end VR headset?? what was it called?",
      "score": 1,
      "created_utc": 1736318725.0,
      "replies": []
    },
    {
      "id": "m61au4d",
      "author": "Majestic-Seaweed7032",
      "body": "Meta should discontinue as a whole",
      "score": 1,
      "created_utc": 1736337323.0,
      "replies": []
    },
    {
      "id": "m61nux0",
      "author": "CiraKazanari",
      "body": "The quest 3 is higher end, so no they did not",
      "score": 1,
      "created_utc": 1736343133.0,
      "replies": []
    },
    {
      "id": "m61vguo",
      "author": "punkrocknight",
      "body": "I would never buy a META product.",
      "score": 1,
      "created_utc": 1736345984.0,
      "replies": []
    },
    {
      "id": "m66oilg",
      "author": "ober0n98",
      "body": "Oh no, what will the ten buyers do",
      "score": 1,
      "created_utc": 1736403242.0,
      "replies": []
    },
    {
      "id": "m5z1mwf",
      "author": "AccomplishedBrain309",
      "body": "They were unable to censer its content.",
      "score": 1,
      "created_utc": 1736298399.0,
      "replies": []
    },
    {
      "id": "m5w86gl",
      "author": "HellxKnight",
      "body": "Saw this coming",
      "score": 1,
      "created_utc": 1736267980.0,
      "replies": []
    },
    {
      "id": "m5wcmiy",
      "author": "DocHolidayPhD",
      "body": "Hahahahahahaha!",
      "score": 0,
      "created_utc": 1736269284.0,
      "replies": []
    },
    {
      "id": "m5wfytp",
      "author": "MakarovIsMyName",
      "body": "I am having fries & filet o fish sammiches for lunch.",
      "score": -4,
      "created_utc": 1736270267.0,
      "replies": [
        {
          "id": "m9mv0hf",
          "author": "Acrobatic_Cow7637",
          "body": "hilarious, did you make that up yourself?",
          "score": 0,
          "created_utc": 1738072066.0,
          "replies": [
            {
              "id": "m9nutwu",
              "author": "MakarovIsMyName",
              "body": "makes more sense than this shit article",
              "score": 1,
              "created_utc": 1738082984.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m5w3yk4",
      "author": "RolePuzzleheaded7400",
      "body": "When will the PC dongle for the PSVR2 become readily available? That's what I want to know.",
      "score": 0,
      "created_utc": 1736266734.0,
      "replies": []
    },
    {
      "id": "m5xsq2h",
      "author": "j_knolly",
      "body": "People actually bought these useless things ?",
      "score": -8,
      "created_utc": 1736284343.0,
      "replies": []
    },
    {
      "id": "m5y1z44",
      "author": "CoasterThot",
      "body": "RIP, one of the only ways to get into your Facebook account if it was hacked or locked out. People would buy these, and then Facebook would somehow magically be able to unlock your account, when it wouldn’t, before.",
      "score": -3,
      "created_utc": 1736287004.0,
      "replies": []
    },
    {
      "id": "m5xotuq",
      "author": "ftatman",
      "body": "They forgot the absolutely golden rule:\n\n*Nobody wants to wear stupid shit on their face.*",
      "score": -9,
      "created_utc": 1736283231.0,
      "replies": []
    },
    {
      "id": "m5yf63w",
      "author": "None",
      "body": "[deleted]",
      "score": -2,
      "created_utc": 1736291036.0,
      "replies": [
        {
          "id": "m5zipmd",
          "author": "evergreencenotaph",
          "body": "Tell us who, wise man",
          "score": 1,
          "created_utc": 1736304247.0,
          "replies": []
        }
      ]
    }
  ]
}