{
  "post": {
    "title": "DJI Mavic 4 Pro review: A new standard for consumer drones",
    "author": "dapperlemon",
    "id": "1kuxjgd",
    "score": 339,
    "created_utc": 1748161117.0,
    "selftext": "",
    "num_comments": 29,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kuxjgd/dji_mavic_4_pro_review_a_new_standard_for/"
  },
  "comments": [
    {
      "id": "mu5kyun",
      "author": "f_14",
      "body": "FYI, DJI made all the reviewers getting early release models let DJI review the video before they could publish it. DCRainmaker did a good review of the tracking system on this after refusing to let them see it and they were not great. ",
      "score": 224,
      "created_utc": 1748172201.0,
      "replies": [
        {
          "id": "mu5qjnv",
          "author": "QuestGiver",
          "body": "Nice! Not biased at all then /s",
          "score": 47,
          "created_utc": 1748174891.0,
          "replies": []
        },
        {
          "id": "mu6tln4",
          "author": "magicwuff",
          "body": "This is a worrying trend in the review industry at large. Wasn't there just something about Nvidia not releasing drivers for new cards unless reviewers agreed to something like this?",
          "score": 56,
          "created_utc": 1748188365.0,
          "replies": [
            {
              "id": "mu7acff",
              "author": "whyunoname",
              "body": "Reviews in general are cooked.\n\nCompanies that have the market cornered (think Nvidia, DJI, etc.) only give early access to people that simp for them and withhold product and drivers until launch.  This way all the sites are flooded with positive reviews that become the reviews with most views and likes.\n\nThen you have the Amazon, Twitch, social media problem.  Influencers, bots, and people that get free product/paid flood platforms with good reviews.\n\nBasically, the internet has shifted and become a dishonest ecommerce tool.  You still have honest sites like Gamers Nexus, DCRainmaiker, etc. but overall, it is mostly fake.  Add to the problem review baiting for shocking content for clicks and ad revenue.\n\nOnly thing consumers can do is not have FOMO.  Let the product get released and check multiple mediums for reviews.  Stop preordering.  This comes with the bot/scalper challenge though.\n\nTL:DR: reviews are fake and controlled most of the time.  Only thing you can do is wait until long after launch and contest scalpers at a later date.  Still better than buying junk early and being stuck.",
              "score": 39,
              "created_utc": 1748193375.0,
              "replies": [
                {
                  "id": "mu7cv0z",
                  "author": "SsooooOriginal",
                  "body": "To me, the writing was on the wall when somewhere about a decade ago amaxon quietly removed the search result filters as if they never existed and quietly allowed the clearly bribed/bought/generated reviews of turd products to constantly be upthumbed to the top.\n\n\nWay back when you could granularly get results, now they are all sponsored and enshitification abounded.",
                  "score": 12,
                  "created_utc": 1748194110.0,
                  "replies": [
                    {
                      "id": "mu7kb9v",
                      "author": "whyunoname",
                      "body": "Agreed.  Even just looking for a product is horrible now.\n\nSuggested/recommended/promoted randomly inserted into feed.\n\nFilters removed and/or searches reset when looking.\n\nBasically, ecommerce is dead.  You will be directed and told what to buy with accompanying reviews to support it.  The kicker is most are too braindead to comprehend this, and the model works.\n\nControl searches > control reviews > monopolize > repeat.\n\nEdit: add the whole collect your data from apps (the worst) and cookies (hard to reject) to drip feed you.  There is a reason prices are better or only available in the app.  They share data to continue to tell you what you are going to buy.",
                      "score": 5,
                      "created_utc": 1748196298.0,
                      "replies": []
                    },
                    {
                      "id": "muq77y0",
                      "author": "akeean",
                      "body": "As someone who worked with an amazon partner for SEA 15 years ago: They were *terrible* with that stuff even back then.\n\nThere was no way to restrict their api output to a category of kids products. So if you had a site that wanted to just show a feed of products related of plush teddies for kids, there'd be no way to filter out \"sexy lingerie\" or \"sex toys\" or whatever item that had the word \"teddy\" or \"plush\" in their name, so you had to have people that would daily screen and blacklist the newly added amazon inventory so those product would not show up in your site.\n\nAt least ebay a the time had the option to do negative keywords, but amazon when I last tried still doesn't. Wich is why for ages the only sane way to search amazon was through Google. (At the same time you have the google shopping tab, which is a total mess as well)",
                      "score": 1,
                      "created_utc": 1748450728.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mu9qhoo",
                  "author": "JD-D2",
                  "body": "I agree that the general state of product reviews has degraded but in this case I don't think Engadget is one to be bought off, their stuff is typically fine. Maybe the guy just...liked the drone, and that doesn't automatically mean he's shilling for DJI? We can't just argue with his conclusions, and instead have to believe the whole thing is purposefully dishonest? \n\nOnly say this because I see this line of thinking with a lot of folks nowadays, as if the only trustworthy reviewers are YouTubers and smaller orgs, when ironically those are often the ones who *don't* have an larger institution or actual editors enforcing stricter standards. GN and DCRainmaker are great, though, won't argue that.",
                  "score": 2,
                  "created_utc": 1748223073.0,
                  "replies": [
                    {
                      "id": "mu9si0i",
                      "author": "whyunoname",
                      "body": "I mean maybe.  When the requirements to get access are:\n\n1. Good review\n\n2. Talk good about these features\n\n3. Here is what you can compare it to and how\n\nBrands and reviews are for a large part cooked.  Again, my point was companies that do this control the narrative.  Sure, there are honest reviews later and tons of good sites and reviewers.\n\nAnd the product could be great.  The problem is you won't know for real for a while.  And odds are with things like DJI not like there are a ton of options in the same space anyways.\n\nNvidia 50 series is a perfect example.  Excluding drivers the 8/90 are good, especially if you skipped a gen.  They require early access to have a good review and talk about framegen and MFG4x.  For the new launch they withheld drivers so the good reviews were out AND you couldn't test.  Also launched at computex and buried it.  Reviewers were trashing it in hotel rooms lol.\n\nIf the customer is uninformed and doesn't know this, they are duped.  In the Nvidia example many people will end up with a 5060 and regret it now and down the road.",
                      "score": 1,
                      "created_utc": 1748223853.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "muvzhj0",
          "author": "toshgiles",
          "body": "Even his review is kids silly though. He’s trying to get a fairly larger drone to squeeze through tiny snacks, and it does rather well. \n\nThis is a pro photo and video drone rather thanks a sport drone.",
          "score": 1,
          "created_utc": 1748528510.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mu5bs77",
      "author": "D13U",
      "body": "Soooo expensive.... Too bad they defined the new standard... ",
      "score": 49,
      "created_utc": 1748167052.0,
      "replies": [
        {
          "id": "mu5ca71",
          "author": "Nolanthedolanducc",
          "body": "So many of the drones are like that! It’s weird they focus so much on these multi thousand dollar drones when the majority of sales come from their sub 250 gram, more budget options!",
          "score": 26,
          "created_utc": 1748167350.0,
          "replies": [
            {
              "id": "mu5fabs",
              "author": "WolpertingerRumo",
              "body": "Because this is not consumer market, it’s the professional market. If you’re a professional photographer, a few thousand for a tool are not shocking. If you’re a consumer, it really is.\n\nThe wording is wrong",
              "score": 43,
              "created_utc": 1748169135.0,
              "replies": [
                {
                  "id": "mu5qukv",
                  "author": "Linniunicorn",
                  "body": "I mean the thing is called \"Pro\" in the name.",
                  "score": 5,
                  "created_utc": 1748175028.0,
                  "replies": [
                    {
                      "id": "mu5r4g5",
                      "author": "WolpertingerRumo",
                      "body": "Yeah, haha, I meant the wording of the article. The drone is perfectly named",
                      "score": 7,
                      "created_utc": 1748175148.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mu6ef9d",
                  "author": "amateurbreditor",
                  "body": "I wanted to get into this to showcase my work but for 3000 jesus. Theres no way in hell the markup on this isnt like 95%.",
                  "score": -11,
                  "created_utc": 1748183693.0,
                  "replies": [
                    {
                      "id": "mu6upo4",
                      "author": "iamacannibal",
                      "body": "The mark up is likely pretty high. Not 95% high but they are for sure making a decent profit for each one of these...but they earned it. DJI has been consistently putting out the best consumer and pro level drones for the last 10 years with regular updates. They even continue to support older models with software updates and repairs.",
                      "score": 7,
                      "created_utc": 1748188701.0,
                      "replies": [
                        {
                          "id": "mu9mdah",
                          "author": "HesSimplyShocking",
                          "body": "Agreed.  This sounds like a great successor to the Mavic 3.",
                          "score": 1,
                          "created_utc": 1748221514.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "muohjn1",
                      "author": "Alohagrown",
                      "body": "It's not that bad compared to most pro-level photo and video equipment.  Look at what hasselblad cameras cost by themselves and that doesn't even include flying capabilities.  Pro videographers can make that back with a couple gigs.",
                      "score": 1,
                      "created_utc": 1748430953.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mu6mqgx",
              "author": "scarr09",
              "body": "\nWhat is now 'the top of the line' is going to be entry level in a decade because innovation trickles down. And if you lead the top end, you can dominate in the lower end. That's the entire reason why DJI is pretty much the only 'proper' mass appeal drone company in the world.\n\nLook at even the original Mavic pro and compare that to the \"budget line\" of a Mini 3 pro. 6 years to go from one to the other. And the M3Pro is better in every measurable way except speed and weight. A better camera, better sensors, better distance, an insane amount of features.",
              "score": 4,
              "created_utc": 1748186293.0,
              "replies": []
            },
            {
              "id": "mu66lfs",
              "author": "None",
              "body": "[removed]",
              "score": 2,
              "created_utc": 1748181133.0,
              "replies": [
                {
                  "id": "muvxq9n",
                  "author": "toshgiles",
                  "body": "They put that onto Lexus.",
                  "score": 1,
                  "created_utc": 1748528002.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mub6ec6",
              "author": "tignasse",
              "body": "thats because multi thousand dollar drones are mostly for professionals, whom are less concerned with flight restrictions.\n\nnon professional stop using their drones because of annoying flight rrestriction zones, which are almost everywhere in some countries. check the second hand market up there are tons of drones, people are reselling them because you cant use drone where u want :(",
              "score": 1,
              "created_utc": 1748247705.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mu6ymc3",
      "author": "Earthiness",
      "body": "I watched a couple early reviews and this drone didn’t look good. Especially watching the rainmaker review, it seemed like their tracking tech regressed.",
      "score": 14,
      "created_utc": 1748189905.0,
      "replies": []
    },
    {
      "id": "mu7471v",
      "author": "Sad-Muffin5585",
      "body": "Is “works at night” becoming a basic feature?\n\nAsking on behalf of r/UFOs where there is a not-insignificant number of people thinking they regularly see “orbs” and “jellyfish” and whatnot vs the old school flying saucer.",
      "score": 7,
      "created_utc": 1748191579.0,
      "replies": []
    },
    {
      "id": "muhdsgp",
      "author": "Befuddled_Scrotum",
      "body": "Crazy what a war will do to help accelerate RnD",
      "score": 3,
      "created_utc": 1748334197.0,
      "replies": []
    },
    {
      "id": "mub4z8n",
      "author": "tignasse",
      "body": "3 lenses for mavic pro\n\n2 lenses for Air \n\n<3 awesome products but so expensive :(",
      "score": 1,
      "created_utc": 1748246843.0,
      "replies": []
    }
  ]
}