{
  "post": {
    "title": "OnePlus Open 2: \"World's next thinnest foldable smartphone\" tipped to be made with titanium [Rumour]",
    "author": "RenegadeUK",
    "id": "1hy4p1m",
    "score": 0,
    "created_utc": 1736516678.0,
    "selftext": "",
    "num_comments": 11,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hy4p1m/oneplus_open_2_worlds_next_thinnest_foldable/"
  },
  "comments": [
    {
      "id": "m6efqqs",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736516679.0,
      "replies": []
    },
    {
      "id": "m6epwyd",
      "author": "internetlad",
      "body": "Too bad I've blackballed OnePlus for their exploitative trade-in practices (charged me extra saying my phone did not work when I traded it in, I suspect the battery was dead.) and then refused to test it putting the onus on me (did you take a picture of it working as you boxed it up to send it in? They ask)\n\n\nThen I got ahold of them to register a complaint and they clearly don't give a shit. The open is a good phone for the money but fuck that company.",
      "score": 10,
      "created_utc": 1736520275.0,
      "replies": [
        {
          "id": "m6fkrtg",
          "author": "dryphtyr",
          "body": "I had a similar experience with them. They refused to honor their warranty and were extremely rude and unprofessional. I will never buy another OnePlus product again.",
          "score": 3,
          "created_utc": 1736529539.0,
          "replies": []
        },
        {
          "id": "m6knvz1",
          "author": "BrotherRoga",
          "body": "As a OnePlus Nord 2T owner, this makes me nervous.\n\nMaybe I should change to a Nothing phone next...",
          "score": 1,
          "created_utc": 1736602780.0,
          "replies": [
            {
              "id": "m6l9spd",
              "author": "internetlad",
              "body": "So funny story, I tried that!\n\n\nI was not impressed with the nothing 1. There was no one thing wrong with it but like. . .  It just felt not quite done yet? The build quality was okay, but there was a lot of plastic including the whole back. The glyphs were a neat concept, but ultimately useless. Had a lot of weird issues that while I can't be sure I'd attributed to their OS and software package I haven't seen on phones before or since. The specs were verrry *mehhhh*\n\n\nUltimately it was *just* enough of a let down to switch back to the Open (which is when I had the huge negative customer service experience). I'm hoping that it was just early installment weirdness (it WAS the North American beta, so maybe that explains the cell service and coverage issues)\n\n\nI'm absolutely going to be keeping an eye on Nothing going forward and hopefully the 2 or 3 are better phones because the first one wasn't it chief.",
              "score": 2,
              "created_utc": 1736610836.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m6eol2z",
      "author": "Rance_Mulliniks",
      "body": "My Samsung Flip 4 is starting to develop a crack at the fold. It's just over 2 years old. While I like the smaller footprint of a foldable phone, my next phone will not be foldable.",
      "score": 6,
      "created_utc": 1736519828.0,
      "replies": [
        {
          "id": "m6es8jk",
          "author": "bonesnaps",
          "body": "A crack, not even just a crease? On a gen4?\n\n\nSweet murphy that's brutal. I figured foldables wouldn't still be dogshit by now, that sucks.",
          "score": 1,
          "created_utc": 1736521033.0,
          "replies": [
            {
              "id": "m6ev45r",
              "author": "Rance_Mulliniks",
              "body": "Yup. A crack. There was always a crease.",
              "score": 2,
              "created_utc": 1736521948.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m6g0xcp",
      "author": "Monstrous_moonshine",
      "body": "Companies are going gaga over making thin gadgets. What's the need ? It should atleast be thick enough to hold. Thin does not mean automatically better.",
      "score": 4,
      "created_utc": 1736534172.0,
      "replies": [
        {
          "id": "m6hpkin",
          "author": "hwmchwdwdawdchkchk",
          "body": "I agree except foldables are fairly chonky, I guess mainly to avoid issues with the fold etc\n\nI don't mind personally but the difference is large",
          "score": 2,
          "created_utc": 1736552630.0,
          "replies": []
        },
        {
          "id": "m6me2a7",
          "author": "account312",
          "body": "It's all aimed at the glorious future where Motorola releases the Razr V9001, the world's first phone you can actually shave with.",
          "score": 1,
          "created_utc": 1736623425.0,
          "replies": []
        }
      ]
    }
  ]
}