{
  "post": {
    "title": "AI is just a bad excuse for Samsung and Apple's lazy phone hardware | The AI hype train has already left the station, it's time for phone brands to get back to basics.",
    "author": "a_Ninja_b0y",
    "id": "1i9te32",
    "score": 2126,
    "created_utc": 1737829578.0,
    "selftext": "",
    "num_comments": 170,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i9te32/ai_is_just_a_bad_excuse_for_samsung_and_apples/"
  },
  "comments": [
    {
      "id": "m94trp0",
      "author": "oneaffidavit1",
      "body": "The good thing about AI is -> all apples device specs are getting bumped. \n\nApple doubled the RAM on macs and made all iphones with minimum 8GB of RAM. This wouldn't have happened without AI stuff. \n\nThe only thing I need is the ability to turn off AI completely and opt out of stuff.",
      "score": 394,
      "created_utc": 1737830751.0,
      "replies": [
        {
          "id": "m94v3wd",
          "author": "SsooooOriginal",
          "body": "Best we can do is hide any indication that the AI is constantly learning your patterns and opting you in when you think the device is off. Ignorance is something.",
          "score": 145,
          "created_utc": 1737831132.0,
          "replies": [
            {
              "id": "m95eytc",
              "author": "Main_Ad1594",
              "body": "Linux and custom android roms exist and keep getting better. There is an alternative ",
              "score": 20,
              "created_utc": 1737837019.0,
              "replies": [
                {
                  "id": "m95nriz",
                  "author": "SsooooOriginal",
                  "body": "No offense, but thats pissing in the wind when most people still don't even change their router defaults and don't care to.",
                  "score": 80,
                  "created_utc": 1737839698.0,
                  "replies": [
                    {
                      "id": "m9749g6",
                      "author": "TryingT0Wr1t3",
                      "body": "> router defaults\n\nLike openwrt or password?",
                      "score": 6,
                      "created_utc": 1737856977.0,
                      "replies": [
                        {
                          "id": "m97658h",
                          "author": "SsooooOriginal",
                          "body": "Most people change the password only when the software basically forces them to. And that is just for default user.\n\n\nDid you check if their is an admin default for your router? Because many people you ask that won't even understand what is meant.",
                          "score": 12,
                          "created_utc": 1737857635.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m97vn22",
                  "author": "Substantial_Boiler",
                  "body": "Hardware attestation also exists. Play Integrity Fix recently died as well. \n\nMost custom ROMs are no longer viable for daily-driving.",
                  "score": 3,
                  "created_utc": 1737867339.0,
                  "replies": [
                    {
                      "id": "m99t3m4",
                      "author": "SsooooOriginal",
                      "body": "You will take the bloat(spy)ware and like it, citizen S_B387288387q904758o3!",
                      "score": 3,
                      "created_utc": 1737902932.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m95mfnh",
                  "author": "ThisUsernameis21Char",
                  "body": "> Linux and custom android roms exist and keep getting better.\n\nGreat comment to leave in a comment chain about iPhones.",
                  "score": 8,
                  "created_utc": 1737839293.0,
                  "replies": [
                    {
                      "id": "m964yr2",
                      "author": "senescal",
                      "body": "He said there's an alternative. Alternative.",
                      "score": 17,
                      "created_utc": 1737845077.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m97cikx",
              "author": "soonerfreak",
              "body": "Why a personal assistant that learns and gets better is bad? What did steps did people think we would take between now and like Cortana?",
              "score": -10,
              "created_utc": 1737859884.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m98abjy",
          "author": "None",
          "body": "Well theres no apple intelligence in the EU, so we already have that “optout” option",
          "score": 13,
          "created_utc": 1737874579.0,
          "replies": []
        },
        {
          "id": "m95ge14",
          "author": "Fritzschmied",
          "body": "Yeah now you have 16 gb ram instead of 8 but 10 gb of it is permanently occupied by some ai task you can’t deactivate.",
          "score": 39,
          "created_utc": 1737837455.0,
          "replies": [
            {
              "id": "m95wve1",
              "author": "andynormancx",
              "body": "You can turn off the Apple AI stuff.",
              "score": 24,
              "created_utc": 1737842485.0,
              "replies": [
                {
                  "id": "m95y6nk",
                  "author": "Fritzschmied",
                  "body": "U sure about that? That that setting actually turns off everything?",
                  "score": -11,
                  "created_utc": 1737842902.0,
                  "replies": [
                    {
                      "id": "m96i1lf",
                      "author": "Strong-Estate-4013",
                      "body": "Yah",
                      "score": 13,
                      "created_utc": 1737849444.0,
                      "replies": []
                    },
                    {
                      "id": "m9dupgc",
                      "author": "jaypeeh",
                      "body": "![gif](giphy|bjB3gtFvREqqr5NAHW)",
                      "score": 1,
                      "created_utc": 1737944922.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m975gmj",
              "author": "floppyclock420",
              "body": "That’s not how ram works.",
              "score": -1,
              "created_utc": 1737857395.0,
              "replies": [
                {
                  "id": "m97vyla",
                  "author": "Shadowhawk109",
                  "body": "It kind of is, though.\n\nIf you have some 2GB task that can't be turned off, that's just 2GB that is constantly in use, even if its in a best-case-scenario getting paged in and out (which really is arguably worse, because thats so much completely unneccesary I/O)",
                  "score": 16,
                  "created_utc": 1737867478.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m962uq3",
          "author": "valryuu",
          "body": "Same on Samsung phones. The base S line was stuck at 8GB of RAM since the S10 until now.",
          "score": 3,
          "created_utc": 1737844397.0,
          "replies": []
        },
        {
          "id": "m96z1xq",
          "author": "themanfromvulcan",
          "body": "You can turn off Apple intelligence on an iPhone.",
          "score": 3,
          "created_utc": 1737855182.0,
          "replies": []
        },
        {
          "id": "m956k0c",
          "author": "StressfulRiceball",
          "body": "The degree of hardware optimization they do is insane. \n\n\nI'm an Android user but games always run about 2x faster on equal gen iPhones despite having MUCH lower hardware spec. Enough to get me to switch to iPhones for a generation just for gaming performance alone.\n\nI mean, I still went back to Android for UI and everything else, but man, the gaming was great.",
          "score": 8,
          "created_utc": 1737834460.0,
          "replies": [
            {
              "id": "m95xexw",
              "author": "andynormancx",
              "body": "Equal gen iPhones are not lower hardware spec than the Android phones. Yes they have less RAM (in some years a lot less). But Apple’s CPUs and GPUs are still way ahead of the ones the Android manufacturers have available to them.",
              "score": 26,
              "created_utc": 1737842658.0,
              "replies": [
                {
                  "id": "m97vtbm",
                  "author": "Substantial_Boiler",
                  "body": "This hasn't been true for like 2 generations-ish, unless if you're referring to M chips from iPads",
                  "score": 0,
                  "created_utc": 1737867413.0,
                  "replies": [
                    {
                      "id": "m99emqy",
                      "author": "andynormancx",
                      "body": "It is true that they are catching up and last year on multi-core they were getting pretty close. But that is by throwing extra cores at the problem and there aren't many workloads that max out all those 8 cores (and still plenty of workloads that barely touch two cores).\n\nWe all know benchmarks aren't a perfect comparison, but it is the best we have to go on for a quick comparison.\n\nOn Geekbench 6 multi-core we've got the Snapdragon 8 Gen 3 devices at around 6,700. The iPhone 16 is at around 8,500.\n\nSo Apple are still 27% ahead there, even with two fewer cores.\n\nIf you look at single core you have the Snapdragon 8 Gen 3 devices around 2,100 and the iPhone 16 at 3,300.\n\nSo on single core Apple is still 57% faster. And they'll also be around the same amount faster on 2, 3, 4, 5 and 6 cores.\n\nSingle core is still the more important metric to compare to see how fast devices will actually be to use.\n\nHowever...\n\nI note the Oppo Find X8 Pro with its MediaTek Dimensity 9400 chipset. The iPhone is only 26% ahead of it in single core and it is pretty much level on multi-core (with 8 cores).\n\nAnd it does look like the Qualcomm side is going to make a bigger leap in 2025 than normal, with a single core score of around 3,100. That would be very nearly caught up with last year's iPhone, so things definitely have changed from two or three years ago. Will be interesting to see how much of a leap Apple makes in 2025 (I suspect not as much as Qualcomm/MediaTek have in the last couple of years).\n\nAnd yes, a significant part of those leaps on both sides are down to TSMC's manufacturing tiers, rather than Apple/Qualcomm/MediaTek's CPU designs.\n\nI probably overplayed my hand with \"still way ahead\", let's pretend I said \"still ahead\".\n\nHowever the claim I was countering was iPhones have \"MUCH lower hardware spec\", with the implication that over multiple generations games were only faster on iPhones because on Android the aren't \"optimised\" enough or they are being held back by having to run on low end Android devices as well. When the truth is if games were running faster on iPhones over the years it was mainly because the iPhone hardware was much faster than the Android side.",
                      "score": 3,
                      "created_utc": 1737897525.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m95xgau",
              "author": "MultiMarcus",
              "body": "Well, no, that is not really true. Apple has best in class chips, didn’t they win the performance race of all the phones last year? They skimp out on RAM, but a lot of ram on phones has always felt like a way for Android makers to mitigate software inefficiencies. \n\nAlso, it is kind of the video game console thing of the largest console sales wise being the focus. iPhones are the most popular single brand of phone and Apple users notoriously are worth more as they spend more money.",
              "score": 12,
              "created_utc": 1737842670.0,
              "replies": []
            },
            {
              "id": "m957295",
              "author": "_RADIANTSUN_",
              "body": "This is more due to Android developers targeting lower end phones than any special optimization on the part of Apple",
              "score": 6,
              "created_utc": 1737834611.0,
              "replies": [
                {
                  "id": "m9579l9",
                  "author": "StressfulRiceball",
                  "body": "I mean, my iPhone 6S ran games better than my Galaxy Note 8 lmfao, much higher FPS and instant loading\n\nEdit: nvm I misunderstood your point, you're saying the FPS difference is from app optimization. I would assume it's very easy for devs to optimize for Apple devices since they're heavily standardized as well.",
                  "score": 9,
                  "created_utc": 1737834672.0,
                  "replies": [
                    {
                      "id": "m958hf3",
                      "author": "_RADIANTSUN_",
                      "body": "Yea because they probably targeted the 6S whereas the Note 8 was a high end premium device that was still a relatively small slice of the Android market so nobody specifically targets it unless Samsung explicitly collabed with them like Fortnite. Specially if you had an Exynos model.",
                      "score": -6,
                      "created_utc": 1737835039.0,
                      "replies": [
                        {
                          "id": "m95cj8b",
                          "author": "oriolid",
                          "body": "Samsung is almost half of Android market, so I think it would make sense to optimize for them. But, if Galaxy Note is a high end phone, shouldn't games made for slower phones just run faster on it?",
                          "score": 10,
                          "created_utc": 1737836274.0,
                          "replies": [
                            {
                              "id": "m96bret",
                              "author": "_RADIANTSUN_",
                              "body": "\"Samsung\" isn't one flagship Galaxy S phone, they have a much more fragmented phone lineup than Apple, the best selling Android phone last year was Samsung Galaxy A15 4G (i.e. not one of the flagship Galaxy S lineup, comes with a considerably shittier MediaTek chipset).",
                              "score": 0,
                              "created_utc": 1737847325.0,
                              "replies": [
                                {
                                  "id": "m98s246",
                                  "author": "oriolid",
                                  "body": "You're absolutely right. And for example Galaxy A15 is actually 19 slightly different models (SM-A155F, SM-A155F/DSN, SM-A155M, SM-A155M/DS, SM-A155P, SM-A155R, and SM-A156B, SM-A156B/DS, SM-A156P, SM-A156P/DS, SM-A156U, SM-A156U1, SM-A156U1/DS, SM-A156W, SM-A156P/N, SM-A156P/DSN, SM-S156VL, SM-A156M, SM-A156E, SM-A156E/DSN for 5G). I understood the discussion was about why the flagship models are so underperforming, though. The #2 brand is by the way Xiaomi and everyone knows they are crap but they are cheap so who cares.",
                                  "score": 2,
                                  "created_utc": 1737885211.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m95xviu",
                          "author": "andynormancx",
                          "body": "If they Android developers had targeted the low end phones then it would have run even faster on the much faster CPU/GPU on the Note 8. The Note 8 ran several times faster than the low end phones of that year.",
                          "score": 6,
                          "created_utc": 1737842804.0,
                          "replies": [
                            {
                              "id": "m96b6wz",
                              "author": "_RADIANTSUN_",
                              "body": "Games are limited in resolution and fps on phones for performance reasons, it's not like on PC where better hardware =  higher FPS for example. E.g. Doesn't matter if you have a 144Hz, 1440p display, many games will just be locked to 60FPS 720p or 1080p. Maybe the 6S was targeted so they could push better graphics etc on that specific device. I guess it depends on the specific game, I really haven't run into any games that the top Samsung of the year doesn't run basically perfectly.",
                              "score": 2,
                              "created_utc": 1737847136.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m95km9m",
                          "author": "Fit_Specific8276",
                          "body": "that makes no sense, it’s not gonna run worse on better hardware just because it wasn’t the target",
                          "score": 2,
                          "created_utc": 1737838738.0,
                          "replies": [
                            {
                              "id": "m96beil",
                              "author": "_RADIANTSUN_",
                              "body": "They're not specific about what they mean by performing worse, e.g. Many games are locked to lower res and framerate.",
                              "score": 3,
                              "created_utc": 1737847206.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m96i4wt",
                  "author": "DeusSpaghetti",
                  "body": "Not the high end androids. It's the same chips.",
                  "score": 0,
                  "created_utc": 1737849476.0,
                  "replies": [
                    {
                      "id": "m96mhxn",
                      "author": "_RADIANTSUN_",
                      "body": "That's why I said they target the lower end androids which have lower end chips.",
                      "score": 3,
                      "created_utc": 1737850942.0,
                      "replies": [
                        {
                          "id": "m96wnyl",
                          "author": "DeusSpaghetti",
                          "body": "Oops, I might have replied to the wrong comment.",
                          "score": 3,
                          "created_utc": 1737854353.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m9f2ghb",
                  "author": "StopAndReallyThink",
                  "body": "cope",
                  "score": 0,
                  "created_utc": 1737963520.0,
                  "replies": [
                    {
                      "id": "m9ffv6q",
                      "author": "_RADIANTSUN_",
                      "body": "nope",
                      "score": 2,
                      "created_utc": 1737971896.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m9aicf8",
          "author": "None",
          "body": "AI can also help code and optimize anything. Apple as a company is more efficient now. But whether that translates to good products remains to be seen.",
          "score": 1,
          "created_utc": 1737910526.0,
          "replies": []
        },
        {
          "id": "m97vpz9",
          "author": "Shadowhawk109",
          "body": "that almost makes up for the fact that apple RAM and SSD storage are about half of what they should be (and can't be expanded aftermarket)",
          "score": 1,
          "created_utc": 1737867374.0,
          "replies": []
        },
        {
          "id": "m96im56",
          "author": "No_Mercy_4_Potatoes",
          "body": "That's just how terrible Apple specs used to be. They are just catching up to industry standards (of mid level Android phones). Don't think they should get any praise for it.",
          "score": -2,
          "created_utc": 1737849637.0,
          "replies": []
        },
        {
          "id": "m97ac9r",
          "author": "nero40",
          "body": "Good luck on that last sentence. AI is gonna be opt-out instead of opt-in for the next incoming update. I can very much see how it will be mandatory moving forward.",
          "score": -1,
          "created_utc": 1737859111.0,
          "replies": []
        },
        {
          "id": "m97l34s",
          "author": "Odd_Gold69",
          "body": "I love how the conclusion to this is \"AI sucks cause we don't get new hardware but at least we get new AI hardware\" like what? 😭 Reddit needs to complain about fucking everything",
          "score": -1,
          "created_utc": 1737863042.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m94skmn",
      "author": "H0vis",
      "body": "AI is just a bad excuse for lazy *everything* right now. There are instances of it being useful, but so many people are just phoning it in (literally in this case) that it's becoming an almost meaningless feature.",
      "score": 161,
      "created_utc": 1737830407.0,
      "replies": [
        {
          "id": "m961jjj",
          "author": "None",
          "body": "[removed]",
          "score": 17,
          "created_utc": 1737843977.0,
          "replies": [
            {
              "id": "m97vqv6",
              "author": "NecroCannon",
              "body": "Crazy part is as an artist, I’m not even opposed to AI tools. Spiderverse used ML for the line work effect and Klaus used ML for the lighting to look more like a 3D model despite being 2D\n\nThe key part is though, *tools*. It shouldn’t be hard to partner up with software developers to create plugins for specific use cases. Hell considering in-between is highly outsource, making tools specifically for that could help with indie projects.",
              "score": 4,
              "created_utc": 1737867384.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m99i7l4",
          "author": "Party-Interview7464",
          "body": "I see people quoting ChatGPT is a reputable source all the time, and it scares me. I asked dad to add up my work hours the other day and it got it wrong… I did it by hand and I kept trying to get ChatGPT to add the numbers up correctly and it took a very long time. The total was 22 by the way, it wasn’t difficult.",
          "score": 11,
          "created_utc": 1737898958.0,
          "replies": [
            {
              "id": "m99l2qa",
              "author": "djamp42",
              "body": "I don't know why everyone forgot about all the other tools we have. Like a calculator. \n\nChatGPT is good for giving you ideas and then you build upon them. hard facts, math, statistics I would never trust a LLM with right now.",
              "score": 10,
              "created_utc": 1737900061.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m96bauj",
          "author": "teh_fizz",
          "body": "Genemoji has to be one of The dumbest features I’ve ever seen. You’re literally using AI to generate fucking emojis? A dinosaur surfing? FUCKING SERIIUSKY? IM MELTING POLAR ICE CAPS FOR CUSTOM EMOJIS? ARE YOU SERIOUS APPLE?!",
          "score": 15,
          "created_utc": 1737847172.0,
          "replies": [
            {
              "id": "m97d1qg",
              "author": "3-DMan",
              "body": "EIGHT CPU CORES INITIALIZING FOR POOP EMOJI",
              "score": 11,
              "created_utc": 1737860072.0,
              "replies": []
            },
            {
              "id": "m984p2i",
              "author": "SprucedUpSpices",
              "body": "Emojis were a mistake.",
              "score": 1,
              "created_utc": 1737871586.0,
              "replies": [
                {
                  "id": "m9dphsz",
                  "author": "buttchuggs",
                  "body": "Emojis have been around since the keyboard",
                  "score": 1,
                  "created_utc": 1737943353.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m94yhye",
      "author": "RegularVega",
      "body": "> Bigger batteries, faster charging, superior cameras, anything would be better than yet more AI for the sake of AI.\n\nInterestingly enough when those were the EXACT stuff (along with bigger screen) we got from every annual phone updates, everyone complained about “the lack of innovation in the phone space”.",
      "score": 50,
      "created_utc": 1737832106.0,
      "replies": [
        {
          "id": "m9589of",
          "author": "thisischemistry",
          "body": "The only innovations I want are nicer displays (sharper, brighter, better in challenging light), and longer battery life.\n\nI don't want AI, I don't want larger phones, I don't want thinner phones, and so on. Just give me a smartphone that will fit in my hand, do basic smartphone things, and last all day.",
          "score": 20,
          "created_utc": 1737834975.0,
          "replies": [
            {
              "id": "m98gae2",
              "author": "ChoMar05",
              "body": "Absolutely. And maybe longer support. I would have refurbished my S21 if support wasn't ending this year and Samsung is on the longer side.",
              "score": 3,
              "created_utc": 1737878058.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9580tx",
          "author": "PancAshAsh",
          "body": ">Bigger batteries, faster charging\n\nPhones are already extremely optimized for SWAP, and the only way to get a bigger battery at this point is to sacrifice size and weight. Faster charging is also not likely to be a priority simply due to the fact that faster charging of bigger batteries requires higher and higher C values, which beyond a certain point becomes infeasible.",
          "score": 5,
          "created_utc": 1737834899.0,
          "replies": [
            {
              "id": "m95jqhs",
              "author": "lowcrawler",
              "body": "... then give me a phone that's a mm thicker and double my battery size and improve the telephoto zoom.  Everyone puts huge cases on them anyway... at least make the phone big for a reason!",
              "score": 8,
              "created_utc": 1737838471.0,
              "replies": [
                {
                  "id": "m95zhi7",
                  "author": "andynormancx",
                  "body": "That doesn’t work. The phones are already not much thicker than the battery. So you are adding 1mm to a battery that is already around 5mm thick.\n\nSo you just can’t get double the battery size, you’ll get more like 20% more.\n\nTo double the battery size you need to be adding more like 5mm to the thickness of the phone. Making the phone not far off twice as thick.",
                  "score": -3,
                  "created_utc": 1737843317.0,
                  "replies": [
                    {
                      "id": "m96mu1f",
                      "author": "Atlonix",
                      "body": "They sure didn't care about adding more mm for the camera bumps. \nPhones these days are so big anyway, there should be enough space for a battery that lasts a full day of intensive use. \nI think in general for manufacturers there's no incentive to change. usually the main reason people buy new phones is because of the battery life.",
                      "score": 6,
                      "created_utc": 1737851055.0,
                      "replies": [
                        {
                          "id": "m96p0vd",
                          "author": "Firestone140",
                          "body": "Yeah. I really dislike the making my iPhone16 wobbly. It’s just wasted space, which even my case doesn’t entirely make up for. Why not make it a thicker phone and fill it up with battery? I don’t really care about the weight, but say 50% more battery time? Count me in.",
                          "score": 1,
                          "created_utc": 1737851785.0,
                          "replies": [
                            {
                              "id": "m99gpj9",
                              "author": "andynormancx",
                              "body": "Because they don't think enough people would want a much bigger and heavier phone. If they thought lots of people would buy it, they'd make it.\n\nThere are phones like you are describing on the Android side. But they a pretty niche and you don't see many people using them even though they are available (most of the people I see with them are tradespeople, because the phones tend to also be designed to cope with abuse). So the truth is, the market for big arse heavy phones just isn't big enough for companies like Apple to target.",
                              "score": 1,
                              "created_utc": 1737898368.0,
                              "replies": [
                                {
                                  "id": "m99iuv1",
                                  "author": "Firestone140",
                                  "body": "It begs the question if that’s really a thing: Do people ACTUALLY want thinner phones or do phone companies just assume we do? Same goes for the weight. At first when mobile phones started emerging they were huge, so making them smaller of course was a thing. But later on? I’ve never asked for it and don’t care if it’s a few millimeters thicker, making the camera bump stick out less.",
                                  "score": 1,
                                  "created_utc": 1737899213.0,
                                  "replies": [
                                    {
                                      "id": "m9abb22",
                                      "author": "None",
                                      "body": "[removed]",
                                      "score": 1,
                                      "created_utc": 1737908499.0,
                                      "replies": [
                                        {
                                          "id": "m9abb92",
                                          "author": "AutoModerator",
                                          "body": "Hello, /u/andynormancx! Thanks for contributing. However, your comment has been automatically removed. techradar.com is banned from /r/gadgets due to placement of malicious advertising.\n\n\"Malicious advertisments\" include, but are not limited to:\n\n* Unexpected redirection to other sites, or unexpected opening of additional background tabs\n\n* Ads for scams or malware, such as \"you've won the lottery\" or \"virus detected\".\n\n* Advertisements that run malicious script.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
                                          "score": 1,
                                          "created_utc": 1737908501.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m99tr2y",
          "author": "Duke-Von-Ciacco",
          "body": "The only innovation I want is a basic android device with digital keyboard, it would be nice if arrives in the form factor of a sidekick. Thanks.",
          "score": 1,
          "created_utc": 1737903152.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m94rrgh",
      "author": "Bennehftw",
      "body": "Siri intelligence is absolutely the dumbest thing I’ve ever had the experience of using.\n\nAnd I thought Siri was already useless.",
      "score": 57,
      "created_utc": 1737830175.0,
      "replies": [
        {
          "id": "m95tem8",
          "author": "Sialorphin",
          "body": "Same with Gemini. I used to give hey Google some basic tasks and basic questions which led to Google reading their own search result. This ability is mostly gone. It just shows me the Google Search result without reading it. Switching to Gemini will let you lose the ability to turn on the timer or activate other tasks on the phone.\n\nWtf google",
          "score": 25,
          "created_utc": 1737841410.0,
          "replies": [
            {
              "id": "m96lj3w",
              "author": "entropy_bucket",
              "body": "Oh man so much this. With the pixel buds pro i could use Google Assistant to change radio stations whilst riding my bike. With Gemini it says stuff without doing anything. It's pretty frustrating that AI is *devolving* functionality that was working.",
              "score": 13,
              "created_utc": 1737850617.0,
              "replies": [
                {
                  "id": "m98500v",
                  "author": "SprucedUpSpices",
                  "body": ">AI is *devolving* functionality that was working.\n\nThat has been Google for a few years now, even before AI.",
                  "score": 5,
                  "created_utc": 1737871739.0,
                  "replies": []
                },
                {
                  "id": "m97yqbh",
                  "author": "green_dragon527",
                  "body": "The thing is Google Assistant is AI as well. Just not a LLM. Because ChatGPT showed off a lot of what LLMs can do everyone thinks that means if you're not using one you're doing stale shit, even where it either doesn't work as well or isn't as cost effective to do so.",
                  "score": 1,
                  "created_utc": 1737868711.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m95uwaz",
              "author": "Bennehftw",
              "body": "It’s just *ai wow*\n\nI guess I thought it would be as useful as ChatGBT or something.\n\nWhy advertise it as something amazing, something worth buying the product.",
              "score": 3,
              "created_utc": 1737841871.0,
              "replies": [
                {
                  "id": "m9dpyty",
                  "author": "buttchuggs",
                  "body": "You know it’s ChatGPT right",
                  "score": 2,
                  "created_utc": 1737943501.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m96e9wr",
          "author": "kurtles_",
          "body": "at least siri activates reliably, my samsung s24U is useless when it comes to voice commands",
          "score": 1,
          "created_utc": 1737848176.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m950yoo",
      "author": "Tribolonutus",
      "body": "I honesty don’t need that AI crap… don’t want it… I wish I could buy the same phone without that for a cheaper price.",
      "score": 27,
      "created_utc": 1737832823.0,
      "replies": [
        {
          "id": "m98f6yy",
          "author": "vom-IT-coffin",
          "body": "Soon you'll get a custom vaccine developed by AI to fit your particular cancer....no fucking way anyone is going to inject something it created. I don't even trust the code it produces.",
          "score": -5,
          "created_utc": 1737877408.0,
          "replies": [
            {
              "id": "m9913ma",
              "author": "Pineapple_Assrape",
              "body": "I mean you're free to continue to trust in your cancer instead. Let's spout shit about that again when dying of incurable cancer.",
              "score": -1,
              "created_utc": 1737890668.0,
              "replies": [
                {
                  "id": "m9c8nrb",
                  "author": "vom-IT-coffin",
                  "body": "I'm all for vaccines, but not one specially tailored and only tried on me, made from something that hallucinates. Vaccines with literally no trials.",
                  "score": 1,
                  "created_utc": 1737927847.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9524ts",
      "author": "bdixisndniz",
      "body": "And lazy UX. \n\nHey who needs to have a nice interface that works for you when you can just yell at the phone.",
      "score": 8,
      "created_utc": 1737833163.0,
      "replies": []
    },
    {
      "id": "m954m9n",
      "author": "SignificantRain1542",
      "body": "AI is doing what NFTs couldn't and its sad that all it took was image generation to normalize it for everyone. Creating \"problems\" that already had solutions and foisting us with dumbass roundabout \"solutions\" or just letting us be stupid quicker. Not saying there isn't applications for it, but for the average consumer there is very little to gain using it while it learns all about you and sends that data to competent private AI data centres.",
      "score": 12,
      "created_utc": 1737833888.0,
      "replies": [
        {
          "id": "m97inzr",
          "author": "Chickenman456",
          "body": "Nah bro you don't understand it's the future and we totally need to waste water to ai generate what the cast of walking dead would look like in family guy",
          "score": 7,
          "created_utc": 1737862130.0,
          "replies": [
            {
              "id": "m9991er",
              "author": "Kiwi_In_Europe",
              "body": "It's hilarious to me that people on Reddit are still throwing around the water argument.\n\nGPT 3.5 used about 750,000 litres of water to train. A fucking paper mill will use over a million litres in a day lmao",
              "score": -3,
              "created_utc": 1737894976.0,
              "replies": [
                {
                  "id": "m99cmrc",
                  "author": "Chickenman456",
                  "body": "Water is needed to provide energy to every single prompt for every single AI model every single day.",
                  "score": 3,
                  "created_utc": 1737896664.0,
                  "replies": [
                    {
                      "id": "m99ep7q",
                      "author": "Kiwi_In_Europe",
                      "body": "Go look it up. The amount of water used is a tiny fraction of the amount that other industries use like paper and meat. I mean a fucking litre of almond milk consumes 371 litres of fresh water for fuck's sake lmao, for dairy milk it's double that, y'all are delusional.\n\nEven the verb *use* isn't really correct in this context considering that we're talking closed loop cooling systems that use treated industrial water instead of fresh water. It's essentially recycling.",
                      "score": -2,
                      "created_utc": 1737897553.0,
                      "replies": [
                        {
                          "id": "m99f1z0",
                          "author": "Chickenman456",
                          "body": "I wouldn't really be making the comparison to the dairy and meat industry here, considering those industries are notoriously bad for the environment as well lol\n\nEven so, those industries provide things we actually use... Chatgpt and AI art is used for novelties and replacing jobs.",
                          "score": 2,
                          "created_utc": 1737897698.0,
                          "replies": [
                            {
                              "id": "m99g005",
                              "author": "Kiwi_In_Europe",
                              "body": ">I wouldn't really be making the comparison to the dairy and meat industry here, considering those industries are notoriously bad for the environment as well lol\n\nThat's exactly my point, the amount of water being consumed annually by these and other industries is unfathomable. Ai is literally a drop in the bucket in comparison. \n\n>Even so, those industries provide things we actually use... Chatgpt and AI art is used for novelties and replacing jobs.\n\nWell to be pedantic, we don't *need* dairy milk, we want the luxury of it. Same with beef, the ratios of water consumption are 7:1 for beef vs 2.5:1 for poultry. We don't *need* beef, we could absolutely survive just eating chicken and it would be the correct environmental decision. But we want the luxury of eating it.\n\nSo since we're speaking about luxuries and novelties either way, I see no argument here for limiting or eliminating ai usage when we allow so many other forms of wasting water. Like I said, at least ai is technically recycling that water.",
                              "score": -2,
                              "created_utc": 1737898085.0,
                              "replies": [
                                {
                                  "id": "m9aw3n7",
                                  "author": "Chickenman456",
                                  "body": "I didn't say we \"needed\" dairy or meat. I'd actually argue we'd be much better off if we greatly reduced the amount of meat/dairy we produced, especially since a lot of it is wasted anyway.\n\n>So since we're speaking about luxuries and novelties either way, I see no argument here for limiting or eliminating ai usage when we allow so many other forms of wasting water. Like I said, at least ai is technically recycling that water.\n\nI don't think that means we should be making an existing problem worse.",
                                  "score": 1,
                                  "created_utc": 1737914441.0,
                                  "replies": [
                                    {
                                      "id": "m9b0tf0",
                                      "author": "Kiwi_In_Europe",
                                      "body": ">I don't think that means we should be making an existing problem worse.\n\nI would generally agree but this is the equivalent of worrying about buying a plastic bag when mega corps are throwing insurmountable amounts of pollution into the air and sea.\n\nScaling back red meat in favour of poultry is a change that would actually improve the environment, scaling back ai at this stage wouldn't. Neither training nor prompting consumes an amount of water that could be concerning.",
                                      "score": 1,
                                      "created_utc": 1737915753.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m98luft",
      "author": "Dramatic-Air-5129",
      "body": "Remember when you clowns thought ai was the future 😭",
      "score": 4,
      "created_utc": 1737881418.0,
      "replies": []
    },
    {
      "id": "m94vb4q",
      "author": "questionname",
      "body": "AI, smartphones, VR/AR it’s all boring. There’s nothing exciting or promising coming in the near future that I want to buy or have. Feels like tech is coming to a plateau",
      "score": 20,
      "created_utc": 1737831191.0,
      "replies": [
        {
          "id": "m952fwh",
          "author": "Birdhawk",
          "body": "AR has a lot of potential when it comes to practical uses in the real world. From driving directions, to finding friends in crowds, to finding stuff on your checklist in stores. But for it to really get engrained into our daily lives the wearable tech part of it hasn't been developed yet. It has to get much smaller and less invasive.",
          "score": 11,
          "created_utc": 1737833251.0,
          "replies": [
            {
              "id": "m96lx49",
              "author": "entropy_bucket",
              "body": "Are you convinced that these companies won't fill the human field of vision with ads that make living a nightmare.",
              "score": 8,
              "created_utc": 1737850748.0,
              "replies": [
                {
                  "id": "m97d3j1",
                  "author": "Birdhawk",
                  "body": "Oh no they totally will. And worse it’ll also allow people to customize how they see the “real” world. Which will put people even further into their echo chamber and more disconnected with people around them. Practical uses but yeah also some not so great side effects",
                  "score": 2,
                  "created_utc": 1737860090.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m952ui4",
          "author": "BobLoblaw_BirdLaw",
          "body": "You’re wrong about AR. In 7 years the form factor will regular looking sunglasses with the power of AI that can see everything you look at and can overlay any visual over it.  It will usher new use cases we socially can’t do by holding our phones up to our faces everywhere we go",
          "score": -8,
          "created_utc": 1737833369.0,
          "replies": [
            {
              "id": "m954bw3",
              "author": "questionname",
              "body": "I think that’ll come sooner than 7 years, like 3-4 years. But I qualified it as near future, like in 1-2 years, we’re about to run out of innovation like we had in 2010s.",
              "score": -7,
              "created_utc": 1737833803.0,
              "replies": [
                {
                  "id": "m96n0yr",
                  "author": "BobLoblaw_BirdLaw",
                  "body": "Things are going to pop up you would never imagine.",
                  "score": -4,
                  "created_utc": 1737851119.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m953kts",
      "author": "1leggeddog",
      "body": "Software has stagnated heavily in the mobile market, where as every phone has a lot of the functionality and features you'd want from the get-go, so hardware hasn't had to keep evolving as much.\n\nBasically, all i want isn't power. It's battery life.\n\nGive a multi-day battery life with regular usage and I'll be happy",
      "score": 3,
      "created_utc": 1737833583.0,
      "replies": [
        {
          "id": "m97lxh8",
          "author": "Odd_Gold69",
          "body": "Look into silicon batteries on the OnePlus 13. It's on the way.",
          "score": 1,
          "created_utc": 1737863363.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m979z7q",
      "author": "nero40",
      "body": "> The AI hype train has already left the station \n\nLmao, not even close. We will be seeing more AI stuffs for a lot more years after this.",
      "score": 3,
      "created_utc": 1737858984.0,
      "replies": []
    },
    {
      "id": "m94r16l",
      "author": "M37U",
      "body": "Yeah bro we need hardware enhancements. Software is total bullshit. If the 15 pro and s25 do ai theres no point in upgrading. At least pixel pro does it offline however a physical hardware enhancement to enhance doomscrolling would be ideal",
      "score": 20,
      "created_utc": 1737829968.0,
      "replies": [
        {
          "id": "m94tmcb",
          "author": "Snipedzoi",
          "body": "I need my sd8 elite",
          "score": 3,
          "created_utc": 1737830707.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m95jimc",
      "author": "-713",
      "body": "I just want a flip phone with a good camera and maybe the ability to do mp3 music.",
      "score": 5,
      "created_utc": 1737838403.0,
      "replies": []
    },
    {
      "id": "m94yeq9",
      "author": "internetlad",
      "body": "I am no shit going to get a pixel and put grapheneos on it until they figure their shit out. Just got the \"AI\" update today and I'm going to push it back as long as I can.",
      "score": 2,
      "created_utc": 1737832080.0,
      "replies": []
    },
    {
      "id": "m9593h8",
      "author": "Q__________________O",
      "body": "Back to basics meaning 1% better camera than last year",
      "score": 2,
      "created_utc": 1737835223.0,
      "replies": []
    },
    {
      "id": "m95h7ym",
      "author": "Sharticus123",
      "body": "Radical idea: Use tech that already exists and is more than adequate for 99% of phone user’s needs and pair it with a significantly larger battery. \n\nMy phone could easily be 50% thicker and I wouldn’t mind. Especially if it gave me another ten hours of battery life.",
      "score": 2,
      "created_utc": 1737837707.0,
      "replies": []
    },
    {
      "id": "m96olmz",
      "author": "famousxrobot",
      "body": "I skipped the 16 because the camera button/action button, and AI don’t draw me in. I’m sticking with my 11 Pro still. Battery swapped under warranty for free, so it’s got life in it. For everyday use- text, surf reddit, email, take pictures- still more or less as good as day one. Sure it’s a little slower and doesn’t support 5G, but I don’t feel encumbered by using it.",
      "score": 2,
      "created_utc": 1737851645.0,
      "replies": []
    },
    {
      "id": "m96upg2",
      "author": "BannedForEternity42",
      "body": "For many years I grabbed a new phone every 2 years.  \n\nBut since my last upgrade to a note 20, which wasn’t much improved over my previous phone, just a slightly larger screen, I’ve not bothered. \n\nNothing has really changed except the hyperbole that they use.   Software is only some minor upgrades, hardware might be a small bit faster, camera slightly better, but nothing meaningful.  \n\nUnless they can make some serious updates to their hardware, I’ll keep my note 20 until the battery stops working.",
      "score": 2,
      "created_utc": 1737853689.0,
      "replies": []
    },
    {
      "id": "m98a53b",
      "author": "Eagle115",
      "body": "NGL I have used the shit out of my Google Pixel AI. This feels like a usage case issue with one particular user than an overall one.",
      "score": 2,
      "created_utc": 1737874479.0,
      "replies": []
    },
    {
      "id": "m98k7i5",
      "author": "echostar777",
      "body": "BRING BACK GOOD HTC SMARTPHONES! BOOMSOUND FOR THE WIIIINN!",
      "score": 2,
      "created_utc": 1737880411.0,
      "replies": []
    },
    {
      "id": "m94xxyr",
      "author": "Macshlong",
      "body": "They should force opinion pieces to start with “I think” \nTime to get our news back.",
      "score": 4,
      "created_utc": 1737831945.0,
      "replies": []
    },
    {
      "id": "m94r1y8",
      "author": "Silpher9",
      "body": "At the moment AI is a slight net positive for me. I'm fine",
      "score": 3,
      "created_utc": 1737829974.0,
      "replies": [
        {
          "id": "m94rh26",
          "author": "audigex",
          "body": "It’s bang neutral for me in most cases, which means it’s a net loss because the work being done on it is effort and cost that could’ve gone into something else\n\nEg those AI parts of the SoC could’ve been adding CPU performance, the software development team working on it could’ve been making something else better etc",
          "score": 13,
          "created_utc": 1737830094.0,
          "replies": [
            {
              "id": "m94rsoy",
              "author": "Calvykins",
              "body": "Right. The money they’re spending saving me from having to dig out a thesaurus is not worth it lol.",
              "score": 7,
              "created_utc": 1737830185.0,
              "replies": [
                {
                  "id": "m94vpso",
                  "author": "audigex",
                  "body": "Yeah exactly\n\nI do use GPT and Claude etc a little - they're a little faster than Googling for some things (eg earlier I asked GPT what colour shirt buttons were for a formal tuxedo and what colour for a more general suit) and it saved me a minute of reading, but that's about the level I find value with it. Or \"find me a waterproof zigbee sensor that works with home assistant\" - again, saving me doing some trawling by giving me a few suggestions to look into\n\nTo be clear, I can definitely see potential value in AI - if I could have my noise-cancelling AirPods in and have the AI selectively block out the speech around me and translate it to English while leaving other sounds intact, for example, then that would be HUGE when travelling\n\nAnd some of the photo stuff is cool and has real value - combining photos where people are looking away, or removing someone's plus-one ex partner from a wedding photo etc, there's some cool stuff going on there and with upscaling, I like being able to take 12 megapixel photos on my old-ass camera and upscale it to look better when printed at 30x20\"\n\nBut what Apple is doing right now, really adds very little value for me beyond \"night mode\" photos (which is probably the only thing they do right now that I actually really use)",
                  "score": 2,
                  "created_utc": 1737831309.0,
                  "replies": [
                    {
                      "id": "m94xeod",
                      "author": "Calvykins",
                      "body": "Yeah at best it will save graphic designers and copy writers from having to deal with the lowest quality customers who don’t want to pay them anyway. The amount of training and money needed to make robots valuable workers could also just be spent on actual workers. \n\nAlso, paying attention to CEOs talking about AI versus the reality of AI is so funny. It’s so obvious AI has no practical day to day impact but they’re sure selling it like it does.",
                      "score": 1,
                      "created_utc": 1737831790.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m957acw",
              "author": "mrdude05",
              "body": "Yep. I have an s24 which they really marketed as an AI enhanced phone, but I barely touch my phone's AI features. The only LLM based feature I really get any use out of is the automatic voice note summaries, and even then I don't use it that often. It's a nice convenience, but it's hardly something I would consider a main selling point for the phone. The AI photo editor is also kinda cool when it works, but the quality is so inconsistent that I pretty much never use it.\n\nThese companies are throwing billions of dollars into this tech and cramming it into every device, but it still feels super superfluous and gimmicky",
              "score": 2,
              "created_utc": 1737834678.0,
              "replies": []
            },
            {
              "id": "m94wbx9",
              "author": "SimiKusoni",
              "body": "At least they're being somewhat more reserved on smartphone SoCs than those intended for laptops, some of AMDs recent chips [use \\~10-15% of the die for the NPU](https://www.techpowerup.com/323159/amd-strix-point-die-annotated-shows-zen-5-zen-5c-core-layout) which just seems silly.\n\nYou can see the NPU on the M4 in the second image [here](https://www.techpowerup.com/327130/qualcomm-snapdragon-x-elite-die-exposed-and-annotated) for comparison and it's still probably a waste imho but at least it's a relatively small waste. It would be interesting to see some data on just how many processes actually make use of it and the efficiency savings during regular use vs. just doing inference on the GPU/CPU.",
              "score": 1,
              "created_utc": 1737831483.0,
              "replies": []
            },
            {
              "id": "m95gxfb",
              "author": "Silpher9",
              "body": "Yes but what something else though.. I've got a S22ultra I don't see the reason to upgrade anytime soon. For slightly better pictures?",
              "score": 1,
              "created_utc": 1737837618.0,
              "replies": [
                {
                  "id": "m9caznx",
                  "author": "audigex",
                  "body": "That’s my point, though?\n\nThe money spent on AI could’ve been spent improving other things instead",
                  "score": 1,
                  "created_utc": 1737928489.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m968x39",
      "author": "AlwaysRushesIn",
      "body": "I have an S22 and usually upgrade my phones to a model or two behind the latest release. I will be firmly waiting until they get rid of all the ai shit before I upgrade again. If my phone shits the bed before then, I think I may be looking at flip phones.",
      "score": 2,
      "created_utc": 1737846382.0,
      "replies": [
        {
          "id": "m97mdtk",
          "author": "Silentmaelstrom",
          "body": "You'll be waiting a long time 😂",
          "score": 1,
          "created_utc": 1737863537.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m94wq6f",
      "author": "fallbrook_",
      "body": "get a new iphone 16 pro through work and haven’t even turned the AI on. keeping the phone as dumb as possible. barely any apps and only 60gb used of the 256 available storage",
      "score": 1,
      "created_utc": 1737831594.0,
      "replies": []
    },
    {
      "id": "m94y0tr",
      "author": "BenjiSBRK",
      "body": "And laptops too, please.",
      "score": 1,
      "created_utc": 1737831968.0,
      "replies": []
    },
    {
      "id": "m95f50x",
      "author": "Agent__Blackbear",
      "body": "The AI belongs in siri, she’s so dumb rn",
      "score": 1,
      "created_utc": 1737837072.0,
      "replies": []
    },
    {
      "id": "m95hz6d",
      "author": "butter4dippin",
      "body": "I would like my phone calls to sound as clear as a song on my sound system. Phone companies need to petition the FCC to free up some radio bands for cell phone calls.",
      "score": 1,
      "created_utc": 1737837935.0,
      "replies": []
    },
    {
      "id": "m95ixck",
      "author": "blood4lonewolf",
      "body": "Bring back headphone jacks and expandable storage 😉",
      "score": 1,
      "created_utc": 1737838224.0,
      "replies": []
    },
    {
      "id": "m95t2nv",
      "author": "Gerdione",
      "body": "\"I say we double down and start making software features device exclusive\" -the CEOs.",
      "score": 1,
      "created_utc": 1737841308.0,
      "replies": []
    },
    {
      "id": "m95y158",
      "author": "Vegaprime",
      "body": "I will only add that my autocorrect sucks anymore on samsung. \"This amd that\" because I text amd too much.",
      "score": 1,
      "created_utc": 1737842854.0,
      "replies": []
    },
    {
      "id": "m97tzk6",
      "author": "pokemon-sucks",
      "body": "Perhaps, but ChatGPT has gotten me a lot more answers lately than Google. I did have an issue where I asked it about a question and it was BLATENTLY wrong and I had to keep asking and it never knew the right answer. I finally kept googling the answer and found it and I asked ChatGPT why it didn't know the answer since its supposed to know the entire internet and it gave me an excuse, but I do like that if I ask it a question and it gives me an answer and then I ask for sources, that it will give me sources. Which helps me double check what it's telling me.",
      "score": 1,
      "created_utc": 1737866631.0,
      "replies": []
    },
    {
      "id": "m98rg3q",
      "author": "WB_Benelux",
      "body": "I do not see how AI can improve anything for me? \n\nMy iPhone is just for calls, texting, reddit browsing, quick google searches and smarthome control",
      "score": 1,
      "created_utc": 1737884841.0,
      "replies": []
    },
    {
      "id": "m9926ky",
      "author": "hitmonng",
      "body": "I hope Sony don't join this AI bandwagon and release the next Xperia 1 AI-free like a boss",
      "score": 1,
      "created_utc": 1737891297.0,
      "replies": []
    },
    {
      "id": "m99fthk",
      "author": "jakgal04",
      "body": "AI has its place and it really is revolutionizing a lot of industries. The problem is that companies are forcing AI into every crevice it doesn't belong.\n\nFor example, I'm using AI at work, to write code and scripts and it turned something that would normally take a week into something I can do in an hour. Meanwhile, Apple is using AI to generate Memoji's and cartoon images. Why would they think that was ever going to be popular?\n\nAnother example, I have a rambling mind and its difficult for me come up with a structure for my thoughts to put on paper, whether its for a project proposal, research, etc. I use AI to come up with a template/format to use where I can then fill in the blanks. Apple has a AI email editor where you compose an email and then use AI to re-write it for you. \n\nIts just not seamless, it feels forced.",
      "score": 1,
      "created_utc": 1737898011.0,
      "replies": []
    },
    {
      "id": "m99n3jp",
      "author": "miniscant",
      "body": "Do we really even need phones?  We mostly text and wi-fi is just about everywhere. It seems like an iPod Touch or iPad could do just about as well and then we could cut out the carriers.",
      "score": 1,
      "created_utc": 1737900811.0,
      "replies": []
    },
    {
      "id": "m9a6wmn",
      "author": "spekky1234",
      "body": "Sry to burst your bubble, but AI has barely started",
      "score": 1,
      "created_utc": 1737907206.0,
      "replies": []
    },
    {
      "id": "m9adfei",
      "author": "None",
      "body": "If \"lazy\" means reusing the same designs every year, that is a good thing. I don't every screen to be wildly different like in the S1-6 days.",
      "score": 1,
      "created_utc": 1737909115.0,
      "replies": []
    },
    {
      "id": "m9bmosb",
      "author": "None",
      "body": "I had it turned on for a day or so before shutting off the features due to them draining the phone battery. Not worth it at the moment from my experience.",
      "score": 1,
      "created_utc": 1737921877.0,
      "replies": []
    },
    {
      "id": "m9d4dbt",
      "author": "darkknight302",
      "body": "Hate ai all you want but it’s the future whether you want it or not.",
      "score": 1,
      "created_utc": 1737936973.0,
      "replies": []
    },
    {
      "id": "m9dxlc6",
      "author": "Personal-Ad6857",
      "body": "Phone tech hasn’t changed for 10 years",
      "score": 1,
      "created_utc": 1737945818.0,
      "replies": []
    },
    {
      "id": "m9e7zon",
      "author": "Efficient_Ad_4162",
      "body": "You're right, we definitely need phones to focus on improving their cameras and displays and absolutely nothing else.",
      "score": 1,
      "created_utc": 1737949174.0,
      "replies": []
    },
    {
      "id": "m9j8cg8",
      "author": "jackmax9999",
      "body": "Hot take: foldable screens are the only innovation in smartphones worth a damn in the last 5 years or so. I got a foldable phone recently and I love it - finally a phone that fits in any pocket like back in the old days and a feels like an actual *object* rather than a featureless slab.",
      "score": 1,
      "created_utc": 1738016802.0,
      "replies": []
    },
    {
      "id": "m9p7nlx",
      "author": "Kruxf",
      "body": "They are lazy because people will buy any trash they put out with an extra lens glued to the back. Stop plopping down 1200$ for regurgitated crap. They might actually try to earn your business.",
      "score": 1,
      "created_utc": 1738096441.0,
      "replies": []
    },
    {
      "id": "m97loci",
      "author": "Odd_Gold69",
      "body": "I'm sick of the Reddit AI hate train when nobody can name anything it's capable of other than painting for you.\n\nIt's here and it's here to stay. I'm not saying it's good or bad. It's just more tech. Another tool. Learn how to use it or get left behind.",
      "score": 1,
      "created_utc": 1737863266.0,
      "replies": []
    },
    {
      "id": "m954id2",
      "author": "Randactbjthroaway",
      "body": "I don't really want ai on my phone. Especially if, when I go to use to to help me write, 9/10 it tells me there's a controversial word and won't do it",
      "score": 1,
      "created_utc": 1737833856.0,
      "replies": []
    },
    {
      "id": "m96ys8h",
      "author": "themanfromvulcan",
      "body": "I think this is a case of damned if they do and damned if they don’t.\n\nThey don’t do AI and ignore it, the competition uses it to sell phones:  people buy phone for a new feature and they are left out.\nReally that’s the trap all phone makers are in - what have you done new lately?  I remember I think it was iOS 13 which was mostly improvements and bug fixes and Apple was criticized for not having new features.  Then it they to a version with new features and it’s buggy they get ripped over that.\n\nFo AI Apple at least seems to be trying to make something where they don’t keep your data and are trying to be as aboveboard as possible.  And you can turn it off.  However I do think it’s a fad that will disappear over time.",
      "score": 1,
      "created_utc": 1737855087.0,
      "replies": []
    },
    {
      "id": "m94uu1p",
      "author": "arah91",
      "body": "I have not yet had the opportunity to evaluate Apple's AI capabilities, but my experiences with Samsung's Bixby and Google's AI tools have been underwhelming.\n\nI recently tested Google AI's ability by asking it to \"locate a nearby Italian restaurant with good pasta and navigate me there\". Instead of providing accurate directions, it directed me to a newspaper office that had a review of a restaurant located two hours away, which was entirely unhelpful.\n\nSimilarly, when I used Bixby to set a timer for four hours, it initially responded that it couldn’t complete the task. After repeating the request, it managed to perform the action but without explanation for the initial failure. Additionally, the voice-to-text functionality consistently introduces errors. For instance, when I instructed it to \"text my wife and ask her what she wants for dinner,\" it misinterpreted the request and sent the exact phrase \"ask her what she wants for dinner,\" failing to capture the intended meaning.\n\nWhile I am optimistic about the potential of AI and its long-term benefits, these repeated inefficiencies undermine its value. If I must continually verify and correct its output, the time investment outweighs any convenience it may offer. At that point, it becomes simpler to complete the task manually.\n\nThat said, AI is undoubtedly improving, and I remain hopeful that advancements in 2025 and beyond will deliver a more reliable and seamless user experience. However, the current capabilities do not justify the considerable hype surrounding its utility at present. I feel we are [somewhere just before the first peak](https://upload.wikimedia.org/wikipedia/commons/9/94/Gartner_Hype_Cycle.svg) on the hype train.",
      "score": 1,
      "created_utc": 1737831054.0,
      "replies": []
    },
    {
      "id": "m950s5s",
      "author": "None",
      "body": "I’m probably an outlier but I’m actually on board with a lot of the outcomes that these “AI” projects aim to produce. Calling it AI and even the hype for it is stupid and overblown if you ask me. But I do want the o have a phone with an assistant that can predict, remind and assist me. I have some problems in life because of my ADHD and certain traumas. Technology can and does help me live a fuller life. So I’m all for it. But, almost all of it is bs marketing right?\n\nThe day my iPhone can suggest something to me without input in a way that’s truly helpful, I’ll be elated. \n\nLike I constantly forget shit and have to return home after a block or two. If my phone would just remind me when it knows I’m in my car “did you forget anything this time?”, I would pay for that shit. But that’s far off and probably not realistic.",
      "score": 1,
      "created_utc": 1737832770.0,
      "replies": [
        {
          "id": "m953tpr",
          "author": "orbix42",
          "body": "You can probably get the “ask me if I forgot anything” right now with some of the fancy geofencing and other options in Reminders- take a look in the details on a new reminder and then just don’t check it off, and it’ll nag you anytime those criteria are true!",
          "score": 1,
          "created_utc": 1737833655.0,
          "replies": [
            {
              "id": "m95hjm0",
              "author": "None",
              "body": "Oh for sure! And I do have some of that enabled, it helps. Problem is I want it to be truly intelligent and predictive. Hence the lack of input bit. \n\nBecause I have to look into the future and try and predict what I’ll forget etc. It’s like my wife knows how I am to a T and can just predict my pitfalls with like forgetting stuff and has the correction already planned out and waiting. THAT to me is the AI I want. \n\nWhen I leave in the morning with my wife to get coffee, we will predictably do certain things and a good AI assistant would already have our most potential order ready to be placed or modified, at the correct place. \n\nOr when I go grocery shopping and it sees I buy formula every week consistently, sees I didn’t pay for it when I use Apple Pay, and asks if I forgot it?\nThat’s the level of predictability without input I would like from an AI. \n\nGoogle already knows what products I’m looking for just by listening for keywords and by associating geo data with certain patterns of behavior. I don’t think what I want is that far off. Profitable or not is the question really. Because all of the data that generates profit is private or at least should be. How do you pull the profit making part of a business from it and turn it entirely towards the users benefit and still make profit? That sounds like an economic structure problem.",
              "score": 2,
              "created_utc": 1737837805.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m94qeqn",
      "author": "I_Am_A_Bowling_Golem",
      "body": "\"AI phones\" are worthless without competent agents",
      "score": 0,
      "created_utc": 1737829789.0,
      "replies": []
    },
    {
      "id": "m95dsb1",
      "author": "kyngston",
      "body": "It’s not that AI is a bad excuse.  Having AI on the phone enables edge inference for things like a ChatGPT and user pattern learning without the need for a network connection. \n\nThe problem is that, that to the end user, they really don’t care if it’s happening on the phone or in some remote datacenter.  To them it loos exactly the same.",
      "score": 0,
      "created_utc": 1737836655.0,
      "replies": []
    },
    {
      "id": "m95rppn",
      "author": "JaxAustin",
      "body": "Bring it back touch ID. I’d rather have that than silly AI.",
      "score": 0,
      "created_utc": 1737840893.0,
      "replies": []
    },
    {
      "id": "m970677",
      "author": "REV2939",
      "body": "At least Samsung has folding phones.  Apple has what?",
      "score": 0,
      "created_utc": 1737855570.0,
      "replies": []
    },
    {
      "id": "m94q69a",
      "author": "None",
      "body": "He forgot MR. Google Pixel",
      "score": -1,
      "created_utc": 1737829723.0,
      "replies": []
    },
    {
      "id": "m95ftwq",
      "author": "OakNinja",
      "body": "AI is like the hinges on a door or the automatic transmission in our cars. We don’t think about the precise engineering that enables a door to swing smoothly. It becomes a seamless part of our day to day life without requiring our conscious attention. It’s simply something we use, much like a database powering an application - essential but unseen by the user. \n\nImagine Apple trying to sell the next iPhone by bragging about how nice their new file system is?",
      "score": 0,
      "created_utc": 1737837283.0,
      "replies": []
    },
    {
      "id": "m95j9l6",
      "author": "lowcrawler",
      "body": "What TF do I need AI on my phone for?\n\nNone of the \"AI search\" in google photos is better than the classic search.\n\nI can't fathom another reason I'd need AI on my phone....  to anticipate my next phone call?  Write my text for me (predictive sentence stuff has existed for years)? ... like, wtf is \"AI features on my phone\".\n\nLame excuse to put out 3 years of nearly-identical phones. Give me a better camera, give me a better battery life, more scratch/break resistance, and give me a better antenna for calls, data, and wifi.   That's it. That's what the next gen phone needs to have.... this other crap doesn't effing matter.",
      "score": 0,
      "created_utc": 1737838327.0,
      "replies": []
    },
    {
      "id": "m94wdta",
      "author": "None",
      "body": "[deleted]",
      "score": -1,
      "created_utc": 1737831498.0,
      "replies": [
        {
          "id": "m95xny1",
          "author": "No-Bother6856",
          "body": "Why would they need to stop though? Nothing is forcing anyone to buy the latest model. If you have last years model, the one before that, or the one before that, etc. And you don't see the point in upgrading, don't upgrade. Some folks are rocking very old phones or maybe their phone broke and they need to go buy a new phone now.",
          "score": 3,
          "created_utc": 1737842738.0,
          "replies": []
        },
        {
          "id": "m9512n0",
          "author": "theycmeroll",
          "body": "I think as long as enough people continue to upgrade every year, they aren’t going to stop the yearly updates. And plenty of people do upgrade every year even from last year’s phone. Those numbers are dropping, but they are also putting in less effort YoY so it’s still a net positive for them right now.\n\nPersonally I’m on the “upgrade when it dies” train at this point.",
          "score": 3,
          "created_utc": 1737832855.0,
          "replies": [
            {
              "id": "m960qbs",
              "author": "dertechie",
              "body": "I’m not on “upgrade when it dies”, but I am on “upgrade when it becomes a pain to use”.  With all the mobile authenticators we have now a properly dead phone is a huge pain in the ass.  That’s still been on average a 5 year upgrade cycle for me (iPhone 6 to XR to 16 Pro).",
              "score": 1,
              "created_utc": 1737843714.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m97m5oy",
          "author": "ARGHETH",
          "body": "No one's required to buy the new models every time, the yearly update is like cars, it's so the people who've had their phone for a while can have a new one instead of a couple years old one.",
          "score": 2,
          "created_utc": 1737863451.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m94wsyo",
      "author": "Spirited_Example_341",
      "body": "i think ai is great but i do agree some companies do over use them in their marketing and stuff",
      "score": -2,
      "created_utc": 1737831616.0,
      "replies": []
    },
    {
      "id": "m9701mj",
      "author": "Gash_Stretchum",
      "body": "Either company could offer a phone with a removable battery and physical kill switches for the Wi-Fi, camera, gps and microphone and they’d corner the market.",
      "score": -2,
      "created_utc": 1737855526.0,
      "replies": []
    }
  ]
}