{
  "post": {
    "title": "Pebble’s founder wants to relaunch the e-paper smartwatch for its fans | With help from Google, a focused team wants to make sustainable watches.",
    "author": "chrisdh79",
    "id": "1ic004x",
    "score": 1850,
    "created_utc": 1738065740.0,
    "selftext": "",
    "num_comments": 147,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ic004x/pebbles_founder_wants_to_relaunch_the_epaper/"
  },
  "comments": [
    {
      "id": "m9mg886",
      "author": "Judgement915",
      "body": "I loved my pebble watch. I wore that watch way past its lifespan and then again when fans revived the firmware.",
      "score": 429,
      "created_utc": 1738066074.0,
      "replies": [
        {
          "id": "m9mhj3m",
          "author": "redunculuspanda",
          "body": "They were great, I had a kickstarter edition and still miss a few features on my Apple Watch.",
          "score": 99,
          "created_utc": 1738066682.0,
          "replies": [
            {
              "id": "m9mreax",
              "author": "Cyphierre",
              "body": "What features do you miss?",
              "score": 29,
              "created_utc": 1738070754.0,
              "replies": [
                {
                  "id": "m9mszw2",
                  "author": "redunculuspanda",
                  "body": "Mostly the watch faces, some were very cool. \n\nalso that battery life.",
                  "score": 63,
                  "created_utc": 1738071345.0,
                  "replies": [
                    {
                      "id": "m9mvs30",
                      "author": "MajesticRat",
                      "body": "dat bat",
                      "score": 29,
                      "created_utc": 1738072338.0,
                      "replies": []
                    },
                    {
                      "id": "m9p996m",
                      "author": "SQL617",
                      "body": "Out of curiosity, what did the battery life look like?",
                      "score": 5,
                      "created_utc": 1738096882.0,
                      "replies": [
                        {
                          "id": "m9pgnzu",
                          "author": "GoosePumpz",
                          "body": "I’d get 7 days out of my Pebble Time Steel",
                          "score": 24,
                          "created_utc": 1738098921.0,
                          "replies": [
                            {
                              "id": "m9wy1gg",
                              "author": "Touchit88",
                              "body": "I get 5 days out of my galaxy watch.  Iirc my steel got 10-14.\n\n\nLoved the thing.",
                              "score": 5,
                              "created_utc": 1738192988.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m9p9wxl",
                          "author": "redunculuspanda",
                          "body": "From memory it was about 5 days, but it was a long time ago so I could be wrong.",
                          "score": 8,
                          "created_utc": 1738097063.0,
                          "replies": [
                            {
                              "id": "m9pgkbi",
                              "author": "bolts-n-bytes",
                              "body": "That sounds about right. At the time I was getting hundreds of texts a day and it still lasted 3-4 days.",
                              "score": 5,
                              "created_utc": 1738098893.0,
                              "replies": [
                                {
                                  "id": "m9pxfjn",
                                  "author": "1980-whore",
                                  "body": "Unfortunately 3-4 days now is if you are running a smart watch on max features and getting constant texts. Mine if i have it just on basic features and texts gets 20+ days.",
                                  "score": 5,
                                  "created_utc": 1738103650.0,
                                  "replies": [
                                    {
                                      "id": "m9q2x41",
                                      "author": "darraghfenacin",
                                      "body": "My 4 year old amazfit t-rex gets 4 days with workouts in there 5 days a week",
                                      "score": 3,
                                      "created_utc": 1738105285.0,
                                      "replies": [
                                        {
                                          "id": "m9q3coi",
                                          "author": "1980-whore",
                                          "body": "I rocked the gen 1 for years, the gen three is just amazing. I just didn't wanna sound like a schill as i got mine doing a review for family.",
                                          "score": 1,
                                          "created_utc": 1738105417.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m9zce1w",
                          "author": "dieplanes789",
                          "body": "My pebble Time steel frequently lasted me 2 weeks and my Pebble 2 HR typically lasted about 8 or 9 days. \n\n\nFucking loved with the pebble Time steel and was so sad that the pebble time 2 never made it to the market",
                          "score": 1,
                          "created_utc": 1738227293.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m9rhzz3",
                      "author": "LearningIsTheBest",
                      "body": "I currently have an Amazon Bip. The battery life is even better than Pebble. I get 10 or more days depending on use.\n\nThat being said, not a fan of the Chinese ownership, and the software has gotten worse. I wish an open source project would arise. Otherwise, I just can't stand a watch that needs daily charging since it's my alarm clock every morning.",
                      "score": 2,
                      "created_utc": 1738121768.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m9mk8r9",
          "author": "Governmentwatchlist",
          "body": "I did too. When I look back at pictures it IS. Pretty bulky and sticks out to me. But I loved that watch.",
          "score": 8,
          "created_utc": 1738067890.0,
          "replies": []
        },
        {
          "id": "m9ply4q",
          "author": "MaliciousMe87",
          "body": "I wore mine until it gave out, then threw it away after a few weeks. I found out you could revive them like a week later 🤦‍♂️",
          "score": 1,
          "created_utc": 1738100377.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9mg52x",
      "author": "w0mbatina",
      "body": "Are normal watches somehow less sustainable than e ink watches?",
      "score": 171,
      "created_utc": 1738066032.0,
      "replies": [
        {
          "id": "m9mgs9b",
          "author": "juntoalaluna",
          "body": "It's poorly reported. It's quite clear in his blog (https://ericmigi.com/blog/why-were-bringing-pebble-back) that he wants the company to be sustainable - ie. not target making billions, not trying to compete with Apple/Google etc. - rather than environmental sustainability.",
          "score": 217,
          "created_utc": 1738066338.0,
          "replies": [
            {
              "id": "m9mhvdt",
              "author": "fendermrc",
              "body": "I like this ethos. I can’t stand the constant cry to “create shareholder value” by innovating where a brilliant product is enough to support a company and its employees and its sources. \n\nInnovate to remain competitive, to improve, but don’t do it only for the sake of growth or market share.  \n\nI mean, many of us benefit from stock market growth, but I hate what it does to company culture.",
              "score": 118,
              "created_utc": 1738066838.0,
              "replies": [
                {
                  "id": "m9mnr5n",
                  "author": "joomla00",
                  "body": "That's the cost of going public.  There are many founder-owned type private companies that are just happy making steady profit every year.  If it's important to you, you should try to support these companies more",
                  "score": 54,
                  "created_utc": 1738069350.0,
                  "replies": []
                },
                {
                  "id": "m9n62fx",
                  "author": "ZgBlues",
                  "body": "Agreed 100%. If every business idea had to devise a plan for global domination on day one then nobody would ever create anything.\n\nIt’s the Shark Tank effect, people think any idea that isn’t scaleable to planetary proportions isn’t worth investors’ time. \n\nFuck that. If you have a product or service people like, stick with it, make your customers happy, if you earn enough to cover your costs that’s good enough in my book.\n\nAnd I don’t agree it’s because of shareholders - it’s because of a certain *type* of shareholders. After all, blue chip stocks are the most valuable not because of growth potential but because of stability.\n\nThe stock market isn’t a casino, investing isn’t gambling. And frankly no healthy company would want gamblers to invest.",
                  "score": 10,
                  "created_utc": 1738075773.0,
                  "replies": []
                },
                {
                  "id": "m9o2wq4",
                  "author": "NecroCannon",
                  "body": "And that makes me actually interested and want to buy his product if it’s good. So many people want to start a business nowadays, which is cool, but they keep chasing the rich dreams and lifestyles. A lot of successful major businesses and corporations started off as small local businesses that grew over time, they invested their time and money wisely and things worked out. That’s not the norm though or we’d have tons of competition right now in the market. At your core, you should want to start a business to solve a problem you see needs to be fixed and that you can make enough money to be sustainable. It’s why I don’t really care about the outcry for small businesses against pay raises, that’s a part of being sustainable, you can’t do that work by yourself and run a business.",
                  "score": 1,
                  "created_utc": 1738085279.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9mhi95",
          "author": "Antique_Dot",
          "body": "I think the article's author misunderstood what the original announcement meant by sustainability, or at least mangled the meaning in the headline.\n\nThe original announcement talked about building a more sustainable company (unlike the original pebble which overcommitted to making a large number of watches it couldn't sell). The idea is to have a smaller team, which designs and markets the watches to be more tailored for a specific user base, thus lowering operating costs and being able to make smaller runs of somewhat niche tech gadgets.",
          "score": 31,
          "created_utc": 1738066671.0,
          "replies": [
            {
              "id": "m9pwsem",
              "author": "CX-001",
              "body": "Low volume typically means higher retail price tho. Dive computers (watch form factor), for instance.",
              "score": 2,
              "created_utc": 1738103460.0,
              "replies": [
                {
                  "id": "m9r4d4c",
                  "author": "NeverLookBothWays",
                  "body": "If the right balance is hit on quality however that’s not too bad of a thing.  The original Pebble watches hovered around $100-150.  When looking around for e-ink/paper replacements after Pebble closed shop there weren’t many out there.  Garmins got pretty close, but were twice the price for a fraction of the features",
                  "score": 1,
                  "created_utc": 1738117156.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9nzmbm",
          "author": "SonicDethmonkey",
          "body": "I was wondering the same thing as I read this while wearing my 20 year old Seiko automatic that doesn’t even need a battery. Can’t get much more sustainable than a basic mechanical watch.",
          "score": 6,
          "created_utc": 1738084368.0,
          "replies": [
            {
              "id": "m9r9dht",
              "author": "ksilenced-kid",
              "body": "Same, but 56 years on the 1969 automatic Seiko 5 I’m currently wearing. It stops moving ‘sustainably’ when I drop dead.",
              "score": 2,
              "created_utc": 1738118818.0,
              "replies": [
                {
                  "id": "m9r9kx2",
                  "author": "SonicDethmonkey",
                  "body": "Awesome! Love it when r/watches bleeds into other threads. lol",
                  "score": 2,
                  "created_utc": 1738118887.0,
                  "replies": []
                },
                {
                  "id": "m9rhh90",
                  "author": "vankirk",
                  "body": "I just posted a comment about my 1928 Benrus, my 1940s Elgins and a 1950s Pobeda. None require batteries. How much more sustainable is that, lol?",
                  "score": 2,
                  "created_utc": 1738121584.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9mgjg8",
          "author": "aylien119",
          "body": "I think it’s in comparison to more feature rich electronic watches, like the Apple watch",
          "score": 2,
          "created_utc": 1738066223.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9mipoy",
      "author": "TheWaywardTrout",
      "body": "I loved my pebble watch and was so sad when it died.",
      "score": 22,
      "created_utc": 1738067219.0,
      "replies": []
    },
    {
      "id": "m9neytb",
      "author": "Corgiboom2",
      "body": "Yes, please, for fucks sake. I LOVED my Pebble even though it was their cheap version. It worked amazingly well, I could read and respond to texts, get custom watchfaces, and control my phone music. Battery also lasted a solid week.",
      "score": 20,
      "created_utc": 1738078481.0,
      "replies": []
    },
    {
      "id": "m9mmezq",
      "author": "wotawanker",
      "body": "If pebble comes back i will sell my Samsung in a heartbeat, I still have my OG pebble steel and it's great, replaced the battery and changed the firmware to Rebble and it works a dream",
      "score": 47,
      "created_utc": 1738068808.0,
      "replies": []
    },
    {
      "id": "m9mpt52",
      "author": "Kike328",
      "body": "> with help from Google\n\noh no",
      "score": 71,
      "created_utc": 1738070155.0,
      "replies": [
        {
          "id": "m9n4b5j",
          "author": "Hopeful_Chair_7129",
          "body": "“Google slashes budget for funding Pebble after 34 seconds of development”",
          "score": 33,
          "created_utc": 1738075215.0,
          "replies": [
            {
              "id": "m9se6y4",
              "author": "pentaquine",
              "body": "It did not sell 1 billion units on the first day? Project cancelled. ",
              "score": 4,
              "created_utc": 1738136608.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9mqz3s",
          "author": "eras",
          "body": "The extent of the help seems to be releasing the Pebble source code under an open source license (Apache), so I think it's fine!\n\nThey got it by acquiring Fitbit which had acquired the IPR of Pebble. Event Fitbit bothered to keep the Pebble app in the store for some time. Good people all around!",
          "score": 40,
          "created_utc": 1738070596.0,
          "replies": [
            {
              "id": "m9nt2s8",
              "author": "mark-haus",
              "body": "Could also be googles secure & open source embedded OS called tock. It’s made to be used with microcontrollers that have basic security features for the likes of their 2FA devices but having worked with it I could easily see a more rudimentary watch OS be used with it as well",
              "score": 2,
              "created_utc": 1738082498.0,
              "replies": [
                {
                  "id": "m9ok1m5",
                  "author": "Ajreil",
                  "body": "I just hope the Pebble developer has a backup plan if Google randomly cancels the collaboration someday. Especially since Google purchased and then dismantled the original Pebble.",
                  "score": 5,
                  "created_utc": 1738089954.0,
                  "replies": [
                    {
                      "id": "m9pobme",
                      "author": "xXgreeneyesXx",
                      "body": "I'm not certain google can be credited for killing Pebble, if I recall correctly Pebble was already killed by Fitbit prior to them being purchased by Google. Anyways, I'm pretty sure you can't un-open-source things.",
                      "score": 2,
                      "created_utc": 1738101034.0,
                      "replies": [
                        {
                          "id": "m9pwvhb",
                          "author": "alloDex",
                          "body": "Yeah, this guy is a good engineer with a good heart but a terrible CEO. He needs someone with some financial sense to steer him towards more company-sustainable initiatives alongside doing good work.",
                          "score": 1,
                          "created_utc": 1738103486.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m9p3p6n",
          "author": "quazmang",
          "body": "I can't trust any project google touches. What is the point if they might just shutter it or stop providing support for any arbitrary reason. Or in the likely event that they steal some tech, sell a lot of units of perfectly functioning hardware, and then brick them bc of some lawsuit they get involved in...",
          "score": 5,
          "created_utc": 1738095345.0,
          "replies": [
            {
              "id": "m9pp0yz",
              "author": "Blastcheeze",
              "body": "Thankfully the only involvement Google has in this is making the Pebble’s OS open source.",
              "score": 4,
              "created_utc": 1738101228.0,
              "replies": []
            },
            {
              "id": "m9pvfvp",
              "author": "None",
              "body": "I’m still mad about Stadia.",
              "score": 1,
              "created_utc": 1738103065.0,
              "replies": [
                {
                  "id": "m9raicw",
                  "author": "Tiasthyr",
                  "body": "I'm still mad about Reader.",
                  "score": 1,
                  "created_utc": 1738119195.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9nrug2",
      "author": "None",
      "body": "It's hard to believe but props to Google for open sourcing the OS.",
      "score": 11,
      "created_utc": 1738082155.0,
      "replies": [
        {
          "id": "ma0p8r2",
          "author": "electracool",
          "body": "Their product strategy is random, but they have always had great open source ethos(*until now). ",
          "score": 1,
          "created_utc": 1738249430.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9mkmnk",
      "author": "SnowTechNo1",
      "body": "I'm still wearing my Pebble Steel every day. Using it without the bluetooth connection, getting about 2 weeks of battery life. Have changed the battery once and cleaned the internal contacts a couple of times.",
      "score": 19,
      "created_utc": 1738068056.0,
      "replies": [
        {
          "id": "m9mwy1k",
          "author": "Jackloco",
          "body": "I bought like every version and kept them in the boxes. Now I feel silly",
          "score": 3,
          "created_utc": 1738072743.0,
          "replies": []
        },
        {
          "id": "m9s3svx",
          "author": "Bringer_of_Fire",
          "body": "Is it possible to use it in a sort of airplane mode, where no signals at all come out of it?",
          "score": 2,
          "created_utc": 1738130924.0,
          "replies": [
            {
              "id": "maqcufm",
              "author": "SnowTechNo1",
              "body": "Sorry for late reply, \n\nYes, it shows an airplane symbol when bluetooth is turned off.",
              "score": 2,
              "created_utc": 1738588850.0,
              "replies": [
                {
                  "id": "marvlxx",
                  "author": "Bringer_of_Fire",
                  "body": "Cool, thanks for the info!",
                  "score": 1,
                  "created_utc": 1738605600.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9mixz0",
      "author": "sixfourtykilo",
      "body": "I know nothing about these watches. Did they have any actual smartwatch functionalities and how was the battery life? \n\nI love my Garmin and my wife has the 7x Pro Solar and that thing lasts as long as 30 days without charging.",
      "score": 21,
      "created_utc": 1738067322.0,
      "replies": [
        {
          "id": "m9mkhom",
          "author": "Governmentwatchlist",
          "body": "They were really the “first” smartwatch made with kickstarter support back when Apple not only didn’t make them but openly flaunted that it wasn’t a product people wanted.",
          "score": 53,
          "created_utc": 1738067996.0,
          "replies": [
            {
              "id": "m9q0sxi",
              "author": "JamesHeckfield",
              "body": "I believe most people wouldn’t have been interested in a Pebble. It was really for nerds. I know because I had a Pebble Steel.\n\nLoved that thing for the time I had it, then the Series 0 Watch came out and I’ve never looked back.",
              "score": 2,
              "created_utc": 1738104648.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9ml2cf",
          "author": "raptir1",
          "body": "Pebble really originated what we think of as smartwatches today. They were out before the Apple Watch and the smartwatch Fitbits. They worked well on either Android or iOS and had a pretty robust app store with a lot of community development. \n\n\nThe battery life was incredible for the time - it came out in 2013 and had 7 day battery life. I imagine an updated model would be similar to the Garmin LCD watches but I don't know if they'll go with solar for cost purposes. The 7x Pro Solar is a $1000 watch in 2025, and the Pebble cost $100 back in 2013. ",
          "score": 37,
          "created_utc": 1738068242.0,
          "replies": [
            {
              "id": "m9mm9fe",
              "author": "TheW83",
              "body": "Well, the 7x Pro is absolutely insane in functionality and nobody needs that except for extreme athletes. The instinct 3 solar basically fits any active person's needs at $450.\n\nGarmin has never really been a \"smartwatch\" maker and focuses specifically on fitness. Some of their latest ones do include basic smartwatch functionality like receiving notifications and calls.",
              "score": 15,
              "created_utc": 1738068746.0,
              "replies": [
                {
                  "id": "m9mo2bx",
                  "author": "raptir1",
                  "body": "For sure, I love my Instinct 2X but my point was that I don't expect Pebble to include solar charging if they're looking at a similar price point to the original. ",
                  "score": 5,
                  "created_utc": 1738069475.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9mvmzh",
          "author": "sioux612",
          "body": "Yeah and even the normal Garmin with normal screen and screen always on lasts almost 2 weeks\n\n\nIt was my first smartwatch and I genuinely can't understand how somebody can deal with battery life as short as Apple Watch has",
          "score": 8,
          "created_utc": 1738072288.0,
          "replies": [
            {
              "id": "m9mwx7b",
              "author": "sixfourtykilo",
              "body": "I had the original Moto 360 and I loved that watch and all of its shortcomings, but battery swell and the lack of water resistance made it a bummer. \n\nMy first Garmin was a 235 and it was fine. Limited, but finally did the things I actually needed. Then I got a screaming deal on a previous gen 935 and haven't looked back. The ten day battery life is great. \n\nBut I'm jealous of my wife's Fenix, both in terms of size (I like the bigger watch faces) and battery life. I've never seen a modern battery operated device measure its battery percentage in days instead of just a percentage number.",
              "score": 3,
              "created_utc": 1738072734.0,
              "replies": []
            },
            {
              "id": "m9nujag",
              "author": "VenomGTSR",
              "body": "I went with an Apple Watch after really enjoying my Fossil Hybrid. Went from 3 weeks battery life to maybe 4 days if I turn it off and only wear it 8 or so hours a day. It’s rough having to think about that battery life. Most of the added functionality is lost on me since I really just use it like I did my Fossil and Pebbles before it.",
              "score": 2,
              "created_utc": 1738082902.0,
              "replies": [
                {
                  "id": "m9p0o87",
                  "author": "MrDelmer",
                  "body": "Currently wearing a Fossil gen6 hybrid and i couldn't be more excited about the news from this article - mine has been showing signs of slowly dying and i cannot find anything remotely similar that would achieve the same. Very excited for this!",
                  "score": 1,
                  "created_utc": 1738094499.0,
                  "replies": []
                },
                {
                  "id": "m9q1x0j",
                  "author": "JamesHeckfield",
                  "body": "Can you charge it while you’re not wearing it? I don’t understand ",
                  "score": 1,
                  "created_utc": 1738104985.0,
                  "replies": [
                    {
                      "id": "mazj3hc",
                      "author": "VenomGTSR",
                      "body": "It’s more about long-term battery life for me. The less often you have to charge it, the longer the useful life of the battery. Also, it’s a small thing, but not needing to take a charging cable along on trips was kind of nice.",
                      "score": 1,
                      "created_utc": 1738701775.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9pbmw7",
              "author": "SQL617",
              "body": "I have the Apple Watch Ultra 2. I charge it for roughly 20 minutes in the morning as I shower and get dressed, other than that I wear it 24/7. I’ve never had an issue with low battery or being stuck with a dead battery. Sure, two weeks battery on a single charge would be cool - but that’s not necessarily a reason I’d buy one model over another. 72 hours is plenty for me.",
              "score": 2,
              "created_utc": 1738097535.0,
              "replies": []
            },
            {
              "id": "m9q1oa6",
              "author": "JamesHeckfield",
              "body": "Most people charge their phones everyday. And I’d imagine most Apple Watch owners shower regularly. And they have fast charging now. \n\nYou just plug it in while you do your self care routine and then you’re good.\n\nIt’s not like they are gonna figure out a way to get the watch to last a whole week or something. So Apple’s target is a reliable day of battery life, they aren’t going to invest a ton into improving the battery just so you only have to charge it once a week.",
              "score": 2,
              "created_utc": 1738104912.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9n0fiw",
          "author": "None",
          "body": "I have a Garmin Instinct Crossover and it includes many of the features that this new Pebble watch will have: thirty day battery life, sun-readable (transflective LCD) screen, buttons instead of a touchscreen for navigation.  I love it.  Much better than my Google Pixel Watch Gen1 that have about twelve hours of battery life and finicky touchscreen controls.\n\nThe big downside of the Garmin watches is that they're crazy expensive.  I only got mine because I was able to use a perk from work to pay for it.  These new Pebble watches could be a nice cheaper alternative.",
          "score": 3,
          "created_utc": 1738073940.0,
          "replies": [
            {
              "id": "m9p0fk8",
              "author": "ok-commuter",
              "body": "They're also massive on the wrist and nowhere near as dev friendly as the Pebbles. Pebble had over 15k watchfaces as just one example.",
              "score": 2,
              "created_utc": 1738094433.0,
              "replies": [
                {
                  "id": "m9p34iv",
                  "author": "hirsutesuit",
                  "body": "Right? If they made a Pebble as large as the 7x Pro Solar it'd easily last longer than 30 days.",
                  "score": 1,
                  "created_utc": 1738095185.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9ocw12",
          "author": "jbFanClubPresident",
          "body": "Yes, they had smartwatch functionalities. They even had their own App Store. I developed a popular game for them.",
          "score": 2,
          "created_utc": 1738088013.0,
          "replies": []
        },
        {
          "id": "m9ppyea",
          "author": "dep",
          "body": "100% -- my instinct 2 has a flashlight on the top that you can invoke with a double button press. I use this daily and can't imagine not having this on a watch now",
          "score": 2,
          "created_utc": 1738101486.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9o83wd",
      "author": "5inthepink5inthepink",
      "body": "Signed up for one! Loved my Pebble Time and Time Steel, wore them for like 10 years. Battery life for 1 to 2 weeks, actionable notifications, an easily accessible timeline, and actual side buttons so you can control your media without looking. No one has made a true replacement and I'm stoked it's coming back. ",
      "score": 6,
      "created_utc": 1738086710.0,
      "replies": []
    },
    {
      "id": "m9nr1a9",
      "author": "None",
      "body": "Still have my first kickstarter variant and the official launch device, and really loved it. As I changed careers and needed something more form fitting, I went back to the traditional style. I would love to see how their technology has progressed and wear something more sustainable.",
      "score": 5,
      "created_utc": 1738081927.0,
      "replies": []
    },
    {
      "id": "m9mqiil",
      "author": "Loafer75",
      "body": "I’d be in the market for one of these. How are the fitness apps on it ? ",
      "score": 3,
      "created_utc": 1738070423.0,
      "replies": [
        {
          "id": "m9qaecd",
          "author": "kytheon",
          "body": "I don't think mine had a heart rate meter, but it did track distances.",
          "score": 1,
          "created_utc": 1738107603.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9mx4me",
      "author": "inlineofire",
      "body": "Yesss I loved my pebble!",
      "score": 4,
      "created_utc": 1738072807.0,
      "replies": []
    },
    {
      "id": "m9nq6ca",
      "author": "soupbut",
      "body": "The pebble round was my favourite watch I've owned, I used to get compliments about it all the time. Eventually the battery died and I couldn't find a replacement :(",
      "score": 4,
      "created_utc": 1738081686.0,
      "replies": []
    },
    {
      "id": "m9n9ayp",
      "author": "None",
      "body": "[deleted]",
      "score": 3,
      "created_utc": 1738076789.0,
      "replies": [
        {
          "id": "m9pwppd",
          "author": "Vabla",
          "body": "Do you mean e-ink? Because e-paper isn't a thing. It's just pebble marketing name for reflexive LCD.",
          "score": 1,
          "created_utc": 1738103439.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9nx7up",
      "author": "RedditWhileImWorking",
      "body": "I had a pebble! It was super cool. I have a Charge 5 now and it's very similar. Maybe not quite as cool looking.",
      "score": 3,
      "created_utc": 1738083641.0,
      "replies": []
    },
    {
      "id": "m9p3sip",
      "author": "hirsutesuit",
      "body": "Not this shit again. Pebbles were never e-paper! or e-ink.\n\nThey had transflective LCD screens. Different technology.",
      "score": 3,
      "created_utc": 1738095371.0,
      "replies": [
        {
          "id": "m9pvs38",
          "author": "Vabla",
          "body": "They very deliberately call them \"e-paper\" to sound higher tech than they are.",
          "score": 2,
          "created_utc": 1738103164.0,
          "replies": [
            {
              "id": "m9pxkob",
              "author": "hirsutesuit",
              "body": "The original Kickstarter advertised Pebbles as e-paper. So I understand the confusion.",
              "score": 3,
              "created_utc": 1738103692.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9my8da",
      "author": "Brewhunter38",
      "body": "Loved my pebble",
      "score": 2,
      "created_utc": 1738073194.0,
      "replies": []
    },
    {
      "id": "m9n2fs8",
      "author": "quezlar",
      "body": "i loved my pebble\n\nim fairly happy with my apple watch but pebble was awesome",
      "score": 2,
      "created_utc": 1738074602.0,
      "replies": []
    },
    {
      "id": "m9o30lg",
      "author": "SchighSchagh",
      "body": "\"a focused team\"\n\nNope, it's just the original founder right now. He's looking to bring someone else on-board soon, but he's just solo for now.",
      "score": 2,
      "created_utc": 1738085309.0,
      "replies": []
    },
    {
      "id": "m9q1epw",
      "author": "jsheil1",
      "body": "I want one!!! I love my pebble watch. Best smart watch i ever owned! I will buy one.",
      "score": 2,
      "created_utc": 1738104832.0,
      "replies": []
    },
    {
      "id": "m9qijue",
      "author": "newshirtworthy",
      "body": "PLEASE OH MY GOD. I loved Pebble so much",
      "score": 2,
      "created_utc": 1738110170.0,
      "replies": []
    },
    {
      "id": "m9qv6gh",
      "author": "rokr1292",
      "body": "make new pebble time rounds and let me buy several of them",
      "score": 2,
      "created_utc": 1738114168.0,
      "replies": []
    },
    {
      "id": "m9sz9d9",
      "author": "AUTlSTlK",
      "body": "I loved the rectangle OG pebble watch so I really hope they bring it back",
      "score": 2,
      "created_utc": 1738149468.0,
      "replies": []
    },
    {
      "id": "m9to7wa",
      "author": "sicurri",
      "body": "Make it rectangular, and I'm down for a new ewatch. All the android watches are fucking round, I hate it... I like the physical design of the apple watch, but not the apple ecosystem. It's a fucking conundrum for me... \n\nThey do great hardware design for the most part, but their operating systems feel like shackles to me. Oof.",
      "score": 2,
      "created_utc": 1738159871.0,
      "replies": []
    },
    {
      "id": "m9oe94w",
      "author": "rocktsrgeon",
      "body": "By sustainable, you mean develop a nice watch like the pebble and not sell out and make them all e-waste like they did last time? I loved my pebble.",
      "score": 3,
      "created_utc": 1738088383.0,
      "replies": [
        {
          "id": "m9q06lw",
          "author": "tempest_87",
          "body": "They weren't e-waste. You can still get them to work on modern phones, including downloading watch faces and whatnot.\n\nThe sustainable comment was around the business model. Where they tired to get too big and develop too much new technology. As opposed to making a good watch and building and selling that good watch.",
          "score": 1,
          "created_utc": 1738104463.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9oqav5",
      "author": "shroezinger",
      "body": "Just dump money on it. It will be fine.",
      "score": 1,
      "created_utc": 1738091668.0,
      "replies": []
    },
    {
      "id": "m9p76nk",
      "author": "derickkcired",
      "body": "I loved my metal pebble. I don't remember the model name. Put a replaceable battery in it and maybe a bigger display and I'm in. I like my Garmin...it's good for about 7 days but pebbles were cost friendly too. The Garmin is not.",
      "score": 1,
      "created_utc": 1738096310.0,
      "replies": []
    },
    {
      "id": "m9p9is5",
      "author": "anitricks",
      "body": "Yes if you can extend the battery life so that you don’t have to charge every night ***Apple Watch*** with good tracking it will do well. Currently I use garmin and I just forget it’s there and charge it every 3 days. If pebble can do that and make it a week I feel like that direction would be sustainable",
      "score": 1,
      "created_utc": 1738096955.0,
      "replies": []
    },
    {
      "id": "m9ponh7",
      "author": "dep",
      "body": "I definitely recommend the Garmin Instinct 2. Monochromatic transflexive display, 1 month battery life, buttons instead of a touch screen. Definitely feels like a spiritual successor more than anything I've found.  Also my instinct 2 has a white/red toggleable flashlight on the top that you can invoke with a double button press. I use this daily and can't imagine not having this on a watch now",
      "score": 1,
      "created_utc": 1738101124.0,
      "replies": [
        {
          "id": "m9pwfrh",
          "author": "Vabla",
          "body": "And they're not using misleading names like \"e-paper\" for their screens.",
          "score": 1,
          "created_utc": 1738103357.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9q2j24",
      "author": "internetlad",
      "body": "I thought this meant the Samsung Pebble MP3 player and was like \"weird pivot after being AFK for 2 decades but aight\"",
      "score": 1,
      "created_utc": 1738105167.0,
      "replies": []
    },
    {
      "id": "m9qmaa1",
      "author": "TheOneWhoReadsStuff",
      "body": "Make one for kids.  I think this would be a great product for youngins learning to tell time.  Make sure it has a vibrating alarm.",
      "score": 1,
      "created_utc": 1738111333.0,
      "replies": []
    },
    {
      "id": "m9qsyik",
      "author": "Aksds",
      "body": "If it has heart monitoring and gps functions, I would look at this as an option for my next watch, I’m hopeful",
      "score": 1,
      "created_utc": 1738113453.0,
      "replies": [
        {
          "id": "m9sdr16",
          "author": "RiverofGrass",
          "body": "Garmin Venu 3 has heart monitoring and even EKG graph generation.  Thing showed me I had AFib.  7 day battery life.",
          "score": 1,
          "created_utc": 1738136353.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9rh0yn",
      "author": "vankirk",
      "body": "I have a Benrus that was made in 1928 and it still works, and well. I have 2 Elgin DeLuxes that were made in the 1940s. I have a Pobeda Red 12 made in 1952. And, an Elgin Sportsman made in 1960. \n\nNone require a battery.\n\nThere are sustainable timepieces out there for very reasonable prices.",
      "score": 1,
      "created_utc": 1738121425.0,
      "replies": []
    },
    {
      "id": "m9rqbv8",
      "author": "SlopTartWaffles",
      "body": "Sustainable watches. What? Hey priorities I guess.",
      "score": 1,
      "created_utc": 1738124925.0,
      "replies": []
    },
    {
      "id": "m9s7xq9",
      "author": "senpizzle",
      "body": "Please, God, yes. I kept buying Pebble 2’s for years after production ended. Everything about those watches were amazing… except the build quality of the buttons. The only reason I gave up is because they were got even more expensive every few years when I needed a new one because the silicon buttons ripped off.",
      "score": 1,
      "created_utc": 1738133095.0,
      "replies": []
    },
    {
      "id": "m9s8xf7",
      "author": "cait_elizabeth",
      "body": "Maybe I’m dumb for asking this but aren’t those expensive mechanical non smart watches like basically life lasting??? Like Rolex will last you generations providing you treat it right",
      "score": 1,
      "created_utc": 1738133633.0,
      "replies": [
        {
          "id": "ma2xn41",
          "author": "skriefal",
          "body": "They're a nice choice for those who like such things (including me).  But perhaps not for 'just anyone' who is looking for a reliable tool.  They're usually off/inaccurate by about 10 seconds per day (versus about 10 seconds per month for a quartz watch), meaning that the time will need to be adjusted every week or two if you want reasonable accuracy in the displayed time.  The date display also will need to be adjusted following the end of any month with fewer than 31 days.  And to keep the accuracy described here you'll need to have the watch serviced every 7 - 10 years or so at a cost of $200 - $300 (for basic watch; can be $500+ for a chronograph).",
          "score": 1,
          "created_utc": 1738271850.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9xvaqc",
      "author": "zdschade",
      "body": "I still wear one and bought a backup off eBay a few years ago. If we get a refresh or even rerelease I'm buying day 1 no questions.",
      "score": 1,
      "created_utc": 1738203582.0,
      "replies": []
    },
    {
      "id": "m9yvkhh",
      "author": "zorbah55",
      "body": "If you want sustainable watch, get a Seiko automatic watch",
      "score": 1,
      "created_utc": 1738217631.0,
      "replies": []
    },
    {
      "id": "ma1fu2j",
      "author": "nzswedespeed",
      "body": "E-ink makes so much sense for a watch. Doesn’t need high refresh rate, SO EASY TO SEE OUTDOORS, yet can still function as a smart watch.",
      "score": 1,
      "created_utc": 1738257041.0,
      "replies": []
    },
    {
      "id": "mbiks3z",
      "author": "Mental_Tea_4084",
      "body": "There's a giant hole in the market for cheap wearables with long battery life",
      "score": 1,
      "created_utc": 1738951106.0,
      "replies": []
    },
    {
      "id": "m9o5u8q",
      "author": "WillzyxandOnandOn",
      "body": "Yes it's the only \"smart\" watch I ever liked",
      "score": 1,
      "created_utc": 1738086090.0,
      "replies": []
    },
    {
      "id": "m9mzqmv",
      "author": "None",
      "body": "\"With help from Google\"\n\nWell, that kinda ruins the whole thing, no?",
      "score": 0,
      "created_utc": 1738073708.0,
      "replies": [
        {
          "id": "m9n3hiv",
          "author": "BlueLightning09",
          "body": "They just open sourced Pebble OS code.",
          "score": 8,
          "created_utc": 1738074945.0,
          "replies": [
            {
              "id": "m9n88bo",
              "author": "None",
              "body": "ah, that makes sense.",
              "score": 1,
              "created_utc": 1738076454.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9n6vff",
      "author": "iolmao",
      "body": "To do what? Selling it to FitBit and drop the support? \n\nNo thank you, dude.",
      "score": -1,
      "created_utc": 1738076029.0,
      "replies": []
    },
    {
      "id": "m9mu2jc",
      "author": "paco_dasota",
      "body": "oh it’s google, they’ll just drop support after a year or two",
      "score": -4,
      "created_utc": 1738071730.0,
      "replies": [
        {
          "id": "m9ns53a",
          "author": "wingspantt",
          "body": "If the source code is public now, does that matter?",
          "score": 5,
          "created_utc": 1738082237.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9o7ds4",
      "author": "Longhag",
      "body": "We already have pretty sustainable watches.  My citizen eco drive is over 10 years old and works like a charm, never needs a battery or charging.  Will likely last another couple of decades.  \n\nMy seiko kinetic is the same but 25 years old.  \n\nElectronic/smart watches are the worst for sustainability.  Just stick with old mechanical ones that can be easily repaired and don’t need a battery.  There are plenty of mechanical watches 50+ years old and going strong.",
      "score": -1,
      "created_utc": 1738086512.0,
      "replies": [
        {
          "id": "m9ozc2w",
          "author": "Plethora_of_squids",
          "body": "Even digital watches can last a pretty damn long time - I've seen some old ass digital watches where like the band falling apart or the calendar ticking over is more of a concern than the hardware failing. \n\n\nHell I went and dug out the casio I had as a kid and probably haven't worn for like a decade and while it's deffo pretty beat up, it's still working perfectly fine. Might even be on the original battery which by now is probably 15-20 years old? (if not, then this watch also withstood 13 year old me with a screwdriver and a battery from the supermarket) Probably a hell of a lot more resilient than a smart or mechanical watch too which honestly if you're talking about longevity I'd say is more a concern. Having something that can go forever doesn't quite mean as much if it can be throw out of whack by being dropped in the sink or falling down the stairs",
          "score": 1,
          "created_utc": 1738094132.0,
          "replies": [
            {
              "id": "m9psoa4",
              "author": "Longhag",
              "body": "True that, I still have an old Casio digital that works when I replace the battery.  I guess my thought was more around the sustainability side being not having to replace batteries and not using smart type watches where internal batteries die or software becomes obsolete and unusable.  A good Casio is super long lived too!",
              "score": 1,
              "created_utc": 1738102263.0,
              "replies": []
            },
            {
              "id": "m9xvkb4",
              "author": "IAmYourDadDads",
              "body": "I have a first gen garmin instict and it’s like 5 years old now. I replaced the band once and other than some disagreements with iOS it works great",
              "score": 1,
              "created_utc": 1738203669.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9pbfgh",
      "author": "None",
      "body": "Who can afford to buy shit like this these days?",
      "score": 0,
      "created_utc": 1738097479.0,
      "replies": [
        {
          "id": "m9sd7s6",
          "author": "ton2010",
          "body": "A watch?",
          "score": 1,
          "created_utc": 1738136044.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9mn46y",
      "author": "OddNothic",
      "body": "Had the original, it kept overheating and losing the display. Nice os for the time, but crap construction. It lasted a few weeks past the warranty, per usual.",
      "score": -5,
      "created_utc": 1738069095.0,
      "replies": []
    },
    {
      "id": "m9o9adj",
      "author": "stupid_cat_face",
      "body": "By sustainable, do you mean mechanical? Those things last forever and don't have batteries, or electronics.  \nIf you want to make an e-paper watch... cool. Do it. Don't call it sustainable.",
      "score": -3,
      "created_utc": 1738087029.0,
      "replies": []
    },
    {
      "id": "m9mjpnu",
      "author": "_OVERHATE_",
      "body": "Just buy a Casio holy shit",
      "score": -17,
      "created_utc": 1738067659.0,
      "replies": [
        {
          "id": "m9mlpiu",
          "author": "MadOrange64",
          "body": "Pebble looks more fun.",
          "score": 4,
          "created_utc": 1738068514.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9nrtzr",
      "author": "None",
      "body": "Analog watches are already sustainable as family heirlooms. It’s the digital ewaste that isn’t. This will become yet another gimmick you toss in the landfill.",
      "score": -1,
      "created_utc": 1738082151.0,
      "replies": []
    },
    {
      "id": "m9ns053",
      "author": "Implement66",
      "body": "[¯⁠\\\\⁠_⁠\\(⁠ツ⁠\\)⁠\\_⁠/⁠¯](https://techcrunch.com/2016/12/07/pebble-confirms-its-shutting-down-devs-and-software-going-to-fitbit/)\n\nedit: guess we don't remember the ceo selling the company, cancelling kickstarter orders, and posting that shrug emoji to twitter when it came out.",
      "score": -2,
      "created_utc": 1738082199.0,
      "replies": []
    },
    {
      "id": "m9o79gx",
      "author": "macguy9",
      "body": "Honestly, after backing the Kickstarter and ending up getting shafted with the whole buyout and collapse of the brand, I wouldn't support this again with my purchasing power if they made the best smartwatch on earth. They burned too much goodwill with their previous actions.",
      "score": -2,
      "created_utc": 1738086479.0,
      "replies": []
    },
    {
      "id": "m9ofa7t",
      "author": "Tokyosmash_",
      "body": "There have been sustainable watches… forever, people just want to read their Facebook on their watch 🙃",
      "score": -2,
      "created_utc": 1738088662.0,
      "replies": []
    },
    {
      "id": "m9nlicv",
      "author": "Me-Shell94",
      "body": "How is making e watches sustainable? Sounds like microplastics and tech and batteries in the trash down the line.\n\nEdit:\nJust saw it’s sustainable company growth lol not environmental. Of course we dont care.",
      "score": -2,
      "created_utc": 1738080370.0,
      "replies": []
    },
    {
      "id": "m9ofnv3",
      "author": "FixTheUSA2020",
      "body": "If you're that environmentally conscience don't buy/wear a watch. Take your phone out to look at the time or notifications.",
      "score": -2,
      "created_utc": 1738088765.0,
      "replies": []
    },
    {
      "id": "m9n7xx2",
      "author": "XxOmegaSupremexX",
      "body": "Google needs to first fix their Fitbit watches before doing anything new. Fitbits are the worst to connect. Never stay synched to your phone. Have required constant resets and it’s an issue that many many people have. \n\nI’ll never buy a google watch again.",
      "score": -6,
      "created_utc": 1738076364.0,
      "replies": [
        {
          "id": "m9nodwv",
          "author": "chronoswing",
          "body": "Google isn't making these. The pebble founder got Google to release the source code for pebble.",
          "score": 3,
          "created_utc": 1738081185.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9mwp8s",
      "author": "Jackloco",
      "body": "RAHHHH PEBBLE WTF IS A SHITTY WATCH. I MISS GAMES ON MY PEBBLE WATCH AGHHHH",
      "score": -10,
      "created_utc": 1738072659.0,
      "replies": []
    }
  ]
}