{
  "post": {
    "title": "OnePlus Open 2: Oppo teases Feburary launch of the world's thinnest foldable smartphone.",
    "author": "RenegadeUK",
    "id": "1i09cf9",
    "score": 0,
    "created_utc": 1736756007.0,
    "selftext": "",
    "num_comments": 25,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i09cf9/oneplus_open_2_oppo_teases_feburary_launch_of_the/"
  },
  "comments": [
    {
      "id": "m6w2u64",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736756008.0,
      "replies": []
    },
    {
      "id": "m6x6q1z",
      "author": "internetlad",
      "body": "I'm running out of phone brands to recommend. I was full steam ahead on the OnePlus Bus until I traded in my 13 with a cracked screen which I found out was literally unrepairable because you can't get parts anywhere and they tried to charge me extra saying it \"did not power on\" even though it did. When I contacted them to sort it out they just told me I should have taken pictures of it turning on when I boxed it up to send it in so it was my fault they were charging me. \n\n\nFuck OnePlus. I've been an OP fan since my OP6 several years back, but I can't stand for a company that does that to their customers. Good phones but not worth it considering they're filled with Chinese spyware, and have shit customer service",
      "score": 3,
      "created_utc": 1736777416.0,
      "replies": [
        {
          "id": "m6x84hd",
          "author": "RenegadeUK",
          "body": "What phone are you going for ?",
          "score": 0,
          "created_utc": 1736777930.0,
          "replies": [
            {
              "id": "m7061va",
              "author": "internetlad",
              "body": "Honestly not sure at this point. I'm almost so fed up with both Google and Apple that I'm considering third options but most of them are just overpriced stripped out android OSes with no support. A flagship that doesn't steal user data is my white whale.",
              "score": 2,
              "created_utc": 1736809777.0,
              "replies": [
                {
                  "id": "m70zu6c",
                  "author": "RenegadeUK",
                  "body": "How about:\n\n[https://lo-fone.com/](https://lo-fone.com/)\n\n[https://www.thelightphone.com/lightiii](https://www.thelightphone.com/lightiii)",
                  "score": 1,
                  "created_utc": 1736819656.0,
                  "replies": [
                    {
                      "id": "m71moqa",
                      "author": "internetlad",
                      "body": "Not really what I'm looking for. I don't want digital cleansing, I can just put my phone away if that's my goal. I wanted specifically a phone that wasn't contacting Google 50+ times daily/Apple servers once a minute to dump my info. \n\n\nI read that a lot of people are buying Pixel phones and putting GrapheneOS on it. Might try that. \n\n\nI'm also North America so severely limited options on phone models that support our towers. NA gets fucked compared to EU and Asia for cell companies. Not only do we deal with a duopoly on the operating systems, but there are really only 3 companies that have cell service and all the other MVNOs just buy time on their towers so if AT&T/T-Mobile or Verizon doesnt have a tower with the band a \"global\" phone supports it just doesn't work. Believe me I've been looking for a long time for a solution and never been happy with one yet. Tried a Poco with ArrowOS. Was in the beta program for the Nothing (1). I've got a small stack of weird phones in my closet but there's always some deep flaw that makes them unreliable or highly inconvenient. It seems like there's a \"pick two\" triangle of security, usability and stability and security is the easiest to part with. It's fucking sucks.",
                      "score": 2,
                      "created_utc": 1736827330.0,
                      "replies": [
                        {
                          "id": "m72z9id",
                          "author": "RenegadeUK",
                          "body": "I'm planning on getting either Nothing Phone 3 or OnePlus 13 and using until 2029 ?",
                          "score": 1,
                          "created_utc": 1736854492.0,
                          "replies": [
                            {
                              "id": "m73o4z2",
                              "author": "internetlad",
                              "body": "I think nothing (3) or a pixel with grapheneOS is probably my next buy honestly. ",
                              "score": 1,
                              "created_utc": 1736864985.0,
                              "replies": [
                                {
                                  "id": "m73r2nk",
                                  "author": "RenegadeUK",
                                  "body": "Will you install grapheneOS yourself ?",
                                  "score": 1,
                                  "created_utc": 1736865999.0,
                                  "replies": [
                                    {
                                      "id": "m73ygwu",
                                      "author": "internetlad",
                                      "body": "Yeah. I've installed custom OS before. It was a pain in the ass on the poco because you have to contact the manufacturer to unlock but apparently pretty easy on the pixel? Honestly I'm kind of interested in just seeing how it goes.",
                                      "score": 1,
                                      "created_utc": 1736868389.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m6w44p0",
      "author": "iampuh",
      "body": "The thinner, the smaller the battery and the easier the screen cracks. Bought thin phones in the past. No, thanks",
      "score": 15,
      "created_utc": 1736756850.0,
      "replies": [
        {
          "id": "m6wmusf",
          "author": "Shortykun",
          "body": "It's actually rumored to have a bigger battery. Oneplus has some new tech in Wich they can pack more in little space. See OnePlus 13 for reference.",
          "score": 5,
          "created_utc": 1736768722.0,
          "replies": []
        },
        {
          "id": "m6wunao",
          "author": "correctingStupid",
          "body": "Pretty sure OnePlus knows how to make phones better than a reddit commenter does.",
          "score": 2,
          "created_utc": 1736772535.0,
          "replies": []
        },
        {
          "id": "m6w4b2o",
          "author": "RenegadeUK",
          "body": "Do you think the iPhone 17 Air will be a failure ?",
          "score": -2,
          "created_utc": 1736756967.0,
          "replies": [
            {
              "id": "m6w7mq5",
              "author": "networkn",
              "body": "No, because when people complain about the fault, the CEO will stand up on stage and tell people it's their fault. They are holding it wrong or some such crap.",
              "score": 14,
              "created_utc": 1736759174.0,
              "replies": []
            },
            {
              "id": "m6w6509",
              "author": "None",
              "body": "No because Apple will be using Quantum-grade TiPu Alloy™",
              "score": 1,
              "created_utc": 1736758178.0,
              "replies": [
                {
                  "id": "m6w7d4f",
                  "author": "RenegadeUK",
                  "body": "Maybe they should sell some to OnePlus's Parent Company :)\n\nEdit:\n\nTypo correction.",
                  "score": 0,
                  "created_utc": 1736758995.0,
                  "replies": []
                },
                {
                  "id": "m6wn5xh",
                  "author": "DickRichardJohnsons",
                  "body": "So funny. Quantum-grade....\n\nPeople fall for absolutely anything these days.",
                  "score": -1,
                  "created_utc": 1736768888.0,
                  "replies": [
                    {
                      "id": "m6wnaxe",
                      "author": "None",
                      "body": "It was a jab at Apple’s hyperbole claims like “space grade titaniums”. Can’t do sarcasm without /s anymore, it seems.",
                      "score": 3,
                      "created_utc": 1736768963.0,
                      "replies": []
                    },
                    {
                      "id": "m6x720g",
                      "author": "internetlad",
                      "body": "These days? Apples been doing shit like this for 40 years",
                      "score": 1,
                      "created_utc": 1736777540.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m6x6xvn",
              "author": "internetlad",
              "body": "God I hope so",
              "score": -1,
              "created_utc": 1736777496.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m6w3zt6",
      "author": "I_will_take_that",
      "body": "Give me the worlds most durable foldable and I will purchase it",
      "score": 4,
      "created_utc": 1736756761.0,
      "replies": [
        {
          "id": "m6w47th",
          "author": "RenegadeUK",
          "body": "Probably best to wait until at least OnePlus Open 3 (for a OnePlus Foldable anyway).",
          "score": -2,
          "created_utc": 1736756908.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m6wc2h7",
      "author": "adamcoe",
      "body": "Yeah but why",
      "score": 2,
      "created_utc": 1736762120.0,
      "replies": []
    },
    {
      "id": "m6wiys6",
      "author": "drmirage809",
      "body": "Having held an Open, that thing is thin enough. Not to mention that a thinner phone sacrifices not just sturdiness, but also cooling and most importantly battery capacity.\n\nMy biggest worry however is and remains the hinge. It’s a moving part that is gonna see repeated use every single day. Making it thinner will come at the cost of how many times it can fold. \n\nAnyway, foldable phones are out of most people’s price range. They are and remain silly toys for enthusiasts for the most part.",
      "score": 1,
      "created_utc": 1736766500.0,
      "replies": []
    }
  ]
}