{
  "post": {
    "title": "Multi-sensor stethoscope excels at detecting faulty heart valves | The device is sensitive and accurate enough that it can be used over clothing",
    "author": "chrisdh79",
    "id": "1k07f13",
    "score": 1341,
    "created_utc": 1744763090.0,
    "selftext": "",
    "num_comments": 33,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1k07f13/multisensor_stethoscope_excels_at_detecting/"
  },
  "comments": [
    {
      "id": "mncb33v",
      "author": "LITTLE-GUNTER",
      "body": "this is honestly huge. so-called ‘silent’ cardiovascular disease is a massive, MASSIVE factor in early mortality and being able to diagnose faulty valves potentially before they start producing clinically-diagnosable symptoms would mean double-digit increases in survival rates.",
      "score": 78,
      "created_utc": 1744769351.0,
      "replies": [
        {
          "id": "mncguqs",
          "author": "itsme_rafah",
          "body": "I got me a pig valve about 6 months ago, would’ve been nice to catch it a few years earlier.",
          "score": 21,
          "created_utc": 1744771496.0,
          "replies": [
            {
              "id": "mnd9bak",
              "author": "Loquaciouslovelizard",
              "body": "Pigs can be very slippery though but glad you finally caught it.",
              "score": 23,
              "created_utc": 1744784979.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mne4owb",
          "author": "nonowords",
          "body": "Honestly, the one thing this headline made me think is \"how the hell is the standard practice for checking hearts and lungs still \"listen to it with an ear cone\" I feel like there are  0 good reasons stethoscopes to be in use today.",
          "score": 4,
          "created_utc": 1744803491.0,
          "replies": [
            {
              "id": "mni1ra1",
              "author": "LITTLE-GUNTER",
              "body": "stethoscopes are still kind of the gold-standard for diagnosing things like pleuritis and other respiratory issues. they’re cheap, readily available, require basically no training to use other than education on what to listen for, and have been proven to be effective for decades upon decades now.",
              "score": 8,
              "created_utc": 1744848113.0,
              "replies": [
                {
                  "id": "mni98ld",
                  "author": "nonowords",
                  "body": "I totally get that they're effective, otherwise they wouldn't be used, it's just i'm surprised that what is essentially a two-cups-and-a-string phone is where that development has stayed at for so long.",
                  "score": 2,
                  "created_utc": 1744850962.0,
                  "replies": [
                    {
                      "id": "mnjh5oi",
                      "author": "LITTLE-GUNTER",
                      "body": "classic case of “ain’t broke so don’t fix it” i’d assume. medicine isn’t exactly a field that’s averse to technological advances and the basic design has received gradual but significant improvements over the last few centuries. the original design was basically just a wooden ear trumpet, and we’ve come a looooong way since then.\n\nedit: a quick google search reveals that there are, apparently, Doppler-type ultrasound stethoscopes specifically for discerning things like heart murmurs. supposedly the military use one that’s capable of quality auscultation at a 110dB ambient noise level, which is FUCKING loud.",
                      "score": 3,
                      "created_utc": 1744869510.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mncmy8s",
      "author": "Timmy24000",
      "body": "Back when I went to medical school, you were taught to detect valvular heart disease with your stethoscope. Now the docs barely touch you. They just order an echocardiogram. A good physical exam is becoming a lost skill. And yes, an echocardiogram and other diagnostics are definitely great tools, but overused due to lack of clinical skills.",
      "score": 34,
      "created_utc": 1744773911.0,
      "replies": [
        {
          "id": "mnd00ld",
          "author": "GuerrillaRodeo",
          "body": "I recently diagnosed a (later confirmed by echo) first-degree aortic valve stenosis just with my stethoscope. The patient had no symptoms, it was during a routine examination. Makes me kind of proud actually. The one thing I've never skimped on is a good stethoscope, a 300 € Littmann is well worth the price.",
          "score": 19,
          "created_utc": 1744779823.0,
          "replies": [
            {
              "id": "mndiwqu",
              "author": "None",
              "body": "[deleted]",
              "score": 8,
              "created_utc": 1744791007.0,
              "replies": [
                {
                  "id": "mne4atq",
                  "author": "GuerrillaRodeo",
                  "body": "[Not according to our cardiological society](https://www.escardio.org/Journals/E-Journal-of-Cardiology-Practice/Volume-15/Aortic-valve-stenosis-evaluation-and-management-of-patients-with-discordant-grading) ([different source](https://flexikon.doccheck.com/de/Aortenstenose)). That's the grading system I and everyone I know uses, maybe it's different in other parts of the world. 1st degree would correspond with 'mild' in that terminology.",
                  "score": 5,
                  "created_utc": 1744803316.0,
                  "replies": [
                    {
                      "id": "mnexsi8",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 3,
                      "created_utc": 1744813793.0,
                      "replies": [
                        {
                          "id": "mngdkot",
                          "author": "GuerrillaRodeo",
                          "body": "Probably. As far as I know (and my colleagues from cardiology) there's three graduations: 1 = mild, 2 = moderate, 3 = severe. Maybe cardiac surgeons have different, more nuanced gradings but that's the system I've been taught and been using for over a decade.",
                          "score": 1,
                          "created_utc": 1744828987.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mnetr48",
                  "author": "DeusVult42",
                  "body": "direction saw jar crush sense tart juggle sink plants wise\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                  "score": 1,
                  "created_utc": 1744812554.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mnehavj",
              "author": "Timmy24000",
              "body": "I’ve had a difficult time recently because I have to wear hearing aids now. I have to remove them to use my normal stethoscope will most likely buy an electronic one with Bluetooth capabilities. Not sure if it will be as good but hopefully.!",
              "score": 1,
              "created_utc": 1744808376.0,
              "replies": []
            },
            {
              "id": "mnehbrw",
              "author": "Timmy24000",
              "body": "I’ve had a difficult time recently because I have to wear hearing aids now. I have to remove them to use my normal stethoscope will most likely buy an electronic one with Bluetooth capabilities. Not sure if it will be as good but hopefully.!",
              "score": 1,
              "created_utc": 1744808384.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnf6syn",
          "author": "LastSummerGT",
          "body": "What happened to physical exams? Growing up as a kid it was very hands on. Now as an adult it’s just a bunch of questions on a screen the doctor fills out without looking at me while I sit in a chair.",
          "score": 2,
          "created_utc": 1744816470.0,
          "replies": [
            {
              "id": "mnffhbc",
              "author": "FellowTraveler69",
              "body": "Labs and imaging have taken the place of actually listening to the patient...",
              "score": 5,
              "created_utc": 1744819033.0,
              "replies": [
                {
                  "id": "mnh38k9",
                  "author": "LastSummerGT",
                  "body": "They didn’t scan me but they did a basic blood panel and told me which numbers were out of range.",
                  "score": 1,
                  "created_utc": 1744836696.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mnfkow2",
              "author": "Timmy24000",
              "body": "I bet if you read your chart note, they did a very thorough exam on you!",
              "score": 3,
              "created_utc": 1744820591.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mnf2x98",
      "author": "demoshots",
      "body": "My pediatrician correctly identified an issue in my heart with just his stethoscope. It turned out to be an aortic aneurysm with a bicuspid aortic valve. Every cardiologist I have ever seen has said it is beyond impressive that he caught it. Hasn’t caused me any problems in life but I have been fortunate to know about it and monitor it regularly",
      "score": 2,
      "created_utc": 1744815324.0,
      "replies": [
        {
          "id": "mnf4fms",
          "author": "chillichilli",
          "body": "My son has a bicuspid aortic valve that was also caught by our family doctor with a stethoscope. Thankful to her, he is doing great and is monitored yearly.",
          "score": 1,
          "created_utc": 1744815766.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mncwgfo",
      "author": "PM_ME_YOUR_REPORT",
      "body": "I don’t understand why we don’t yet have an electronic stethoscope you put on someone and it automatically analyses and alerts to problems. Even possibly send the results to an online doctor. \n\nNeeds something cheap enough and foolproof anyone can just put on a family member and get an instant guide.",
      "score": 4,
      "created_utc": 1744778135.0,
      "replies": [
        {
          "id": "mnd1yav",
          "author": "datengrab",
          "body": "We do actually... Just one random example \n\nhttps://www.withings.com/eu/en/beam-o\n\nEdit\nIt probably won't replace a visit to the doc but it might be good enough to diagnose that something is off",
          "score": 5,
          "created_utc": 1744780815.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mnc5ylg",
      "author": "Lint_baby_uvulla",
      "body": "Slightly less invasive than the [2023 movie Fingernails](https://www.imdb.com/title/tt13968674/), but that never stopped the Love Institute before.",
      "score": -2,
      "created_utc": 1744767492.0,
      "replies": []
    },
    {
      "id": "mnegp2f",
      "author": "avery703",
      "body": "This is huge for telemedicine",
      "score": 0,
      "created_utc": 1744808178.0,
      "replies": [
        {
          "id": "mnp0hq0",
          "author": "RH1221",
          "body": "Second this",
          "score": 1,
          "created_utc": 1744942605.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mnezwn3",
      "author": "TheGummiVenusDeMilo",
      "body": "How long before this thing never comes out?",
      "score": 2,
      "created_utc": 1744814430.0,
      "replies": []
    },
    {
      "id": "mngtr21",
      "author": "Icer333",
      "body": "Just use POCUS",
      "score": 1,
      "created_utc": 1744833882.0,
      "replies": []
    },
    {
      "id": "mqtm1gy",
      "author": "rgnissen202",
      "body": "I got lucky.  I had to go to the ER with Cardiac Tamponade caused by a Pericardial Effusion that my cardiologist just happened to find during what was supposed to be a routine echocardiogram.  \n\nI was only starting to see a cardiologist because my primary care doctor heard a murmur during a visit.  \n\nA visit that was only scheduled because my wife asked me too because even light jogging had me out of breath... something I hadn't even noticed until it was pointed out to me.\n\nWhen I think about that chain of events, and how if any one had not happened, I wouldn't be here, it legit scares me.  I've learned to listen to my body and go see a professional at the first hint of trouble now.  Can't help but feel something like this would make it easier.",
      "score": 1,
      "created_utc": 1746499794.0,
      "replies": []
    }
  ]
}