{
  "post": {
    "title": "A lot of Logitech products cost more now than two months ago | In the wake of new tariffs this month, Logitech quietly raised its prices by as much as 25 percent.",
    "author": "chrisdh79",
    "id": "1k40uvd",
    "score": 3423,
    "created_utc": 1745195888.0,
    "selftext": "",
    "num_comments": 199,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1k40uvd/a_lot_of_logitech_products_cost_more_now_than_two/"
  },
  "comments": [
    {
      "id": "mo80lsl",
      "author": "cunningmunki",
      "body": "Does anyone ever \"noisily\" raise their prices?",
      "score": 175,
      "created_utc": 1745221490.0,
      "replies": [
        {
          "id": "mo9gj3s",
          "author": "thepsycholeech",
          "body": "Penzey’s (the spice company) does. I love them for that. They’re sending out emails to let us know prices are going up & the reason.\n\nEdit: The Ordinary (skincare company) is also very good about communicating any price changes.",
          "score": 64,
          "created_utc": 1745245973.0,
          "replies": []
        },
        {
          "id": "moa35h4",
          "author": "hedonist222",
          "body": "A lot of companies do. \nThey clearly set out when, by how much, and why. \n\nDo more business with good folk.",
          "score": 15,
          "created_utc": 1745253625.0,
          "replies": []
        },
        {
          "id": "modnfb4",
          "author": "tlst9999",
          "body": "[These guys](https://www.youtube.com/watch?v=76NyvWcAeO4&pp=ygURbnl1Z3lvIHByaWNlIHJpc2U%3D)",
          "score": 3,
          "created_utc": 1745295603.0,
          "replies": []
        },
        {
          "id": "moa9w0m",
          "author": "InclinationCompass",
          "body": "Netflix, but it should",
          "score": 3,
          "created_utc": 1745255581.0,
          "replies": []
        },
        {
          "id": "moeadqd",
          "author": "Advanced-Blackberry",
          "body": "Ya.  I’ve received lots of emails from vendors stating they will have to raise prices. ",
          "score": 1,
          "created_utc": 1745308468.0,
          "replies": []
        },
        {
          "id": "mofw0wl",
          "author": "Golmito",
          "body": "Games Workshop does :')",
          "score": 1,
          "created_utc": 1745334025.0,
          "replies": []
        },
        {
          "id": "mol7t9o",
          "author": "GKnives",
          "body": "I'm in manufacturing so it's not the same but the good guys will send out warnings about price changes to give people a chance to plan for them.",
          "score": 1,
          "created_utc": 1745406754.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo6r5an",
      "author": "jibbyjackjoe",
      "body": "I mean. Yeah. Never let a good disaster go to waste. And the price won't ever go back down, even after tarrif man is gone.",
      "score": 1111,
      "created_utc": 1745199469.0,
      "replies": [
        {
          "id": "mo7mjmy",
          "author": "B4rn3ySt1n20N",
          "body": "Like Covid prices still active",
          "score": 311,
          "created_utc": 1745212807.0,
          "replies": [
            {
              "id": "mo8jrkt",
              "author": "Appropriate_Ad2243",
              "body": "But I can’t wait for the 25% off sale!! So a great buy!! /s",
              "score": 80,
              "created_utc": 1745233158.0,
              "replies": [
                {
                  "id": "mo91e2c",
                  "author": "theyoyomaster",
                  "body": "I mean, that would technically be an 11.25% sale at this point...",
                  "score": 19,
                  "created_utc": 1745240836.0,
                  "replies": [
                    {
                      "id": "mo9dw7n",
                      "author": "yp261",
                      "body": "we have a law in Poland that all stores are required to show the lowest price during last 30 days to avoid discount scams. it's such a good law, it is applied in physical stores as wall as digital like steam etc.\n\nedit: just read its EU thingy. well",
                      "score": 44,
                      "created_utc": 1745245154.0,
                      "replies": [
                        {
                          "id": "mo9vnng",
                          "author": "theyoyomaster",
                          "body": "I was just pointing out that you can’t just decrease the same percentage you added to get back to the original price. If you increase by 25% then decrease by 25% you’re at number that is lower than your starting point. ",
                          "score": 7,
                          "created_utc": 1745251290.0,
                          "replies": []
                        },
                        {
                          "id": "mo9wgup",
                          "author": "None",
                          "body": "That sounds pretty neat",
                          "score": 1,
                          "created_utc": 1745251558.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "moc1sct",
              "author": "Admirable-Lie-9191",
              "body": "Yeah because inflation returning to target range doesn’t make prices go down.",
              "score": 1,
              "created_utc": 1745274839.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mo8xub2",
          "author": "letsgoiowa",
          "body": "\"We are experiencing increased call volume\" messages never went away either",
          "score": 27,
          "created_utc": 1745239474.0,
          "replies": [
            {
              "id": "modojnh",
              "author": "NightFuryToni",
              "body": "These were there even before COVID...  \n  \nWas once told that's just a standard spiel to make people hang up. I've once heard that line and then it proceed to tell me I am second in line for the call queue.",
              "score": 3,
              "created_utc": 1745296114.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mo8pyb0",
          "author": "1h8fulkat",
          "body": "They will when people don't buy an $80 mouse and find other manufacturers",
          "score": 10,
          "created_utc": 1745236171.0,
          "replies": [
            {
              "id": "mogyl1p",
              "author": "Bullschmidter420",
              "body": "JLab makes similar mice/keyboards for much less. Full transparency I work for them so I'm biased, but I've had good experiences with them!",
              "score": 3,
              "created_utc": 1745345176.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mo7oo9v",
          "author": "Turkino",
          "body": "Buy the stuff from China even with tariff probably can still get the same quality for cheaper.",
          "score": 19,
          "created_utc": 1745214024.0,
          "replies": [
            {
              "id": "mo8ciz7",
              "author": "dpx",
              "body": "can't get any worse, that's for sure! ..been a lifelong logitech supporter and their last few mice have fallen apart on me in record time.",
              "score": 19,
              "created_utc": 1745229027.0,
              "replies": [
                {
                  "id": "mo8g9d2",
                  "author": "13D00",
                  "body": "I’ve been using their mx master 3, 40hr a week, for the past 5 years and still works like brand new. Never had any issues with Logitech products",
                  "score": 22,
                  "created_utc": 1745231239.0,
                  "replies": [
                    {
                      "id": "mo8h4v6",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 8,
                      "created_utc": 1745231745.0,
                      "replies": [
                        {
                          "id": "mo8osvu",
                          "author": "13D00",
                          "body": "I feel like Gaming gear never has the same reliability as office peripherals. It seems to me  like they prefer to spend more money on the looks and marketing than proper functionality and quality. But that’s with every brand.",
                          "score": 6,
                          "created_utc": 1745235644.0,
                          "replies": [
                            {
                              "id": "modwam5",
                              "author": "JukePlz",
                              "body": "In my experience it's the other way around, office mice often have the shittiest components inside, the optics in particular tends to start doing weird jumpy things in low quality office mice that you don't often see in gaming mice.\n\nRegardless, ALL mice eventually have double-clicking or missed clicks issues due to microswitch wear. They claim high quality microswitches should last \"10 million clicks\" or other such numbers but they fail after just one year of regular gaming use. It's just lies about the specs and programmed obsolescence. They know very well that no matter if it's Omron or whatever other \"super high quality Japanese switch\" the common design of a little strip of copper inside a plastic cage is meant to fail from mechanical stress.\n\nIf you're lucky (that they didn't also design the mouse shell plastic to deform and cause other issues) and skilled (to do smd microsoldering) you can replace the switches, as they're inexpensive. But not everyone can, and not all mice are designed for this type of maintenance, particularly with non-primary switches.\n\nIt's the same problem we have with first party controller thumb-sticks drifting, and companies like Nintendo refusing to use hall-effect sensors to fix the issue permanently. If they wanted to, they could easily find a solution to make the mice last for over 10 years, but \"muh capitalism\" won't allow them to design something that won't be e-waste in a couple years. Pure greed.",
                              "score": 2,
                              "created_utc": 1745299915.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mo8pkaw",
                          "author": "cat_prophecy",
                          "body": "If they kept having that issue then why did you keep buying them? They keep getting away with it because people keep giving them money for substandard products.",
                          "score": 3,
                          "created_utc": 1745235994.0,
                          "replies": []
                        },
                        {
                          "id": "mo8tue1",
                          "author": "Lusankya",
                          "body": "My G5 made it about ten years before double clicking.\n\nMy first G502 made it six years. It never started double clicking. The feet on the bottom wore down to nothing and I couldn't be bothered to replace them. I took the excuse to buy a new one, like a good consumerist sucker.\n\nI went through a hell of a lot of Triathlons on my work laptops, but I blame that on the working conditions. I'm a controls engineer, and factory floors are not known for being clean. The MX Master 3S is holding up better so far, but it's still early days.",
                          "score": 2,
                          "created_utc": 1745237852.0,
                          "replies": [
                            {
                              "id": "mo931bm",
                              "author": "Metallibus",
                              "body": "I had a couple G5s for about ten years as well.\n\nI run a 502 at work, and two on two different home PCs. One of them developed double clicking pretty quick. One other after a couple years. Ironically, the one I use the most is still fine after like 3 years.\n\nIdk who people are buying things from that actually last anymore. I've tried a couple other companies and they've all developed issues quickly. I also have had a couple non-gaming Logitech mice for a long time which still have no issues....",
                              "score": 3,
                              "created_utc": 1745241444.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mo8p7x7",
                          "author": "rdbn",
                          "body": "I'm in the third year of using my Master 3 with silent switches from Kailh bought from AliExpress. Half an hour of mouse disassembly, soldering the switches with the cheapest soldering iron I could find online and then putting it back on.\n\nThere are tutorials online and it's relatively easy to do even for someone who is not experienced in such a thing.",
                          "score": 1,
                          "created_utc": 1745235836.0,
                          "replies": []
                        },
                        {
                          "id": "mo8wdct",
                          "author": "replus",
                          "body": "Are you cleaning them? Or otherwise keeping a fairly clean workspace? I've also been buying Logitech mice for over 20 years and I don't think I've ever had one fail in any way. I only ever replace them because consumer things.",
                          "score": 1,
                          "created_utc": 1745238886.0,
                          "replies": []
                        },
                        {
                          "id": "mo9u73h",
                          "author": "BlackSecurity",
                          "body": "I have the g502 wired mouse and the g213 wired keyboard. 502 still going strong after about 6 years of usage and many thousands of hours of gaming. I got the 213 in 2022 and it's also still working great. \n\nBut I do want to replace the 502 soon as I would like a bigger mouse and the side rubbers have worn down quite a bit due to my death grip.",
                          "score": 1,
                          "created_utc": 1745250355.0,
                          "replies": []
                        },
                        {
                          "id": "modoymv",
                          "author": "NightFuryToni",
                          "body": "I'm actually dailying a G502 I had since like 2012 (I think), it was the original Proteus Core one without RGB. No double-click issues but the plastics on it are melting.",
                          "score": 1,
                          "created_utc": 1745296301.0,
                          "replies": []
                        },
                        {
                          "id": "moeurb4",
                          "author": "Zapador",
                          "body": "Why not get them replaced under warranty? They all have 2 year warranty.\n\nMy experience with most Logitech products is really good, they tend to last quite a few years with very heavy use. My current G402 is 7 years.",
                          "score": 1,
                          "created_utc": 1745320664.0,
                          "replies": [
                            {
                              "id": "moey03h",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 2,
                              "created_utc": 1745322144.0,
                              "replies": [
                                {
                                  "id": "moey8gq",
                                  "author": "Zapador",
                                  "body": "Damn that sucks. Couldn't even get the 2 years provided by Logitech?\n\nHope things will improve where you live!",
                                  "score": 1,
                                  "created_utc": 1745322246.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mo95pos",
                      "author": "Aswajr",
                      "body": "G602 almost 10 years if i remember, still work as good as new..",
                      "score": 1,
                      "created_utc": 1745242411.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mo943ow",
                  "author": "klaasvaak1214",
                  "body": "After the third Anywhere MX got the double click issue within a year, I bought 5 switches for $10 on Amazon. That was three years ago. The genetic switch has been better than the Logitech one, so my guess is that they use switches that fail quickly on purpose, so most people keep buying mice.",
                  "score": 3,
                  "created_utc": 1745241831.0,
                  "replies": []
                },
                {
                  "id": "mo92e5z",
                  "author": "Metallibus",
                  "body": "I feel like the G5 was the last Logitech mouse I had that lasted a reasonable amount of time with no issues. That was quite a while ago.",
                  "score": 2,
                  "created_utc": 1745241209.0,
                  "replies": []
                },
                {
                  "id": "mo8nqa1",
                  "author": "horsemonkeycat",
                  "body": "Gone through 3 different Logitech keyboards since Covid let me  work-from-home   ... each one the letters wore off a number of the keys.",
                  "score": 1,
                  "created_utc": 1745235138.0,
                  "replies": [
                    {
                      "id": "mo8oojp",
                      "author": "Throwaway-tan",
                      "body": "At work we stock Logitech keyboards, meaning I get them free for office use.\n\nI went out of my way to buy my own keyboard instead (Keychron), after I went through 3 in 2 years. All of them the LCtrl key just fell off. Literally couldn't get me to accept one for free.",
                      "score": 2,
                      "created_utc": 1745235588.0,
                      "replies": [
                        {
                          "id": "mo8q5g1",
                          "author": "frankyseven",
                          "body": "That's why I buy my own keyboard for work. I use it all day, might as well use a nice one all day.",
                          "score": 2,
                          "created_utc": 1745236259.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mo965xi",
                  "author": "Plank_With_A_Nail_In",
                  "body": "You documented number of clicks and stuff for all of the mice you owned?",
                  "score": 1,
                  "created_utc": 1745242572.0,
                  "replies": [
                    {
                      "id": "mobj7we",
                      "author": "dpx",
                      "body": "yes, with pen and paper. click, pause, mark down a notch on the paper with said pen. repeat.",
                      "score": 2,
                      "created_utc": 1745268887.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mo947be",
          "author": "DropMuted1341",
          "body": "Covid. Supply chain. Inflation. Tariffs.\n\nHalf the world is charging 200% premiums since 2019. We need a recession.",
          "score": 6,
          "created_utc": 1745241867.0,
          "replies": [
            {
              "id": "mo9lci4",
              "author": "TheAspiringFarmer",
              "body": "Or a depression. We'll probably see both.",
              "score": 3,
              "created_utc": 1745247439.0,
              "replies": [
                {
                  "id": "mo9s9sp",
                  "author": "DropMuted1341",
                  "body": "The jenga-tower economy has been going on for way too long. A recession or depression would reset the pressure valve. It will sting, a lot—but the piper has to be paid eventually for the last five decades of economic jenga games, and the sooner he’s paid the easier it will be.",
                  "score": 1,
                  "created_utc": 1745249525.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mo98ao9",
          "author": "Herban_Myth",
          "body": "Might get lucky during a “sale”.\n\nLow demand forces suppliers to slash prices.",
          "score": 1,
          "created_utc": 1745243313.0,
          "replies": []
        },
        {
          "id": "mo98lc4",
          "author": "50calPeephole",
          "body": "You say that like if the cost of busniess goes up that profits will go down to accommodate as opposed to passing those costs through to the consumer.  \n   \nTo force a lower cost and profit you'd need a competitive alternative that's not being taxed and therefore cheaper.",
          "score": 1,
          "created_utc": 1745243415.0,
          "replies": []
        },
        {
          "id": "mo8bnl0",
          "author": "hackeristi",
          "body": "That is alright. I can live without a fuckin logic mouse lol",
          "score": -1,
          "created_utc": 1745228493.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo6lo2e",
      "author": "HansBooby",
      "body": "This is what’s going to happen. At least for Americans. Just like covid Everyone’s going to raise prices just because, and no one’s going to question it.",
      "score": 407,
      "created_utc": 1745197506.0,
      "replies": [
        {
          "id": "mo6wdni",
          "author": "LuckyBahamut",
          "body": "It's not just USA. Logitech raised their Canadian MSRP as well. Best Buy, Amazon.ca, Canadian-based retailers -- they've all raised their prices accordingly. Tariffs don't just hurt the U.S., other countries end up as collateral as well.",
          "score": 160,
          "created_utc": 1745201348.0,
          "replies": [
            {
              "id": "mo927lo",
              "author": "oshinbruce",
              "body": "Everyone else has to subsidise",
              "score": 21,
              "created_utc": 1745241141.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mo6v0l2",
          "author": "HobbesNJ",
          "body": "Just like last time, all companies will take this opportunity to jack up prices whether they need to or not, because the blame will be spread around to everybody.  Profiteering, Part II.",
          "score": 116,
          "created_utc": 1745200859.0,
          "replies": []
        },
        {
          "id": "mo6zzeo",
          "author": "None",
          "body": "[deleted]",
          "score": 85,
          "created_utc": 1745202690.0,
          "replies": [
            {
              "id": "mo7wxy4",
              "author": "Defiant_Employee6681",
              "body": "I agree right up to the last sentence.  America has bent the entire world over because they are such a big part of the global economy 💩",
              "score": 14,
              "created_utc": 1745219134.0,
              "replies": [
                {
                  "id": "mo9b6tr",
                  "author": "kurisu7885",
                  "body": "Were. We're about to be shown how little we're actually needed.",
                  "score": 5,
                  "created_utc": 1745244284.0,
                  "replies": [
                    {
                      "id": "mo9lic3",
                      "author": "TheAspiringFarmer",
                      "body": "Hope these countries send back all the aid $ we're giving them then..since we're not needed and all.",
                      "score": -7,
                      "created_utc": 1745247488.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mo7qhsw",
              "author": "Circuitizen",
              "body": "It's not just a US problem, though. US is still the biggest economy in the world with the highest middle class consumer base on the planet.\n\n\nIf you raise the prices for the US, but keep them lower for everyone else, than the stock that you ship to other countries would be instantly bought by scalpers and illegally exported to the US at a markup.\n\n\nAt the end of the day, someone is gonna pocket that money, either Logitech or the scalpers. So why would Logitech, or any other tech company that would soon follow suit, willingly give up on potential profit?",
              "score": -33,
              "created_utc": 1745215108.0,
              "replies": [
                {
                  "id": "mo86ase",
                  "author": "Kelmi",
                  "body": "That's not how tariffs work my man",
                  "score": 16,
                  "created_utc": 1745225112.0,
                  "replies": [
                    {
                      "id": "mo8a906",
                      "author": "Circuitizen",
                      "body": "That's exactly how it's going to work for every product that can't be reliably region locked. The price of other consumer electronics outside of the US will go up, otherwise it all would just get scaled and grey imported into US.",
                      "score": -12,
                      "created_utc": 1745227614.0,
                      "replies": [
                        {
                          "id": "mo8c39v",
                          "author": "Kelmi",
                          "body": "That's why every electronics is smuggled from no sales tax states to taxed states in US. Can't go to a local walmart to buy a TV, they don't even stock them anymore because everyone buys out of state ones.",
                          "score": 7,
                          "created_utc": 1745228762.0,
                          "replies": [
                            {
                              "id": "mo8elod",
                              "author": "Circuitizen",
                              "body": "Do taxed states have a 145% tax on consumer electronics? There's a certain markup threshold below which the stuff like convenience and warranty, provided by a local walmart, are more important that the price difference.",
                              "score": -4,
                              "created_utc": 1745230280.0,
                              "replies": [
                                {
                                  "id": "mo8zenn",
                                  "author": "Kelmi",
                                  "body": "There's no one moving that massive amounts of hardware without getting caught by the tax man.",
                                  "score": 2,
                                  "created_utc": 1745240081.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mo8b0ob",
                          "author": "lost_send_berries",
                          "body": "It's easy to stuff a couple USB sticks in a suitcase but it doesn't hold a candle to the amount that US consumers actually purchase",
                          "score": 4,
                          "created_utc": 1745228100.0,
                          "replies": []
                        },
                        {
                          "id": "mo8bgs7",
                          "author": "gokuby",
                          "body": "Grey imported goods from scalpers would be such a low amount that it doesn't impact anything at all. And you'd have to be insane to illegally import stuff for a 20% margin.   \nThey still increase the prices everywhere to offset the loss of revenue in the US, that's the only reason. Numbers have to go up, no matter what.     \n\nThey'll probably say this is to create fair pricing all around the world or even this protection from scalping nonesense, it's just greed.",
                          "score": 3,
                          "created_utc": 1745228376.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mo90tiv",
          "author": "Littman-Express",
          "body": "Prices are going to raise everywhere. Companies will hike prices globally to subsidise the US. Exactly the reason Sony just increased the PS5 price ",
          "score": 7,
          "created_utc": 1745240621.0,
          "replies": []
        },
        {
          "id": "mo88vgq",
          "author": "InterstellarReddit",
          "body": "Local bar raised prices citing tariffs 💀💀💀",
          "score": 11,
          "created_utc": 1745226737.0,
          "replies": [
            {
              "id": "moa8cn9",
              "author": "Lemmonjello",
              "body": "While shilling bud light lol",
              "score": 2,
              "created_utc": 1745255136.0,
              "replies": []
            },
            {
              "id": "mo8b4u4",
              "author": "HansBooby",
              "body": "ridiculous.  imported alcohol maybe",
              "score": 3,
              "created_utc": 1745228171.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mo9b1su",
          "author": "kurisu7885",
          "body": "And no one with the power to do anything about it will.",
          "score": 1,
          "created_utc": 1745244236.0,
          "replies": []
        },
        {
          "id": "mobk3nb",
          "author": "MyNameIsRay",
          "body": "Every time gas prices spike, UPS/FedEx/USPS/etc cite fuel costs as justification for raising prices.\n\nEvery time gas prices go down, they simply collect more profit.",
          "score": 1,
          "created_utc": 1745269147.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo6sqc6",
      "author": "eyelidgeckos",
      "body": "Wild thing is that lots of products in Europe got more expansive without a single part of it ever touching US soil or even being produced and/or sold by a company based from the U.S. 🤦🏻‍♂️",
      "score": 205,
      "created_utc": 1745200049.0,
      "replies": [
        {
          "id": "mo7fybx",
          "author": "Anxious-Note-88",
          "body": "We’re a world economy and the US has a gigantic footprint. It kind of sucks. The anticipated price hikes led businesses to price hike. Some of these could be in honest anticipation, but it could also be an opportunity for them to raise prices significantly more and then just shrug their shoulders and blame tariffs.",
          "score": 69,
          "created_utc": 1745209322.0,
          "replies": [
            {
              "id": "mo87ici",
              "author": "eyelidgeckos",
              "body": "For sure, I just read a post about Sony, Samsung etc that use the European market to offset loses that occur in the U.S., doesn’t really have anything to do with the products, just an earnings thing 🙄 also doesn’t seem to be new, if one company starts a promotion in the U.S. it’s likely they raise prices in Europe, pretty wild stuff.\n\nI hope with time it gets easier to be aware of this so we can adjust our spending :/",
              "score": 11,
              "created_utc": 1745225873.0,
              "replies": [
                {
                  "id": "mo88d3v",
                  "author": "Evaldi",
                  "body": "Yep, that is what I'm afraid is going to happen.  The companies are going to attempt to spread the price increases to other countries as well to keep US prices more reasonable.",
                  "score": 6,
                  "created_utc": 1745226410.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mo7kt90",
              "author": "musiclover818",
              "body": "It's capitalism. It allows businesses to do this. Capitalism must be extinguished. This will get worse if it isn't. Capitalism is the root cause of most of society's problems. 💯",
              "score": 25,
              "created_utc": 1745211845.0,
              "replies": [
                {
                  "id": "mo87ajp",
                  "author": "eyelidgeckos",
                  "body": "Hey you are probably right, but humans are the problem, doesn’t matter what system we have, on paper communism sounds great as well, I was born in east Germany, thankfully right before the wall fell, but holy moly did they mess people up over there.\n\nIt’s FAR from perfect but the capitalism in Europe at least gets social parts injected into it, seems to make things at least run smoother compared to the U.S.",
                  "score": 9,
                  "created_utc": 1745225735.0,
                  "replies": [
                    {
                      "id": "mo8an0c",
                      "author": "mytransthrow",
                      "body": " We need to keep capitalism in check.  No more ultra rich.  If you have a vastly more wealth than  than the Average. say like 400 times. like as value. You get wammy-ed and gets knocked down to 5 times. and then it given to everyone under the average.  So no more billionaires.  ANd owners would be more generous to their workers.",
                      "score": 5,
                      "created_utc": 1745227861.0,
                      "replies": [
                        {
                          "id": "mo8e9al",
                          "author": "eyelidgeckos",
                          "body": "100% this! The amount of money just sitting there and doing nothing productive, it’s crazy (sure lots of it is imaginary stock bs, but still), give the same amount to the lower and middle class and the economy would be booming like we have never seen before 🤷🏻‍♂️",
                          "score": -1,
                          "created_utc": 1745230076.0,
                          "replies": [
                            {
                              "id": "mo8ixbd",
                              "author": "tujuggernaut",
                              "body": "> money just sitting there and doing nothing\n\nthat's not how most investing works.",
                              "score": 4,
                              "created_utc": 1745232721.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mo6r5tr",
      "author": "BoraxTheBarbarian",
      "body": "Everything is going up right now. The first day the tariffs were announced, I woke up at 3 am and panic bought a greenhouse I was planning to buy this summer. Since then, the price has gone up multiple times. It’s now about 30% more than when I bought it.",
      "score": 75,
      "created_utc": 1745199474.0,
      "replies": [
        {
          "id": "mo8tl1a",
          "author": "FantasticBurt",
          "body": "My restaurant just revamped the menu a week ago and raised prices because of costs, and two days ago implemented a 2.9% service fee to every ticket to avoid having the raise prices again because of costs… it’s getting bad. ",
          "score": 9,
          "created_utc": 1745237744.0,
          "replies": [
            {
              "id": "mo99poy",
              "author": "DrDerpberg",
              "body": "> 2.9% service fee to every ticket to avoid having the raise prices again because of costs\n\nOh cool, so they did raise prices but they're only telling people when they get their bill?\n\nI'd be deducting 3% from whatever tip I was planning on leaving, personally. I hope your bosses are aware people hate this scummy shit.",
              "score": 15,
              "created_utc": 1745243791.0,
              "replies": [
                {
                  "id": "mo9b51a",
                  "author": "FantasticBurt",
                  "body": "I’m sure they are aware, and there is a line on the menu stating as much regarding the fee. \n\nI saw it first day before management ever mentioned it and it pissed me off, though there isn’t much I can do beyond looking for a new job, but they aren’t easy to find right now. ",
                  "score": 8,
                  "created_utc": 1745244265.0,
                  "replies": [
                    {
                      "id": "mo9hsdb",
                      "author": "DrDerpberg",
                      "body": "Can you pass on complaints from customers, real or imagined? Or even check with the labor board if they can charge a service fee that isn't going to the service workers?\n\nLike I'm not trolling - I'd assume that any fee like that is a base tip, and that I can tip that much less without screwing anybody. It's not a service fee if it's just a price hike in disguise.",
                      "score": 4,
                      "created_utc": 1745246359.0,
                      "replies": [
                        {
                          "id": "mo9jjl6",
                          "author": "FantasticBurt",
                          "body": "Look, I understand your perspective and honestly don’t care for tipping culture, but you’re *choosing* to misunderstand the fee by tipping less and it *does* screw your server. \n\nI don’t *want* to have a job as a server. I have a degree in a highly sought after field, but that same field pays significantly less than I make now, unless you get very lucky to find a good one, and comes with a **hell** of a lot more responsibility and stress and less flexibility. \n\nI’m at the point that we’ve started bartering with other industry workers to trade skills rather than paying for services because everyone is broke. \n\nBut if you, the customer, just see the fee and choose to tip less as a result, but don’t bring it up to management, what do you expect? They don’t give a fuck what we think and second hand complaints like that mean nothing to management. ",
                          "score": 1,
                          "created_utc": 1745246895.0,
                          "replies": [
                            {
                              "id": "mo9mxuj",
                              "author": "DrDerpberg",
                              "body": "It's not on the customer to decode when \"service is included\" means tip and when it means \"we snuck in a price increase and called it service.\"",
                              "score": 4,
                              "created_utc": 1745247923.0,
                              "replies": [
                                {
                                  "id": "mo9pf29",
                                  "author": "FantasticBurt",
                                  "body": "No “decoder” necessary, the line on the menu explains the fee in plain text. \n\nI’m not happy about the bill, but you’re taking it out on the server by choosing to tip less in this instance. \n\nYou’d be better served speaking to management about your frustration with the fee than stiffing your server due to actions of management. ",
                                  "score": 1,
                                  "created_utc": 1745248673.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mo9njsh",
                  "author": "ginger_whiskers",
                  "body": "How is stiffing the waitress going to do anything?",
                  "score": 2,
                  "created_utc": 1745248107.0,
                  "replies": [
                    {
                      "id": "moa7t9p",
                      "author": "DrDerpberg",
                      "body": "It says service fee. That's paying for service.\n\nWhy not mandate 200% tips and the restaurant skims 80% of it off the top to keep menu prices low then?",
                      "score": 4,
                      "created_utc": 1745254983.0,
                      "replies": [
                        {
                          "id": "mozjm49",
                          "author": "ginger_whiskers",
                          "body": "That's kinda the shitty trend the industry is turning to. Take pizza delivery- when I left the Hut, delivery fee was $2.50. Driver got 75¢ of that. It was absolutely the employer skimming from what sounds like a partial tip to advertise lower prices.\n\n\nService fees are almost always the company taking money that would go to normally tipped workers, not a replacement or even a baseline tip.",
                          "score": 2,
                          "created_utc": 1745595610.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mo6hdsh",
      "author": "Oil_slick941611",
      "body": "and it makes sense, one day no tariffs, next day tariffs, 2 days later more tariffs. Can't do business in that environment.",
      "score": 118,
      "created_utc": 1745196008.0,
      "replies": [
        {
          "id": "mo7de2r",
          "author": "DaEnderAssassin",
          "body": "And 3 days later no tariffs and 4 days latter quadruple digit tariffs.",
          "score": 18,
          "created_utc": 1745208114.0,
          "replies": [
            {
              "id": "mo8tzzz",
              "author": "CommodoreAxis",
              "body": "And 5 days later “they’re temporary on certain sectors and being lifted immediately on those sectors”, then 6 days later “lol you really thought they were temporary on certain sectors? They weren’t actually lifted.”",
              "score": 4,
              "created_utc": 1745237917.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mo803ql",
      "author": "popornrm",
      "body": "Want to bet their cost didn’t go up by 25%? Want to bet the price is never going to go back down even when their “cost” does? Just stop buying products that refuse to cut into their massive profit margins",
      "score": 24,
      "created_utc": 1745221168.0,
      "replies": [
        {
          "id": "mo8hw99",
          "author": "chaotic_zx",
          "body": "> Just stop buying products that refuse to cut into their massive profit margins\n\n\n\nIn a sea of silliness, this is a rock to build upon. Great comment. Too bad it will be lost on most.",
          "score": 9,
          "created_utc": 1745232167.0,
          "replies": []
        },
        {
          "id": "mo99vw2",
          "author": "DrDerpberg",
          "body": "Unfortunately that's just about everybody.\n\nAre there any products that used to not be a particularly good value, but haven't raised their prices by 50% since 2019 and therefore are great deals now?",
          "score": 3,
          "created_utc": 1745243849.0,
          "replies": []
        },
        {
          "id": "mo99qg4",
          "author": "ddevilissolovely",
          "body": "Why would they cut into their \"massive\" profit margins to benefit the same population that voted for these new taxes?",
          "score": 2,
          "created_utc": 1745243798.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo6n5g7",
      "author": "Undevilish",
      "body": "![gif](giphy|LFMk6WMykVjE0l4BWJ|downsized)",
      "score": 54,
      "created_utc": 1745198037.0,
      "replies": [
        {
          "id": "mo6qpvl",
          "author": "DMurBOOBS-I-Dare-You",
          "body": "![gif](giphy|rl83xsC6FeO7mY7a5Q)\n\nDID YOU EVEN SAY THANK YOU?!",
          "score": 38,
          "created_utc": 1745199321.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo6zz4g",
      "author": "KingJTheG",
      "body": "It's unfortunate because I love my MX Master 3S and MX Master Keys, but I know it's not their fault. It sucks though",
      "score": 10,
      "created_utc": 1745202686.0,
      "replies": [
        {
          "id": "mob18mm",
          "author": "It_Happens_Today",
          "body": "Logitech was dead to me the day they discontinued the G600.",
          "score": 1,
          "created_utc": 1745263559.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mobsjoq",
      "author": "goldaxis",
      "body": "Ah yes the \"tariffs\" with a million exceptions and prices that never go back down after they end.\n\nThey'll keep getting away with it until you stop playing their game.",
      "score": 6,
      "created_utc": 1745271766.0,
      "replies": []
    },
    {
      "id": "mo7bywc",
      "author": "Blapanda",
      "body": "If you know Logitech and their horrible customer service, horrible software and horrible decline in hardware quality components, then you know those raised prices, justified by tariffs or not, will stay there up high, even after the tariffs being removed again.",
      "score": 32,
      "created_utc": 1745207477.0,
      "replies": [
        {
          "id": "mo7hxwu",
          "author": "ccai",
          "body": "They used to be amazing back in the day, but the last time I used their support was over a decade and a half ago. Twice for my gaming mice where they upgraded me to the model’s successor and once for my g25 steering wheel to a brand new g27 and another time for a speaker main controller. They were quick and very easy to deal with. \n\nSad to hear they’ve gone down the shitter while jacking up prices.",
          "score": 15,
          "created_utc": 1745210324.0,
          "replies": [
            {
              "id": "mo7ubwu",
              "author": "qthrowaway666",
              "body": "Their base level mice have going down the shitter for years, especially with MS out of the game, there isn't really much competition in the well known brand space.",
              "score": 4,
              "created_utc": 1745217487.0,
              "replies": []
            },
            {
              "id": "mo7zh5t",
              "author": "Duckel",
              "body": "they used to send me mouse gliders for free",
              "score": 3,
              "created_utc": 1745220764.0,
              "replies": [
                {
                  "id": "mo8b6tc",
                  "author": "mytransthrow",
                  "body": "I switched to trackball... the gameball thumb and a logitech ergo s.  I like the logitech software a lot. It adds custom actions to every program. I didnt think I was going to like the trackball as much as I do.\n\nALso I got the ergo s second hand. So I havent given them any money for like 10 years or more.",
                  "score": 1,
                  "created_utc": 1745228205.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mo8c5tr",
              "author": "Blapanda",
              "body": "Ikr?! I am still using a G600 (the OG MMO-Mouse) and the G910 with the first iteration of their software for that hardware (LGS) and I have absolutely no problems. I recently (6-7 months ago) bought one of their newer hardware as a replacement due to thumb buttons on my G600 starting to wear off (after more than 5 years in daily use), and guess what ... already a warranty-issued problem. LMB double clicking, MMB not clicking anymore. Switches started to fail. And the funny thing is, that hardware will refuse to work with the older driver software. Neato!",
              "score": 1,
              "created_utc": 1745228805.0,
              "replies": [
                {
                  "id": "moa08ke",
                  "author": "tylerchu",
                  "body": "What I find amazing is literally nobody has tried to emulate the 600, and Logitech has not just continued to make what obviously works and is popular. I can’t find it or an appropriate substitute anywhere.",
                  "score": 1,
                  "created_utc": 1745252745.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mo7uhn8",
          "author": "qthrowaway666",
          "body": "> horrible software\n\nHave multiple devices? Enjoy Logi Options, Logi Options+, and Logi Bolt to name a couple.",
          "score": 10,
          "created_utc": 1745217589.0,
          "replies": []
        },
        {
          "id": "mod3tc0",
          "author": "Anderson74",
          "body": "Not to mention their CEO casually floating a subscription requirement to use their hardware that you’ve already bought and paid for — that was when I added Logitech to my “never give that company another cent” list. All they would need to do is push a software update that bricks the hardware and then forces a subscription to continue its use. \n\nThat whole train of thought being floated in an interview told me all I needed to know about that company, where it’s internal discussions about business development / priorities are at, and how little they think of their customers.",
          "score": 1,
          "created_utc": 1745287901.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo7vkeb",
      "author": "ztomiczombie",
      "body": "Bad news for idiots building garbage submarines.",
      "score": 14,
      "created_utc": 1745218266.0,
      "replies": [
        {
          "id": "mo8qekv",
          "author": "ccai",
          "body": "You mean ONCE IN A LIFETIME AMAZING UNDERWATER DEEP SEA EXPERIENCES for only the best humanity has to offer? We need more billionaires to seek out such excursions more often. \n\n/#SinkTheRich",
          "score": 3,
          "created_utc": 1745236373.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo8s9p8",
      "author": "ConkerPrime",
      "body": "Considering that it’s unlikely all that stock was just shipped in, it means no tariffs had been applied. So Logitech just being greedy and blaming the tariffs.",
      "score": 5,
      "created_utc": 1745237188.0,
      "replies": []
    },
    {
      "id": "mo8qrrf",
      "author": "TragiccoBronsonne",
      "body": "Did they also fix the double click or nah?",
      "score": 3,
      "created_utc": 1745236537.0,
      "replies": []
    },
    {
      "id": "mobwrzj",
      "author": "cluib",
      "body": "Omg! Tarriffs are taxes! How could've we known.",
      "score": 3,
      "created_utc": 1745273140.0,
      "replies": []
    },
    {
      "id": "mo84frz",
      "author": "haboku",
      "body": "Simple: stop buying overpriced products from Logitech.",
      "score": 5,
      "created_utc": 1745223928.0,
      "replies": []
    },
    {
      "id": "mo702qu",
      "author": "kobemustard",
      "body": "Ok I get why its going up in USA but I see it is also up in Canada. WTF?",
      "score": 2,
      "created_utc": 1745202725.0,
      "replies": [
        {
          "id": "mo7iuk6",
          "author": "hadronflux",
          "body": "Maybe they import to US and ground ship to Canada for distribution.",
          "score": 1,
          "created_utc": 1745210794.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo7xcwg",
      "author": "Faptainjack2",
      "body": "Nintendo. Sony. Nvidia. \n\n\nGrab those cheap tvs now because electronics are only going up.",
      "score": 2,
      "created_utc": 1745219398.0,
      "replies": []
    },
    {
      "id": "mo93dp9",
      "author": "icetom",
      "body": "Around the time of their rebranding with new logo they got very greedy. Logitech customer service was great until a few years ago. Now you hope you dont need their service. They jacked up prices and lowered the quality.",
      "score": 2,
      "created_utc": 1745241568.0,
      "replies": []
    },
    {
      "id": "mo94sat",
      "author": "Disgruntl3dP3lican",
      "body": "And it is there to stay even after the tariffs...",
      "score": 2,
      "created_utc": 1745242078.0,
      "replies": []
    },
    {
      "id": "mo6rw5h",
      "author": "jay_alfred_prufrock",
      "body": "And they still, cannot fix their options+ shite. It is seriously giving EA App a run for its money.",
      "score": 3,
      "created_utc": 1745199739.0,
      "replies": []
    },
    {
      "id": "mo7rqox",
      "author": "Odd-Frame9724",
      "body": "Better let vice president Trump know.  He said China is supposed to pay for that.",
      "score": 4,
      "created_utc": 1745215866.0,
      "replies": []
    },
    {
      "id": "mo8egog",
      "author": "MethyIphenidat",
      "body": "Are yall tired of winning yet?",
      "score": 3,
      "created_utc": 1745230198.0,
      "replies": []
    },
    {
      "id": "mo6mt25",
      "author": "funwithdesign",
      "body": "Were they supposed to do it with a fanfare?",
      "score": 5,
      "created_utc": 1745197911.0,
      "replies": [
        {
          "id": "mo76ief",
          "author": "thatOneJones",
          "body": "My thoughts exactly 😅",
          "score": 3,
          "created_utc": 1745205155.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo7nm0h",
      "author": "Hardi_SMH",
      "body": "What if… just think about it… what if all the tarrifs are just a plan. A plan that‘s like „ok guys we send the message that shit‘s about to get down, you raise the price, your stocks sink, we buy the shit out of it, remove tarrifs, your profit margin goes up 20%, see your stocks go boom again“",
      "score": 2,
      "created_utc": 1745213405.0,
      "replies": []
    },
    {
      "id": "mo8nvwl",
      "author": "OkeelzZ",
      "body": "“No, it’s a tax! This can’t be right.” - Orange voter",
      "score": 1,
      "created_utc": 1745235213.0,
      "replies": []
    },
    {
      "id": "mo6qnlx",
      "author": "DMurBOOBS-I-Dare-You",
      "body": "Happening all over.\n\nAudio gear (both mainstream and \"chi-fi\" brands), up.\n\nComputers and monitors, up.",
      "score": 1,
      "created_utc": 1745199299.0,
      "replies": []
    },
    {
      "id": "mo6rmoa",
      "author": "theplacesyougo",
      "body": "Can confirm. Bought a Logitech MX Master 3s and MX keyboard 3 weeks ago for $94 and $104 at Best Buy with Total tech pricing. Now it’s $113 and $124 respectively at the same store.",
      "score": 1,
      "created_utc": 1745199643.0,
      "replies": []
    },
    {
      "id": "mo6thxx",
      "author": "roundart",
      "body": "Whew, I just bought an M720 and it was the same price as the one I bought a year ago. Just in time",
      "score": 1,
      "created_utc": 1745200320.0,
      "replies": []
    },
    {
      "id": "mo79bpj",
      "author": "DGlen",
      "body": "But wait, there's more....",
      "score": 1,
      "created_utc": 1745206329.0,
      "replies": []
    },
    {
      "id": "mo7c735",
      "author": "OgreTrax71",
      "body": "I pray my MX Master keeps going strong. Love that mouse!",
      "score": 1,
      "created_utc": 1745207577.0,
      "replies": []
    },
    {
      "id": "mo7izlj",
      "author": "razorbacks3129",
      "body": "Meanwhile I just bought a g303 wireless shroud edition for $39",
      "score": 1,
      "created_utc": 1745210867.0,
      "replies": []
    },
    {
      "id": "mo7oupl",
      "author": "VoodooDuck614",
      "body": "Chips and sensors all made overseas in…",
      "score": 1,
      "created_utc": 1745214127.0,
      "replies": []
    },
    {
      "id": "mo7te65",
      "author": "RailGun256",
      "body": "well yeah and we should get used to it. i dont think theyre ever going to come down even if the tariffs go away.",
      "score": 1,
      "created_utc": 1745216892.0,
      "replies": []
    },
    {
      "id": "mo7ufpg",
      "author": "cool_weed_dad",
      "body": "I’m still using an MX Revolution mouse I bought for $100 in like 2007, and it’s still working great, and the software and drivers for it are still kept up to date despite being it being legacy tech at this point.",
      "score": 1,
      "created_utc": 1745217555.0,
      "replies": []
    },
    {
      "id": "mo81foi",
      "author": "Chr0ll0_",
      "body": ":0",
      "score": 1,
      "created_utc": 1745222018.0,
      "replies": [
        {
          "id": "mo87qc3",
          "author": "SnottyMichiganCat",
          "body": "They've got a couple really nice products... But man, I'd have to agree with you. It's hard for me as someone who has bought their products for so long.\n\nBut we can't buy solely on history and comfort three days. Always have to research new companies, etc!",
          "score": 1,
          "created_utc": 1745226010.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo8sas3",
      "author": "Mobbo2018",
      "body": "Overpriced crap now even more overpriced. what a shock.",
      "score": 1,
      "created_utc": 1745237200.0,
      "replies": []
    },
    {
      "id": "mo8tcue",
      "author": "juniebeatricejones",
      "body": "good thing i've had my 502 for 12 years",
      "score": 1,
      "created_utc": 1745237649.0,
      "replies": []
    },
    {
      "id": "mo8zt7m",
      "author": "xxzivv",
      "body": "Black and Decker toaster I was looking at last week has gone up $20",
      "score": 1,
      "created_utc": 1745240236.0,
      "replies": []
    },
    {
      "id": "mo92knm",
      "author": "None",
      "body": "scary support meeting public birds attractive offbeat oil light seed\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "score": 1,
      "created_utc": 1745241276.0,
      "replies": []
    },
    {
      "id": "mo92qb5",
      "author": "HEIR_JORDAN",
      "body": "No shit.",
      "score": 1,
      "created_utc": 1745241334.0,
      "replies": []
    },
    {
      "id": "mo99jxo",
      "author": "Sea-Mango",
      "body": "Yeah, but they still haven’t reissued my fave MMO mouse so fuck ‘em.",
      "score": 1,
      "created_utc": 1745243737.0,
      "replies": []
    },
    {
      "id": "mo9k8xh",
      "author": "Own-Opinion-2494",
      "body": "Most aren’t running on a 25% margin",
      "score": 1,
      "created_utc": 1745247109.0,
      "replies": []
    },
    {
      "id": "moa683e",
      "author": "djax9",
      "body": "remake/upgrade the g604!",
      "score": 1,
      "created_utc": 1745254526.0,
      "replies": []
    },
    {
      "id": "moatgfc",
      "author": "jacob121803",
      "body": "Guess I’ll be holding onto my g910 for a while longer",
      "score": 1,
      "created_utc": 1745261251.0,
      "replies": []
    },
    {
      "id": "moazpn3",
      "author": "lovestick2021",
      "body": "Thanks Logitech. Like they weren’t expensive enough as it was.",
      "score": 1,
      "created_utc": 1745263108.0,
      "replies": []
    },
    {
      "id": "mobc3nw",
      "author": "saman_pulchri",
      "body": "Doesnt look like it. I have mx master 3s mouse in my wishlist. Its still the same",
      "score": 1,
      "created_utc": 1745266803.0,
      "replies": []
    },
    {
      "id": "mobggsj",
      "author": "PocketNicks",
      "body": "The price hasn't changed here in Canada, they were always around 25% more expensive, before the tariffs.",
      "score": 1,
      "created_utc": 1745268081.0,
      "replies": []
    },
    {
      "id": "mobq4om",
      "author": "DoublePostedBroski",
      "body": "And the prices will never go back down",
      "score": 1,
      "created_utc": 1745271004.0,
      "replies": []
    },
    {
      "id": "mobvbkr",
      "author": "stickybond009",
      "body": "Good old value for money will kick in, to knock monetary sense in American kids like 100 years ago?",
      "score": 1,
      "created_utc": 1745272658.0,
      "replies": []
    },
    {
      "id": "moca6d5",
      "author": "bskando",
      "body": "Good ol price gouging...",
      "score": 1,
      "created_utc": 1745277670.0,
      "replies": []
    },
    {
      "id": "moczeup",
      "author": "misterespresso",
      "body": "So I've been developing an app.\n\nEventually I need to test on iPhone, original plan was buy one several months down the road when I polish the android version.\n\nYeah, I did some math and I'm trading in early. Not a bad deal though, paying roughly 378$ total for a new iPhone 16 max with trade in. \n\nIn a few months, can you imagine what its gonna be? Hell maybe after testing the app I can sell the iPhone for a stupid profit lol",
      "score": 1,
      "created_utc": 1745286389.0,
      "replies": []
    },
    {
      "id": "mok1t58",
      "author": "Bunnymancer",
      "body": "When things are going well, prices go up. \n\nWhen things aren't going well, prices go up. \n\nHappy capitalism!",
      "score": 1,
      "created_utc": 1745382438.0,
      "replies": []
    },
    {
      "id": "mokkkdn",
      "author": "SteveHeist",
      "body": "25% isn't even that high considering where they're made (my G502X is Made In China according to the silkscreen on the bottom). Expect it to creep towards 250% as the fact that the tariffs aren't coming off slowly reaches the minds of people actually in charge.",
      "score": 1,
      "created_utc": 1745392765.0,
      "replies": []
    },
    {
      "id": "mos6st5",
      "author": "Fancyness",
      "body": "There's a solution: don't buy. Case solved",
      "score": 1,
      "created_utc": 1745500083.0,
      "replies": [
        {
          "id": "mp6h7pk",
          "author": "goldfingas",
          "body": "But what if I like them? Come on, be flexable! lol",
          "score": 1,
          "created_utc": 1745689317.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp6h1p4",
      "author": "goldfingas",
      "body": "Glad I got my clicky keyboard when I did. lol",
      "score": 1,
      "created_utc": 1745689267.0,
      "replies": []
    },
    {
      "id": "mo7fkkk",
      "author": "EatingSmallOakTrees",
      "body": "Logitech products are not all that good anymore in my experience, anyways. Buy elsewhere",
      "score": 1,
      "created_utc": 1745209136.0,
      "replies": [
        {
          "id": "mo7klhl",
          "author": "BruceChameleon",
          "body": "MX mouse and keyboard are both quality peripherals",
          "score": 8,
          "created_utc": 1745211728.0,
          "replies": [
            {
              "id": "mo7n1s7",
              "author": "EatingSmallOakTrees",
              "body": "I’ve owned both and they had middling build quality. Squeaky, resistant keys out of the box and rapid degradation of materials with light use. I loved their unique features, but actually using them honestly sucked despite trying to convince myself I enjoyed it. My older, less expensive stuff ended up being way more durable and comfortable to use. Though I’m sure there’s a luck factor to their quality and other people can have different experiences with them",
              "score": 1,
              "created_utc": 1745213089.0,
              "replies": [
                {
                  "id": "mo8qoh8",
                  "author": "ccai",
                  "body": "Their keyboards aren’t that great but the Mx mice are hard to beat in terms of functionality. Nothing else comes close to them.",
                  "score": 1,
                  "created_utc": 1745236497.0,
                  "replies": []
                },
                {
                  "id": "moaab5q",
                  "author": "InclinationCompass",
                  "body": "The mx mouse is the best mouse for productivity work. I work huge excel spreadsheets everyday.",
                  "score": 1,
                  "created_utc": 1745255702.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mo8e0jn",
      "author": "Popal24",
      "body": "r/UsDefaultism",
      "score": 1,
      "created_utc": 1745229930.0,
      "replies": []
    },
    {
      "id": "mo8qlxa",
      "author": "SuppleDude",
      "body": "Logitech products are junk anyway.",
      "score": 1,
      "created_utc": 1745236465.0,
      "replies": []
    },
    {
      "id": "mo7ilv4",
      "author": "None",
      "body": "I lost my wireless dongle for my keyboard and monitor yesterday.  They're in on that too.  It was so small it fell through a wormhole that bypassed the winning.",
      "score": 1,
      "created_utc": 1745210666.0,
      "replies": []
    },
    {
      "id": "mo7eagv",
      "author": "Student-type",
      "body": "My old webcam 920C is obsoleted because they can’t maintain drivers. \n\nBricked! To allow remote code execution!\n\nYou think I’ll give them ANOTHER CHANCE? With my new expensive PC??\n\nNot even.",
      "score": 0,
      "created_utc": 1745208526.0,
      "replies": []
    },
    {
      "id": "mo75klr",
      "author": "Jackshankar",
      "body": "Welcome to the Covid playbook. Price gouging tactics at its best.",
      "score": -5,
      "created_utc": 1745204773.0,
      "replies": []
    },
    {
      "id": "mo8ice5",
      "author": "Either_Net_x86",
      "body": "The CEO is super MAGA",
      "score": -1,
      "created_utc": 1745232410.0,
      "replies": [
        {
          "id": "moax6j0",
          "author": "ozzie_throwaway123",
          "body": "The CEO is a Dutch woman",
          "score": 1,
          "created_utc": 1745262357.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo7fjy1",
      "author": "Anxious-Note-88",
      "body": "I’ll continue to not buy their cheap quality crap, especially now that it’s not comparably priced cheap quality crap.",
      "score": -1,
      "created_utc": 1745209128.0,
      "replies": []
    },
    {
      "id": "mo6i30m",
      "author": "None",
      "body": "[deleted]",
      "score": -18,
      "created_utc": 1745196258.0,
      "replies": [
        {
          "id": "mo6mdcj",
          "author": "BusinessBear53",
          "body": "Haven't found anything that beats their mice yet but I gave up on their keyboards and audio gear. Found their wireless keyboards to be problematic with registering button presses and my speakers died after a few years.  \n\nI decided to switch to companies that specialise in their respective products instead. Got a Ducky One 3 keyboard, Audio Technica headset and Edifier speakers.",
          "score": 3,
          "created_utc": 1745197754.0,
          "replies": [
            {
              "id": "mo6ofw1",
              "author": "Affectionate-Memory4",
              "body": "Same here. My G502 is going on 6 years of daily service and when it finally dies (please I want to go all type-c) I will just get whatever their successor to it is called. Fits my hand well, button layout makes sense, and G-hub is usable enough for peripheral software.",
              "score": 1,
              "created_utc": 1745198506.0,
              "replies": [
                {
                  "id": "mo6vvhs",
                  "author": "SoftlySpokenPromises",
                  "body": "Same, 502 Hero has been a fantastic mouse for the cost.  Even at 25% more I'd still pick it over most other brands.",
                  "score": 3,
                  "created_utc": 1745201167.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mo6jty6",
      "author": "LostVisionary",
      "body": "What is quietly. !",
      "score": -2,
      "created_utc": 1745196859.0,
      "replies": []
    },
    {
      "id": "moa8di2",
      "author": "hearnia_2k",
      "body": "\\* In the US.  A minority of people are impacted by this.\n\nIt also makes complete sense, most electronic products will go up.",
      "score": -2,
      "created_utc": 1745255144.0,
      "replies": []
    }
  ]
}