{
  "post": {
    "title": "Good news, bad news: Pixel 4a getting an update, but it’s reduced battery life",
    "author": "a_Ninja_b0y",
    "id": "1hvvngn",
    "score": 238,
    "created_utc": 1736268255.0,
    "selftext": "",
    "num_comments": 40,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hvvngn/good_news_bad_news_pixel_4a_getting_an_update_but/"
  },
  "comments": [
    {
      "id": "m5w949j",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736268256.0,
      "replies": []
    },
    {
      "id": "m5wb2e8",
      "author": "sithelephant",
      "body": "Yes, but also no. Reduced battery life for a set of devices whos batteries either are, or are likely to become unreliable shortly, to help preserve the battery a bit, and stop stuff like random crashes at 20% battery happening, as it can with very old or degraded batteries that can't cope with the draw of the phone in peaks.\n\nHowever, if your device is one of those limited (It's not all pixel 4as, it's by IMEI), you can get various restitutions from a free battery replacement service on through cash, or credit in the google hardware store.\n\nFor a phone which is at least three years old.",
      "score": 75,
      "created_utc": 1736268830.0,
      "replies": [
        {
          "id": "m5zdbiq",
          "author": "stempoweredu",
          "body": "> For a phone which is at least three years old.\n\nPeople need to stop treating this like a geriatric age for technology.",
          "score": 33,
          "created_utc": 1736302360.0,
          "replies": [
            {
              "id": "m5zed3s",
              "author": "sithelephant",
              "body": "I do not disagree, and yet here we are. Only one of my android devices bought semi-recently has a user replaceable battery. The galaxy tab active 3.\n\nIf it doesn't have a user replaceable battery, then in many cases, if things haven't gone just right, 3 years old damn near is geriatric.",
              "score": 5,
              "created_utc": 1736302727.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5xir8k",
          "author": "count023",
          "body": "My 4as battery burns out after about 9 hours of light use these days, it's already one foot in the grave before I saw the Google notice. If this shortens the battery any further I may as well just get a new phone",
          "score": 13,
          "created_utc": 1736281501.0,
          "replies": [
            {
              "id": "m5xnc6t",
              "author": "sithelephant",
              "body": "It _nearly_ goes so far as saying if it shortens your battery life, you can get a free battery replacement. Depending on how skeptically you read it. We will see. (My first reading at least is that they don't quite say explicitly that the group of phones it will negatively impact is completely covered by the replacement)",
              "score": 10,
              "created_utc": 1736282812.0,
              "replies": [
                {
                  "id": "m5xok3y",
                  "author": "count023",
                  "body": "I just went through the listing they had in the notification, i am not elligable for a replacement but they wanna send me 50USD though... that seems... weird.",
                  "score": 3,
                  "created_utc": 1736283155.0,
                  "replies": [
                    {
                      "id": "m60tp2o",
                      "author": "TotallyNormalSquid",
                      "body": "I replaced my 4a when I checked the price of a battery replacement and it was 95% the price of a new phone with similar specs. Don't think 50 bucks is gonna cover it.",
                      "score": 1,
                      "created_utc": 1736326913.0,
                      "replies": [
                        {
                          "id": "m60uf9l",
                          "author": "count023",
                          "body": "Yea, i saw that quite fast, 200 bucks for a new battery, 50 buck pity payment for google screwing the phone over. musing getting a new one.",
                          "score": 3,
                          "created_utc": 1736327387.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m5yoyyv",
                  "author": "rucksacksepp",
                  "body": "They do replace the battery for some phones. My wife entered her IMEI and she was eligible for it",
                  "score": 1,
                  "created_utc": 1736294238.0,
                  "replies": [
                    {
                      "id": "m5yr7ab",
                      "author": "sithelephant",
                      "body": "Right. As I read it, the statement is slightly ambiguous on if any phones that will have performance worsened by the update (that are perhaps not on their IMEI list) will not be eligible.",
                      "score": 2,
                      "created_utc": 1736294976.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m5x1lqv",
      "author": "PikaV2002",
      "body": "Basically literally the exact same thing Apple got slapped with a lawsuit over.",
      "score": 25,
      "created_utc": 1736276514.0,
      "replies": [
        {
          "id": "m5xgn19",
          "author": "Sure-Temperature",
          "body": "If I remember correctly, the fuss wasn't that Apple put the battery safeguards in place, but the fact that theu did so without telling anyone, denied it through their teeth, and then finally admitted it when they had no other option",
          "score": 30,
          "created_utc": 1736280884.0,
          "replies": []
        },
        {
          "id": "m5xgfx3",
          "author": "gladfelter",
          "body": "There's a big difference: Restitution. Read the article to learn more.",
          "score": 2,
          "created_utc": 1736280826.0,
          "replies": []
        },
        {
          "id": "m5y8jc1",
          "author": "FaithlessnessSame357",
          "body": "“Basically literally” 😂😂😂",
          "score": 1,
          "created_utc": 1736288979.0,
          "replies": []
        },
        {
          "id": "m5ypjsw",
          "author": "-Pizza-Planet-",
          "body": "Did apple give people free batteries? Ehhh, no 😂",
          "score": -6,
          "created_utc": 1736294426.0,
          "replies": [
            {
              "id": "m5z5lkq",
              "author": "TheMacMan",
              "body": "Yes, they did. They replaced batteries for free.",
              "score": 3,
              "created_utc": 1736299724.0,
              "replies": [
                {
                  "id": "m60g8xx",
                  "author": "-Pizza-Planet-",
                  "body": "I had a 6s plus and had to pay a temporarily reduced replacement fee, but wasn't free. This was UK.",
                  "score": 1,
                  "created_utc": 1736318679.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m5yezuz",
      "author": "bugmush",
      "body": "Good news: Google ordered to replace my battery, give me $50 cash, or $100 in Google store credit. I took the $50. It's nice 🤷 \n\nIf you are the owner of a Pixel 4a you might be eligible as well. There was a post about it on Slickdeals",
      "score": 6,
      "created_utc": 1736290979.0,
      "replies": [
        {
          "id": "m61rb0p",
          "author": "Virreinatos",
          "body": "I got the same options. \n\n\nGiven I'd assume Px4 are at the end of their lives for most, this seems fair enough. \n\n\nI'm prolly taking the battery myself because I like using my phones till they literally die.",
          "score": 1,
          "created_utc": 1736344453.0,
          "replies": [
            {
              "id": "m67hn61",
              "author": "bugmush",
              "body": "The 4a is/was a great phone! Makes sense to keep using it as long as you can. It's somehow the first phone I bought that was over $60 😆 and it served me well for many years. I think it was originally $350 retail at launch when I bought it. \n\nI ended up getting someone's hand-me-down Galaxy S21 FE for free not too long ago, and I have not been a big fan of Samsung's setup/features, could just be because I was very used to the Pixel setup. Not that they are vastly different, both being androids, but Samsung has definitely been more frustrating to use at times. I do like the larger screen, as the pixel 4a was on the small side, and I have large hands (still terrible at phone typing after all these years, though 🤳), but barely being able to get your phone to fit in your pocket is kind of annoying, too.",
              "score": 1,
              "created_utc": 1736421184.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "md2daih",
      "author": "Excitable_Grackle",
      "body": "I'm frankly amazed that anyone still has an operating Pixel 4a. Mine died at the end of its (assumed built-in) three year lifetime. The 5a/5g I replaced it with was great, but did not even last three years before it just gave up and went black. Now I'm on a Pixel 7, which is OK except they swapped out the very reliable fingerprint sensor for a shitty software-based one which works about 70 percent of the time.",
      "score": 1,
      "created_utc": 1739710617.0,
      "replies": []
    },
    {
      "id": "m5wkong",
      "author": "SandiaRaptor",
      "body": "Pixel phones only get three years of security updates last I heard. Planned obsolescence. Why I switched to Apple after owning Pixel (and other Android) phone.\n\nEdit: I stand corrected. Now they get SEVEN years of updates. Too bad they didn’t offer that when I bought mine.",
      "score": -36,
      "created_utc": 1736271645.0,
      "replies": [
        {
          "id": "m5wpwoh",
          "author": "None",
          "body": "[deleted]",
          "score": 22,
          "created_utc": 1736273151.0,
          "replies": [
            {
              "id": "m5y0hgl",
              "author": "SandiaRaptor",
              "body": "Oh I guess I bought my pixel 2 five years too soon to reap those benefits.",
              "score": 2,
              "created_utc": 1736286574.0,
              "replies": []
            },
            {
              "id": "m5wr90d",
              "author": "Techy-Stiggy",
              "body": "They say that and I’m happy but let’s see if they actually do it or they add that promise to https://killedbygoogle.com/",
              "score": -19,
              "created_utc": 1736273543.0,
              "replies": [
                {
                  "id": "m5wx0iq",
                  "author": "SurreptitiousSyrup",
                  "body": "Half the things on that list aren't things that were killed, simply ones that got rolled into something else. They say reels were killed, but YouTube shorts are right there in the app.\n\nAnd that hangouts was killed, but they migrated it to Google Meet. They transferred all your chat history and everything.",
                  "score": 12,
                  "created_utc": 1736275206.0,
                  "replies": [
                    {
                      "id": "m5xx16v",
                      "author": "AmazingEmptyFeelings",
                      "body": "Also Google is business. They are not gonna keep something alive for all of 5 people. Though they are partly to blame because they often don't know how to market their stuff.\n\nThat said, it looks like Pixel phones are doing good so I'd believe the promise of long updates",
                      "score": 1,
                      "created_utc": 1736285574.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m5xxc5i",
                  "author": "BellerophonM",
                  "body": "I've seen people say that before to the pixel update schedule. This isn't a site that Google can cancel at a whim, the 7 years of updates is something they actively sold the phone with. They're legally bound to it and if they gave up on it they'd probably face judgement and compensation for false advertising. They're not going to do that, particularly not for devices on their flagship line.",
                  "score": 2,
                  "created_utc": 1736285662.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m5wmbh4",
          "author": "PrizeEbb5",
          "body": "apple does the same shit.",
          "score": 5,
          "created_utc": 1736272120.0,
          "replies": [
            {
              "id": "m5wmyr9",
              "author": "Spr1nt87",
              "body": "Huh? iPhone 6s was the longest supported phone, ever. 6 years of major iOS updates, 8 years of security.",
              "score": 10,
              "created_utc": 1736272304.0,
              "replies": [
                {
                  "id": "m5wn8ar",
                  "author": "PrizeEbb5",
                  "body": "Apple still does the same thing planned obsolescence.",
                  "score": -3,
                  "created_utc": 1736272380.0,
                  "replies": [
                    {
                      "id": "m5wnfis",
                      "author": "Spr1nt87",
                      "body": "How?",
                      "score": 3,
                      "created_utc": 1736272436.0,
                      "replies": [
                        {
                          "id": "m5wpabo",
                          "author": "Enough-Meaning1514",
                          "body": "They got caught red-handed and had to replace shit ton of batteries due to the result of class-action-lawsuit. They slowed certain 2-3 year old phones without even checking the status of their batteries. In fact, battery status test is added AFTER they lost the case. In addition, they mentioned in their earnings that year that the sales were low because they had to replace a lot of batteries for free of charge which resulted in less sales.\n\nSo, yes, Apple/Samsung/Google, they all do the same shit. Planned obsolescence became a business model now.",
                          "score": 0,
                          "created_utc": 1736272969.0,
                          "replies": [
                            {
                              "id": "m5wpulj",
                              "author": "Spr1nt87",
                              "body": "I know that. But the discussion was about software updates, not hardware.",
                              "score": 0,
                              "created_utc": 1736273134.0,
                              "replies": [
                                {
                                  "id": "m5yx1f1",
                                  "author": "Relative_Walk_936",
                                  "body": "Everyone sucks. Get over it.",
                                  "score": 0,
                                  "created_utc": 1736296882.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m5zg7i9",
          "author": "Imperialbucket",
          "body": "So you went to APPLE? One of the most evil companies in the world? Excellent protest buddy",
          "score": -2,
          "created_utc": 1736303375.0,
          "replies": [
            {
              "id": "m5zux7v",
              "author": "Drtysouth205",
              "body": "How are they one of the most evil? Or anymore evil than Google? Genuinely curious.",
              "score": 3,
              "created_utc": 1736308735.0,
              "replies": [
                {
                  "id": "m5zwbqi",
                  "author": "Imperialbucket",
                  "body": "Setting the standard for craven, money-grubbing tech companies, posing significant national security risks being so reliant on Chinese sweat labor, lazily erasing features from their products which other tech companies take as carte blanche to do the same thing. \n\nAre they that much worse than Google? A little bit, but not by much. But my point is really that it's hilarious this guy is essentially saying \"man this Viktor Frankenstein guy is a real asshole. I'm gonna go hang out with Dracula instead, that'll show him!\"",
                  "score": 0,
                  "created_utc": 1736309292.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}