{
  "post": {
    "title": "Apple CarPlay Ultra hands-on: more continuity, less disruption",
    "author": "dapperlemon",
    "id": "1lorh0j",
    "score": 726,
    "created_utc": 1751340357.0,
    "selftext": "",
    "num_comments": 142,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lorh0j/apple_carplay_ultra_handson_more_continuity_less/"
  },
  "comments": [
    {
      "id": "n0p7wyv",
      "author": "None",
      "body": "[deleted]",
      "score": 221,
      "created_utc": 1751341442.0,
      "replies": [
        {
          "id": "n0pdlyc",
          "author": "mg118118118",
          "body": "Love you",
          "score": 33,
          "created_utc": 1751343869.0,
          "replies": []
        },
        {
          "id": "n0r5eg4",
          "author": "Tupperwarfare",
          "body": "Blessed be thy hands, and thy mouse-click.",
          "score": 12,
          "created_utc": 1751375891.0,
          "replies": []
        },
        {
          "id": "n0re5v9",
          "author": "JohnPulse",
          "body": "That damn avatar dude! What side of hell did you spawn from?",
          "score": 10,
          "created_utc": 1751378742.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0qdif3",
      "author": "Moonrak3r",
      "body": "Oh cool. I’ve been on the fence about buying an Aston Martin but with this new feature it’s totally worth it now. \n\n/s",
      "score": 216,
      "created_utc": 1751363892.0,
      "replies": [
        {
          "id": "n0qv86q",
          "author": "Warlord68",
          "body": "Just knowing I can change the colour of my speedometer and tachometer on a daily basis, who wouldn’t want this. 😅😆😅",
          "score": 25,
          "created_utc": 1751372217.0,
          "replies": [
            {
              "id": "n0s0aqr",
              "author": "polopolo05",
              "body": "Had it on my mustage. it was fun.",
              "score": 3,
              "created_utc": 1751385081.0,
              "replies": [
                {
                  "id": "n0tlvpp",
                  "author": "LickingLieutenant",
                  "body": "My mustage only gets Cream",
                  "score": 5,
                  "created_utc": 1751401216.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0r3qq0",
          "author": "Abigail716",
          "body": "You joke, but my husband actually bought one for his brother in law and that was one of the biggest selling points overcompetitors Like the Lamborghini Urus or Bentley Bentayga. \n\nI would absolutely guarantee there's a decent number of sales that wouldn't have occurred otherwise.",
          "score": -12,
          "created_utc": 1751375327.0,
          "replies": [
            {
              "id": "n0r72ag",
              "author": "AmNoSuperSand52",
              "body": "Your husband bought a brand new Aston Martin for his brother in law?!\n\nHoly shit why? I wouldn’t buy a used Aston for my own brother much less a new one for a guy I’m only technically related to lol",
              "score": 22,
              "created_utc": 1751376444.0,
              "replies": [
                {
                  "id": "n0r9nz7",
                  "author": "RingDangDoodle",
                  "body": "Caught sleeping with his brother in laws wife.",
                  "score": 19,
                  "created_utc": 1751377303.0,
                  "replies": []
                },
                {
                  "id": "n0ra1g9",
                  "author": "Phantom_Absolute",
                  "body": "I wouldn't give my brother-in-law a quarter for the parking meter if he was going to get a ticket.",
                  "score": 5,
                  "created_utc": 1751377425.0,
                  "replies": []
                },
                {
                  "id": "n0rit8g",
                  "author": "Abigail716",
                  "body": "Very wealthy family. He bought both his sister and his brother-in-law new cars for their birthdays this year. SIL is hopefully having kids soon, so he purchased the EWB version of the Bentayga for her, and her husband just generically wanted the Aston Martin, in large part because of the car play Ultra since he's really big into the Apple ecosystem. \n\nGifts like this aren't unusual at all for him.",
                  "score": -8,
                  "created_utc": 1751380132.0,
                  "replies": [
                    {
                      "id": "n0rjsfy",
                      "author": "Moonrak3r",
                      "body": "A year and a half ago you posted that you were a chef to a billionaire family. Did you end up marrying one of them?",
                      "score": 7,
                      "created_utc": 1751380422.0,
                      "replies": [
                        {
                          "id": "n0rkizf",
                          "author": "Abigail716",
                          "body": "No. \n\nI was already independently wealthy before that. I am a trust fund baby. When I was in college I started dating my now husband is was also a trust fund baby and now is the CIO for a hedge fund.\n\nThis is also why I extravagant gifts are pretty common. My husband is in charge of managing the family trust, so things like the cars everyone drives are purchased from funds from the family trust.",
                          "score": -5,
                          "created_utc": 1751380640.0,
                          "replies": [
                            {
                              "id": "n0rnp0r",
                              "author": "AmNoSuperSand52",
                              "body": "The rich get richer lol",
                              "score": 6,
                              "created_utc": 1751381571.0,
                              "replies": [
                                {
                                  "id": "n0rojzb",
                                  "author": "Abigail716",
                                  "body": "Pretty much. Having money sets you up for future success if you take advantage of it. \n\nFor example my parents used their wealth to allow me to do things like travel the world and apprentice under top chefs in different countries. Instead of sitting at home doing nothing I was able to continuously refine my education because I had the money for it and didn't need to work just to cover bills. \n\nMy husband's job is more about innate talent. Hedge funds are one of the few jobs that are pretty much meritocracies. You might be able to get an interview with the top fund because of connections but that's about all it can get you. Maybe some fun would hire you just for the connection but you'll never climb above a low level position. Interestingly enough, my husband's specific job being wealthy actually made it more difficult to get hired. As a rule of thumb his boss typically does not hire people who come from money. Says it makes them lazy unless motivated because they have a backup.",
                                  "score": 1,
                                  "created_utc": 1751381827.0,
                                  "replies": [
                                    {
                                      "id": "n0sgexr",
                                      "author": "PurchaseStreet9991",
                                      "body": "> Pretty much. Having money sets you up for future success if you take advantage of it.\n\nTbf ‘taking advantage of it’ is basically as simple as being able to sign a check\n\n> As a rule of thumb his boss typically does not hire people who come from money. Says it makes them lazy unless motivated because they have a backup.\n\nBasically for the same reason. Someone who doesn’t have to work, is never going to be as good as someone who inherently has to value that work",
                                      "score": 2,
                                      "created_utc": 1751389578.0,
                                      "replies": [
                                        {
                                          "id": "n0tcth9",
                                          "author": "Abigail716",
                                          "body": "Hardly. Signing a check doesn't get you the experience only the opportunity. Signing a check got me there, but it's not like signing a check is going to wake me up at 5:00 a.m. to work 12 hour days under some random chef for a month for moving to another part of the country to repeat the process to learn a different technique or culinary skill.\n\nFor example it's because of my family's wealth I was able to aggressively pursue my education. I have two bachelor's degrees, I have an MBA, and I have a PhD. No matter how big of a check you write you can't just magically implant that knowledge into someone and hand them the degrees. \n\nI always find it interesting when people do believe that such as yourself because if that was the case you would see a lot more successful people that come from money. It would be basically unheard of for some wealthy child to be a failure if all you need to do is sign a check to be successful. \n\nSomeone who doesn't have to work isn't necessarily going to be any worse. But it does provide unique motivation knowing that if you fail, if you decide to take a weekend off, if you slack off and get fired it's the end of your livelihood. When your boss knows you have no plan B it provides them with a unique opportunity to exploit you. They know you're not willing to go back to poverty.",
                                          "score": 0,
                                          "created_utc": 1751398602.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0rgwb5",
              "author": "ToMorrowsEnd",
              "body": "Shit I just bought one for my Gardener.   Was going to buy one for the Au Pair but she did not appreciate the BMW iX we bought her last week so she can suffer.   Just a minute, the Mailman is at the door I'm gonna give him an Aston Martin as a thank  you.",
              "score": 6,
              "created_utc": 1751379569.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0pvr9h",
      "author": "techieman33",
      "body": "It probably doesn’t matter anyway since most manufacturers seem to be opposed to even normal CarPlay. They want us off of it and on to their own software. Then they can get back to charging us for data subscriptions, map subscriptions, and every other subscription they can think up.",
      "score": 135,
      "created_utc": 1751353249.0,
      "replies": [
        {
          "id": "n0qj6gt",
          "author": "glennchandler4",
          "body": "That's the concerning view of future cars, if more manufacturers do go that route and look to cut off Android Auto and Apple Car Play support.\n\n\nI've never used a map system built in to a car that wasn't terrible to use and clunky. I wonder if we are going to have to go back to mounting our phones on the windscreen like a NavMan again, or will there be a boom for aftermarket units or hacking to replace what comes with the car?",
          "score": 66,
          "created_utc": 1751366934.0,
          "replies": [
            {
              "id": "n0r3axm",
              "author": "Brilliantnerd",
              "body": "Even my Toyotas want another 2500 for tech package to run nav. It’s a tech jail. $80 dongle got me full mirror and bypass their bs",
              "score": 22,
              "created_utc": 1751375177.0,
              "replies": [
                {
                  "id": "n0r5fcy",
                  "author": "quintk",
                  "body": "Hey, what product are you talking about? I have a Toyota. Mostly use car play but anything to make it [the Toyota ] less annoying I’d like to hear about it",
                  "score": 7,
                  "created_utc": 1751375899.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0r30en",
              "author": "Aljada",
              "body": "Oh, the hacking is here. Never mind what the Ukrainians were doing with John Deere, have you searched for 'Tesla' on any reputable torrent site lately? Free \"FSD\", acceleration boosts, everything. We're well into *would you download a car* territory now.",
              "score": 34,
              "created_utc": 1751375077.0,
              "replies": [
                {
                  "id": "n0rh8t9",
                  "author": "ToMorrowsEnd",
                  "body": "Well to be fair, Teslas have almost no security at all.  There are youtube channels on tesla hacking.  It's what happens when you let a self appointed genius have full control over things he should be kept far away from.",
                  "score": 10,
                  "created_utc": 1751379672.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0rauyr",
              "author": "Oprah-Wegovy",
              "body": "I have a 2017 BMW 3 series that has excellent navigation with voice control and traffic management. It costs $100 for the LTE modem service and it’s snappy to use, very accurate with arrival times, reroutes traffic slowdowns and updates automatically. I actually prefer it over CarPlay in that case.",
              "score": 0,
              "created_utc": 1751377693.0,
              "replies": [
                {
                  "id": "n0wf1z6",
                  "author": "AdnanJanuzaj11",
                  "body": "You might prefer it but others might not. No reason for choice to be away from the user.",
                  "score": 1,
                  "created_utc": 1751438375.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0qh6av",
          "author": "OperationMobocracy",
          "body": "That may be their dream, but AFAICT they have thrown millions at the problem internally and with OEM headunit makers and their software is garbage.\n\nThe only ones with a chance of getting away with it are expensive status cars where the car itself is a significant part of the buying motivation, even then these people are affluent enough that they give them CarPlay anyway because they overwhelmingly use iPhones, too.\n\nIMHO the vast majority of people find most cars within a segment interchangeable and at this point not having CarPlay or Android Auto is a dealbreaker.",
          "score": 33,
          "created_utc": 1751365897.0,
          "replies": [
            {
              "id": "n0qsnd7",
              "author": "FarBoat503",
              "body": "The issue is they're throwing millions while Apple and Google throw billions. They're not even in the same league when it comes to software design.",
              "score": 13,
              "created_utc": 1751371182.0,
              "replies": []
            },
            {
              "id": "n0qoq6p",
              "author": "timatboston",
              "body": "CarPlay was a must have when I bought my last car. Took a look at Chevy for their EVs but they didn’t have CarPlay. Ended up going elsewhere to buy an EV that does have CarPlay.",
              "score": 18,
              "created_utc": 1751369516.0,
              "replies": [
                {
                  "id": "n0ri2ri",
                  "author": "ToMorrowsEnd",
                  "body": "Did you tell the sales person clearly this?  you need to.  you also need to say it on social media \"Did not buy chevy as it does not have carplay\" also send this to their HQ.  \"you lost a sale because of this\"\nYou have to make the noise,  because these executives are too stupid to realize they made a dumb decision",
                  "score": 8,
                  "created_utc": 1751379915.0,
                  "replies": [
                    {
                      "id": "n0s7rzu",
                      "author": "timatboston",
                      "body": "I did. And I agree, making it known that Chevy lost my sale because of their choice to remove CarPlay is important. It was my motivation for posting it here. \n\nI’m not on other social media platforms but I do my best here.",
                      "score": 6,
                      "created_utc": 1751387177.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n0qrama",
                  "author": "klaibson",
                  "body": "This is why CarPlay won’t just disappear, so many people buy cars because of CarPlay. And most of the car company software is trash. Apple has already partnered with a bunch of car companies to give full CarPlay integration",
                  "score": 11,
                  "created_utc": 1751370622.0,
                  "replies": []
                },
                {
                  "id": "n0r9ibd",
                  "author": "reformedmikey",
                  "body": "First thing I asked when I bought my car: “does it have CarPlay?”",
                  "score": 2,
                  "created_utc": 1751377253.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0qrl48",
          "author": "MoirasPurpleOrb",
          "body": "Isn’t it just GM, Tesla, and Rivian?",
          "score": 6,
          "created_utc": 1751370744.0,
          "replies": [
            {
              "id": "n0ryirb",
              "author": "blazze_eternal",
              "body": "Ford has been one of the worst to support it. I think they did it for two or three years when it was trending then went right back to their own shitty system.",
              "score": 2,
              "created_utc": 1751384595.0,
              "replies": [
                {
                  "id": "n1sjjwh",
                  "author": "DeeVeeOus",
                  "body": "Every Ford model that I know of supports CarPlay.",
                  "score": 2,
                  "created_utc": 1751889064.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0rzdfm",
          "author": "None",
          "body": "I’m never buying a car without Apple CarPlay again.",
          "score": 6,
          "created_utc": 1751384825.0,
          "replies": []
        },
        {
          "id": "n0r2yyx",
          "author": "Brilliantnerd",
          "body": "Yes absolutely. The greed knows no bounds especially with luxury brands when they know the customer won’t bat an eye at 20-30$ a month. Meanwhile we’re stuck with shitty bloated infotainment. Literally traded our last Mercedes bc of this. If you happen to utter anything remotely close to “hey” or “Mercedes” in conversation it stops music and interrupts with some ass-kissy sounding Alexa knockoff asking how to serve you then proceeds to misunderstand everything else. It’s garbage",
          "score": 3,
          "created_utc": 1751375063.0,
          "replies": []
        },
        {
          "id": "n0rkobx",
          "author": "zipykido",
          "body": "Manufacturers also seem very hesitant to add mounting points for phone mounts as well. I understand that they don't want to encourage phone use in a car but seriously, a flat reinforced surface for a phone mount would go a long way.",
          "score": 2,
          "created_utc": 1751380684.0,
          "replies": [
            {
              "id": "n0zyb08",
              "author": "hellcat_uk",
              "body": "Hidden phone holders even better. My Alfa has USB ports in the centre console, so no temptation to touch it except via the 'part of the reason I bought it' Android Auto.",
              "score": 1,
              "created_utc": 1751485045.0,
              "replies": []
            },
            {
              "id": "n0sgc2q",
              "author": "techieman33",
              "body": "They are probably afraid of the liability of doing that. If it breaks free in a crash and hurts you then they could get sued over it.",
              "score": 1,
              "created_utc": 1751389556.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0tjl8w",
          "author": "Other-Razzmatazz-816",
          "body": "I would rip out any manufacturer’s system to put in a CarPlay system.",
          "score": 1,
          "created_utc": 1751400561.0,
          "replies": [
            {
              "id": "n0tl03e",
              "author": "techieman33",
              "body": "That’s getting harder and harder to do as everyone has moved away from the standard sizes and started putting lots of other controls on the same interface.",
              "score": 2,
              "created_utc": 1751400969.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0qen43",
      "author": "mkvii1989",
      "body": "Pretty certain “Beelzebub gargling a mouthful of nails” is stolen from a Jeremy Clarkson road test on Top Gear back in the day.",
      "score": 14,
      "created_utc": 1751364525.0,
      "replies": []
    },
    {
      "id": "n0p6de1",
      "author": "mg118118118",
      "body": "It’s behind a paywall…",
      "score": 47,
      "created_utc": 1751340814.0,
      "replies": [
        {
          "id": "n0p6nbd",
          "author": "None",
          "body": "[deleted]",
          "score": -2,
          "created_utc": 1751340922.0,
          "replies": [
            {
              "id": "n0p79nn",
              "author": "Tigerbutton831",
              "body": "It is",
              "score": 3,
              "created_utc": 1751341176.0,
              "replies": [
                {
                  "id": "n0p83ti",
                  "author": "IFL_DINOSAURS",
                  "body": "its fucking both.\n\nthey probably use a propensity model to determine who will sign up and then use dynamic ad placements or paywalls based on that output. \n\nwhy kill user LTV for just subs when you can do a hybrid and still make some $$ off non-subscribers.",
                  "score": 1,
                  "created_utc": 1751341517.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0p7edo",
              "author": "rafinsf",
              "body": "Continue reading with a Verge subscription\nGet unlimited access to The Verge, read our subscriber-only newsletters, and cut down on the ads.",
              "score": 1,
              "created_utc": 1751341229.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0pztr9",
          "author": "flagbearer223",
          "body": "Pretty fucked up people try to charge money for doing high quality tech journalism, right?",
          "score": -36,
          "created_utc": 1751355683.0,
          "replies": [
            {
              "id": "n0q3mlu",
              "author": "psayre23",
              "body": "Yes, but only when it is linked on a free site, like Reddit.",
              "score": 11,
              "created_utc": 1751357980.0,
              "replies": [
                {
                  "id": "n227qx5",
                  "author": "flagbearer223",
                  "body": "\"jeeze, this is an article I'd like to read, but paying to read it?  C'mon don't be ridiculous.  It's not like journalists cost money\"",
                  "score": 1,
                  "created_utc": 1752010013.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0qcp0e",
              "author": "justhitmidlife",
              "body": "Oh hi greedy Nilay",
              "score": 3,
              "created_utc": 1751363434.0,
              "replies": [
                {
                  "id": "n0v81q6",
                  "author": "Green-Salmon",
                  "body": "Woops, 60% of posts are about sales where they get a commission.",
                  "score": 1,
                  "created_utc": 1751420045.0,
                  "replies": [
                    {
                      "id": "n2284pt",
                      "author": "flagbearer223",
                      "body": "https://www.theverge.com/ethics-statement\n\nYeah so fucked up they would find ways to get money and be fully transparent about it.  The sheer audacity of these journalists trying to get money for their profession.  IMO they should just swap out all their writers for Claude and call it a day.",
                      "score": 1,
                      "created_utc": 1752010125.0,
                      "replies": [
                        {
                          "id": "n22lj6s",
                          "author": "Green-Salmon",
                          "body": "I didn't call it shady, it just sucks that half the posts are about \"headphones $100 off\" and \"the best prime day deals\". Everyone is doing it and it's part of the reason why using websites in general is declining. Or maybe it happens because of the decline. Either way, good luck with paid super hero movie reviews.",
                          "score": 1,
                          "created_utc": 1752014174.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n0pti3b",
          "author": "None",
          "body": "[deleted]",
          "score": -33,
          "created_utc": 1751351963.0,
          "replies": [
            {
              "id": "n0pvbay",
              "author": "angelplasma",
              "body": "Yeah? They’re products? That you pay for?",
              "score": 24,
              "created_utc": 1751352994.0,
              "replies": [
                {
                  "id": "n0px26d",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -41,
                  "created_utc": 1751354015.0,
                  "replies": [
                    {
                      "id": "n0px5aq",
                      "author": "angelplasma",
                      "body": "That was a joke?",
                      "score": 19,
                      "created_utc": 1751354065.0,
                      "replies": [
                        {
                          "id": "n0pxlyp",
                          "author": "None",
                          "body": "[deleted]",
                          "score": -43,
                          "created_utc": 1751354339.0,
                          "replies": [
                            {
                              "id": "n0qse8j",
                              "author": "FarBoat503",
                              "body": "The problem is that the joke doesn't make sense. Apple doesn't paywall their software. They were one of the first to offer free OS updates, and also give away their productivity apps for free.",
                              "score": 7,
                              "created_utc": 1751371079.0,
                              "replies": []
                            },
                            {
                              "id": "n0rtbwy",
                              "author": "thisischemistry",
                              "body": "Step 1, come up with something funny. Yes, it's a product you pay for. And?",
                              "score": 3,
                              "created_utc": 1751383181.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n0p89gq",
      "author": "None",
      "body": "[deleted]",
      "score": 78,
      "created_utc": 1751341581.0,
      "replies": [
        {
          "id": "n0pboao",
          "author": "BedditTedditReddit",
          "body": "Specific to your car. Plenty of older models and some current have wired CarPlay.",
          "score": 95,
          "created_utc": 1751343011.0,
          "replies": [
            {
              "id": "n0pfqrn",
              "author": "TheGeneral_Specific",
              "body": "Well, we’re talking about this person’s car, not just any car",
              "score": 52,
              "created_utc": 1751344846.0,
              "replies": [
                {
                  "id": "n0q513u",
                  "author": "mmaster23",
                  "body": "Jokes on us, he's a GTA protagonist.. any car is his car.",
                  "score": 6,
                  "created_utc": 1751358845.0,
                  "replies": [
                    {
                      "id": "n0qgd7t",
                      "author": "Sir_Earl_Jeffries",
                      "body": "“I need that shit you driving!” -Carl Johnson",
                      "score": 6,
                      "created_utc": 1751365466.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0pbzn9",
              "author": "None",
              "body": "[deleted]",
              "score": -11,
              "created_utc": 1751343146.0,
              "replies": [
                {
                  "id": "n0pe4ah",
                  "author": "orbix42",
                  "body": "Virtually impossible in many if not most modern vehicles, and easily runs into the thousands of dollars to do a retrofit that shouldn’t be necessary.",
                  "score": 13,
                  "created_utc": 1751344102.0,
                  "replies": [
                    {
                      "id": "n0peehc",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 6,
                      "created_utc": 1751344231.0,
                      "replies": [
                        {
                          "id": "n0phobd",
                          "author": "Prolific_Masticator",
                          "body": "Same. Often leave it my back pocket or shirt pocket and can’t feel it get hot at anytime.",
                          "score": 1,
                          "created_utc": 1751345761.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n0pn5j8",
          "author": "OverSoft",
          "body": "It’s not the wireless connection that makes your phone hot. (It certainly doesn’t get hot in my car)\nIt’s charging your phone whilst driving.",
          "score": 41,
          "created_utc": 1751348514.0,
          "replies": [
            {
              "id": "n0qfvbr",
              "author": "Skrukkatrollet",
              "body": "Mine gets hotter using wireless carplay than it does using wired carplay, and I haven’t tried using wireless carplay while charging yet. I mostly have my phone fully charged when using carplay though, so there is no meaningful amount of charging when wired either.",
              "score": 9,
              "created_utc": 1751365197.0,
              "replies": []
            },
            {
              "id": "n0qx2rg",
              "author": "saladasz",
              "body": "Modern phones have software limiters that won’t overcharge the phone and just maintain it at battery so it doesn’t heat up as much. The wireless processing is computationally heavy and heats the phone up more than charging nowadays usually. Unless you’re using wireless charging. That shit heats your phone up to the temp of the surface of the sun",
              "score": 0,
              "created_utc": 1751372934.0,
              "replies": [
                {
                  "id": "n0ratg0",
                  "author": "OverSoft",
                  "body": "It’s the exact same data stream if it’s being sent via wire or via wireless. (A compressed h264 stream with a command and control channel)\n\nIf the wireless connection is bad (say the antenna is positioned far in the footwell or something), the bitrate just gets lowered, which doesn’t affect computation speed at all.\n\nIt might be the case that the implementation is bad in the car (only support for old mpeg4 streams wirelessly or something), but that would be very strange and certainly depends on the car.",
                  "score": 2,
                  "created_utc": 1751377679.0,
                  "replies": [
                    {
                      "id": "n0sgtl6",
                      "author": "saladasz",
                      "body": "There is more CPU load when using Bluetooth and wifi so it will generate more heat. Doesn’t really have to do with bitrate or the data stream. It’s the method of transmission that makes a difference.",
                      "score": 1,
                      "created_utc": 1751389688.0,
                      "replies": [
                        {
                          "id": "n0smgav",
                          "author": "OverSoft",
                          "body": "No, there REALLY isn’t. WiFi and/or Bluetooth (Carplay isn’t really BT other than the initial connection) is entirely managed by the WiFi modem, not the CPU, which is INCREDIBLY efficient.\n\nIt even takes more CPU cycles to send data over USB, because the USB connection IS fully managed by the CPU.",
                          "score": 1,
                          "created_utc": 1751391198.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0pvzlw",
              "author": "ModsHaveHUGEcocks",
              "body": "I don't know the reason why but it also depends on the car. I've driven a tonne of cars with wireless charging and a lot of them my phone gets stupidly hot on the wireless charging pad. Whereas the cheap wireless charger I got off ebay that plugs into the 12v outlet in my own car works perfectly fine",
              "score": -6,
              "created_utc": 1751353384.0,
              "replies": [
                {
                  "id": "n0pzdeg",
                  "author": "OverSoft",
                  "body": "I wasn’t talking about wireless charging. I was talking about charging.\n\nBut sure, wireless chargers can be all over the place in terms of efficiency and heat generation.",
                  "score": 9,
                  "created_utc": 1751355404.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0pi2gx",
          "author": "None",
          "body": "I have a 2024 Pathfinder and it has both wireless and wired CarPlay.",
          "score": 11,
          "created_utc": 1751345954.0,
          "replies": [
            {
              "id": "n0pjbkf",
              "author": "SydneyTechno2024",
              "body": "Same with the 2024 Toyota Corolla.",
              "score": 4,
              "created_utc": 1751346572.0,
              "replies": [
                {
                  "id": "n0qcm2b",
                  "author": "drunkentuckian",
                  "body": "My 2022 CRV only has wired.",
                  "score": 2,
                  "created_utc": 1751363389.0,
                  "replies": []
                },
                {
                  "id": "n0qo3ch",
                  "author": "dali01",
                  "body": "Are you sure it’s not a 2025? Just got a 2024 Camry and was told Toyota had no wireless until 2025 on any vehicles. (But that totally could have been a sales guy just trying to push me to a new one)\n\nMy 2024 Camry SE definitely has no wireless CarPlay though.",
                  "score": -1,
                  "created_utc": 1751369235.0,
                  "replies": [
                    {
                      "id": "n0qokgj",
                      "author": "SydneyTechno2024",
                      "body": "We’ve had it nearly a year, so pretty sure it’s a 2024 model.\n\nCould be a dodgy salesman, or just a regional difference.",
                      "score": 1,
                      "created_utc": 1751369446.0,
                      "replies": [
                        {
                          "id": "n0qr5py",
                          "author": "dali01",
                          "body": "That bastard.. lol\n\nI KNEW they had it earlier but he was so adamant about it..",
                          "score": 1,
                          "created_utc": 1751370566.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n28feb1",
                      "author": "shade010",
                      "body": "The 2024 Toyota Camry does not have wireless Apple CarPlay. It supports Apple CarPlay, but it requires a wired connection via a USB-A port. Some users have noted that the USB-C port in the 2024 Camry is for charging only and does not support data for CarPlay. To use wireless CarPlay, you would need a third-party adapter, such as those from Carlink or Ottocast, as mentioned in online forums.[](https://www.reddit.com/r/Camry/comments/14tlb4o/2024_toyota_camry_no_wireless_carplay/)[](https://discussions.apple.com/thread/255531123)[](https://www.toyotanation.com/threads/wireless-carplay.1762891/)",
                      "score": 1,
                      "created_utc": 1752089916.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0qb9by",
              "author": "RedditEd32",
              "body": "24 CR-V as well",
              "score": 2,
              "created_utc": 1751362610.0,
              "replies": []
            },
            {
              "id": "n0q7kgf",
              "author": "idkalan",
              "body": "I added a Kenwood radio to my car and it has both wired and wireless Carplay. \n\n\nWhat sucks is that car manufacturers are choosing to do either or, but not both, for some of their cars rather than keeping both options available for all their vehicles.",
              "score": 1,
              "created_utc": 1751360390.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0pxxrh",
          "author": "psybes",
          "body": "then use the cable to charge it, lol?",
          "score": 7,
          "created_utc": 1751354533.0,
          "replies": []
        },
        {
          "id": "n0rg73u",
          "author": "hmr0987",
          "body": "I recommend buying a wireless car charger that mounts to your AC vent. Works great for me. I love wireless CarPlay since I can just hop in and not have to fish my phone out of my pocket. On longer drives I just have my phone mounted to the ac vent charger.",
          "score": 3,
          "created_utc": 1751379362.0,
          "replies": []
        },
        {
          "id": "n0qm99n",
          "author": "dali01",
          "body": "It’s not just an issue there.. I was in Denver in December. Had to drive up into the Rockies, rented a BMW that was the first wireless CarPlay I had encountered. It was insanely cold and I was mostly on one back road. Just as I got into a town with traffic and lots of turns coming up my phone overheated and shut down. I was holding it out the window to cool off so I knew where to go!",
          "score": 2,
          "created_utc": 1751368406.0,
          "replies": [
            {
              "id": "n0qqc7z",
              "author": "Hawk13424",
              "body": "I use wireless charging and CarPlay on my Toyota and while it does get warm it has never gotten hot enough to shut down, even in the Texas heat.",
              "score": 2,
              "created_utc": 1751370219.0,
              "replies": []
            },
            {
              "id": "n19eh88",
              "author": "DJEmirMixtapes",
              "body": "I put mine on the AC Vents, but I think it started overheating originally because it was in the sun in the cup holder, it cooled down pretty quickly after that.",
              "score": 1,
              "created_utc": 1751608471.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0qprdc",
          "author": "Hawk13424",
          "body": "Connector on mine stopped working. Wireless charging and CarPlay are then only way my phone is still usable.",
          "score": 2,
          "created_utc": 1751369969.0,
          "replies": []
        },
        {
          "id": "n0rhjn0",
          "author": "maxstolfe",
          "body": "I'm one of the weird people who also prefers wired CarPlay. it charges my phone at the same time - that's really convenient!",
          "score": 1,
          "created_utc": 1751379760.0,
          "replies": []
        },
        {
          "id": "n0rlemw",
          "author": "killerbake",
          "body": "My car supports both.",
          "score": 1,
          "created_utc": 1751380899.0,
          "replies": []
        },
        {
          "id": "n0q4isg",
          "author": "200brews2009",
          "body": "Id say wired CarPlay actually has a higher risk of overheating the phone. At least in Subarus, if I’ve got CarPlay running via usb here on a sunny day in upstate NY,  it’s running whatever apps and charging the battery. I think twice my phone displayed an overheating warning. That’s never happened when it’s over Bluetooth. \n\nI’d assume it’s also better for the battery to not be plugged in and constantly charging the phone, especially on longer road trips where you’re using it for hours on end.",
          "score": -1,
          "created_utc": 1751358533.0,
          "replies": [
            {
              "id": "n0rtpxx",
              "author": "manzanita2",
              "body": "Was that the CarPlay or the charging ?",
              "score": 2,
              "created_utc": 1751383287.0,
              "replies": [
                {
                  "id": "n0sag25",
                  "author": "200brews2009",
                  "body": "They’re kind of intertwined really. You plug the phone in via usb to use CarPlay it automatically starts charging. There may be some way to turn off charging but that’s not how it works by default at least.",
                  "score": 1,
                  "created_utc": 1751387931.0,
                  "replies": [
                    {
                      "id": "n0t02cq",
                      "author": "manzanita2",
                      "body": "Yep totally.  My point was only that charging (with or without CarPlay running) generates some heat in phones unless it's done rather slowly.",
                      "score": 1,
                      "created_utc": 1751394954.0,
                      "replies": [
                        {
                          "id": "n0v9jxq",
                          "author": "200brews2009",
                          "body": "I’ll concede that maybe when you’re in and out of cell range the phone may warm up due to all he attempts it makes to reconnect to a network. But the point stands that a wireless connection would create less heat overall.",
                          "score": 1,
                          "created_utc": 1751420573.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n0px5ll",
      "author": "positivcheg",
      "body": "And no cars who will actually support it?",
      "score": 10,
      "created_utc": 1751354070.0,
      "replies": [
        {
          "id": "n0qsy4u",
          "author": "FarBoat503",
          "body": "Kia and Hyundai will.\n\nAnd before you joke about stealing them, the new models have immobilizers. You can't steal them anymore.\n\nIn addition, they're one of the only car manufacturers to support Apple Car Key.",
          "score": 13,
          "created_utc": 1751371303.0,
          "replies": [
            {
              "id": "n0r3ft1",
              "author": "Abigail716",
              "body": "A major problem still is even the ones that are not affected by that theft are still having their insurance rates increased because car thieves are not smart enough to know which cars are which and will still try to steal them. A friend of mine has a newer Hyundai not affected by the theft problem but his insurance has still more than doubled in the last 5 years.",
              "score": 0,
              "created_utc": 1751375224.0,
              "replies": [
                {
                  "id": "n0rtrzn",
                  "author": "Dt2_0",
                  "body": "Yea, after the years of dumb shit I have had to do to maintain a Genesis Coupe (Doesn't have an immobilizer, but it's a stick, so I haven't gotten the wheel lock cause... If they are smart enough to drive it, they can probably watch a LPL video on how to remove a wheel lock), I'm done with Hyundai/Kia.\n\nSome examples. AC in that car sucks at the best of times, and there is a hose that constantly leaks in the system, no real fix that I have found. Replaced that hose several times each time I recharge it.\n\nHas one of those stupid crush washers that you need to buy every time you do an oil change. Fixed that with a Fumoto Valve after a shop I sent it into reused the old washer.\n\nThere was a recall that was done YEARS too late where brake fluid could leak onto the fusebox, causing an engine bay fire. Dealer gave me way too much shit trying to get that one fixed. Kept trying to buy my car and sell me a new shitbox.\n\nThe Keyfob battery died. I don't drive all that much. A few times a week. Apparently if you leave the keyfob too long without power, it loses it's programming to the car. Most cars from that era, this would be an easy fix by either me or a locksmith. NOPE. $700 at the dealer for a new keyfob programmed to the car.\n\nThe Polarization filter on the display in the car peeled off the display, making it impossible to use. This was thankfully an easy fix with a cheap Android Auto/Carplay Head Unit kit. Was about $300 and a few days of work to fix.\n\nClutch went out in the car. To get a factory clutch/Flywheel/pressure plate kit was several thousand dollars. I ended up going with an Aftermarket Clutch kit for about $600 and threw it in myself. The new clutch is a performance street/strip clutch and is kinda a PITA to drive, but its way better than spending a good portion of what the car is worth on a new clutch.",
                  "score": 2,
                  "created_utc": 1751383302.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0qocjr",
          "author": "dali01",
          "body": "Did you not read the article?!? It is all about a car that supports it! Just go buy an Aston Martin!",
          "score": 1,
          "created_utc": 1751369347.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0qw4ug",
      "author": "Spagman_Aus",
      "body": "I assumed anything these days named “ultra” would have a monthly subscription fee. I bet that happens at some point.",
      "score": 9,
      "created_utc": 1751372569.0,
      "replies": []
    },
    {
      "id": "n0pxnmn",
      "author": "lroy4116",
      "body": "Hiw about they fix my carplay gps saying my current location is in a lake first",
      "score": 5,
      "created_utc": 1751354366.0,
      "replies": [
        {
          "id": "n0q8qfq",
          "author": "noeagle77",
          "body": "![gif](giphy|5cBBUJGiIniZZWtBSa|downsized)",
          "score": 10,
          "created_utc": 1751361100.0,
          "replies": []
        },
        {
          "id": "n0q3p1y",
          "author": "sheepthechicken",
          "body": "Better than being in a lake last I guess?",
          "score": 3,
          "created_utc": 1751358020.0,
          "replies": []
        },
        {
          "id": "n0qo7b3",
          "author": "AreEUHappyNow",
          "body": "Nothing to do with Apple, the headunit in your car is broken.",
          "score": 2,
          "created_utc": 1751369284.0,
          "replies": [
            {
              "id": "n0sqkbz",
              "author": "thegroundbelowme",
              "body": "When using carplay, it's the phone's GPS, not the car's",
              "score": 1,
              "created_utc": 1751392303.0,
              "replies": [
                {
                  "id": "n0y9o8p",
                  "author": "AreEUHappyNow",
                  "body": "Not true, I had one off aliexpress with a built in GPS, it broke and the machine was useless, my phone works fine.",
                  "score": 1,
                  "created_utc": 1751467645.0,
                  "replies": [
                    {
                      "id": "n0yoxht",
                      "author": "thegroundbelowme",
                      "body": "What the heck are you talking about? My car also has a built-in GPS.  If I'm using the car's GPS nav, it uses the car's GPS signal. If I'm using carplay, which is literally just a secondary interface for your phone, it uses the phone's GPS signal.",
                      "score": 1,
                      "created_utc": 1751471916.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n0q4zeu",
          "author": "AmateurMinute",
          "body": "The machine knows!",
          "score": 1,
          "created_utc": 1751358816.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0p8pwl",
      "author": "zeehkaev",
      "body": "Is anybody really excited about this ?.current implementation is fine for me",
      "score": 19,
      "created_utc": 1751341766.0,
      "replies": [
        {
          "id": "n0pbbtk",
          "author": "RustySheriffsBadge1",
          "body": "Yes. Use any phone from Google or Apple and it’s intuitive. Jump into most cars and you’ll often be met with interfaces and menus that go 7 submenus deep to change things that should be intuitive.",
          "score": 35,
          "created_utc": 1751342859.0,
          "replies": [
            {
              "id": "n0q97vy",
              "author": "Tight_Olive_2987",
              "body": "Have you ever been into the settings on an iPhone? And my car is simple enough I don’t really change it either",
              "score": -5,
              "created_utc": 1751361390.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0qke0w",
          "author": "Wonderful_Volume1670",
          "body": "Forgot I was in gadgets until I came across a dour comment like this",
          "score": 6,
          "created_utc": 1751367533.0,
          "replies": []
        },
        {
          "id": "n0sbcue",
          "author": "DiplomatikEmunetey",
          "body": "Very. Imagine getting into any car and your seats, mirrors, radio, maps, everything adjusts to you immediately. It would be fantastic for car rentals.\n\nAlso, car infotainment systems are awful, they are not updated, and car manufactures want them to nickel and dime customers with endless subscriptions. \n\nI do not need another computer on wheels, I want the smartphone to be the CPU of the car.​",
          "score": 1,
          "created_utc": 1751388185.0,
          "replies": []
        },
        {
          "id": "n0qgpsr",
          "author": "GenericReditAccount",
          "body": "I’m certainly interested. \n\nEverything is moving touchscreen which is very dumb when considering the same person navigating the menus is also responsible for navigating a giant box of metal hurtling down a freeway. I’d like the system to be as familiar, intuitive, and efficient as possible. My current car’s infotainment isn’t quite that.",
          "score": 0,
          "created_utc": 1751365654.0,
          "replies": []
        },
        {
          "id": "n0qax0b",
          "author": "Christopher135MPS",
          "body": "Not in the slightest. I have zero interest in a phone and computer tech company running the dash in my car.",
          "score": -4,
          "created_utc": 1751362407.0,
          "replies": [
            {
              "id": "n0qqpbi",
              "author": "Hawk13424",
              "body": "Opposite for me. I’d much rather have my phone vendor run my car’s visual experience over the absolute shit that is car company software.",
              "score": 9,
              "created_utc": 1751370374.0,
              "replies": [
                {
                  "id": "n0r1tfi",
                  "author": "Christopher135MPS",
                  "body": "This is heavily car dependant. My Lexus and Volvo had fantastic digital dashes with more than enough information, displayed sensibly and legibly, with easy button control instead of touchscreen garbage. \n\nI guess if the car is a bottom tier Camry, yeah maybe the oem dash would be bin worthy.",
                  "score": -1,
                  "created_utc": 1751374662.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0r31zl",
              "author": "alc4pwned",
              "body": "I'd much rather have the software running my dash be created by a tech company that is good at software than a car company personally.",
              "score": 2,
              "created_utc": 1751375092.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0p9xdo",
          "author": "RecoveringRed",
          "body": "In all likelihood, they will make it shittier like they always do",
          "score": -12,
          "created_utc": 1751342266.0,
          "replies": [
            {
              "id": "n0peb6y",
              "author": "orbix42",
              "body": "Shittier than existing the existing electronics and usability nightmare that is most vehicle interfaces at this point? Highly unlikely imho.",
              "score": 6,
              "created_utc": 1751344189.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0sabg3",
      "author": "joebear174",
      "body": "Is Aston Martin still the only car-maker that's going along with CarPlay Ultra? It looks pretty cool, but if it never makes it over to regular, affordable cars, it's gonna feel like a huge waste of time developing this stuff. I have CarPlay in my Nissan and I love it, but it's a bummer seeing that none of these new features will likely make it to my car.",
      "score": 1,
      "created_utc": 1751387896.0,
      "replies": []
    },
    {
      "id": "n0ugtt3",
      "author": "cpitchford",
      "body": "I'm interested if cheap-china based head units are going to get ultra too.\n\nI mean, they're not necessarily going to integrate with in-car controls (like climate, or sensors) but I would be so happy if I could \"hey Siri, louder\" or \"hey Siri, turn on the FM radio\"\n\nLike, why was this ever missed? Why doesn't car play allow for this already?",
      "score": 1,
      "created_utc": 1751410600.0,
      "replies": []
    },
    {
      "id": "n0xv9gw",
      "author": "zoinkinator",
      "body": "will never buy or rent any car without apple carplay.",
      "score": 1,
      "created_utc": 1751463312.0,
      "replies": []
    },
    {
      "id": "n19e0i4",
      "author": "DJEmirMixtapes",
      "body": "I would like to be able to download a few tracks directly onto a hard drive in the car you know, instead of always needing my phone. Same problem with the navigation, it always says navigation not installed... only works if my phone is plugged in through android auto. My Toyota does connect to it easily though.",
      "score": 1,
      "created_utc": 1751608239.0,
      "replies": []
    },
    {
      "id": "n0qeefr",
      "author": "SmooK_LV",
      "body": "There are cars with good software - Tesla, Xiaomi, Rivian, NIO, and some other chinese brands. Then there are cars with decent enough software - Renault, Volvo (i.e. Android Automotive). Then, next best thing is either Android Auto or Apple CarPlay (and this version still keeps it in same tier). Then we have Hyundai, Kia and Volkswagen software. And at bottom of barrel - BMWs, Audis, Porsche, Suzuki, Toyota, ... .\n\nLegacy automakers either need to go Android Automotive or support both wired & wireless Android Auto / CarPlay. If they can't make a decent software for more than 15  years already then partner with someone who can.\n\nAnd no, I am not paying big bucks for a car just to have a cheap shitty software on it.",
      "score": 2,
      "created_utc": 1751364390.0,
      "replies": [
        {
          "id": "n0qi9el",
          "author": "OperationMobocracy",
          "body": "A big help for the shitty software would be using SoCs and displays that weren't overstock parts from 2018's most popular discount tablet.  I was kind of shocked in 2019 when I found out my 2019 Subaru's chipset didn't even have 5 Ghz wifi support of any kind considering that the Snapdragon S4, released in 2012, had it.\n\nHigh(er) resolution displays coupled with speedier CPUs would paper over some of the bad design.",
          "score": 4,
          "created_utc": 1751366463.0,
          "replies": [
            {
              "id": "n0qrbp8",
              "author": "Hawk13424",
              "body": "They can’t use the same chips as used in your phone. They have to be auto qualified which means extended temp range and longer life expectations. In addition, if they do backup camera then they often require (or desire depending on implementation), safety oriented hardware components.",
              "score": 3,
              "created_utc": 1751370635.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0rhf7y",
      "author": "hmr0987",
      "body": "I personally don’t really understand all the hate for CarPlay. It’s one less system to configure and for the vast majority of OEM infotainment systems Apple does a much better job with the interface. It certainly has come a long way and can still improve but I thoroughly much prefer CarPlay over my cars system (Subaru). Same is true for basically any rental, in fact if you rent cars often CarPlay is a dream come true. Just hop in and go; no configuration needed and all your stuff is right on screen how you want it (unless you want it to work wirelessly then you have to figure out how to connect it up).\n\nThe only argument I could get behind for CarPlay being “bad” is how it’s consolidates the whole market into one system. No originality and no competition.",
      "score": 1,
      "created_utc": 1751379725.0,
      "replies": []
    },
    {
      "id": "n0q92rd",
      "author": "Alone_Job_9000",
      "body": "Apple: Innovating ways to make my old car feel obsolete.",
      "score": -5,
      "created_utc": 1751361304.0,
      "replies": [
        {
          "id": "n0q9ra5",
          "author": "SquareTarbooj",
          "body": "If anything, Apple Carplay made my ancient vehicle feel new. \n\nJust put in a Pioneer/Sony aftermarket head unit and your 2005 vehicle suddenly gets a navigation and music system that feels very 2025.",
          "score": 20,
          "created_utc": 1751361713.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0qtsva",
      "author": "turnhistv0ff",
      "body": "Did they fix the dog shit shuffle that plays the same 30 songs",
      "score": 0,
      "created_utc": 1751371648.0,
      "replies": []
    },
    {
      "id": "n0pekfr",
      "author": "xavPa-64",
      "body": "This is good news for people who love continuity and hate disruption",
      "score": -17,
      "created_utc": 1751344305.0,
      "replies": [
        {
          "id": "n0pkntm",
          "author": "Psilocybin-Cubensis",
          "body": "Found the robot.",
          "score": 7,
          "created_utc": 1751347243.0,
          "replies": [
            {
              "id": "n0r0w6i",
              "author": "xavPa-64",
              "body": "If I were a robot, you people would just wanna buy me lmao",
              "score": 1,
              "created_utc": 1751374341.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0q1bw7",
      "author": "kingchongo",
      "body": "*apple scratching at its neck\n“Yall got…any more of that data we can… harvest?”",
      "score": -5,
      "created_utc": 1751356592.0,
      "replies": []
    }
  ]
}