{
  "post": {
    "title": "Samsung Galaxy S25 Ultra review: Too much AI, not enough Ultra",
    "author": "meenu_anon",
    "id": "1idt2l0",
    "score": 2030,
    "created_utc": 1738260022.0,
    "selftext": "",
    "num_comments": 370,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1idt2l0/samsung_galaxy_s25_ultra_review_too_much_ai_not/"
  },
  "comments": [
    {
      "id": "ma27upp",
      "author": "scorpiknox",
      "body": "expansion crush squash sable divide flowery price payment silky chubby\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "score": 191,
      "created_utc": 1738264728.0,
      "replies": [
        {
          "id": "ma52ff2",
          "author": "got-trunks",
          "body": "It sounds like you're 7 drinks in! Would you like to text your ex?",
          "score": 54,
          "created_utc": 1738296407.0,
          "replies": []
        },
        {
          "id": "ma7uaqj",
          "author": "PancAshAsh",
          "body": "I guess when Clippy said \"strike me down and I'll become more powerful than you can possibly imagine\" this is what he meant.",
          "score": 13,
          "created_utc": 1738340773.0,
          "replies": []
        },
        {
          "id": "ma5yems",
          "author": "raxafarius",
          "body": "Im with it if they name him Clappy and give him some cake",
          "score": 3,
          "created_utc": 1738312296.0,
          "replies": []
        },
        {
          "id": "ma94sbn",
          "author": "trueriptide",
          "body": "Clippy has evolved. We will never escape.",
          "score": 1,
          "created_utc": 1738353776.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma1w6ty",
      "author": "The_Pandalorian",
      "body": "Super excited for the AI bubble to burst.",
      "score": 1318,
      "created_utc": 1738261530.0,
      "replies": [
        {
          "id": "ma2g6rm",
          "author": "Pauly_Amorous",
          "body": "> Super excited for the AI bubble to burst.\n\nThen they'll roll out the next gimmick that nobody wants.",
          "score": 262,
          "created_utc": 1738267015.0,
          "replies": [
            {
              "id": "ma2hozb",
              "author": "The_Pandalorian",
              "body": "LOL, so true. Silicon Valley is a massive ball of grift and fake \"value.\"",
              "score": 129,
              "created_utc": 1738267434.0,
              "replies": [
                {
                  "id": "ma3w52g",
                  "author": "Ivotedforher",
                  "body": "Arent we all?",
                  "score": -9,
                  "created_utc": 1738282023.0,
                  "replies": [
                    {
                      "id": "ma4b5pm",
                      "author": "storytimestorytime10",
                      "body": "Downvoted for honesty. Not saying it’s an excuse.",
                      "score": 18,
                      "created_utc": 1738286911.0,
                      "replies": [
                        {
                          "id": "ma4cywa",
                          "author": "Ivotedforher",
                          "body": "...and a merry downvote to you, too, friend!",
                          "score": -9,
                          "created_utc": 1738287512.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ma3x3am",
              "author": "icedlemons",
              "body": "I’d like 3D to make a comeback, maybe bell bottoms too…",
              "score": 39,
              "created_utc": 1738282333.0,
              "replies": [
                {
                  "id": "ma4336l",
                  "author": "ki11bunny",
                  "body": "We had both of these not so long ago, I want something we haven't had on a long while, like togas and laurel wreaths.",
                  "score": 13,
                  "created_utc": 1738284271.0,
                  "replies": []
                },
                {
                  "id": "ma5exte",
                  "author": "Sdn61387",
                  "body": "I would kinda like to see a 3d phone, done like how the Nintendo 3ds was. Useful? No. Makes things better? Also mostly no. But it would be cool.",
                  "score": 1,
                  "created_utc": 1738301641.0,
                  "replies": []
                },
                {
                  "id": "ma6beqm",
                  "author": "GammaDealer",
                  "body": "I remember 3d was big for movies around 2010 because I was a film student at the time and definitely knew it was a gimmick",
                  "score": 1,
                  "created_utc": 1738320392.0,
                  "replies": [
                    {
                      "id": "mablh7e",
                      "author": "RedPajama45",
                      "body": "I remember a guy at work rushing out to get a new 3D TV because \"everything is going to be 3D before too long\"",
                      "score": 2,
                      "created_utc": 1738382319.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ma6vp5k",
                  "author": "encreturquoise",
                  "body": "3D Metaverse glasses AI enhanced",
                  "score": 1,
                  "created_utc": 1738329878.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ma4b9ha",
              "author": "ok-commuter",
              "body": "Curved phones anyone?",
              "score": 13,
              "created_utc": 1738286946.0,
              "replies": []
            },
            {
              "id": "ma49iw4",
              "author": "AtomicSymphonic_2nd",
              "body": "Probably will go back to VR/AR, depending on how far along Neuralink has gotten in their research.",
              "score": 9,
              "created_utc": 1738286372.0,
              "replies": []
            },
            {
              "id": "ma4heis",
              "author": "NZ_Guest",
              "body": "Cloud AI",
              "score": 1,
              "created_utc": 1738288993.0,
              "replies": []
            },
            {
              "id": "ma5hnsc",
              "author": "squishydude123",
              "body": "Bring back the IR blaster i say\n\nI want to be able to control my fan and TV from my phone",
              "score": 1,
              "created_utc": 1738302941.0,
              "replies": []
            },
            {
              "id": "ma5qo75",
              "author": "Rezenbekk",
              "body": "Depends if they can keep manufacturing hype and demand. Investors can only take so many years of hopeless losses because they give up on the whole thing. It can limp on for decades though, so can't even properly brace for impact - we don't know the exact date it all crashes.",
              "score": 1,
              "created_utc": 1738307704.0,
              "replies": []
            },
            {
              "id": "ma66oaf",
              "author": "beklog",
              "body": "Then call it: AI Pro Ultra+",
              "score": 1,
              "created_utc": 1738317495.0,
              "replies": []
            },
            {
              "id": "ma6e7yz",
              "author": "Metrobolist3",
              "body": "Yeah, their problem is smart phones have been \"good enough\" for years. For an average user who doesn't game on their phone and just takes photos of their cat and holiday snaps having a 90 megapixel camera and the latest octa-core Snapdragon whatever processor isn't going to tempt them to dump their current functioning phone. Gimmicks are all they've got unless there's some quantum leap in something people actually care about like battery life. Till then they have to enforce obsolescence by killing off security updates and making batteries too difficult to replace easily.",
              "score": 1,
              "created_utc": 1738322001.0,
              "replies": []
            },
            {
              "id": "ma7upcz",
              "author": "garry4321",
              "body": "“Maybe we do the metaverse thing now? Guys? GUYS?”\n\n-Mark Zucc",
              "score": 1,
              "created_utc": 1738340886.0,
              "replies": []
            },
            {
              "id": "magdhhi",
              "author": "Chasedabigbase",
              "body": "Smell-o-mobile!",
              "score": 1,
              "created_utc": 1738450060.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma1yr37",
          "author": "None",
          "body": "[deleted]",
          "score": 252,
          "created_utc": 1738262230.0,
          "replies": [
            {
              "id": "ma1zv3g",
              "author": "JAlfredJR",
              "body": "To me, it's the threat to livelihoods. I don't think AI is better than most humans and just about anything. But that won't stop C-suite bozos from *thinking* it can be better. \n\nHeck, I was reviewing an infographic yesterday, at work, that was produced by AI. I just finished fixing it a few minutes ago. It took four or five rounds of revisions to fix the frankly weird language and bizarre hallucinations. Just incorrect facts and strange wording.\n\nSo it ended up taking three humans 4x the time. Sigh.",
              "score": 119,
              "created_utc": 1738262534.0,
              "replies": [
                {
                  "id": "ma2cli9",
                  "author": "MrFrittz",
                  "body": "Yeah, the problem isn't that it is better, it's that it's cheaper and faster, quality be damned.\n\nThat's all the c-suite is going to pay attention to, and they aren't going to consider the knock-on effects of the poor quality. They're going to hire a handful of coders to clean up and string together the inefficient code slop. They're going to hire one or two artists to Photoshop and prettify the soulless art that gets vomited out in volume. They're going to hire one writer to proofread and edit the endless glut of homunculus text for their article mill. And they're going to do it at lower pay, because if they don't like it, the unemployment line is full of coders, artists, and writers who may need it more. \n\nShit sucks, man.",
                  "score": 45,
                  "created_utc": 1738266035.0,
                  "replies": [
                    {
                      "id": "ma2err9",
                      "author": "JAlfredJR",
                      "body": "Well, my hope is the By Humans, For Humans will be a thing—and people who really care about quality will go that way. I'm already seeing it, honestly.\n\nThink about it this way: The more of this crap and slop that's out there, the more the good stuff shines.",
                      "score": 24,
                      "created_utc": 1738266631.0,
                      "replies": []
                    },
                    {
                      "id": "mamtyxt",
                      "author": "FearLeadsToAnger",
                      "body": "Tbf the quality is better than what most humans are capable of, just not the firmly specialised ones.",
                      "score": 1,
                      "created_utc": 1738535243.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ma236w3",
                  "author": "The_Pandalorian",
                  "body": "AI is really dogshit at anything that involves the creative process. And you simply cannot trust it to get things right.\n\nI'm not denying it probably has significant potential in certain technical/scientific/medical fields with specific datasets, but... yeah. I've had AI simply *make up news articles that don't exist.* And then \"apologize\" when I call it out.",
                  "score": 27,
                  "created_utc": 1738263441.0,
                  "replies": [
                    {
                      "id": "ma31l53",
                      "author": "cobigguy",
                      "body": "Ironically, a professor who was a legally accredited \"expert\" in AI and the dangers of it, [submitted a legal brief written by AI without actually checking it](https://youtu.be/6BQXkK6aBZg?si=JffClPu8-bKeP5E3).\n\nTalk about ruining your credibility for the rest of your life.",
                      "score": 20,
                      "created_utc": 1738272938.0,
                      "replies": [
                        {
                          "id": "ma341io",
                          "author": "The_Pandalorian",
                          "body": "Yeah, any work that requires any sort of legal or regulatory precision is going to just lead to massive shitshows for anyone who tries to use AI to do it.",
                          "score": 13,
                          "created_utc": 1738273622.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ma2ef58",
                      "author": "JAlfredJR",
                      "body": "You're lucky it didn't double-down",
                      "score": 5,
                      "created_utc": 1738266534.0,
                      "replies": [
                        {
                          "id": "ma2hu0g",
                          "author": "The_Pandalorian",
                          "body": "Yeah, I wouldn't put it past it. I asked it why it lied and it said that it wanted to please me with what I asked for.\n\nFucking weird shit.",
                          "score": 12,
                          "created_utc": 1738267473.0,
                          "replies": [
                            {
                              "id": "ma4hwh8",
                              "author": "dontbajerk",
                              "body": "You can tell it it's lying when it's correct and get the same response.  That's the thing, they're not actually intelligent.",
                              "score": 4,
                              "created_utc": 1738289161.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ma3gaxi",
                  "author": "gloomdwellerX",
                  "body": "We need regulation to protect human jobs. I work in healthcare as a bedside ICU RN, AI can’t really take my job but every time I hear the words AI Nurse or AI Doctor, I just wonder how we let them practice without a license. It’s a protected title, random people can’t go around calling themselves a nurse or doctor, we have licensing board and they need to advocate or lobby for our profession.",
                  "score": 2,
                  "created_utc": 1738277136.0,
                  "replies": []
                },
                {
                  "id": "ma4qfbs",
                  "author": "StarChaser1879",
                  "body": "every technology has threatened jobs, thats the entire point of developing technology.",
                  "score": 1,
                  "created_utc": 1738292054.0,
                  "replies": []
                },
                {
                  "id": "mac9wsb",
                  "author": "Troll_Dovahdoge",
                  "body": "AI needs to replace the C suite bozos. What do they even do?",
                  "score": 1,
                  "created_utc": 1738393882.0,
                  "replies": []
                },
                {
                  "id": "ma3cbeb",
                  "author": "NicholasAakre",
                  "body": "[Humans need not apply](https://www.youtube.com/watch?v=7Pq-S557XQU).\n\nAutomation is coming and while it may not be as good as humans now, it eventually will be.\n\nThe Age of Robots is coming. The question is will it be more utopian or dystopian.",
                  "score": 0,
                  "created_utc": 1738275967.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ma2m5n5",
              "author": "FrayDabson",
              "body": "I agree that the “let’s put AI everywhere” shit really needs to stop.  The LLMs themselves, on the other hand, are extremely useful when used properly.  \n\nSomething I like to point out when people are fed up with “AI”. As they should be, given a good majority of it is just a gimmick to get more money out of people with little to no benefit.",
              "score": 16,
              "created_utc": 1738268679.0,
              "replies": []
            },
            {
              "id": "ma3i1j4",
              "author": "alidan",
              "body": "ai being slapped on everything will go away, but the ai itself will not. \n\nsmartphones rely on ai and have for a long time for quite alot of their image processing. what I would love is a data set being put on the phones, that is accessed by the phone to do local ai stuff, I have one on my pc that demands 5gb of ram for full voice control of my pc and its pretty damn accurate, not as good as dragon was but its also not 150$ and most of what makes it better is quality of life, not quality of dictation or control.",
              "score": 9,
              "created_utc": 1738277650.0,
              "replies": []
            },
            {
              "id": "ma22w5i",
              "author": "The_Pandalorian",
              "body": "It's really, really obnoxious, just slapping AI on fucking everything.\n\nI don't think your average person gives a shit about AI as a feature. I know it just annoys me.",
              "score": 4,
              "created_utc": 1738263360.0,
              "replies": []
            },
            {
              "id": "ma29p7z",
              "author": "Xendrus",
              "body": "AI literally does not exist. And this shit version people are calling AI is making investors ask \"why do you want my money for \"AI\" research? we have AI at home: \" ... Classic humanity, kneecapping its own future for short term gains. Get coconut, bonk wife on head for it. No children? Oh well.",
              "score": 3,
              "created_utc": 1738265232.0,
              "replies": [
                {
                  "id": "ma2douf",
                  "author": "MixT",
                  "body": "I took an AI classes in College 7 years ago, of course AI exists. The issue is that lay people think AI means a sentient agent who can behave as a human, which doesn't exist yet, but I'm sure we'll be much closer in 5 years. \n\n\nThat being said, everyone who hears \"AI\" think of chat bots, which is cool tech, but the biggest breakthroughs AI is giving us are happening behind the scenes. Alphafold for example: https://deepmind.google/technologies/alphafold/\n\nI think we are close to hitting the peak hype for AI, and it will slowly stop being a buzzword until there is a large breakthrough that can be marketed to the general public.\n\nIn the meantime, AI will be leveraged to do amazing things, the vast majority of which the public will never know about.",
                  "score": 19,
                  "created_utc": 1738266333.0,
                  "replies": [
                    {
                      "id": "ma2dyf5",
                      "author": "Xendrus",
                      "body": "> which doesn't exist yet, but I'm sure we'll be much closer in 5 years.\n\nAI doesn't exist you say?",
                      "score": -12,
                      "created_utc": 1738266407.0,
                      "replies": [
                        {
                          "id": "ma2g1cs",
                          "author": "MixT",
                          "body": "Here's the definition of AI: https://cloud.google.com/learn/what-is-artificial-intelligence\n\nYes it exists. \n\nYou're thinking of Artificial General Intelligence (https://www.ibm.com/think/topics/artificial-general-intelligence), which does not exist yet.",
                          "score": 10,
                          "created_utc": 1738266974.0,
                          "replies": [
                            {
                              "id": "ma3ewhz",
                              "author": "corut",
                              "body": "Fun fact: until llm came out AGI was just called AI.",
                              "score": 4,
                              "created_utc": 1738276724.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ma3nn8c",
                          "author": "kostya8",
                          "body": "Look up AGI. That's what you're talking about. \n\nWhy does everyone seem to have this urge to blurt out ignorant opinions based on nothing but their complete lack of knowledge? You don't even know what AI is, why even attempt to have a debate about it...",
                          "score": 3,
                          "created_utc": 1738279354.0,
                          "replies": [
                            {
                              "id": "ma403pu",
                              "author": "Xendrus",
                              "body": "AI doesn't exist you say? (Still waiting for \"AI\" to be shown to me. You keep moving the goal post and jerking off to how brilliant your shit side piece is. Super cool. Asshat. No one wants to buy your crypto.)",
                              "score": -4,
                              "created_utc": 1738283308.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ma2jxnb",
              "author": "coolthesejets",
              "body": "I think there are big parallels to the dotcom bubble of the '90s, people recognized the massive potential and tried to exploit it, but they didn't get it quite right. It's the same with ai, there is massive potential and it will absolutely change everything just the way the internet did, but they're still figuring out how to make money from it.",
              "score": 2,
              "created_utc": 1738268062.0,
              "replies": [
                {
                  "id": "ma2w6en",
                  "author": "valdus",
                  "body": "If you throw enough shit at the wall, some of it will stick.",
                  "score": 1,
                  "created_utc": 1738271447.0,
                  "replies": []
                },
                {
                  "id": "ma5aymj",
                  "author": "PaxDramaticus",
                  "body": ">people recognized the massive potential and tried to exploit it, but they didn't get it quite right. \n\nThat's... ridiculously generous. \n\nIn both cases, it's not a matter of well-meaning business leaders trying their best and just not quite getting it right. It's more like the pets.com's of the world dumping massive amounts of advertising into ideas that hadn't even been shown to work yet because obtaining investment in the short term wasn't just more important than building sustainable business models, it was literally all that mattered. \n\nIn my town at the height of the dot com bubble, stores were appending the words \"dot com\" to their brick and mortar business names for no reason other than to sound web-savvy to utter marks. Pretty much like what forcing AI into everything is today.",
                  "score": 0,
                  "created_utc": 1738299877.0,
                  "replies": [
                    {
                      "id": "ma8iuu3",
                      "author": "coolthesejets",
                      "body": "That's fair, \"quite right\" was not the right choice, I don't think that undermines my central point though, and I think it odd you didn't even address my central point while addressing phrasing.",
                      "score": 1,
                      "created_utc": 1738347606.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ma2lx4m",
              "author": "grafknives",
              "body": "It will be closer to metaverse than actual assistant.\n\n\nWith metaverse ending (for most implementations)",
              "score": 1,
              "created_utc": 1738268614.0,
              "replies": []
            },
            {
              "id": "ma5c2qi",
              "author": "irun4beer",
              "body": "It already is helpful in many industries. It’s just a tool, and its usefulness depends on how it’s used. It is definitely not a fad; it’s here to stay.",
              "score": 1,
              "created_utc": 1738300357.0,
              "replies": []
            },
            {
              "id": "ma6id22",
              "author": "GokouD",
              "body": "I've seen 'AI wine' in the supermarket already. Blended by an AI or some nonsense.",
              "score": 1,
              "created_utc": 1738324191.0,
              "replies": []
            },
            {
              "id": "maa8hhn",
              "author": "chuck725",
              "body": "Ai toilet paper will be right next to the gluten free toilet paper",
              "score": 1,
              "created_utc": 1738365370.0,
              "replies": []
            },
            {
              "id": "mbh8vbb",
              "author": "Maixell",
              "body": "I don’t know about the specific things they called AI and was not AI, but there are things that are AI but people don’t know they are because they don’t have the technical knowledge.\n\nFor instance, when you take a photo of people and your phone count the number of people on the image, that can be AI, same with when the phone find words on a photo. AI isn’t necessarily always as glamorous as something like ChatGPT",
              "score": 1,
              "created_utc": 1738936901.0,
              "replies": []
            },
            {
              "id": "ma3epvq",
              "author": "S7ageNinja",
              "body": "It's pretty safe to say it's not disappearing. I'm sure it will be almost unrecognizable compared to what we have now in even a few years though.",
              "score": -1,
              "created_utc": 1738276669.0,
              "replies": []
            },
            {
              "id": "ma3m22e",
              "author": "Mirrormn",
              "body": "We all better hope it's a bubble that pops soon, because the alternative - AI that reaches the ability to do intelligent things with agency - is much scarier.",
              "score": -1,
              "created_utc": 1738278866.0,
              "replies": []
            },
            {
              "id": "ma490l0",
              "author": "AtomicSymphonic_2nd",
              "body": "It will only burst if the next two models from OpenAI only achieve marginal gains in efficiency and are unable to prevent hallucinations in newer GPT models.\n\nAdditionally, it may burst if they’re unable to get multiple instances/agents of a given cutting-edge model to interact properly with other agents and produce a large programming project with little to no bugs that would normally take dozens of engineers to produce and test over several months of time.\n\nThat’s the goal… if it still can’t do that, generative AI as we know it now will never replace humans.\n\nOf course, it will mean the economy might take a dent for a year or so, given how much equity has been invested into AI firms over the past couple years.",
              "score": -1,
              "created_utc": 1738286206.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma5ek5t",
          "author": "Balbuto",
          "body": "AI can go F itself, just look at how it can manipulate people’s opinions and make them vote against their own interest and common sense",
          "score": 5,
          "created_utc": 1738301467.0,
          "replies": []
        },
        {
          "id": "ma3avga",
          "author": "None",
          "body": "[removed]",
          "score": 13,
          "created_utc": 1738275549.0,
          "replies": [
            {
              "id": "ma4aj2l",
              "author": "AtomicSymphonic_2nd",
              "body": "The problem they’re trying to solve is C-Suites want to essentially be small teams of individual proprietorships and they can completely delete the need of *any* human labor beneath them.\n\nFor most of these folks, the idea of being able to build a massive service or business by just typing a prompt into a bespoke AI is a dream come true.\n\nThey are also expecting for there to be some greater push for Universal Basic Income “once AGI is achieved”… with additional expectation that their capital gains could never be taxed to fund such a program.\n\nIt’s a lot of short-sightedness. These executives sincerely believe they’ll be able to make the same amount of money or more and live like kings and queens for life, and for everyone else they laid off to essentially just “disappear”.",
              "score": 6,
              "created_utc": 1738286702.0,
              "replies": []
            },
            {
              "id": "ma3c1nw",
              "author": "The_Pandalorian",
              "body": "It's also a massive grift, so there's that, too.",
              "score": 9,
              "created_utc": 1738275888.0,
              "replies": []
            },
            {
              "id": "ma3r1p4",
              "author": "Vabla",
              "body": "Nah, it has plenty of uses. Just not the ones that are being shoved to the public.",
              "score": 6,
              "created_utc": 1738280410.0,
              "replies": [
                {
                  "id": "ma3z9yn",
                  "author": "modix",
                  "body": "You mean the barely concealed \"please train our AI software for us\" please uses?",
                  "score": -1,
                  "created_utc": 1738283039.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ma4bon7",
              "author": "ok-commuter",
              "body": "Do you mean at a consumer level? Because at work we're already using it to automate away thousands of hours of tedious labour.",
              "score": 2,
              "created_utc": 1738287086.0,
              "replies": []
            },
            {
              "id": "ma48d31",
              "author": "agitatedprisoner",
              "body": "Call center jobs are already on the way out.",
              "score": 1,
              "created_utc": 1738285991.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma2ix6y",
          "author": "Abigail716",
          "body": "If DeepSeek is anything like initial tests and evidence is suggesting the boom is just starting.",
          "score": 15,
          "created_utc": 1738267779.0,
          "replies": [
            {
              "id": "ma2u690",
              "author": "The_Pandalorian",
              "body": "AI is perfect in that it's always *almost ready* to actually be useful and a boom.\n\nWake me up when it actually achieves something other than overblown headlines and overinvestment by companies who have no idea what the fuck they're even investing in.",
              "score": 26,
              "created_utc": 1738270889.0,
              "replies": [
                {
                  "id": "ma4nut8",
                  "author": "IAMATruckerAMA",
                  "body": "They're using AI to map proteins with endless medical applications",
                  "score": 4,
                  "created_utc": 1738291170.0,
                  "replies": [
                    {
                      "id": "ma4oakx",
                      "author": "The_Pandalorian",
                      "body": "Right, there are certainly some very promising niche applications for AI -- like medicine. I'm mainly talking about with your average consumer.\n\nNobody is doing AI medicine with a Samsung Galaxy, which is what is cited in OP.",
                      "score": 1,
                      "created_utc": 1738291320.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ma37qb9",
                  "author": "Smoke_Santa",
                  "body": "Lmao machines are literally talking and having conversations with full context, where are you living? \n\nAchieve what?",
                  "score": -7,
                  "created_utc": 1738274647.0,
                  "replies": [
                    {
                      "id": "ma3d9j7",
                      "author": "The_Pandalorian",
                      "body": "I mean, so? Those conversations often devolve into insane hallucinations. I've had Bard and ChatGPT lie and make shit up.\n\nHow useful is that when you can't trust the conversation?",
                      "score": 21,
                      "created_utc": 1738276241.0,
                      "replies": [
                        {
                          "id": "ma4k6ja",
                          "author": "k0c-",
                          "body": "have you talked to people in public recently? like really talked to them and had a conversation with them? a lot of people lie and make shit up even very basic things or they embellish.",
                          "score": -5,
                          "created_utc": 1738289931.0,
                          "replies": [
                            {
                              "id": "ma4l9a8",
                              "author": "The_Pandalorian",
                              "body": "So you're saying that AI is as reliable as some lying dipshit on the street?\n\nAWESOME VALUE",
                              "score": 14,
                              "created_utc": 1738290290.0,
                              "replies": [
                                {
                                  "id": "ma4nah9",
                                  "author": "Schlongstorm",
                                  "body": "I mean, of course CEOs would see the value in a lying dipshit.",
                                  "score": 2,
                                  "created_utc": 1738290978.0,
                                  "replies": [
                                    {
                                      "id": "ma4ohei",
                                      "author": "The_Pandalorian",
                                      "body": "Game recognizes game, lol",
                                      "score": 2,
                                      "created_utc": 1738291385.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ma3aszf",
                      "author": "black_fire",
                      "body": "solving a problem that costs the trillion dollars being poured into the technology",
                      "score": 7,
                      "created_utc": 1738275529.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ma2pots",
              "author": "ABetterKamahl1234",
              "body": "Yeah, if anything just calling shit AI is going to go away.\n\nOr it'll stay as *actual* AI stuff ramps up to step in.",
              "score": 1,
              "created_utc": 1738269659.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma2nowa",
          "author": "Juswantedtono",
          "body": "I don’t think it’ll burst, just mature. Kind of like how we called Blackberries smartphones even before they had apps or 3G.",
          "score": 8,
          "created_utc": 1738269106.0,
          "replies": [
            {
              "id": "ma2to4i",
              "author": "The_Pandalorian",
              "body": "I think companies are spending a fuckload on AI features people don't want and that companies will find is far inferior to having actual humans.",
              "score": 11,
              "created_utc": 1738270748.0,
              "replies": [
                {
                  "id": "ma3diq6",
                  "author": "zero_z77",
                  "body": "Pretty much agree. There have been some impressive improvements with AI, but the way we're trying to use it is impractical.\n\nIt's going to end up like 3D printing. When it first got big, everyone thought it was going to be the future of manufacturing, and everything else was obsolete. And that's not what happened because 95% of what you can make with a 3D printer can be made faster, cheaper, at higher quality, more reliably, and in larger quantities with conventional injection moulding. The 5% of shit you actually need a 3D printer to make are the things that would be impossible or very difficult to manufacture using traditional methods. But, it is also very good for rapid prototyping and hobbyists because it's easier, cheaper, and more efficient than manufacturing an injection mould that's only going to get used once or twice.\n\nSame thing with LLMs, they aren't going to make writing or programming obsolete like everyone thinks they will. Instead, it will primarily be used as a method for rapid prototyping. LLMs can be very useful for writing rough drafts or basic code structures that would be tedious to create by hand. But it's never going to get to the point where it can compotently produce a final product of acceptable quality without human intervention.",
                  "score": 6,
                  "created_utc": 1738276316.0,
                  "replies": [
                    {
                      "id": "ma3jlz8",
                      "author": "The_Pandalorian",
                      "body": "I feel like 3D printing is actually far more useful with more potential for your average person than AI. I liken AI more to VR in that it is endlessly hyped, but in the end, people aren't going to want it.\n\nLike, I know a good number of people who use 3D printing. I don't know a single person who wants to use AI in any capacity. Or anyone with a VR headset.",
                      "score": 9,
                      "created_utc": 1738278118.0,
                      "replies": [
                        {
                          "id": "macl4pe",
                          "author": "Death_by_carfire",
                          "body": "Look I am majorly AI skeptical, but way more people are interacting with AI on a daily basis than 3D printing. It *can* be helpful. It's just also got causes for concerns.",
                          "score": 1,
                          "created_utc": 1738400364.0,
                          "replies": [
                            {
                              "id": "maeym69",
                              "author": "The_Pandalorian",
                              "body": "Do you have a source for that claim?\n\nAnd interacting how, precisely?\n\nAnd \"causes for concern\" is hilariously underselling it. Tech wants to wipe out entire classes of jobs and industries with AI to get richer.",
                              "score": 1,
                              "created_utc": 1738434395.0,
                              "replies": [
                                {
                                  "id": "mafzcep",
                                  "author": "Death_by_carfire",
                                  "body": "I mean you presented your claims without a source but want me to provide a source for mine?\n\n  \n[https://www.axios.com/2024/08/29/openai-chatgpt-200-million-weekly-active-users](https://www.axios.com/2024/08/29/openai-chatgpt-200-million-weekly-active-users)\n\nOne provider alone, OpenAI/ChatGPT has over 200 million weekly \\*\\*active\\*\\* users as of last August, which was double the number from November '23. That's just ChatGPT. It's also embedded into a litany of other enterprise software (SalesForce, WorkDay, etc). Any new Samsung, Pixel, iPhone has AI baked in it now. Cars with semi-autonomous driving have AI/ML features baked in. Spotify uses it to make recommendations or the Spotify Wrapped at the end of year. How many articles in media publications are written with AI do you think? Not that I think that is a positive, mind you, but it is happening. \n\nBasically if you interact with a computer for your work or personal life, there's a high chance you're interacting with AI in some capacity.\n\n  \n3D printing is mainly used at the consumer level to make little figurines that take up room on your desk. The enterprise applications for using 3D printing for model-making in manufacturing, medicine, or engineering are useful but outside of prototype modeling, it's still fairly niche.",
                                  "score": 1,
                                  "created_utc": 1738445598.0,
                                  "replies": [
                                    {
                                      "id": "mahdsrv",
                                      "author": "The_Pandalorian",
                                      "body": "> Any new Samsung, Pixel, iPhone has AI baked in it now.\n\nLumping them in as \"users\" is some bad-faith shit. Your average person doesn't give a fuck about AI on phones.\n\nFor example: https://www.cnet.com/tech/mobile/73-of-iphone-owners-say-no-thanks-to-apple-intelligence-new-data-echoes-cnets-findings/",
                                      "score": 1,
                                      "created_utc": 1738462005.0,
                                      "replies": [
                                        {
                                          "id": "mal526c",
                                          "author": "Death_by_carfire",
                                          "body": "Yeah but they do interact with it which was my claim...I agree the features are bullshit and hardly useful. \n\nLet's have a look at that source for 3D printing being used prevalently by everyday folks?",
                                          "score": 1,
                                          "created_utc": 1738518028.0,
                                          "replies": [
                                            {
                                              "id": "malqoe7",
                                              "author": "The_Pandalorian",
                                              "body": "\"Interact\" because it's being forced on them. Also a vague and useless term that ignores whether people want it or not.\n\nMeanwhile, 3d printing is growing organically, because people actually want it and use it.\n\nComparing the two directly is idiotic because one is software and the other is hardware. Even still, the actual interest in 3d printing is growing organically.\n\n\nSustained growth among both commercial and individuals.\n\nhttps://www.forbes.com/sites/carolynschwaar/2024/05/29/3d-printing-the-bright-spot-in-us-based-manufacturing/\n\n\"Explosive growth\" of entry-level printers.\n\nhttps://3dprintingindustry.com/news/new-market-data-shows-explosive-growth-in-entry-level-3d-printers-and-forecasts-industrial-recovery-date-233636/\n\nPeople clearly want 3d printers. People clearly don't want AI.\n\nhttps://www.marketingtechnews.net/news/85-of-consumers-not-interested-in-using-ai/ \n\nI think we've probably reached the end of this conversation. I've provided substantial proof now.",
                                              "score": 1,
                                              "created_utc": 1738523843.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ma3utnz",
                      "author": "WorkSucks135",
                      "body": "> But it's never going to get to the point where it can compotently produce a final product of acceptable quality without human intervention.\n\nFamous last words.",
                      "score": 4,
                      "created_utc": 1738281596.0,
                      "replies": [
                        {
                          "id": "ma4b7c5",
                          "author": "AtomicSymphonic_2nd",
                          "body": "That’s the gamble Silicon Valley and techbros are making: that generative AI could completely replace human labor and everyone could run a major business by themselves.\n\nSo far, not even o3 simulated reasoning can get to that level. I’ve tried it myself and it fucking hallucinates.",
                          "score": 5,
                          "created_utc": 1738286927.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ma257kc",
          "author": "Tommy__want__wingy",
          "body": "Isn’t that technically SkyNet?",
          "score": 4,
          "created_utc": 1738263996.0,
          "replies": []
        },
        {
          "id": "ma3jdin",
          "author": "ga-co",
          "body": "It’s the next 3D TV with active glasses. Remember when that was going to be huge?",
          "score": 2,
          "created_utc": 1738278046.0,
          "replies": []
        },
        {
          "id": "ma3jhdz",
          "author": "crashbandyh",
          "body": "The whole fad is just a way for companies to train ai learning. Forcing it on us is the fastest way to advance it. Then when they get the results they needed ai will strictly be an enterprise program.",
          "score": 2,
          "created_utc": 1738278079.0,
          "replies": []
        },
        {
          "id": "ma7quv0",
          "author": "blackscales18",
          "body": "You can buy a Google free phone that runs debian right now :D It's a chonky monster but we love a removable battery and a headphone jack\n\nhttps://furilabs.com/",
          "score": 2,
          "created_utc": 1738339803.0,
          "replies": []
        },
        {
          "id": "ma4c6jl",
          "author": "AbbreviationsRight42",
          "body": "That's never gonna happen",
          "score": 1,
          "created_utc": 1738287251.0,
          "replies": [
            {
              "id": "ma4lb40",
              "author": "The_Pandalorian",
              "body": "mmhmm.",
              "score": 1,
              "created_utc": 1738290306.0,
              "replies": []
            }
          ]
        },
        {
          "id": "macudho",
          "author": "magichoward",
          "body": "I just posted a 45 second video as samsung / Google have just announced their pricing after the first free 6 months .the comments will make an interesting read.\n\nhttps://www.youtube.com/watch?v=XhB7oqMDiIw",
          "score": 1,
          "created_utc": 1738405922.0,
          "replies": []
        },
        {
          "id": "magrhx3",
          "author": "asicarii",
          "body": "I feel like it’s not a bubble but just over use of the term.  Everything now uses AI supposedly.   It’s a buzz word like “synergy” and “pivot”.   You didn’t “pivot”- your business model was garbage so you tried something else.   I had someone arguing with me that a convenient store pivoted to a liquor store.  That’s not a pivot that’s just changing your business.",
          "score": 1,
          "created_utc": 1738454635.0,
          "replies": [
            {
              "id": "mah073d",
              "author": "The_Pandalorian",
              "body": "Nah, it's a bubble. Companies who have spent billions on it are already questioning its value.\n\nYou're going to see a lot of places pull out.",
              "score": 1,
              "created_utc": 1738457424.0,
              "replies": [
                {
                  "id": "mah23p3",
                  "author": "asicarii",
                  "body": "I don’t disagree on the investment part.  The Zuck didn’t mention Meta this year at the shareholder meeting I believe.  Last year it was the future.",
                  "score": 1,
                  "created_utc": 1738458046.0,
                  "replies": [
                    {
                      "id": "mah2p4h",
                      "author": "The_Pandalorian",
                      "body": "Zuck also thought the Metaverse was the future and sank, what, $200 billion into it? Dude isn't making smart investments or accurately predicting much of anything, lol.\n\nBut yeah, definitely telling that they're not touting AI this year.",
                      "score": 1,
                      "created_utc": 1738458245.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "map9mc7",
          "author": "banZiii",
          "body": "Yeah, this reminds me of the 3D craze that was going on a decade ago. \n\nNobody really liked it, but they kept on pushing 3D for years.",
          "score": 1,
          "created_utc": 1738567314.0,
          "replies": []
        },
        {
          "id": "ma2j9jx",
          "author": "Naud1993",
          "body": "Bing's AI image creator went from sometimes being slow even with boosts to being fast even without boosts, so I guess the amount of people using it went way down. Although maybe people moved over to newer AI models.",
          "score": 1,
          "created_utc": 1738267874.0,
          "replies": [
            {
              "id": "ma2tydd",
              "author": "The_Pandalorian",
              "body": "I think there's a limited shelf life in AI image creators, too. Probably the vast majority at first were novelty images people made for laughs.\n\nNow, anytime an AI image comes up, people call it out because it looks like dogshit.\n\nStruggling to see much value for them other than memes, quite frankly. Particularly with the new copyright ruling today.",
              "score": 10,
              "created_utc": 1738270828.0,
              "replies": [
                {
                  "id": "ma2ux60",
                  "author": "Naud1993",
                  "body": "What copyright ruling?",
                  "score": 2,
                  "created_utc": 1738271098.0,
                  "replies": [
                    {
                      "id": "ma3v2sg",
                      "author": "amatterofcuriosity",
                      "body": "https://www.theverge.com/news/602096/copyright-office-says-ai-prompting-doesnt-deserve-copyright-protection",
                      "score": 2,
                      "created_utc": 1738281678.0,
                      "replies": [
                        {
                          "id": "ma6bh0h",
                          "author": "Naud1993",
                          "body": "I thought that was already the law months or years ago. I guess they made it official now.",
                          "score": 1,
                          "created_utc": 1738320431.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mag98uw",
                  "author": "QuinQuix",
                  "body": "This is nonsense.\n\nGenerative AI can absolutely create striking images.\n\nThe run of the mill AI images are shitty prompting efforts. Yes they are recognizable. But they are not a limit of the technology. \n\nObviously in the hands of a designer who can combine separate generated and possibly human created elements and who can work towards a vision throughout the process it's even more potent technology.\n\nBut even if you had a rule that only an original output can count, AI is absolutely capable of doing amazing stuff. \n\nYou're sticking your head in the sand denying this. Denial will not help here.",
                  "score": 0,
                  "created_utc": 1738448705.0,
                  "replies": [
                    {
                      "id": "magdtr6",
                      "author": "The_Pandalorian",
                      "body": "Generative AI creates uncanny valley dogshit.\n\nAnd the \"yOu'Re AlL iN dEnIaL\" AI shrieking is hilarious and predictable. The only one here in denial are the AI bros with shit taste in art and zero creativity or understanding of the creative process.",
                      "score": 1,
                      "created_utc": 1738450169.0,
                      "replies": [
                        {
                          "id": "maj3jy4",
                          "author": "QuinQuix",
                          "body": "Whatever floats your boat.",
                          "score": 1,
                          "created_utc": 1738489371.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "maj3xvu",
              "author": "QuinQuix",
              "body": "Isn't the more obvious explanation they reduced hardware requirements by a lot while also investing in vast amounts of new compute?\n\nThe amount of hardware Microsoft added recently is absolutely staggering.",
              "score": 1,
              "created_utc": 1738489604.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma3qu0x",
          "author": "CodineDreams",
          "body": "Tbh the best of Ai will probably come after the Bubble bursts. \n\nLook at the Dot.com bubble, it lead us to having some pretty nice things.",
          "score": 1,
          "created_utc": 1738280343.0,
          "replies": [
            {
              "id": "ma4lhp5",
              "author": "The_Pandalorian",
              "body": "> Look at the Dot.com bubble, it lead us to having some pretty nice things.\n\nUh... I would say that they *were* some pretty nice things, but it's almost all getting enshittified.",
              "score": 0,
              "created_utc": 1738290368.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma2wrwg",
          "author": "AlexHimself",
          "body": "No chance it's going to burst. It's just going to get refined. AI is here to stay, and it'll improve.\n\nWe're in the \".com\" era where everything is hyped up. AI isn't the same bubble though.",
          "score": -5,
          "created_utc": 1738271611.0,
          "replies": [
            {
              "id": "ma33wef",
              "author": "The_Pandalorian",
              "body": "> We're in the \".com\" era where everything is hyped up.\n\nUh...\n\n> AI isn't the same bubble though.\n\nMmmhmm.",
              "score": 4,
              "created_utc": 1738273583.0,
              "replies": [
                {
                  "id": "ma3yds1",
                  "author": "AlexHimself",
                  "body": "`.com` was when the internet was just coming about. Far more unknowns.\n\n`AI` is like a subset of the `.com` bubble. Similar, but nowhere near the size/scope of it.",
                  "score": 1,
                  "created_utc": 1738282752.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ma1txz2",
      "author": "shhhpark",
      "body": "what benefit does the AI in phones even provide....even all this dumb copilot stuff with laptops.  It's just a search engine with a dedicated button",
      "score": 566,
      "created_utc": 1738260915.0,
      "replies": [
        {
          "id": "ma1ug4t",
          "author": "durielvs",
          "body": "They can spy on you and use you to train the AI of the future, which will surely be used by the military or big companies.",
          "score": 328,
          "created_utc": 1738261055.0,
          "replies": [
            {
              "id": "ma21a3m",
              "author": "saysthingsbackwards",
              "body": "Data collection. That's all it is.",
              "score": 134,
              "created_utc": 1738262919.0,
              "replies": [
                {
                  "id": "ma2on05",
                  "author": "ThinkExtension2328",
                  "body": "Now you get the privilege to pay Google to spy on your private data",
                  "score": 32,
                  "created_utc": 1738269369.0,
                  "replies": []
                },
                {
                  "id": "ma5qhwt",
                  "author": "newagereject",
                  "body": "Pretty sure they don't need AI for that, most are typing this one a phone, while on reddit, your phone tracks you, your keyboard tracks you, reddit tracks you, hell if you have Facebook, good or Twitter installed they trskc you out of the app",
                  "score": 6,
                  "created_utc": 1738307606.0,
                  "replies": [
                    {
                      "id": "ma5s60p",
                      "author": "saysthingsbackwards",
                      "body": "Yeah but a human couldn't take all that in with all the meta data as well",
                      "score": 1,
                      "created_utc": 1738308570.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ma1uwqz",
          "author": "0x831",
          "body": "Well, according to Samsungs commercial, if you’re too fucking stupid to read a text and figure out a restaurant to meet someone at that you think they’ll like you can just ask AI.\n\nNow whenever someone picks a restaurant you’ll never know if they picked it or the Ad-infused AI picked it for your non-thinking friend.",
          "score": 166,
          "created_utc": 1738261182.0,
          "replies": [
            {
              "id": "ma1zfzp",
              "author": "GamePois0n",
              "body": "let's be real... people in general are getting dumber due to technology.\n\n\nyou never watched wall-e?",
              "score": 61,
              "created_utc": 1738262420.0,
              "replies": [
                {
                  "id": "ma22bbn",
                  "author": "AdeptFelix",
                  "body": "No, I'll have AI summarize Wall-e for me so I can get the gist.",
                  "score": 101,
                  "created_utc": 1738263202.0,
                  "replies": [
                    {
                      "id": "ma283so",
                      "author": "weasuL",
                      "body": "From chatgpt - In Wall-E, humanity has retreated to a spaceship, leaving Earth a barren, trash-covered wasteland due to years of overconsumption and environmental neglect. Humans have become completely reliant on technology, living in a state of obesity and inactivity, unable to care for themselves or the planet. Wall-E and Eve's discovery of a plant sparks hope that humanity can return to Earth and rebuild a sustainable future.",
                      "score": 13,
                      "created_utc": 1738264797.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ma2372j",
                  "author": "PM_Me-Your_Freckles",
                  "body": "Literally read a TIFU post earlier where a 25 year old in an office was using ChatGPT to add grammar to her emails. It's not that fucking hard, but instead of learning a few simple rules, they go brain off and let the machine do it for them.",
                  "score": 14,
                  "created_utc": 1738263443.0,
                  "replies": [
                    {
                      "id": "ma25km3",
                      "author": "adrian783",
                      "body": "it's ok cuz tifu are all fake stories.",
                      "score": 24,
                      "created_utc": 1738264097.0,
                      "replies": [
                        {
                          "id": "ma2hs5v",
                          "author": "thisischemistry",
                          "body": "I need to tell you something about most of reddit…",
                          "score": 5,
                          "created_utc": 1738267459.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ma57v0m",
                      "author": "Raider_Scum",
                      "body": "I do this at work, and it can be surprisingly helpful if used correctly.\n\nI open chat GPT, and copy an entire email I received from someone.  \nThen I prompt chat GPT \"Tell this person no, we aren't going to do that. Make the response professional\".\n\nThen it shits out a long, exhausting reply that makes the sender fuck off and never email me again. And the whole process takes 45 seconds of my time.",
                      "score": 1,
                      "created_utc": 1738298585.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ma2ae0x",
                  "author": "Lemmonjello",
                  "body": "Im already that fat in preparation for the hover chair, in retrospect I should have gotten fat after the chair.",
                  "score": 3,
                  "created_utc": 1738265422.0,
                  "replies": []
                },
                {
                  "id": "ma2kwm1",
                  "author": "JoshuatTheFool",
                  "body": "It's a movie though... \n\n\nAre you saying Star Wars is gonna happen?",
                  "score": 1,
                  "created_utc": 1738268332.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ma2bcqm",
              "author": "WhySpongebobWhy",
              "body": "The funny part is... there's no way in hell that feature will even remotely work like the commercial.  It relies on the restaurant's google page to actually have all that information listed and absolutely nobody updates those pages in a timely manner.\n\n\"get me a pet friendly Italian restaurant with outdoor seating\" is, at best, going to get you an Olive Garden over an hour away.",
              "score": 21,
              "created_utc": 1738265692.0,
              "replies": [
                {
                  "id": "ma2i3db",
                  "author": "thisischemistry",
                  "body": "No, the request is an *Italian* restaurant!",
                  "score": 7,
                  "created_utc": 1738267547.0,
                  "replies": [
                    {
                      "id": "ma2o6sb",
                      "author": "Ricotta_pie_sky",
                      "body": "\"find me a wipe-down corporate microwavery\"",
                      "score": 11,
                      "created_utc": 1738269245.0,
                      "replies": [
                        {
                          "id": "ma2ob7d",
                          "author": "thisischemistry",
                          "body": "Accurate.",
                          "score": 5,
                          "created_utc": 1738269279.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ma33afq",
          "author": "IlliterateJedi",
          "body": ">  It's just a search engine with a dedicated button\n\nI would love to know how much people actually used Bixby when it had a dedicated  button on the previous Galaxy phones.  I hated it with a passion.",
          "score": 12,
          "created_utc": 1738273413.0,
          "replies": [
            {
              "id": "ma3q0sf",
              "author": "stockinheritance",
              "body": "butter ancient brave towering jeans narrow heavy mysterious coordinated crush\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 7,
              "created_utc": 1738280089.0,
              "replies": []
            },
            {
              "id": "ma4nn66",
              "author": "yukoncowbear47",
              "body": "I remapped my Bixby button",
              "score": 4,
              "created_utc": 1738291097.0,
              "replies": []
            },
            {
              "id": "ma58bap",
              "author": "kc5ods",
              "body": "https://stonetoss.com/wp-content/uploads/2019/04/siri-alexa-cortana-bixby-comic1.png",
              "score": -1,
              "created_utc": 1738298770.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma1ur4p",
          "author": "kh2riku",
          "body": "On my Windows PC I have Co-Pilot disabled. It is monumental trash. Tested it one time just to see what it could do and it gave me the worst source available, with glaringly bad information. I don’t trust any of it.",
          "score": 40,
          "created_utc": 1738261138.0,
          "replies": [
            {
              "id": "ma1v3hk",
              "author": "shhhpark",
              "body": "Yea it’s so useless, I want my right* alt key back",
              "score": 21,
              "created_utc": 1738261234.0,
              "replies": [
                {
                  "id": "ma1wwtc",
                  "author": "Gotttse",
                  "body": "I got a laptop with a copilot button, turned it into right ctrl with powertoys and uninstalled copilot, but there are still apps that don't recognize it and tell me the copilot button has nothing set while sending me to windows settings to set it to an app instead of a button :/",
                  "score": 7,
                  "created_utc": 1738261725.0,
                  "replies": [
                    {
                      "id": "ma21kwi",
                      "author": "saysthingsbackwards",
                      "body": "so... an instant task manager button?",
                      "score": 5,
                      "created_utc": 1738263001.0,
                      "replies": [
                        {
                          "id": "ma24lck",
                          "author": "Gotttse",
                          "body": "[I sadly just get an empty menu.](https://imgur.com/a/tOa8egP)",
                          "score": 2,
                          "created_utc": 1738263824.0,
                          "replies": [
                            {
                              "id": "ma24sck",
                              "author": "saysthingsbackwards",
                              "body": "Hmmmm. There is a program called Glovepie out there that translates almost any input to almost any output. It does require making a tiny script and running it but I'm not sure if it runs better than a powershell script",
                              "score": 1,
                              "created_utc": 1738263878.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ma2xtrx",
                      "author": "valdus",
                      "body": "Autohotkey will do a better job of that key replacement.",
                      "score": 1,
                      "created_utc": 1738271902.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ma2xcfa",
                  "author": "valdus",
                  "body": "Autohotkey can help you with that. I did it for the Office key on one of my laptops. Just identify the key code, write a simple two-line script to replace keydown/keyup events from that key with RAlt.\n\nSuch an extremely useful, lightweight, underutilized piece of software. I used to use it to automate forms in some software where all I was doing was copying and pasting various information, or entering the same thing all the time. It can be used for something as simple as spelling corrections or personal macros, right up to full UIs..",
                  "score": 2,
                  "created_utc": 1738271769.0,
                  "replies": []
                },
                {
                  "id": "ma42xv1",
                  "author": "celticchrys",
                  "body": "You can use Powertoys to reprogram the button.",
                  "score": 1,
                  "created_utc": 1738284224.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ma25xdy",
              "author": "Exasperated_Sigh",
              "body": "I finally was like \"fine, this is what tech is now. I'll embrace it and learn to use it.\" And it's all trash. None of it provides any more productively than pre-enshitified Google did. And everything is worse than Google was 10 years ago in terms of accuracy and just doing what I tell it. Because *everything* now is either an ad or a scam to scrape data for ads. I don't own any of my software, I can't run most shit without an active internet connection, every update on every device and service seems to break functionality. The future of tech is trash and getting worse.",
              "score": 10,
              "created_utc": 1738264196.0,
              "replies": []
            },
            {
              "id": "ma22o7a",
              "author": "Illustrious-Top-9222",
              "body": "That's why I'm gonna use my 2021 Acer Aspire 7 until it fucking dies. I didn't upgrade to windows 11, and I'm not getting a new laptop with this AI shit either",
              "score": 5,
              "created_utc": 1738263300.0,
              "replies": [
                {
                  "id": "ma2apfy",
                  "author": "Lemmonjello",
                  "body": "God I fucking hate windows 11",
                  "score": 4,
                  "created_utc": 1738265510.0,
                  "replies": [
                    {
                      "id": "ma3ogj3",
                      "author": "Cyberdyne_T-888",
                      "body": "You can make windows 11 better but it's still windows 11.\n\nCheck out these two links\n\nhttps://github.com/Raphire/Win11Debloat \n\nhttps://github.com/valinet/ExplorerPatcher/releases\n\n\nIt's made it tolerable so far.",
                      "score": 2,
                      "created_utc": 1738279604.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ma1w6ct",
          "author": "ASK_ABT_MY_USERNAME",
          "body": "The one thing I've grown to actually love is the ability to highlight and Google text that I otherwise couldn't. Could be on a site/app where you can't to it or text on an image. \n\n\nOtherwise it's lackluster.",
          "score": 10,
          "created_utc": 1738261526.0,
          "replies": [
            {
              "id": "ma1wu5c",
              "author": "NarrowBoxtop",
              "body": "Wouldn't Google lens do this just the same?",
              "score": 5,
              "created_utc": 1738261705.0,
              "replies": [
                {
                  "id": "ma1xfqy",
                  "author": "ASK_ABT_MY_USERNAME",
                  "body": "It's the Circle to Search feature which basically better integrates Google lens",
                  "score": 8,
                  "created_utc": 1738261869.0,
                  "replies": [
                    {
                      "id": "ma222dr",
                      "author": "Askymojo",
                      "body": "I don't love the idea that a misplaced gesture is all it takes to send my screen to google",
                      "score": 0,
                      "created_utc": 1738263134.0,
                      "replies": [
                        {
                          "id": "ma29lfv",
                          "author": "TheRealGOOEY",
                          "body": "How often do you randomly make circular motions with your thumb or finger? Misplaced gesture? Reaching much? lol",
                          "score": 4,
                          "created_utc": 1738265205.0,
                          "replies": []
                        },
                        {
                          "id": "ma3v1oj",
                          "author": "kairos",
                          "body": "It's not just drawing a circle, though.\n\nAt least on my phone, I have to tap the \"menu\" for a while in order to enable circle to search and it's pretty clear that it's enabled, so not something easily done by accident.",
                          "score": 1,
                          "created_utc": 1738281668.0,
                          "replies": []
                        },
                        {
                          "id": "ma29mde",
                          "author": "TheRealGOOEY",
                          "body": "How often do you randomly make circular motions with your thumb or finger? Misplaced gesture? Reaching much? lol",
                          "score": -2,
                          "created_utc": 1738265212.0,
                          "replies": [
                            {
                              "id": "ma2pyts",
                              "author": "Askymojo",
                              "body": "Literally done it.  Once was enough for me to turn it off.  Honestly it's so weird how defensive nerds get about differing opinions about tech they like.  Downvoting me for having a different Android experience than you is just cringe.",
                              "score": 5,
                              "created_utc": 1738269736.0,
                              "replies": [
                                {
                                  "id": "maakvah",
                                  "author": "TheRealGOOEY",
                                  "body": "The cringe part is the massive amount of assumptions you’re making. 😂😂😂 I can be incredulous about your statements without being defensive or downvoting you. But I guess Reddit culture has taught you that you can never be wrong if you say it on the internet.",
                                  "score": 1,
                                  "created_utc": 1738369382.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ma1ucm7",
          "author": "Galactic_Danger",
          "body": "I turned off Apple Intelligence. It was making my notifications a nightmare to read.",
          "score": 22,
          "created_utc": 1738261027.0,
          "replies": [
            {
              "id": "ma2i9r0",
              "author": "thisischemistry",
              "body": "I have an older phone that can't use it and I'm very thankful for that!",
              "score": 7,
              "created_utc": 1738267595.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma1xvi4",
          "author": "ChillAMinute",
          "body": "Exactly. When a reviewer says “there’s a learning curve…” what’s the point?  I just want a device that’s easy to use which doesn’t involve a high cost and more effort on my part with no real payback.",
          "score": 8,
          "created_utc": 1738261988.0,
          "replies": [
            {
              "id": "ma5vsoh",
              "author": "Space_Lux",
              "body": "iPhone SE",
              "score": 2,
              "created_utc": 1738310715.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma20vra",
          "author": "marxcom",
          "body": "You can make nice picture of yourself look cartoonish",
          "score": 3,
          "created_utc": 1738262811.0,
          "replies": []
        },
        {
          "id": "ma29528",
          "author": "LeCrushinator",
          "body": "Apple put a lot of \"AI\" into the OS this year, and most of it has been useless, however the notification summary has been great. I normally get a lot of notifications from certain apps, so having the summary on my screen when it's at my desk rather than having to tap and scroll through them has saved time.\n\nAI has the potential to be quite useful but right now it's in the early game and I feel like it's mostly gimmicky so far. I'd say in 5-10 years we'll be using it more and in more useful ways.\n\nAI is annoying to people now because every company is trying to slap it on as a gimmick. When AI will be at its best is when it's like Jarvis was in Iron Man, when you can just talk to it like you would a person, and it will be able to quickly assist and understand context perfectly. Imagine your daily life if you had a real human being personal assistant to help with everything, that's the ideal for an AI assistant on your phone. That being said, many people wouldn't have much use for an assistant even if they had one, so it won't be some kind of game changer for everyone.",
          "score": 4,
          "created_utc": 1738265081.0,
          "replies": [
            {
              "id": "ma2if3d",
              "author": "thisischemistry",
              "body": "> Apple put a lot of \"AI\" into the OS this year.\n\nYeah, that's why I'm not bothering to update to the latest OS or devices.",
              "score": 2,
              "created_utc": 1738267637.0,
              "replies": []
            },
            {
              "id": "ma58evy",
              "author": "kc5ods",
              "body": "and not one notification summary has been accurate.",
              "score": 1,
              "created_utc": 1738298811.0,
              "replies": []
            },
            {
              "id": "ma32fvp",
              "author": "twigboy",
              "body": "You don't understand, these features are for the shareholders not you",
              "score": 1,
              "created_utc": 1738273178.0,
              "replies": [
                {
                  "id": "ma37u9q",
                  "author": "LeCrushinator",
                  "body": "I'm glad they're looking out for the shareholders.",
                  "score": 1,
                  "created_utc": 1738274679.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ma234vt",
          "author": "tatw_ab",
          "body": "who said it's a benefit for you? yes they market it as such but do you believe marketing? They benefit from it the most by gathering data about you and this ain't a conspiracy ",
          "score": 2,
          "created_utc": 1738263426.0,
          "replies": []
        },
        {
          "id": "ma222oy",
          "author": "_Lucille_",
          "body": "Better photos, accessibility, language services like transcription.\n\nI know most people dont mind opening google and doing a search, but I often just do it by voice for various reasons (driving, wearing gloves in winter, wanting the result to be heard by multiple people, etc).\n\nYou can just say \"open Google map and set the destination to the airport\". While cooking I can just tell my phone to set timers without touching it at all, etc.",
          "score": 3,
          "created_utc": 1738263137.0,
          "replies": []
        },
        {
          "id": "ma4djhc",
          "author": "SpaceDandye",
          "body": "I don't mind ai trying to optimize my photos to look better, or to find products within pictures. Hey filter out spam calls, all the things Google has done with pixels. Then they said \"fam let's fuck it all up\" with Gemini that out the gate wasn't able to do what Google assistant did. \n\nIt's amazing how Google just said ehh, let's release this alpha crap to the public",
          "score": 1,
          "created_utc": 1738287702.0,
          "replies": []
        },
        {
          "id": "ma4vjky",
          "author": "neon5k",
          "body": "Umm. For phone yeah.",
          "score": 1,
          "created_utc": 1738293858.0,
          "replies": []
        },
        {
          "id": "ma5k72p",
          "author": "implicate",
          "body": "AI helping with making my photos look better is great. \n\nBeing able to just circle a thing or some text on the screen, and search for it is great.\n\n\nFuck the rest of it.",
          "score": 1,
          "created_utc": 1738304213.0,
          "replies": []
        },
        {
          "id": "ma64p5d",
          "author": "baron_muchhumpin",
          "body": ">  It's just a search engine with a dedicated button\n\nAnd a yearly subscription - gotta get that ARR(annual reoccurring revenue)!!",
          "score": 1,
          "created_utc": 1738316263.0,
          "replies": []
        },
        {
          "id": "ma22lm7",
          "author": "QuestGiver",
          "body": "Okay to answer your question there are a few actually cool features. \n\nYou can search using natural language in the settings to find what you want. \n\nSo for instance if you want to change lock screen and can't find it you can just type \"change screen or change background\" and it will find the setting for you. \n\nOther than that it's the same suite as most other things like magic eraser or context search stuff.",
          "score": -6,
          "created_utc": 1738263281.0,
          "replies": [
            {
              "id": "ma2cf0u",
              "author": "kona_boy",
              "body": "> So for instance if you want to change lock screen and can't find it you can just type \"change screen or change background\" and it will find the setting for you. \n\nWhat the fuck are you talking about? Despite these settings being literally one menu from the home screen, you already CAN search the phone settings. You don't need a fucking AI to do this for you. What the fuck am I reading 🤦🤦🤦",
              "score": 14,
              "created_utc": 1738265985.0,
              "replies": [
                {
                  "id": "ma2jd51",
                  "author": "QuestGiver",
                  "body": "Just trying to answer the question. I didn't mean to offend you. Not saying it's game changing in any way but it does help with more obscure settings. \n\nIt is helpful for older folks like my parents.\n\nAnother example would be font size. Sometimes they want to make it large but English isn't their first language and they may not search \"font\". They can search \"make letter big\" and the correct setting will show up.",
                  "score": -1,
                  "created_utc": 1738267902.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ma2tget",
              "author": "spookmann",
              "body": "Oh my god.  A SEARCH function?  THANK YOU AI!\n\n/s",
              "score": 1,
              "created_utc": 1738270691.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma3brnl",
          "author": "chainer3000",
          "body": "I regularly use AI instead of google now. Google sucks that bad, AI generally points me to the source I’m actually looking for (rather than just taking what it says at face value, like using a search engine)",
          "score": -1,
          "created_utc": 1738275809.0,
          "replies": []
        },
        {
          "id": "ma1yvcw",
          "author": "Xehanz",
          "body": "It depends. GPU wise with something akin to a DLSS, it can save a fuck ton of battery and run much cooler\n\nFor other gimmicky things, idk",
          "score": -3,
          "created_utc": 1738262263.0,
          "replies": []
        },
        {
          "id": "ma2d473",
          "author": "Lucky13Unlucky7",
          "body": "I have made lots of money using the AI on my phone. I am not going to share exactly how though. It can be wildly beneficial and I will never go back.",
          "score": -10,
          "created_utc": 1738266176.0,
          "replies": [
            {
              "id": "ma3eyqc",
              "author": "frozenuniverse",
              "body": "'it's amazing'. Source: trust me bro",
              "score": 2,
              "created_utc": 1738276742.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ma1zvce",
      "author": "darealsanta7",
      "body": "yeah I'll keep my S21 Ultra",
      "score": 43,
      "created_utc": 1738262536.0,
      "replies": [
        {
          "id": "ma3kbpc",
          "author": "rowdymatt64",
          "body": "I have a 20U as my last phone and my current phone is an iPhone 15 Pro. Every day is another day I get closer to trying to just go back to the S20U lmao. It's on my desk at home, taunting me daily",
          "score": 3,
          "created_utc": 1738278336.0,
          "replies": [
            {
              "id": "ma8dihl",
              "author": "Trouthunter65",
              "body": "My. s23 died and was wondering if the s20 and s21 are good options to return to. What do you think? I've been using my Note 8 and kinda like it still",
              "score": 1,
              "created_utc": 1738346106.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma324lu",
          "author": "CELTICPRED",
          "body": "I have a 22 ultra.  Feels bloated and slow.   \n\n\nBeen thinking about just moving to the 24",
          "score": 3,
          "created_utc": 1738273092.0,
          "replies": [
            {
              "id": "ma3y3i0",
              "author": "Drix22",
              "body": "Hey, the s22 ultra club is a few threads higher.",
              "score": 12,
              "created_utc": 1738282659.0,
              "replies": []
            },
            {
              "id": "ma57myx",
              "author": "darren457",
              "body": "A 3yr old ultra phone feeling bloated and slow seems like a user fixable issue. I know people using note phones that are still chugging along fine.",
              "score": 8,
              "created_utc": 1738298496.0,
              "replies": []
            },
            {
              "id": "ma7h7cs",
              "author": "comcastsupport800",
              "body": "Clean up your phone",
              "score": 3,
              "created_utc": 1738337005.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma4iwtf",
          "author": "PlanetNoob",
          "body": "fwiw the s21u has a trade in value right now of $500 vs the previous gen s20u's trade in value of $150 so I suspect this'll be the last year we'll get a decent trade in with our s21u....",
          "score": 2,
          "created_utc": 1738289502.0,
          "replies": [
            {
              "id": "ma55ct7",
              "author": "psychobilly1",
              "body": "Where at? Mine was only [worth $200 ](https://i.imgur.com/Fevtjhc.jpeg) and mine was in pretty much perfect condition for a 4 year old phone. I just traded it in about 2 weeks ago and this email is from today.",
              "score": 2,
              "created_utc": 1738297566.0,
              "replies": [
                {
                  "id": "ma8mitx",
                  "author": "PlanetNoob",
                  "body": "[through the Samsung online store in the US](https://imgur.com/SXOFIXe)",
                  "score": 2,
                  "created_utc": 1738348629.0,
                  "replies": [
                    {
                      "id": "ma8u4f5",
                      "author": "psychobilly1",
                      "body": "Well, shit, I didn't even think of that. Oh well.",
                      "score": 1,
                      "created_utc": 1738350757.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ma859ma",
              "author": "darealsanta7",
              "body": "500 would be crazy lmao bought mine for like 480~\n\nbut thank you!",
              "score": 1,
              "created_utc": 1738343820.0,
              "replies": [
                {
                  "id": "ma8njxx",
                  "author": "PlanetNoob",
                  "body": "[yeah that's the offer Samsung US is giving out for that gen 4 years later](https://imgur.com/SXOFIXe)",
                  "score": 2,
                  "created_utc": 1738348914.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ma209i2",
          "author": "borg_6s",
          "body": "Me too",
          "score": 1,
          "created_utc": 1738262643.0,
          "replies": []
        },
        {
          "id": "ma8bug4",
          "author": "mcgyver229",
          "body": "writing this on my S10",
          "score": 1,
          "created_utc": 1738345643.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma23fvv",
      "author": "lunisce",
      "body": "Who tf asked for AI in their phones?? 😂",
      "score": 127,
      "created_utc": 1738263510.0,
      "replies": [
        {
          "id": "ma3iah9",
          "author": "Surtock",
          "body": "AI has been in phone for years. It's just now becoming interactive and a \"selling point\".        \nAs far as the new stuff goes, meh.",
          "score": 33,
          "created_utc": 1738277723.0,
          "replies": [
            {
              "id": "ma440st",
              "author": "PurpleNurpe",
              "body": "> AI has been in phone for years.\n\nI’ve always had doubts with Siri given how dumb she is, I just assumed some poor bastard sat behind a desk writing the response scripts 1-by-1.",
              "score": 12,
              "created_utc": 1738284570.0,
              "replies": [
                {
                  "id": "ma4yx32",
                  "author": "Surtock",
                  "body": "What I mean by AI are thing like predictive text etc.",
                  "score": 13,
                  "created_utc": 1738295083.0,
                  "replies": []
                },
                {
                  "id": "ma4vp3l",
                  "author": "neon5k",
                  "body": "Apple is always miles behind always trying to catch up. There only real innovation was M series. Software wise they are boomers.",
                  "score": 5,
                  "created_utc": 1738293912.0,
                  "replies": [
                    {
                      "id": "ma58e6n",
                      "author": "None",
                      "body": "Apple is far ahead in privacy. They are the only ones doing image recognition on your photos in a privacy respecting way. ",
                      "score": 5,
                      "created_utc": 1738298802.0,
                      "replies": [
                        {
                          "id": "ma5aw1d",
                          "author": "neon5k",
                          "body": "Anyone who cares about privacy would turn that feature off as well. Apple has long running habbit of hiding settings, changing the place of settings, turning on things automatically after update. That image recognotion shit was burried as well.",
                          "score": 5,
                          "created_utc": 1738299846.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ma6etfc",
                  "author": "ItsAllAMissdirection",
                  "body": ">’ve always had doubts with Siri given how dumb she is, I just assumed some poor bastard sat behind a desk writing the response scripts 1-by-1.\n\nIn America those smart stores hired people to track the items under the guise of AI",
                  "score": 1,
                  "created_utc": 1738322330.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ma6rlap",
          "author": "Headbanger",
          "body": "The same people who asked for:\n\n1. no headphone jack\n2. no sd card\n3. no removable battery\n4. notch",
          "score": 2,
          "created_utc": 1738328287.0,
          "replies": []
        },
        {
          "id": "ma52uji",
          "author": "got-trunks",
          "body": "I was fine with AI and NPUs when it was just clever camera and microphone tricks. The rest can absolutely go and nothing of value will have been lost. Zero utility, and where there is some, the default google voice control for hands-free or vision impaired or blind use was fine.",
          "score": 1,
          "created_utc": 1738296571.0,
          "replies": []
        },
        {
          "id": "mahj1sh",
          "author": "Paul_Langton",
          "body": "Personally I look forward to improved Gemini assistant features but that's about the only thing I really imagine using AI for in my phone.",
          "score": 0,
          "created_utc": 1738463805.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma1w5rb",
      "author": "TheMacMan",
      "body": "Samsung didn't have any new hardware to bring so they tried to turn the focus to AI, basically selling you an S24/S23 with more AI stuffed in it. Enjoy!",
      "score": 113,
      "created_utc": 1738261522.0,
      "replies": [
        {
          "id": "ma2ls3y",
          "author": "Juicyjackson",
          "body": "I have an S22 and I still feel no need for an S25. Usually new phone launches get me excited, but this doesn't do anything for me...",
          "score": 39,
          "created_utc": 1738268576.0,
          "replies": [
            {
              "id": "ma30mud",
              "author": "6StringAddict",
              "body": "Also have an S22 and I'm still perfectly fine with my phone. Don't see the need to upgrade without my phone/battery dying.",
              "score": 10,
              "created_utc": 1738272673.0,
              "replies": [
                {
                  "id": "ma3nqok",
                  "author": "hyakyakyak",
                  "body": "Yay I found the s22 club. Still loving mine!",
                  "score": 4,
                  "created_utc": 1738279384.0,
                  "replies": []
                },
                {
                  "id": "ma30ser",
                  "author": "Juicyjackson",
                  "body": "Yep, will have to see what the S26 offers, im perfectly fine waiting another generation haha.",
                  "score": 3,
                  "created_utc": 1738272716.0,
                  "replies": [
                    {
                      "id": "ma5dumn",
                      "author": "surdtmash",
                      "body": "I got the S24u after the screen on my s10+ cracking for the 3rd time. I don't think I'll be switching from this one for another 5-6 years.",
                      "score": 1,
                      "created_utc": 1738301145.0,
                      "replies": [
                        {
                          "id": "ma7k6oi",
                          "author": "WrecklessMagpie",
                          "body": "I'm in a similar boat, my s10+ screen has cracked a couple times and I've replaced it but now it's yelling at me about its battery life. I was gonna get the s24u but saw s25 is coming up. Still may just go with the previous model since it'll be a bit cheaper",
                          "score": 2,
                          "created_utc": 1738337889.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ma3ka4q",
                  "author": "revstan",
                  "body": "I broke my last S10+ and just bought another one.  Been a great phone.  Mobile gaming is terrible too so I dont know what a new phone would do for me.",
                  "score": 3,
                  "created_utc": 1738278322.0,
                  "replies": []
                },
                {
                  "id": "ma3snkb",
                  "author": "Boulder1983",
                  "body": "I feel the same, but what will do it is when they casually drop 'updates' over the year that slowly make the phone slow down and have a shittier battery.",
                  "score": 1,
                  "created_utc": 1738280915.0,
                  "replies": []
                },
                {
                  "id": "ma5enbc",
                  "author": "Doubleyoupee",
                  "body": "Same although exynos battery life is pretty subpar. Any day that is not light usage means charging throughout the day",
                  "score": 1,
                  "created_utc": 1738301507.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ma2xz9o",
              "author": "camy205",
              "body": "I have the s22 ultra and I'm not upgrading, it does everything I want fantastically. Best thing to do is just replace the battery when it craps out",
              "score": 13,
              "created_utc": 1738271944.0,
              "replies": [
                {
                  "id": "mazoc1j",
                  "author": "Twigsnapper",
                  "body": "I have the ultra as well and thought about upgrading because the phone has had some hiccups but yea the 25 ultra just isn't doing it for me. \n\nI can even get it for 600 bucks with trade in and other cash back offers with my credit card and other things...still doesn't seem worth it",
                  "score": 1,
                  "created_utc": 1738703291.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ma3jgmu",
              "author": "ghdana",
              "body": "That's good, people don't need to upgrade every year. It makes a ton of waste. Some people have a 5-6 year old phone and are ready to upgrade. Personally if I'm only upgrading every 5+ years at this point give me a S25 over a S24 just because it will have an extra year of support.",
              "score": 5,
              "created_utc": 1738278072.0,
              "replies": [
                {
                  "id": "ma3jpji",
                  "author": "Juicyjackson",
                  "body": "Usually 3 generations for me.\n\nBut guess i will go for 4 with the S26.",
                  "score": 1,
                  "created_utc": 1738278148.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ma3qr10",
              "author": "stockinheritance",
              "body": "act kiss different wrench badge nutty deserve innocent fragile rob\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 4,
              "created_utc": 1738280317.0,
              "replies": []
            },
            {
              "id": "ma3jxvz",
              "author": "Surtock",
              "body": "I went from the 22 to the 24 ultra and it's a decent bump in hardware and battery. Making the jump from the 22 to the 25 sound like it would be roughly the same as I experienced. If you're happy, skip this and wait for the 26 or 27 for more noticeable gains.       \nThe only real caveat of waiting is the depreciation of your current device. The money made from the old device helps offset the cost of the new, obviously. For fun, I checked with Samsung and with pre-order and device exchange, they were going to give me $1125 off for sending back my s24U. Pretty sizable discount, but being Canadian, it would still cost me another $800 CAD for the upgraded which doesn't sound like enough for what I'd get back.",
              "score": 3,
              "created_utc": 1738278219.0,
              "replies": [
                {
                  "id": "ma3qzpi",
                  "author": "stockinheritance",
                  "body": "Battery would be nice but I don't have any problems with the hardware in the S22. It's fast for all the things I want to do.",
                  "score": 1,
                  "created_utc": 1738280393.0,
                  "replies": [
                    {
                      "id": "ma41zh9",
                      "author": "CaptainKursk",
                      "body": "Only things that would make it perfect are a headphone jack and expandable storage. But despite the fact these could be accomplished with literally 0 effort, the corporations choose not to so that we're forced to fork over more money to them for bluetooth audio devices and larger storage models at bumped-up prices.\n\nHooray for capitalism.",
                      "score": 3,
                      "created_utc": 1738283917.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ma41o10",
              "author": "CaptainKursk",
              "body": "I recently got a 2nd hand S23 after upgrading from my mid-level A52 for what feels like dirt cheap. Does 99% of what the S25 does for less than 50% of the price. I understand the need to upgrade technology as time passes, but there's simply no need for yearly changes like the companies compel us to do.",
              "score": 2,
              "created_utc": 1738283813.0,
              "replies": []
            },
            {
              "id": "ma3p52k",
              "author": "Bootrear",
              "body": "Man I'd stay on my S21U if my storage wasn't full. 4 years between upgrades isn't a bad score though, and that for somebody who always had the latest and greatest back when new phone releases were still interesting",
              "score": 1,
              "created_utc": 1738279813.0,
              "replies": []
            },
            {
              "id": "ma49h3o",
              "author": "n14shorecarcass",
              "body": "I also have an s22 and am super excited for the 25 to come out so I can get a 24 for a better price.\n\nMy husband and I went into tmobile like 3 weeks ago to get new phones.. his is acting up, and I MRI'd mine on accident, so now my front camera is nearsighted. We walk in and the sales kid was like oh no, come back in Feb for the s25 it's gonna have AI!! And im like I don't give a shit, I need a phone. My husband, bless his heart, mentioned how fucked up our phones are to plead with the guy to sell us phones. Mind you, this is my phone plan that I've had for 20 years, hes only been on it for the last 6.. I took him outside and said, I told you to let me do the talking, now we can't even trade our phones in. He was loke, oh shit, sorry... So we went back in, told the guy how awesome he was for telling us the hot info, left the store and decided to get new 24's when the 25's come out. Shittiest sales person ever.",
              "score": 1,
              "created_utc": 1738286356.0,
              "replies": []
            },
            {
              "id": "ma536sx",
              "author": "got-trunks",
              "body": "I still use a P20 Pro and aside from wanting to replace the back and clean the cameras it's perfectly fine and still has over a day of battery (2-3 days with my use)\n\nBest ROI phone I've ever had since I've managed not to break, lose, or have it stolen lol.",
              "score": 1,
              "created_utc": 1738296702.0,
              "replies": []
            },
            {
              "id": "ma5eb4f",
              "author": "Doubleyoupee",
              "body": "Same, do which phone would be a good replacement?",
              "score": 0,
              "created_utc": 1738301352.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma2k5if",
          "author": "Snipedzoi",
          "body": "Man the SD 8 elite is a huge jump for gaming. I personally wish I had waited before buying an s24. Also extra ram",
          "score": 8,
          "created_utc": 1738268122.0,
          "replies": [
            {
              "id": "ma3bqqw",
              "author": "mehemynx",
              "body": "Eh, any games I want more power for I'd rather use my other options. I love the design of the s24 better. The non nerfed s pen",
              "score": -1,
              "created_utc": 1738275802.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma4j1rc",
          "author": "JusCheelMang",
          "body": "Still waiting for a reason to upgrade my s20+ and lose having an SD card slot...",
          "score": 1,
          "created_utc": 1738289548.0,
          "replies": [
            {
              "id": "ma4n2cq",
              "author": "TheMacMan",
              "body": "Can't imagine wanting an SD slot. Had 1TB internal for years and no issues. Much faster than the SD card and no space issues. These are the days of cloud storage and the phone automatically offloads stuff like photos when needed, if you want it to.",
              "score": 2,
              "created_utc": 1738290902.0,
              "replies": [
                {
                  "id": "ma7k8s0",
                  "author": "Thelongdong11",
                  "body": "Yeah what's the price increase of 1tb phone over a 1tb SD card...",
                  "score": 0,
                  "created_utc": 1738337906.0,
                  "replies": [
                    {
                      "id": "ma7xed4",
                      "author": "TheMacMan",
                      "body": "They're not the same. The 1TB phone has far faster performance than the SD card. In addition the failure rate of the SD card is far higher and you have to go through the trouble to specifying to store on it instead.",
                      "score": 1,
                      "created_utc": 1738341641.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ma4yk92",
          "author": "fourthdawg",
          "body": "It is fine if they keep hardware features that have been implemented in the previous phone, but instead they choose to \"downgrade\" by removing Bluetooth from the S-pen",
          "score": 1,
          "created_utc": 1738294954.0,
          "replies": [
            {
              "id": "ma504ts",
              "author": "TheMacMan",
              "body": "They keep releasing basically the same processors while Apple has been running circles around them for years now. It's sad their newest can't even keep up with a 3 year old iPhone.",
              "score": 1,
              "created_utc": 1738295532.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma5q0wq",
          "author": "xavicx",
          "body": "I have a seven-year-old phone and was planning to change it due to the camera, but now most of them use too much AI in the photos.",
          "score": 1,
          "created_utc": 1738307344.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma1t7sb",
      "author": "None",
      "body": "When I hear \"AI\" I just think \"oh great, spyware pre-installed\"",
      "score": 173,
      "created_utc": 1738260713.0,
      "replies": [
        {
          "id": "ma44bt9",
          "author": "PurpleNurpe",
          "body": "Yup, if it drove me to Linux/Debian then I can assume it drove others to it as well.\n\nShame that my workplace is making their own LLM.",
          "score": 7,
          "created_utc": 1738284668.0,
          "replies": [
            {
              "id": "ma4ltd8",
              "author": "LTareyouserious",
              "body": "Copilot and recall drove me to linux on my pc. Not sure what I'll do when I need to replace my phone...",
              "score": 2,
              "created_utc": 1738290477.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ma2o19k",
      "author": "_RADIANTSUN_",
      "body": "I wish AI features should make stuff we already do better, not try to do new stuff crappily. I don't really want AI summaries of my texts or to generate random bad cartoons ffs.\n\nI wish we had a \"boom\" in stuff like when Google introduced the Pixel phones with stuff like AI zoom based on the instabilities in your camera hand, or even Samsung's \"AI moon\" stuff is actually quite good because you can just take a photo and the moon won't be blown out if the rest of your night shot is properly exposed. \n\nOr I don't really want something that generates me text stories and robotic email templates... I want an autocorrect that is literally almost flawless and not annoying at all because it understands the likely intent of what I am typing, I mean that's what LLMs are anyway right? Well I spend a lot of time typing on my phone, could be cool if they actually used all the hardware I paid for.",
      "score": 15,
      "created_utc": 1738269202.0,
      "replies": [
        {
          "id": "ma8lis0",
          "author": "your_thebest",
          "body": "Yeah I think I might light myself on fire before ever needing my emails summarized or an a shoe brand from a YouTube video. But not having to try 10 times in order to swipe text the word \"happen\" or \"restaurant\" when those are the only words that are reasonable at that point in a sentence...yes I want that.",
          "score": 2,
          "created_utc": 1738348349.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma2jnfc",
      "author": "Randactbjthroaway",
      "body": "I can't wait for ai to go away. It's so annoying",
      "score": 17,
      "created_utc": 1738267982.0,
      "replies": []
    },
    {
      "id": "ma1tnfx",
      "author": "GrayDaysGoAway",
      "body": "It'd be great if the stupid assholes designing these phones would quit clustering all the cameras on one side. Fuck any phone that needs a case just to lay flat on a table.",
      "score": 55,
      "created_utc": 1738260834.0,
      "replies": [
        {
          "id": "ma1uikd",
          "author": "0x831",
          "body": "Wobble wobble",
          "score": 21,
          "created_utc": 1738261073.0,
          "replies": [
            {
              "id": "ma2mhn7",
              "author": "Hashabasha",
              "body": "to the very next day bomp bomp bomp bomp bop bobomp",
              "score": 5,
              "created_utc": 1738268770.0,
              "replies": []
            },
            {
              "id": "ma22sc6",
              "author": "drc84",
              "body": "Let me see ya shake it shake it",
              "score": 1,
              "created_utc": 1738263331.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma1wkes",
          "author": "8_Pixels",
          "body": "I have the Pixel 9 Pro and it's the worst phone I've ever had for this. The camera protrusion is so big that when you buy a screen protector they give you one for the camera too. Doesn't lay flat even with a case because the case would too thick so even the case has a protrusion where the camera is.",
          "score": 11,
          "created_utc": 1738261631.0,
          "replies": [
            {
              "id": "ma23c5g",
              "author": "SinkPhaze",
              "body": "It's so bad! Why the fuck didn't they at least bevel the edges? I had a Pixel 6 and thought that bump was bad but it's got nothing on this. Can't put it in a pocket with anything else or the other stuff will catch on the bump and get dragged out with it. I lost a credit card that way",
              "score": 4,
              "created_utc": 1738263481.0,
              "replies": [
                {
                  "id": "ma295bt",
                  "author": "kog",
                  "body": "You have to remember Google hasn't given a fuck about its users in years\n\nBut people keep using their products, so they continue not caring",
                  "score": 4,
                  "created_utc": 1738265083.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ma2ipj4",
          "author": "thisischemistry",
          "body": "Just make the phone a little thicker so there's no camera bump and then include more battery…",
          "score": 11,
          "created_utc": 1738267718.0,
          "replies": []
        },
        {
          "id": "ma2k6yy",
          "author": "PARANOIAH",
          "body": "They should just fill up the camera bump thickness with more battery and maybe some crazy periscope zoom bits.",
          "score": 6,
          "created_utc": 1738268133.0,
          "replies": [
            {
              "id": "ma58nlx",
              "author": "None",
              "body": "Whenever a company releases one of these Redditor dream phones, no one buys it. They make thick rugged phones, no one buys them, Apple made an iPhone mini, no one bought it. \n\nPeople just need to accept that the current design is what the average person wants. ",
              "score": 7,
              "created_utc": 1738298910.0,
              "replies": [
                {
                  "id": "ma5vubc",
                  "author": "Rezenbekk",
                  "body": "You're right of course but I still don't understand why phone thinness is valued so much. I'd rather be able to forget to charge the phone and still be fine for a day.",
                  "score": 1,
                  "created_utc": 1738310742.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ma39so0",
          "author": "Vio94",
          "body": "Yeah. It's really fucking annoying. It reminds me of automotive design engineers that cram everything into unreachable places. Just intentionally shitty.",
          "score": 1,
          "created_utc": 1738275239.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma4k2ly",
      "author": "MWD_Dave",
      "body": "^^Know ^^what ^^I ^^really ^^want ^^Samsung? \n\n**I WANT THE MICRO SD CARD BACK!!!**",
      "score": 10,
      "created_utc": 1738289895.0,
      "replies": []
    },
    {
      "id": "ma1u2ja",
      "author": "10SILUV",
      "body": "Fuck AI",
      "score": 45,
      "created_utc": 1738260951.0,
      "replies": [
        {
          "id": "ma2e9c4",
          "author": "Presently_Absent",
          "body": "Only if you upgrade to the S25X",
          "score": 13,
          "created_utc": 1738266490.0,
          "replies": []
        },
        {
          "id": "ma2h7ii",
          "author": "Hack874",
          "body": "Bro what",
          "score": -3,
          "created_utc": 1738267298.0,
          "replies": [
            {
              "id": "ma2kr3f",
              "author": "10SILUV",
              "body": "U heard me bro",
              "score": 3,
              "created_utc": 1738268290.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma266r9",
          "author": "some_user_2021",
          "body": "r/aipornhub",
          "score": -3,
          "created_utc": 1738264268.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma1sbpf",
      "author": "None",
      "body": "[removed]",
      "score": 19,
      "created_utc": 1738260465.0,
      "replies": [
        {
          "id": "ma1szxd",
          "author": "Replikant83",
          "body": "They'll be pushing this trash for a while. It's so much cheaper to use AI than to actually develop better hardware. So sad",
          "score": 7,
          "created_utc": 1738260653.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma1zx9y",
      "author": "Dark-Knight-Rises",
      "body": "What’s the AI benefit im getting from this?",
      "score": 10,
      "created_utc": 1738262550.0,
      "replies": [
        {
          "id": "ma2822n",
          "author": "New_Plate_1096",
          "body": "It has ~~marketing buzzword~~ AI!",
          "score": 13,
          "created_utc": 1738264784.0,
          "replies": []
        },
        {
          "id": "mabm2pr",
          "author": "EquipableFiness",
          "body": "You're giving even more data to mega corps. Yay",
          "score": 1,
          "created_utc": 1738382559.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma2i264",
      "author": "spacious_clouds",
      "body": "I ordered an S25 Ultra to replace my Note 20 Ultra. I generally dislike AI, but I needed an upgrade, and got a good pre-order deal. With trade-in, bonus offers, etc. I will be getting the 1TB model for about $550 out of pocket.\n\nCan the AI spyware be truly disabled?",
      "score": 8,
      "created_utc": 1738267537.0,
      "replies": [
        {
          "id": "ma31p23",
          "author": "kenkendoesstuff",
          "body": "wait until the AI is paywalled at end of 2025. then no more of its bullshit will be present",
          "score": 6,
          "created_utc": 1738272968.0,
          "replies": []
        },
        {
          "id": "mafzrfo",
          "author": "no_more_secrets",
          "body": "Not one answer. :/",
          "score": 2,
          "created_utc": 1738445728.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma1y0ez",
      "author": "ballsmigue",
      "body": "At least last year with the S24 ultra the AI stuff feels more like nice additions but not front and center features I feel I ever need to really engage with",
      "score": 8,
      "created_utc": 1738262026.0,
      "replies": [
        {
          "id": "ma42cve",
          "author": "CaptainKursk",
          "body": "The one thing the S24 series impressed me with using AI was the translation feature with Google that allowed for real-time audio and conversational translations. As someone living abroad, it was pretty neat but other than that, the phone did nothing than an S21 couldn't do.",
          "score": 4,
          "created_utc": 1738284036.0,
          "replies": [
            {
              "id": "ma55nfq",
              "author": "psychobilly1",
              "body": "The camera is a bit nicer and I like having the stylus back but otherwise you're correct. I don't regret trading up from an S21 Ultra to an S24 Ultra, but it was hardly a necessary upgrade.",
              "score": 1,
              "created_utc": 1738297685.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ma26kqk",
      "author": "HunterLionheart",
      "body": "As someone on an s23 ultra right now, who would be naturally inclined to upgrade, this is an excellent excuse to go sim only and save a bunch of money.",
      "score": 8,
      "created_utc": 1738264375.0,
      "replies": []
    },
    {
      "id": "ma5anws",
      "author": "homelesshobo77",
      "body": "Bring back the expandable memory slot. Keep AI, not interested.  Bring down the cost. Thousand of dollaridoos for a phone is absurd. Bring back decent mobile games that you can just buy and not be pummelled with ads. Make the screens more sturdy. Make a battery that actually lasts a day with intensive use.",
      "score": 6,
      "created_utc": 1738299750.0,
      "replies": []
    },
    {
      "id": "ma51f6u",
      "author": "Ghost_412345",
      "body": "Smartphones are deep fakes of themselves",
      "score": 5,
      "created_utc": 1738296018.0,
      "replies": []
    },
    {
      "id": "ma2l5pd",
      "author": "Judithbee",
      "body": "I think people need to stop expecting huge updates every year. The way tech is built now, you don't need to upgrade every year. As for AI, I feel like love it/hate it, its here to stay. Plus, it does have some good features for people with disabilities.",
      "score": 8,
      "created_utc": 1738268403.0,
      "replies": [
        {
          "id": "ma31lbh",
          "author": "skriefal",
          "body": "Yes.  Even as a tech nerd who has enjoyed yearly upgrades for the last 10 years or so, I no longer see a reason to continue the yearly upgrade pattern.  Unless things change I'll probably move to an every-third-year upgrade.",
          "score": 6,
          "created_utc": 1738272940.0,
          "replies": [
            {
              "id": "ma5qw8n",
              "author": "newagereject",
              "body": "I'm doing that, I have an s22 ultra and I'm gunna get the 25 ultra, they are to expensive to do every 2 years",
              "score": 1,
              "created_utc": 1738307831.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ma2fmhl",
      "author": "MrDaebak",
      "body": "As a Samsung Galaxy fan since the S2. I'm disappointed. It's indeed lackluster. I will wait for the S26 Ultra. I want a phone that takes amazing concert photo's and low light photo's, which the S24U does a good job in. But it can always be better. I really hope they will focus on the S26U on the low light photos again. Then for sure, I will buy it.",
      "score": 3,
      "created_utc": 1738266862.0,
      "replies": []
    },
    {
      "id": "ma4ct30",
      "author": "SpaceDandye",
      "body": "Anyone that watched the last few years know they have been pimping ai, but know it's supposed to be game changing.,... \n\nGoogle did push ai in a  a good direction. With hold for me, Google answering my calls, but then Gemini ruined everything. Neither can be used together and Gemini can't do things the Google assistant does depending on lunar cycles. \n\nI want a badass camera, battery, screen. Not one improvement per 3 years",
      "score": 3,
      "created_utc": 1738287458.0,
      "replies": []
    },
    {
      "id": "ma53kcc",
      "author": "__420_",
      "body": "Do you guys remember when 3D anything was hot? 3D TV! 3D GAME CONSOLES? 3D MOVIES!",
      "score": 3,
      "created_utc": 1738296850.0,
      "replies": [
        {
          "id": "ma7u56x",
          "author": "tignasse",
          "body": "Still have 3D TV in my bedroom",
          "score": 3,
          "created_utc": 1738340730.0,
          "replies": []
        },
        {
          "id": "ma7wgx7",
          "author": "Creaulx",
          "body": "And before that, in the 90s - everything was HD! Always some new gimmick being heavily promoted. AI is just ok for fixing up photos, but for writing, it's not great. I will always write my own thoughts, disjointed as they may be, as opposed to letting the algorithm do the heavy lifting while my brain rots away from lack of use.",
          "score": 3,
          "created_utc": 1738341381.0,
          "replies": []
        },
        {
          "id": "mbco19b",
          "author": "wezl0",
          "body": "I had the HTC 3D smartphone, forget the exact model name. It was a pile of shit",
          "score": 1,
          "created_utc": 1738872230.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma2hu7j",
      "author": "morpheuseus",
      "body": "If AI starts being built into smart phones, I will go purchase a flip phonec why are they doing this ?",
      "score": 2,
      "created_utc": 1738267475.0,
      "replies": []
    },
    {
      "id": "ma2slsb",
      "author": "sicurri",
      "body": "I'm not getting this unless I can disable the ai. I could care less about the ai doing stupid shit for me. The only reason I'd get this would be because the snapdragon 8 elite chip is awesome. Also, I'd give my \"old\" phone to my brother and upgrade him from his s22 ultra. I've been playing around with emulating pc games on our phones, and he'd love my current phone for several games.",
      "score": 2,
      "created_utc": 1738270459.0,
      "replies": []
    },
    {
      "id": "ma2usqm",
      "author": "WordNERD37",
      "body": "Yeah, I own a Fold 6, I bent over backwards to get whatever suite of AI they shoveled on here turned off and never ever interact with any of them whatsoever. I have owned Samsung phones now since 2000 and nearly a new phone every year. I am going to be gone with them in total if this is the future of their products. \n\nNo one trusts this because all AI smells like as it's presented to us is, spamware full of trackers and ways to steal our data no matter what they say it's doing or not. And if your argument is; \"They're gonna get your data regardless\" pardon me for not rolling over on this. I'm going to make as impossible to the point of implausible for them for as long as I can, and maybe if more of us acted that way these compaines wouldn't feeo emboldened to push forward.",
      "score": 2,
      "created_utc": 1738271064.0,
      "replies": []
    },
    {
      "id": "ma2w6ng",
      "author": "seanrm92",
      "body": "I had to remind myself which Galaxy Ultra I have (S22). The models that came after it have been so similar that if you told me I had an S23 or S24 I might have believed you.\n\nI used to be interested in smartphone tech. But phone companies have obviously run out of hardware ideas (their last bold new idea being the removal of the headphone jack). So now they're just tacking on AI and gaslighting everyone into giving a shit about it.",
      "score": 2,
      "created_utc": 1738271449.0,
      "replies": []
    },
    {
      "id": "ma3pxm5",
      "author": "imapeasant",
      "body": "i would imagine a phone with AI is a phone that can disable mobile internet when I'm at home and turn on wifi when I'm outside. Or set an alarm or at least notify if the phone notice in my email I have a meeting in the morning. basically an IFTTT without the needs to setting it up yourselves",
      "score": 2,
      "created_utc": 1738280062.0,
      "replies": []
    },
    {
      "id": "ma4avr0",
      "author": "WretchedMisteak",
      "body": "I read that as just even more bloat in an already bloated OS.",
      "score": 2,
      "created_utc": 1738286819.0,
      "replies": []
    },
    {
      "id": "ma4qt01",
      "author": "OcelotTerrible5865",
      "body": "It was time to upgrade when the iPhone 16 came out and I’ve been on Apple since the 3g so wasn’t in the mood to switch… if I’m alive in 3 years I’m in the mood to switch now.",
      "score": 2,
      "created_utc": 1738292188.0,
      "replies": []
    },
    {
      "id": "ma58qen",
      "author": "jcshrader",
      "body": "I like AI when it comes to doing online searches and stuff like that. Otherwise, its fun to make silly little pictures or laugh at chat gpt. \n\nBut, for creative writing or essays (what I do for fun and work) spellcheck and grammer is as far as it's use goes for me.",
      "score": 2,
      "created_utc": 1738298941.0,
      "replies": []
    },
    {
      "id": "ma7nrlo",
      "author": "javiers",
      "body": "It seems that AI has become and excuse to slap some supposedly useful features avoiding to improve hardware specs and operating system fluidity.\n“Why do I have just 128GB of storage? That was common 4 years ago already “\n“Builder: but now you can apply intelligent, AI powered photo filters”\n“I don’t give a rat’s ass”\n“Builder: but AI!”🤖",
      "score": 2,
      "created_utc": 1738338919.0,
      "replies": []
    },
    {
      "id": "ma7tmnm",
      "author": "tignasse",
      "body": "AI is just google assistant x100 nothing more. \n\nWhat upgrades can we expect anyway ? \n\nUltra expensive Mobile phones are fucking scam now. What the point making new phones every year ?",
      "score": 2,
      "created_utc": 1738340586.0,
      "replies": [
        {
          "id": "mas77f7",
          "author": "None",
          "body": "To make moneyz",
          "score": 1,
          "created_utc": 1738608822.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma2qzb3",
      "author": "dustofdeath",
      "body": "It just looks like a bit larger non ultra.\n\n\nNote/Ultra had the iconic square corner look no other phones really have anymore.\n\n\nNow it's just the same generic looking rounded corner slab.",
      "score": 4,
      "created_utc": 1738270014.0,
      "replies": []
    },
    {
      "id": "ma5kmxb",
      "author": "SeaworthinessNo1920",
      "body": "just put back the headphone jack and sd card slot , is that too much to ask for ?",
      "score": 4,
      "created_utc": 1738304441.0,
      "replies": [
        {
          "id": "ma5tgwa",
          "author": "Caci-que",
          "body": "Preach",
          "score": 1,
          "created_utc": 1738309335.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma2ky9f",
      "author": "MorgrainX",
      "body": "Can't wait for the s26 or s27 ultra to ditch the pen altogether, losing the only actual difference to other phones and people losing their shit over the next gen of useless, over promised but under delivered \"AI\" tech. \n\nSamsung has always excelled at being a good hardware company, they never excelled at being a good software company. They merely slapped some halfbaked software on top of top hardware. This AI move is not clever. \n\nIf seems that Samsung forgot that.",
      "score": 2,
      "created_utc": 1738268345.0,
      "replies": []
    },
    {
      "id": "ma37jyl",
      "author": "D_Anger_Dan",
      "body": "When will Samsung learn? What the people want, nay DEMAND, is MORE COWBELL!!",
      "score": 3,
      "created_utc": 1738274597.0,
      "replies": []
    },
    {
      "id": "ma3gvcu",
      "author": "Crowsby",
      "body": "AI, moreso than any previous technology I can recall, is one of those things that I really appreciate when I need it, and something I absolutely despise being forced on me when I don't.",
      "score": 1,
      "created_utc": 1738277303.0,
      "replies": []
    },
    {
      "id": "ma402nq",
      "author": "Cherudim",
      "body": "I have a S24 ultra and I pretty much only ordered an S25 ultra for 2 reasons. They gave me a really good trade in for my S24u and with the current tom fuckery of the united states I'm probably going to have this S25u for the next 4 years if count cheeto has his way with tariffs.",
      "score": 1,
      "created_utc": 1738283299.0,
      "replies": []
    },
    {
      "id": "ma44f02",
      "author": "tacitus23",
      "body": "I knew that was going to be the case when I saw all the \"deal\" to trade in an S24 Ultra for an S25. Remember if the deal is too good to be true, you're the product.",
      "score": 1,
      "created_utc": 1738284697.0,
      "replies": []
    },
    {
      "id": "ma451yk",
      "author": "Mr_Enemabag-Jones",
      "body": "So what is the recommendation for someone needing a new phone? I'm still rocking the S10-5G.  I have read the new Pixel has performance issues and the new galaxy ultra is a bloated mess of AI",
      "score": 1,
      "created_utc": 1738284902.0,
      "replies": [
        {
          "id": "ma4gomd",
          "author": "SnooPies6274",
          "body": "If you prefer to keep your phone for several years, consider either the Google Pixel 9 Pro or the new S25 lineup. These phones offer a remarkable promise of seven years of security and OS updates. Don’t let negative comments deter you; these are top-notch devices. Most complaints come from individuals using last year’s models. If your phone is already old enough, you’ll likely find these newer phones to be a significant upgrade.",
          "score": 2,
          "created_utc": 1738288752.0,
          "replies": []
        },
        {
          "id": "ma57r7h",
          "author": "Zharick_",
          "body": "fellow S10er! I'm gonna replace mine in a few months. debating on the S24U instead of S25",
          "score": 1,
          "created_utc": 1738298543.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma4j2y0",
      "author": "Placed-ByThe-Gideons",
      "body": "Nobody saw that coming.",
      "score": 1,
      "created_utc": 1738289560.0,
      "replies": []
    },
    {
      "id": "ma566vc",
      "author": "salutmalibu",
      "body": "Hmm",
      "score": 1,
      "created_utc": 1738297903.0,
      "replies": []
    },
    {
      "id": "ma5hrd7",
      "author": "Turkino",
      "body": "It's the new phone, almost the exact same as the last phone.",
      "score": 1,
      "created_utc": 1738302990.0,
      "replies": []
    },
    {
      "id": "ma5pcqt",
      "author": "VukKiller",
      "body": "S24 is the perfect amount of AI",
      "score": 1,
      "created_utc": 1738306973.0,
      "replies": []
    },
    {
      "id": "ma5rfal",
      "author": "OuttaPhaze",
      "body": "i upgraded from the s20 to the s24.\nI barely use the A.I. features, only occasionally.",
      "score": 1,
      "created_utc": 1738308138.0,
      "replies": []
    },
    {
      "id": "ma5vkfm",
      "author": "santz007",
      "body": "All I want to know is - Did Samsung fix the camera blur on moving objects?",
      "score": 1,
      "created_utc": 1738310577.0,
      "replies": []
    },
    {
      "id": "ma63hyb",
      "author": "jordanosa",
      "body": "Make an Ultra mini with an S pen and you will score a fortune",
      "score": 1,
      "created_utc": 1738315504.0,
      "replies": []
    },
    {
      "id": "ma6basq",
      "author": "GammaDealer",
      "body": "Honestly the only reason I pre-ordered it was because I was hoping to beat out any tariff included price increases over the next 4 years.",
      "score": 1,
      "created_utc": 1738320326.0,
      "replies": []
    },
    {
      "id": "ma7868h",
      "author": "WhimsicalChuckler",
      "body": " I think I need to get my hands on one and see for myself if the AI features are truly overbearing.",
      "score": 1,
      "created_utc": 1738334193.0,
      "replies": []
    },
    {
      "id": "ma79gtx",
      "author": "peacemaker2121",
      "body": "Ai is an abused tool. I'd like it to a flathead screwdriver. Used for everything other than it's purpose.",
      "score": 1,
      "created_utc": 1738334609.0,
      "replies": []
    },
    {
      "id": "ma9i4qq",
      "author": "invent_or_die",
      "body": "So glad I got a new S24 last week. Half the cost of the S25,  with pocket friendly rounded corners.",
      "score": 1,
      "created_utc": 1738357577.0,
      "replies": []
    },
    {
      "id": "maaeuw8",
      "author": "whoever81",
      "body": "Daamn my S24U was a great investment",
      "score": 1,
      "created_utc": 1738367419.0,
      "replies": []
    },
    {
      "id": "macmz3y",
      "author": "None",
      "body": "Just don't buy it.",
      "score": 1,
      "created_utc": 1738401454.0,
      "replies": []
    },
    {
      "id": "mae43cg",
      "author": "ricochet48",
      "body": "At this point the only upgrades that matter are camera and battery life.\n\nThey are plenty fast already and I don't need all that AI...",
      "score": 1,
      "created_utc": 1738425283.0,
      "replies": []
    },
    {
      "id": "mamqlpi",
      "author": "spasm01",
      "body": "this is why I went from s10 to zen10, these major players need to stop making \"changes\" that are not useful and actually regresses their products",
      "score": 1,
      "created_utc": 1738534227.0,
      "replies": []
    },
    {
      "id": "mandhs3",
      "author": "BengalFan85",
      "body": "I’ve been seriously considering going back to android after 4 years of iOS but man none of these options seem like that much of a step above",
      "score": 1,
      "created_utc": 1738541417.0,
      "replies": []
    },
    {
      "id": "maqkh8n",
      "author": "Repulsive-Jicama-439",
      "body": "Not so useful AI crap",
      "score": 1,
      "created_utc": 1738591644.0,
      "replies": []
    },
    {
      "id": "maszwjn",
      "author": "addictedtolols",
      "body": "no innovation because there is no struggle. almost every single invention and innovation was because somebody had to overcome some problem. samsung (and apple) current has zero problems (outside of the ones they cause themselves) and are forced to release a new phone every year",
      "score": 1,
      "created_utc": 1738616764.0,
      "replies": []
    },
    {
      "id": "mciuc2h",
      "author": "Upstairs-Broccoli186",
      "body": "rtx 5080 is better",
      "score": 1,
      "created_utc": 1739437943.0,
      "replies": []
    },
    {
      "id": "ma2dj82",
      "author": "None",
      "body": "So the last good ultra was the 22. Got it.",
      "score": 1,
      "created_utc": 1738266290.0,
      "replies": [
        {
          "id": "ma2j8wb",
          "author": "Abigail716",
          "body": "24 actually. It is the closest to what I would consider a perfect phone. The biggest improvement IMO is the flat screen which allows you to use traditional glass screen protectors. The shape of it is also significantly more comfortable to hold than the 21/22/23.",
          "score": 6,
          "created_utc": 1738267869.0,
          "replies": [
            {
              "id": "ma3rqt7",
              "author": "Leaky_Asshole",
              "body": "Except they got rid of that awesome 10x optical zoom from the 23U",
              "score": 3,
              "created_utc": 1738280628.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma4zrt2",
          "author": "not_not_in_the_NSA",
          "body": "*note 9",
          "score": 3,
          "created_utc": 1738295396.0,
          "replies": [
            {
              "id": "mbai4wq",
              "author": "None",
              "body": "I never had the pleasure of having the note series. I'm very happy with the 22 though.",
              "score": 1,
              "created_utc": 1738849941.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma3p2g1",
          "author": "ghdana",
          "body": "It's still good. Just not a massive improvement.",
          "score": 1,
          "created_utc": 1738279791.0,
          "replies": []
        },
        {
          "id": "ma4wufz",
          "author": "MaliqGotTheHeat",
          "body": "the s22 ultra is known for having the worst battery life tho",
          "score": 1,
          "created_utc": 1738294331.0,
          "replies": [
            {
              "id": "mbai6tc",
              "author": "None",
              "body": "I really only love it for the camera.",
              "score": 2,
              "created_utc": 1738849959.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ma2pl3u",
      "author": "popmanbrad",
      "body": "As much as people hate AI it’s sadly here to stay especially since deep seek and how bitcoin is apparently still around (I thought all that died like a week after it came out)",
      "score": -2,
      "created_utc": 1738269630.0,
      "replies": [
        {
          "id": "ma3bgfj",
          "author": "None",
          "body": "[removed]",
          "score": 3,
          "created_utc": 1738275718.0,
          "replies": [
            {
              "id": "ma3bofz",
              "author": "popmanbrad",
              "body": "But if you read it I was referencing how everyone hated bitcoin but sadly it’s still around",
              "score": -3,
              "created_utc": 1738275783.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "magyaa6",
      "author": "Necirt",
      "body": "I'm going from an s10+ to the s25 ultra. This ought to be interesting. Any suggestion on a case? I always feel like they are way overpriced at the store. Would Amazon be better?",
      "score": 0,
      "created_utc": 1738456810.0,
      "replies": []
    },
    {
      "id": "ma218bo",
      "author": "RottenPingu1",
      "body": "Can't blame Samsung. The AI industry and media are pushing this hard as added value. All the big tech companies are riding the wave. Not to do so would be a marketing disaster.\nAi = hype.",
      "score": -6,
      "created_utc": 1738262905.0,
      "replies": [
        {
          "id": "ma2ctwo",
          "author": "kona_boy",
          "body": "You absolutely CAN blame Samsung jfc stop making excuses for their shit behaviour",
          "score": 5,
          "created_utc": 1738266098.0,
          "replies": []
        },
        {
          "id": "ma3lahb",
          "author": "Brigadier_Beavers",
          "body": "samsung is 1/5th of the south korean economy, theyre the directors of the hype",
          "score": 1,
          "created_utc": 1738278631.0,
          "replies": []
        },
        {
          "id": "ma2tpqp",
          "author": "spookmann",
          "body": "Samsung is *exactly* whom we should be blaming for enabling all this bullshit.",
          "score": 1,
          "created_utc": 1738270761.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma25644",
      "author": "None",
      "body": "That size of iphone 5-6 looks and everything was all that we needed.. or is it just me??",
      "score": -4,
      "created_utc": 1738263985.0,
      "replies": []
    },
    {
      "id": "ma2zxk9",
      "author": "TrydaBNice2Me",
      "body": "You all better get with iPhone",
      "score": -7,
      "created_utc": 1738272481.0,
      "replies": []
    }
  ]
}