{
  "post": {
    "title": "High-tech lactation pad measures medication in mothers' milk | The device will alert the user if it determines that acetaminophen levels in her milk are high enough to harm her baby",
    "author": "chrisdh79",
    "id": "1kj82bc",
    "score": 446,
    "created_utc": 1746876473.0,
    "selftext": "",
    "num_comments": 11,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kj82bc/hightech_lactation_pad_measures_medication_in/"
  },
  "comments": [
    {
      "id": "mrppw80",
      "author": "pcdarling",
      "body": "Acetaminophen (or paracetamol) is used a lot in both mothers and babies and has been found to be safe in both breastfeeding and pregnancy. \n\n\nIn fact we advise use of paracetamol after vaccination of Meningitis B in babies, which currently occurs at 8 and 12 weeks in the UK. This is advised for multiple doses to avoid post vaccine fever. \n\n\nEven both mum and baby using paracetamol both individually is recognised as safe. \n\nThe [Breast Feeding Network](https://www.breastfeedingnetwork.org.uk/factsheet/analgesics/) states:\n*\"If your baby needs to take paracetamol suspension (e.g. Calpol®) whilst you are taking paracetamol, they can do so at their own full and normal dose. The amount that they would get through your breastmilk is too small to be harmful in addition. \"*\n\n\nThe article states overuse of acetaminophen as the issue for liver problems in children. This isn't something I can see measuring levels in breast milk will help, as if you care enough to measure paracetamol levels in your breast milk then I'm sure you care enough to stay within the safe dosages noted on the packaging.\n\n\n**This whole product concerns me, coming across as a money maker for the company and an anxiety inducer for the mother...**\n\nIt seems the whole reason for the creation of this product hangs on one line in the paper ***\"some users may not follow the dosage instructions properly.\"***\nThey write a lot about liver damage, children needing liver transplants and other scary things, but this is what it boils down to. People overdosing due to not following dosage instructions properly.\n\nPushing this towards anxious mothers being given paracetamol in hospital post c-section doesn't feel right to me.\n\nAgain I really don't see this product being useful for the people who buy it, as it 'solves' a problem that doesn't exist in the group of people who are conscientious with their medication.",
      "score": 21,
      "created_utc": 1746947645.0,
      "replies": []
    },
    {
      "id": "mrn1n5f",
      "author": "EnvironmentalRock827",
      "body": "I don't even know where to begin to address this.  Has anyone ever tried to breast feed?   Do you understand how insanely difficult it is?  This won't make it easier.  And you're given more than just Tylenol so there's that.  Also limits on Tylenol were attempted ages ago.  It couldn't get passed but facilities generally have policies on how much you should take.  Tylenol toxicity is rare in newborns.",
      "score": 21,
      "created_utc": 1746907258.0,
      "replies": []
    },
    {
      "id": "mrn1obv",
      "author": "EnvironmentalRock827",
      "body": "I don't even know where to begin to address this.  Has anyone ever tried to breast feed?   Do you understand how insanely difficult it is?  This won't make it easier.  And you're given more than just Tylenol so there's that.  Also limits on Tylenol were attempted ages ago.  It couldn't get passed but facilities generally have policies on how much you should take.  Tylenol toxicity is rare in newborns.",
      "score": 10,
      "created_utc": 1746907270.0,
      "replies": [
        {
          "id": "mrnk0nx",
          "author": "pnutbutterfuck",
          "body": "Yeah as a fellow breastfeeding mother I feel very conflicted about this. Of course I would want to know what’s being passed through to my breastmilk but also I feel like this just gives mothers another burden surrounding breastfeeding that may cause them to stop altogether. The potential long term health effects of residual Tylenol in breastmilk vs the benefits of breastmilk and breastfeeding itself can’t be fairly weighed. I’ve personally noticed that every single formula fed child I know has a massive amount of  health issues; food allergies, digestion issues, skin infections, ear infections, sinus infections, constantly sick, etc. Meanwhile the breastfed kids I know hardly have those issues to the same level of severity. And it’s not just my own observation, this is something that has been studied and proven to be generally true, breastfed children are healthier. \n\nhttps://www.healthychildren.org/English/ages-stages/baby/breastfeeding/Pages/Breastfeeding-Benefits-Your-Babys-Immune-System.aspx\n\nSo if I break my leg and need to take a bunch of Tylenol to cope with the pain, do I stop breastfeeding to avoid possible health issues related to acetaminophen and risk my child getting a slew of other issues? In the time it would take for the bone to heal my supply would absolutely dry up, that would be the end of the breastfeeding journey.",
          "score": 8,
          "created_utc": 1746913654.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrt824j",
      "author": "Eye_foran_Eye",
      "body": "I can see this being used by the State to prosecute new mothers for drug use.",
      "score": 5,
      "created_utc": 1746997944.0,
      "replies": [
        {
          "id": "mruaftq",
          "author": "ZealousidealSolid715",
          "body": "Yea this sounds dystopian asf. More surveillance is exactly what we need (/s",
          "score": 1,
          "created_utc": 1747012099.0,
          "replies": [
            {
              "id": "mrumjx8",
              "author": "Eye_foran_Eye",
              "body": "Yet it’s the first thing I thought of! Sign of the times.",
              "score": 2,
              "created_utc": 1747016823.0,
              "replies": [
                {
                  "id": "mrup7j7",
                  "author": "ZealousidealSolid715",
                  "body": "(The /s was cuz I agree we *don't* need more surveillance btw 😅)",
                  "score": 1,
                  "created_utc": 1747017916.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mrvdmjv",
          "author": "InverseNurse",
          "body": "Bingo!",
          "score": 0,
          "created_utc": 1747030085.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrs6gwi",
      "author": "yasasd",
      "body": "I thought the user would be the baby",
      "score": 2,
      "created_utc": 1746985601.0,
      "replies": []
    },
    {
      "id": "mrkpeyr",
      "author": "None",
      "body": "[deleted]",
      "score": -2,
      "created_utc": 1746877891.0,
      "replies": [
        {
          "id": "mrkt73j",
          "author": "cetch",
          "body": "Other than its narrow therapeutic window what other risks do you see with Tylenol? NSAIDs are much higher risk than Tylenol. So I’m curious what you think are the several other better options if both nsaid and opioid are both higher risk.",
          "score": 4,
          "created_utc": 1746879591.0,
          "replies": []
        }
      ]
    }
  ]
}