{
  "post": {
    "title": "Synology starts selling overpriced 1.6 TB SSDs for $535 — self-branded, archaic PCIe 3.0 SSDs the only option to meet 'certified' criteria",
    "author": "diacewrb",
    "id": "1lpw0w3",
    "score": 639,
    "created_utc": 1751463299.0,
    "selftext": "",
    "num_comments": 47,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lpw0w3/synology_starts_selling_overpriced_16_tb_ssds_for/"
  },
  "comments": [
    {
      "id": "n11d628",
      "author": "AmNoSuperSand52",
      "body": "For those wondering, a 2TB PCIe 3 SSD should cost around $100",
      "score": 147,
      "created_utc": 1751500794.0,
      "replies": [
        {
          "id": "n15ez0n",
          "author": "pm-ur-tiddys",
          "body": "still absolutely insane to me i shelled out about the same price a decade ago for an hdd that held the same amount of storage but was several times larger.",
          "score": 29,
          "created_utc": 1751559401.0,
          "replies": [
            {
              "id": "n16voxe",
              "author": "AfricanNorwegian",
              "body": "NVMe drives have also gotten way cheaper recently. I remember paying over $200 for a 1TB gen 4 drive in 2020.\n\nNow I’ve just paid $300 for a 4TB gen 4 drive. Per TB that’s only $75 or 1/3 of the cost it was ~5 years ago.",
              "score": 11,
              "created_utc": 1751574609.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n107l0a",
      "author": "somewhatboxes",
      "body": "so, so relieved i didn't go with synology when i was figuring out NAS stuff.",
      "score": 228,
      "created_utc": 1751487797.0,
      "replies": [
        {
          "id": "n11c9nc",
          "author": "0layer",
          "body": "What did you go with instead? I’ve been thinking about getting a NAS setup going and was leaning towards Synology till all this proprietary stuff starting coming out",
          "score": 16,
          "created_utc": 1751500506.0,
          "replies": [
            {
              "id": "n144ev0",
              "author": "pizoisoned",
              "body": "Both Unraid and TrueNAS are good options if you have an old PC laying around and want to shove some hard disks in it.",
              "score": 20,
              "created_utc": 1751545035.0,
              "replies": []
            },
            {
              "id": "n15ffcb",
              "author": "somewhatboxes",
              "body": "i took an old computer i had and got some direct attach storage enclosures, and some refurbished HDDs (server part deals, i think)\n\ndirect attach storage is almost exactly the same as network attached storage in form factor, but the interface on the box is USB, so it has to plug into a computer (hence *direct*).\n\nNAS units are a little steep in price because the enclosure basically has a computer in it, which is fine if you need that, but if you happen to have a computer on hand anyway (even a laptop, if you're totally done using it), then you can cut that cost out and save a ton of money on DAS enclosures and HDDs.\n\nin my case, the \"stack\" happens to be\n\n- baseline m1 mac mini\n- a bunch of HDDs\n- various direct attach storage enclosures",
              "score": 5,
              "created_utc": 1751559531.0,
              "replies": [
                {
                  "id": "n16qdcb",
                  "author": "SmallIslandBrother",
                  "body": "Can you access your Mac mini remotely?",
                  "score": 0,
                  "created_utc": 1751573038.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n14lgju",
              "author": "ChickittyChicken",
              "body": "I have a UGREEN 4800 Plus.  I love it!  I’m running the factory OS, but you can run TrueNAS on it if you’d like.",
              "score": 8,
              "created_utc": 1751550898.0,
              "replies": [
                {
                  "id": "n196aoj",
                  "author": "Eyvallah3",
                  "body": "Also just purchased a 4800 plus and for the limited things I use it for it’s perfect! Definitely pricey compared to building your own but I just didn’t have the time dedicated to do that!",
                  "score": 1,
                  "created_utc": 1751604519.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n18phjr",
              "author": "tnt0",
              "body": "Unifi NAS Pro",
              "score": 3,
              "created_utc": 1751597378.0,
              "replies": []
            },
            {
              "id": "n146358",
              "author": "Mooseymax",
              "body": "QNAP isn’t a bad shout if you need something that just works either (happy to be corrected as it’s been years since I last set one up).",
              "score": 4,
              "created_utc": 1751545674.0,
              "replies": [
                {
                  "id": "n187tft",
                  "author": "User9705",
                  "body": "Go unraid, build your own box. QNAP DAS is a great option for the unraid box",
                  "score": 1,
                  "created_utc": 1751590731.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n10uko7",
          "author": "kenman345",
          "body": "Yea, I think what they’re doing is fine if you’re enterprise gear only. Having people use your gear with validated expensive options is kinda normal.\n\nThey should’ve just made a press release stating they are enterprise only and dropped a few lines when they did the refresh and then it’s on consumers that are using pro grade gear for that expense. But they didn’t, and this is entirely anti consumer. Everyone knows WD makes a perfectly good Red Pro drive and Seagate has the IronWolf I believe that also do well, we don’t need to be upsold on drives. They",
          "score": 54,
          "created_utc": 1751494697.0,
          "replies": [
            {
              "id": "n1a0m21",
              "author": "NoobensMcarthur",
              "body": "This is a dog shit value for money proposition for enterprise as well. Any project I have to deal with needs to come with quotes from multiple vendors. Any company that looks more than surface deep will see this is a rip off. How can you possibly justify the value? It’s not like they’re 365 where they actually have the business by the balls. ",
              "score": 3,
              "created_utc": 1751620721.0,
              "replies": [
                {
                  "id": "n1cbulm",
                  "author": "kenman345",
                  "body": "Can’t argue for the value proposition of enterprise, but at least I could understand the move if they were trying to say this is because they’re enterprise only now",
                  "score": 1,
                  "created_utc": 1751651147.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n11f8sb",
          "author": "bestjakeisbest",
          "body": "I have been thinking of building my own nas personally.",
          "score": 3,
          "created_utc": 1751501457.0,
          "replies": [
            {
              "id": "n120lbl",
              "author": "CheesyBadger",
              "body": "I was contemplating getting a Synology, but ended up throwing 5 drives into a 12 year old PC with TrueNAS.  All it took was watching a 15 min YouTube tutorial a couple times.  Works great!",
              "score": 9,
              "created_utc": 1751508436.0,
              "replies": [
                {
                  "id": "n134drh",
                  "author": "nagi603",
                  "body": "Just remember to never expose any NAS (or the containers) directly to the internet.",
                  "score": 4,
                  "created_utc": 1751526285.0,
                  "replies": [
                    {
                      "id": "n15c76v",
                      "author": "NaBrO-Barium",
                      "body": "That goes for just about any bits you want to keep private!",
                      "score": 1,
                      "created_utc": 1751558604.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n15e5l0",
              "author": "somewhatboxes",
              "body": "i strongly encourage it.\n\ni had a base m1 mac mini that i wasn't using for much else, so i got some DAS enclosures and some refurbished HDDs and now it quietly hums along as a media server and basic automation machine in my home. if you're not in the macOS ecosystem you can get a low-power PC for about the same price (might not do encoding as well, but i haven't been following that side of things for a while), and you can grow or shrink various components as your needs call for.",
              "score": 2,
              "created_utc": 1751559164.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n100pli",
      "author": "Perfect_Opinion7909",
      "body": "We knew that was coming.",
      "score": 65,
      "created_utc": 1751485775.0,
      "replies": []
    },
    {
      "id": "n10n0tp",
      "author": "Aisher",
      "body": "I wouldn’t mind paying a little extra for certification and features or guarantees. But the article states similar drives sell for $100 - a 400% markup is a bridge too far for me.",
      "score": 69,
      "created_utc": 1751492319.0,
      "replies": [
        {
          "id": "n13x5kh",
          "author": "Superventilator",
          "body": "If a $100 drive already has a 40% gross profit margin (manufacturer selling directly to consumers), then the Synology drive would have 88.8% margin, which is a nice 792% markup.",
          "score": 18,
          "created_utc": 1751542063.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n11iwdh",
      "author": "ChrisSlicks",
      "body": "The article TL;DR got it right.\n\n\"PCIe 3.0 speeds in a PCIe 5.0 world for PCIe 27.0 prices\"",
      "score": 64,
      "created_utc": 1751502645.0,
      "replies": []
    },
    {
      "id": "n1224c2",
      "author": "Limit_Cycle8765",
      "body": "I used to be a Synology user, but I stopped after they pulled this drive nonsense. I built my own NAS with Unraid.",
      "score": 19,
      "created_utc": 1751508990.0,
      "replies": []
    },
    {
      "id": "n148k6l",
      "author": "jelloslug",
      "body": "Did they get bought out by a VC?",
      "score": 9,
      "created_utc": 1751546585.0,
      "replies": []
    },
    {
      "id": "n14kq6p",
      "author": "TraditionalBackspace",
      "body": "Sucks how great companies slowly start sucking worse and worse over time. I've had Synology NASs for a long time and this will probably be my last.",
      "score": 9,
      "created_utc": 1751550674.0,
      "replies": []
    },
    {
      "id": "n17i4pv",
      "author": "irobot2090",
      "body": "UNAS Pro from Ubiquiti.",
      "score": 9,
      "created_utc": 1751581636.0,
      "replies": []
    },
    {
      "id": "n148yzp",
      "author": "jakgal04",
      "body": "As a Synology guy, it really disappoints me to see how bad this company is trying to self destruct.",
      "score": 7,
      "created_utc": 1751546731.0,
      "replies": []
    },
    {
      "id": "n16mr4d",
      "author": "Bderken",
      "body": "I used to get downvoted on Reddit saying synology is a complete waste of money for the hardware specs. I’ve never bought into a close source solution selling intel atom level hardware for 10x the price. They convinced so many idiots to buy overpriced two bay NAS…. So stupid",
      "score": 6,
      "created_utc": 1751571963.0,
      "replies": [
        {
          "id": "n17lg7v",
          "author": "__Loot__",
          "body": "Me too man, me too\n\n![gif](giphy|qbXy1q5iYq2eVazlkG|downsized)",
          "score": 3,
          "created_utc": 1751582757.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n17m618",
      "author": "cokespyro",
      "body": "o7 Synology.  Enjoyed your products for the past decade.  Will never buy another one as long as I live.",
      "score": 3,
      "created_utc": 1751582998.0,
      "replies": []
    },
    {
      "id": "n1a18se",
      "author": "aidoru_2k",
      "body": "At his point, they might as well start shipping with soldered storage alone.   \nThe company is done anyway, you don't regain trust after something like this.",
      "score": 3,
      "created_utc": 1751621087.0,
      "replies": []
    },
    {
      "id": "n14o1e8",
      "author": "snafu-germany",
      "body": "unifi nas as NFS and a proxmox with some container for needed features and everything is fine.",
      "score": 2,
      "created_utc": 1751551691.0,
      "replies": []
    },
    {
      "id": "n156d7i",
      "author": "MarkZuckerbergsPerm",
      "body": "gotta pursue that mythical infinite growth to placate shareholders.",
      "score": 2,
      "created_utc": 1751556971.0,
      "replies": []
    },
    {
      "id": "n16oc6m",
      "author": "im_thatoneguy",
      "body": "I hated this move so much that I went with a self-built SuperMicro ZFS system.  But if I'm honest, with the hassle I've faced compared to Synology I think I would go back.  It's still cheaper than a real enterprise system by a lot and even though my home built system is way more powerful per $$, the weaker Synology system was tuned to actually run faster overall.  Just so much weird annoying bullshit with the homebuilt for real-world performance whereas they guarantee performance with custom firmware, drivers, etc.",
      "score": 2,
      "created_utc": 1751572430.0,
      "replies": []
    },
    {
      "id": "n16u8ss",
      "author": "humanman42",
      "body": "unsurprised",
      "score": 2,
      "created_utc": 1751574185.0,
      "replies": []
    },
    {
      "id": "n1gofu0",
      "author": "kwyjibo1",
      "body": "And the enshittification continues.",
      "score": 2,
      "created_utc": 1751719986.0,
      "replies": []
    },
    {
      "id": "n14w0vx",
      "author": "godzilla619",
      "body": "They must have hired a Broadcom exec.",
      "score": 2,
      "created_utc": 1751554052.0,
      "replies": []
    },
    {
      "id": "n13vbm9",
      "author": "BipedalWurm",
      "body": "They put the anus is heinous",
      "score": 1,
      "created_utc": 1751541248.0,
      "replies": []
    },
    {
      "id": "n14g36k",
      "author": "00k5mp",
      "body": "pcie 3 \"archaic\" lol",
      "score": 1,
      "created_utc": 1751549176.0,
      "replies": []
    },
    {
      "id": "n14zox3",
      "author": "Emergency_Hawk_6947",
      "body": "They are trying to figure out how to make money. The NAS themselves are so robust and they software upgrades are free and have long lifecycle.",
      "score": 1,
      "created_utc": 1751555095.0,
      "replies": []
    },
    {
      "id": "n1gawke",
      "author": "Hattix",
      "body": "Just putting it out there, but that's an utterly standard reference PCB as used by *thousands* of [no-name Chinadrives such as the PG3VNF](https://aucview.aucfan.com/yahoo/m1100681633/), which are among the better of the ones sold as fake Samsungs.",
      "score": 1,
      "created_utc": 1751713508.0,
      "replies": []
    },
    {
      "id": "n13dljx",
      "author": "Less_Party",
      "body": "lol remember a couple months back when they announced this and people were actually defending it?",
      "score": 1,
      "created_utc": 1751531634.0,
      "replies": []
    },
    {
      "id": "n12f497",
      "author": "Txphotog903",
      "body": "One of my older ones had a fine you could edit and add the info if the drive you were trying to add. Once that was done, the Synology would accept it. I'm guessing they've closed that hole on the newer models.",
      "score": 0,
      "created_utc": 1751514035.0,
      "replies": []
    }
  ]
}