{
  "post": {
    "title": "Wyze Says ‘Screw It’ and Shoves a Camera Into Its Latest Smart Bulb | We can't decide if this is a great or terrible idea for your smart home.",
    "author": "chrisdh79",
    "id": "1l3vx93",
    "score": 813,
    "created_utc": 1749119872.0,
    "selftext": "",
    "num_comments": 193,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1l3vx93/wyze_says_screw_it_and_shoves_a_camera_into_its/"
  },
  "comments": [
    {
      "id": "mw45ogf",
      "author": "Em4gdn3m",
      "body": "Why is this so terrible? It allows you to easily power a security cam on your front porch or whatever, without the extra wiring. Its not like Wyze hid a camera in regular lightbulbs without customers knowing about it in order to spy on customers..",
      "score": 534,
      "created_utc": 1749121976.0,
      "replies": [
        {
          "id": "mw4n3qu",
          "author": "mauricioszabo",
          "body": "Clickbait. The article mentions no downsides, and not even once there are any mentions of why it's a bad idea.",
          "score": 61,
          "created_utc": 1749128785.0,
          "replies": [
            {
              "id": "mw51ztq",
              "author": "eljahaisabum",
              "body": "Can anyone just unscrew it?",
              "score": 19,
              "created_utc": 1749133548.0,
              "replies": [
                {
                  "id": "mwgd4vy",
                  "author": "paco_dasota",
                  "body": "I mean their existing cameras magnetically clip on to surfaces and face a similar problem",
                  "score": 12,
                  "created_utc": 1749280923.0,
                  "replies": []
                },
                {
                  "id": "mwolnly",
                  "author": "Fidodo",
                  "body": "You can also rip off most diy security cameras. You'll know that it happened and capture any footage until then, plus catch them in the act if you have multiple cameras.",
                  "score": 4,
                  "created_utc": 1749401612.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mwr254y",
              "author": "YnotBbrave",
              "body": "It's brilliant but a bit ugly looking",
              "score": 1,
              "created_utc": 1749430042.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mw4dwzg",
          "author": "sump_daddy",
          "body": "And add to that the fact that this concept has been around for YEARS in basic straight-outta-china products, there really is nothing to see here (unless you want an easy way to watch the outside of your house near a light fixture and in that scenario what there is to see here is the outside of your house near your light fixture.)\n\nThe only thing missing is a small battery for daytime monitoring in scenarios where you dont want to replace ALL the bulbs on that switch with smart ones and then leave the switch permanently on.",
          "score": 82,
          "created_utc": 1749125428.0,
          "replies": [
            {
              "id": "mw4o4w2",
              "author": "nick99990",
              "body": "Funny you mention that, everything Wyze is is straight out of China. I had found a firmware bug that caused the MAC address of one of my Wyze cams to give it's burned in address (from the manufacturer) instead of the one that gets coded in their custom firmware. Came back to a company in China. \n\nStarted looking into it and, yep, everything is white box and they just put a fancy wrapper on it with their app.\n\nIt was then I decided I didn't trust Wyze anymore and started working to get rid of them. I don't recommend them anymore, and all I have left is my door lock, which I'll replace when I get around to it.",
              "score": 30,
              "created_utc": 1749129136.0,
              "replies": [
                {
                  "id": "mw6en5g",
                  "author": "HelpRespawnedAsDee",
                  "body": "isn't almost everything from everyone from china anyways?",
                  "score": 27,
                  "created_utc": 1749147342.0,
                  "replies": []
                },
                {
                  "id": "mw70eip",
                  "author": "T1mely_P1neapple",
                  "body": "you did all that to come to a conclusion but cant navigate those constantly auditing their security online? we'd know.",
                  "score": 5,
                  "created_utc": 1749153534.0,
                  "replies": []
                },
                {
                  "id": "mw61zkg",
                  "author": "Butt_Face2000",
                  "body": "\"you found a firmware bug\".... sure... sure...",
                  "score": -9,
                  "created_utc": 1749143809.0,
                  "replies": [
                    {
                      "id": "mw68t6t",
                      "author": "nick99990",
                      "body": "Ok. I didn't discover it. But I experienced it when I saw a new MAC address on my network.",
                      "score": 13,
                      "created_utc": 1749145688.0,
                      "replies": [
                        {
                          "id": "mwtudix",
                          "author": "Butt_Face2000",
                          "body": "I think you have a misunderstanding of what a bug is.",
                          "score": 1,
                          "created_utc": 1749476144.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mw4up9n",
              "author": "finakechi",
              "body": "There have been adapters for lightbulb sockets for various things for decades lol.\n\nI remember having a few of the outlet adapters over the years.",
              "score": 4,
              "created_utc": 1749131308.0,
              "replies": []
            },
            {
              "id": "mwyvja6",
              "author": "Capokid",
              "body": "My front door has a streetlamp style light above it, this would be the perfect door cam.",
              "score": 1,
              "created_utc": 1749533875.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mw4vm7c",
          "author": "None",
          "body": "[deleted]",
          "score": 16,
          "created_utc": 1749131598.0,
          "replies": [
            {
              "id": "mw71834",
              "author": "TheArmadilloAmarillo",
              "body": "This would be great for apartments! Some either don't have a doorbell or would not let you switch one out for a ring. Most places I've lived did have a porch light though. \n\nWouldn't even be bad for my purposes but I already have a blink that I've screwed into the wall on my porch.",
              "score": 5,
              "created_utc": 1749153754.0,
              "replies": []
            },
            {
              "id": "mwoltmi",
              "author": "Fidodo",
              "body": "I wish it fit into a normal bulb sphere because I have an outdoor light socket I want this for.",
              "score": 1,
              "created_utc": 1749401663.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mw4y8tc",
          "author": "samanime",
          "body": "Yeah. When I clicked in, I thought it was going to be some hidden camera in your house for something goofy like auto-on/off of the light or something.\n\nBut this seems like a darn good idea. A security camera with no installation or wiring seems pretty good.\n\nI guess the only possibly downside is it is easily stealable, but you'd have the thief on camera. =p",
          "score": 5,
          "created_utc": 1749132422.0,
          "replies": []
        },
        {
          "id": "mw4i0gp",
          "author": "4kVHS",
          "body": "It’s only terrible because Wyze made it. I can’t wait for other manufacturers to pickup on this form factor.",
          "score": 10,
          "created_utc": 1749126979.0,
          "replies": [
            {
              "id": "mw4omoh",
              "author": "Em4gdn3m",
              "body": "Sure. I understand completely not trusting certain companys and their skeezy practices.. and I wouldn't buy this product from Wyze either, but the idea is a good idea and makes a ton of sense.",
              "score": 6,
              "created_utc": 1749129303.0,
              "replies": [
                {
                  "id": "mw50b28",
                  "author": "4kVHS",
                  "body": "Yeah that’s what I’m saying. I like the idea of it. I just don’t like Wyze. I’ve had several Wyze cams fail for no reason and several software issues that they refused to fix. Their support was very difficult to work with. I’m done with them.",
                  "score": 4,
                  "created_utc": 1749133049.0,
                  "replies": [
                    {
                      "id": "mw71l6a",
                      "author": "TheArmadilloAmarillo",
                      "body": "Interesting my wyze has actually been the best and most reliable one. Also cheaper, I bought it at the same time I bought 3 blinks and I kind of hate those.",
                      "score": 1,
                      "created_utc": 1749153852.0,
                      "replies": [
                        {
                          "id": "mw7fqw6",
                          "author": "4kVHS",
                          "body": "Blinks are just as bad but more expensive",
                          "score": 1,
                          "created_utc": 1749157872.0,
                          "replies": [
                            {
                              "id": "mw7ir1c",
                              "author": "TheArmadilloAmarillo",
                              "body": "The picture is definitely worse on mine too. Which it's not like 90s cctv bad but for the price I expected a bit better.",
                              "score": 1,
                              "created_utc": 1749158766.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mw66orn",
              "author": "AveDominusNox",
              "body": "Are there any smart home ecosystems that run entirely locally, not cloud based? Like I have computers. Capturing and compressing video when a motion sensor goes off isn’t exactly “offload this work to someone else’s supercomputer farm” kind of work.",
              "score": 2,
              "created_utc": 1749145108.0,
              "replies": [
                {
                  "id": "mw6pb9y",
                  "author": "ScientiaProtestas",
                  "body": "Yes, there are many.  Too many to cover in a short comment.  Try /r/homesecurity",
                  "score": 2,
                  "created_utc": 1749150402.0,
                  "replies": []
                },
                {
                  "id": "mwlflgn",
                  "author": "Zeisen",
                  "body": "Yeah, home assistant does and it works amazing. Pair it with Frigate and a CoralAI for image processing and you have an entirely local NVR system with automation. It's amazing and I cannot schill it enough to everyone around me. \n\nFor the past 4 years mine has run on a Raspberry Pi 4 B w/ 8GB RAM and a SanDisk SD card. I just recently upgraded to a kit that uses a MSATA SSD instead for better performance/stability. I love it.",
                  "score": 1,
                  "created_utc": 1749351114.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mw9y9cp",
              "author": "haarschmuck",
              "body": "I have like 20 wyze cams and not a single one has failed, even after years of outdoor use. \n\nWhy would I spend hundreds per cam when I can get them for literally $40?",
              "score": 2,
              "created_utc": 1749193087.0,
              "replies": []
            },
            {
              "id": "mw6ojkl",
              "author": "ScientiaProtestas",
              "body": "There are a ton of \"light bulb camera\"s out there.  Just search for what I put in quotes.  \n\nBut, most are lower end, as higher end will not be limited by a light bulb socket.",
              "score": 1,
              "created_utc": 1749150179.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mw4ab89",
          "author": "aircooledJenkins",
          "body": "... yet",
          "score": 6,
          "created_utc": 1749123987.0,
          "replies": []
        },
        {
          "id": "mw4vf6a",
          "author": "Old_Noted",
          "body": "Seems like a good product for exactly this reason",
          "score": 1,
          "created_utc": 1749131536.0,
          "replies": []
        },
        {
          "id": "mw8y9pd",
          "author": "DMala",
          "body": "I have one now that's just a camera with a light bulb base.  It's great because getting power out there would be a PITA otherwise.  I wouldn't mind one that is also still a light bulb, although we have three other lights out there so it's not super necessary.",
          "score": 1,
          "created_utc": 1749176781.0,
          "replies": []
        },
        {
          "id": "mw8zleg",
          "author": "that_one_wierd_guy",
          "body": "only problem I can think of is that there might be security issues. i.e. is the feed encrypted, can it be selfhosted or does the feed go off to someone elses servers?",
          "score": 1,
          "created_utc": 1749177278.0,
          "replies": []
        },
        {
          "id": "mw5s34k",
          "author": "SalltyJuicy",
          "body": "I think the bigger concern is largely how widespread and innocuous surveillance is in every day life. It's generally distressing that we are being filmed all the time. I think it's concerning that we are getting more products with cameras. I mean, if every house and every place of business has a camera we basically end up with a privatized surveillance state.",
          "score": 1,
          "created_utc": 1749141031.0,
          "replies": []
        },
        {
          "id": "mw4bqaw",
          "author": "baumpop",
          "body": "Yeah they’re spying on customers in broad daylight guys. Totally above board. ",
          "score": -4,
          "created_utc": 1749124562.0,
          "replies": []
        },
        {
          "id": "mw4b63v",
          "author": "latortillablanca",
          "body": "how can you be so close and yet so so far",
          "score": -12,
          "created_utc": 1749124336.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw45ed6",
      "author": "0xSnib",
      "body": "This content is no longer avaliable.",
      "score": 295,
      "created_utc": 1749121848.0,
      "replies": [
        {
          "id": "mw48gc5",
          "author": "kickin-chicken",
          "body": "Yea I’ve already got some WYZE cams and need to replace a driveway bulb and have wanted a driveway cam. So this will be going right in the cart.",
          "score": 62,
          "created_utc": 1749123200.0,
          "replies": []
        },
        {
          "id": "mw4i49b",
          "author": "murdacai999",
          "body": "They make a 3rd part accessory that goes between a regular bulb and the socket, and provides the USB to plug in a regular wyze camera. Wyze Lamp Socket Power Adapter\n\n\nThis current product, the bulb cam, sounds terrible to me. If the bulb dies you need to spend another 50 bux for a new camera?",
          "score": 22,
          "created_utc": 1749127018.0,
          "replies": [
            {
              "id": "mw56j02",
              "author": "Moscato359",
              "body": "I assume it has a warranty",
              "score": 1,
              "created_utc": 1749134870.0,
              "replies": [
                {
                  "id": "mw5s7ps",
                  "author": "IronFrogger",
                  "body": "Yes the warranty period will end just short of the average life of a bulb. Also, in the fine print, it will say \"can't be placed upside down\" like in the demo photo. ",
                  "score": 4,
                  "created_utc": 1749141069.0,
                  "replies": [
                    {
                      "id": "mw5ug78",
                      "author": "euph_22",
                      "body": "But that rules out the vast majority of light fixtures.",
                      "score": 2,
                      "created_utc": 1749141706.0,
                      "replies": [
                        {
                          "id": "mw5uy6p",
                          "author": "IronFrogger",
                          "body": "That's the joke. But on a serious note, you'll find a lot of LEDs are not rated for hanging upside down, or in enclosed spaces. ",
                          "score": 6,
                          "created_utc": 1749141848.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mw6g9qx",
              "author": "pancak3d",
              "body": "It's fully cable and mount free, so there are some advantages. \n\nNiche product for sure. The e-waste element for dead LED is criminal.",
              "score": 1,
              "created_utc": 1749147808.0,
              "replies": []
            },
            {
              "id": "mwfr051",
              "author": "silenc3x",
              "body": "No, they sell bulbs for $17\n\n  \n[https://www.wyze.com/products/wyze-accessory-bulb](https://www.wyze.com/products/wyze-accessory-bulb)",
              "score": 1,
              "created_utc": 1749269123.0,
              "replies": [
                {
                  "id": "mwfrcik",
                  "author": "murdacai999",
                  "body": "The accessory bulb isn't the same as the bulb attached to the camera.. it's just an additional bulb that can be made to turn on when the camera detects movement",
                  "score": 1,
                  "created_utc": 1749269278.0,
                  "replies": [
                    {
                      "id": "mwfrr1v",
                      "author": "silenc3x",
                      "body": "Oh yeah you're right. I thought it just popped over that. They claim 25k hours/8.5 years on the bulb cam life. Wonder how accurate that would be.",
                      "score": 1,
                      "created_utc": 1749269462.0,
                      "replies": [
                        {
                          "id": "mwfy9bx",
                          "author": "murdacai999",
                          "body": "I personally like to leave my outdoor lights on, to keep the driveway well lit. So roughly 3 years of use if that's accurate",
                          "score": 2,
                          "created_utc": 1749272582.0,
                          "replies": [
                            {
                              "id": "mwfzp0v",
                              "author": "silenc3x",
                              "body": "If I can set a schedule with Google Assistant on the bulb separately I would just have it come on at sunset, turn off at sunrise. 4k hours a year. I don't want it on all the time, or motion activated. Interested to see if I can make that happen. As a renter it's worth it to me. Otherwise I'd just get the wyze bulb socket wire alongside a normal smart bulb and use a Cam v3/v4. This is just a bit easier in terms of setup and installation.",
                              "score": 1,
                              "created_utc": 1749273311.0,
                              "replies": [
                                {
                                  "id": "mwh85tl",
                                  "author": "murdacai999",
                                  "body": "Good idea. I'm sure it's possible to schedule it to come on/ off dusk/dawn. Would def increase it's longevity",
                                  "score": 1,
                                  "created_utc": 1749298513.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mw5i2qd",
          "author": "worksafe_Joe",
          "body": "I don't rent, I own. I just can't be bothered to run a cable.",
          "score": 4,
          "created_utc": 1749138165.0,
          "replies": []
        },
        {
          "id": "mw4n4v1",
          "author": "ShitPostsRuinReddit",
          "body": "I have a doorbell camera that has a rechargeable batter. It lasts about 2 months a charge and i bring it in for a night to recharge. I like this one since it just stores the data locally and doesn't need a subscription:https://www.amazon.com/XTU-Doorbell-Subscription-Detection-Assistant/dp/B0D1MHKVQC/",
          "score": 1,
          "created_utc": 1749128795.0,
          "replies": []
        },
        {
          "id": "mw6nn2k",
          "author": "ScientiaProtestas",
          "body": "There are a lot of cameras that screw into a light bulb socket.  So you have many choices.  Just search for light bulb camera.\n\nMost don't have a separate light.  If you want it to still work as a light, you can use the built-in LEDs of the camera, which will be directional.\n\nBut there are some that have a 360 degree light.\n\nhttps://www.amazon.com/Security-2-4GHz-Security-Wireless-Detection-Tracking/dp/B0DB17FR52\n\nhttps://www.amazon.com/JUFLSKY-Security-Cameras-Lightbulb-Detection/dp/B0F32RCKSF",
          "score": 1,
          "created_utc": 1749149919.0,
          "replies": [
            {
              "id": "mw6wk44",
              "author": "FlattenInnerTube",
              "body": "The fractured English on these....eeek",
              "score": 1,
              "created_utc": 1749152478.0,
              "replies": [
                {
                  "id": "mwa45s3",
                  "author": "0xSnib",
                  "body": "This content is no longer avaliable.",
                  "score": 3,
                  "created_utc": 1749196565.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mw4geya",
          "author": "talex365",
          "body": "WiFi enabled solar powered cameras are a thing",
          "score": -7,
          "created_utc": 1749126384.0,
          "replies": [
            {
              "id": "mw4iub5",
              "author": "Curious_Party_4683",
              "body": "those are not reliable. especially on sunny days or the side of the house with shades.  wired connection are always the best option",
              "score": 11,
              "created_utc": 1749127281.0,
              "replies": []
            },
            {
              "id": "mw4hlmz",
              "author": "0xSnib",
              "body": "This content is no longer avaliable.",
              "score": 19,
              "created_utc": 1749126825.0,
              "replies": [
                {
                  "id": "mw4rml7",
                  "author": "algaefied_creek",
                  "body": "Solar power works through clouds, as does sunburn. Though it's England so one must instead assume the sun hits the clouds and is scattered by a shriek of \"God Save The King from UV\" as the land is plunged into darkness, rain, fog, and sleet. ",
                  "score": 1,
                  "created_utc": 1749130302.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mw4ef5c",
      "author": "Riversntallbuildings",
      "body": "The concept is fine, in fact it’s a brilliant way to get power without running new wires. Fun fact, originally, all appliances screwed into light sockets, because lighting was the first commercial use of electricity. \n\nWhat I hate is the design. Make design a bit more elegant. A domed 360 camera, or even a small enclosed camera that rotates inside is way better than those ugly cubes hanging off the light. WTH.",
      "score": 34,
      "created_utc": 1749125625.0,
      "replies": [
        {
          "id": "mw62gjj",
          "author": "Butt_Face2000",
          "body": "I'm guessing they skipped a motorized version due to cost. The telescopic extension is pretty smart because you have to get the camera to extend outside of the glass of whatever light you are putting it in. A set height, domed camera wouldn't solve this problem and would be useless in a light enclosure.",
          "score": 6,
          "created_utc": 1749143939.0,
          "replies": [
            {
              "id": "mw7t3v3",
              "author": "Riversntallbuildings",
              "body": "Ahhh, valid points. \n\nHowever, I could see an even better design for those more industrial flood light bulbs. They’re not really decorative, but they could essentially put a camera in the middle and an LED ring light around the outside. Hahaha",
              "score": 1,
              "created_utc": 1749162047.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mw45m6w",
      "author": "dougms",
      "body": "I’ve actually been looking for either a lightbulb socket either a usb output or this, for above my garage, so I can put in a camera, out front. \n\nMight actually unironically look into this",
      "score": 42,
      "created_utc": 1749121946.0,
      "replies": [
        {
          "id": "mw46d0f",
          "author": "whewtang",
          "body": "You can buy bulb socket adapters for less than $5. Bulb to usb or a power outlet. \n\nAlso, two wire pigtails if you need to hand wire something to it.",
          "score": 9,
          "created_utc": 1749122284.0,
          "replies": [
            {
              "id": "mw49hyc",
              "author": "Leper17",
              "body": "Those socket adapters are a fucking nightmare. For a camera, should be fine, but most sockets are rated for 100w max power draw. Which is less than 1 amp at 120v. I’ve come across a lot of melted ones",
              "score": 14,
              "created_utc": 1749123645.0,
              "replies": [
                {
                  "id": "mw4ho5w",
                  "author": "whewtang",
                  "body": "Good point.",
                  "score": 4,
                  "created_utc": 1749126851.0,
                  "replies": [
                    {
                      "id": "mw4n1di",
                      "author": "Leper17",
                      "body": "They should and maybe the adapter is rated higher, but standard A19 base light bulbs max out at like 150W and most fixtures aren’t even rated for that. The majority of residential light sockets are rated at 60w max because they’re only supposed to run a light bulb. Most of the melted ones I come across are people plugging in the block heater of their car which pulls from 6-12 amps depending on the vehicle",
                      "score": 3,
                      "created_utc": 1749128761.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mw475d8",
              "author": "dougms",
              "body": "I swear a couple years ago, I looked for these and couldn’t find them. You’re right though. I see a ton now that I look again",
              "score": 2,
              "created_utc": 1749122631.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mw4elv8",
          "author": "sump_daddy",
          "body": "Unironically this is a product that has existed for years from many major brands.",
          "score": 1,
          "created_utc": 1749125697.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw4eurw",
      "author": "xultar",
      "body": "This is great for a garage or a basement.",
      "score": 5,
      "created_utc": 1749125791.0,
      "replies": []
    },
    {
      "id": "mw46vjj",
      "author": "Illdoitnator",
      "body": "While I don't agree with it being a terrible idea. This is not a new idea like people seem to think or are implying. ",
      "score": 5,
      "created_utc": 1749122511.0,
      "replies": [
        {
          "id": "mw4biib",
          "author": "aircooledJenkins",
          "body": "You're right, this is not a new idea. Friend of mine had a light bulb camera on his front porch at least 7 years ago.",
          "score": 2,
          "created_utc": 1749124475.0,
          "replies": []
        },
        {
          "id": "mw4ams5",
          "author": "None",
          "body": "Explain why you think this?",
          "score": -6,
          "created_utc": 1749124120.0,
          "replies": [
            {
              "id": "mw4e8h5",
              "author": "sump_daddy",
              "body": "Because at least five popular brands in the USA (and more in the rest of world) already sell this product and its YEARS old at this point?  People acting like Wyze is some sort of creepy trailblazer are really really odd, they are just copying an already successful product.",
              "score": 6,
              "created_utc": 1749125552.0,
              "replies": [
                {
                  "id": "mw4eqok",
                  "author": "None",
                  "body": "I don't see people acting like itt but it doesn't really matter..... Why not link those years old products? I think options are good",
                  "score": -1,
                  "created_utc": 1749125747.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mw4d3y9",
              "author": "Jewrisprudent",
              "body": "Because it’s literally just a clearly visible camera attached to a light. Nothing is hidden here, the only potentially unique bit is that it fits into a light bulb socket. But in terms of combining a camera with a light this is no different than a lot of outdoor cameras like Ring etc.",
              "score": 2,
              "created_utc": 1749125110.0,
              "replies": [
                {
                  "id": "mw4edlx",
                  "author": "None",
                  "body": "I don't think it's marketed as hidden but alas I believe u/illdoitnator can answer for themselves.  Thank you for the down vote",
                  "score": -3,
                  "created_utc": 1749125608.0,
                  "replies": [
                    {
                      "id": "mw4ej0w",
                      "author": "Jewrisprudent",
                      "body": "I didn’t downvote you, your insecurity is showing. (Maybe you need a better security camera, I know where you can find one that screws into a light bulb socket.)",
                      "score": 4,
                      "created_utc": 1749125666.0,
                      "replies": [
                        {
                          "id": "mw4ewjm",
                          "author": "None",
                          "body": "I think it's neat you complained about a feature it was never marketed it as.",
                          "score": -1,
                          "created_utc": 1749125810.0,
                          "replies": [
                            {
                              "id": "mw4ezmc",
                              "author": "Jewrisprudent",
                              "body": "I didn’t complain anywhere, what are you talking about? I just explained why this isn’t some unique new product that should concern anyone from a privacy/spying standpoint like the headline implies. It’s like you’re having some imaginary interaction with me.",
                              "score": 3,
                              "created_utc": 1749125843.0,
                              "replies": [
                                {
                                  "id": "mw4gpb4",
                                  "author": "None",
                                  "body": "You did. \n\n\nThanks for the down vote",
                                  "score": 0,
                                  "created_utc": 1749126491.0,
                                  "replies": [
                                    {
                                      "id": "mw4h2kw",
                                      "author": "None",
                                      "body": "[removed]",
                                      "score": 5,
                                      "created_utc": 1749126628.0,
                                      "replies": [
                                        {
                                          "id": "mw4i1r4",
                                          "author": "None",
                                          "body": "Speaking of insecurities showing, but I actually did not thank you. \n\n\nYou say focus on what's in the article but the product in the article isn't marketed as a hidden camera, yet that's exactly the irrelevant aspect you decided to talk about.",
                                          "score": 1,
                                          "created_utc": 1749126992.0,
                                          "replies": [
                                            {
                                              "id": "mw4i4r5",
                                              "author": "Jewrisprudent",
                                              "body": "Neat.",
                                              "score": 2,
                                              "created_utc": 1749127024.0,
                                              "replies": [
                                                {
                                                  "id": "mw4jn75",
                                                  "author": "None",
                                                  "body": "Is this that meaningful contribution you spoke of?",
                                                  "score": -1,
                                                  "created_utc": 1749127572.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mw4407p",
      "author": "Cryptshadow",
      "body": "Some one could just unscrew it and steal it right?",
      "score": 12,
      "created_utc": 1749121199.0,
      "replies": [
        {
          "id": "mw461kd",
          "author": "Drink15",
          "body": "They can unscrew any camera and steal it",
          "score": 55,
          "created_utc": 1749122141.0,
          "replies": [
            {
              "id": "mw4ffgl",
              "author": "chth",
              "body": "Not me at the mall jewelry kiosk while my girlfriend gets a new septum piercing looking at how every camera has an easy to remove USB C cable and calculating the blindspots to make an optimal heist.",
              "score": 7,
              "created_utc": 1749126009.0,
              "replies": [
                {
                  "id": "mw56fsj",
                  "author": "Drink15",
                  "body": "That’s what everyone does on that situation. You just need a team of people with different skill sets just for one of them to double cross you and you later reveal it was the girlfriend the actually robbed the place.",
                  "score": 1,
                  "created_utc": 1749134845.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mw4uuya",
              "author": "finakechi",
              "body": "True, but this is *way* easier and faster to do.",
              "score": 2,
              "created_utc": 1749131358.0,
              "replies": [
                {
                  "id": "mwdgym6",
                  "author": "TurboBerries",
                  "body": "Not if you put locktite in it",
                  "score": 1,
                  "created_utc": 1749239675.0,
                  "replies": []
                },
                {
                  "id": "mw4vugk",
                  "author": "Drink15",
                  "body": "Yeah but that also means it’s that much easier and faster to install.",
                  "score": 1,
                  "created_utc": 1749131671.0,
                  "replies": [
                    {
                      "id": "mw4w39y",
                      "author": "finakechi",
                      "body": "I'm not arguing against them being useful.\n\nI'm just say it is a legitimate thing to consider when purchasing them.",
                      "score": 1,
                      "created_utc": 1749131748.0,
                      "replies": [
                        {
                          "id": "mw50x5s",
                          "author": "Drink15",
                          "body": "I get it but it’s a there is a balance between security inconvenience. This maximized convenience over security which lots of people prefer or need, but there are other options if anyone wants security over convenience. It all depends on the situation.\n\nThis is great for rentals or if the light fixture isn’t in an easily reachable place.",
                          "score": 3,
                          "created_utc": 1749133232.0,
                          "replies": [
                            {
                              "id": "mw51m49",
                              "author": "finakechi",
                              "body": "I totally agree, I just think it should be something people think about.\n\n\nThere's plenty of fixtures that would be too high for people to reasonable remove, and plenty of spots inside that this would be useful as well.",
                              "score": 1,
                              "created_utc": 1749133436.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mw44qtl",
          "author": "nof",
          "body": "If only there was a way to see who did it and when.",
          "score": 41,
          "created_utc": 1749121547.0,
          "replies": [
            {
              "id": "mw457em",
              "author": "Cryptshadow",
              "body": "Iyou could, but you'd still be out a camera and a light bulb.",
              "score": -18,
              "created_utc": 1749121760.0,
              "replies": [
                {
                  "id": "mw466e9",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 3,
                  "created_utc": 1749122203.0,
                  "replies": [
                    {
                      "id": "mw47ahq",
                      "author": "honicthesedgehog",
                      "body": "Which insurance, homeowners? Idk how much this thing is supposed to cost, but I seriously doubt that it’s worth filing a homeowners claim over.",
                      "score": 11,
                      "created_utc": 1749122692.0,
                      "replies": []
                    },
                    {
                      "id": "mw4baj9",
                      "author": "dahliasinfelle",
                      "body": ".... It's $50 , nobody's filing an insurance claim over that",
                      "score": 8,
                      "created_utc": 1749124386.0,
                      "replies": []
                    },
                    {
                      "id": "mw4ckes",
                      "author": "justpostd",
                      "body": "Hello, is that the police? Somebody removed a $50 item that I left outside my house. I have footage of them doing it!\n\nCertainly sir, we'll prioritise that and start searching through CCTV footage immediately. With a bit of luck we'll have them arrested and through the court system with a modest fine within the year.\n\nExcellent. Will I get my item back?\n\nNo.\n\n[I'm only teasing, but you know what I mean]",
                      "score": 6,
                      "created_utc": 1749124895.0,
                      "replies": []
                    },
                    {
                      "id": "mw48xlz",
                      "author": "TheITMan19",
                      "body": "How much is this lightbulb? 10k? 🤣",
                      "score": 4,
                      "created_utc": 1749123407.0,
                      "replies": []
                    },
                    {
                      "id": "mw474nm",
                      "author": "AntiDECA",
                      "body": "You'd be a lunatic to file an insurance claim over a security camera. Your rate raise and deductible would be robbing you more than the thief. ",
                      "score": 8,
                      "created_utc": 1749122622.0,
                      "replies": []
                    },
                    {
                      "id": "mw4chra",
                      "author": "FartMongersRevenge",
                      "body": "The police don’t care.",
                      "score": 3,
                      "created_utc": 1749124864.0,
                      "replies": []
                    },
                    {
                      "id": "mw4iapr",
                      "author": "devilishycleverchap",
                      "body": "Yeah they'd be working in shifts to solve this one",
                      "score": 1,
                      "created_utc": 1749127085.0,
                      "replies": []
                    },
                    {
                      "id": "mw4dbmx",
                      "author": "zooberwask",
                      "body": "You're a child. No adult is filing a owners insurance claim for a $50 camera.",
                      "score": 0,
                      "created_utc": 1749125195.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mw46c6c",
          "author": "LakeStLouis",
          "body": "I have a wireless Ring video doorbell. It's literally stuck to the bricks near the front door with Velcro Command Strips. Anyone could walk up and just pull it off the wall without effort or damage. It amuses me.",
          "score": 15,
          "created_utc": 1749122273.0,
          "replies": [
            {
              "id": "mw4ek37",
              "author": "MyrddinSidhe",
              "body": "You could always watch them drive off, head across town, get home, and then turn on the mic. “Have you checked on the children?”",
              "score": -3,
              "created_utc": 1749125678.0,
              "replies": [
                {
                  "id": "mw4fakq",
                  "author": "AK_Sole",
                  "body": "Can you share with us which provider offers this incredible internet connection that reaches across town?",
                  "score": 4,
                  "created_utc": 1749125958.0,
                  "replies": [
                    {
                      "id": "mw4lzj4",
                      "author": "MyrddinSidhe",
                      "body": "Shh… let the joke live in your imagination.",
                      "score": 0,
                      "created_utc": 1749128397.0,
                      "replies": []
                    },
                    {
                      "id": "mw4nl6k",
                      "author": "LakeStLouis",
                      "body": "Yeah, I was just going to let it slide. But the cam has to be connected to my WiFi. It will record everything on the web until it's out of that range, but that's it. Though if someone else tries to reset it or connect it the internet, it can be tracked.  \n\nAside from that, I've done some cam reviews, so I have a plethora of both Ring and Wyze cams sent to me for review. By the time someone reaches my doorbell, they've already been recorded on 6 other cameras.  \n\nParanoia is interesting.",
                      "score": 0,
                      "created_utc": 1749128949.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mw44uxk",
      "author": "DDFoster96",
      "body": "DIY adult film making kit. Just install in your bedroom light.",
      "score": 7,
      "created_utc": 1749121600.0,
      "replies": [
        {
          "id": "mw46io3",
          "author": "stedun",
          "body": "It’s for my OnlyBulbs !",
          "score": 7,
          "created_utc": 1749122353.0,
          "replies": [
            {
              "id": "mw4dfx5",
              "author": "Starfox-sf",
              "body": "E26 Screw",
              "score": 3,
              "created_utc": 1749125242.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mw4eihr",
          "author": "sump_daddy",
          "body": "Do you have eyeballs? Its not inconspicuous at ALL, in fact in the realm of bulb cameras, they went out of their way to make it look exactly like a camera bolted onto a light.  No one would look at this and think they have privacy.",
          "score": 3,
          "created_utc": 1749125661.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw41nh4",
      "author": "JimmiJimJimmiJimJim",
      "body": "Here.\nLet me help.\n\nIt's terrible.",
      "score": 26,
      "created_utc": 1749120078.0,
      "replies": []
    },
    {
      "id": "mw4avqm",
      "author": "anarchyx34",
      "body": "This is actually a very clever idea. I just wish Wyze had ONVIF support because their app sucks.",
      "score": 2,
      "created_utc": 1749124219.0,
      "replies": [
        {
          "id": "mw4gpnb",
          "author": "Catenane",
          "body": "Thingino",
          "score": 2,
          "created_utc": 1749126495.0,
          "replies": [
            {
              "id": "mw4j5s7",
              "author": "anarchyx34",
              "body": "Whoa.  Going to try this today thank you. 🙏",
              "score": 2,
              "created_utc": 1749127396.0,
              "replies": [
                {
                  "id": "mw4kjf3",
                  "author": "Catenane",
                  "body": "I bought a single wyze cam to test feasibility of stuff like this, as the cameras are good quality, but I don't trust wyze sketchware whatsoever. I previously played with wz mini hacks but it left a ton to be desired.\n\nIt never touched my network until it was on thingino and I will never make a wyze account or let any camera traffic out of my network whatsoever. Same reason my vacuum runs valetudo, and that was a prerequisite for me even buying the thing. And now I can ssh in to both my vacuum and camera and manage like any other box, lol. My prerequisite for most of this kind of stuff is that accounts never get made, and the device never touches the internet until it's running something I trust.",
                  "score": 1,
                  "created_utc": 1749127890.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mw6h5wc",
              "author": "pancak3d",
              "body": "The newest cameras aren't compatible, Wyze going out of their way to restrict 3rd party app access. Good option for older models though.",
              "score": 2,
              "created_utc": 1749148064.0,
              "replies": [
                {
                  "id": "mwbpeob",
                  "author": "Catenane",
                  "body": "Of course they are. Bah. Fuckem",
                  "score": 1,
                  "created_utc": 1749221125.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mw4e6n0",
      "author": "spacesaucesloth",
      "body": "is it ugly af? absolutely. but i love the idea honestly.",
      "score": 2,
      "created_utc": 1749125533.0,
      "replies": []
    },
    {
      "id": "mw4ecr1",
      "author": "antman1983",
      "body": "For some niche cases it's a good idea, if it works well.\nShould every bulb in the home have one? Probably not.\n\nTo make it properly 2025, they should add \"AI to it\". That way if it detects me wanking then it can din the lights a wee bit, get some atmosphere going.",
      "score": 2,
      "created_utc": 1749125599.0,
      "replies": [
        {
          "id": "mw4ha57",
          "author": "bolshoich",
          "body": "All that you need is a funky bass line, playing in the background.",
          "score": 1,
          "created_utc": 1749126706.0,
          "replies": []
        },
        {
          "id": "mw62qfr",
          "author": "Butt_Face2000",
          "body": "It's not meant for lights in your house.",
          "score": 1,
          "created_utc": 1749144014.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw4pw9d",
      "author": "RentalGore",
      "body": "It’s a pretty good idea, but looks really dumb.  They should’ve incorporated the camera into the housing.",
      "score": 2,
      "created_utc": 1749129725.0,
      "replies": [
        {
          "id": "mw62xtf",
          "author": "Butt_Face2000",
          "body": "They had to have an extension because cameras wouldn't be able to see anything if they are inside a glass enclosure for an outside light. Which is what this is intended for.",
          "score": 2,
          "created_utc": 1749144072.0,
          "replies": []
        },
        {
          "id": "mw6huj6",
          "author": "pancak3d",
          "body": "It's meant for places where you already have housing that you don't want to swap out",
          "score": 1,
          "created_utc": 1749148262.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw4zlyb",
      "author": "basec0m",
      "body": "Next morning: 10,000 motion alerts from moths",
      "score": 2,
      "created_utc": 1749132841.0,
      "replies": []
    },
    {
      "id": "mw9sxn6",
      "author": "Fufubear",
      "body": "Wyze has always impressed me with the wildly ingenious products they deliver.\n\nVacuum cleaner?  Sure - why not?  Make it cheap. \n\nDo I know if it works well?  No idea.. but I admire their tenacity at getting a good cheaper product on the market. \n\nLove their cameras, though!",
      "score": 2,
      "created_utc": 1749190135.0,
      "replies": []
    },
    {
      "id": "mw45z3n",
      "author": "Drink15",
      "body": "Good product for those that need something like this.",
      "score": 2,
      "created_utc": 1749122110.0,
      "replies": []
    },
    {
      "id": "mw48dhh",
      "author": "CodeAndBiscuits",
      "body": "I have literally no idea how to process this headline. Screw what? It's a light bulb with a camera. I wouldn't need it in a living room, but I would appreciate it in my exterior fixtures. One less power line to run would sure be nice. It's just a thing. Nothing to wring your hands over.",
      "score": 3,
      "created_utc": 1749123166.0,
      "replies": [
        {
          "id": "mw4a9vx",
          "author": "anarchyx34",
          "body": "“Screw it” as in screwing in a lightbulb.",
          "score": 1,
          "created_utc": 1749123970.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw4d87t",
      "author": "BernieMP",
      "body": "Isn't it funny how the top comments are full of people who coincidentally found exactly the product they were looking for?\n\nIf I was a conspiracy theorist I would say this post is an ad or just being astroturfed",
      "score": 4,
      "created_utc": 1749125156.0,
      "replies": [
        {
          "id": "mw4mk8n",
          "author": "ReelNerdyinFl",
          "body": "They had to repost it with a new article and bots. I had the top comment on another one bashing how wyze had terrible security and let anyone watch your cameras for years. \n\n#do not trust this company",
          "score": 3,
          "created_utc": 1749128596.0,
          "replies": []
        },
        {
          "id": "mw4x8cy",
          "author": "Scolor",
          "body": "Yes, even Wyze has a product that allows you to power their cameras with a socket. I think this is a fun new form factor but nothing groundbreakingly new enough for 6 people to be thrilled that their dream product has been released.",
          "score": 1,
          "created_utc": 1749132104.0,
          "replies": []
        },
        {
          "id": "mw4o373",
          "author": "quazywabbit",
          "body": "There is no conspiracy.  This is a Ad.",
          "score": 1,
          "created_utc": 1749129121.0,
          "replies": []
        },
        {
          "id": "mw547b0",
          "author": "HashMeOutside_",
          "body": "Has to be. the whole Wyze ecosystem has been horrible. No longer worth being a beta tester for its products. All one has to do is go to their forum here on Reddit.",
          "score": 1,
          "created_utc": 1749134198.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw4a95k",
      "author": "Grantsdale",
      "body": "This thing is definitely crazy, and great if you need a camera in a spot in a pinch. Not great to look at visually but I don’t know what else they could do.",
      "score": 1,
      "created_utc": 1749123962.0,
      "replies": []
    },
    {
      "id": "mw4imi4",
      "author": "Lil_Drake_Spotify",
      "body": "That was not a wyze decision by management",
      "score": 1,
      "created_utc": 1749127203.0,
      "replies": []
    },
    {
      "id": "mw4mvhl",
      "author": "Roid-a-holic_ReX",
      "body": "How’s Wyze as an overall brand? I didn’t know they existed until now and it looks like they make pretty much everything smart home. I’ve been slowing buying smart home stuff since I got my place 2 years ago but none of it is in one Eco system. I have ecobee thermostat and door bell smart switches from Costco a couple eufy products and Govee track lights. It’d be nice to get all of the automation centralized in one app.",
      "score": 1,
      "created_utc": 1749128705.0,
      "replies": [
        {
          "id": "mw4zjku",
          "author": "E6350",
          "body": "Good stuff, the picture is good, and they are made well.",
          "score": 1,
          "created_utc": 1749132821.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw4qjfu",
      "author": "Infamous-Future6906",
      "body": "It’s terrible",
      "score": 1,
      "created_utc": 1749129940.0,
      "replies": []
    },
    {
      "id": "mw4vbwh",
      "author": "Adelu1219",
      "body": "Just got one",
      "score": 1,
      "created_utc": 1749131507.0,
      "replies": []
    },
    {
      "id": "mw5355v",
      "author": "VVynn",
      "body": "I wish I could hijack its cloud storage to instead write to my existing NVR.",
      "score": 1,
      "created_utc": 1749133884.0,
      "replies": []
    },
    {
      "id": "mw53qkn",
      "author": "SmartBookkeeper6571",
      "body": "Definitely a lot better than that smart bulb older thing they sold that you plug your camera into. I like it.",
      "score": 1,
      "created_utc": 1749134059.0,
      "replies": []
    },
    {
      "id": "mw5byma",
      "author": "Feral_Nerd_22",
      "body": "This actually has a good use case for garage door lights, plus a lot of people don't have a timer on their lights and I assume this lets you shut off the lights at different times.",
      "score": 1,
      "created_utc": 1749136430.0,
      "replies": []
    },
    {
      "id": "mw5mtpy",
      "author": "bucktron6040",
      "body": "Already got one and it’s good so far. Only problem is turning on the light as a reminder that the cat is outside is no longer possible.",
      "score": 1,
      "created_utc": 1749139519.0,
      "replies": []
    },
    {
      "id": "mw6g6cs",
      "author": "correctingStupid",
      "body": "Good idea because combining a power source is what what lot of people need outdoors. ",
      "score": 1,
      "created_utc": 1749147781.0,
      "replies": []
    },
    {
      "id": "mw6gllt",
      "author": "Underwater_Karma",
      "body": "The idea is sound, the execution is hideous",
      "score": 1,
      "created_utc": 1749147902.0,
      "replies": []
    },
    {
      "id": "mw6hf38",
      "author": "PeanutBubbah",
      "body": "I’ve seen smart bulbs with ports for other IoT crap, so it’s not unheard of. It helps bring “smart” stuff to places with no outlets. Batteries are a hassle. However, I’m distancing myself from the locked down ecosystems and moving towards open source.",
      "score": 1,
      "created_utc": 1749148138.0,
      "replies": []
    },
    {
      "id": "mw6q8bi",
      "author": "Kruxf",
      "body": "This isn’t even knew tech? Light bulb cameras have existed for years.",
      "score": 1,
      "created_utc": 1749150666.0,
      "replies": []
    },
    {
      "id": "mw7rqzj",
      "author": "Kellic",
      "body": "Don't buy Wyze's insecure crap.",
      "score": 1,
      "created_utc": 1749161594.0,
      "replies": []
    },
    {
      "id": "mw7rymn",
      "author": "ngc-arb",
      "body": "This is what real bravery looks like. Bravo Waze.",
      "score": 1,
      "created_utc": 1749161663.0,
      "replies": []
    },
    {
      "id": "mw7togk",
      "author": "intellifone",
      "body": "Great idea. Ugly as sin",
      "score": 1,
      "created_utc": 1749162236.0,
      "replies": []
    },
    {
      "id": "mw7ybot",
      "author": "funkybosss",
      "body": "Screw it… I see what you did there ;)",
      "score": 1,
      "created_utc": 1749163807.0,
      "replies": []
    },
    {
      "id": "mw9nueo",
      "author": "Agro_Crag",
      "body": "I think we need a healthy resistance to this kind of thing.",
      "score": 1,
      "created_utc": 1749187484.0,
      "replies": []
    },
    {
      "id": "n46nj20",
      "author": "PhilosophyHelpful745",
      "body": "Wyze should squash this whole idea and make a Light Fixture with a security cam inside,something you can't simply unscrew to remove",
      "score": 1,
      "created_utc": 1753027246.0,
      "replies": []
    },
    {
      "id": "mw4249v",
      "author": "TheHumanPickleRick",
      "body": "Why does a light bulb need a camera? What is a canera going to do to help illuminate dark spaces? This just seems invasive and another way for companies to get cameras and microphones into households to eavesdrop on people.",
      "score": -8,
      "created_utc": 1749120305.0,
      "replies": [
        {
          "id": "mw42u3z",
          "author": "smarterthanyoda",
          "body": "I think the question is, what’s the easiest way to install a security camera without adding wiring?\n\nThe camera here is hardly hidden. It’s as big as the bulb itself. This is just a security camera you can screw into a light fixture.",
          "score": 76,
          "created_utc": 1749120648.0,
          "replies": [
            {
              "id": "mw453wf",
              "author": "None",
              "body": "Anyone who doesn't understand this has never needed to worry about installing cameras in a rental and getting their bond/deposit back.",
              "score": 35,
              "created_utc": 1749121716.0,
              "replies": []
            },
            {
              "id": "mw43wfv",
              "author": "fairportmtg1",
              "body": "The downside is someone can easily unscrew your camera",
              "score": -5,
              "created_utc": 1749121150.0,
              "replies": [
                {
                  "id": "mw45n19",
                  "author": "tolomea",
                  "body": "The video of them doing that should already be on its way to the cloud",
                  "score": 10,
                  "created_utc": 1749121957.0,
                  "replies": [
                    {
                      "id": "mw4m7l9",
                      "author": "fairportmtg1",
                      "body": "That's fine but that doesn't save your expensive camera from being destroyed or stolen ($50 isn't crazy but it's not cheap either)",
                      "score": 1,
                      "created_utc": 1749128475.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mw4az6a",
                  "author": "CrapoCrapo25",
                  "body": "The upside is 99.9765% of the people don't know about the camera.",
                  "score": 1,
                  "created_utc": 1749124258.0,
                  "replies": [
                    {
                      "id": "mw4deza",
                      "author": "Jewrisprudent",
                      "body": "Have you looked at the product? You can probably spot the camera from 100 feet away it’s not remotely hidden. It’s literally a light with a pretty large camera attached at the bottom.",
                      "score": 2,
                      "created_utc": 1749125231.0,
                      "replies": [
                        {
                          "id": "mw5h9ra",
                          "author": "CrapoCrapo25",
                          "body": "I sure did. \nAsk how many people see the cams on  highway poles. Ask how many people see cameras at streetlights. \nPeople don't see cameras all the time.",
                          "score": 1,
                          "created_utc": 1749137938.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mw4kx4t",
                      "author": "fairportmtg1",
                      "body": "I'm not saying people are 100% gonna steal your camera and I appreciate they are trying to make a product that does solve a problem and give people a cheaper DIY option. \n\nHonestly door bell cameras aren't hard to steal either.\n\nI'm just pointing out of the light is within arms reach (many porch lights are) then it can be stolen as easily as you can install it.\n\nI do give you way too many people probably wouldn't even think \"I can probably just unscrew that\"",
                      "score": 1,
                      "created_utc": 1749128023.0,
                      "replies": [
                        {
                          "id": "mw5ho4i",
                          "author": "CrapoCrapo25",
                          "body": "It's too late when the reach for it unless its stored on the camera.",
                          "score": 1,
                          "created_utc": 1749138051.0,
                          "replies": [
                            {
                              "id": "mw5mv94",
                              "author": "fairportmtg1",
                              "body": "That's not my point, my point is while it is easy for the average person to install it's also easy to have someone remove it (be it for theft or just to be a vandel. \n\nPolice probably won't do much even if the person had no mask on. Will it happen a lot? Probably not but it's still a negative",
                              "score": 1,
                              "created_utc": 1749139531.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mw43xnc",
              "author": "None",
              "body": "Who are you trying to be secure from? If security is your goal, I don’t think bringing wyze products into your house is a good idea.",
              "score": -9,
              "created_utc": 1749121166.0,
              "replies": [
                {
                  "id": "mw46upw",
                  "author": "schuylkilladelphia",
                  "body": "It's an exterior camera...",
                  "score": 9,
                  "created_utc": 1749122501.0,
                  "replies": [
                    {
                      "id": "mw47eg7",
                      "author": "None",
                      "body": "This is what they want to you think. But the danger is, It’s on your network, with all of your other devices. Phone laptops Nintendo INSIDE cameras, security systems, medical devices, everything. Is everything you own hardened against a device ON your network? That you have the network password to?",
                      "score": -9,
                      "created_utc": 1749122740.0,
                      "replies": [
                        {
                          "id": "mw4862d",
                          "author": "parkmarkspark",
                          "body": "I, too, wear tinfoil",
                          "score": 9,
                          "created_utc": 1749123076.0,
                          "replies": []
                        },
                        {
                          "id": "mw4dwmz",
                          "author": "schuylkilladelphia",
                          "body": "...who is the \"they\" in this fantasy?  Wyze? The US government? Aliens?",
                          "score": 2,
                          "created_utc": 1749125425.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mw4a2r0",
              "author": "mildly_houseplant",
              "body": "If you pitched it like that (\"we've created a security camera that can be held by and powered by an outdoor lightbulb socket, and even better, it also still acts like a lightbulb!\"), the story would be way less dramatic-sounding.",
              "score": -3,
              "created_utc": 1749123890.0,
              "replies": [
                {
                  "id": "mw4adqg",
                  "author": "smarterthanyoda",
                  "body": "That is how [Wyze sells it](https://www.wyze.com/products/wyze-bulb-cam?irclickid=TC13oAzyVxycW5511VVp9Qz9UksQGj251yiDTE0&utm_source=Vox%20Media&utm_medium=impact&utm_campaign=27209&utm_content=Online%20Tracking%20Link&nb_platform=impact&nb_adid=2137862&nb_cid=27209&nb_pid=482924&nb_aname=Online%20Tracking%20Link&nb_atype=ONLINE_TRACKING_LINK&nb_asize=&nb_product_sku=&nb_partner_name=Vox%20Media&nb_mtype=mediapartner&nb_partner_shared_id=&irgwc=1). The drama was added by Gizmodo.",
                  "score": 8,
                  "created_utc": 1749124016.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mw42yzh",
          "author": "Scyth3",
          "body": "This solves the entire \"I need to run a wire to run my outdoor camera\" situation.  It also solves the problem for those that don't want a video doorbell.\n\nHonestly it's probably one of the few original thoughts in the smart home space in quite a few years.  If it's anything like their floodlights, it'll turn the light on when the camera detects a human/vehicle/etc.  That'll lead to less false positive motion light events which is nice.",
          "score": 27,
          "created_utc": 1749120712.0,
          "replies": []
        },
        {
          "id": "mw45ut1",
          "author": "wvraven",
          "body": "I'm looking at these because I have a dog I want to keep an eye on while I'm working if she's outside.  Battery cameras don't offer live streaming and I live in a 125 year old brick house that would cost a fortune to run wiring in.   It's a perfect fit for my needs of it works well.",
          "score": 6,
          "created_utc": 1749122056.0,
          "replies": [
            {
              "id": "mw46cwg",
              "author": "TheHumanPickleRick",
              "body": "I think I got fixated on the words \"in your smart home\" and forgot that cameras can be used outside. I can see how this would be useful for outdoor surveillance in places like your house or in a barn to watch animals or something.",
              "score": 2,
              "created_utc": 1749122283.0,
              "replies": [
                {
                  "id": "mw49zrk",
                  "author": "donnerpartytaconight",
                  "body": "We have more cameras around the barn and animal pens than the house.\n\nIt saves me from going out when I misremember leaving a gate open, or the motion lights go on and I wondering if something is chewing things they shouldn't be, or to make sure all the stupid chickens got into the coop before the automatic door closed (and checking that the automatic door did close).\n\nThe motion lights with camera are great as well. Caught the neighbor kids being dumb kids and trying to do shit we got away with before cameras were everywhere.",
                  "score": 2,
                  "created_utc": 1749123854.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mw492u6",
          "author": "RhetoricalOrator",
          "body": "It's perfect for homes that have a porch light but do not have an accessible power receptacle where you could hook up a regular cam.",
          "score": 3,
          "created_utc": 1749123469.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw48air",
      "author": "m0fugga",
      "body": "Link for anyone who’s interested. \n\nhttps://www.wyze.com/products/wyze-bulb-cam?srsltid=AfmBOoo_kiWz7eAhyFnDpqKxf5tNY2DuIDiDau6AIdR41TzUuAUFtB1C",
      "score": 1,
      "created_utc": 1749123130.0,
      "replies": []
    },
    {
      "id": "mw4d1nr",
      "author": "tyko2000",
      "body": "Probably a different Wyze product, but there's already an outdoor floodlight/camera combo you can install over your current door light they sell. Works great, takes like five minutes to set up. Turn off the breaker to the light before you install though, don't ask me how I know lol",
      "score": 0,
      "created_utc": 1749125084.0,
      "replies": []
    },
    {
      "id": "mw65hhu",
      "author": "Suz9006",
      "body": "And guarantee they will charge you a fortune if you want to see any video from it.  I had their cameras from early on, but now of you don’t pay a monthly fee you get garbage.   I would never buy another thing from them.",
      "score": 0,
      "created_utc": 1749144776.0,
      "replies": []
    },
    {
      "id": "mw4atwh",
      "author": "Frostymagnum",
      "body": "You could just not have a smart home. Weirdly, lightbulbs that dont have WiFi access are much cheaper",
      "score": -4,
      "created_utc": 1749124198.0,
      "replies": []
    },
    {
      "id": "mw43y3m",
      "author": "Jamie00003",
      "body": "Lmao it’s terrible. How does a big company like that even come to that conclusion?",
      "score": -13,
      "created_utc": 1749121172.0,
      "replies": []
    }
  ]
}