{
  "post": {
    "title": "Electronic armpit device uses plasma to make deodorant obsolete | A new device is claimed to prevent the stink without the use of deodorant, by killing those bacteria with plasma.",
    "author": "chrisdh79",
    "id": "1ldj2yy",
    "score": 2672,
    "created_utc": 1750154070.0,
    "selftext": "",
    "num_comments": 288,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ldj2yy/electronic_armpit_device_uses_plasma_to_make/"
  },
  "comments": [
    {
      "id": "my8ohtx",
      "author": "BoobaVera",
      "body": "This could be useful for people with allergies or other sensitivities. Also could reduce packaging waste in the environment.  That is, if the plasma treatment itself has no side effects.",
      "score": 832,
      "created_utc": 1750157014.0,
      "replies": [
        {
          "id": "my8s1hi",
          "author": "tiffanytrashcan",
          "body": "It's ozone. Yes, the concentrations needed for this (germicide) have side effects, that's why they are misnaming it and leaving half out.  \nThe plasma produces O³",
          "score": 568,
          "created_utc": 1750158690.0,
          "replies": [
            {
              "id": "my94gjp",
              "author": "arthurdentstowels",
              "body": "Can't wait for the O⁴ beta release, although armpit propulsion doesn't seem like a great use case.",
              "score": 255,
              "created_utc": 1750163801.0,
              "replies": [
                {
                  "id": "my9tfrt",
                  "author": "kamilo87",
                  "body": "This comment made me really laugh. Thanks!",
                  "score": 27,
                  "created_utc": 1750171812.0,
                  "replies": []
                },
                {
                  "id": "myd8nv0",
                  "author": "Cless_Aurion",
                  "body": "Humans have finally will achieve self propulsion flight!!",
                  "score": 10,
                  "created_utc": 1750208259.0,
                  "replies": []
                },
                {
                  "id": "mydgnb8",
                  "author": "CaptRon25",
                  "body": "Lol",
                  "score": 1,
                  "created_utc": 1750210987.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "my9go24",
              "author": "thisischemistry",
              "body": "It produces [reactive oxygen species](https://en.wikipedia.org/wiki/Reactive_oxygen_species):\n\n> the plasma in turn produces chemicals known as reactive oxygen species (ROS)\n\nThis includes stuff like:\n\n- hydroxyl radical\n- superoxide (O2^(-))\n- hydrogen peroxide \n- peroxynitrite \n- singlet oxygen",
              "score": 70,
              "created_utc": 1750167984.0,
              "replies": [
                {
                  "id": "my9lpdv",
                  "author": "Snacks612",
                  "body": "So these are free radicals?",
                  "score": 29,
                  "created_utc": 1750169547.0,
                  "replies": [
                    {
                      "id": "my9sv9t",
                      "author": "thisischemistry",
                      "body": "The hydroxyl radical is a free radical, the others are various energetic compounds of hydrogen, oxygen, and nitrogen.",
                      "score": 34,
                      "created_utc": 1750171649.0,
                      "replies": [
                        {
                          "id": "myalril",
                          "author": "SweetTea1000",
                          "body": "Does that mean safe or not safe?",
                          "score": 12,
                          "created_utc": 1750179790.0,
                          "replies": [
                            {
                              "id": "myato0w",
                              "author": "thisischemistry",
                              "body": "No, it can be safe. It’s like most things, how much exposure you have. Putting your face in it and breathing deep lungfuls wouldn’t be a good idea but a bit of skin contact probably isn’t bad. \n\nI’d like to see a health and safety study on possible long-term effects for proper use of the device but they probably aren’t very serious. After all, people use things like ammonia and chlorine bleach all the time and those are probably much worse for you than this product. Even the alcohol that people drink is probably worse, depending on how much and how often.",
                              "score": 42,
                              "created_utc": 1750181908.0,
                              "replies": [
                                {
                                  "id": "myeckjg",
                                  "author": "AllyButTired",
                                  "body": "Your sounding like the whole cellphone to your head or microwaves give you cancer",
                                  "score": -17,
                                  "created_utc": 1750223546.0,
                                  "replies": [
                                    {
                                      "id": "myfkuc9",
                                      "author": "thisischemistry",
                                      "body": "How so? I’m a chemist and I’m approaching this device in a fairly neutral and scientific manner. What have I said which is counter to that?",
                                      "score": 10,
                                      "created_utc": 1750247258.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "myg46md",
                                      "author": "Haunting_Bathroom505",
                                      "body": "We’re talking about the chemicals that the device produces via the plasma, not radio waves bud. Big difference.",
                                      "score": 5,
                                      "created_utc": 1750254131.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "myasn30",
                              "author": "DuckDatum",
                              "body": "Not that you’d want to eat it or anything, but if you did, then probably not safe.",
                              "score": 7,
                              "created_utc": 1750181630.0,
                              "replies": [
                                {
                                  "id": "mybo4w5",
                                  "author": "EatsFiber2RedditMore",
                                  "body": "No thank you I'll stick to eating my regular deodorant. Have a good day sir",
                                  "score": 22,
                                  "created_utc": 1750190463.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "myew163",
                          "author": "MarkZist",
                          "body": "Hydrogen peroxide wants nothing more than to turn into a pair of hydroxyl radicals, so for all intents and purposes it reacts like one.",
                          "score": 0,
                          "created_utc": 1750234309.0,
                          "replies": [
                            {
                              "id": "myfm3gg",
                              "author": "thisischemistry",
                              "body": "Under certain conditions it can form free radicals ([Fenton Reaction](https://en.wikipedia.org/wiki/Fenton%27s_reagent) with Fe2+) but it doesn’t always do that.",
                              "score": 1,
                              "created_utc": 1750247760.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mybno04",
                      "author": "McCheesing",
                      "body": "Free? That sounds awesome in this economy",
                      "score": 4,
                      "created_utc": 1750190333.0,
                      "replies": []
                    },
                    {
                      "id": "mycib35",
                      "author": "RushTfe",
                      "body": "This is important. I don't want to pay for my radicals",
                      "score": 2,
                      "created_utc": 1750199395.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "myat059",
                  "author": "Knotfrargu",
                  "body": "Is that good?",
                  "score": 2,
                  "created_utc": 1750181729.0,
                  "replies": [
                    {
                      "id": "myaufs4",
                      "author": "thisischemistry",
                      "body": "They will certainly remove odors and microorganisms. With low levels of exposure it’s not likely to cause damage to the skin but I’m not a healthcare professional so I couldn’t speak to possible long-term effects. I’d guess they aren’t a very high-risk thing, though.",
                      "score": 12,
                      "created_utc": 1750182115.0,
                      "replies": [
                        {
                          "id": "mycni5c",
                          "author": "Roid-a-holic_ReX",
                          "body": "Problem is that people obsess over hygiene. Most normal people will use it as needed and sparingly. Especially if warned. Some people out there will obsess over it and go crazy with it. If it leads to long term problems for a small portion of the population than it may not last long on the market.",
                          "score": 10,
                          "created_utc": 1750201091.0,
                          "replies": [
                            {
                              "id": "mycumyy",
                              "author": "willun",
                              "body": "Like the potato chips with Olestra. \n\nWorked as advertised but not good when someone eats two big bags of chips and all that oil has to go... somewhere.",
                              "score": 7,
                              "created_utc": 1750203418.0,
                              "replies": [
                                {
                                  "id": "mydofg9",
                                  "author": "Roid-a-holic_ReX",
                                  "body": "Yeah that’s a good example. Didn’t last long but also didn’t have super harmful effects. Really just a couple hours of discomfort.",
                                  "score": 4,
                                  "created_utc": 1750213645.0,
                                  "replies": []
                                },
                                {
                                  "id": "mygj9ih",
                                  "author": "thisischemistry",
                                  "body": "Right, for most people who eat reasonable quantities it was probably fine. There are some people who are more sensitive to it so they have to watch out for bad reactions.\n\nHell, even too much water can kill you! Many substances have quantities that are fairly safe, it's all about reasonable risks.",
                                  "score": 2,
                                  "created_utc": 1750258610.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "my8y1fq",
              "author": "alisnd89",
              "body": "i know many products produce ozone, like some air purifiers,  but is it within the safe levels.",
              "score": 26,
              "created_utc": 1750161300.0,
              "replies": [
                {
                  "id": "my9600f",
                  "author": "Small_Editor_3693",
                  "body": "There’s tons of people that have been harmed by those types of air purifiers by running them in enclosed spaces for too long",
                  "score": 48,
                  "created_utc": 1750164368.0,
                  "replies": [
                    {
                      "id": "my97fq2",
                      "author": "Tenchi2020",
                      "body": "We used to use ozone machines on used cars when we would take them in for trade, one car had a roach infestation so the mechanic left the ozone machine in it overnight running and it killed every roach",
                      "score": 58,
                      "created_utc": 1750164876.0,
                      "replies": [
                        {
                          "id": "my9idyz",
                          "author": "big_troublemaker",
                          "body": "That's exactly what you use ozone machines for\n. not necessarily killing roaches, but killing living organisms. Source: have one and use it to disinfect all sort of smelly stuff around home (helmets, boots, mattresses, cars etc) but with appropriate safety precautions - basically not inhaling ozone during or after treatment.",
                          "score": 41,
                          "created_utc": 1750168531.0,
                          "replies": [
                            {
                              "id": "my9wa2e",
                              "author": "thisischemistry",
                              "body": "It will also degrade surfaces such as plastic, rubber, leather, wood, metal, paper, cloth, and so on. Of course, it will kill organisms faster so it's a balance of how much you use it.",
                              "score": 27,
                              "created_utc": 1750172608.0,
                              "replies": [
                                {
                                  "id": "my9z8ik",
                                  "author": "big_troublemaker",
                                  "body": "Of course, but it's simply nature of things. Alcohol and other disinfectants also degrade surfaces. Do we also need to emphasise that washing clothes degrades fabrics (VERY quickly)? And using dishwasher deteriorates finishes and surfaces on your kitchenware?",
                                  "score": 20,
                                  "created_utc": 1750173443.0,
                                  "replies": [
                                    {
                                      "id": "mya2omh",
                                      "author": "thisischemistry",
                                      "body": "Sure, it's good to know the side effects of the things we use. That doesn't mean they are useless, just that you need to balance their effectiveness with their detriments.",
                                      "score": 6,
                                      "created_utc": 1750174412.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "mybapl7",
                                  "author": "Braddigan",
                                  "body": "This is often overlooked.  There are whole third-party product lines for cleaning CPAP machines with ozone but they also destroy the machine with use.  That part doesn't get mentioned unless it's in fine print.",
                                  "score": 6,
                                  "created_utc": 1750186630.0,
                                  "replies": [
                                    {
                                      "id": "myhqc62",
                                      "author": "tiffanytrashcan",
                                      "body": "Then the CPAP manufacturer gets blamed - for people going against the cleaning and care instructions.  \nI mean this is a preferable use case, cleaning an inanimate object VS your body, and there were still issues.",
                                      "score": 1,
                                      "created_utc": 1750270604.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "mya2h0w",
                                  "author": "notjordansime",
                                  "body": "Does it oxidize them?",
                                  "score": 1,
                                  "created_utc": 1750174350.0,
                                  "replies": [
                                    {
                                      "id": "mya4689",
                                      "author": "thisischemistry",
                                      "body": "It has various effects, oxidation is one of them. It also creates secondary compounds which break down things, such as acids, alcohols, ketones, and so on.",
                                      "score": 6,
                                      "created_utc": 1750174828.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "my921rb",
              "author": "Ashamed-Status-9668",
              "body": "It must produce a tiny amount of ozone. I can't imagine any sides would be more than what comes in contact with your armpit. I think they should rename it to the PitZone.",
              "score": 8,
              "created_utc": 1750162891.0,
              "replies": []
            },
            {
              "id": "myeg5b8",
              "author": "ryneches",
              "body": "Basically bleach, but in gas form.\n\nMostly, it's bad for mucus membranes. If they have a way to neutralize it before you can breathe it or get it in your eyes, this could actually be pretty cool. That would be a reason to buy a fancy gadget with fans and filters.",
              "score": 2,
              "created_utc": 1750225329.0,
              "replies": []
            }
          ]
        },
        {
          "id": "my9gy7g",
          "author": "rosen380",
          "body": "\"Also could reduce packaging waste in the environment\"\n\nI wonder what the environmental break-even is for a small electronic device versus the amount of packaging involved with deodorant.",
          "score": 17,
          "created_utc": 1750168074.0,
          "replies": [
            {
              "id": "myargfi",
              "author": "I_Automate",
              "body": "Well. Also the deodorant itself which needs to be manufactured and shipped",
              "score": 16,
              "created_utc": 1750181315.0,
              "replies": [
                {
                  "id": "myb6lat",
                  "author": "Svihelen",
                  "body": "You also need to harvest, synthesize, and ship the stuff the deodorant is made out of.",
                  "score": 7,
                  "created_utc": 1750185475.0,
                  "replies": [
                    {
                      "id": "myb8qhg",
                      "author": "I_Automate",
                      "body": "Yep.",
                      "score": 1,
                      "created_utc": 1750186079.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mycvsxx",
          "author": "atomic1fire",
          "body": "My guess is long term skin damage due to a loss in beneficial bacteria.",
          "score": 3,
          "created_utc": 1750203804.0,
          "replies": []
        },
        {
          "id": "mya11qx",
          "author": "reddit455",
          "body": "my friend uses an alum block. she's sensitive to fragrances and such. \n\nsame thing you rub on your face after you shave.\n\n  \nHow Does Crystal Deodorant Work and Does It Have Any Side Effects?\n\n[https://www.healthline.com/health/crystal-deodorant](https://www.healthline.com/health/crystal-deodorant)",
          "score": 5,
          "created_utc": 1750173954.0,
          "replies": []
        },
        {
          "id": "myb1xtz",
          "author": "xxxxxxxxxxxxxxxxxxZx",
          "body": " Brands like Native already solved this problem, without ozone or plasma.",
          "score": 2,
          "created_utc": 1750184165.0,
          "replies": []
        },
        {
          "id": "myx4j9c",
          "author": "SemperPutidus",
          "body": "It’s completely unnecessary. The same is accomplished with a simple iontophoresis device called DermaDry. <see username for qualifications>",
          "score": 1,
          "created_utc": 1750471412.0,
          "replies": []
        },
        {
          "id": "mz358ro",
          "author": "smatchimo",
          "body": "litterally the first 5 star review on light driven phone cleaners that literally NO ONE BUYS",
          "score": 1,
          "created_utc": 1750558337.0,
          "replies": []
        },
        {
          "id": "my8uzox",
          "author": "GlbdS",
          "body": ">This could be useful for people with allergies or other sensitivities.\n\nI feel like the size of the population that can't bear a simple hypoallergenic baby wipe is not that big",
          "score": -27,
          "created_utc": 1750160010.0,
          "replies": [
            {
              "id": "my8vhjj",
              "author": "Bigwhtdckn8",
              "body": "Hypoallergenic baby wipes aren't antibacterial. \n\nPeople can often have a reaction to the active ingredients in antiperspirants and antibacterial compounds.",
              "score": 20,
              "created_utc": 1750160223.0,
              "replies": [
                {
                  "id": "my8vw3a",
                  "author": "GlbdS",
                  "body": "They don't typically have an antibiotic in it but they sure have surfactant (\"soap\") that basically wipe the surface clean of bacteria, which is what this device does as well. Plasma creates very short lived radicals that just physically and chemically wreck anything alive, same as soap does.",
                  "score": 3,
                  "created_utc": 1750160397.0,
                  "replies": [
                    {
                      "id": "my9067w",
                      "author": "Bigwhtdckn8",
                      "body": "Ok, I'll need to read further down the article,  It seems they should have said \"soap\" rather than \"deodorant\"",
                      "score": 2,
                      "created_utc": 1750162158.0,
                      "replies": [
                        {
                          "id": "my90kn1",
                          "author": "GlbdS",
                          "body": "Deodorant prevents bacterial growth, which produce the stinky molecules, soap just removes everything but it comes back",
                          "score": 8,
                          "created_utc": 1750162317.0,
                          "replies": [
                            {
                              "id": "my9zi9m",
                              "author": "Bigwhtdckn8",
                              "body": "That's what the article describes.  They started with \"clean armpits\"; they had already washed with soap.\n\nDid you read the article?",
                              "score": 2,
                              "created_utc": 1750173521.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "my95sbx",
              "author": "VagueSomething",
              "body": "Which should only concern you if it was being implemented at your expense. If they're not taking away your options then another option being added for a tiny market is none of your concern.\n\n\n\nFor those with allergies or skin conditions or issues with over production of sweat where normal deodorant doesn't work then having another thing to try or combine is a huge win.\n\n\nPlus we have to consider this being a potential stepping stone to something better. If this safely works then maybe it inspires another step for tackling bad smells or this can lead to an alternative use.",
              "score": 4,
              "created_utc": 1750164291.0,
              "replies": [
                {
                  "id": "mye7u1p",
                  "author": "ForeverWeary7154",
                  "body": "I agree, my best friend has Hailey-Hailey and might very much benefit from something like this since she can’t use any deodorants bc it triggers painful sores",
                  "score": 1,
                  "created_utc": 1750221293.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "my8wdnd",
              "author": "edvek",
              "body": "My quick google-fu has a bit of a range depending on what you are looking for but if it's the aluminum (antiperspirant) in some products it's probably less than 1% of adults. If the fragrance is an issue, which you can just buy fragrance free, it might be a little higher than that.\n\nSo let's just go real high and say it's 5% of the population has a hard time with most deodorant. They can just buy aluminum and fragrance free products which is probably not that expensive. I don't know about everyone else but I buy regular stick deodorant and it lasts a while and I use it daily. There's no way this machine will be better or cheaper.\n\nAt the end of the article it says it will retail for $250. Even if you buy the fancier stuff and it costs $10 and you go through it like crazy so 1 every 3 months that will take you over 6 YEARS to break even. I highly highly doubt this will last 6 years, probably won't even last half that. Even if you go through 1 a month which is absolutely insane that's still 2 years.\n\nMaybe this product does work but it sure as hell not cost effective.",
              "score": 5,
              "created_utc": 1750160607.0,
              "replies": [
                {
                  "id": "my9id3z",
                  "author": "cmasontaylor",
                  "body": "Yeah, I think for me, this product would become worth having under these circumstances: \n\n1. It lasts for years and years.\n2. It costs under $40.\n\nAt that price and in that circumstance, it would become a useful option for when I forget to buy more deodorant until it completely runs out.",
                  "score": 5,
                  "created_utc": 1750168523.0,
                  "replies": []
                },
                {
                  "id": "my8xsb2",
                  "author": "GlbdS",
                  "body": "Also takes 3min of constant exposure to work lol",
                  "score": 4,
                  "created_utc": 1750161195.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "my91zxv",
      "author": "b1gwheel",
      "body": "\"Here's how the technology is claimed to work …\n\nTwice each day, the user starts by holding the PlaDeo gently beneath each clean, dry armpit. A silicone gasket creates a 1-cm (0.4-in) gap between the device's main body and the underarm skin.\n\nPressing and holding the power button causes the PlaDeo to start producing ionized gas (namely cold atmospheric plasma) for 1.5 minutes. Should the user be prone to particularly stinky armpits, they can boost the time to three minutes per pit by pressing the button twice.\n\n\nIn either case, the plasma in turn produces chemicals known as reactive oxygen species (ROS). These kill odor-causing bacteria like Staphylococcus hominis and Corynebacterium xerosis, mainly by rupturing their outer cell walls. The ROS also break down any VOC molecules that those microbes may have already produced. But thanks to the 1-cm gap between the device's plasma emitter and the skin, the ROS are claimed to not harm the skin cells.\"\n\n\n\n\nWow. So convenient to have a mid day pit wash and dry followed by a 3-6 min plasma session.",
      "score": 176,
      "created_utc": 1750162871.0,
      "replies": [
        {
          "id": "my9wqli",
          "author": "VerifiedMother",
          "body": "Wait, 90 seconds a side?\n\nI wouldn't use it unless it's the same 6 seconds it takes me to put on deodorant",
          "score": 67,
          "created_utc": 1750172739.0,
          "replies": [
            {
              "id": "myakap9",
              "author": "sixfourtykilo",
              "body": "3 minutes if you have extra stinky pits.",
              "score": 30,
              "created_utc": 1750179393.0,
              "replies": [
                {
                  "id": "mycj9g4",
                  "author": "RushTfe",
                  "body": "How do I measure it? Can I use an odometer?",
                  "score": 1,
                  "created_utc": 1750199709.0,
                  "replies": [
                    {
                      "id": "mycqm7s",
                      "author": "sixfourtykilo",
                      "body": "No that's for cars. You're thinking of an roto rooter.",
                      "score": 2,
                      "created_utc": 1750202094.0,
                      "replies": [
                        {
                          "id": "mycv430",
                          "author": "RushTfe",
                          "body": "Oh didn't know cars used deodorant for their arm pits, so that's how they measure it then",
                          "score": 1,
                          "created_utc": 1750203576.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mycmum1",
              "author": "LadyPo",
              "body": "If it actually does work better then deodorant, I would gladly do it. I usually need at least 45 mins to get ready anyway (shower, makeup, etc) so another minute or two to be fresh while going out would be so worth it.",
              "score": 1,
              "created_utc": 1750200882.0,
              "replies": []
            },
            {
              "id": "myfvi6y",
              "author": "DrIvoPingasnik",
              "body": "Except in my case deodorant works maybe for an hour before my armpit getting rank again.",
              "score": 1,
              "created_utc": 1750251227.0,
              "replies": []
            },
            {
              "id": "myibrc6",
              "author": "thunderflies",
              "body": "90 seconds per side, twice daily",
              "score": 1,
              "created_utc": 1750276761.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mybpcrn",
          "author": "DreadPirate777",
          "body": "So I could get the same benefit by wiping my armpits with rubbing alcohol? Just kill the bacteria?",
          "score": 14,
          "created_utc": 1750190807.0,
          "replies": [
            {
              "id": "myd1phb",
              "author": "ClumpOfCheese",
              "body": "It does it twice a day under a clean dry armpit. So it seems like cleaning your armpits twice a day will help too. \n\nI use dial antibacterial soap for my armpits because it helps kill bacteria. But sometimes you just really gotta trim the pit hair back because it loves to hold onto the stink!",
              "score": 11,
              "created_utc": 1750205835.0,
              "replies": []
            }
          ]
        },
        {
          "id": "my97bpy",
          "author": "whatsupchucky",
          "body": "Will this work on my butt?",
          "score": 18,
          "created_utc": 1750164837.0,
          "replies": [
            {
              "id": "mya6mwa",
              "author": "ResponsibilityOk1729",
              "body": "Yes and with it you don't have to wipe anymore",
              "score": 19,
              "created_utc": 1750175522.0,
              "replies": [
                {
                  "id": "myaeljg",
                  "author": "b1gwheel",
                  "body": "It will remove the stink but leave the poop. Win win.",
                  "score": 28,
                  "created_utc": 1750177785.0,
                  "replies": [
                    {
                      "id": "mydhyde",
                      "author": "Phoenix916",
                      "body": "Think how much extra poop we'll save!",
                      "score": 2,
                      "created_utc": 1750211436.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mycybmg",
                  "author": "Risley",
                  "body": "I never wiped to begin with.  ",
                  "score": 1,
                  "created_utc": 1750204654.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mya6fhf",
              "author": "denM_chickN",
              "body": "Yes",
              "score": 1,
              "created_utc": 1750175465.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "my8vgxi",
      "author": "TheStoicNihilist",
      "body": "Hey plasma pits! Your mother was a snowblower!",
      "score": 126,
      "created_utc": 1750160216.0,
      "replies": [
        {
          "id": "my95f4d",
          "author": "BMXBikr",
          "body": "Short Circuit (1986)",
          "score": 34,
          "created_utc": 1750164156.0,
          "replies": [
            {
              "id": "my9fxad",
              "author": "Fancy-Pair",
              "body": "Nosotros kick your balls into outer space!!!",
              "score": 11,
              "created_utc": 1750167743.0,
              "replies": [
                {
                  "id": "mya5gn2",
                  "author": "Caleth",
                  "body": "I thought it was Los Lobos as in the wolves?",
                  "score": 8,
                  "created_utc": 1750175191.0,
                  "replies": [
                    {
                      "id": "myabzkl",
                      "author": "Fancy-Pair",
                      "body": "I’m sure it is - it’s just how I always heard it",
                      "score": 3,
                      "created_utc": 1750177051.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "my9t181",
          "author": "MindHead78",
          "body": "Wouldn't you like to be a pepper too!",
          "score": 8,
          "created_utc": 1750171696.0,
          "replies": []
        },
        {
          "id": "mya8sgl",
          "author": "icheat2win",
          "body": "Los Locos kick you ass! Los Locos kick your face! Los Locos kick your balls into outer space!!",
          "score": 7,
          "created_utc": 1750176134.0,
          "replies": []
        },
        {
          "id": "mya2ozn",
          "author": "TheNimanator",
          "body": "![gif](giphy|tnYri4n2Frnig)",
          "score": 4,
          "created_utc": 1750174414.0,
          "replies": []
        }
      ]
    },
    {
      "id": "my8m13y",
      "author": "cmasontaylor",
      "body": "So it’s a device you have to press to your armpit, activate and hold there 1.5-3 minutes for each side. Yeah, no. You gotta earn “the thing everyone uses now is obsolete.” This ain’t that.",
      "score": 230,
      "created_utc": 1750155731.0,
      "replies": [
        {
          "id": "my8vtmc",
          "author": "odsquad64",
          "body": "Twice a day. And your armpit must be dry when you do it.",
          "score": 107,
          "created_utc": 1750160368.0,
          "replies": [
            {
              "id": "my9bfel",
              "author": "ram_the_socket",
              "body": "To be fair the pits being dry thing is the same with antiperspirants, otherwise they aren’t as effective",
              "score": 41,
              "created_utc": 1750166252.0,
              "replies": [
                {
                  "id": "myda1wn",
                  "author": "Over_Hawk_6778",
                  "body": "If you use an alum block you actually need your pits to be wet, which makes it very convenient for applying right after a shower",
                  "score": 4,
                  "created_utc": 1750208730.0,
                  "replies": [
                    {
                      "id": "n31s7wc",
                      "author": "WonderfulPass",
                      "body": "Please explain more.",
                      "score": 1,
                      "created_utc": 1752486804.0,
                      "replies": [
                        {
                          "id": "n384b9h",
                          "author": "Over_Hawk_6778",
                          "body": "Alum crystal, you just rub it on your armpits, works pretty ok as a neutral deodorant",
                          "score": 1,
                          "created_utc": 1752566595.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "myakjoc",
                  "author": "sixfourtykilo",
                  "body": "My antiperspirant doesn't apply properly unless I'm straight out of the shower and my pits are still wet. Otherwise I'll have irritation the rest of the day.",
                  "score": -7,
                  "created_utc": 1750179462.0,
                  "replies": [
                    {
                      "id": "myat4u7",
                      "author": "ram_the_socket",
                      "body": "Chances are that you are having a reaction to that antiperspirant and your pits being wet is what is protecting you from getting a reaction rather than letting it set in",
                      "score": 34,
                      "created_utc": 1750181765.0,
                      "replies": []
                    },
                    {
                      "id": "myba9qm",
                      "author": "j33205",
                      "body": "The lack of irritation would indicate that it's not working optimally and you have a sensitivity.",
                      "score": 7,
                      "created_utc": 1750186507.0,
                      "replies": [
                        {
                          "id": "mybhsuh",
                          "author": "sixfourtykilo",
                          "body": "I'm literally sensitive to every deodorant and antiperspirant​... It's annoying!",
                          "score": 5,
                          "created_utc": 1750188648.0,
                          "replies": [
                            {
                              "id": "mybkesv",
                              "author": "j33205",
                              "body": "sucks to suck. sorry mate",
                              "score": 4,
                              "created_utc": 1750189408.0,
                              "replies": []
                            },
                            {
                              "id": "myep74p",
                              "author": "yusoffb01",
                              "body": "try alum block?",
                              "score": 1,
                              "created_utc": 1750230253.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mydzj0c",
                      "author": "Rhokai",
                      "body": "You may be applying it too close",
                      "score": 1,
                      "created_utc": 1750217723.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "my98i7g",
              "author": "LGP747",
              "body": "Do I have spin around, clap twice and lean back too?",
              "score": 15,
              "created_utc": 1750165257.0,
              "replies": [
                {
                  "id": "my9ixmd",
                  "author": "Llamadmiral",
                  "body": "a jump, a whistle and a fart will be required, [Roland Style](https://en.wikipedia.org/wiki/Roland_the_Farter)",
                  "score": 4,
                  "created_utc": 1750168700.0,
                  "replies": []
                },
                {
                  "id": "my9n3v7",
                  "author": "Same-Environment-120",
                  "body": "It’s a pelvic thrust and jump to the right",
                  "score": 3,
                  "created_utc": 1750169965.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mya0c9h",
          "author": "kermityfrog2",
          "body": "They need some kind of gene therapy to get Asian armpit genes.",
          "score": 6,
          "created_utc": 1750173756.0,
          "replies": []
        },
        {
          "id": "my8vwy3",
          "author": "Fredasa",
          "body": "If it actually works, maybe they'll have to start making \"anti-perspirant non-deodorants.\"",
          "score": 2,
          "created_utc": 1750160407.0,
          "replies": [
            {
              "id": "my8x20w",
              "author": "cmasontaylor",
              "body": "They do make those now. Used them in high school. The ones I had were totally liquid, and came in a bottle. They work well, but can burn a little while applying to sensitive skin.",
              "score": 2,
              "created_utc": 1750160890.0,
              "replies": []
            }
          ]
        },
        {
          "id": "my8mzia",
          "author": "thecuriousiguana",
          "body": "I'm not sure what problem they're even trying to solve here. 99.9% of people don't ever think \"I wish I didn't have to wear deodorant\"\n\nEDIT - Clearly I'm not talking about people who have medical issues or are allergic. That's why I didn't say 100% of people. The pitch here is \"we can finally replace deodorant!\", not \"we have something that might help the minority of people for whom deodorant is either ineffective or unusable\". Which is... weird.",
          "score": 5,
          "created_utc": 1750156236.0,
          "replies": [
            {
              "id": "my8pb81",
              "author": "Mooseymax",
              "body": "Deodorant containing aluminium can react and cause stains on shirts - this would in theory eliminate that?",
              "score": 27,
              "created_utc": 1750157417.0,
              "replies": [
                {
                  "id": "my8pr0z",
                  "author": "Mesapholis",
                  "body": "sweat does that too, the oils, the contents of sweat and bacteria in general - the device does not zap the sweat out of existence\n\neven the residual remains of the dead bacteria can leave stains",
                  "score": 7,
                  "created_utc": 1750157627.0,
                  "replies": [
                    {
                      "id": "my8pvpi",
                      "author": "Mooseymax",
                      "body": "And a normal wash doesn’t get rid of those oils? Aluminium staining is dark and grey - it’s not something that comes out unless you’re treating those stained parts specifically.",
                      "score": 8,
                      "created_utc": 1750157689.0,
                      "replies": [
                        {
                          "id": "my8r3wo",
                          "author": "Mesapholis",
                          "body": "yes it does to an extent - but if your wash cycle is not effective, over time sweat will stain the pits if not treated specifically.  \n  \nBut also, the device here states its application interrupts the bacterial cells present. so that means you apply it several times throughout the day - I want to point out that the research is done at a Korean University - Asians are genetically predisposed through a gene variant to sweat less / be less sweaty-stinky\n\nso you zap your pits several times throughout the day - Non-Asians even more often - but how often do you have access to a shower to remove the residue? And how effective is it on Non-Asians",
                          "score": 3,
                          "created_utc": 1750158259.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "my8p2l3",
              "author": "sndeang51",
              "body": "I could see it being helpful for people with skin allergies and sensitivities. When it may be difficult to consistently keep a decent supply of deodorant that’s compatible with them (supply chain, product reformulations, etc), a permanent device is an interesting accessibility option",
              "score": 14,
              "created_utc": 1750157301.0,
              "replies": [
                {
                  "id": "my8t7jk",
                  "author": "Faranocks",
                  "body": "I had surgeries on my shoulder when I was young. (3mo, 3y). Due to the way it healed, I have armpit tissue up and around and mixed into a bunch of lymph nodes and scar tissue. If this doesn't mess with those lymph nodes at all I'll probably buy this product.",
                  "score": 2,
                  "created_utc": 1750159221.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "my9a512",
              "author": "None",
              "body": "I’m allergic to every deodorant under the sun. No aluminum, no baking soda, no perfumes, no anything and still get a rash. And I need deodorant. I’m someone interested in this development.",
              "score": 3,
              "created_utc": 1750165821.0,
              "replies": []
            },
            {
              "id": "my8rwcc",
              "author": "StraY_WolF",
              "body": "You don't know enough people then. Some people STINK when they sweat and not because they don't take care of themselves. Genetics fucks with people like that. Deodorant is a good step but sometimes even that doesn't work.",
              "score": 5,
              "created_utc": 1750158624.0,
              "replies": []
            },
            {
              "id": "mybtob4",
              "author": "M1RR0R",
              "body": "Deodorants and antiperspirants are irritating and/or useless for me. I would consider this thing.",
              "score": 1,
              "created_utc": 1750192019.0,
              "replies": []
            },
            {
              "id": "my8q63c",
              "author": "SgtTreehugger",
              "body": "And the people who really should be wearing deodorant won't bother with this either",
              "score": 1,
              "created_utc": 1750157823.0,
              "replies": []
            },
            {
              "id": "my8r8aj",
              "author": "Curse3242",
              "body": "I do actually. Deo works up my nose & allergies, plus deo don't work as well on my anyways. You either use too little or so much you're insufferable for 2 hours then you don't smell good again \n\nI'd rather have a nostink device",
              "score": 1,
              "created_utc": 1750158316.0,
              "replies": []
            },
            {
              "id": "my93w7f",
              "author": "promixr",
              "body": "It’s toxic stuff in toxic packaging?",
              "score": -2,
              "created_utc": 1750163590.0,
              "replies": [
                {
                  "id": "my95pfc",
                  "author": "thecuriousiguana",
                  "body": "No evidence of harm (particularly cancer)\n\nhttps://www.bbc.co.uk/programmes/articles/5KcvxTDND3x6kDcswHylJZP/can-deodorants-cause-cancer",
                  "score": 2,
                  "created_utc": 1750164260.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mybd91v",
          "author": "AssaultedCracker",
          "body": "Anybody thinking about trying this should just use the crystal rock mineral salt deodorant. It’s seriously magical, and operates on the same principal (killing the bacteria that create the smell). But it costs about $10 a year, and it works at least 24 hours, and in my experience I’d say it’s closer to 48 hours.",
          "score": 1,
          "created_utc": 1750187348.0,
          "replies": []
        },
        {
          "id": "my8qk5k",
          "author": "VincentNacon",
          "body": "Better than trying to guess which scent you wanna use to mask them and having to remind yourself to get more again and again.\n\nWould give this thing a chance.  Maybe someone will do a review.",
          "score": -1,
          "created_utc": 1750158005.0,
          "replies": [
            {
              "id": "my9p4pu",
              "author": "Any-Appearance2471",
              "body": "> Better than trying to guess which scent you wanna use\n\nMaybe at first, but eventually don't you figure out a couple you like and just stick with those?\n\n> having to remind yourself to get more again and again\n\nI buy deodorant like...quarterly. Just get a few sticks at a time and you're good. Meanwhile, you have to use this thing twice as often as conventional deodorant. I don't think it's quite solving the problem in its current form.",
              "score": 14,
              "created_utc": 1750170562.0,
              "replies": [
                {
                  "id": "mybg2ca",
                  "author": "AssaultedCracker",
                  "body": "Yeah this isn’t solving anything, especially since a better alternative to conventional deoderant already exists, and it operates using the same mechanism as this thing. Crystal rock mineral salt deodorant kills the bacteria too, and you use it basically like regular deodorant.",
                  "score": 4,
                  "created_utc": 1750188148.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mybeuoz",
              "author": "AssaultedCracker",
              "body": "Consider this your review, even though it’s for a different product that I’m positive is far superior to this. \n\nI have been itching for an opportunity to rave about crystal rock mineral salt deodorant. Just like this device, it also kills the bacteria that cause odours, but instead of using a device twice a day, you put it on like regular deodorant, once a day. And a stick costs $10 but lasts forever. Like over a year. \n\nThe only requirement is to apply it after you shower. It has to go on wet, clean skin. And use a lot of it, liberally cover the entire armpit and then some. \n\nIf you do that, you can sweat through your clothes, and not only will you be stink free, your clothes will smell fresh too, cause there’s nothing around to cause an odour. I have confirmed this with my wife, after I drenched my shirt… it didn’t smell at all and neither did I. Seriously, I have no idea why anybody would use anything else, much less a less-convenient alternative like this device.",
              "score": 2,
              "created_utc": 1750187800.0,
              "replies": [
                {
                  "id": "mydfc7o",
                  "author": "VincentNacon",
                  "body": "Uh.... yeah no, I wouldn't consider this as a proper review of the device itself... wtf.",
                  "score": 1,
                  "created_utc": 1750210540.0,
                  "replies": [
                    {
                      "id": "mykhsl4",
                      "author": "AssaultedCracker",
                      "body": "Wtf. Why not?\n\nThe review is that there is a far better alternative readily available that you can buy today for $10 on Amazon.\n\nWhile not technically a review of the product, it tells you all you need to know about whether or not to buy it.",
                      "score": 0,
                      "created_utc": 1750302682.0,
                      "replies": [
                        {
                          "id": "mykvt5l",
                          "author": "VincentNacon",
                          "body": "Your idea of a proper review is literally downright insane. \n\nYou do NOT have the device itself, you haven't used that device yet, you couldn't possibly have the device in the past because it's not even out yet. It's on Indiegogo and they haven't completed the funding window period yet!\n\nYou're just giving me your experience with others non-tech related stuff. That's not a proper review of the said device we're talking about here.",
                          "score": 1,
                          "created_utc": 1750308692.0,
                          "replies": [
                            {
                              "id": "myzo3zk",
                              "author": "AssaultedCracker",
                              "body": "To spell this out clearly, I’m reviewing the ADVERTISED features, value, and convenience of this device, as compared to my personal experience with a different product. \n\nAssuming it works 100% as well as they claim it works, I have used a product that works for longer than theirs, requires much less time to apply, and can be bought for 5% of the cost. It’s a pretty basic application of logic to realize that even if this device operates perfectly, a cheap stick that does the same thing better is going to be preferable in every way. \n\nApply logic a little further and you’ll realize that this review is much more helpful than a review from somebody who has used this device but doesn’t know about mineral rock deodorant. They might think this device is an amazing breakthrough in technology that totally justifies its exorbitant $250 price tag for people who can’t use conventional deodorant. In reality a $10 alternative already exists for those people. You could find that person’s positive review and choose to pay $250 for this device, and be very happy with it… blissfully unaware that you could have paid $10 for a much more convenient option. \n\nHonestly I was just trying to be helpful and save you that. But it would seem my use of the word “review” has motivated you the opposite way somehow, as you seem very emotionally invested in wasting your money. Try this thing out and let me know how well it does at killing those bacteria for half the day, with a 1.5 minute application time, for $250. No matter how well it does, I’ll keep using my stick that works for 48 hours, applied in 15 seconds, and cost $10.",
                              "score": 0,
                              "created_utc": 1750515903.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "my958k7",
          "author": "bunkSauce",
          "body": "Also, uric acid and lipids cause the stink. Not bacteria. Bacteria is on your skin almost always. Your sweat is odorless. But without both bacteria and sweat.... no stink. Bacteria removal from an armpit will last how long? Do you know how clean the cleanest humans are?\n\nThis product is easy to spot snake oil.",
          "score": -10,
          "created_utc": 1750164089.0,
          "replies": [
            {
              "id": "my9a6cw",
              "author": "None",
              "body": "[deleted]",
              "score": 6,
              "created_utc": 1750165833.0,
              "replies": [
                {
                  "id": "myb4642",
                  "author": "bunkSauce",
                  "body": "You may want to check your facts. Bacteria does break down sweat in armpits, but it is the uric acid in your armpit sweat (and proteins/lipds/etc), which is broken down and becomes stinky (ammonia/etc) when it is broken down by bacteria.\n\nDon't stop at just one Google search to call me wrong. You may want to actually dig deeper.\n\nBeing confidently incorrect when accusing someone of being confidently incorrect is 🤌",
                  "score": -1,
                  "created_utc": 1750184790.0,
                  "replies": [
                    {
                      "id": "myb5ghq",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 0,
                      "created_utc": 1750185152.0,
                      "replies": [
                        {
                          "id": "myb5q0y",
                          "author": "bunkSauce",
                          "body": "It's not explicitly ammonia. Just go look it up. 100% positive my dude. Proteins, lipids, uric acid, etc. I just double checked.... did you?",
                          "score": 1,
                          "created_utc": 1750185228.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "my908dk",
      "author": "Didact67",
      "body": "1.5-3 minutes per pit. Still needs to be done twice a day. Yeah, I don't think it's gonna catch on.",
      "score": 13,
      "created_utc": 1750162182.0,
      "replies": []
    },
    {
      "id": "myb8t9m",
      "author": "Creative-Duty397",
      "body": "I have severe autonomic dysfunction/vasodilation. I have chronic skin, fungal, and bacterial issues because im sweating so much. And because my skin acturally heats up more than others, creating a bad environment. There is no cure for my specific condition and very little treatment. I have one of the worst cases out there.\n\nThis would help people like me so much. Particularly those of us who are afab as you cant put certain products all places. This comment is very tmi, but I just think people dont realize how much this can help.\n\nI dont want to smell. I dont want to put off sex all the time. I dont want my skin to peel and hurt. I want to be able to take care of my hygiene like everyone else is able to.\n\nI want to live my life.",
      "score": 11,
      "created_utc": 1750186100.0,
      "replies": []
    },
    {
      "id": "my8r6gg",
      "author": "frogmicky",
      "body": "I wonder if that'll help with the milk stains.",
      "score": 32,
      "created_utc": 1750158292.0,
      "replies": [
        {
          "id": "my91tv3",
          "author": "auniqueusername2000",
          "body": "I expected some old lore post but no, it was about the same time as this post. \n\nBang up job monitoring the reddits, thank you for your service",
          "score": 9,
          "created_utc": 1750162806.0,
          "replies": [
            {
              "id": "my926ak",
              "author": "frogmicky",
              "body": "Anytime 😀",
              "score": 3,
              "created_utc": 1750162940.0,
              "replies": []
            }
          ]
        },
        {
          "id": "my8s9rs",
          "author": "Barcaroli",
          "body": "What do you mean",
          "score": 5,
          "created_utc": 1750158797.0,
          "replies": [
            {
              "id": "my8sovb",
              "author": "hankhilton",
              "body": "Run away from this",
              "score": 19,
              "created_utc": 1750158987.0,
              "replies": [
                {
                  "id": "my8vkcl",
                  "author": "frogmicky",
                  "body": "Lol too late ,🤣",
                  "score": 5,
                  "created_utc": 1750160257.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "my8viea",
              "author": "frogmicky",
              "body": "https://www.reddit.com/r/Damnthatsinteresting/s/YEA6jabdE0",
              "score": 12,
              "created_utc": 1750160234.0,
              "replies": [
                {
                  "id": "my8wiun",
                  "author": "Barcaroli",
                  "body": "Oh god",
                  "score": 9,
                  "created_utc": 1750160666.0,
                  "replies": [
                    {
                      "id": "my8wp2j",
                      "author": "frogmicky",
                      "body": "I'm dying 😂😭😂🙂😭😭",
                      "score": 5,
                      "created_utc": 1750160740.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "myx1geq",
                  "author": "homer_3",
                  "body": "and here i thought he was talking about how, when the aluminum in antiperspirants mixes with sweat, it leaves a milky white stain in the pits of your shirt.",
                  "score": 2,
                  "created_utc": 1750470261.0,
                  "replies": [
                    {
                      "id": "myx79z7",
                      "author": "frogmicky",
                      "body": "LOL You never know where your milk is coming from nowadays.",
                      "score": 1,
                      "created_utc": 1750472448.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "my9o3le",
          "author": "reececonrad",
          "body": "I love Reddit",
          "score": 2,
          "created_utc": 1750170258.0,
          "replies": [
            {
              "id": "my9ouho",
              "author": "frogmicky",
              "body": "Lol me too.",
              "score": 1,
              "created_utc": 1750170479.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "myaj8q7",
      "author": "Bighorn21",
      "body": "You use it twice a day and you have to clean and dry the area before each use, I would venture to guess if more people did this anyway they would have far fewer BO problems to begin with.",
      "score": 6,
      "created_utc": 1750179099.0,
      "replies": []
    },
    {
      "id": "my92uyr",
      "author": "Scott_Normaal_12",
      "body": "Killing all the bacteria on/in us is not always a great idea.",
      "score": 15,
      "created_utc": 1750163199.0,
      "replies": [
        {
          "id": "myfvuxq",
          "author": "DrIvoPingasnik",
          "body": "Not everywhere, just in the armpits. They are not exactly beneficial in there.",
          "score": 1,
          "created_utc": 1750251349.0,
          "replies": []
        }
      ]
    },
    {
      "id": "my9qdqu",
      "author": "Margali",
      "body": "The name screams \"placebo\" but that is on me. I doubt it works longer than it takes for microbes to respread to the pits.\n\n  \nI will comment, the 5 years combined i spent on chemo and getting nuked, i had no body odor, and the best skin in my life. No microbes. Also dropped 85 pounds, but i wouldnt recommend either the diet nor style of eliminating body odor.",
      "score": 4,
      "created_utc": 1750170932.0,
      "replies": []
    },
    {
      "id": "my936ia",
      "author": "kirkum2020",
      "body": "So it does a worse job than an alcohol wipe, and we don't even use those for this application. Who came up with this trash?",
      "score": 9,
      "created_utc": 1750163320.0,
      "replies": [
        {
          "id": "myajl3t",
          "author": "Bighorn21",
          "body": "People looking for a solution to a problem we have already solved. Even people with allergies have alternatives these days instead of regular deodorant and to your point, if folks just washed their pits a few times a day there would likely no be a problem to begin with.",
          "score": 2,
          "created_utc": 1750179194.0,
          "replies": []
        },
        {
          "id": "myatmg4",
          "author": "corvus7corax",
          "body": "Hydrogen peroxide wipe would probably be the most similar alternative.",
          "score": 1,
          "created_utc": 1750181896.0,
          "replies": []
        }
      ]
    },
    {
      "id": "my8jooz",
      "author": "Nonameswhere",
      "body": "This sounds interesting, let's see how it shapes up.",
      "score": 21,
      "created_utc": 1750154438.0,
      "replies": [
        {
          "id": "mya9vnl",
          "author": "chadhindsley",
          "body": "Me walking into Walgreens: \"armpit plasma in the 40 watt range\"\n\n\"Hey just what you see pal'",
          "score": 3,
          "created_utc": 1750176447.0,
          "replies": []
        }
      ]
    },
    {
      "id": "my99g6v",
      "author": "SwarlsBarkley",
      "body": "As a dermatologist, this is an incredibly stupid product. No one needs this. No one.",
      "score": 13,
      "created_utc": 1750165586.0,
      "replies": [
        {
          "id": "my9uakm",
          "author": "New-Significance9572",
          "body": "What’s your opinion on iontophoresis? Wondering if a dermadry or aquex is worth it.",
          "score": 3,
          "created_utc": 1750172054.0,
          "replies": [
            {
              "id": "myapqrg",
              "author": "SwarlsBarkley",
              "body": "The situations where iontophoresis ends up being the best treatment are incredibly uncommon. I have one patient that couldn't tolerate botox injections to his palms, even with a nerve block, and found that iontophoresis with drysol gave him good control and was well tolerated. For pits there's so many topicals to try.",
              "score": 1,
              "created_utc": 1750180857.0,
              "replies": []
            }
          ]
        },
        {
          "id": "myaj5dy",
          "author": "ZookeepergameOk4165",
          "body": "I have hyperhidrosis and a bunch of skin allergies, so if a device like this were to be effective, it would be incredibly valuable to me. \n\nI used to get Botox as treatment for my hyperhidrosis, but my insurance stopped covering it & I can't afford to pay for it out of pocket. When it comes topical antiperspirans, I get irritation if not straight up allergic reaction to pretty much every single one available. I still choose to wear it because the amount of sweat and the smell are not something I'm willing to live with.\n The Iontophoresis devices on the market are  expensive & I'm wary of the pain associated. \n\nOther than a potential lack of effectiveness, what makes this so stupid and unneeded?",
          "score": 3,
          "created_utc": 1750179073.0,
          "replies": [
            {
              "id": "myap9ss",
              "author": "SwarlsBarkley",
              "body": "Mainly time involved for treatment, unknown efficacy, unknown damage to skin. If botox is too expensive or not covered there are existing solutions that are probably affordable. Brella, for example, should be available in the next year or so. Sofdra was recently approved and is generally well tolerated. I'm generally not in favor of home devices for things like this as the potential for incorrect usage is too high. If there's a way for it to hurt you, a patient will figure it out. \n\nHave you tried just straight aluminum chloride (DrySol)? \n\nI've yet to have an insurance company completely deny botox. If you have insurance, your doctor should be able to get it covered through an appear or a peer-to-peer. It's standard of care at this point.",
              "score": 4,
              "created_utc": 1750180732.0,
              "replies": [
                {
                  "id": "n0iih5f",
                  "author": "ZookeepergameOk4165",
                  "body": "Potential damage to the skin is something is something I hadn't considered, thank you so much for explaining in depth\n\nI'll have to ask my derm about Brella at my next appointment, that sounds intriguing! \nIt looks like Sofdra is an anticholinergic like Qbrezxa, which gave me intolerable dry mouth unfortunately (very disappointing bc it worked great as a treatment) \n\nDrySol gave me one of the most severe reactions of all, horrible red rash with burning itching skin. \n\nI'm one of those unlucky bastards with a horrible United Healthcare plan, they said they wholesale don't cover Botox as a treatment for anything under my plan, I appealed repeatedly but they didn't budge sadly. It was a life-changing treatment when I was able to get it, I wish my job offered anything other than bottom of the barrel insurance plans",
                  "score": 1,
                  "created_utc": 1751251493.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "myb0uhb",
              "author": "A5H13Y",
              "body": "I'll throw this out there just in the off chance it's helpful - Secret Clinical Strength (soft solid, sensitive). It's the only deodorant that I'm not allergic to.",
              "score": 2,
              "created_utc": 1750183857.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "myap4lp",
      "author": "None",
      "body": "[removed]",
      "score": 4,
      "created_utc": 1750180695.0,
      "replies": [
        {
          "id": "myb5jkr",
          "author": "Neo_Techni",
          "body": "[Rejected](https://www.irishtimes.com/news/world/asia-pacific/israeli-made-stink-bomb-not-smelly-enough-to-deter-indian-protesters-1.3168965)",
          "score": 1,
          "created_utc": 1750185176.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mybhlhk",
      "author": "mysterd2006",
      "body": "So ok it removes the odor, but it doesn't prevent excessive sweat...\nHaving giant wet areas on my shirt is a no no even if it doesn't stink ...",
      "score": 4,
      "created_utc": 1750188589.0,
      "replies": []
    },
    {
      "id": "mybj3yq",
      "author": "subspace_cat",
      "body": "![gif](giphy|REJ88Ck4a18IvrzavS)",
      "score": 4,
      "created_utc": 1750189031.0,
      "replies": []
    },
    {
      "id": "my99y8o",
      "author": "cthulhu-wallis",
      "body": "What about the bacteria after treatment ??",
      "score": 3,
      "created_utc": 1750165756.0,
      "replies": []
    },
    {
      "id": "my9lgla",
      "author": "Massive_Bed7841",
      "body": "Does it work on feet/shoes?",
      "score": 3,
      "created_utc": 1750169475.0,
      "replies": []
    },
    {
      "id": "my9o01j",
      "author": "therealskaconut",
      "body": "I knew the future had something to do with plasma",
      "score": 3,
      "created_utc": 1750170229.0,
      "replies": []
    },
    {
      "id": "mybao3i",
      "author": "j33205",
      "body": "ITT: people who don't know or bother with the very important distinction between deodorant and antiperspirant.",
      "score": 3,
      "created_utc": 1750186619.0,
      "replies": []
    },
    {
      "id": "mycgsmv",
      "author": "AlexHimself",
      "body": "I'm guessing the target market isn't your typical deodorant user, but people with chronic odor problems. It would probably be a godsend for them.\n\nIt's like saying *\"I don't see why anyone would need XYZ poo product?\"* when there's somebody with IBS salivating for it.",
      "score": 3,
      "created_utc": 1750198911.0,
      "replies": []
    },
    {
      "id": "myci9el",
      "author": "jert3",
      "body": "Great product. Must be safer than putting all these suspect chemicals directly on to your pours so the poisions seep into your body over the course of a lifetime, in an effort to make you not smell bad.",
      "score": 3,
      "created_utc": 1750199380.0,
      "replies": []
    },
    {
      "id": "myeena5",
      "author": "someonenamedmichael",
      "body": "I bet Big Deodorant is going to make a big stink about this!",
      "score": 3,
      "created_utc": 1750224566.0,
      "replies": []
    },
    {
      "id": "my8u59m",
      "author": "Kreissv",
      "body": "The power of the sun in the palm of my pits ",
      "score": 4,
      "created_utc": 1750159638.0,
      "replies": [
        {
          "id": "myadmb7",
          "author": "atzatzatz",
          "body": "I'm gonna put some ozone in your pits.",
          "score": 3,
          "created_utc": 1750177511.0,
          "replies": []
        }
      ]
    },
    {
      "id": "my9kdpk",
      "author": "This_guy_works",
      "body": " Oh lord, another excuse for those know it all douchbags to walk around claiming they don't need deodorant and how unnatural it is while stinking up a 12-foot radius around them.",
      "score": 4,
      "created_utc": 1750169148.0,
      "replies": []
    },
    {
      "id": "my8pdal",
      "author": "youlikescroundrels",
      "body": "Hey medical community \n\nI’d just like to say I’d like to get a full hair of head again before I die….\n\nCan we focus on that shit?",
      "score": 11,
      "created_utc": 1750157445.0,
      "replies": [
        {
          "id": "my8sya9",
          "author": "DaySoc98jr",
          "body": "In the meantime, there’s always Hair Alternative Therapy (HAT for short).",
          "score": 7,
          "created_utc": 1750159105.0,
          "replies": []
        },
        {
          "id": "my8qb05",
          "author": "Mesapholis",
          "body": "can't make magic out of thin (h)air - sorry\n\nbut jokes aside - there actually is a lot of research focused on hair growth, and cancer - but it was like treating the symptom of a bigger problem.\n\nthat's actually why I left the field. so much research directed into vanity projects, illnesses where research was meant to find more billable ways to treat said illnesses, instead of furthering actual progress.\n\na lot stress-related and simply genetics, you wouldn't want to undergo experimental gene-changing treatments that could give you cancer, just for a few years of hair - which would be lost to chemo again",
          "score": 10,
          "created_utc": 1750157886.0,
          "replies": []
        },
        {
          "id": "my8pxhj",
          "author": "-r4zi3l-",
          "body": "Sure, until you need chemo. Better off solving cancer first, meanwhile you can go to Turkey.",
          "score": -4,
          "created_utc": 1750157712.0,
          "replies": []
        }
      ]
    },
    {
      "id": "my9eteb",
      "author": "thisischemistry",
      "body": "So they are using reactive oxygen species (ROS) to kill bacteria? Any worries about the cancer-causing effects of those?\n\n[ROS: Carcinogenesis](https://en.wikipedia.org/wiki/Reactive_oxygen_species#Carcinogenesis)\n\nThey say this in the article:\n\n> But thanks to the 1-cm gap between the device's plasma emitter and the skin, the ROS are claimed to not harm the skin cells.\n\nHowever, if it's close enough to kill stuff *on* the skin then it could possibly have an effect *in* the skin. Perhaps it's minimal enough not to worry about it but I'd like to see a study proving that.",
      "score": 2,
      "created_utc": 1750167379.0,
      "replies": []
    },
    {
      "id": "my9hj3z",
      "author": "santathe1",
      "body": "If it ain’t in a portable can and costs $20, no thanks.",
      "score": 2,
      "created_utc": 1750168261.0,
      "replies": [
        {
          "id": "mybe85a",
          "author": "sapphicsandwich",
          "body": "Best I can do is $300 and it takes 6 minutes to apply",
          "score": 2,
          "created_utc": 1750187623.0,
          "replies": []
        }
      ]
    },
    {
      "id": "my9z6yy",
      "author": "No-Care6289",
      "body": "Which country should get it first?",
      "score": 2,
      "created_utc": 1750173431.0,
      "replies": [
        {
          "id": "myb5xzb",
          "author": "Neo_Techni",
          "body": "Canada imported people from that country, so we need it now. Particularly at the entrance to every bus",
          "score": 1,
          "created_utc": 1750185291.0,
          "replies": []
        },
        {
          "id": "mychdbd",
          "author": "BrandenBegins",
          "body": "We all know",
          "score": 1,
          "created_utc": 1750199093.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mya4mcj",
      "author": "Lynda73",
      "body": "I’ll stick with silver deodorant.",
      "score": 2,
      "created_utc": 1750174955.0,
      "replies": [
        {
          "id": "myb5tas",
          "author": "Neo_Techni",
          "body": "It's the only way to be sure you're not a werewolf",
          "score": 2,
          "created_utc": 1750185254.0,
          "replies": []
        }
      ]
    },
    {
      "id": "myabkxy",
      "author": "LittleG0d",
      "body": "I need this",
      "score": 2,
      "created_utc": 1750176935.0,
      "replies": []
    },
    {
      "id": "myalwyi",
      "author": "rws98",
      "body": "How many years from now until they figure out extended use of this thing could cause cancer?",
      "score": 2,
      "created_utc": 1750179830.0,
      "replies": []
    },
    {
      "id": "myao14l",
      "author": "Successful_Ad_7062",
      "body": "Ehh I make my own, works great. Even had the wife do a sniff test after a full day.\nAlcohol plus a bit of jojoba oil, then oil of Bay Rum, bergamot and a dash of clove.",
      "score": 2,
      "created_utc": 1750180400.0,
      "replies": [
        {
          "id": "mybk0tm",
          "author": "edwardphonehands",
          "body": "Lord Marbury?",
          "score": 1,
          "created_utc": 1750189295.0,
          "replies": [
            {
              "id": "mydh5bp",
              "author": "Successful_Ad_7062",
              "body": "A relation I can’t place, but assume to reference someone who possibly did not bathe, but slathered themselves in fragrance.",
              "score": 1,
              "created_utc": 1750211159.0,
              "replies": [
                {
                  "id": "mydkui4",
                  "author": "edwardphonehands",
                  "body": "character on the west wing",
                  "score": 1,
                  "created_utc": 1750212415.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "myd5gda",
          "author": "None",
          "body": "[removed]",
          "score": 1,
          "created_utc": 1750207151.0,
          "replies": [
            {
              "id": "mydgsfi",
              "author": "Successful_Ad_7062",
              "body": "Haha, but that is a lot of ingredients in that stuff on the shelf.\nI just couldn’t stand all that stink on those sticks.",
              "score": 1,
              "created_utc": 1750211036.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "myau2ca",
      "author": "hvyboots",
      "body": ">**Known as the PlaDeo** (as in, plasma deodorant), the gadget was invented by doctors TaeHo Lim and JungChi Seo at South Korea's Hanyang University. An earlier version, **called the Pragant**, won an Innovation Award at CES 2020.\n\nAm I Pragant? No, you're just PlaDeo.",
      "score": 2,
      "created_utc": 1750182015.0,
      "replies": []
    },
    {
      "id": "myb04do",
      "author": "radialmonster",
      "body": "a splash of alcohol also kills the bacteria and doesnt require a gadget to sell",
      "score": 2,
      "created_utc": 1750183654.0,
      "replies": []
    },
    {
      "id": "myb3jqq",
      "author": "correctingStupid",
      "body": "There have been gadgets that use a low voltage to zap sweat glands closed. I recall seeing them advertised online back in the 1990s and they were FDA approved. Seams like the same if not better. Iontophoresis machines if anyone needs that type of treatment. ",
      "score": 2,
      "created_utc": 1750184615.0,
      "replies": []
    },
    {
      "id": "mybcrci",
      "author": "sofaking_scientific",
      "body": "Plasma like from my blood, or plasma like charged particles? Instructions unclear",
      "score": 2,
      "created_utc": 1750187209.0,
      "replies": []
    },
    {
      "id": "myc3en8",
      "author": "Sinan_reis",
      "body": "could  just use rubbing alcohol lol",
      "score": 2,
      "created_utc": 1750194794.0,
      "replies": []
    },
    {
      "id": "myegatl",
      "author": "redheadedandbold",
      "body": "They make deodorants that use plants \"botanical actives\" to fight the smell, and very effectively for most people. Beekman's \"milk stick\" works great--and I haven't had one single armpit stain in any shirt in 4 years. I wear white tee-shirts now!",
      "score": 2,
      "created_utc": 1750225408.0,
      "replies": []
    },
    {
      "id": "my8t8aq",
      "author": "DaySoc98jr",
      "body": "Does this mean we wouldn’t have to listen to ads with women talking about how they got the stank?",
      "score": 4,
      "created_utc": 1750159230.0,
      "replies": []
    },
    {
      "id": "my8tyiy",
      "author": "RohenDar",
      "body": "So 1.5-3min per armpit. Who the fuck has time for that. When you are getting ready in the morning to rush to work who's gonna sit there 6min for their armpit to be gassed. And then you have to repeat it somewhere in the day, so you got to take this thing to work with you, undress and sit on the toilet for 6min to do it again...\n\nI can see it for people who have allergies to most deodorants or something, but the general populace is not going to use this.",
      "score": 3,
      "created_utc": 1750159556.0,
      "replies": [
        {
          "id": "my92gka",
          "author": "Salamander115",
          "body": "I have a family member with like really bad odor, like he can’t help it even with deodorant, I imagine something like this would be helpful for them, not people who are already suited for the current product lines.",
          "score": 3,
          "created_utc": 1750163049.0,
          "replies": []
        },
        {
          "id": "mya412g",
          "author": "TheNimanator",
          "body": "Due to an infection I have to use a special shampoo and let it sit in my hair for five minutes. Trust me when I say waiting a few minutes, while annoying, is sometimes necessary for some. If this method is effective and does not damage the body, I can absolutely see the extra time for application be worth the wait for some people",
          "score": 1,
          "created_utc": 1750174788.0,
          "replies": []
        }
      ]
    },
    {
      "id": "my8oyho",
      "author": "GuitarbytheTon",
      "body": "Pretty sure people aren’t that mad about deodorant. Most people want a better antiperspirant.",
      "score": 3,
      "created_utc": 1750157244.0,
      "replies": [
        {
          "id": "my8wut6",
          "author": "blither86",
          "body": "Rather than trying to stop yourself sweating you can use a block deodorant that puts a little salt on a clean pit and stops the bacteria from multiplying. I've had incredible results. They also do other deodorants but the one from pit-rok is excellent.",
          "score": 1,
          "created_utc": 1750160807.0,
          "replies": [
            {
              "id": "myd4lv8",
              "author": "yoguckfourself",
              "body": "Have you verified those incredible results with someone close enough to smell you after a few hours of application?",
              "score": 2,
              "created_utc": 1750206857.0,
              "replies": [
                {
                  "id": "myd6l3f",
                  "author": "blither86",
                  "body": "I'm fairly self aware and am capable of sticking my nostrils in to my pits. It essentially does a very similar thing as this device that's posted, albeit via a different method.\n\nI'm normally someone whose pits smell fairly soon after sweating a bit. Using this stuff I've got to 3 days after my last shower and been amazed that my pits still don't smell bad but I'm obviously going to shower anyway because I'm not clean, my pits just _still_ don't smell.\n\nIt's pretty cheap stuff so it's not like it's costly to try it out.",
                  "score": 1,
                  "created_utc": 1750207541.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "my8ql8r",
      "author": "MadOrange64",
      "body": "I’ll buy one and donate it to the local Smash Con.",
      "score": 2,
      "created_utc": 1750158018.0,
      "replies": []
    },
    {
      "id": "my8u4yh",
      "author": "blither86",
      "body": "Honestly you could just use an ammonia salt (I think) like pit-rok which does a similar thing. It stops the bacteria from multiplying. On a clean armpit I've had amazing results that mean my pits don't smell even if I don't shower for a few days.",
      "score": 1,
      "created_utc": 1750159634.0,
      "replies": []
    },
    {
      "id": "my8vexo",
      "author": "TomboyArmpitSniffer",
      "body": "NOOOOOOOOOOOOOOOOOOOOOOOOO",
      "score": 1,
      "created_utc": 1750160193.0,
      "replies": []
    },
    {
      "id": "my8vilb",
      "author": "RogerCrabbit",
      "body": "the really powerful deodorants work but can literally give you burns",
      "score": 1,
      "created_utc": 1750160236.0,
      "replies": []
    },
    {
      "id": "my8x5li",
      "author": "TomboyArmpitSniffer",
      "body": "![gif](giphy|TpsuCxwsNH8gatbpR5)",
      "score": 1,
      "created_utc": 1750160932.0,
      "replies": []
    },
    {
      "id": "my92ngy",
      "author": "nopoonintended",
      "body": "Does this deal with sweat too?",
      "score": 1,
      "created_utc": 1750163120.0,
      "replies": [
        {
          "id": "myb6agt",
          "author": "Neo_Techni",
          "body": "no",
          "score": 1,
          "created_utc": 1750185390.0,
          "replies": []
        }
      ]
    },
    {
      "id": "my95rq7",
      "author": "Lightcronno",
      "body": "This is a niche product clearly",
      "score": 1,
      "created_utc": 1750164284.0,
      "replies": []
    },
    {
      "id": "my96j7h",
      "author": "nariofthewind",
      "body": "Hmm, can be used to clean small wounds? 🤔",
      "score": 1,
      "created_utc": 1750164559.0,
      "replies": []
    },
    {
      "id": "my97xta",
      "author": "steller22",
      "body": "Salt works also",
      "score": 1,
      "created_utc": 1750165057.0,
      "replies": []
    },
    {
      "id": "my9d96d",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1750166862.0,
      "replies": []
    },
    {
      "id": "my9gdky",
      "author": "ktmfan",
      "body": "Surprised by how much effort is spent on underarms. Don’t look up Miradry if you are worried about a little ozone on the pits.",
      "score": 1,
      "created_utc": 1750167888.0,
      "replies": []
    },
    {
      "id": "my9malj",
      "author": "SnowConePeople",
      "body": "Most people just need better diets to reduce the need for extreme deodorants.",
      "score": 1,
      "created_utc": 1750169724.0,
      "replies": []
    },
    {
      "id": "my9rg5z",
      "author": "gamma_gamer",
      "body": "I just use an aluin/salt stone.",
      "score": 1,
      "created_utc": 1750171243.0,
      "replies": []
    },
    {
      "id": "mya7zvj",
      "author": "WeezerHunter",
      "body": "Couldn’t you theoretically do the same by rubbing hand sanitizer on your pits everyday? And no one does this so I’m not sure just killing all the bacteria is the way to go",
      "score": 1,
      "created_utc": 1750175907.0,
      "replies": []
    },
    {
      "id": "mya8v7a",
      "author": "againandagain22",
      "body": "Now this is tech. \nHopefully no side effects",
      "score": 1,
      "created_utc": 1750176157.0,
      "replies": []
    },
    {
      "id": "myaeoqx",
      "author": "GorillaBrown",
      "body": "Does it require refills?",
      "score": 1,
      "created_utc": 1750177810.0,
      "replies": []
    },
    {
      "id": "myagvij",
      "author": "mrkrabsbigreddumper",
      "body": "Salt sticks do the same thing and are much better for your health than anti perspirant",
      "score": 1,
      "created_utc": 1750178434.0,
      "replies": []
    },
    {
      "id": "myahjvz",
      "author": "TacoStuffingClub",
      "body": "All I can think is what 12 year old came up with let’s use plasma because I hate bathing so much. 😅",
      "score": 1,
      "created_utc": 1750178624.0,
      "replies": [
        {
          "id": "myb5nam",
          "author": "Neo_Techni",
          "body": "They watched Star Trek and wanted a sonic shower",
          "score": 1,
          "created_utc": 1750185206.0,
          "replies": []
        }
      ]
    },
    {
      "id": "myauqpa",
      "author": "Alewort",
      "body": "That doesn't seem like enough surface area covered to wrangle the entire stink zone.",
      "score": 1,
      "created_utc": 1750182196.0,
      "replies": []
    },
    {
      "id": "myax7cx",
      "author": "radio_710",
      "body": "Aren’t there good bacteria on the skin?",
      "score": 1,
      "created_utc": 1750182857.0,
      "replies": []
    },
    {
      "id": "myb6gng",
      "author": "No-Cicada-7128",
      "body": "Fuck na, i like not sweating AND not smelling",
      "score": 1,
      "created_utc": 1750185439.0,
      "replies": []
    },
    {
      "id": "mybu0hz",
      "author": "StepLogik",
      "body": "Same tech as the 3 Seashells, but recalibrated for armpits. Not nearly as revolutionary as the manufacturer would have everyone believe.",
      "score": 1,
      "created_utc": 1750192113.0,
      "replies": []
    },
    {
      "id": "myby6ez",
      "author": "Metaboschism",
      "body": "I thought it was the dead bacteria that caused the stink in the first place",
      "score": 1,
      "created_utc": 1750193284.0,
      "replies": [
        {
          "id": "myc72ar",
          "author": "chubbybator",
          "body": "bacteria poooooo",
          "score": 2,
          "created_utc": 1750195891.0,
          "replies": []
        }
      ]
    },
    {
      "id": "myccurp",
      "author": "jickbaggins1",
      "body": "How about you just shower every day and use a little bit of somethin somethin",
      "score": 1,
      "created_utc": 1750197662.0,
      "replies": []
    },
    {
      "id": "mychnko",
      "author": "Igoos99",
      "body": "What we all call deodorant is also antiperspirant. Killing the odor is actually pretty easy. It’s the extra antiperspirant part that most people are really paying for.",
      "score": 1,
      "created_utc": 1750199184.0,
      "replies": []
    },
    {
      "id": "mycmbch",
      "author": "bonesnaps",
      "body": "Cool, there may soon be plasma-resistant super-bacteria.",
      "score": 1,
      "created_utc": 1750200709.0,
      "replies": []
    },
    {
      "id": "mycsuy8",
      "author": "Shoddy_Ad7511",
      "body": "Or you could just shave",
      "score": 1,
      "created_utc": 1750202829.0,
      "replies": []
    },
    {
      "id": "mycwnes",
      "author": "Ophelia-Rass",
      "body": "What?! \"Twice each day, the user starts by holding the PlaDeo gently beneath each clean, dry armpit. A silicone gasket creates a 1-cm (0.4-in) gap between the device's main body and the underarm skin.\n\nPressing and holding the power button causes the PlaDeo to start producing ionized gas (namely cold atmospheric plasma) for 1.5 minutes. Should the user be prone to particularly stinky armpits, they can boost the time to three minutes per pit by pressing the button twice.\"\nWho has  time to hold a device under the armpits for 6 minutes 2x a day?",
      "score": 1,
      "created_utc": 1750204085.0,
      "replies": []
    },
    {
      "id": "mycwywx",
      "author": "MajYoshi",
      "body": "For sensitive skin, or even an easy use, one could just use hypochlorous acid. Your own body produces it to fight internal bacteria, fungus, and viruses, after all. \n\nHOCl is looking more and more to be quite a useful substance.",
      "score": 1,
      "created_utc": 1750204191.0,
      "replies": []
    },
    {
      "id": "mycxnfq",
      "author": "Atrampoline",
      "body": "My issue is that I sweat too much. I have hyper hydrosols and the odor isn't the issue, it's the sweat that is so dang annoying.",
      "score": 1,
      "created_utc": 1750204421.0,
      "replies": []
    },
    {
      "id": "myczpua",
      "author": "These_Junket_3378",
      "body": "I’ve always wanted a Plasma emitting device. Think futuristic plasma gun.",
      "score": 1,
      "created_utc": 1750205142.0,
      "replies": []
    },
    {
      "id": "myd59rd",
      "author": "Smooth_Review1046",
      "body": "I use rubbing alcohol. That kills all the bacteria. It’s cheap, no side effects at all. Yes I’m a guy, so ladies I can’t tell you what happens if you use it after you shave your pits.",
      "score": 1,
      "created_utc": 1750207087.0,
      "replies": []
    },
    {
      "id": "mydkpbu",
      "author": "qksv",
      "body": "If you want to nuke your pits, why not just spray isopropyl alcohol on them?",
      "score": 1,
      "created_utc": 1750212366.0,
      "replies": []
    },
    {
      "id": "mydlua9",
      "author": "chiefjstrongbow00",
      "body": "uh. just wash your pits with hibiclens every few days.",
      "score": 1,
      "created_utc": 1750212752.0,
      "replies": []
    },
    {
      "id": "mydmfpj",
      "author": "SummonTarpan",
      "body": "Magic the gathering players won’t use this method, either",
      "score": 1,
      "created_utc": 1750212954.0,
      "replies": []
    },
    {
      "id": "mydqd2c",
      "author": "3-DMan",
      "body": "\"Plasma deodorant in the 40 watt range.\"",
      "score": 1,
      "created_utc": 1750214312.0,
      "replies": []
    },
    {
      "id": "mye2rc8",
      "author": "Overall-Importance54",
      "body": "I really needed this in 8th grade. No one told me, dang it!!",
      "score": 1,
      "created_utc": 1750219061.0,
      "replies": []
    },
    {
      "id": "mye5xvg",
      "author": "meatbelch",
      "body": "Does it work on buttpits too?",
      "score": 1,
      "created_utc": 1750220437.0,
      "replies": []
    },
    {
      "id": "mye80zq",
      "author": "distelfink33",
      "body": "We are just starting to learn how good bacteria work in the gut. And  how important it is to our overall health. I’m not saying this isn’t a good idea in therapy im just saying it probably Lu also wipes out any good bacteria as well and that could cause new problems.",
      "score": 1,
      "created_utc": 1750221383.0,
      "replies": []
    },
    {
      "id": "myeg946",
      "author": "EverestMaher",
      "body": "Clicked on the comments forgetting this isn’t instagram",
      "score": 1,
      "created_utc": 1750225384.0,
      "replies": []
    },
    {
      "id": "myf1ap6",
      "author": "Inventiveunicorn",
      "body": "I wonder if this could be adapted for feet?",
      "score": 1,
      "created_utc": 1750237462.0,
      "replies": []
    },
    {
      "id": "mygjiky",
      "author": "m__a__s",
      "body": "Killing p-u with pew pew pew.",
      "score": 1,
      "created_utc": 1750258681.0,
      "replies": []
    },
    {
      "id": "myjah0v",
      "author": "sparkinx",
      "body": "Is Bic gonna buy this and vault it too?",
      "score": 1,
      "created_utc": 1750287357.0,
      "replies": []
    },
    {
      "id": "myksynh",
      "author": "cconnoruk",
      "body": "It's letting your body work as intended a good thing?",
      "score": 1,
      "created_utc": 1750307390.0,
      "replies": []
    },
    {
      "id": "mykz1oz",
      "author": "Burpreallyloud",
      "body": "Now you can stop buying and wasting money on deodorant by buying a subscription for $29.99 a month to allow this thing to work",
      "score": 1,
      "created_utc": 1750310226.0,
      "replies": []
    },
    {
      "id": "myla66j",
      "author": "willmontain",
      "body": "So there is a stungun/taser arc inside that little box.  That is the ionization powerful enough to produce ozone.  I'll bet that is exciting when it is applied to a nice sweaty salty pit and gives the person a lovely shock.  Another stupid \"beauty/wellness\" product.",
      "score": 1,
      "created_utc": 1750316022.0,
      "replies": []
    },
    {
      "id": "mz35520",
      "author": "smatchimo",
      "body": "Ah yes because one thing I see people using more and more is those plasma driven phone cleaners they probably only can dump on Temu now.",
      "score": 1,
      "created_utc": 1750558298.0,
      "replies": []
    },
    {
      "id": "mz35e4u",
      "author": "smatchimo",
      "body": "I dont want an itchy armpit but i loves me some lymphnode cancer.",
      "score": 1,
      "created_utc": 1750558395.0,
      "replies": []
    },
    {
      "id": "n2idm4o",
      "author": "___Snoobler___",
      "body": "If this works my wife may not leave me.",
      "score": 1,
      "created_utc": 1752218886.0,
      "replies": []
    },
    {
      "id": "my8sz94",
      "author": "black_bass",
      "body": "Will make it mandatory in smash bros tournament",
      "score": 1,
      "created_utc": 1750159117.0,
      "replies": []
    },
    {
      "id": "my97ocx",
      "author": "Mugaraica",
      "body": "Beautiful, until the day we discover what purpose these bacteria serve and why it’s actually a bad idea to kill them.",
      "score": 1,
      "created_utc": 1750164962.0,
      "replies": []
    },
    {
      "id": "my8n0ui",
      "author": "PlagueDoc69",
      "body": "Swing and a miss. ",
      "score": 0,
      "created_utc": 1750156256.0,
      "replies": []
    },
    {
      "id": "my8utzn",
      "author": "GlbdS",
      "body": "So like a wipe but takes 3 min per armpit instead of 2s, okayy",
      "score": 0,
      "created_utc": 1750159941.0,
      "replies": []
    },
    {
      "id": "my94ar3",
      "author": "Outrageous-Price-673",
      "body": "OR: drinking hydrogen water eliminated BO for me!",
      "score": 0,
      "created_utc": 1750163741.0,
      "replies": []
    },
    {
      "id": "mya7w8l",
      "author": "Wrypilot",
      "body": "But, I like the stink, 🤷🏻‍♂️",
      "score": 0,
      "created_utc": 1750175879.0,
      "replies": [
        {
          "id": "myb5qxy",
          "author": "Neo_Techni",
          "body": "We don't. Signed: The people who take the bus with you",
          "score": 2,
          "created_utc": 1750185236.0,
          "replies": [
            {
              "id": "mybjpxj",
              "author": "Wrypilot",
              "body": "Not my own, eww!",
              "score": 1,
              "created_utc": 1750189208.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "myapz3h",
      "author": "OGAnoFan",
      "body": "No bby I like ur sweat",
      "score": 0,
      "created_utc": 1750180919.0,
      "replies": []
    },
    {
      "id": "myayh14",
      "author": "Yserem",
      "body": "Sometimes we need bacteria though. Disinfecting your pits to that extent (if it works) my not turn out good for your skin...",
      "score": 0,
      "created_utc": 1750183198.0,
      "replies": []
    },
    {
      "id": "mybgcw8",
      "author": "Brave_Purpose_837",
      "body": "Let’s destroy the ozone, again!",
      "score": 0,
      "created_utc": 1750188232.0,
      "replies": []
    },
    {
      "id": "mydyofb",
      "author": "SRM_Thornfoot",
      "body": "Waiting for them to find out people have good bacteria in their armpits that keeps even nastier bacteria at bay. Messing with a 100,000 year old biological symbiotics is seldom a good idea.",
      "score": 0,
      "created_utc": 1750217380.0,
      "replies": []
    },
    {
      "id": "my8nzqa",
      "author": "standuptripl3",
      "body": "Why is anyone spending time or money on THIS.",
      "score": -3,
      "created_utc": 1750156759.0,
      "replies": [
        {
          "id": "my8omjb",
          "author": "kapra",
          "body": "Have you ever been to a Warhammer 40K or MTG tournament? This seems like the perfect contraption for entrance to the event. ",
          "score": 10,
          "created_utc": 1750157080.0,
          "replies": [
            {
              "id": "my90hu6",
              "author": "SoraUsagi",
              "body": "If those people can't be bothered to take a shower and put deodorant on what the hell makes you think they're going to spend 5 minutes holding this to their armpit?",
              "score": 3,
              "created_utc": 1750162286.0,
              "replies": [
                {
                  "id": "my9ixnr",
                  "author": "kapra",
                  "body": "It was a joke about making it required for entry, it wasn’t serious. ",
                  "score": 1,
                  "created_utc": 1750168701.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "my8q0gt",
              "author": "standuptripl3",
              "body": "No but LOL",
              "score": 0,
              "created_utc": 1750157751.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "my94smy",
      "author": "bunkSauce",
      "body": "The stink comes from uric acid.\n\n#This is snake oil.",
      "score": -2,
      "created_utc": 1750163926.0,
      "replies": []
    },
    {
      "id": "my9euve",
      "author": "WitchBrew4u",
      "body": "Just use vinegar, just not after a fresh shave. Much cheaper.",
      "score": -1,
      "created_utc": 1750167393.0,
      "replies": [
        {
          "id": "mya7kw2",
          "author": "Juswantedtono",
          "body": "Please don’t ever sit next to me on a plane",
          "score": 2,
          "created_utc": 1750175788.0,
          "replies": [
            {
              "id": "myd5out",
              "author": "WitchBrew4u",
              "body": "It’s before putting on an antiperspirant. Im not saying don’t put anything. It actually works! Washes off the bacteria. But okay",
              "score": 1,
              "created_utc": 1750207231.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}