{
  "post": {
    "title": "Samsung Teases Its Own Headset to Rival the Apple Vision Pro in 2025 / The headset will likely be priced between 1,000 and 1,500 Dollars, competing with both the Apple Vision Pro and the Meta Quest 3.",
    "author": "a_Ninja_b0y",
    "id": "1ghcfvs",
    "score": 207,
    "created_utc": 1730485985.0,
    "selftext": "",
    "num_comments": 123,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ghcfvs/samsung_teases_its_own_headset_to_rival_the_apple/"
  },
  "comments": [
    {
      "id": "luwgjgm",
      "author": "chucklas",
      "body": "That price point doesn’t compete with the quest 3.  \n\nUntil companies get in the market at a closer price point, the quest line will continue to own the casual gamer market.",
      "score": 101,
      "created_utc": 1730487299.0,
      "replies": [
        {
          "id": "lux01w7",
          "author": "HuskyLemons",
          "body": "Without controllers it doesn’t compete either",
          "score": 30,
          "created_utc": 1730493515.0,
          "replies": []
        },
        {
          "id": "luxuubs",
          "author": "clamroll",
          "body": "The only things competing with the quest 3 currently are the 3s and the 2. You're entirely correct tho, if this new device was priced around $500 and came with controllers, it would be a different story. Still likely wouldn't have the software library that the quest does tho",
          "score": 18,
          "created_utc": 1730504164.0,
          "replies": [
            {
              "id": "luxw4ob",
              "author": "chucklas",
              "body": "Pico is technically a competitor, just not available in the same areas.",
              "score": 5,
              "created_utc": 1730504623.0,
              "replies": [
                {
                  "id": "luyjvcj",
                  "author": "Evilmudbug",
                  "body": "Can't really compete if it's not available.",
                  "score": 8,
                  "created_utc": 1730513810.0,
                  "replies": []
                },
                {
                  "id": "lv1ufs3",
                  "author": "Suedie",
                  "body": "They're both available in Europe",
                  "score": 1,
                  "created_utc": 1730570139.0,
                  "replies": [
                    {
                      "id": "lv1zqsv",
                      "author": "chucklas",
                      "body": "Yeah. But their availability doesn’t completely overlap is what I was trying to say.",
                      "score": 2,
                      "created_utc": 1730571848.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lv04ofn",
          "author": "Cless_Aurion",
          "body": "Its quality probably doesn't either. This is for people that spend the same on their phones every couple years, not for someone looking for a \"best for your buck\" kind of deal.",
          "score": 3,
          "created_utc": 1730547752.0,
          "replies": []
        },
        {
          "id": "lv1u9zb",
          "author": "Suedie",
          "body": "It depends on if it's focused on productivity instead of gaming. The Quest 3 is marketed for productivity but its pretty awkward to use it for work. Apparently the vision pro is really good for productivity but the price point is too high. The Quest Pro kinda sits awkwardly in-between as being more expensive than the 3 but not really being much more capable for productivity. \n\nSo if it ends up being a good productivity headset it could outcompete the Quest 3, Quest Pro and Vision Pro in the productivity segment at that price point.\n\nBut for casual gaming the Quest 3 and Quest 3s have that market locked down pretty much, especially since they got exclusives.\n\nI don't think there is that much demand for a productivity headset to really carry sales but who knows maybe Samsung could convince a bunch of execs that they really have to buy a bunch of these for their workers.",
          "score": 2,
          "created_utc": 1730570088.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luwdbkp",
      "author": "x_scion_x",
      "body": ">1,000 and 1,500 Dollars\n\n  \nI just can't get into VR enough for that.\n\nToo much of a \"yay this is fun\" for about an hour a day for a week and then never touch it again for months other than parties.",
      "score": 148,
      "created_utc": 1730486303.0,
      "replies": [
        {
          "id": "luwglek",
          "author": "RSomnambulist",
          "body": "I could see paying that much, with a *ton* of caveats. If they get the battery and compute off my face and onto a hip worn device, if that device is enough to handle Half-Life: Alyx on it's own hardware, if it has 90hz+, if it has oled screens with 2k+ to each eye, if it has foveated rendering (probably necessary), if it can install steam--then yeah, I'll pay that much. I'd also take included haptics for hand, maybe chest. Be nice if it can accurately and usefully track your hands and feet.\n\nI don't see Samsung doing most of the most pertinent parts of this though, like moving the compute off your face. That seems to be something almost no one is realizing they should do and should have been done 5 years ago.",
          "score": 39,
          "created_utc": 1730487315.0,
          "replies": [
            {
              "id": "luz8klp",
              "author": "cowadoody3",
              "body": ">like moving the compute off your face. That seems to be something almost no one is realizing they should do and should have been done 5 years ago.\n\n\nMarquez Brown Lee just uploaded a video showing a new set of AR headsets from Facebook and Snapchat, and the FB one has moved the computer part off the headset into a side unit you carry with you. \n\n\nhttps://youtu.be/G0eKzU_fV00?feature=shared\n\n\nHonestly, I'm more excited about AR headsets than I am for VR headsets. I honestly think AR is the future, and if they get small and cheap enough, they will be as ubiquotous as smart phones. \n\n\n\n\nTHIS will be the future, watch: https://youtu.be/YJg02ivYzSs?feature=shared",
              "score": 6,
              "created_utc": 1730525965.0,
              "replies": [
                {
                  "id": "lv20iqk",
                  "author": "NecroCannon",
                  "body": "I honestly feel like the future is two kinds of AR\n\nGlasses that can directly connect to your phone that basically acts like a smart watch but on your face, and goggles for home use that can handle more intensive tasks and has better AR capabilities (eye tracking, better screens, more power). The goggles will get phased out as we bring that experience to glasses as it becomes cheaper.\n\nOnce Apple scales down the Vision, I bet there will be people using them or walking around with them. Like how AirPods looked stupid and next thing you know, now there’s people that walk around with AirPods in just to have them in",
                  "score": 2,
                  "created_utc": 1730572092.0,
                  "replies": [
                    {
                      "id": "lv2zs5z",
                      "author": "cowadoody3",
                      "body": ">goggles for home use that can handle more intensive tasks and has better AR capabilities (eye tracking, better screens, more power). \n\nI feel the same way. The \"home VR units\" don't even need a built in computer or battery, for example. They should just act as a monitor, that connects straight to your desktop computer via a cable. Think of how much lighter and cheaper they would be!\n\nAnd the \"portable AR units\" (like the FB and Snapchat ones) can continue to get cheaper and lighter so they can be carried around outside, and worn as easily as a smart watch. This makes the most sense for me.\n\nApple could have really been the pioneer in this space, but instead they did a super-expensive \"me too\" product that doesn't do ANYTHING very well (it's trash at portable, and trash at home use), not to mention it's way way too expensive. What were they thinking?!",
                      "score": 3,
                      "created_utc": 1730583629.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "luy3q9v",
              "author": "HeftyArgument",
              "body": "You’re asking for the world and offering peanuts in exchange lol, to achieve that with current technology you’d end up paying much more than 1500",
              "score": 12,
              "created_utc": 1730507418.0,
              "replies": [
                {
                  "id": "luz923d",
                  "author": "Bakk322",
                  "body": "Exactly, this list of requirements is like 10-20 years out",
                  "score": 6,
                  "created_utc": 1730526269.0,
                  "replies": [
                    {
                      "id": "luzgi8p",
                      "author": "DarthBuzzard",
                      "body": "...No it's not. Price aside, Apple Vision Pro is just about everything they described minus the compute since that's built into the headset, but could technically be offloaded, and AVP's power is enough to handle Half Life Alyx if Valve decided to port it over (and support third party controllers).",
                      "score": 3,
                      "created_utc": 1730531349.0,
                      "replies": [
                        {
                          "id": "lv0hxj6",
                          "author": "CosmicCreeperz",
                          "body": "Also Apple had a version of a HMD with a separate break out for compute, and it was nixed because they felt it had to be completely cable free, as that was the future.\n\nGiven Quest 3’s success I don’t think they were wrong - they are just still too early in the market to get the quality they demanded at a reasonable price.\n\nI’m not sure how far off it is, but to me the end game seems like it should be super small/ lightweight glasses driven wirelessly from a phone.\n\nDisplay-only XR glasses like Viture may be the right direction… though they are still tethered to a device for power and video signal.  Which I’d imagine will be a requirement for quite a while… we may be getting closer with high bandwidth wireless video, but power is always a problem…",
                          "score": 1,
                          "created_utc": 1730553882.0,
                          "replies": [
                            {
                              "id": "lv1red6",
                              "author": "RSomnambulist",
                              "body": "The wire-free approach is a really backwards outlook. What would you prefer--a lightweight, super comfortable headset with a single wire running down to hip mounted compute, or 500g strapped to your face?\n\nThe wire-free mentality needs to go until we can successfully stream 8k, 90hz. I'd rather be comfortable in VR and a little \"inconvenienced\" by a wire and separate compute than start getting uncomfortable 30-60m into use.",
                              "score": 2,
                              "created_utc": 1730569191.0,
                              "replies": [
                                {
                                  "id": "lv1titx",
                                  "author": "CosmicCreeperz",
                                  "body": "That why I said “I’m not sure how far off it is”.  Not sure you actually read my whole comment but yes, the goal has to be that compute is separate.\n\nHell it could be 30+ years off with contact lens displays driven by induction.  But it will be the end goal.\n\nAnd go look at the Viture glasses.  They are awesome for what they do (virtual large display with basic tracking, not VR) that’s why I mentioned them as a stepping stone.   That setup with true VR and a (wired) smart phone (or equivalent) as the compute would be an amazing step along the way.",
                                  "score": 1,
                                  "created_utc": 1730569850.0,
                                  "replies": [
                                    {
                                      "id": "lv8ftdb",
                                      "author": "RSomnambulist",
                                      "body": "I read your comment, maybe it sounded like I was countering you--my comment was more an annoyance at the companies who are obsessed with the idea of \"wire-free\" when we simply aren't there yet--not meant to be a counter-point to what you're saying.\n\nVirtue glasses look pretty cool. Considered getting something like this for my wife when she was traveling a lot.",
                                      "score": 1,
                                      "created_utc": 1730664795.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "lv73bx4",
                                  "author": "Shapes_in_Clouds",
                                  "body": "> The wire-free approach is a really backwards outlook. What would you prefer--a lightweight, super comfortable headset with a single wire running down to hip mounted compute, or 500g strapped to your face?\n\nI agree, but in this case it's likely referring to cabling to a Mac, versus the more self contained approach the VP ultimately took.  Afterall, the VP is still uniquely cabled to an external battery.  \n\nI imagine there are technical reasons why they didn't put all of the compute in the external box as well, but I hope they can eventually get to that point.  It's the only way these headsets are going to miniaturize to a comfortable size on any reasonable time horizon.  If they can shave the weight down by even half, it starts to change the game considerably as far as how wearable it is.",
                                  "score": 1,
                                  "created_utc": 1730650244.0,
                                  "replies": [
                                    {
                                      "id": "lv8gamz",
                                      "author": "RSomnambulist",
                                      "body": "That makes more sense. They have a historical product that already exists though and could be altered for this purpose, the Mac-minis. Just seems weird they thought the mac-crowd would buy into the Vision given it's size, ergonomics, and computational power compared to the price.",
                                      "score": 1,
                                      "created_utc": 1730664943.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "luz98la",
                      "author": "Ikanan_xiii",
                      "body": "Maybe mainstream VR is that far off as well.",
                      "score": 3,
                      "created_utc": 1730526385.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lv1sssc",
                  "author": "RSomnambulist",
                  "body": "Most of this is already in the Q3+Sony VR2 (I meant 2k+ per eye, whoops), other than the higher-end, off the headset compute. Installing Steam directly would be very straightforward, though Samsung wouldn't want to do that, only Valve would do something like that. The Q3 and Sony headsets are both under $500, and basically doubling the compute of the Q3 shouldn't push the cost over $1000. So, I don't think this is asking for the world. Bigscreen Beyond is a tiny company and they made an OLED 2k per eye headset for $1000.",
                  "score": 1,
                  "created_utc": 1730569624.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "luwgs5x",
              "author": "x_scion_x",
              "body": "ok, I'd bite for that too.",
              "score": 2,
              "created_utc": 1730487375.0,
              "replies": []
            }
          ]
        },
        {
          "id": "luwxzid",
          "author": "OtterishDreams",
          "body": "flight and driving sim racers may love it...depends if its 1000 dollars better :)",
          "score": 8,
          "created_utc": 1730492848.0,
          "replies": [
            {
              "id": "luz7kqt",
              "author": "hepcecob",
              "body": "Triple screen setups are way more expensive.  I am literally waiting for a headset with dynamic foveated rendering specifically for sim racing.",
              "score": 4,
              "created_utc": 1730525344.0,
              "replies": [
                {
                  "id": "lv18a85",
                  "author": "OtterishDreams",
                  "body": "I meant 1000 from headset to headset.  Agreed triples are great but a realestate issue for many. SIm racers tend to be ok blowing cash away :)",
                  "score": 1,
                  "created_utc": 1730563119.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "luy42dr",
          "author": "EinBick",
          "body": "If you do anything with Driving or Flying it's amazing and I use it weekly.\n\nOutside of that... yea there are some good arcade games but otherwise there is just zero pull.",
          "score": 1,
          "created_utc": 1730507544.0,
          "replies": []
        },
        {
          "id": "luzq159",
          "author": "None",
          "body": "There’s a broader picture where these companies are gunning to replace any screen you interact with at work or at home. The infrastructure has to be built, I think that’s more Apple’s bet than Samsung’s, I feel like Samsung is merely to sell headsets but this shit is going this direction. The internet is just short sighted and reactive as always.",
          "score": 1,
          "created_utc": 1730538300.0,
          "replies": []
        },
        {
          "id": "luzxt8s",
          "author": "BloodWork-Aditum",
          "body": "Yeah, thats a price that I could consider for a phone, but that is something I use for hours every day and even then 1000 is a lot... For a fun gimmick thing that gets used from time to time? Hell nah",
          "score": 1,
          "created_utc": 1730543646.0,
          "replies": []
        },
        {
          "id": "lv04j2c",
          "author": "Cless_Aurion",
          "body": "Stop playing \"VR genre\" games and instead start using it for all your gaming... and done, you just paid for a cool (and quite pricy) monitor.",
          "score": 1,
          "created_utc": 1730547670.0,
          "replies": []
        },
        {
          "id": "lv3ch8b",
          "author": "pahamack",
          "body": "It’s really useful for working out.",
          "score": 1,
          "created_utc": 1730588103.0,
          "replies": [
            {
              "id": "lv492qp",
              "author": "x_scion_x",
              "body": "That's actually fun. I did that exercise thing on there for a month.  However I couldn't bring myself to pay the sub and i hated the idea of constantly sweating in the headset",
              "score": 1,
              "created_utc": 1730600099.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lux5tja",
          "author": "Corgiboom2",
          "body": "I don't know how eager you are to look for games, but there are games out there that make the headset legit for gaming. I'll run out my headset battery and both external batteries on Into The Radius, for example.",
          "score": 1,
          "created_utc": 1730495382.0,
          "replies": [
            {
              "id": "lux7luk",
              "author": "x_scion_x",
              "body": "There are some cool games, but the novelty of VR wears off quickly for me. \n\nThe only reason I have my quest 2 is because my employer bought everyone one for Christmas during Covid since they couldn't do the party.\n\nWe used it a lot initially, but now it's mainly used for parties as if I actually get time to game, I'd rather play on my big screen",
              "score": 9,
              "created_utc": 1730495973.0,
              "replies": [
                {
                  "id": "luxfe86",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 5,
                  "created_utc": 1730498619.0,
                  "replies": [
                    {
                      "id": "luxfrdq",
                      "author": "x_scion_x",
                      "body": "At $1000+ I'd imagine so",
                      "score": 3,
                      "created_utc": 1730498746.0,
                      "replies": []
                    },
                    {
                      "id": "luyidao",
                      "author": "FearDaTusk",
                      "body": "I'm waiting to build a racing rig...\n\nThe debate is Monitor vs VR. VR is reaching the point where the price is comparable and the performance in a Sim is unmatched being that you can look around in a cockpit as if you're actually in the seat.",
                      "score": 1,
                      "created_utc": 1730513194.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lv4c8ln",
                  "author": "Fecal-Facts",
                  "body": "Yep they  all basically use the same gimmick pick up this or open that.\n\n\nMost of the games are just really basic and as much as I love being active I can play as much as I can with a traditional controller or kb+m.\n\n\nIf I'm gaming I want to be lazy and zone out.",
                  "score": 1,
                  "created_utc": 1730601325.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "luzb4ai",
              "author": "SiscoSquared",
              "body": "Very few vr games go beyond quick novelty arcade or whatever. Sure W few are fun like Alyx, bone works etc etc, but I used my vr headset maybe a few hours a week for a half a year, it's been years now since I used it. Very few intersting games for it, can't justify buying such an expensive headset. It's also just far less convenient than sitting down on the your couch or desk... Plus a decent % of ppl get motion sick from it too.",
              "score": 0,
              "created_utc": 1730527617.0,
              "replies": [
                {
                  "id": "luzorq3",
                  "author": "Corgiboom2",
                  "body": "I use a Quest 3. No way would I advocate spending over 1000$ on a headset.\n\n\nAnd if you haven't used it in \"years\", you might want to look into new games that have come out recently.",
                  "score": 2,
                  "created_utc": 1730537380.0,
                  "replies": [
                    {
                      "id": "lv0milj",
                      "author": "danielv123",
                      "body": "Got any tips for new games? Loved alyx but I remember there wasn't much like that available.",
                      "score": 1,
                      "created_utc": 1730555647.0,
                      "replies": [
                        {
                          "id": "lv11fo8",
                          "author": "Corgiboom2",
                          "body": "(copy/pasted from another reply I made)\n\nNo Man's Sky is a better port as it actually makes use of full motion controls.\n\nPhasmophobia has an excellent VR port that is actually better than playing it flat.\n\nI've had a ton of fun with Into The Radius (I put over 100 hours into it), and the sequel is out in alpha right now and includes co-op. Its a STALKER-like game taking place in an anomalous exclusion zone, with realistic gun mechanics and survival elements.\n\nBlade & Sorcery is a very fun sword fighting simulator with some heavy mod support. It recently released in full, and has a good roguelike campaign with a lot of progression.\n\nBattle Talent is a very good roguelike swordplay fantasy game and a lot of progression.\n\nH3VR, aka Hotdogs Horseshoes and Hand Grenades, is a fantastic gun playground, with very realistic gun mechanics and lots of variety in game modes.\n\nVTOL VR is a fun flight combat simulator.\n\nGhosts Of Tabor is pretty much Escape From Tarkov in VR.\n\nResident Evil 4 VR is standalone on Quest, and is an extremely good port.\n\nArizona Sunshine 1 and 2 are good zombie shooters you can play co-op.\n\nMOSS 1 and 2 are good sit-down games where you look over the game map and guide your character through it.\n\nTheres a lot of good stuff out there, but it usually doesn't get the attention the \"mainstream\" VR games get. I suggest going to the [](https://www.reddit.com/r/SteamVR/) or [](https://www.reddit.com/r/OculusQuest/) subreddits and check out whats going on there.",
                          "score": 1,
                          "created_utc": 1730560832.0,
                          "replies": [
                            {
                              "id": "lv1trva",
                              "author": "danielv123",
                              "body": "Resident evil 4 sounds fun. Thanks",
                              "score": 1,
                              "created_utc": 1730569929.0,
                              "replies": [
                                {
                                  "id": "lv1we5s",
                                  "author": "Corgiboom2",
                                  "body": "Oh its so much fun, and the game mechanics translate every well into VR. You can even dual wield you weapons and knife.",
                                  "score": 1,
                                  "created_utc": 1730570769.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lv0nl4v",
                      "author": "SiscoSquared",
                      "body": "What new games compare to Alyx or such? The last time I got a game was squadrons which was just low quality port of a 2d game I ended up refunding within an hour. Why is years in quote marks? It's been around 2-3 years since it used it back in pandemic days (rift s).\n\nDon't get me wrong stuff like super hot or beat saber the pistol whip game or gorn and bone works etc wree fun enough but get boring fast once the novelty wore off. The vr version of CS was kinda cool and being multiplayer had potential for replayability but it always found myself just playing normal 2d multiplayer shooters as it just lacked something.",
                      "score": 0,
                      "created_utc": 1730556045.0,
                      "replies": [
                        {
                          "id": "lv113je",
                          "author": "Corgiboom2",
                          "body": "Squadrons isn't even originally in VR and doesn't even use motion controls. No Man's Sky is a better port as it actually makes use of full motion controls.\n\nPhasmophobia has an excellent VR port that is actually better than playing it flat.\n\nI've had a ton of fun with Into The Radius (I put over 100 hours into it), and the sequel is out in alpha right now and includes co-op. Its a STALKER-like game taking place in an anomalous exclusion zone, with realistic gun mechanics and survival elements.\n\nBlade & Sorcery is a very fun sword fighting simulator with some heavy mod support. It recently released in full, and has a good roguelike campaign with a lot of progression.\n\nBattle Talent is a very good roguelike swordplay fantasy game and a lot of progression.\n\nH3VR, aka Hotdogs Horseshoes and Hand Grenades, is a fantastic gun playground, with very realistic gun mechanics and lots of variety in game modes.\n\nVTOL VR is a fun flight combat simulator.\n\nGhosts Of Tabor is pretty much Escape From Tarkov in VR.\n\nResident Evil 4 VR is standalone on Quest, and is an extremely good port.\n\nArizona Sunshine 1 and 2 are good zombie shooters you can play co-op.\n\nMOSS 1 and 2 are good sit-down games where you look over the game map and guide your character through it.\n\nTheres a lot of good stuff out there, but it usually doesn't get the attention the \"mainstream\" VR games get. I suggest going to the r/SteamVR or r/OculusQuest subreddits and check out whats going on there.",
                          "score": 2,
                          "created_utc": 1730560721.0,
                          "replies": [
                            {
                              "id": "lv13wg2",
                              "author": "SiscoSquared",
                              "body": "Thanks I'll check these out, vtol sounds intersting in particular.",
                              "score": 1,
                              "created_utc": 1730561659.0,
                              "replies": [
                                {
                                  "id": "lv155eu",
                                  "author": "Corgiboom2",
                                  "body": "VTOL VR even has multiplayer servers and co-op gameplay, and you can even crew the same aircraft as your friend.",
                                  "score": 1,
                                  "created_utc": 1730562083.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "luz4rfj",
          "author": "xraig88",
          "body": "I got one for free for work to test writing some software for it, I got some new games for it. Played them for a couple days and haven’t picked it up in like a year. It’s immersive sure, but it’s also annoying, I don’t have a space as big as I’d want to play it, the games are mid, it’s only a solo activity, they’re expensive and I don’t really enjoy any part of the experience.",
          "score": 0,
          "created_utc": 1730523687.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luwcyp5",
      "author": "None",
      "body": "How does it compete with quest 3 if its 3 times more expensive? ",
      "score": 51,
      "created_utc": 1730486190.0,
      "replies": [
        {
          "id": "luwdl4d",
          "author": "___Dan___",
          "body": "How can it compete with Vision Pro if it’s 1/3 the price?",
          "score": 34,
          "created_utc": 1730486386.0,
          "replies": []
        },
        {
          "id": "luxfbr9",
          "author": "pieter1234569",
          "body": "Easily. In reality there is nothing better than the quest 3, for the product it offers. The quest 3 isn’t only great for the price, but the fact that it is a completely stand alone headset with a totally open platform (android), that also allows you to connect to a pc.\n\nThe Apple vision cannot do this. It’s not open, can’t connect to a computer, and certainly doesn’t allow you to play steam games. If it did, even at that price point it would fly off the shelves. \n\nIf anyone delivers a better quest 3, then even if it’s trice as expensive, it would really fly off the shelves. But doing that takes billions of dollars, meaning that only these giants can do so.",
          "score": 10,
          "created_utc": 1730498594.0,
          "replies": [
            {
              "id": "luy0x4z",
              "author": "ellenich",
              "body": "You can stream Steam VR games from your PC to the Vision Pro using the ALVR app on the App Store.",
              "score": 4,
              "created_utc": 1730506375.0,
              "replies": []
            },
            {
              "id": "luxlfm6",
              "author": "thedoc90",
              "body": "Pico 4...",
              "score": 0,
              "created_utc": 1730500774.0,
              "replies": [
                {
                  "id": "luzuded",
                  "author": "pieter1234569",
                  "body": "The pico 4 is significantly worse than the quest 3.",
                  "score": 2,
                  "created_utc": 1730541371.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "luwjhqb",
      "author": "BleakBeaches",
      "body": "Can I please just stream video to it over a wire? Please?",
      "score": 12,
      "created_utc": 1730488229.0,
      "replies": []
    },
    {
      "id": "luz0ng8",
      "author": "cailenletigre",
      "body": "Samsung is the absolute worst and it’s for one reason: if you ever have ANY problems where you need to do a warranty replacement, they will absolutely run you around in circles, lie to you, and you may never get your replacement. Several years ago, I had a Galaxy Frontier watch that stopped turning on. I sent it in and two weeks later they sent me a letter saying they did not have any available (still being sold, mind you)  and they included a replacement of a $60 Fitbit looking thing. They literally gave me a $60 replacement for a $300 watch. I spent the entire next year trying to get my actual watch back. Over the course of that I spoke to probably 20 different “managers”, received multiple fitbit-looking things, and finally got a Galaxy Frontier watch after an entire year. But get this: they sent me a demo watch! From that moment on, I have not bought one single thing from Samsung and I never will. Fuck their repair facility in Plano, TX!",
      "score": 12,
      "created_utc": 1730521447.0,
      "replies": [
        {
          "id": "luzbnjy",
          "author": "SiscoSquared",
          "body": "Yea i made the mistake of wasting my money on Samsung in the past. Never again. When they charge so much for their products it's insane how they provide zero support or warranty and literally lie and try to gaslight you.",
          "score": 5,
          "created_utc": 1730527978.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luxq8b5",
      "author": "lliveevill",
      "body": "I had a VR headset attachment for my Note 5. I still have the phone, but Samsung, in their infinite wisdom, cancelled the headset by software. This means that the hardware works; you just get a virtual screen saying it is unable to be used.",
      "score": 11,
      "created_utc": 1730502506.0,
      "replies": [
        {
          "id": "luxwstx",
          "author": "TheSpatulaOfLove",
          "body": "How very Samsung.",
          "score": 8,
          "created_utc": 1730504864.0,
          "replies": [
            {
              "id": "luzbe2q",
              "author": "SiscoSquared",
              "body": "I made the mistake of buying Samsung devices a few years ago... So incredibly mediocre for the premium price tag, especially support and warranty.. never again.",
              "score": 1,
              "created_utc": 1730527800.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luxlmag",
      "author": "peppruss",
      "body": "I have probably owned 10 VR headsets. The public does not want a VR headset. It’s still my favorite way to create 3-D models but aside from that I’d rather be playing with a controller or on a steam deck or switch. Every attempt will suck until we get them to Ray-Ban size.",
      "score": 11,
      "created_utc": 1730500840.0,
      "replies": [
        {
          "id": "luxx2iq",
          "author": "gtd_rad",
          "body": "Big screen beyond?",
          "score": 2,
          "created_utc": 1730504961.0,
          "replies": [
            {
              "id": "luy311o",
              "author": "peppruss",
              "body": "You make a great point. Sometimes I think even clearing the living room and getting your PC set up is just enough friction that you can’t pick it up and put it on. PSVR2 is the least resistance with highest experience I’ve had.",
              "score": 2,
              "created_utc": 1730507155.0,
              "replies": [
                {
                  "id": "lv29bby",
                  "author": "gtd_rad",
                  "body": "Yea you make a great point.  I have a sim racing rig, without VR and sometimes just hopping in and loading a game is already a deterrent for me.\n\nAnther note is the cost isn't just the VR headset.  You need a high-end GPU that will cost at least another $1,000.  A lot of times, you'll also be tinkering with settings and what not to...",
                  "score": 0,
                  "created_utc": 1730574856.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "luzx9gj",
          "author": "Ahmatt",
          "body": "whole dog act lock saw water humorous fade fly license\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 1,
          "created_utc": 1730543286.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luwur57",
      "author": "mobrocket",
      "body": "Is the market big enough to justify 3 headsets over $1000 coming out? \n\nLG/Samsung/Apple\n\nEven Apple fans who are the least price conscious didn't buy the pro in droves",
      "score": 6,
      "created_utc": 1730491811.0,
      "replies": [
        {
          "id": "luxfkit",
          "author": "pieter1234569",
          "body": "The problem was never the price, but the fact the products sucks. It’s all just great specs, you can’t use for anything as it doesn’t connect to a pc and isn’t based on an open platform. This makes the product completely useless. \n\nIf it just plays steam games, even the Vision Pro would be flying of the shelves as then it IS actually the best headset you can get.",
          "score": 8,
          "created_utc": 1730498680.0,
          "replies": [
            {
              "id": "luykzuv",
              "author": "tooclosetocall82",
              "body": "I think people just don’t like strapping things to their face. 3D TV vibes.",
              "score": 6,
              "created_utc": 1730514273.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luxekwp",
      "author": "mailslot",
      "body": "Of course they did. Anytime Apple releases a product, Samsung announces they’re releasing a competitor. I’m still waiting on their Bixby powered HomePod that they announced years ago.",
      "score": 5,
      "created_utc": 1730498332.0,
      "replies": [
        {
          "id": "luzukxg",
          "author": "dirkvonshizzle",
          "body": "And the most pathetic aspect of it all is that in their marketing they heavily make fun of the company and tech they blatantly have _tried_ (being the key word) to copy.",
          "score": 6,
          "created_utc": 1730541514.0,
          "replies": []
        },
        {
          "id": "lv0i8y4",
          "author": "getmoneygetpaid",
          "body": "spoon summer cough enjoy dime reminiscent hospital agonizing towering seemly\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": -1,
          "created_utc": 1730554009.0,
          "replies": [
            {
              "id": "lv0iipb",
              "author": "mailslot",
              "body": "Pure blatant imitation? Sure. Some. Others at least try to differentiate themselves. No reason Samsung has to theme their dev tools to look like iTunes, play button and all.",
              "score": 2,
              "created_utc": 1730554117.0,
              "replies": [
                {
                  "id": "lv0l0f3",
                  "author": "getmoneygetpaid",
                  "body": "rock foolish racial aspiring school edge combative ossified nine degree\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                  "score": 0,
                  "created_utc": 1730555087.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lux2aog",
      "author": "None",
      "body": "[deleted]",
      "score": 3,
      "created_utc": 1730494234.0,
      "replies": [
        {
          "id": "luzkzgn",
          "author": "None",
          "body": "Just pray they don't innovate bs that other companies will do as well. Apple and samsung can improve vr just as much as they can destroy the concept of it.",
          "score": 1,
          "created_utc": 1730534594.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luylzml",
      "author": "VesperLynn",
      "body": "These VR headsets are so fetch",
      "score": 3,
      "created_utc": 1730514685.0,
      "replies": [
        {
          "id": "luytdi2",
          "author": "Caci-que",
          "body": "![gif](giphy|XBEoaajXTXaALzawSn)",
          "score": 3,
          "created_utc": 1730517924.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luxbuda",
      "author": "MutFox",
      "body": "Exploding batteries on VR set during CoD...\n\n\n\"The explosions are so realistic!\"",
      "score": 4,
      "created_utc": 1730497393.0,
      "replies": []
    },
    {
      "id": "luxvtc7",
      "author": "After-Town-2587",
      "body": "I thought Apple was gonna dial down on the VR? Did I just misread that somewhere?",
      "score": 2,
      "created_utc": 1730504511.0,
      "replies": []
    },
    {
      "id": "lv021zr",
      "author": "TheWatch83",
      "body": "This reminds me of joker burning a pile of cash",
      "score": 2,
      "created_utc": 1730546261.0,
      "replies": []
    },
    {
      "id": "lv5faal",
      "author": "Mclarenrob2",
      "body": "Nobody needs a mixed reality headset. Want to watch a movie? Use your tv. Anything else? Use your phone. No social isolation with these either.",
      "score": 2,
      "created_utc": 1730622763.0,
      "replies": []
    },
    {
      "id": "luxxn26",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1730505170.0,
      "replies": [
        {
          "id": "luy2zeo",
          "author": "None",
          "body": "*It’s the future…*",
          "score": 1,
          "created_utc": 1730507138.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luy5fzf",
      "author": "Simbakim",
      "body": "Please be good",
      "score": 1,
      "created_utc": 1730508060.0,
      "replies": []
    },
    {
      "id": "luy6fdo",
      "author": "None",
      "body": "why",
      "score": 1,
      "created_utc": 1730508433.0,
      "replies": []
    },
    {
      "id": "luy8ep9",
      "author": "NO_SPACE_B4_COMMA",
      "body": "Na I'll wait for the new index.",
      "score": 1,
      "created_utc": 1730509207.0,
      "replies": []
    },
    {
      "id": "luysls0",
      "author": "None",
      "body": "That picture is a little dystopian.",
      "score": 1,
      "created_utc": 1730517570.0,
      "replies": []
    },
    {
      "id": "luywr13",
      "author": "BigCommieMachine",
      "body": "Something bizarre about the Apple Vision Pro isn’t we haven’t seen a display even close pop up elsewhere. It is Micro-OLED, so my money is being on Sony manufacturing the display. But typically we see Apple push the envelope on tech and it pop up on some Chinese product within a couple of months.\n\nIt is especially odd because the Vision Pro hasn’t exactly been a sales success, you’d imagine the supplier is sitting on some displays.",
      "score": 1,
      "created_utc": 1730519509.0,
      "replies": []
    },
    {
      "id": "luz7n3e",
      "author": "cmlucas1865",
      "body": "Going back to Virtual Boy, nobody wants this shit. I don’t know how much money corporations are gonna pour into perfecting a form factor everyone hates on a product nobody asked for.",
      "score": 1,
      "created_utc": 1730525384.0,
      "replies": [
        {
          "id": "luzh0fm",
          "author": "DarthBuzzard",
          "body": "Clearly you missed the time in history when no one asked for PCs in their homes or cellphones in their pockets. Here's a truth of how the world works: Nobody asks for new technology, ever. The average person is completely incapable of imagining a technology beyond what we already have. Were average people asking for PCs? No. It took a visionary to invent the PC and they had to be forced onto people.\n\nAs Steve Jobs said: *Some people say give the customers what they want. But that’s not my approach. Our job is to figure out what they’re going to want before they do.\"*",
          "score": 1,
          "created_utc": 1730531715.0,
          "replies": [
            {
              "id": "lv0dwlf",
              "author": "cmlucas1865",
              "body": "You’re right, generally speaking. But in this specific instance, we’re approaching 30 years of these wearable VR sets & nothing has been successful or profitable. Gonna go out on a limb here & assume Meta, Apple & the gang aren’t bad at designing their product. These are just being rejected.",
              "score": 1,
              "created_utc": 1730552226.0,
              "replies": [
                {
                  "id": "lv0geck",
                  "author": "DarthBuzzard",
                  "body": "> These are just being rejected.\n\nBecause the tech is early. We won't know things for certain until it has hit maturity. 30 years is just the length of time since consumer VR was first tried, but most of that time is empty space with no investment going on. No investment means no advancement of the tech. It needs more time to advance.",
                  "score": 1,
                  "created_utc": 1730553266.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "luzc0fp",
      "author": "hitmonng",
      "body": "Dead Before Arrival.",
      "score": 1,
      "created_utc": 1730528218.0,
      "replies": []
    },
    {
      "id": "luzea1k",
      "author": "XInceptor",
      "body": "If it’s any good, it won already cause the AVP is an overpriced dev kit atm",
      "score": 1,
      "created_utc": 1730529779.0,
      "replies": []
    },
    {
      "id": "luzg87f",
      "author": "dedfishbaby",
      "body": "What I don't understand is how these decisions are made. I don't see any real demand from the consumers, since VR for gaming years ago, it's just something that is there but nobody really cares that much. How do they defend the huge spending in R&D for this?",
      "score": 1,
      "created_utc": 1730531148.0,
      "replies": [
        {
          "id": "luzhdo6",
          "author": "DarthBuzzard",
          "body": "> How do they defend the huge spending in R&D for this?\n\nForesight. Companies are a lot better at forseeing the future than redditors. Well, in some cases like Samsung it might be because they see the wave coming from the likes of Meta and Apple and don't like the idea of being left out if it takes off, but with leaders like Meta and Apple they understand that the tech could have mass appeal if it develops enough.",
          "score": 1,
          "created_utc": 1730531982.0,
          "replies": [
            {
              "id": "lv0acnh",
              "author": "dedfishbaby",
              "body": "Okay but VR is there for over 10 years at this point and I don't see any adoption still. I'm a big half life fan and still didn't play alyx because I just won't pay hundreds of dollars for the set as I have no use for it.",
              "score": 1,
              "created_utc": 1730550627.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lv0bftu",
          "author": "aCuria",
          "body": "It’s a matter of sufficient progression of the technology \n\nWe already wear glasses every day. If you make a device the same form factor as a regular pair of glasses, and it’s powerful enough…. \n\nSuch a device can replace your phone",
          "score": 1,
          "created_utc": 1730551136.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luztmq3",
      "author": "lurker512879",
      "body": "It's not a success at apple, Samsung is wasting money too, why doesn't anyone learn\n\nJust because Johnny Mnemonic was cool doesn't mean we will ever need that tech, except maybe that cool thumbnail laser wire",
      "score": 1,
      "created_utc": 1730540855.0,
      "replies": []
    },
    {
      "id": "lv00yzb",
      "author": "LordPartyOfDudehalla",
      "body": "Still too much",
      "score": 1,
      "created_utc": 1730545617.0,
      "replies": []
    },
    {
      "id": "lv0b262",
      "author": "mkvii1989",
      "body": "Flop contest.",
      "score": 1,
      "created_utc": 1730550962.0,
      "replies": []
    },
    {
      "id": "lv0f9rx",
      "author": "compound-interest",
      "body": "There has yet to be an ultra successful standalone headset over 1k. If it doesn’t have uncompressed display port then enthusiasts will ignore it imo.",
      "score": 1,
      "created_utc": 1730552804.0,
      "replies": []
    },
    {
      "id": "lv1luhh",
      "author": "None",
      "body": "Samsung started Oculus, which got bought and is quest now....why is this considered something new?",
      "score": 1,
      "created_utc": 1730567464.0,
      "replies": [
        {
          "id": "lv4ocuc",
          "author": "prospekt403",
          "body": "They are competing for which one is the bigger commercial failure.",
          "score": 1,
          "created_utc": 1730606450.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lv5h67h",
      "author": "sf-keto",
      "body": "I spend a lot of time working to look attractive & presentable, esp. in public. \n\nWhy do all these headset makers seem to idolize an S&M insect-furry look? \n\nNo way am I ever wearing that. Why can't they hire some serious engineers, some killer hardware peeps, and an eyeglass designer from Chanel or something? Why aren't these things really cute & functional sunglasses yet?\n\nThat's what I'll wear, thank you very much.",
      "score": 1,
      "created_utc": 1730624119.0,
      "replies": []
    },
    {
      "id": "lvbodcs",
      "author": "MetaVaporeon",
      "body": "wasnt competition meant to bring down prices?",
      "score": 1,
      "created_utc": 1730713556.0,
      "replies": []
    },
    {
      "id": "luxlu5p",
      "author": "TheMountainLife",
      "body": "We had enough idiots filming themselves driving while wearing the Vision Pro, we don't need more of this.",
      "score": 1,
      "created_utc": 1730500919.0,
      "replies": []
    },
    {
      "id": "luxfj9w",
      "author": "None",
      "body": "The Vision Pro is a terrible product that, if it were any other company's name on the product itself, would be laughed out of the room and into the failure bin of history.\n\nDon't try to compete with Vision Pro, because the Vision Pro is a paperweight with nothing to do on it.",
      "score": 0,
      "created_utc": 1730498668.0,
      "replies": []
    },
    {
      "id": "lux4da0",
      "author": "DiggoryDug",
      "body": "And nobody will buy it just like nobody bought these before.  Waste of resources.",
      "score": 0,
      "created_utc": 1730494904.0,
      "replies": []
    },
    {
      "id": "luwcu8s",
      "author": "SpadessVR",
      "body": "And will work on pc",
      "score": 0,
      "created_utc": 1730486152.0,
      "replies": []
    },
    {
      "id": "luwdrqc",
      "author": "51CKS4DW0RLD",
      "body": "Is that a real photo of it?",
      "score": 0,
      "created_utc": 1730486442.0,
      "replies": [
        {
          "id": "luwg5eu",
          "author": "lucellent",
          "body": "That's the Apple Vision Pro in the image",
          "score": 4,
          "created_utc": 1730487179.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lux60sh",
      "author": "None",
      "body": "Apple’s headset will cost as much as an iPad when they release it generally and they already have the best AR patents available.",
      "score": 0,
      "created_utc": 1730495449.0,
      "replies": []
    },
    {
      "id": "luxb1a8",
      "author": "Miracl3Work3r",
      "body": "If I had any money Im sure Id also like setting it on fire.",
      "score": 0,
      "created_utc": 1730497118.0,
      "replies": []
    },
    {
      "id": "luy699w",
      "author": "johnyeros",
      "body": "And it will run tizen and have 2 dozen app and will first over and ruined your food and not make ice. Oh wait. Diff samsucks",
      "score": 0,
      "created_utc": 1730508368.0,
      "replies": []
    },
    {
      "id": "luzfj84",
      "author": "Dr_Opadeuce",
      "body": "When will they learn",
      "score": 0,
      "created_utc": 1730530659.0,
      "replies": []
    },
    {
      "id": "luwd1xj",
      "author": "buttorsomething",
      "body": "It has to be good and follow the norms that have already been established in the market if they intend to target anything more than watching movies.",
      "score": -2,
      "created_utc": 1730486219.0,
      "replies": []
    }
  ]
}