{
  "post": {
    "title": "Samsung teams up with Glance to use your face in AI-generated lock screen ads",
    "author": "diacewrb",
    "id": "1l3w0m7",
    "score": 695,
    "created_utc": 1749120205.0,
    "selftext": "",
    "num_comments": 276,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1l3w0m7/samsung_teams_up_with_glance_to_use_your_face_in/"
  },
  "comments": [
    {
      "id": "mw42dvu",
      "author": "themikker",
      "body": "I'M SORRY, WHAT?!\n\n\"By using the service, you agree to some tracking, including your general location, and some of that data will be shared with partners.\"\n\nFor what, the ability for AI slop to make use of your likeness to sell products to you?\n\nAre these people out of their damn minds?!",
      "score": 825,
      "created_utc": 1749120433.0,
      "replies": [
        {
          "id": "mw47zb8",
          "author": "Thagyr",
          "body": "This is dystopian. I'd feel sick if they took my face and slapped it on some corporate ad they'd want to feed back to me.\n\nI hate ads. I don't get how they think applying your face to one will possibly make it more enticing.",
          "score": 328,
          "created_utc": 1749122994.0,
          "replies": [
            {
              "id": "mw4fcb1",
              "author": "OrganicKeynesianBean",
              "body": "Straight outta Minority Report lol",
              "score": 77,
              "created_utc": 1749125977.0,
              "replies": []
            },
            {
              "id": "mw50wtd",
              "author": "Legitimate-Garlic959",
              "body": "If that’s the case.  If they’re going to use my likeness they should pay me.",
              "score": 36,
              "created_utc": 1749133229.0,
              "replies": []
            },
            {
              "id": "mw6zx2j",
              "author": "DanTheMan827",
              "body": "Maybe they’ll take the face of your parents or children to try for better conversion rates?\n\n“Hey mom, I just thought you should know that if you download Raid Shadow Legends today, you can get…”\n\nThat would be even worse… makes you wonder if that type of stuff is a big part of the reason they want to basically make it illegal for US states to make their own AI regulations?",
              "score": 16,
              "created_utc": 1749153405.0,
              "replies": []
            },
            {
              "id": "mw4d151",
              "author": "NancyPelosisRedCoat",
              "body": "It could work for clothing. “Here’s how you look in FastFashionBrand’s 37th collection this year with a background of a place we know you like” is probably better than a video ad of you trying to sell you something.",
              "score": 8,
              "created_utc": 1749125079.0,
              "replies": [
                {
                  "id": "mw4npfq",
                  "author": "Thagyr",
                  "body": "This just uses your face though? Imagine it placing it on a body that's entirely different to your own. \n\nMoreover, if they make the face move, it'd be far too weird I think.",
                  "score": 19,
                  "created_utc": 1749128990.0,
                  "replies": [
                    {
                      "id": "mw5aogi",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1749136062.0,
                      "replies": [
                        {
                          "id": "mw5gp9m",
                          "author": "PssPssPsecial",
                          "body": "No, it’s not going to look you up.  Say you’re Irish.   Then sell you drinks\n\n\nThat’s just not how it works.\n\n\nIt’s going to use the history they have of you then use that to sell you things you already have a history of showing interest in.\n\n\nLike.   It’s annoying people get how AI works so wrong\n\n\nExample: look how much fun you’d have playing this gaming laptop you just looked up",
                          "score": -1,
                          "created_utc": 1749137777.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mwew2rs",
              "author": "waterloograd",
              "body": ">I'd feel sick if they took my face and slapped it on some corporate ad\n\nI wonder if you could sue them for slander or misrepresentation",
              "score": 1,
              "created_utc": 1749256866.0,
              "replies": []
            },
            {
              "id": "mwuzyjg",
              "author": "ultratorrent",
              "body": "I'm probably going to break my phone in half the instant I see something like this.",
              "score": 1,
              "created_utc": 1749488308.0,
              "replies": []
            },
            {
              "id": "mw4pnf9",
              "author": "Small_Editor_3693",
              "body": "I don’t understand hating ads. How do you find out about stuff? You just raw dog walmart?",
              "score": -33,
              "created_utc": 1749129644.0,
              "replies": [
                {
                  "id": "mw4vj7c",
                  "author": "None",
                  "body": "You can research and look shit up as you want/need it. You just raw dog Hulu ads to know what you should buy?",
                  "score": 21,
                  "created_utc": 1749131571.0,
                  "replies": [
                    {
                      "id": "mw56rs8",
                      "author": "Small_Editor_3693",
                      "body": "Never used Hulu. I never knew nice keyboards existed til I saw an ad for a custom mechanical keyboard, then I looked it up and researched it. You wouldn’t even know about different hobbies without ads",
                      "score": -19,
                      "created_utc": 1749134941.0,
                      "replies": [
                        {
                          "id": "mw5hpbx",
                          "author": "LitLantern",
                          "body": "lol yeah definitely my hobbies (sewing, gardening, cooking) were totally unbeknownst to me before companies had my data to suggest them. /s",
                          "score": 11,
                          "created_utc": 1749138062.0,
                          "replies": [
                            {
                              "id": "mw666bk",
                              "author": "Small_Editor_3693",
                              "body": "I’m really missing something.  How else would you know about them",
                              "score": -6,
                              "created_utc": 1749144966.0,
                              "replies": [
                                {
                                  "id": "mw6fhzr",
                                  "author": "FallOutCaitlin",
                                  "body": "I assume the person you commented on has a garden and one day got interested into maintaining that garden. We all need to eat, and i guess they thought 'huh making food is fun, lemme get into that some more'. People like to create and find ways to express that creativity like sewing or painting or making music. You really can't find hobbies without ads spoon-feeding them to you?? That's insane dude",
                                  "score": 8,
                                  "created_utc": 1749147588.0,
                                  "replies": [
                                    {
                                      "id": "mw6jif6",
                                      "author": "Small_Editor_3693",
                                      "body": "? What’s insane is just “having a garden” without knowing what a garden is?",
                                      "score": -4,
                                      "created_utc": 1749148746.0,
                                      "replies": [
                                        {
                                          "id": "mw6o5nc",
                                          "author": "LitLantern",
                                          "body": "Omg you must be a troll 😂 \n\ngardening, cooking, sewing and textiles developed in EVERY SINGLE HUMAN CULTURE — we now know that even “hunter-gatherers” tended edible plants and grew gardens even if they didn’t settle in-place year round. These “hobbies” existed in most places BEFORE WRITTEN LANGUAGE. \n\nI do not need advertisers to inform me of activities that laid the foundations for the modern human experience. Your take is either a joke or you are a tech-funded bot.",
                                          "score": 8,
                                          "created_utc": 1749150068.0,
                                          "replies": [
                                            {
                                              "id": "mw72s82",
                                              "author": "Small_Editor_3693",
                                              "body": "Someone telling you about it is them advertising it to you.",
                                              "score": -2,
                                              "created_utc": 1749154186.0,
                                              "replies": [
                                                {
                                                  "id": "mw7u1bi",
                                                  "author": "LitLantern",
                                                  "body": "Absolutely not. Information is not the same as advertising. Advertising has a profit motive. Information is profit-neutral on its own.\n\nPlease just give up. Your argument is actual nonsense.",
                                                  "score": 2,
                                                  "created_utc": 1749162358.0,
                                                  "replies": [
                                                    {
                                                      "id": "mw7uty9",
                                                      "author": "Small_Editor_3693",
                                                      "body": "You’re telling me there wasn’t a motive to get you to buy apples?",
                                                      "score": -1,
                                                      "created_utc": 1749162634.0,
                                                      "replies": [
                                                        {
                                                          "id": "mw894xv",
                                                          "author": "LitLantern",
                                                          "body": "Ok, I am done feeding trolls, apples or otherwise. Go fraternize with your advertising overlords.",
                                                          "score": 3,
                                                          "created_utc": 1749167580.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mwgqvgc",
                                  "author": "zzazzzz",
                                  "body": "by being a real functioning human beeing?",
                                  "score": 1,
                                  "created_utc": 1749289381.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mw5gd90",
                          "author": "None",
                          "body": "Maybe YOU wouldnt",
                          "score": 9,
                          "created_utc": 1749137682.0,
                          "replies": [
                            {
                              "id": "mw660sk",
                              "author": "Small_Editor_3693",
                              "body": "How would anyone? I don’t understand",
                              "score": -8,
                              "created_utc": 1749144923.0,
                              "replies": [
                                {
                                  "id": "mw8di74",
                                  "author": "lovesahedge",
                                  "body": "The endless other opportunities to exchange information with real people",
                                  "score": 5,
                                  "created_utc": 1749169177.0,
                                  "replies": [
                                    {
                                      "id": "mw8j1cl",
                                      "author": "Small_Editor_3693",
                                      "body": "And they got it from an ad",
                                      "score": -5,
                                      "created_utc": 1749171214.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mw4ukne",
                  "author": "Thagyr",
                  "body": "If I realize I actually need something I look it up and research around for the right combination of quality/price/quantity. Because of that I don't need some piece of repetitive media interrupting something I enjoy every 5-10 minutes trying to sell me something I don't want *or* need, regardless of how much they dress it up.\n\nMoreover, a lot of ads on phones, Youtube and even in other media are intentionally deceptive in portraying what they are trying to sell you. So I distrust ads, or any word of mouth sponsored by a corporation, as a result.",
                  "score": 10,
                  "created_utc": 1749131267.0,
                  "replies": [
                    {
                      "id": "mw569ya",
                      "author": "Small_Editor_3693",
                      "body": "I don’t think I’ve ever seen what you are talking about",
                      "score": -3,
                      "created_utc": 1749134799.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mw4t33y",
                  "author": "ImprovementAnxious91",
                  "body": "no one \"hates\" ads. what people hate is the sheer pervasive, relentless barrage of utter shite that is pushed to you cos you looked at a fucking advert for one of those beds with a motor in it... you know the ones that turn into a chair? ONE time.\n\nor when you need a specific bit for a piece of plumbing, and now internet seems to think you run a toilet fitting company.\n\ni think its the method of delivery that pisses ppl off. and the data collection. and for a lot of people the consumerism.",
                  "score": 12,
                  "created_utc": 1749130786.0,
                  "replies": [
                    {
                      "id": "mw4xt6p",
                      "author": "bestjakeisbest",
                      "body": "I stopped using Netflix because they removed their ad free teir and I don't plan on going back, I have gone back to piracy for any content I can't pay for without ads, I have set up a dns level ad block and VPN server for my network so I don't see most ads with even my phone, I hate all ads, the way they have been pushed has made me try to limit every single ad I can. If your service requires me to pay and I still see ads I will just pirate.  \n\nIf samsung actually pushes this I'm rooting my phone and installing a custom rom.",
                      "score": 6,
                      "created_utc": 1749132286.0,
                      "replies": []
                    },
                    {
                      "id": "mw563ai",
                      "author": "Small_Editor_3693",
                      "body": "They literally said “I hate ads”",
                      "score": -2,
                      "created_utc": 1749134746.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mw7dmam",
                  "author": "a_little_angry",
                  "body": "Well yeah running through Walmart i know what food i want to get. If i see something that interests me I'll grab it. I hate advertising very much but I know it makes things like youtube available to me. I grew up when commercials would interrupt TV shows. Not once has an advertisement caught my attention. I've been alive for over 40 years and not once has any advertisement got me wanting the product being sold except when I was a kid wanting them ninja turtle action figures. I find out about stuff by needing it and going to the store to get it.",
                  "score": 0,
                  "created_utc": 1749157249.0,
                  "replies": [
                    {
                      "id": "mw7kfkz",
                      "author": "Small_Editor_3693",
                      "body": "Like how do you know to go to the store to get apples cause you need them? At some point someone told you about apples and you find out that honeycrisp is the goat and Gala are garbage. All of that is an ad",
                      "score": -2,
                      "created_utc": 1749159283.0,
                      "replies": [
                        {
                          "id": "mw7vui5",
                          "author": "a_little_angry",
                          "body": "I wouldn't consider word of mouth to be advertising at all. By advertising I mean billboards, commercials, ads and of course the birth of digital tracking.",
                          "score": 4,
                          "created_utc": 1749162985.0,
                          "replies": [
                            {
                              "id": "mw7yz8s",
                              "author": "Small_Editor_3693",
                              "body": "So you hear about a mythical thing called an apple from a friend, go to a Walmart, ask someone working there what an apple is, and buy it? You see how insane that sounds?",
                              "score": 1,
                              "created_utc": 1749164021.0,
                              "replies": [
                                {
                                  "id": "mw9jyzk",
                                  "author": "lovesahedge",
                                  "body": "I know there's no point in feeding you, but do you realise how insane it sounds to have never heard of possibly the most ubiquitous modern day fruit until it was advertised to you?",
                                  "score": 3,
                                  "created_utc": 1749185583.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mw6ytxz",
          "author": "ThinkExtension2328",
          "body": "Yea modern Samsung is out of control. The last time they gave a fuck was with DJ KOH since his departure it’s been a cluster fuck of a company.",
          "score": 14,
          "created_utc": 1749153112.0,
          "replies": []
        },
        {
          "id": "mw4j7o2",
          "author": "Blarg0117",
          "body": "One step closer to Lightspeed Briefs from Futurama.",
          "score": 25,
          "created_utc": 1749127416.0,
          "replies": [
            {
              "id": "mw5a1kc",
              "author": "XcOM987",
              "body": "r/unexpectedfuturama",
              "score": 3,
              "created_utc": 1749135876.0,
              "replies": []
            },
            {
              "id": "mw70hxs",
              "author": "DanTheMan827",
              "body": "Once they figure out a way to beam thoughts into your subconscious wirelessly I won’t put it past them…",
              "score": 1,
              "created_utc": 1749153559.0,
              "replies": [
                {
                  "id": "mxhesrq",
                  "author": "_RADIANTSUN_",
                  "body": "They can already do that, it's called Audio.",
                  "score": 1,
                  "created_utc": 1749776285.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mwb4okh",
              "author": "ChristopherPlumbus",
              "body": "And I'm about to break!",
              "score": 1,
              "created_utc": 1749214570.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mw8boe8",
          "author": "esach88",
          "body": "Yeaaaa my next phone will be a \"dumb\" phone. \n\nFuck all this.",
          "score": 10,
          "created_utc": 1749168505.0,
          "replies": []
        },
        {
          "id": "mw7697v",
          "author": "Gaeus_",
          "body": "MBA bros will see the GDPR and be like \"Légitimate interest\"",
          "score": 8,
          "created_utc": 1749155157.0,
          "replies": []
        },
        {
          "id": "mw8t0mw",
          "author": "metalconscript",
          "body": "Nokia bricks sound better everyday.",
          "score": 6,
          "created_utc": 1749174827.0,
          "replies": []
        },
        {
          "id": "mwe5h3t",
          "author": "RussianDisifnomation",
          "body": "That's it never buy another Samsung product. ",
          "score": 3,
          "created_utc": 1749247407.0,
          "replies": []
        },
        {
          "id": "mwj95eq",
          "author": "Katnisshunter",
          "body": "Surveillance capitalism.",
          "score": 2,
          "created_utc": 1749322896.0,
          "replies": []
        },
        {
          "id": "mw5cuh0",
          "author": "quasarius",
          "body": "It's a fucking shame, but it unfortunately makes sense. People outside reddit don't care at all about privacy or anything really. The amount of people who just randomly get their phones out in public and start recording videos of everyone around them (be it on the streets, in a mall, waiting in line or just anything) with no respect for people's opinions and wishes is baffling.",
          "score": 1,
          "created_utc": 1749136682.0,
          "replies": [
            {
              "id": "mw5nlk6",
              "author": "CanvasFanatic",
              "body": "I think some people outside of Reddit care about things.",
              "score": 12,
              "created_utc": 1749139742.0,
              "replies": []
            },
            {
              "id": "mw9ktwe",
              "author": "Fackcelery",
              "body": "...why would people walking around in public have any reasonable expectation of privacy?",
              "score": -1,
              "created_utc": 1749185995.0,
              "replies": [
                {
                  "id": "mxx5p5j",
                  "author": "Useuless",
                  "body": "Because if society values something we should help continue it, not just sacrifice it in another form of the tragedy of the Commons.",
                  "score": 0,
                  "created_utc": 1750000660.0,
                  "replies": [
                    {
                      "id": "mxxe0g6",
                      "author": "Fackcelery",
                      "body": "What youre saying makes no sense. We have always valued freedom of speech and freedom of press since the inception of our nation. Those values dont change based on modern technologies. If youre in public and dont want to be filmed, the best thing for you to do is smile and keep going about your business. Everything you do in public is already being filmed from multiple angles.",
                      "score": 1,
                      "created_utc": 1750003274.0,
                      "replies": [
                        {
                          "id": "mxxn4zm",
                          "author": "Useuless",
                          "body": "It does make sense. People don't really fight for things they want in this country so the status quo slowly changes, and the rest carry on as well, unaware.\n\nMany people can't even brainstorm ways their privacy is invaded and monetized. They lack the imgination.\n\nYou assume they know and don't care. I assume they think incorrectly and carry on blissfully unaware, as if the status quo is different.",
                          "score": 1,
                          "created_utc": 1750006117.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mxx5gy1",
          "author": "Useuless",
          "body": "You ever seen the permission list for the Samsung SmartThings app? \n\nIt requests what looks like every single fucking permission available, and wants them, even if there is no requested usage either (IE you set up a soundbar and it still wants access to your phone log).\n\nRepeat the process to use Good Lock.",
          "score": 1,
          "created_utc": 1750000588.0,
          "replies": []
        },
        {
          "id": "mw45umv",
          "author": "Superseaslug",
          "body": "Fuck, I like AI, but this is just awful in every way.",
          "score": -19,
          "created_utc": 1749122054.0,
          "replies": [
            {
              "id": "mw4ausl",
              "author": "thelangosta",
              "body": "Fuck, I hate how AI is going to be used by corporations in the US",
              "score": 23,
              "created_utc": 1749124208.0,
              "replies": [
                {
                  "id": "mw4edva",
                  "author": "Superseaslug",
                  "body": "That's why I'm learning to use it myself on my own hardware.",
                  "score": -14,
                  "created_utc": 1749125611.0,
                  "replies": [
                    {
                      "id": "mw4nthy",
                      "author": "thelangosta",
                      "body": "I would like to learn how to use it to remove all my data from data brokers and the dark web. Like some sort of web crawler but for personal data defense",
                      "score": 5,
                      "created_utc": 1749129029.0,
                      "replies": []
                    },
                    {
                      "id": "mw4r8q6",
                      "author": "scr116",
                      "body": "Same 🫡",
                      "score": 1,
                      "created_utc": 1749130174.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mw4chog",
              "author": "rubbarz",
              "body": "Idk why you're getting downvoted.\n\nAI is an amazing tool. But it feels like the big tech companies are competing with each other to see who can use it in the worst possible way. \n\nOnly a matter of time before there is an ad blocker like \"AI blocker\" driven by AI.",
              "score": -5,
              "created_utc": 1749124863.0,
              "replies": [
                {
                  "id": "mw4ebxk",
                  "author": "Superseaslug",
                  "body": "Because the mob saw someone that said they like AI and cannot stop flailing long enough to finish reading",
                  "score": -10,
                  "created_utc": 1749125590.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mwdjigg",
          "author": "JirkaCZS",
          "body": "> \"By using the service, you agree to some tracking, including your general location, and some of that data will be shared with partners.\"\n\nCan you explain to me why are you quoting this sentence? There is nothing interesting about it. You can't run advertising network without at least some general location. Imagine you would be seeing ads in Chinese or ads for a shop that is over 100 km away.",
          "score": -2,
          "created_utc": 1749240454.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw4491v",
      "author": "Grand-wazoo",
      "body": "Dystopia has arrived. You will have inescapable ads. You will subscribe and own nothing. You will be tracked 24/7 to feed profits. You will pay more for a burger at noon than at 1:30.",
      "score": 369,
      "created_utc": 1749121314.0,
      "replies": [
        {
          "id": "mw6x65b",
          "author": "Taki_Minase",
          "body": "No, you'll be in the Stone Age soon enough.  Petty authoritarians will see to it.",
          "score": 14,
          "created_utc": 1749152652.0,
          "replies": [
            {
              "id": "mw9kz3g",
              "author": "Fackcelery",
              "body": "If only. We are doomed to be slaves to the billionaires until we do something about it",
              "score": 3,
              "created_utc": 1749186065.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mw88kj2",
          "author": "dgj212",
          "body": "And people will not care, if they did Samsung would not dare do this. Hell the shit with switch 2 should be a giveaway, it had bad ahit in the eula, but people still pre-ordered it.",
          "score": 4,
          "created_utc": 1749167375.0,
          "replies": []
        },
        {
          "id": "mwdkekj",
          "author": "JirkaCZS",
          "body": "> You will pay more for a burger at noon than at 1:30.\n\nThis doesn't feel dystopian at all. Shorter wait times and if you don't come at rush hour you get a cheaper burger? Win, win.",
          "score": -5,
          "created_utc": 1749240725.0,
          "replies": []
        },
        {
          "id": "mw46hsy",
          "author": "None",
          "body": "[removed]",
          "score": -326,
          "created_utc": 1749122342.0,
          "replies": [
            {
              "id": "mw4awjw",
              "author": "None",
              "body": "[removed]",
              "score": 212,
              "created_utc": 1749124228.0,
              "replies": [
                {
                  "id": "mw4cbgf",
                  "author": "None",
                  "body": "[removed]",
                  "score": -224,
                  "created_utc": 1749124795.0,
                  "replies": [
                    {
                      "id": "mw4dhjp",
                      "author": "Lobster_fest",
                      "body": "Living without a smartphone is only going to be more difficult. \n\nYou can also demand higher standards from the products you enjoy.",
                      "score": 100,
                      "created_utc": 1749125259.0,
                      "replies": [
                        {
                          "id": "mw4e29f",
                          "author": "None",
                          "body": "[removed]",
                          "score": -147,
                          "created_utc": 1749125485.0,
                          "replies": [
                            {
                              "id": "mw4edh2",
                              "author": "Lobster_fest",
                              "body": "I never said you cant. I said it *will get harder* which is true. It's already difficult to start your life without a smartphone in the US. You need some kind of access to a device to use all kinds of services that cater mainly to phone users. \n\nLike i said **you can always demand higher standards**.",
                              "score": 56,
                              "created_utc": 1749125607.0,
                              "replies": [
                                {
                                  "id": "mw5vksp",
                                  "author": "Austoman",
                                  "body": "Its at this point thats I have confidently assumed that 'anti smartphone' guy is just trolling. They actively ignored both parts of your last comment to cherry pick words from it in order to reinforce their own BS.",
                                  "score": 9,
                                  "created_utc": 1749142027.0,
                                  "replies": []
                                },
                                {
                                  "id": "mw4elpf",
                                  "author": "None",
                                  "body": "[removed]",
                                  "score": -27,
                                  "created_utc": 1749125695.0,
                                  "replies": [
                                    {
                                      "id": "mw4ev0k",
                                      "author": "Lobster_fest",
                                      "body": "No, I meant smartphone.\n\n**It is only going to get more difficult to live without a smartphone**. So many things already heavily use smartphone systems, you cant just easily leave that ecosystem once you are in and use it.",
                                      "score": 40,
                                      "created_utc": 1749125794.0,
                                      "replies": [
                                        {
                                          "id": "mw4ey7z",
                                          "author": "None",
                                          "body": "[removed]",
                                          "score": -17,
                                          "created_utc": 1749125828.0,
                                          "replies": [
                                            {
                                              "id": "mw4f38k",
                                              "author": "Lobster_fest",
                                              "body": "Cant find anything to counter that with?\n\nI get it. Dumb phones are cool in concept. Owning one will only make your life more difficult as time goes by.\n\nSorry I didn't read your completely irrelevant article.",
                                              "score": 24,
                                              "created_utc": 1749125882.0,
                                              "replies": [
                                                {
                                                  "id": "mw4ff40",
                                                  "author": "None",
                                                  "body": "[removed]",
                                                  "score": -5,
                                                  "created_utc": 1749126006.0,
                                                  "replies": [
                                                    {
                                                      "id": "mw4fmf2",
                                                      "author": "Lobster_fest",
                                                      "body": ">someone that already has their mind made up\n\nInsanely ironic when you won't even engage with the ideas im saying. I'm not saying you can't. Never said that. I said:\n\nIT WILL ONLY GET MORE DIFFICULT TO LIVE WITHOUT A SMART PHONE\n\nYoure behaving like an ass on this thread. I think you need this break more than me.",
                                                      "score": 25,
                                                      "created_utc": 1749126083.0,
                                                      "replies": [
                                                        {
                                                          "id": "mw60zsl",
                                                          "author": "drake90001",
                                                          "body": "Why are you still commenting tho? You should’ve given up 5 comments ago.",
                                                          "score": 0,
                                                          "created_utc": 1749143534.0,
                                                          "replies": [
                                                            {
                                                              "id": "mw617uz",
                                                              "author": "Lobster_fest",
                                                              "body": "If you examine my current comment history you'll see I've done far worse lol.",
                                                              "score": 0,
                                                              "created_utc": 1749143597.0,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    },
                                                    {
                                                      "id": "mw5n51v",
                                                      "author": "None",
                                                      "body": "[deleted]",
                                                      "score": 6,
                                                      "created_utc": 1749139609.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mw4e63c",
                      "author": "guess_33",
                      "body": "Would rather cower from society in your little hidey home than demand better living standards for the people. \n\nKick rocks.",
                      "score": 27,
                      "created_utc": 1749125527.0,
                      "replies": [
                        {
                          "id": "mw4eeb5",
                          "author": "None",
                          "body": "[removed]",
                          "score": -9,
                          "created_utc": 1749125616.0,
                          "replies": [
                            {
                              "id": "mw6u3ig",
                              "author": "BipedalWurm",
                              "body": "Your jello based spine",
                              "score": 3,
                              "created_utc": 1749151762.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mw4pfj1",
                      "author": "LordOfTheStrings8",
                      "body": ">Good luck with that logic.\n\nGood luck without a smart phone.",
                      "score": 13,
                      "created_utc": 1749129570.0,
                      "replies": []
                    },
                    {
                      "id": "mw5f5nf",
                      "author": "afrothundah11",
                      "body": "Why do you lick the boots of our corporate overlords?",
                      "score": 3,
                      "created_utc": 1749137339.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mw4cfyv",
              "author": "YuriTarded_69",
              "body": "Yes nobody is forced to have one, but life is extremely difficult without one.\n\nWhy else do you think homeless people in the US and poor people in 3rd world countries own smartphones despite their financial situation?",
              "score": 38,
              "created_utc": 1749124845.0,
              "replies": [
                {
                  "id": "mw4crff",
                  "author": "None",
                  "body": "[removed]",
                  "score": -23,
                  "created_utc": 1749124972.0,
                  "replies": [
                    {
                      "id": "mw4dg7d",
                      "author": "YuriTarded_69",
                      "body": "Yes, because social media is the only value of using of a smartphone…?\n\nDo you think these people are going to carry around a computer just to be connected to the internet and communicate with their loved ones?\n\nDo you realize how difficult it is to get a job or even government assistance without owning a device like a smartphone?\n\nYour take is extremely narrow minded and disconnected from reality. Social media is a problem, but here you are on reddit projecting your own insecurities towards people with the most unfortunate circumstances.",
                      "score": 29,
                      "created_utc": 1749125245.0,
                      "replies": [
                        {
                          "id": "mw4du28",
                          "author": "Sasquatters",
                          "body": "Your argument was that homeless people need smartphones to make their lives easier. How? How does it make their life easier? Does it cure their boredom? Sure. Does it help them get a job? No, because you have to have an address. You’re putting word in my mouth when all I’m trying to do is clarify whatever stupid ass argument you’re trying to make about homeless people.",
                          "score": -15,
                          "created_utc": 1749125397.0,
                          "replies": [
                            {
                              "id": "mw4ehas",
                              "author": "YuriTarded_69",
                              "body": "If only there were methods posted online that would show a homeless person how to bypass not having an address when applying for a job…\n\nEven ignoring that part of my comment, you completely missed the part about getting government assistance. Please explain how you think someone in that situation could still qualify for those programs without access to a smartphone.",
                              "score": 27,
                              "created_utc": 1749125648.0,
                              "replies": [
                                {
                                  "id": "mw4es3t",
                                  "author": "Sasquatters",
                                  "body": "So your argument is that you have to have a smartphone, not just any phone, but specifically a smartphone is get any sort of assistance?",
                                  "score": -5,
                                  "created_utc": 1749125762.0,
                                  "replies": [
                                    {
                                      "id": "mw4fanq",
                                      "author": "YuriTarded_69",
                                      "body": "Yes?\n\nSure, they could own a cheap laptop and a regular non-smartphone and technically get by, but that just sounds like owning a smartphone with extra steps.\n\nWasn’t the whole point of smartphones to avoid needing multiple devices just to function?\n\nYou sound completely out of touch. Complaining about social media addiction while arguing about smartphones on social media, probably from a smartphone, with four other platforms linked to your profile. I wish I could say I’m surprised, but I’m really not.",
                                      "score": 21,
                                      "created_utc": 1749125959.0,
                                      "replies": [
                                        {
                                          "id": "mw4g8xb",
                                          "author": "None",
                                          "body": "[removed]",
                                          "score": -4,
                                          "created_utc": 1749126321.0,
                                          "replies": [
                                            {
                                              "id": "mw4ih5y",
                                              "author": "YuriTarded_69",
                                              "body": "Right, because physically going to a library just to check your email while homeless is so easy. I’m sure when someone is trying to find shelter, food, and survive day to day, they’ll have all the time and mental bandwidth to weigh the ethics of billion-dollar corporations and take a principled stand against the company that made their only lifeline to resources. Get real.",
                                              "score": 10,
                                              "created_utc": 1749127150.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "mw4kswk",
                                      "author": "__life_on_mars__",
                                      "body": "Are you purposefully misunderstanding, or are you stupid? It's about Internet access. \n\nThe point people are making is that not having unrestricted access to the Internet is extremely debilatiting in this day and age, and having a smart phone is the lowest/cheapest bar of entry for this.",
                                      "score": 16,
                                      "created_utc": 1749127982.0,
                                      "replies": [
                                        {
                                          "id": "mw4kzod",
                                          "author": "None",
                                          "body": "[removed]",
                                          "score": -4,
                                          "created_utc": 1749128048.0,
                                          "replies": [
                                            {
                                              "id": "mw4m9d4",
                                              "author": "__life_on_mars__",
                                              "body": "If your \"dumb phone\" connects the Internet and runs apps then guess what... It's a smart phone.",
                                              "score": 10,
                                              "created_utc": 1749128492.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mw5dijf",
              "author": "rudimentary-north",
              "body": "Just went to the Map Quest website and there are two ads taking up a third of the page",
              "score": 3,
              "created_utc": 1749136872.0,
              "replies": []
            },
            {
              "id": "mw5v4e0",
              "author": "Austoman",
              "body": "So my job REQUIRES a smart phone for operations. As do many peoples. Beyond that you are choosing to excuse shitty company activities in some bid to feel superior for using a different product. Why would defending multi billion dollar companies make you feel good?",
              "score": 3,
              "created_utc": 1749141898.0,
              "replies": []
            },
            {
              "id": "mw5dwkt",
              "author": "snowglobes4peace",
              "body": "Let's not pretend we haven't used every new medium as a vehicle to sell advertisements. This is what AI will be used for.",
              "score": 2,
              "created_utc": 1749136982.0,
              "replies": []
            },
            {
              "id": "mw5ahvs",
              "author": "retro_slouch",
              "body": "The majority of white collar employees are expected to have them to be able to perform their jobs (two-factor authentication, messaging apps, etc.) and many blue collar workers need them for clocking in and out at their jobs. Gig economy workers are obviously required to have their own devices.\n\nThen there are things like banks requiring app usage for some processes (unblocking cards at some banks cannot be done online or over a phone call).\n\nThese are examples of ways that a large swath of people are economically forced to have personal smart phones in order to make money and reliably access their money.",
              "score": 4,
              "created_utc": 1749136009.0,
              "replies": []
            },
            {
              "id": "mw5uben",
              "author": "master2873",
              "body": " No one is forced to have a vehicle either since your legs exist, despite possibly living in a car centric country.\n\nYet MILLIONS of people own them. Advocating for consumer rights and protections for an industry that's profiting off of your likeness and data is what needs to be done. No one should be forced to buy a \"dumb phone\" either because of the dystopian shit they've been doing for decades. You also act like this ONLY applies to phones. Nevermind how much of your daily life is being tracked and logged through vehicles, computers, and etc.\n\nI guess \"dumb\" computers exist too, but as tech progresses, older tech starts to become unusable. Go ahead and get online with a Windows 95, 98, 2000/ME, XP, Vista, 7, and 8 machine and within LITERAL MINUTES, you've already been compromised without needing to even open a browser, despite that hardware would barely, if not be able to function with today's standards. Yet the Internet is becoming a requirement for life as it wasn't before like many other things in our daily life that didn't exist, and wasn't deemed important to have generations ago, but life and tech moves forward and is supposed to make our life easier.\n\nBy all means though, keep trying to state what's important or not, while using the same tech. If you want to go back to the stone age, be first in line. There's plenty of things that are not deemed necessary to your life, but I guarantee you hypocritially use them as well.",
              "score": 2,
              "created_utc": 1749141668.0,
              "replies": [
                {
                  "id": "mw5uwey",
                  "author": "None",
                  "body": "[removed]",
                  "score": -5,
                  "created_utc": 1749141834.0,
                  "replies": [
                    {
                      "id": "mw5vstr",
                      "author": "master2873",
                      "body": "You're purposely ingoring points, and what was that you said about not doing a back and forth with someone who made up their mind, despite you doing the same?\n\n> You know what’s cool about my car? It’s doesn’t play ads on the screen. At the point car manufactures start doing that, I’ll stop buying cars.\n\n[Hate to break it to you, they already have.](https://www.kbb.com/car-news/jeep-owners-fed-up-with-in-car-pop-up-ads/) Nevermind Ford also filed a patent for doing the same.\n\nLike I said, there's plenty of things deemed not important to have for your life, so if you want to go back to the stone age, you can be first in line. You clearly have zero clue about how tech works.\n\nEdit: Quote got super messed up. Fixed now.\n\nEdit 2: Yes, when met with opposition and truth, down vote, and be a hypocrite on top of it. You can't refute truth. Keep living in denial, and keep acting like people HAVE to buy a \"dumb\" product to escape this. You also act like these companies NEED to keep making these devices, but also don't have to.",
                      "score": 2,
                      "created_utc": 1749142089.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mw68auv",
              "author": "adzy2k6",
              "body": "Man, this is such a \"I'm happy that standards are dropping to fuel shareholder profits\" comment. With so many things being tied to smartphones these days it is getting harder and harder.",
              "score": 1,
              "created_utc": 1749145550.0,
              "replies": []
            },
            {
              "id": "mw6tu4f",
              "author": "BipedalWurm",
              "body": "That is not true. Dumb phones are easily tracked. You don't have to pay for fancy features for newer cars to call home.",
              "score": 1,
              "created_utc": 1749151687.0,
              "replies": []
            },
            {
              "id": "mw50w6v",
              "author": "Xrevitup360X",
              "body": "While I disagree with you, I don't see why people are down voting you because of your opinion. Smart phones are an important aspect of our day to day lives now. It gives us access to the ability to learn things with a push of a button, get directions easily, and plenty of other important things. That being said, there is a simple solution to this new problem, stop buying the brands that are doing stuff like this. Samsung phones are filled with bloatware and are overly expensive. There are plenty of other brands that aren't doing this kind of thing and there are custom OS's that remove shady things like this as well. Stop letting big brands get away with doing shady shit.\n\nEdit: You guys are a pathetic sort, downvoting comments you don't agree with. You all need to do some self reflecting.",
              "score": -12,
              "created_utc": 1749133224.0,
              "replies": [
                {
                  "id": "mw5p9oz",
                  "author": "None",
                  "body": "[removed]",
                  "score": 1,
                  "created_utc": 1749140225.0,
                  "replies": [
                    {
                      "id": "mw67v89",
                      "author": "Xrevitup360X",
                      "body": "As proven by the amount of downvotes the guy above is getting. People are so uncivilized.",
                      "score": 0,
                      "created_utc": 1749145433.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mw46qz3",
      "author": "Komikaze06",
      "body": "The moment I see ads on my $1k+ device is when ill never buy from Samsung again. But let's be real, if this is successful for them everyone else will copy it, so who will be the company that stands firm?",
      "score": 276,
      "created_utc": 1749122455.0,
      "replies": [
        {
          "id": "mw4fwxn",
          "author": "BUROCRAT77",
          "body": "This should be the reason you stop. Don’t let it get further by buying into their shitty practices",
          "score": 65,
          "created_utc": 1749126194.0,
          "replies": []
        },
        {
          "id": "mw74qu3",
          "author": "SsooooOriginal",
          "body": "If I recall correctly, Mazda was one of the only manufacturers that did not ignore decades of established industry knowledge that *physical knobs and buttons that can be used without looking* were basic standards and did not follow Texlas \"infotainment screen\" bs.\n\n\nFor this topic, I imagine only the niche brands and the cheaper phones lacking the processing needed to generate images will not follow this bs trend.\n\n\nNo big company deserves any respect or loyalty nowadays, they all tell us the warm stinky stream hitting our backs is \"rain\".",
          "score": 23,
          "created_utc": 1749154730.0,
          "replies": [
            {
              "id": "mwkgx9p",
              "author": "CaptainRogers1226",
              "body": "I am a fan of my experience with Mazda so far.",
              "score": 5,
              "created_utc": 1749337735.0,
              "replies": [
                {
                  "id": "mwkki3v",
                  "author": "SsooooOriginal",
                  "body": "*zoom-zoom*\n\n\nWish they'd bring back the speed wagons here.",
                  "score": 3,
                  "created_utc": 1749339023.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mxx7su0",
              "author": "Useuless",
              "body": "This is not true at all lol. Reads as Mazda propaganda.\n\nThere are plenty of cars which still include physical buttons or experimented with touch controls and have sense reverted in the meantime.\n\nTesla is one of the only brands that explicitly avoids physical controls.",
              "score": 0,
              "created_utc": 1750001321.0,
              "replies": [
                {
                  "id": "mxz3wph",
                  "author": "SsooooOriginal",
                  "body": "Can't read too good, can you?",
                  "score": 0,
                  "created_utc": 1750022365.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mw48p0z",
          "author": "Themasterofcomedy209",
          "body": "Probably Apple. But they’ll make their phones cost an extra 1k for the privilege of not turning your face into advertisements",
          "score": 70,
          "created_utc": 1749123305.0,
          "replies": [
            {
              "id": "mw4fqrp",
              "author": "TripleSecretSquirrel",
              "body": "That’s exactly why I switched to an iPhone. For all their drawbacks, their business model is largely to sell me a new expensive iPhone every couple of years, more iCloud storage, Apple Music, etc. Everyone else is primarily about harvesting as much data as possible and putting as many ads in front of me as possible.\n\nI know Apple also does this, but it’s at least a lot less than any android devices I’ve ever had.",
              "score": 48,
              "created_utc": 1749126128.0,
              "replies": [
                {
                  "id": "mw8qtzl",
                  "author": "JoviAMP",
                  "body": "MacOS follows these principles too, while Windows pisses ads all over your lock screen, start menu, and tray notifications.",
                  "score": 14,
                  "created_utc": 1749174043.0,
                  "replies": [
                    {
                      "id": "mw9s5uk",
                      "author": "brianbamzez",
                      "body": "Have I just removed all of these without even remembering or what are you talking about other than the text ads that are sometimes on the lock screen? The weather widget now mostly shows me the weather and I hate that it doesn’t always show me the weather, but before it was shitty news articles but not really ads",
                      "score": 3,
                      "created_utc": 1749189720.0,
                      "replies": []
                    },
                    {
                      "id": "mwfuj9y",
                      "author": "gpbayes",
                      "body": "I switched to Linux full time in March. No more booting to windows. It took me some time to get used to it hence why I eased into it starting in like December, but now I don’t boot to windows at all and wow the performance gain is impressive from not having a bunch of bloatware.",
                      "score": 1,
                      "created_utc": 1749270763.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mw4kg6a",
              "author": "Splizmaster",
              "body": "The Jitter-bug calls to us. It can just be a phone again! Honestly to all the people who are not old enough to remember it used to be when you left your job work stopped. No one could track you. How many of us are texted, emailed or called after hours on time that is ours? The memes are just a siren song of end stage capitalist corpos made to trick us into being always on the clock.  Oh and to monetize literally every part of our existence. Resist my friends, they will not stop.\n\nEdit to say they could still call said Jitter Bug but just don’t answer.",
              "score": 7,
              "created_utc": 1749127859.0,
              "replies": [
                {
                  "id": "mw5gtdt",
                  "author": "whitelimousine",
                  "body": "I had news twice a day. Once with the paper once at 6pm. I got bills once a day in the mail. Now 24/7 I can be contacted to pay up",
                  "score": 3,
                  "created_utc": 1749137809.0,
                  "replies": [
                    {
                      "id": "mwa55fb",
                      "author": "ghost_of_mr_chicken",
                      "body": "Yeah, nothing like waking up at 4am because of an email/text telling you when your bill's due.",
                      "score": 2,
                      "created_utc": 1749197161.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mw707r3",
                  "author": "pelirodri",
                  "body": "The last thing I use mine for is calling.",
                  "score": 1,
                  "created_utc": 1749153483.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mw631j1",
              "author": "Shadow647",
              "body": "Fun fact: Samesungs cost pretty much the same",
              "score": 3,
              "created_utc": 1749144100.0,
              "replies": [
                {
                  "id": "mwmqgk8",
                  "author": "aasher42",
                  "body": "Genuinely both flagship phones look pretty much identical at a glance these days too",
                  "score": 1,
                  "created_utc": 1749375706.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mw4d0e4",
              "author": "Fresher_Taco",
              "body": "Nah they'd sell it at as feature and try to convince people the way they do it is innovative.\n\nEdit: lol apple fan boys getting mad I dare insult their phone.",
              "score": -6,
              "created_utc": 1749125071.0,
              "replies": [
                {
                  "id": "mw4nbuh",
                  "author": "Blarg0117",
                  "body": "First ads for a cheaper phone\n\nThen Non optional Ads\n\nLast subscription to get rid of ads.",
                  "score": 3,
                  "created_utc": 1749128861.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mw6hvhx",
              "author": "SoftlySpokenPromises",
              "body": "And people will be feral to get it and not have to suffer the FOMO effect.",
              "score": 0,
              "created_utc": 1749148270.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mw572es",
          "author": "Candle1ight",
          "body": "There will always be some nerds out there making alternatives, you'll just have to live with the jank that comes from not having hundreds of millions of dollars for R&D",
          "score": 5,
          "created_utc": 1749135024.0,
          "replies": []
        },
        {
          "id": "mw7zo8y",
          "author": "RubbelDieKatz94",
          "body": "> who will be the company that stands firm\n\nThe FOSS devs who produce modded operating systems for Android. I might actually go back to modded Android if this continues, even if I'll have to tinker in order to circumvent the safety measures in banking apps and to get Google Pay to work.",
          "score": 5,
          "created_utc": 1749164249.0,
          "replies": []
        },
        {
          "id": "mw4bi6j",
          "author": "Recom_Quaritch",
          "body": "Nokia. Get back to the brick.",
          "score": 7,
          "created_utc": 1749124472.0,
          "replies": [
            {
              "id": "mw4xe9l",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1749132155.0,
              "replies": [
                {
                  "id": "mw688jd",
                  "author": "Recom_Quaritch",
                  "body": "It's so sturdy it could genuinely double as a self defense weapon.",
                  "score": 1,
                  "created_utc": 1749145532.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mw5bqai",
          "author": "Drone314",
          "body": "Even worse, for those that go from toddler to teen will have \"grown up\" with it and it till be as normal as the sunrise.",
          "score": 2,
          "created_utc": 1749136364.0,
          "replies": []
        },
        {
          "id": "mw7fmoe",
          "author": "-sinc-",
          "body": "Completely with you. I'm selling my phone if they do this with mine",
          "score": 1,
          "created_utc": 1749157836.0,
          "replies": []
        },
        {
          "id": "mw93riz",
          "author": "I_Broke_Wind",
          "body": "They did it a couple of years ago when I was on a S8+. I believe it received very harsh criticism. That was my last samsung device.",
          "score": 1,
          "created_utc": 1749178853.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw443c1",
      "author": "garbans",
      "body": "If I recall correctly, this 'wonderful' technology appeared in a sci-fi film from the '90s or '00s. In it, a camera scanned the face of the protagonist, and he/she appeared in an ad panel next corner",
      "score": 73,
      "created_utc": 1749121240.0,
      "replies": [
        {
          "id": "mw44qdl",
          "author": "diacewrb",
          "body": "Guess you were also thinking about Minority Report from 2002.",
          "score": 43,
          "created_utc": 1749121541.0,
          "replies": []
        },
        {
          "id": "mw4549o",
          "author": "wopper",
          "body": "Minority Report 2002.",
          "score": 22,
          "created_utc": 1749121721.0,
          "replies": [
            {
              "id": "mw4hzfg",
              "author": "Leptonshavenocolor",
              "body": "Jesus, I forgot that movie is >20 years old.",
              "score": 4,
              "created_utc": 1749126968.0,
              "replies": [
                {
                  "id": "mw4mtzq",
                  "author": "diacewrb",
                  "body": "That can't be right, I can clearly remember the 1980s being 20 years ago.\n\nAnd nobody correct me either.",
                  "score": 6,
                  "created_utc": 1749128691.0,
                  "replies": [
                    {
                      "id": "mwe1a3s",
                      "author": "po3smith",
                      "body": "hell ROTK was only 10 years ago right? . . . . . . . . . .RIGHT?!\n\n![gif](giphy|3orieJI3IdkKWIsAGA)",
                      "score": 2,
                      "created_utc": 1749246017.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mw4g3lz",
      "author": "FUThead2016",
      "body": "# Steps on how to disable Glance in Samsung device\n\n* Step 1: Open Settings: Access the Settings app on your Samsung device, scroll down, and tap \"Wallpaper and style.\"\n* Step 2: Change Wallpapers: Tap on \"Change wallpapers\" to proceed.\n* Step 3: Access Wallpaper Services: Choose \"Wallpaper services\" from the available options. Locate and tap on the Glance option.\n* Step 4: Choose \"None\": Within Glance settings, select the \"None\" option to remove Glance from the lock screen.\n* Step 5: Exit Settings: After choosing \"None,\" exit the settings menu. Glance will no longer appear on your Samsung device's lock screen.\n* Step 6: By following these steps, you can successfully learn [how to disable Glance in Samsung](https://glance.com/help), allowing you to customize your lock screen wallpaper without this feature.",
      "score": 64,
      "created_utc": 1749126265.0,
      "replies": [
        {
          "id": "mw4u0pd",
          "author": "PARANOIAH",
          "body": "Just to piggyback this comment - to further give the middle finger to ads in general you can change your device's DNS to one that blocks ads like Adguard's (there are others too).\n\n1. Settings >\n2. Connections >\n3. More connection settings >\n4. Private DNS >\n5. Enter \"dns.adguard-dns.com\"\n6. Save\n\nTake note that this method doesn't work on Youtube ads though (there are other ways for that).",
          "score": 27,
          "created_utc": 1749131090.0,
          "replies": [
            {
              "id": "mw57pkl",
              "author": "Candle1ight",
              "body": "No need to be cryptic, look up revanced for a YouTube fix",
              "score": 13,
              "created_utc": 1749135207.0,
              "replies": []
            },
            {
              "id": "mwa7irr",
              "author": "Ronoh",
              "body": "Give me a way to stop seeing youtube shorts and I'll be thankful ",
              "score": 2,
              "created_utc": 1749198618.0,
              "replies": [
                {
                  "id": "mwahvkx",
                  "author": "PARANOIAH",
                  "body": "You can block it with Revanced. Smarttube can do it for TVs if it is compatible with your TV.",
                  "score": 5,
                  "created_utc": 1749204772.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mw4nua2",
          "author": "Aurakol",
          "body": "Thanks! Luckily it's not even installed on my phone (yet)  but definitely going to keep an eye out for it",
          "score": 11,
          "created_utc": 1749129036.0,
          "replies": []
        },
        {
          "id": "mw6ajw4",
          "author": "bramtyr",
          "body": "# Steps on how to disable Glance in Samsung device*\n\n\n\n^(\\*(for now))",
          "score": 7,
          "created_utc": 1749146166.0,
          "replies": []
        },
        {
          "id": "mw80sv6",
          "author": "lazy_tenno",
          "body": "Fucking hell, seems like more complicated. I was using Realme devices and it was easier to disable with less steps. Though it will be enabled again every phone updates without your permission. Fuck glance, and that's why the playstore ratings are under 3 stars.",
          "score": 2,
          "created_utc": 1749164626.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw42ikp",
      "author": "b_a_t_m_4_n",
      "body": "Enshitification proceeds apace.",
      "score": 86,
      "created_utc": 1749120496.0,
      "replies": [
        {
          "id": "mw4s7pw",
          "author": "PARANOIAH",
          "body": "I would say that this is worse than enshittification. What the fuck were they thinking?!",
          "score": 7,
          "created_utc": 1749130498.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw4610v",
      "author": "NuclearReactions",
      "body": "I already was set on switching to something non samsung, now it's sealed. The fact they even think about some dumb shit like that is enough",
      "score": 21,
      "created_utc": 1749122134.0,
      "replies": []
    },
    {
      "id": "mw45l6r",
      "author": "mrlotato",
      "body": "How are companies so out of touch that they think we want fucking ads.. im about to just get a straight up dumb phone this shit is annoying",
      "score": 39,
      "created_utc": 1749121934.0,
      "replies": [
        {
          "id": "mw49row",
          "author": "brokencappy",
          "body": "They don’t care what consumers think, only shareholders.",
          "score": 36,
          "created_utc": 1749123760.0,
          "replies": [
            {
              "id": "mw4cw08",
              "author": "mrlotato",
              "body": "yeah might be controversial but I think this capitalism thing is getting out of hand",
              "score": 15,
              "created_utc": 1749125022.0,
              "replies": [
                {
                  "id": "mw57goc",
                  "author": "Candle1ight",
                  "body": "Red scare propaganda completely broke America. Anything short of unrestricted capitalism doesn't even register in a majority of people's brains.",
                  "score": 8,
                  "created_utc": 1749135136.0,
                  "replies": [
                    {
                      "id": "mw5bw4v",
                      "author": "mrlotato",
                      "body": "this probably isnt the subreddit to discuss this but red scare propoganda is so deep seated that I'm a marxist and I lean heavy towards communism and I \\*still\\* have a spilt second of anxiety when I see a hammer and sickle. its so wild how instilled it was in my schooling growing up",
                      "score": 1,
                      "created_utc": 1749136410.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mw7ahuz",
          "author": "lexievv",
          "body": "They're very much in touch..... with the thought of money. \n\nAlso, I think you'd be surprised how many people would find this \"cool\".",
          "score": 1,
          "created_utc": 1749156351.0,
          "replies": []
        },
        {
          "id": "mwfek7t",
          "author": "NeuroXc",
          "body": "Ads on your 2000 dollar phone. Just like the ads on your 1000 dollar TV.",
          "score": 0,
          "created_utc": 1749263868.0,
          "replies": [
            {
              "id": "mwfjl2r",
              "author": "mrlotato",
              "body": "bro lol if anyone is out there buying a 2k phone and a 1k tv, they deserve ads",
              "score": -1,
              "created_utc": 1749265903.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mw41yr8",
      "author": "diacewrb",
      "body": "It is opt-in, at least for now.",
      "score": 21,
      "created_utc": 1749120230.0,
      "replies": [
        {
          "id": "mwfem9c",
          "author": "NeuroXc",
          "body": "Who would opt in to this? I'm just curious.",
          "score": 1,
          "created_utc": 1749263891.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw4693g",
      "author": "snil4",
      "body": "Samsung just lost a bunch of customers, it's not like I used any of their phones since the S3 but I know which phone I won't buy next.",
      "score": 20,
      "created_utc": 1749122236.0,
      "replies": [
        {
          "id": "mw4dmgr",
          "author": "Lobster_fest",
          "body": "No they didn't. 99.99% of buyers won't know about this feature. They'll make back in ad money what they lose in sales 20 fold.",
          "score": 5,
          "created_utc": 1749125313.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw45hz7",
      "author": "KrackSmellin",
      "body": "Nope… sorry but I just paid how much for a device that’ll do what?  F that,..",
      "score": 8,
      "created_utc": 1749121895.0,
      "replies": []
    },
    {
      "id": "mw4rgli",
      "author": "PARANOIAH",
      "body": ">\"Glance AI is coming to numerous Samsung phones as an opt-in experience this month.\"\n\nHow about \"no fucking thank you\"? Advertising baked into your unwanted bloatware? The execs at Samsung who green-lit this must be deranged or something.\n\n* Advertising.\n* Potentially privacy infringing AI slop (or at the very least straight up creepy) using the user's likeness.\n* Bloatware taking up storage on the device.\n\nI don't see how it benefits the user in any way, shape or form.",
      "score": 8,
      "created_utc": 1749130246.0,
      "replies": []
    },
    {
      "id": "mw437mg",
      "author": "LookOverThere305",
      "body": "Welp never buying a Samsung",
      "score": 17,
      "created_utc": 1749120827.0,
      "replies": [
        {
          "id": "mw82hr3",
          "author": "lazy_tenno",
          "body": "I was using two realme phones previously and the glance app were installed by default. Even after you disabled it, it will be automatically enabled again every phone updates without your permission. It's a filthy cheap chinese phones, so it's understandable.\n\nNow i just switched to samsung a56, a company that is supposed to be known for its lack of ads, but turns out partnering with glance as well? Fuck this shit.\n\nAlso, avoid any samsung phones with the exynos chipset. The modem is fucking terrible. My phone is struggling with mobile data and wifi signal compared with my old filthy cheap realme phones. I did extensive research and my samsung a56 get lower 10 dbm signal strength on average.\n\nWith that lower average, that means any phones with this chipset will get worse battery drain rate during off screen (with mobile data on/plane mode off) compared with phones with better modem.",
          "score": 1,
          "created_utc": 1749165214.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw4afkp",
      "author": "jalapenyolo",
      "body": "*Puts tape over forward camera*\n\nI almost never take selfies.  If I do I can turn the phone around like before front facing cams.",
      "score": 5,
      "created_utc": 1749124037.0,
      "replies": [
        {
          "id": "mw4std0",
          "author": "PARANOIAH",
          "body": "Same. The only time I vaguely use the front camera is to use the phone as a mirror to tidy my hair or something.",
          "score": 1,
          "created_utc": 1749130696.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw4cyfg",
      "author": "antman1983",
      "body": "- Everyone disliked that -",
      "score": 6,
      "created_utc": 1749125049.0,
      "replies": []
    },
    {
      "id": "mw44lkh",
      "author": "baubau05",
      "body": "Not this shit. It's basically malware. It was on my phone and I was able to disable the app and it never bothered me but my dad's phone which was a bit older had this and even if you cleared the data, turned off internet access and disabled the app, it still managed to come back somehow possibly due to limitations of the older android version. I used to do this every time I used my dad's phone and the next time I saw it would be back. And the ads were full screen too. Hopefully it would be easier to disable it completely on the samsung devices using the new android versions and they don't manually block it from being disabled.",
      "score": 4,
      "created_utc": 1749121478.0,
      "replies": []
    },
    {
      "id": "mw494tx",
      "author": "MattiasCrowe",
      "body": "This is the onion right",
      "score": 4,
      "created_utc": 1749123492.0,
      "replies": []
    },
    {
      "id": "mw4gb8l",
      "author": "1leggeddog",
      "body": "God damn this is awful",
      "score": 5,
      "created_utc": 1749126346.0,
      "replies": []
    },
    {
      "id": "mw4lkmt",
      "author": "Memes_the_thing",
      "body": "Bad. No. Back in the oven. You didn’t cook. People are dead of food poisoning. Also why would they think this is a good idea . This will freak 99% of people tf our",
      "score": 4,
      "created_utc": 1749128253.0,
      "replies": []
    },
    {
      "id": "mw4ugit",
      "author": "friso1100",
      "body": "Somehow it's gone beyond an invasion of privacy. This feels like an invasion of personal space.\n\nLike someone in a dark and damp alley suddenly grabbing you by your shoulders from behind and whispering in your ear \"have you heard about squarespace?\"",
      "score": 3,
      "created_utc": 1749131230.0,
      "replies": []
    },
    {
      "id": "mw508yh",
      "author": "SaiyanRajat",
      "body": "Hoping EU creates another law to force this kind of bullshit out of electronics, including the stock rom and locked bootloader.",
      "score": 3,
      "created_utc": 1749133031.0,
      "replies": []
    },
    {
      "id": "mw8z64p",
      "author": "h3rpad3rp",
      "body": "I've already bought my last Samsung product awhile ago. \n\nThey make some of the least reliable home appliances in the game, advertise to you on your $1000 phone, and advertise to you on your $1000+ TV. I'm sure it is only a matter of time before ads start showing up on their PC monitors as well.",
      "score": 3,
      "created_utc": 1749177119.0,
      "replies": [
        {
          "id": "mwaoz7u",
          "author": "Scalybeast",
          "body": "I wouldn’t be surprised they already do since some of their monitors run on their TV OS.",
          "score": 1,
          "created_utc": 1749208297.0,
          "replies": [
            {
              "id": "mwcm2jw",
              "author": "h3rpad3rp",
              "body": "Yeah, A 4k monitor was my last Samsung purchase, and I can see the writing on the wall for the direction they are going to take their monitors. The screen is nice, but it it doesn't like to connect to my computer quite often and to fix it I have to unplug/plugin the display port cable. Maybe that is Samsung's fault, maybe it is Nvidia's fault, but I've not had the issue with any other monitor that I plug into the PC.\n\nMy real concern is that it is trying to have smart TV features, it can connect to the internet and stream netflix/amazon/disney/etc directly. I didn't give it my wifi info though, and only use it for my PC via display port.\n\nHaven't had any ads on it or I would have sold it already.",
              "score": 2,
              "created_utc": 1749230523.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mwa6h72",
      "author": "GeneralCommand4459",
      "body": "\"The company claims that your images won't be used for any other purpose or shared with third parties without your consent.\"\n\nThat seems fine and you think you are going to be asked to give your consent to sharing with third parties, but the next line seems to say you've already given this consent by using the service:\n\n\"By using the service, you agree to some tracking, including your general location, and some of that data will be shared with partners.\"\n\nAs such there likely isn't a way to use it without giving your consent to sharing with third parties.",
      "score": 3,
      "created_utc": 1749197975.0,
      "replies": []
    },
    {
      "id": "mw46fwm",
      "author": "Faramzo",
      "body": "Doritos Dew it right!",
      "score": 2,
      "created_utc": 1749122319.0,
      "replies": []
    },
    {
      "id": "mw47uw7",
      "author": "ShadowBannedAugustus",
      "body": "This enshitification era has to hit a wall at some point soon! Right? ... Right?",
      "score": 2,
      "created_utc": 1749122939.0,
      "replies": []
    },
    {
      "id": "mw4bc4z",
      "author": "FdPros",
      "body": "what the fuck",
      "score": 2,
      "created_utc": 1749124404.0,
      "replies": []
    },
    {
      "id": "mw4hgek",
      "author": "i_am_really_b0red",
      "body": "Samsung is already going to charge people for AI and then do this, wow",
      "score": 2,
      "created_utc": 1749126771.0,
      "replies": []
    },
    {
      "id": "mw4kkzw",
      "author": "50Shekel",
      "body": "Wow. Coming up on my next upgrade and it definitely won't be a Samsung. Been with Samsung ever since I got my first smartphone. Bummer.",
      "score": 2,
      "created_utc": 1749127905.0,
      "replies": []
    },
    {
      "id": "mw4o6wj",
      "author": "starker",
      "body": "“Hold on, I need to watch this ad of myself on a slip and slide for 10s before I can unlock my phone.”",
      "score": 2,
      "created_utc": 1749129155.0,
      "replies": []
    },
    {
      "id": "mw4q18u",
      "author": "ButchTheGuy",
      "body": "If phones becomes this locked down by ads I’m just gonna get a flip phone. It’s already a detriment to my life so it won’t be difficult",
      "score": 2,
      "created_utc": 1749129771.0,
      "replies": []
    },
    {
      "id": "mw4r101",
      "author": "HeadfulOfSugar",
      "body": "One time on Snapchat I got an Old Navy ad that recreated my face from all my Snapchat memories, and plastered it onto a models body to show how I would look in the outfits they were selling. Never viewed a single thing on that app besides my messages/GCs after that lol",
      "score": 2,
      "created_utc": 1749130102.0,
      "replies": []
    },
    {
      "id": "mw5j3lo",
      "author": "Wafflesakimbo",
      "body": "Smasnug has been garbage for a long time, this is just more garbage. If this becomes an industry trend I'm going back to a dumb phone.",
      "score": 2,
      "created_utc": 1749138455.0,
      "replies": []
    },
    {
      "id": "mw5xj5h",
      "author": "None",
      "body": "Who asked for this, specifically?",
      "score": 2,
      "created_utc": 1749142567.0,
      "replies": []
    },
    {
      "id": "mw6td9c",
      "author": "AsteriusNeon",
      "body": "Good to know this is the last Samsung I'll ever own.",
      "score": 2,
      "created_utc": 1749151554.0,
      "replies": []
    },
    {
      "id": "mw7s1yy",
      "author": "yingele",
      "body": "Goodbye, Samsung",
      "score": 2,
      "created_utc": 1749161693.0,
      "replies": []
    },
    {
      "id": "mw92g86",
      "author": "andy41tw",
      "body": "Just don’t buy Samsung and any other brands try to do the same.",
      "score": 2,
      "created_utc": 1749178349.0,
      "replies": []
    },
    {
      "id": "mw9bfxl",
      "author": "Recon_Figure",
      "body": "🖕🖕🖕 You had middle fingers at \"lock screen ads.\"",
      "score": 2,
      "created_utc": 1749181787.0,
      "replies": []
    },
    {
      "id": "mwa537r",
      "author": "themindisaweapon",
      "body": "Think I'll keep using my iphone.",
      "score": 2,
      "created_utc": 1749197124.0,
      "replies": [
        {
          "id": "mwfp7zv",
          "author": "HellP1g",
          "body": "Yeah same. Siri sucks and Apple AI has been dogshit…..but at least Apple doesn’t do shit like this. Samsung….the fuck?",
          "score": 2,
          "created_utc": 1749268333.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw44vy0",
      "author": "psilent",
      "body": "Honestly, I don’t hate the ad personalization because I bet some of them will end up looking ridiculous, and that’ll be funny. But lock screen ads sounds like an infuriating concept. Hey, do you remember when you used to be able to look at the picture of your family here? Well, how about an ad for IBS medication with a photo of you looking like you need to shit all your coworkers just saw when you pulled up your phone?",
      "score": 3,
      "created_utc": 1749121612.0,
      "replies": []
    },
    {
      "id": "mw448bw",
      "author": "YZYSZN1107",
      "body": "I sold my 24 Ultra a few days ago. seems like the right move right about now.",
      "score": 1,
      "created_utc": 1749121305.0,
      "replies": []
    },
    {
      "id": "mw47j3b",
      "author": "E_K_Finnman",
      "body": "Futurama already did this concept in episode 6",
      "score": 1,
      "created_utc": 1749122796.0,
      "replies": []
    },
    {
      "id": "mw47zzf",
      "author": "GlxxmySvndxy",
      "body": "Trash",
      "score": 1,
      "created_utc": 1749123003.0,
      "replies": []
    },
    {
      "id": "mw4bzce",
      "author": "afr0physics",
      "body": "“Should you choose to wade into the murky waters of AI shopping, Glance will have you take a selfie and provide some basic body type details. From there, it uses Google Gemini and Imagen to create fashion ads tailored to you—because they are you. Your lock screen will be populated with images of you \"in outfits and destinations [you] would never imagine.\" Naturally, you will be able to buy the looks chosen for you with a tap, which fills Glance's coffers.”",
      "score": 1,
      "created_utc": 1749124663.0,
      "replies": []
    },
    {
      "id": "mw4e857",
      "author": "joaks18",
      "body": "r/nottheonion",
      "score": 1,
      "created_utc": 1749125549.0,
      "replies": []
    },
    {
      "id": "mw4iwsx",
      "author": "gtedvgt",
      "body": "Fully opt in, that's good. Though it's a strange partnership, I don't see how it's worth it for samsung.",
      "score": 1,
      "created_utc": 1749127307.0,
      "replies": []
    },
    {
      "id": "mw4jxu3",
      "author": "FeebysPaperBoat",
      "body": "Time to start covering our phone cameras when not in use again, folks. Used to do it on the pc and now we’ve come full circle.",
      "score": 1,
      "created_utc": 1749127678.0,
      "replies": []
    },
    {
      "id": "mw4k5oz",
      "author": "blueblurz94",
      "body": "No thanks, I’m good without having companies taking my face and using it however they want.",
      "score": 1,
      "created_utc": 1749127757.0,
      "replies": []
    },
    {
      "id": "mw4kk6j",
      "author": "Buzstringer",
      "body": "No siree! [https://www.youtube.com/watch?v=XPGgTy5YJ-g](https://www.youtube.com/watch?v=XPGgTy5YJ-g)",
      "score": 1,
      "created_utc": 1749127897.0,
      "replies": []
    },
    {
      "id": "mw4wqlv",
      "author": "Wembledon_Shanley",
      "body": "Cool. Fuck that straight to hell.",
      "score": 1,
      "created_utc": 1749131950.0,
      "replies": []
    },
    {
      "id": "mw50zx6",
      "author": "KryptCeeper",
      "body": "Put ads on my lockscreen Samsung... watch how fast my os suddenly turns into CFW",
      "score": 1,
      "created_utc": 1749133255.0,
      "replies": [
        {
          "id": "mw586d5",
          "author": "Candle1ight",
          "body": "Modern Samsung phones all have locked bootloaders last time I checked",
          "score": 1,
          "created_utc": 1749135341.0,
          "replies": [
            {
              "id": "mw8szy1",
              "author": "breadtheripper",
              "body": "Locked bootloaders by default*  \nDepending on the model, you can unlock it simply by using the developer options. You can check XDA nd see",
              "score": 1,
              "created_utc": 1749174819.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mw5c3qa",
      "author": "action_turtle",
      "body": "Phone only unlocks once ad plays AND it uses eye tracking to make sure you are watching it! Dystopia is not far",
      "score": 1,
      "created_utc": 1749136470.0,
      "replies": [
        {
          "id": "mw90dh1",
          "author": "h3rpad3rp",
          "body": "Soon we'll be drinking verification cans of mountain dew...",
          "score": 1,
          "created_utc": 1749177568.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw5her9",
      "author": "2Autistic4DaJoke",
      "body": "That feels illegal",
      "score": 1,
      "created_utc": 1749137978.0,
      "replies": []
    },
    {
      "id": "mw5myd9",
      "author": "starvald_demelain",
      "body": "Adding Samsung to the list of companies to avoid, got it.",
      "score": 1,
      "created_utc": 1749139556.0,
      "replies": []
    },
    {
      "id": "mw5twzf",
      "author": "None",
      "body": "I'll switch to apple if I can't disable this. I love android, but this isn't worth it.",
      "score": 1,
      "created_utc": 1749141555.0,
      "replies": []
    },
    {
      "id": "mw5xapy",
      "author": "Final_Light_",
      "body": "Uncle Ted was right.",
      "score": 1,
      "created_utc": 1749142502.0,
      "replies": []
    },
    {
      "id": "mw61qsy",
      "author": "Dependent-Ground7689",
      "body": "Welp I’m gonna go out of my way to not support samsung",
      "score": 1,
      "created_utc": 1749143742.0,
      "replies": []
    },
    {
      "id": "mw663y3",
      "author": "pierrechaquejour",
      "body": "What is it about AI that makes these people want to use it for the most absurd sadistic applications possible",
      "score": 1,
      "created_utc": 1749144948.0,
      "replies": []
    },
    {
      "id": "mw67gj2",
      "author": "ChillAMinute",
      "body": "In other news, Samsung complains when people place small bits of tape over their front facing cameras.",
      "score": 1,
      "created_utc": 1749145321.0,
      "replies": []
    },
    {
      "id": "mw69qz8",
      "author": "jolhar",
      "body": "Yeah, how bout get fucked?",
      "score": 1,
      "created_utc": 1749145945.0,
      "replies": []
    },
    {
      "id": "mw6beiy",
      "author": "Dependent-Ground7689",
      "body": "If I see an ad pop up in the middle of something I watch I immediately feel disdain towards whatever company made the ad",
      "score": 1,
      "created_utc": 1749146402.0,
      "replies": []
    },
    {
      "id": "mw6cx5r",
      "author": "x42f2039",
      "body": "Yet another reason I use iPhone",
      "score": 1,
      "created_utc": 1749146842.0,
      "replies": []
    },
    {
      "id": "mw6f5yw",
      "author": "PARANOIAH",
      "body": "They already have something that works in a similar way on the lockscreen wallpaper called \"Samsung Global Goals\" which is incredibly obnoxious and I've had to help my dad remove it from his phone a couple of times already - it's too easy to accidentally activate it.",
      "score": 1,
      "created_utc": 1749147492.0,
      "replies": []
    },
    {
      "id": "mw6g7w1",
      "author": "eddie1996",
      "body": "That's a no for me, dog.",
      "score": 1,
      "created_utc": 1749147793.0,
      "replies": []
    },
    {
      "id": "mw6h4jc",
      "author": "Siliziumwesen",
      "body": "I fucking hate ads. Never gave a shit and never will. This idea is Like something out of black mirror ffs",
      "score": 1,
      "created_utc": 1749148053.0,
      "replies": []
    },
    {
      "id": "mw6ibc1",
      "author": "crappy_ninja",
      "body": "This is the kind of thing that would make me put a hammer to my phone",
      "score": 1,
      "created_utc": 1749148397.0,
      "replies": []
    },
    {
      "id": "mw6mo37",
      "author": "JohnJohn173",
      "body": "Thank god I use the fingerprint sensor",
      "score": 1,
      "created_utc": 1749149642.0,
      "replies": []
    },
    {
      "id": "mw888np",
      "author": "CzarAce",
      "body": "The day I go to check my phone and there’s an ad on my mfkin lock screen, I’m smashing it with a hammer",
      "score": 1,
      "created_utc": 1749167257.0,
      "replies": []
    },
    {
      "id": "mw9p6sf",
      "author": "Apophthegmata",
      "body": "I just got an update for my Motorola and found that there were now ads /algorithmic news feed on my lock screen. Thankfully, I was able to go into the settings and turn it off.",
      "score": 1,
      "created_utc": 1749188173.0,
      "replies": []
    },
    {
      "id": "mwako9a",
      "author": "y2k4you",
      "body": "If I see this happen on my phone, ever, my next response will be to destroy the phone with a hammer and never purchase a Samsung product again. Im already mentally very close to not using smartphones anymore.",
      "score": 1,
      "created_utc": 1749206252.0,
      "replies": []
    },
    {
      "id": "mwe10q3",
      "author": "po3smith",
      "body": "lol - any device that has ads based on were or how or when or why I unlock a device will be locked.....because I would never buy one and if given one would throw it in the ocean. WOW! GOD that joke from Ready Player One about screen real estate vs ad space is becoming more and more real!",
      "score": 1,
      "created_utc": 1749245932.0,
      "replies": []
    },
    {
      "id": "mwftdez",
      "author": "TurboBerries",
      "body": "Damn i was probably gonna get the new galaxy for my next phone but guess ill be sticking with apple forever now",
      "score": 1,
      "created_utc": 1749270221.0,
      "replies": []
    },
    {
      "id": "mwfz4n1",
      "author": "SafeModeOff",
      "body": "Mainstream tech company have a good idea challenge impossible",
      "score": 1,
      "created_utc": 1749273021.0,
      "replies": []
    },
    {
      "id": "mwhdy4c",
      "author": "jackmax9999",
      "body": "If I see my face on an AI-generated ad on my phone, I'm throwing the phone in the garbage and gonna live in the woods like Ted Kaczynski.",
      "score": 1,
      "created_utc": 1749300924.0,
      "replies": []
    },
    {
      "id": "mwjh473",
      "author": "Gazoko",
      "body": "Nah man",
      "score": 1,
      "created_utc": 1749325524.0,
      "replies": []
    },
    {
      "id": "mwpn1bd",
      "author": "MountainAny320",
      "body": "Time to dump scamsung",
      "score": 1,
      "created_utc": 1749412892.0,
      "replies": []
    },
    {
      "id": "mwq74dq",
      "author": "filoftea",
      "body": "Lois is fuming right this second!",
      "score": 1,
      "created_utc": 1749419215.0,
      "replies": []
    },
    {
      "id": "mwulmtl",
      "author": "A911owner",
      "body": "I guess Black Mirror had to become a reality at some point.",
      "score": 1,
      "created_utc": 1749484280.0,
      "replies": []
    },
    {
      "id": "mxhejfo",
      "author": "_RADIANTSUN_",
      "body": "Everyone in this comment section is exhibiting a strong negative reaction but the world is not Reddit: advertising continues to fuel almost all mainstream forms of pretty much everything because... **it works.**\n\nMost consumers who experience this kind of AI generated advertising \"self insert\" will just say \"Wow!' and buy more of those products. The companies that don't engage in it will inevitably be left behind. Get used to it. This is the world we live in now.",
      "score": 1,
      "created_utc": 1749776198.0,
      "replies": []
    },
    {
      "id": "mw4tey3",
      "author": "None",
      "body": "Hey, \n\nThose apple devices don’t look so bad, now do they?",
      "score": 1,
      "created_utc": 1749130894.0,
      "replies": [
        {
          "id": "mw5p7ai",
          "author": "BluePeriod_",
          "body": "Android is always the first to pull shit like this lol",
          "score": 2,
          "created_utc": 1749140205.0,
          "replies": []
        },
        {
          "id": "mw8zrek",
          "author": "h3rpad3rp",
          "body": "Unfortunately, as much as I like Apple for their stance on privacy, I just cannot stand IOS. I've been using an Apple phone for work for like 6 years, and I still hate every single moment that I have to use the thing as anything other than a phone.\n\nUnfortunately Android was made by a personal data mining advertising company... So it feels pretty bad to like Android more at this point.\n\nBut hey, at least I can tell Samsung to go pound sand next time I need a phone.",
          "score": 1,
          "created_utc": 1749177339.0,
          "replies": [
            {
              "id": "mw9av9e",
              "author": "None",
              "body": "There are some privacy focused versions of android you can probably use. I think most android phones let you install them. \n\nI haven’t had an android in a long time but from what I remember, only issue you run into is some apps like banking, payment, etc don’t work with them. \n\nMight be something you can look into.",
              "score": 1,
              "created_utc": 1749181550.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mw61if6",
          "author": "EdgiiLord",
          "body": "If you ever think Apple is gonna save you from the privacy nightmare, I have a bridge to sell to you.",
          "score": 1,
          "created_utc": 1749143678.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw6pfsi",
      "author": "cum-yogurt",
      "body": "Lol keep making fun of Apple users though, ya commodities",
      "score": 0,
      "created_utc": 1749150438.0,
      "replies": []
    },
    {
      "id": "mw51r02",
      "author": "D0KUT0",
      "body": "So apple prices going up because “tarrifs” and samsung are adding adds. Had a bad experience with my OnePlus 3T bricking itself one morning, and my only other device had been a LG G3 and they’re not really in the game anymore. Any suggestions on who to switch to?",
      "score": 0,
      "created_utc": 1749133477.0,
      "replies": []
    },
    {
      "id": "mw6gqjv",
      "author": "correctingStupid",
      "body": "\"why do they keep putting ads into new places\" \n-says angry redditor using ad blocker on ad-funded website ",
      "score": 0,
      "created_utc": 1749147942.0,
      "replies": [
        {
          "id": "mw90uto",
          "author": "h3rpad3rp",
          "body": "It is one thing for a free website to try and force its users to view ads.\n\nIt is quite another thing for a company to sell you a $1000+ device and then push creepy ads that use your own likeness to try to manipulate you.\n\nIt is opt in, for now, but it is pretty unlikely to stay that way imo.",
          "score": 3,
          "created_utc": 1749177747.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw6r42x",
      "author": "chumlySparkFire",
      "body": "Another reason to go to iPhone.  Samsung is 24/7 privacy invasion.   Obviously",
      "score": 0,
      "created_utc": 1749150918.0,
      "replies": []
    },
    {
      "id": "mw5kdve",
      "author": "Aleix0",
      "body": "Rage bait. Are people not reading the article? This is an opt-in experience people have to go out of their way to get an app for. If ever this is pre-installed and opt out (or forced) then the yes the outrage would be justified. ",
      "score": -4,
      "created_utc": 1749138817.0,
      "replies": []
    },
    {
      "id": "mw45ezd",
      "author": "IBJON",
      "body": "I guess nobody read the article? It's Opt-in only. ",
      "score": -22,
      "created_utc": 1749121856.0,
      "replies": [
        {
          "id": "mw4683a",
          "author": "NuclearReactions",
          "body": "Doesn't change anything. Setting precedents aside it's a political statement.",
          "score": 16,
          "created_utc": 1749122223.0,
          "replies": []
        },
        {
          "id": "mw46m7k",
          "author": "Komikaze06",
          "body": "That's how it always starts",
          "score": 16,
          "created_utc": 1749122396.0,
          "replies": []
        },
        {
          "id": "mw47p1j",
          "author": "romaraahallow",
          "body": "\"opt-in, for now.\"\n\n\nOnce you get enough people used to it you can just roll that shit out full stop.",
          "score": 12,
          "created_utc": 1749122868.0,
          "replies": []
        },
        {
          "id": "mw4ufw3",
          "author": "IndependenceFetish",
          "body": "You're clearly new to technology. \n\"Opt-in\" is how it always starts. Give the illusion of choice to the consumer. You can turn it off, but they can still perform an update to turn it back on...permanently. Once news and discussion about said \"opt-in\" has died down and people forget.\n\nDon't believe me. Check out Microsoft Recall.",
          "score": 4,
          "created_utc": 1749131225.0,
          "replies": []
        }
      ]
    }
  ]
}