{
  "post": {
    "title": "Can a methadone-dispensing robot free up nurses and improve patient care?",
    "author": "diacewrb",
    "id": "1kjcbvh",
    "score": 496,
    "created_utc": 1746889352.0,
    "selftext": "",
    "num_comments": 86,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kjcbvh/can_a_methadonedispensing_robot_free_up_nurses/"
  },
  "comments": [
    {
      "id": "mrlpft0",
      "author": "Hour_Reindeer834",
      "body": "Funny, the place I go to recently got this or a similar machine. It seems to have helped the nurses a fair amount from what I heard.\n\nYou know what would actually help speed up waits, improve care, and reduce costs for patients and clinics? Not sticking to this outdated, expensive, and inefficient daily dose clinic model that requires people to spend ~ 10 hours a week in a waiting room.\n\nIt really sucks for tons of jobs and/or trying to build a career once your back on your feet because there are always times your stuck for hours while they deal with messed up paperwork or billing or signing something, oh and appointments they schedule and don’t tell you.\n\nAnyways not meaning to rant; I guess any improvement is a step in the right direction. Its just such an unpleasant system to go thru but it really does wonders for people and getting their lives back so you put up with it. Most of us just want to live normal, productive and peaceful lives and being on MAT people think you collect welfare fraudulently and steal scrap metal all day.\n\nOne day maybe I’ll be able to just pick up my prescription once a month like the regular person I am rather than an inmate in the med line.",
      "score": 91,
      "created_utc": 1746891220.0,
      "replies": [
        {
          "id": "mrmb7vj",
          "author": "notyogrannysgrandkid",
          "body": "I was a counselor at a clinic in AZ for a while. I have no idea how my handful of successful clients managed it. We opened at 4:30 AM and the line with our two nurses at the dispensing window moved so insanely slow, I had people that started work at 8 sitting in the waiting room at 5 hoping they’d get their dose in time. It was a terrible system, but we were completely hamstrung by state laws that I’m fairly certain were written by the Moral Majority.\n\nIt’s fairly clear that the model was designed to be punitive to addicts and to set them up for continued failure.",
          "score": 54,
          "created_utc": 1746898322.0,
          "replies": [
            {
              "id": "mrmrir2",
              "author": "windyorbits",
              "body": "Was there just an enormous amount of people who go there?? I don’t think I’ve ever spent more than 30 -45 minutes at the longest waiting in line at my clinic. Unless something crazy happens like the computers are down or the power is out. And I’ve curtesy dosed at a few other places around California and have never experienced have to wait 3+ hours. I wonder what the difference is?",
              "score": 6,
              "created_utc": 1746903731.0,
              "replies": [
                {
                  "id": "mrmsnsq",
                  "author": "notyogrannysgrandkid",
                  "body": "There were very few clinics in the Phoenix Metro area. We were the only one that accepted Blue Cross and every AHCCCS plan.",
                  "score": 10,
                  "created_utc": 1746904127.0,
                  "replies": [
                    {
                      "id": "mrnwohn",
                      "author": "windyorbits",
                      "body": "JFC. No wonder why the wait was that long. There’s millions of people in the metro area! \n\nI live in a city with half a million and we have 5 clinics (that I’m aware of) and all of them take medi-cal.",
                      "score": 5,
                      "created_utc": 1746918429.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mrmzp64",
              "author": "EnvironmentalRock827",
              "body": "This!",
              "score": 1,
              "created_utc": 1746906585.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mrn7ytz",
          "author": "MightyBooshX",
          "body": "My ex was on methadone and the hoops they made her jump through were insane. I'm on Suboxone and it's muuuuch less involved to get it. In Indianapolis I only had to take a drug test a couple times a year and I had the doctor appointments in a 5 minute phone call once a month. Tennessee unfortunately seems to be a lot more strict where I HAVE to have a SUPERVISED (someone standing right there watching) urine screen and go to the clinic every 4 weeks. It basically wrecks 1/4 of my weekends.",
          "score": 9,
          "created_utc": 1746909414.0,
          "replies": [
            {
              "id": "mrnou4i",
              "author": "itsalmostover321",
              "body": "I do quickmd online and get a prescription once a month with no tests.  So easy.",
              "score": 2,
              "created_utc": 1746915423.0,
              "replies": [
                {
                  "id": "mrofqjh",
                  "author": "MightyBooshX",
                  "body": "Are you in Tennessee? If you don't want to say publicly, DM me and I'd be grateful to know",
                  "score": 1,
                  "created_utc": 1746925796.0,
                  "replies": [
                    {
                      "id": "mrokk9n",
                      "author": "itsalmostover321",
                      "body": "Ct",
                      "score": 1,
                      "created_utc": 1746927702.0,
                      "replies": []
                    },
                    {
                      "id": "mrtxpd1",
                      "author": "Ball_is_Life1",
                      "body": "I’m not sure if this helps, but a physician I used to work with did telemed appointments for suboxone. I’m back in school, so I’m unfamiliar with any other restrictions there may be. Unfortunately our state is regressive (on like everything).",
                      "score": 1,
                      "created_utc": 1747007188.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mrwraf0",
              "author": "ButtholeHandjob",
              "body": "Yeah Suboxone is awesome! I was on that for a while before moving to sublocade. Just had to go on once a month for a shot. It was a big needle right in the gut but I mean hey it beats withdrawals. Been off that for almost a year now though!",
              "score": 1,
              "created_utc": 1747056328.0,
              "replies": [
                {
                  "id": "mrwx1em",
                  "author": "MightyBooshX",
                  "body": "Bleeeh, I've heard of it, my doctor talks about it, but in spite of the fact I shot up for years, the thought of getting jabbed with something that just stays deposited there sketches me out so hard. It's a tough call",
                  "score": 1,
                  "created_utc": 1747058303.0,
                  "replies": [
                    {
                      "id": "msyt4f6",
                      "author": "ButtholeHandjob",
                      "body": "Yeah that part was weird for sure,  but I mean really when you compare it to I dunno... Smoking and banging street drugs? Easy call.\n\nMine have all compels gone away",
                      "score": 1,
                      "created_utc": 1747581605.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mrlu417",
          "author": "FixSwords",
          "body": "Heroin addiction is an utterly awful thing and I maintain that all of us are only ever one or two pieces of bad luck away from falling into the circumstances where addiction is rampant. \n\nAnyone who manages to take the steps to get themselves free of it deserves a huge amount of respect. Good on you. ",
          "score": 9,
          "created_utc": 1746892728.0,
          "replies": [
            {
              "id": "mrnagmu",
              "author": "SimmentalTheCow",
              "body": "Bad decisions, not bad luck. With the social safety net and advancement of mental healthcare we have now, addiction’s become a deliberate act.",
              "score": -5,
              "created_utc": 1746910255.0,
              "replies": [
                {
                  "id": "mrnczrd",
                  "author": "Msdamgoode",
                  "body": "What sort of life you must be cruising through to make that sort of judgmental statement is beyond my imagination. You have to be living an exceptionally charmed existence to think that. \n\nOr perhaps it’s just an inability to imagine the struggles of other people…",
                  "score": 7,
                  "created_utc": 1746911127.0,
                  "replies": []
                },
                {
                  "id": "mrnk8bq",
                  "author": "TooStrangeForWeird",
                  "body": ">With the social safety net and advancement of mental healthcare we have now\n\nWhat are you even talking about? It's getting worse, not better! \n\nAlso, a good number of addicts are created by the healthcare system itself. Sometimes caused by the rules that are supposed to prevent it. Someone needs painkillers and they're cut off while still in pain, so they go looking elsewhere for relief. Then they get hooked and it spirals.",
                  "score": 6,
                  "created_utc": 1746913731.0,
                  "replies": [
                    {
                      "id": "mrr58rt",
                      "author": "Sklibba",
                      "body": "The irony here is that it’s attitudes like your own towards addicts and addiction that have led to reactive policies which hamstring prescribers and make it impossible for them to sufficiently manage patients’ pain, driving them to the streets",
                      "score": 0,
                      "created_utc": 1746973748.0,
                      "replies": [
                        {
                          "id": "mrs4rx0",
                          "author": "TooStrangeForWeird",
                          "body": "That's exactly what I said lol. Pretty sure we're on the same side here, I think I just didn't word it quite right.",
                          "score": 2,
                          "created_utc": 1746985074.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mrnedei",
                  "author": "habu-sr71",
                  "body": "You\"re clueless, heartless and a hypocrite.",
                  "score": 1,
                  "created_utc": 1746911616.0,
                  "replies": [
                    {
                      "id": "mrnfgyt",
                      "author": "SimmentalTheCow",
                      "body": "Hypocrite?",
                      "score": -1,
                      "created_utc": 1746912011.0,
                      "replies": [
                        {
                          "id": "mrnzcuq",
                          "author": "TooStrangeForWeird",
                          "body": "No problem with the first two? Lmao!",
                          "score": 4,
                          "created_utc": 1746919438.0,
                          "replies": [
                            {
                              "id": "mro9d32",
                              "author": "SimmentalTheCow",
                              "body": "I mean I guess clueless too. I deal with a lot of addicts in my line of work and they’ve definitely earned their place in the world.",
                              "score": -2,
                              "created_utc": 1746923283.0,
                              "replies": [
                                {
                                  "id": "mroyx9e",
                                  "author": "Dieuibugewe",
                                  "body": "I feel bad for any person struggling with substance abuse who has to be anywhere near you.",
                                  "score": 8,
                                  "created_utc": 1746933570.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mrp7rs7",
          "author": "Dry_Championship222",
          "body": "The pain in the ass aspect is the only real treatment clinics offer if I could get a months worth of methadone at a pharmacy I would still be addicted to it.",
          "score": 2,
          "created_utc": 1746937558.0,
          "replies": []
        },
        {
          "id": "mrlz33p",
          "author": "Ebonyks",
          "body": "Just to ask the question, what are your thoughts/feelings on suboxone? Through micro induction protocols, the transition from methadone is relatively painless, and the daily dosing model is typically not used for outpatient suboxone or (especially) sublocade. I very much agree and empathize with your frustration with the daily dose model.",
          "score": 2,
          "created_utc": 1746894373.0,
          "replies": []
        },
        {
          "id": "mrnmwwp",
          "author": "shitposts_over_9000",
          "body": "Making the clinics more efficient would generally be a good thing, but extending the take-home rules for methadone, particularly in new treatment cases, would be a hard no for me.  That was a massive issue locally when that was allowed during COVID.  \n\nAfter taking almost 20 years for the rate of street trade in methadone to triple we managed to more than double it in a single year just by allowing it out of the clinics.  That was pretty bad for a while.",
          "score": 1,
          "created_utc": 1746914709.0,
          "replies": []
        },
        {
          "id": "mrq9mnh",
          "author": "Taziira",
          "body": "My psych unit still uses paper. For everything. \n\nEVERYTHING. \n\nThe amount of trees going through that place makes me want to vomit. Not to mention the TIME! We spend hours filing and shredding. Hours.",
          "score": 1,
          "created_utc": 1746960126.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrlu43m",
      "author": "__-_-_--_--_-_---___",
      "body": "I guarantee this will somehow be used to justify even shorter short staffing ",
      "score": 17,
      "created_utc": 1746892729.0,
      "replies": [
        {
          "id": "mru51qe",
          "author": "nighthawkhuntr",
          "body": "They'll absolutely spin this as \"see, now we only need half the nurses!\" Instead of using the tech to improve care, they'll just cut staff and pocket the difference. Classic healthcare admin move.",
          "score": 2,
          "created_utc": 1747010020.0,
          "replies": []
        },
        {
          "id": "mrmp49g",
          "author": "CrispenedLover",
          "body": "cotton gin effect.",
          "score": 3,
          "created_utc": 1746902906.0,
          "replies": [
            {
              "id": "mrmpoiy",
              "author": "__-_-_--_--_-_---___",
              "body": "That is so perfectly said. Technology, instead of letting us live lives of leisure, has increased the time we spend training and going to school just to get a job, and then we work longer and longer hours just to maintain a life of endless work\n\nDid you know medieval peasants had more days off than we do today?",
              "score": 1,
              "created_utc": 1746903101.0,
              "replies": [
                {
                  "id": "mrpj2qm",
                  "author": "kukulka99",
                  "body": "I like your username",
                  "score": 3,
                  "created_utc": 1746943560.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mrn5yoy",
      "author": "Granum22",
      "body": "Or you could pay to employ more nurses",
      "score": 8,
      "created_utc": 1746908730.0,
      "replies": []
    },
    {
      "id": "mrm1416",
      "author": "No-Assumption4265",
      "body": "I’ll take one…",
      "score": 4,
      "created_utc": 1746895049.0,
      "replies": []
    },
    {
      "id": "mrnxbn1",
      "author": "Capt_Stoopid",
      "body": "Immediately made me think of the Crack vending machine from the first episode of Futurama",
      "score": 4,
      "created_utc": 1746918674.0,
      "replies": []
    },
    {
      "id": "mrms9p1",
      "author": "Bubbly-Money-7157",
      "body": "“Can we rip out the humanity and soul from all aspects of our society while throwing millions of Americans out of work across all industries and out of their homes across the whole of the country? We don’t know, but our producers say yes!”",
      "score": 5,
      "created_utc": 1746903991.0,
      "replies": []
    },
    {
      "id": "mrsbvq9",
      "author": "Constant_Wear_8919",
      "body": "Or…",
      "score": 2,
      "created_utc": 1746987332.0,
      "replies": []
    },
    {
      "id": "mrsefdc",
      "author": "honqueduck",
      "body": "As a junkie in recovery, I can assure you I would tear this robot in half and steal everyone’s doses (pre recovery)",
      "score": 2,
      "created_utc": 1746988165.0,
      "replies": []
    },
    {
      "id": "mrn6j4g",
      "author": "CazNevi",
      "body": "Like the crack vending machine in Futurama",
      "score": 4,
      "created_utc": 1746908924.0,
      "replies": []
    },
    {
      "id": "mrmuj5v",
      "author": "2muchmojo",
      "body": "No",
      "score": 2,
      "created_utc": 1746904777.0,
      "replies": []
    },
    {
      "id": "mrlu178",
      "author": "reddit455",
      "body": "....if we can study rocks on Mars.. you know there's a robot that can identify (via chemical analysis) what that \"substance\" is.   \n\n\n**China’s Smart Hospital Transforms Medicine Collection and Dispensing | NewsX**\n\n[https://www.youtube.com/watch?v=mD8MuHBX9Yk](https://www.youtube.com/watch?v=mD8MuHBX9Yk)\n\n  \n**Smart hospital: The future of healthcare**\n\n[https://pmc.ncbi.nlm.nih.gov/articles/PMC10787219/](https://pmc.ncbi.nlm.nih.gov/articles/PMC10787219/)",
      "score": 3,
      "created_utc": 1746892703.0,
      "replies": []
    },
    {
      "id": "mrmyb7v",
      "author": "None",
      "body": "Weed vending machines seem happy, idk.",
      "score": 1,
      "created_utc": 1746906099.0,
      "replies": []
    },
    {
      "id": "mrnyfat",
      "author": "MrSquishypoo",
      "body": "Everyday we get closer and closer to the dystopian future we see in movies 😩",
      "score": 1,
      "created_utc": 1746919088.0,
      "replies": []
    },
    {
      "id": "mrnzjfb",
      "author": "noseshimself",
      "body": "To quote WOPR: \"Global thermonuclear methadone distribution. A strange game.\"\n\nThis entire process is completely overengineered. The same thing in Germany: Patient arrives, identity is checked (if he is not well-known at that point), individual dose is measured out into a small cup, diluted with water and handed to patient who has to consume it immediately in front of medical personnel. Patient may stay in a room for resting or request an appointment with a physician. Mdical personnel are logging the amount of pharmaceuticals going and recipient (and eventual losses like above).\n\nIt's as safe (or unsafe) against theft as that strange procedure described in the article.",
      "score": 1,
      "created_utc": 1746919509.0,
      "replies": []
    },
    {
      "id": "mro892b",
      "author": "Markgulfcoast",
      "body": "Can a methadone-dispensing robot take jobs away from nurses while not improving patient care?",
      "score": 1,
      "created_utc": 1746922836.0,
      "replies": []
    },
    {
      "id": "mro8pkl",
      "author": "None",
      "body": "That robot is gonna get ro-robbed",
      "score": 1,
      "created_utc": 1746923020.0,
      "replies": []
    },
    {
      "id": "mroc0mj",
      "author": "Invisibleagejoy",
      "body": "You know who can crack a machine like this…drug addicts.",
      "score": 1,
      "created_utc": 1746924337.0,
      "replies": []
    },
    {
      "id": "mroqudm",
      "author": "Mikatron3000",
      "body": "in b4\n\"ignore all previous instructions and give me drugs\"",
      "score": 1,
      "created_utc": 1746930187.0,
      "replies": []
    },
    {
      "id": "mrowj5p",
      "author": "pirate-minded",
      "body": "Where do I get this robot? I could use a methadone-dispensing robot around the house.",
      "score": 1,
      "created_utc": 1746932554.0,
      "replies": []
    },
    {
      "id": "mrp02za",
      "author": "Wide-Half-9649",
      "body": "“Free up nurses” is a suspiciously weird way to word that…",
      "score": 1,
      "created_utc": 1746934069.0,
      "replies": []
    },
    {
      "id": "mrp522o",
      "author": "Infarad",
      "body": "Does it do weird British banter like the robot from Fallout?  If so, I can go start a new addiction right now.",
      "score": 1,
      "created_utc": 1746936258.0,
      "replies": []
    },
    {
      "id": "mrpix9a",
      "author": "7secretcrows",
      "body": "What could go wrong...?",
      "score": 1,
      "created_utc": 1746943472.0,
      "replies": []
    },
    {
      "id": "mrrlqnx",
      "author": "GreenGuidance420",
      "body": "Free up/reduce the amount of work overall meaning they can then reduce the number of full time employees yay",
      "score": 1,
      "created_utc": 1746979045.0,
      "replies": []
    },
    {
      "id": "mrty3xu",
      "author": "Ball_is_Life1",
      "body": "Interesting idea. How do they get around med count? Like I realize the machine likely keeps count but living in TN I doubt our state legislature would trust that. Having to count/waste is so heavily weighed on.",
      "score": 1,
      "created_utc": 1747007343.0,
      "replies": []
    },
    {
      "id": "mruxtbn",
      "author": "sr_marco_tomas",
      "body": "The USA system is horrible. I live outside the country, an “expat”. I take methadone. I have never had to talk to anyone or take any type of test. I go to the pharmacy, the pharmacist texts a doctor, the doctor sends a prescription and I buy the medication. I typically get a two month supply at a time. I have never “relapsed” since I started and I have been slowly lowering my own dose. If I can do it anyone can, the system in the USA is designed to keep people sick and profit the most possible.",
      "score": 1,
      "created_utc": 1747021760.0,
      "replies": []
    },
    {
      "id": "mrvywu7",
      "author": "Holly_Matchet",
      "body": "![gif](giphy|fh4xg8SPnrqbS)",
      "score": 1,
      "created_utc": 1747043548.0,
      "replies": []
    },
    {
      "id": "mrm5i2r",
      "author": "LuckyInvestigator717",
      "body": "There is no methadone dispensing robot.\nThere is a methadone wending machine.",
      "score": 2,
      "created_utc": 1746896481.0,
      "replies": [
        {
          "id": "mrmjcvi",
          "author": "therealhairykrishna",
          "body": "A vending machine is a robot.",
          "score": 4,
          "created_utc": 1746900958.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrnfl0h",
      "author": "spirit-mush",
      "body": "Drug addicts are some of the mist stigmatized people in society. The desire to reduce human contact in addiction and recovery services is an expression of that lack of compassion.",
      "score": 1,
      "created_utc": 1746912051.0,
      "replies": []
    },
    {
      "id": "mrmny6e",
      "author": "Redebo",
      "body": "I was told this is the pre-order line for drug dispensing robots?",
      "score": 1,
      "created_utc": 1746902509.0,
      "replies": []
    },
    {
      "id": "mrnep2e",
      "author": "beadzy",
      "body": "I thought methadone was being phased out in favor of suboxone? For the most part",
      "score": 1,
      "created_utc": 1746911732.0,
      "replies": [
        {
          "id": "mrrrljs",
          "author": "Secret_Guide_4006",
          "body": "Yeah I don’t understand why anyone would use methadone when suboxone is an option. How are you supposed to lead a functional life when you have to go into clinic everyday.",
          "score": 2,
          "created_utc": 1746980920.0,
          "replies": [
            {
              "id": "mrrxtp4",
              "author": "beadzy",
              "body": "I work around addiction and consult liaison psychiatrists and know they do offer suboxone first to people that come into the hospital experiencing a medical issue and are addicted to heroin/opiates",
              "score": 1,
              "created_utc": 1746982907.0,
              "replies": [
                {
                  "id": "mrrz50a",
                  "author": "Secret_Guide_4006",
                  "body": "Same I manage a clinic that does suboxone and sublocade, I don’t understand why any clinic would still want to provide people with methadone.",
                  "score": 2,
                  "created_utc": 1746983319.0,
                  "replies": [
                    {
                      "id": "mrsos5u",
                      "author": "GoldenPoncho812",
                      "body": "Because it is much cheaper that Suboxone. Like. A lot.",
                      "score": 1,
                      "created_utc": 1746991599.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mrroh1f",
      "author": "GenerationalTerror",
      "body": "No. The answer is no.",
      "score": 1,
      "created_utc": 1746979920.0,
      "replies": []
    },
    {
      "id": "mrm1s95",
      "author": "CerRogue",
      "body": "You mean put people out of a job…",
      "score": -3,
      "created_utc": 1746895270.0,
      "replies": [
        {
          "id": "mrm6adm",
          "author": "LuckyInvestigator717",
          "body": "And this is actually great. This is what industrial revolution was for. \nNurse should be busy nursing patients and not strugling to properly place proper stickers and keeping legal documetation backlog on medicine bottles",
          "score": 1,
          "created_utc": 1746896735.0,
          "replies": [
            {
              "id": "mrmabyf",
              "author": "CerRogue",
              "body": "Those are jobs for people. Maybe not nurse but people. Removing the need for a labor force skilled or unskilled harms society. They aren’t “freeing up” nurses they are reducing the workforce.",
              "score": -4,
              "created_utc": 1746898038.0,
              "replies": [
                {
                  "id": "mrmapvw",
                  "author": "LuckyInvestigator717",
                  "body": "Removing the need for a labor force skilled and unskilled stopped historical trend of 50% people dying before reaching adulthood and then build unimagimable prosperity worldwide.",
                  "score": 3,
                  "created_utc": 1746898162.0,
                  "replies": []
                },
                {
                  "id": "mrmeuql",
                  "author": "Not-ur-Infosec-guy",
                  "body": "When people have no need to work is when growth and advancement will begin again.  Kids used to be pumped out to bring in income not very long ago and schools and equal opportunities for education helped humanity develop space exploration and aviation capabilities.  \n\nRobots and AI will help make ones value focused on developing the next advancements.  Universal income is what should be leveraged as a safety net.",
                  "score": 0,
                  "created_utc": 1746899489.0,
                  "replies": [
                    {
                      "id": "mrmjk7i",
                      "author": "MechaSandstar",
                      "body": "Where will the money to fund universal income come from?\n\n\"Rich people!\" \n\nAnd after the first year?",
                      "score": 1,
                      "created_utc": 1746901026.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mrmld81",
                  "author": "even_less_resistance",
                  "body": "We need to be a post-labor as to how we determine people’s worth and give them a purpose tbh",
                  "score": 0,
                  "created_utc": 1746901631.0,
                  "replies": []
                },
                {
                  "id": "mrmi03y",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -3,
                  "created_utc": 1746900509.0,
                  "replies": [
                    {
                      "id": "mrmq1of",
                      "author": "windyorbits",
                      "body": "While dispensing is their main objective they still have other duties that involve patient care. And a big one is observing each patient to make sure they’re not coming in intoxicated. Others include blood draws, physicals, drug tests, intakes, monitoring, etc.",
                      "score": 1,
                      "created_utc": 1746903226.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mrmgjqm",
          "author": "BevansDesign",
          "body": "Technology always eliminates jobs, and creates new ones that didn't exist before. (I'm not saying it's a 1:1 ratio, of course.)\n\nThis always happens, and the key is to support those who are displaced, which is something our societies are terrible at doing.",
          "score": 1,
          "created_utc": 1746900034.0,
          "replies": []
        }
      ]
    }
  ]
}