{
  "post": {
    "title": "Microsoft Discontinues iMac Rival Surface Studio 2 Plus | Marking the end of the company's only direct competitor to Apple's iMac, leaving a gap in the Windows ecosystem for high-end all-in-one PCs.",
    "author": "chrisdh79",
    "id": "1h82tfr",
    "score": 607,
    "created_utc": 1733496057.0,
    "selftext": "",
    "num_comments": 129,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1h82tfr/microsoft_discontinues_imac_rival_surface_studio/"
  },
  "comments": [
    {
      "id": "m0pqt3p",
      "author": "MadOrange64",
      "body": "Microsoft and Google are competing who can cancel the most products.",
      "score": 164,
      "created_utc": 1733497013.0,
      "replies": [
        {
          "id": "m0rrdx3",
          "author": "Deflated_Hive",
          "body": "The economy is pulling back. The low tide is really showing what product lines are swimming naked.\n\nMicrosoft was adamant at the beginning about not putting VR on the Xbox because of how little uptake it had. People said heh... Sony aint... They and their Playstation got their games on lock! \n\nAnd then a few years later PlayStation halts their VR efforts after dismal sales.\n\nI expect we'll see more examples of fat trimming from Google, Microsoft and many other tech companies coming soon.\n\nI'm surprised Google hasn't pulled the plug on their Pixel Fold line yet. If Google killed their Pixel tablet due to sales, I could only surmise how little quantities the Fold managed to sell.",
          "score": 29,
          "created_utc": 1733520172.0,
          "replies": [
            {
              "id": "m0t30ek",
              "author": "Runazeeri",
              "body": "I think the issue with high end android tablets is the app exclusivity for IPad. Yeah it’s a powerful tablet but it doesn’t have the apps to use it.",
              "score": 5,
              "created_utc": 1733537776.0,
              "replies": [
                {
                  "id": "m0um7rz",
                  "author": "Metrobolist3",
                  "body": "Yeah, as a guy who actively avoids Apple products I'd still buy an iPad over any similarly priced Android tablet, if I suddenly decided I needed a tablet.",
                  "score": 5,
                  "created_utc": 1733567633.0,
                  "replies": [
                    {
                      "id": "m16m7ro",
                      "author": "Enough-Meaning1514",
                      "body": "I have an iPad 7th Gen and recently came across on of them expensive Samsung tablets (S10 or something). The screen and the materials of the Samsung tablet were superb but I can't believe how crap every app on it was. Like, the UI is clearly meant for Android phones and just expanded to the tablet's screen. So much wasted space and unnecessary scrolling buttons etc.\n\nI think the HW for great Android tablets is there but there is no real app eco-system. I fully understand why Google cancelled their tablet line.",
                      "score": 3,
                      "created_utc": 1733747008.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m16mhof",
              "author": "Enough-Meaning1514",
              "body": "All agree. Also, I briefly used the first Surface Studio. Honestly, it was quite crap. Like, the idea is nice but there were no apps that took advantage of the hardware. And for the ones that claim to have a proper app, they were all junky as hell!\n\nIf MS wanted to enter this market, they should have sold these to universities and startups for a quarter of the price.",
              "score": 1,
              "created_utc": 1733747147.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0rbffn",
          "author": "iloveeatinglettuce",
          "body": "Longevity has never been one of Microsoft’s strong suits. So this isn’t all that surprising.",
          "score": 11,
          "created_utc": 1733514981.0,
          "replies": [
            {
              "id": "m0rrw9a",
              "author": "chillychili",
              "body": "In the consumer world, yes. Enterprise? Whole different story I'd say (but am willing to be proven wrong).",
              "score": 19,
              "created_utc": 1733520339.0,
              "replies": [
                {
                  "id": "m0sv2ko",
                  "author": "zoinkability",
                  "body": "I’d say hardware vs. software",
                  "score": 6,
                  "created_utc": 1733534611.0,
                  "replies": [
                    {
                      "id": "m15yw4j",
                      "author": "BBQcasino",
                      "body": "It’s technically a hardware company given the amount of racks they have worldwide",
                      "score": 1,
                      "created_utc": 1733731771.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m0teuqr",
          "author": "Zorrom4",
          "body": "I read this comment while drinking water. Wtf bro 😂",
          "score": -2,
          "created_utc": 1733542731.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0pprvk",
      "author": "BBK2008",
      "body": "It’s the same formula over and over: ignore all the reasons Apple didn’t make a product like that, argue endlessly that this is exactly what most people want based on a fringe focus group, release it and fail and cancel the whole thing rapidly.\n\nAt some point, MS will wake up to the reasoning Apple uses to avoid having to constantly drop product categories rapidly.  You need enough users who can afford it, who want it, and who would benefit from it.\n\nEven though it looked pretty cool even to me as a product.\nNot remotely an IMac competitor, though. And the problem is their os is terribly not touch optimized so it loses a lot of the benefits of being touch screen.",
      "score": 104,
      "created_utc": 1733496659.0,
      "replies": [
        {
          "id": "m0qvl92",
          "author": "brelywi",
          "body": "My workplace, for some idiotic fucking reason, decided that the best option for work computers for our department (we are exclusively remote and visit clients in the field, but also have a lot of documentation work to do) was a goddamn surface pro. \n\nIt’s not powerful enough to use the dock they sent with it for one let alone my normal two monitors, it crashes all the time, it’s slow as fuck, it’s almost impossible for me to see anything well on the tiny screen, and the handwriting recognition and usability is trash. \n\nI hate it SO much, and so I’m stuck doing everything I can on my personal desktop using the online outlook/teams client, then emailing myself what has to be used with the VPN. It’s ridiculous.",
          "score": 35,
          "created_utc": 1733509960.0,
          "replies": [
            {
              "id": "m0tkkft",
              "author": "monkey_gamer",
              "body": "Yeah, it sucks when work gives you bad equipment 😕",
              "score": 6,
              "created_utc": 1733545295.0,
              "replies": []
            },
            {
              "id": "m0t37bk",
              "author": "Troll_U_Softly",
              "body": "They must have bought either a prior model or the lowest spec - maybe both. If they bought a new model with i5 or higher it would be plenty powerful, the handwriting is objectively great. I am not a Microsoft fanboy either, I use Mac’s for work but I’ve worked in tech enough to know your statements aren’t accurate.",
              "score": 3,
              "created_utc": 1733537855.0,
              "replies": [
                {
                  "id": "m0wwpr8",
                  "author": "brelywi",
                  "body": "I mean, factually my statements ARE accurate, because that is my experience with the surface pro they gave me.  I’m not the only one experiencing those issues either.  Our IT department has even told me that they can’t support multiple displays. \n\nThat being said, it wouldn’t surprise me if the company handed out the bargain bin models from ten years ago or something.",
                  "score": 3,
                  "created_utc": 1733599200.0,
                  "replies": []
                },
                {
                  "id": "m0tm8rm",
                  "author": "achman99",
                  "body": "So much this.\n\nI have a 5+ year old Surface Pro with an i7, and it runs multiple monitors, all the Photoshop tasks I need, and even Premiere Pro in a pinch in the field.\n\nIt's been a fantastic tablet / laptop combo. My only gripe was dropping it and cracking the corner a while back, turning it into a desktop in its dock. I've just been waiting for the right need to upgrade to the current standard and replace, now that I'm not traveling as much.",
                  "score": 3,
                  "created_utc": 1733546082.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0ukiyc",
          "author": "randompanda687",
          "body": "Honestly I don't fault them at all for making this. It was a really cool product idea. I think they just didn't execute well enough. Maybe they should have iterated on it or something but even though I'm a mac guy, I was cheering for this to succeed out of sheer innovation",
          "score": 1,
          "created_utc": 1733566587.0,
          "replies": [
            {
              "id": "m19hkti",
              "author": "BBK2008",
              "body": "I never said it wasn’t cool looking. But that doesn’t make a viable product that lasts in the market.\nApple is far better at not chasing fringe stuff that doesn’t have what it takes to make it in the market, is all I’m saying.",
              "score": 1,
              "created_utc": 1733781697.0,
              "replies": [
                {
                  "id": "m1bufke",
                  "author": "randompanda687",
                  "body": "Oh I wasn’t saying you were hating. I think MS was forced to try something a little different to compete. I mean,  head to head, an artist or designer is going to pick an iMac over a windows machine every time. So MS tried to add something to the hardware to entice users to give them a shot. Not a bad idea but it just didn’t pan out",
                  "score": 2,
                  "created_utc": 1733816598.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0qo9pn",
          "author": "None",
          "body": "It's OK, Apple is learning the Microsoft way - see their VR thingie... \n\nhttps://applescoop.org/story/shocking-apple-vision-pro-2-reportedly-cancelled",
          "score": -9,
          "created_utc": 1733507662.0,
          "replies": [
            {
              "id": "m0rdrcb",
              "author": "brktm",
              "body": "I think their plan was always to scale back for the second generation. But to be fair, they weren’t (or aren’t) really sure what applications will actually be useful or catch on, which is an unusual approach for Apple. But it’s also why the first “Pro” generation is so over-built: hoping that third-party developers will find the profitable use cases and the less useful features can then be dropped for the general consumer models.",
              "score": 5,
              "created_utc": 1733515737.0,
              "replies": [
                {
                  "id": "m0rr484",
                  "author": "BBK2008",
                  "body": "I think it’s a typical proof of concept device. It’s meant to get people excited about the potential when it’s not half-assed. Sadly, right now doing that is pretty expensive.",
                  "score": 2,
                  "created_utc": 1733520082.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0qto8m",
              "author": "NancyPelosisRedCoat",
              "body": "Instead of a $3.5k VR thingie, they’re making a $1.6k VR thingie. They aren’t cancelling much, really. At least not yet.",
              "score": 5,
              "created_utc": 1733509358.0,
              "replies": [
                {
                  "id": "m0qu14m",
                  "author": "None",
                  "body": "They are canceling about $1900 pure profit ... poor Apple 🫠",
                  "score": -8,
                  "created_utc": 1733509469.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0tzyg9",
              "author": "PeakBrave8235",
              "body": "First, it’s not “VR.”\n\nSecond, they’ve sold more of it already than the entire first year of iPod. \n\nThird, rumors are published whether they’re credible or not. ",
              "score": 0,
              "created_utc": 1733553148.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0pou9b",
      "author": "mobrocket",
      "body": "It's always weird to me that MSFT will dip its toe into the consumer market just to take it out again over and over\n\nEspecially with hardware \n\nNext to die will be Xbox hardware",
      "score": 172,
      "created_utc": 1733496334.0,
      "replies": [
        {
          "id": "m0pphfi",
          "author": "AndarianDequer",
          "body": "The only thing they ever continue to push through is Xbox. I've worked for a company that was like this, always on the cusp of greatness but gives up way too soon.",
          "score": 60,
          "created_utc": 1733496558.0,
          "replies": [
            {
              "id": "m0pve0l",
              "author": "SBR404",
              "body": "the surface devices (tablet as well as laptop) are going strong for years now. But yea other than that and Xbox …",
              "score": 28,
              "created_utc": 1733498548.0,
              "replies": [
                {
                  "id": "m0r5kgj",
                  "author": "Neg_Crepe",
                  "body": "So strong that I’ve never seen one",
                  "score": -11,
                  "created_utc": 1733513111.0,
                  "replies": [
                    {
                      "id": "m0s4s4f",
                      "author": "phara-normal",
                      "body": "🤨",
                      "score": 2,
                      "created_utc": 1733524713.0,
                      "replies": [
                        {
                          "id": "m0skxxn",
                          "author": "Neg_Crepe",
                          "body": "Yeah I’ve never seen one irl. Not even one at my university",
                          "score": 2,
                          "created_utc": 1733530681.0,
                          "replies": [
                            {
                              "id": "m0t2jy0",
                              "author": "SirVezaTheBrave",
                              "body": "I doubt that but each person's experience is different. I've seen plenty of surface devices myself. I own one. But the level of power from one surface device to the next is vastly different. A surface used by a high school is significantly underpowered vs a surface pro. The pro is underpowered compared to the laptop studio. It's a bit sad. ",
                              "score": 3,
                              "created_utc": 1733537587.0,
                              "replies": [
                                {
                                  "id": "m0t4xk6",
                                  "author": "Neg_Crepe",
                                  "body": "When I went to high school those didn’t exist lol. \n\nBut yeah, university in Canada was all MacBook with some rare HP\n\n2013-2016\n\nIt might be big in the states but you guys shouldn’t expect everyone to be American and downvote me.",
                                  "score": 0,
                                  "created_utc": 1733538563.0,
                                  "replies": [
                                    {
                                      "id": "m0t8530",
                                      "author": "SirVezaTheBrave",
                                      "body": "I get that. I wouldn't say they are overtaking macs but they are present. Macs have the appeal of doing the things you need to smoothly. ",
                                      "score": 1,
                                      "created_utc": 1733539894.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m0uc6s3",
                              "author": "phara-normal",
                              "body": "Probably depends heavily on the country, the area you live in and what you're actually doing at the university. I know that schools over here use them, seen them at public service offices, they were pretty present at my university (media design, game design, product design), and I've seen them as tablet replacements because you can run stuff like ad block on them, which is the reason I got one myself this year to replace a old ass Samsung tablet.\n\nEspecially at my university they were way more present than macbooks, which is funny because everyone always claims that macbooks completely dominate in the creative world. Now I work as a 3d artist, my girlfriend works as a general content creator for a pretty big YouTuber, other friends work as animators, special effects artist and product designers and literally none of them and none of the people at their companies use a macbook, while surfaces are pretty present.",
                              "score": 1,
                              "created_utc": 1733560949.0,
                              "replies": []
                            },
                            {
                              "id": "m0tjt75",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 0,
                              "created_utc": 1733544948.0,
                              "replies": [
                                {
                                  "id": "m0v1fre",
                                  "author": "Neg_Crepe",
                                  "body": "As in Services Canada?\n\nIt’s not what they use here in Quebec I think",
                                  "score": 1,
                                  "created_utc": 1733576038.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m0qlf0t",
              "author": "mobrocket",
              "body": "Xbox as a brand yes\n\nBut the \"everything is an Xbox\" gives me the vibes they want to be more like a platform only, bring your own hardware",
              "score": 17,
              "created_utc": 1733506779.0,
              "replies": [
                {
                  "id": "m0ro69j",
                  "author": "elloellochris",
                  "body": "They've been saying for years that xbox is the platform, and not the consoles.",
                  "score": 2,
                  "created_utc": 1733519109.0,
                  "replies": []
                },
                {
                  "id": "m0xqerd",
                  "author": "tiroc12",
                  "body": ">everything is an Xbox\n\nThis is the worst possible thing they could do. Xbox is over. First, if it was true, why would I ever buy an xbox again? I know they would rather sell games than hardware, but if I want to play games on my computer, I am using Steam or any other distributor. Not Xbox. Nor is Xbox on my mind as the place to go. Thats if. But xbox is not everywhere. They have gamepass in a lot of places. Cloud gaming in a lot of places. But my xbox libarary is only available on my xbox. My xbox experience is only on my xbox. I honestly have no idea whats available where. Just like the xbox itself. I dont know which one to buy anymore. The X? Series X? The S? Series S? The one? The 720? They ruined the brand by pretending like I can have my Xbox anywhere except its a different experience with a different subscription everywhere I go. No thank you. Comming from somoene that has had an xbox since 2001. Havent bought a game in probably 4 years.",
                  "score": 0,
                  "created_utc": 1733608902.0,
                  "replies": [
                    {
                      "id": "m0y9azp",
                      "author": "mobrocket",
                      "body": "I was a big Xbox supporter when it first came\n\nI'm American so to have an American company... Awesome right. \n\nI think the OG Xbox was great it had every feature available at the time really. Then 360 was still sold, then they went stupid with XB1 and I jumped ship to PS4. \n\nThen they got stupid again with 2 consoles instead of just 1.\n\nHow fucking hard is it to just take what was great about the OG and just better the specs each gen? \n\nIt was basically just a PC .. u know the thing MSFT has ALWAYS been known to be familiar with\n\nStraight DUMBASSES",
                      "score": 1,
                      "created_utc": 1733615452.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m0pz1tp",
          "author": "BigCommieMachine",
          "body": "I mean they are no Google, who is apparently killing their Pixel Tablet again, which would be the 3rd time Google has killed the Pixel Tablet after the Pixel Slate and the Pixel C….which is after they killed the Nexus 9.",
          "score": 9,
          "created_utc": 1733499742.0,
          "replies": [
            {
              "id": "m0qr03t",
              "author": "dicedaman",
              "body": "Google rightfully gets shit for cancelling services but nobody has MS beat when it comes to killing consumer products. \n\nI have a brother that's a diehard MS fan and the list of abandoned shit he's bought from them is insane. Zune, Kin, two separate abandoned Lumia/Windows Phone lines, Surface RT, Surface Duo, some fucking Fitbit band thing, even a damn Hololens. \n\nMS is to hardware what Google is to services.",
              "score": 9,
              "created_utc": 1733508513.0,
              "replies": [
                {
                  "id": "m0r4owh",
                  "author": "BigCommieMachine",
                  "body": "Microsoft is notorious for either being too early or too late. The Zune, Windows Phone, Kin/Lumia were excellent products that were too late. The Surface RT/Duo and the HoloLens were too early.",
                  "score": 4,
                  "created_utc": 1733512833.0,
                  "replies": [
                    {
                      "id": "m0sy31n",
                      "author": "Saidagive",
                      "body": "The windows phone wasn't late, it was deliberately sabotaged by Google and app makers that wanted it to fail despite being a superior OS with superior cameras (Nokia Lumia series).  \n\nThe kin sucked.  I have no defense for that one.",
                      "score": 2,
                      "created_utc": 1733535800.0,
                      "replies": [
                        {
                          "id": "m18bcm4",
                          "author": "AkirIkasu",
                          "body": "Please explain to me how Google sabotaged Windows Mobile.",
                          "score": 1,
                          "created_utc": 1733768612.0,
                          "replies": [
                            {
                              "id": "m26n5v0",
                              "author": "Saidagive",
                              "body": "At the time having the latest and most popular apps was the lifeblood of the mobile world.  This meant Google services, YouTube (google owed), and social media like Instagram and Snapchat.  If it didn't have these then it was dead.  Both Google and the owner of Snapchat knew this and deliberately blocked Windows phone from using them.  Young people didn't want to use the phones because no Snapchat and adults didn't because no Google services.  \n\nYes this is a simplified view of the issue but this is what crippled any chances of Windows phones from gaining traction.",
                              "score": 2,
                              "created_utc": 1734279260.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m0t2oxx",
                      "author": "SirVezaTheBrave",
                      "body": "HoloLens was too early. ",
                      "score": 1,
                      "created_utc": 1733537643.0,
                      "replies": []
                    },
                    {
                      "id": "m0w8oue",
                      "author": "umbananas",
                      "body": "the reason you think they are too early or too late is because they did not release a good product. For example, windows Phone, they were not too late. They had Windows mobile for years before the iPhone, but they never really cared for the user experience, so it stayed a niche product until iPhone came out and changed the market.",
                      "score": 1,
                      "created_utc": 1733591611.0,
                      "replies": [
                        {
                          "id": "m18bsus",
                          "author": "AkirIkasu",
                          "body": "Honestly I think the main reason why Windows Mobile failed to capture the earlier market was because it was called Windows. The people who did want a pocket version of Windows were disappointed and the people who wanted a good mobile experience did not want what desktop Windows offered - which is why they chose Palm, which was designed from the ground-up to be used as a mobile device.",
                          "score": 1,
                          "created_utc": 1733768749.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m0ppy9s",
          "author": "HakimeHomewreckru",
          "body": "What consumer spends 5500 euros on a computer nowadays? I have a HEDT build that didn't cost this much with a 49 inch OLED ultrawide.\n\nThis wasn't a consumer product, and even for creative professionals it was useless with its laptop hardware. A 3060 in 2024, really? Not enough VRAM for content creators (video editors, motion designers, 3D artists, list goes on). This was a glorified tablet for graphic designers that cost way too much compared to the even just Apple M1 hardware that blows it away in terms of performance. And that means something when an Apple product is faster AND cheaper...",
          "score": 13,
          "created_utc": 1733496720.0,
          "replies": [
            {
              "id": "m0pqits",
              "author": "dandroid126",
              "body": ">What consumer spends 5500 euros on a computer nowadays? \n\nMac users.",
              "score": 10,
              "created_utc": 1733496915.0,
              "replies": [
                {
                  "id": "m0pr55l",
                  "author": "HakimeHomewreckru",
                  "body": "Not true. Even the highest tier M4 iMac costs less than half of this, and the iPad Pro is even cheaper.",
                  "score": 4,
                  "created_utc": 1733497126.0,
                  "replies": [
                    {
                      "id": "m0ptbf6",
                      "author": "dandroid126",
                      "body": "I was specifically thinking about the Mac Studio. It's configurable to $8800 USD. And the Mac Pro *starts* at $7000 USD.",
                      "score": 13,
                      "created_utc": 1733497861.0,
                      "replies": [
                        {
                          "id": "m0qtuk5",
                          "author": "Blakers37",
                          "body": "Those are not even close to comparable for the kind of person buying them. The vast majority of iMac buyers are getting the base model which is like $1000-1100. They might upgrade storage or ram and hit like $1500 but even that is the minority. The only people buying Mac Studio/Pro are very high end users or businesses.",
                          "score": 6,
                          "created_utc": 1733509412.0,
                          "replies": []
                        },
                        {
                          "id": "m0qkj0e",
                          "author": "HakimeHomewreckru",
                          "body": "They're not even remotely similar - not in terms of form factor and not in specs. They're also targeted at completely different users. \n\nDid you forget the post you're replying to is talking about CONSUMERS? \n\nWhat a false analogy.",
                          "score": 11,
                          "created_utc": 1733506500.0,
                          "replies": []
                        },
                        {
                          "id": "m0rver7",
                          "author": "parisidiot",
                          "body": "consumers are not buying these",
                          "score": 2,
                          "created_utc": 1733521498.0,
                          "replies": []
                        },
                        {
                          "id": "m0u03ds",
                          "author": "PeakBrave8235",
                          "body": "You’re ignoring where they sell $900 notebooks, $1300 all in ones, and $600 desktops, but sure",
                          "score": 1,
                          "created_utc": 1733553230.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m0rvcjn",
                  "author": "parisidiot",
                  "body": "no they really don't. probably most mac sales are those $750 airs.",
                  "score": -2,
                  "created_utc": 1733521478.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0prl9j",
              "author": "Deceptiveideas",
              "body": "Isn’t windows market share shrinking every year? Yeah 1% here and there might not seem like a lot but if you add up 1% from all these different products, it starts to add up.\n\nYou’d think Microsoft would want to maximize incentives to stay on windows at all times.",
              "score": -4,
              "created_utc": 1733497281.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0q2vie",
          "author": "mjconver",
          "body": "Not my Xbox!  Then I can't watch Netflix!",
          "score": 4,
          "created_utc": 1733500961.0,
          "replies": []
        },
        {
          "id": "m0qi145",
          "author": "ChiggaOG",
          "body": "They did it with Zune. Many iterations as an MP3 player. Could have been a phone. Microsoft sucks as a hardware company.",
          "score": 1,
          "created_utc": 1733505722.0,
          "replies": [
            {
              "id": "m0rvi1h",
              "author": "parisidiot",
              "body": "ok but the zune sucked. itunes was awful but the clickwheel was significantly better UX than the zune, which was additionally thick and clunky hardware.",
              "score": 1,
              "created_utc": 1733521529.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0pw9pa",
          "author": "notred369",
          "body": "not trying to be a fanboy of any flavor, but xbox hardware is going to die because they keep releasing bad first party titles and keep being scummy with their game pass.",
          "score": -4,
          "created_utc": 1733498837.0,
          "replies": [
            {
              "id": "m0remhf",
              "author": "WaffleMints",
              "body": "Scummy? Lol. I'm living good with gamepass. Don't know what you are on about.",
              "score": 1,
              "created_utc": 1733516019.0,
              "replies": []
            },
            {
              "id": "m0sg11h",
              "author": "elmo-slayer",
              "body": "Game pass has a long way to go before it stops being an awesome deal",
              "score": 1,
              "created_utc": 1733528818.0,
              "replies": []
            },
            {
              "id": "m0u4cc5",
              "author": "Vonterribad",
              "body": "That is WILD to say after Indiana Jones dropped.",
              "score": 0,
              "created_utc": 1733555819.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0psepe",
      "author": "leastlol",
      "body": "It's a shame; it's a beautiful product that had some unique and interesting features, but it's kind of plagued by Microsoft not *really* being a hardware company first.\n\nI hope that Microsoft in the future uses that brilliant hinge and display, hopefully in a standalone product. The iMac also suffers from the problem of having an absolutely beautiful frame and display being tied to a specific set of hardware. It just doesn't make much sense for most people, where the display will far outlast the computer it's attached to. \n\nThis is compounded by the fact that it's tied to x86/amd64. Something like this with an M-series chip in it would be a lot more compelling. It being decoupled entirely from a computer would be even better.",
      "score": 28,
      "created_utc": 1733497559.0,
      "replies": [
        {
          "id": "m0q8l7s",
          "author": "HIGH_PRESSURE_TOILET",
          "body": "That Surface Studio display is really outstanding. Shame that it's so hard to get a high resolution display.",
          "score": 13,
          "created_utc": 1733502783.0,
          "replies": []
        },
        {
          "id": "m0q92oq",
          "author": "Booplee",
          "body": "I remember having a surface book that lost a bit of its self after every single update until it wasnt useable anymore, made me never want to get something like it ever again.",
          "score": 5,
          "created_utc": 1733502935.0,
          "replies": []
        },
        {
          "id": "m0s2nne",
          "author": "BiNumber3",
          "body": "Yea, saw the first promo video of it, and just thought I'd love to play around with one. But price on top of all-in-one limitations just weren't for me. \n\n\nAlso usage factor, my PC is more for gaming and other less intensive things, not really what this product was intended for.",
          "score": 2,
          "created_utc": 1733523969.0,
          "replies": [
            {
              "id": "m0smbhb",
              "author": "Esc777",
              "body": "The promo for the first one was magical. I thought MS was *back* baby. \n\nhttps://youtu.be/fZsi2aZ6VFs\n\nProbably the best commercial MS ever made. ",
              "score": 7,
              "created_utc": 1733531205.0,
              "replies": [
                {
                  "id": "m0tpt5e",
                  "author": "smallcoder",
                  "body": "Agreed - wow, when I saw that I was so keen on getting one. The puck alone plus the ability to draw directly on a huge canvas of a screen, just seemed... well amazing and perfect for my needs as a designer at the time. However, the price and then some of the mixed reviews made me pause and stick with my regular setup. Then it just kind of disappeared, or at least seemed to anyway? \n\nThis is where MS falls apart on the hardware front in comparison to Apple - even when they come up with a compelling product, they just don't seem to be able to infiltrate the creator market and make the product ubiquitous, so you see it all over YouTube and in movies/tv and in offices you visit in day to day life.\n\nIf Apple had made the studio - and this device was the closest MS came to creating something that looked like an Apple product - then maybe it would still be going today and be a successful part of the Mac line up? Seems sad really as it was a cool looking and, from the advertising (having never used one myself), innovative and practical device, that could have been really popular. Oh well...",
                  "score": 2,
                  "created_utc": 1733547787.0,
                  "replies": [
                    {
                      "id": "m0trws2",
                      "author": "Esc777",
                      "body": "Apparantly they made multiple versions of it over the years but like you said they marketed it poorly and just seemed to get it over the line and not truly support it. ",
                      "score": 2,
                      "created_utc": 1733548810.0,
                      "replies": []
                    },
                    {
                      "id": "m0u0b9u",
                      "author": "PeakBrave8235",
                      "body": "> then maybe it would still be going today and be a successful part of the Mac line up\n\nIt literally failed lol. A bad product is a bad product, ",
                      "score": 1,
                      "created_utc": 1733553361.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0u06ch",
                  "author": "PeakBrave8235",
                  "body": "Really? I hated that commercial lol",
                  "score": 1,
                  "created_utc": 1733553279.0,
                  "replies": [
                    {
                      "id": "m0u3yd5",
                      "author": "Esc777",
                      "body": "so which microsoft commercial was your favorite",
                      "score": 1,
                      "created_utc": 1733555581.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m0psb5a",
      "author": "Deceptiveideas",
      "body": "It’s crazy how all these surface products were released is because of how OEMs gave Windows a shitty reputation. Bloatware, default programs being incredibly scammy or asking for money, slow experience, underpowered, etc.\n\nWith Microsoft killing off products left and right, I feel like we’re slowly going to go back to OEM nightmare.",
      "score": 12,
      "created_utc": 1733497525.0,
      "replies": []
    },
    {
      "id": "m0sh72r",
      "author": "hoobiedoobiedoo",
      "body": "I wish Apple had a standalone iMac that I could draw on with the same feel as the iPad Pro my office of all Mac users would love it.",
      "score": 5,
      "created_utc": 1733529256.0,
      "replies": [
        {
          "id": "m0utld4",
          "author": "Rockfest2112",
          "body": "Ive been wanting that for a decade. We can dream eh?",
          "score": 1,
          "created_utc": 1733571975.0,
          "replies": [
            {
              "id": "m0vokgj",
              "author": "hoobiedoobiedoo",
              "body": "Yeah seriously. They have the tech to do it. I guess they must believe they don’t have the desire? Idk I’d imagine a lot of professionals would love it.",
              "score": 1,
              "created_utc": 1733585067.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0pvho4",
      "author": "guzhogi",
      "body": "Great concept, poor execution, IMO. I love the simplicity and idea of an all in one computer with touchscreen, but hate how the hardware was always far behind current hardware",
      "score": 3,
      "created_utc": 1733498581.0,
      "replies": []
    },
    {
      "id": "m0s5k4o",
      "author": "colonelc4",
      "body": "Microsoft's hardware is just bad, even their legendary mouse and keyboards are not as they used to be, competition is much better for the same price or less.",
      "score": 3,
      "created_utc": 1733524989.0,
      "replies": []
    },
    {
      "id": "m0ps03b",
      "author": "OrganicKeynesianBean",
      "body": "Not sure if the last part of the title is accurate. There are some pretty pricey all-in-one PCs from other manufacturers.",
      "score": 5,
      "created_utc": 1733497420.0,
      "replies": []
    },
    {
      "id": "m0pzpvk",
      "author": "iCowboy",
      "body": "That's a shame, even as a Mac user, I fell in love with it in the initial reveal advert and a play in a Microsoft shop showed that it was a really useful way of working on large drawings that seemed so obvious in retrospect. But it badly needed updating with better hardware to make it competitive. \n\nMind you, despite the M4 refresh, Apple seems to be quietly killing off the iMac which is the closest alternative, still new no 27\" machine or Pro version, so perhaps this big screen, sort of all-in-one doesn't have a market.",
      "score": 5,
      "created_utc": 1733499954.0,
      "replies": [
        {
          "id": "m0q1czo",
          "author": "Presently_Absent",
          "body": "they will probably come up with a $500 mount for the Mac Mini for the back of the Studio Display",
          "score": 1,
          "created_utc": 1733500479.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0puesv",
      "author": "GregLittlefield",
      "body": "Except it was never a real competitor to the iMac. It was an interesting piece of hardware, but it was a very niche product that priced itself out of the market. I'd be very curious to see just how low the sales numbers were.",
      "score": 4,
      "created_utc": 1733498226.0,
      "replies": []
    },
    {
      "id": "m0qhxq9",
      "author": "Acceptable-Truck3803",
      "body": "It was a fun product but more or less it seemed it was for use to show what windows can do and still can do compared to when the iPad Pro came out and folks migrating to that ecosystem for artists who draw and do creative work. Branded as an AIO it was always a product to be sold at a loss, but kept folks from migrating to MacOS.",
      "score": 2,
      "created_utc": 1733505692.0,
      "replies": []
    },
    {
      "id": "m0qsyc3",
      "author": "Beowulf1211",
      "body": "It hurts to see Microsoft’s recent fall from grace. 2019 was the last year I truly remember MS at its finest. They had the most beautiful laptops and desktops. Their extended warranties were generous and hassle-free. The MS showroom in Tysons Corner, VA was an experience. I would go as far as to recommend people buy their Razer laptops from MS because of the generous warranty they provided. \n\nIt all fell apart during Covid with showroom closures, firing of Panos Panay and abandoning their hardware line-up. Hate to see it.",
      "score": 2,
      "created_utc": 1733509130.0,
      "replies": []
    },
    {
      "id": "m0ukq4z",
      "author": "Dio44",
      "body": "How long until hardware is gone altogether at MSFT?  They have discontinued more products in the last few years than they currently make.",
      "score": 2,
      "created_utc": 1733566713.0,
      "replies": []
    },
    {
      "id": "m0ppqg9",
      "author": "Durzel",
      "body": "Was this the one that had that awesome Willy Wonka reimagined song “world of imagination”? That machine looked awesome (at least from that advert)",
      "score": 4,
      "created_utc": 1733496645.0,
      "replies": [
        {
          "id": "m0prsn4",
          "author": "Deceptiveideas",
          "body": "Tbh I thought the marketing around that time period rivaled or even exceeded Apple’s at times.\n\nhttps://youtu.be/8pNyFLO4y88?si=Z5vitfwskQOzefoH",
          "score": 4,
          "created_utc": 1733497350.0,
          "replies": [
            {
              "id": "m0r3ug7",
              "author": "RMRdesign",
              "body": "I agree with you. I want one.",
              "score": 1,
              "created_utc": 1733512565.0,
              "replies": []
            },
            {
              "id": "m0qaccw",
              "author": "None",
              "body": "The circular puck seems an odd design holdover from their table top surface experiments. That machine looks nice though, as much as any huge pixel dense oled does. Is Windows touch interface viable enough to substantiate a purchase like this? Idk, never used the touch interface, only accidentally and briefly.\n\nIt’s a halfway product if they never fully committed to the software and UI.",
              "score": 1,
              "created_utc": 1733503333.0,
              "replies": [
                {
                  "id": "m0r4189",
                  "author": "RMRdesign",
                  "body": "Did you ever use the puck? It was like magic when you had software that was compatible.",
                  "score": 7,
                  "created_utc": 1733512624.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0u0co5",
              "author": "PeakBrave8235",
              "body": "Uh…. No. ",
              "score": 0,
              "created_utc": 1733553385.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0pp5lv",
      "author": "void_const",
      "body": "They love abandoning products they just released.",
      "score": 4,
      "created_utc": 1733496444.0,
      "replies": []
    },
    {
      "id": "m0px1sq",
      "author": "quietIntensity",
      "body": "All in one PCs are terrible. It's the worst of all worlds in a single piece of hardware. You get a monitor that would be useful far longer than the computer, but you can't use it as a monitor for any other PC. You get shitty laptop hardware packed into a tiny case on the back of the monitor, usually little or no upgrade options available, but its still a desktop machine, not really portable at all. The market for these is almost exclusively rich people who buy this stuff as throwaway items and people who don't know a fucking thing about computers at all, but like the nice single unit packaging.\n\nI would never recommend one of these to anyone for any use case. No one that would ask me about this stuff is rich enough to buy throwaway hardware.",
      "score": 3,
      "created_utc": 1733499092.0,
      "replies": [
        {
          "id": "m0q73xl",
          "author": "None",
          "body": "This isn’t accurate, at all. It’s a high end 4.5K display + the M4 chip which is the opposite of shitty laptop hardware. If you’ve ever been to university, graphic design rooms are filled with iMacs for a reason.",
          "score": 9,
          "created_utc": 1733502316.0,
          "replies": [
            {
              "id": "m0qay97",
              "author": "quietIntensity",
              "body": "Do all of you Mac people consider your hardware to be regular PC hardware? It's not. Even then, let's compare on costco.com today:\n\nMac Mini base model - M4 10/10 core, 16gb RAM, 256GB storage: $579\n\niMac equivalent model with 24\" screen: $1349\n\nFor the almost $800 difference in price, you can get a pretty nice monitor. Granted, if you are part of the fruit cult, you won't buy anything less than the $1600 27\" monitor they offer as the smallest monitor they sell outside of the iMac display. But for the rest of us, $770 will buy a really nice display. If you're doing professional things that require a pro display, you're not buying an iMac (at least not if you're smart). \n\nI don't see this as a great deal. We're looking at picking up a new Mac Mini with the M4 Pro chip for $1349, and using one of our existing monitors we bought for under $800. This seems to me a far better deal than any iMac they are currently selling, both in the bang for your buck category and the ability to expand/upgrade later.",
              "score": -9,
              "created_utc": 1733503524.0,
              "replies": [
                {
                  "id": "m0rb0qy",
                  "author": "Extension_Carpet2007",
                  "body": "That’s how much those monitors cost. Or at least close enough once you consider the generic apple markup. So it’s like buying a Mac mini and a slightly overpriced monitor, and in return you get it all in one, which is significantly cleaner and easier for most people. \n\nThe assertion that people would need to be doing “professional things” to buy a high end monitor is weird. To most non-gamers (ie apple buyers) the monitor matters more than the gpu or whatever. People like screens that look nice.",
                  "score": 5,
                  "created_utc": 1733514851.0,
                  "replies": []
                },
                {
                  "id": "m0qt8i1",
                  "author": "None",
                  "body": "My point is that there’s a target audience for each Apple product. Some will pay for the convenience of an all-in-one. Additionally, similarly spec’d displays (500-nit, DCI-P3, 1b-color) go easily over $1,000. Notable examples of these include LG UltraFine, Dell UltraSharp, and ASUS ProArt 4K. \n\nConsidering the above, iMac is really not that terrible of a purchase, especially if you don’t have a good 4K display lying around.",
                  "score": 3,
                  "created_utc": 1733509219.0,
                  "replies": []
                },
                {
                  "id": "m0qhcp0",
                  "author": "karlzhao314",
                  "body": "Agreed.\n\nI don't consider myself part of the fruit cult, but lately I have been able to appreciate a lot of the advantages and integrations in the fruit ecosystem. I'm up to daily driving an iPhone, an iPad, and an M4 Mac Mini (along with two custom PCs and many other non-Apple products).\n\nThe iMac is the one product I truly can't imagine I would *ever* buy for any reason at any price. It legitimately just makes no sense to me.",
                  "score": -3,
                  "created_utc": 1733505511.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0q2l8n",
          "author": "Striking_Ad_4562",
          "body": "I don’t think this is a fair assessment. \n\nI still use my IMac from 2009. The only upgrade I had to make was for an SSD. \n\nMy work Lenovo laptop from 2020 bit the bullet this year. The USB-C port could no longer charge the computer. \n\nI moved my iMac from home to work. As a small business owner I am thrilled with the reliability, length of life and ease of use of an iMac. I don’t have an IT department and don’t care for the frequent issues I had with my laptop/monitor combo such as USB-C connector issues, firmware updates etc. \n\nThe only issue I have with iMac at this point is that I can no longer update the OS to a newer version but it hasn’t been prohibitive to my daily use at this point. \n\nJust some food for thought.",
          "score": 7,
          "created_utc": 1733500869.0,
          "replies": [
            {
              "id": "m0q4zd8",
              "author": "quietIntensity",
              "body": "Macs do seem to have a longer useful life than PC hardware, but still, when you upgrade, no matter how nice your display is and how well it still works, you have to buy another one. If you would have bought a Mac Mini and a display separately, you can upgrade to the new Mini for a fraction of the price of a new iMac and keep your same display if you want.",
              "score": 1,
              "created_utc": 1733501638.0,
              "replies": [
                {
                  "id": "m0rlafg",
                  "author": "Mikerosoft925",
                  "body": "Yeah but the display from 2009 he bought back then would be shit now, so he’d be buying a new monitor anyway.",
                  "score": 4,
                  "created_utc": 1733518175.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0q6qp2",
              "author": "dajarbot",
              "body": "It is nice that your old computer still works but I don't think that it is relevant. There is no good reason to by an all-in-one like this today. \n\nFor MacOS the same price of an iMac you could get a Mac Mini, mouse, keyboard, & bigger monitor for cheaper or get a MacBook that actually goes places easily. Same goes for this Windows machines.",
              "score": -5,
              "created_utc": 1733502199.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0qgyes",
      "author": "ToastnSalmon",
      "body": "Microsoft mistake is trying to compete with Apple on price thinking consumers care about tech. If they buy apple, they dont care about tech. Its brand. Microsoft would do better by creating midrange tech like the GPUs. I'm already super excited to see the new arc but back to subject. Surface would have caught one if it was cheaper. I'm using one for work myself and its the most amazing thing ever for my line of work. I just can't justify 2100+ on current gen one when a surface 2 RT works just as fine and cost me like 75 bucks.",
      "score": 3,
      "created_utc": 1733505389.0,
      "replies": []
    },
    {
      "id": "m0qkt8o",
      "author": "crappydeli",
      "body": "It was a cool product but way too expensive.",
      "score": 1,
      "created_utc": 1733506589.0,
      "replies": []
    },
    {
      "id": "m0qlily",
      "author": "Daovin",
      "body": "My Surface RT had a WindowsRT update that was larger than it's internal memory. Poor thing bricked itself.",
      "score": 1,
      "created_utc": 1733506810.0,
      "replies": []
    },
    {
      "id": "m0qrlp5",
      "author": "kclongest",
      "body": "iMac rival? Completely different products.",
      "score": 1,
      "created_utc": 1733508704.0,
      "replies": []
    },
    {
      "id": "m0r3328",
      "author": "MHWGamer",
      "body": "their own greed will always bite them. Honestly, the touch display with the cool hinge with the puck tool is amazing but they wanted the sweet apple cash of always replacing the entire computer when upgrading.\nMS furthermire asks premium prices while not delivering the most premium experience. Generally, why would any costumer choose a surface laptop when sometimes for an entire grand cheaper you can get basically the same machine from dell and co. (not shilling for them, they are also bad but MS takes the crown). Only corpo buys MS but then why would they choose the corpo in person named Dell, Lenovo or Hp?",
      "score": 1,
      "created_utc": 1733512324.0,
      "replies": []
    },
    {
      "id": "m0sqpia",
      "author": "Son_of_Macha",
      "body": "If no-one buys something it isn't a gap. Plenty of aio pcs from Dell, HP, Lenovo etc.",
      "score": 1,
      "created_utc": 1733532897.0,
      "replies": []
    },
    {
      "id": "m0t8pb2",
      "author": "moonracers",
      "body": "Microsoft discontinuing something again?? GTFOH!",
      "score": 1,
      "created_utc": 1733540128.0,
      "replies": []
    },
    {
      "id": "m0tkd42",
      "author": "monkey_gamer",
      "body": "🥱 Someone will fill the gap eventually",
      "score": 1,
      "created_utc": 1733545202.0,
      "replies": []
    },
    {
      "id": "m0tlaoe",
      "author": "SoUpInYa",
      "body": "All-in-one PC = docked laptop",
      "score": 1,
      "created_utc": 1733545634.0,
      "replies": []
    },
    {
      "id": "m0uyks3",
      "author": "beardbeak",
      "body": "You better buy one before tariffs, cuz thy gonna cost you double soon.  Electronics starting at only 6 thousand, get ‘em while they last.",
      "score": 1,
      "created_utc": 1733574641.0,
      "replies": []
    },
    {
      "id": "m1029dj",
      "author": "chrisagiddings",
      "body": "That the iMac is a high end all in on computer and is the low end of Apple’s lineup … says something about the Windows ecosystem.",
      "score": 1,
      "created_utc": 1733643738.0,
      "replies": []
    },
    {
      "id": "m10uxdm",
      "author": "RenegadeUK",
      "body": "I was hoping for a MS Surface Studio 3, but there we are.\n\nWhat about  the HP OmniStudio X 31.5\" AIO (2024), reviewed[ here](https://www.youtube.com/watch?v=zw2eyQrg5rA).",
      "score": 1,
      "created_utc": 1733662258.0,
      "replies": []
    },
    {
      "id": "m11hx05",
      "author": "BytchYouThought",
      "body": "Who tf buys all in ones? That's just a shitty choice imo for plenty of reasons. I highly advise against that shit in general. Get a regular desktop computer. It's worth it over the bullshit alll in ones.",
      "score": 1,
      "created_utc": 1733671756.0,
      "replies": []
    },
    {
      "id": "m0qx4cs",
      "author": "sCeege",
      "body": "This was always the writing on the wall when Panos Panay left the company. He was the brains behind the entire Surface lineup as well as pushing for innovative products like the Surface Studio and the Surface Headphones.\n\nIirc, one of the reasons he left was because Microsoft did not want to pursue innovation that were risky, they wanted to cash in on market winners like the surface tablets and the such",
      "score": 1,
      "created_utc": 1733510442.0,
      "replies": [
        {
          "id": "m0tr26c",
          "author": "smallcoder",
          "body": "Ah that sucks. I guess MS have become \"big blue\" IBM in the end, with the majority of their megabucks coming from the corporate sector rather than consumers and creatives. I guess in fairness, unlike Apple, they never were a hardware company in the first place, and have always been about Windows and Office plus all the server and comms side.\n\nThere was though a brief moment when it seemed like they were onto something with the whole Surface line up.",
          "score": 1,
          "created_utc": 1733548387.0,
          "replies": [
            {
              "id": "m0w851a",
              "author": "sCeege",
              "body": "Steve Jobs foretold this kind of shift in a company [when they start promoting business talent](https://www.youtube.com/watch?v=P4VBqTViEx4), as opposed to products people. We see this prominently with the promotion of Steve Ballmer in Microsoft:\n\n> Under Ballmer’s leadership, a 14-year period, the company tripled sales and doubled profits, but lost its market dominance and missed out on 21st-century technology trends such as the ascendance of smartphones in the forms of iPhone and Android.\n\n> -Wikipedia \n\nLike you said, Apple was always a “Computer” company, creative vision aside, they view their products as complete appliances, and therefore they try to ship them as such. For me, Windows hardware was treated much more as a division or product type. \n\nAnd yeah, Panay tried to push for more Surface products, but was eventually vetoed, so he left.",
              "score": 2,
              "created_utc": 1733591434.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0rrex5",
      "author": "Mama_Skip",
      "body": "I work in the creative industry. \n\nMost creative jobs (some Adobe Illustrator work in exception) are held fast to a windows environment because most programs were built on that OS. Some platforms are offering Mac OS versions, but they're usually buggy, and since most pipelines require 4-6 programs total, it doesn't make sense to switch over until they all do simultaneously. That won't change any time soon. \n\nSo MS is still sitting pretty on that front. \n\nNow for the Surface: My boss wanted to order us all surfaces and I was the one holdout that refused to change from my old dusty trusty 22hd wacom. \n\nMy colleagues suddenly hit a problem: *the surface is a fairly weak computer.* For any sort of 3d or CAD work, you need a beefy computer. So they had two computers: the MS Surface for the stylus work, and a tower for CAD. Now they needed aux programs to run mouse/keyboard through. And to transfer files you need to email, drive or Dropbox it. Which of course Legal hates when it's supposed to be skunkwork stuff. \n\nIn other words, not only was it a hassle. It was an expensive hassle, cus I could do everything they did with just my oldschool stylus monitor.\n\nThis isn't even getting into the shite support Surfaces have for customizable buttons - and buttons in the first place - something very crucial to streamlining the pipeline. \n\n---\n\nTl;dr - the surface is a tool for creatives, but it's specifically too weak for most pipelines, requiring a second computer anyway. And the jobs it *isn't* too weak for are either better performed on devices like Wacom or Huion monitors, or are (like graphic design) already established on Mac OS. \n\nI'm actually unsure who their market was. Not surprised to hear they're canceling.",
      "score": 1,
      "created_utc": 1733520181.0,
      "replies": []
    },
    {
      "id": "m0q7zx0",
      "author": "gourmetguy2000",
      "body": "The aio pc is wasteful anyway. Monitor should be reusable",
      "score": 0,
      "created_utc": 1733502598.0,
      "replies": []
    },
    {
      "id": "m0t3sm9",
      "author": "mixduptransistor",
      "body": "I mean Apple barely sells any iMacs, all the money is in laptops",
      "score": 0,
      "created_utc": 1733538099.0,
      "replies": []
    },
    {
      "id": "m0q24ob",
      "author": "correctingStupid",
      "body": "Good. All in ones are  wasteful",
      "score": -1,
      "created_utc": 1733500724.0,
      "replies": []
    }
  ]
}