{
  "post": {
    "title": "Sony considers PS5 price hikes to cover Trump’s tariffs | The company is also open to moving PlayStation manufacturing to the United States.",
    "author": "a_Ninja_b0y",
    "id": "1kmbppf",
    "score": 1489,
    "created_utc": 1747218321.0,
    "selftext": "",
    "num_comments": 249,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kmbppf/sony_considers_ps5_price_hikes_to_cover_trumps/"
  },
  "comments": [
    {
      "id": "ms8z80a",
      "author": "Sam_Cobra_Forever",
      "body": "I was at a PlayStation presentation with Phil Harrison on the PlayStation 2. He explained how he went to this extremely rural part of what I think was Vietnam in order to find a factory that made screws for a tiny fraction of a penny less. The idea that they would make these in the United States is a joke, don’t be foolish enough to believe that.",
      "score": 1358,
      "created_utc": 1747220229.0,
      "replies": [
        {
          "id": "ms918rm",
          "author": "Sam_Cobra_Forever",
          "body": "GDC 1999 I think if anyone wants to look it up.",
          "score": 178,
          "created_utc": 1747221178.0,
          "replies": [
            {
              "id": "msjhths",
              "author": "elheber",
              "body": "Congratulations America. Your children will have jobs inserting those tiny screws on an assembly line for as little pay as they can get away with. Progress baby!",
              "score": 13,
              "created_utc": 1747353558.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms94z69",
          "author": "HereForTheComments57",
          "body": "If they think a tariff price hike is bad, wait until they see a \"made in USA\" price hike! I'm sure companies are going to say things like\"we would consider building in the US\" to gain political points when though they have no intention to do so",
          "score": 314,
          "created_utc": 1747222836.0,
          "replies": [
            {
              "id": "msav3j2",
              "author": "needle14",
              "body": "I have a hard time believing the people who couldn’t handle egg prices are suddenly going to be happy with American made prices.",
              "score": 47,
              "created_utc": 1747242567.0,
              "replies": [
                {
                  "id": "mt7vbad",
                  "author": "trentonromero",
                  "body": "That's if you believe they ever cared about egg prices or gas prices. I do not for one second.",
                  "score": 2,
                  "created_utc": 1747701752.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ms9d9tv",
              "author": "JoviAMP",
              "body": "A company decided to put people who say they'd pay more to buy American to the test. They ran an A/B test where they sold a [showerhead](https://afina.com/blogs/news/made-in-usa?srsltid=AfmBOopfdWHBmAPXnqgji_qLgzSKggLbqwZxyAdRQrIIM8UmuKhF_63h) that was made in China at $129, and an identical showerhead that was made in the USA at $239, and ended up selling 584 China-made showerheads, and ZERO USA-made showerheads.",
              "score": 203,
              "created_utc": 1747226142.0,
              "replies": [
                {
                  "id": "ms9zvfk",
                  "author": "and1984",
                  "body": "They didn't need an A/B test ...",
                  "score": 30,
                  "created_utc": 1747233568.0,
                  "replies": [
                    {
                      "id": "msaqrkx",
                      "author": "jmartin21",
                      "body": "They did, until that test anything was just an assumption on their part (for example, assuming people will follow through with their statement of ‘I would pay more to by American made’)",
                      "score": 66,
                      "created_utc": 1747241336.0,
                      "replies": [
                        {
                          "id": "msdwa3q",
                          "author": "ArtOfWarfare",
                          "body": "That’s quite the premium though. They should try a 10% difference instead of 100%.",
                          "score": -25,
                          "created_utc": 1747277399.0,
                          "replies": [
                            {
                              "id": "msdwfok",
                              "author": "jmartin21",
                              "body": "The premium is based on what they need to be able to keep the same profit margins. Many businesses pack much wiggle room there, and even a slight decrease in the price may lead them to be insolvent over time.",
                              "score": 28,
                              "created_utc": 1747277458.0,
                              "replies": []
                            },
                            {
                              "id": "mswtdbs",
                              "author": "ironyinabox",
                              "body": "Is this satire? Do you understand how a free market economy works? Google \"invisible hand\" you donkey.",
                              "score": 1,
                              "created_utc": 1747546342.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "msau2e5",
                      "author": "djk29a_",
                      "body": "While a similar motivation of proof (if in good faith) it’s similar to companies putting out job ads and crying that they can’t find candidates for their job postings. The difference is that job markets != goods markets != securities markets.\n\nYou have to have evidence to show to the public or administrative bodies that regulations upon your company are working as intended or not.\n\nAdditionally, let’s recall Apple attempted to manufacture Mac Pros in the US and found that even labor / skilling isn’t necessarily the biggest issue but that the US is such a huge country with long distances for suppliers that it would be a huge problem while in China with its urban manufacturing model you have lots of options for suppliers for so many parts across different cities. This took China decades and decades to reach this state even with its well known underhanded and morally dubious methods while in the US we can’t even manufacture most weapons of war cost-effectively with our stupidly over-funded DoD (read: the de facto US federal jobs program).\n\nSo my supposition is that if we instantly disbanded our DoD, had zero need for new human labor and shoved ALL that defense money (read: debt) into more consumer goods manufacturing _maybe_ we would have something viable for manufacturing a broader range of goods in like 13+ years in the US.",
                      "score": 15,
                      "created_utc": 1747242268.0,
                      "replies": []
                    },
                    {
                      "id": "msdqstw",
                      "author": "roychr",
                      "body": "It doesn't matter...soon enough no one will be able to afford anything in the U.S. let alone a console.",
                      "score": 2,
                      "created_utc": 1747275346.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mscd44h",
                  "author": "NotSoNiceO1",
                  "body": "Did the test had the showerhead stated where each was manufactured? It won't make a difference in the outcome, I was just wondering.",
                  "score": 1,
                  "created_utc": 1747258402.0,
                  "replies": [
                    {
                      "id": "mscqd7z",
                      "author": "apocalyptic_mystic",
                      "body": "I can't imagine why they would've done the test, otherwise.",
                      "score": 22,
                      "created_utc": 1747262735.0,
                      "replies": []
                    },
                    {
                      "id": "mshgvh8",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 6,
                      "created_utc": 1747330839.0,
                      "replies": [
                        {
                          "id": "mso7t0z",
                          "author": "thegiantcat1",
                          "body": "Right, I was shocked when I read the article and it not only showed how the test was done but the data they collected ",
                          "score": 2,
                          "created_utc": 1747421548.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "msa1sfb",
                  "author": "Ashmizen",
                  "body": "That doesn’t prove anything though.  They were identical….so 100% of the people were smart enough to pay 129 instead of $239 for the same thing. \n\nUS manufacturing will never succeed because of just goodwill.  They will exist in cases where due to tariffs and other factors the US version is either higher quality or actually price competitive.",
                  "score": -38,
                  "created_utc": 1747234135.0,
                  "replies": [
                    {
                      "id": "msa71ce",
                      "author": "ShadowMerlyn",
                      "body": "I think it proves the point it was trying to make. Customers may prefer Made in US Goods but they rarely want them enough to pay Made in US prices.",
                      "score": 52,
                      "created_utc": 1747235669.0,
                      "replies": []
                    },
                    {
                      "id": "msadklh",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 34,
                      "created_utc": 1747237543.0,
                      "replies": [
                        {
                          "id": "msb03o5",
                          "author": "PsychedelicMagnetism",
                          "body": "The USA actually has the 2nd largest manufacturing output after China and accounts for about 1/8th of the world's manufacturing output.",
                          "score": -9,
                          "created_utc": 1747243967.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "msasec2",
                      "author": "ilud2",
                      "body": "That’s exactly what they were trying to prove. Americans won’t pay extra for a product that’s the exact same as it’s Chinese counterpart just because it was made in America",
                      "score": 9,
                      "created_utc": 1747241797.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ms9ov1k",
                  "author": "_TheMeepMaster_",
                  "body": "The shower head was a $110 markup. That's a terrible \"test\" that proves absolutely nothing. This is just bad faith.",
                  "score": -64,
                  "created_utc": 1747230171.0,
                  "replies": [
                    {
                      "id": "ms9qlr5",
                      "author": "HereForTheComments57",
                      "body": "[here](https://www.fox4news.com/news/afina-showerheads-tariffs-test) is the story. The showerhead wasn't \"marked up\", it was the actual cost with the tariffs. Regardless, people may pay a tiny percentage more for made in USA, but 99% of people will buy cheaper even if it's 2 dollars difference.",
                      "score": 47,
                      "created_utc": 1747230734.0,
                      "replies": []
                    },
                    {
                      "id": "ms9rlty",
                      "author": "CamRoth",
                      "body": "Not if it would cost that much more to make it in the US.",
                      "score": 19,
                      "created_utc": 1747231051.0,
                      "replies": []
                    },
                    {
                      "id": "ms9x753",
                      "author": "xschalken",
                      "body": "When you think of the fact that your average American factory worker will earn more than ten times (and that's likely understanding it) what a factory worker will earn in China or wherever, it is not that hard to understand how the price difference would be that much.",
                      "score": 22,
                      "created_utc": 1747232770.0,
                      "replies": []
                    },
                    {
                      "id": "ms9ps4b",
                      "author": "NecroCannon",
                      "body": "So what’s your idea of a test in good faith? Because that’s the experience",
                      "score": 20,
                      "created_utc": 1747230471.0,
                      "replies": [
                        {
                          "id": "msbx9ql",
                          "author": "edvek",
                          "body": "You would need to see how much people are willing pay over the other. Maybe people are willing to pay $10 more, or even $50 more but that price difference is quite the shock so it makes sense people wouldn't buy it. Even if the Chinese one lasted 5 years and the US one lasted 10 years, so technically a better deal for time and money people will still spend the lower upfront cost.\n\nIt's like looking do American made clothes. I looked some time ago and the cost of simple button down shirts and jeans were significantly higher than the stuff made overseas. And I'm not talking about some fancy 1000% marked up brand either. Maybe it's a bit better but haven't looked in years.\n\nSo ya people do want to buy American but the cost is too high. And to expect people to stick to that principle, especially now, is insane. Everything is getting too expensive so you have to cut costs where you can.",
                          "score": -11,
                          "created_utc": 1747253568.0,
                          "replies": [
                            {
                              "id": "msh18p7",
                              "author": "NecroCannon",
                              "body": "Maybe your kind of people cares, but most people don’t care, it’s what ever is cheapest or last the longest. And American brands are tanking on the reliability aspect because ours care more about profit than volumes",
                              "score": 3,
                              "created_utc": 1747326330.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "msahth9",
                  "author": "Ja_Rule_Here_",
                  "body": "That’s the point of tariffs though. Just boost the price of the Chinese one to $239 with a tariff and now consumers will either pay the tariff or buy the US made one, either way win for the country. It does cause higher prices, but theoretically should drive up employment too which would drive up wages and ideally the balance at the end is a net positive.",
                  "score": -23,
                  "created_utc": 1747238750.0,
                  "replies": [
                    {
                      "id": "msaj2ay",
                      "author": "StillwaterJerry",
                      "body": "Do you think there's a large amount of unemployment in the country currently?\n\nI worked as a manufacturing engineer for a company that assembled high dollar items in the US.... And we couldn't keep new employees no matter what we did. This company paid pretty well and gave substantial quarterly bonus.... One year every single employee in the company got 12k bonus for Christmas. Despite that we were always struggling having enough people.",
                      "score": 12,
                      "created_utc": 1747239111.0,
                      "replies": [
                        {
                          "id": "msavqsv",
                          "author": "Ja_Rule_Here_",
                          "body": "Good thing we have a long list of people willing to drop everything and immigrate here. Believe it or not our country was built on immigration.\n\nAlso, you could certainly keep employees if you paid competitively, but you didn’t want to. If $12k isn’t enough, try $30k. If $100k isn’t enough, try $200k.",
                          "score": -16,
                          "created_utc": 1747242749.0,
                          "replies": [
                            {
                              "id": "msb4xqy",
                              "author": "StillwaterJerry",
                              "body": "The same person pushing the Tariffs is deporting everyone and legally immigrating takes forever and is very difficult.\n\nYeah let's give all manufacturing workers 30k Christmas bonus' and pay them 200k... I'm sure everything will be very reasonable priced.\n\nYou're not living in reality with comments like this and it's pretty obvious",
                              "score": 15,
                              "created_utc": 1747245312.0,
                              "replies": [
                                {
                                  "id": "msb8wk0",
                                  "author": "Ja_Rule_Here_",
                                  "body": "Deporting illegal immigrants, there is a difference. And we don’t have the labor shortage yet… but when we do we can easily open the spigot. \n\nWhat’s wrong with paying people fairly? $200k and a 30k bonus is what I get… why does someone working for you deserve less than me? My job isn’t all that hard.",
                                  "score": -16,
                                  "created_utc": 1747246444.0,
                                  "replies": [
                                    {
                                      "id": "msbb75n",
                                      "author": "StillwaterJerry",
                                      "body": "There's no difference, they are deporting illegal immigrants that will do the jobs very few US citizens will do.  But they are also denying more H-1B visas and revoking student visas. There's already a shortage of high end talent in the US and this regime doesn't care.\n\nNobody works for me. But if you paid everyone that kind of money shit could cost 5x as much and nothing would change. You think someone can go from paying an employee 50k to 200k and not have to jack the price WAY up?\n\nYou live in some fantasy land where all us workers want to work in factories can get paid astronomical wages to do so but that's not real life. The cost of good would skyrocket and nobody could afford it. The US is a knowledge economy, the manufacturing days are gone.",
                                      "score": 8,
                                      "created_utc": 1747247112.0,
                                      "replies": [
                                        {
                                          "id": "msbgaqz",
                                          "author": "Ja_Rule_Here_",
                                          "body": "Doesn’t seem there’s a shortage, have you heard about all the recent layoffs in tech? \n\nThere is certainly a difference between a legal and illegal immigrant. \n\nAnd yeah you can jack wages up quite a bit without affecting price too much. Wages are only one component of price, ultimately the market works on supply and demand. The price will equalize somewhere, and corporate profits may have to suffer a bit boo hoo. Have you seen the bonuses that business execs get? Makes 30k look like peanuts. The system can work, but not with us selling out our own people in order to make things for pennies by exploiting foreign workers so executives can buy another yacht. That’s what has to change, corporate profits.",
                                          "score": -1,
                                          "created_utc": 1747248592.0,
                                          "replies": [
                                            {
                                              "id": "msbj0y8",
                                              "author": "StillwaterJerry",
                                              "body": "You know that layoffs mean the opposite of a shortage right? That means there's a job shortage not a labor shortage \n\nSure sure and as soon as the rich are willing to give up money for the average American we can live in your utopia. Until then... Not so much.",
                                              "score": 4,
                                              "created_utc": 1747249382.0,
                                              "replies": [
                                                {
                                                  "id": "msbpb6h",
                                                  "author": "Ja_Rule_Here_",
                                                  "body": "Did you forget what point you were arguing? \n\n“There’s already a shortage of high end talent in the US”\n\nThat’s what you said. I said there’s no shortage. Then you say \n\n“That means there’s a job shortage not a labor shortage”\n\nWhich is.. what.. I… said. No current labor shortage.",
                                                  "score": 1,
                                                  "created_utc": 1747251237.0,
                                                  "replies": [
                                                    {
                                                      "id": "msbx7ao",
                                                      "author": "StillwaterJerry",
                                                      "body": "There's a big difference between who's getting laid off and high end talent. Tech companies are not laying off elite engineers and idea people.",
                                                      "score": 3,
                                                      "created_utc": 1747253549.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "msbqzpk",
                  "author": "YnotBbrave",
                  "body": "People would not pay double.\nBut otoh would pay $139 for a US made shower head vs $129 for a Chinese made\n\nThe taarif will help reduce the price gap, maybe enough to make some American made products possible",
                  "score": -19,
                  "created_utc": 1747251734.0,
                  "replies": [
                    {
                      "id": "msc18er",
                      "author": "Bill_buttlicker69",
                      "body": "Let's fix your example. The original scenario was Chinese - $129, US - $239. You're saying if instead it was China - $129, US - $139, more people would be willing to buy American. But they already have the opportunity to do that. American manufacturing is just much more expensive due largely to stricter labor laws. If American companies wanted to compete at that price, they would. Since they can't, a tariff jacks up the price of the foreign-made item so that the American price becomes competitive.\n\nIn short, you would be looking at China - $316 (that's the original price plus 145% tariff), US - $316 because guess what: there's no incentive for a US company to offer it for substantially lower than the competition.\n\nNow, the China tariff has just been dropped to 30% for a time, which would make the price $168, still $30 more than your pie-in-the-sky estimate. But the more broad point to make here is that with this completely unhinged and random assignment of tariffs, no company is going to make hard plans to move manufacturing into the US right now, even if they pretend they're thinking about it for PR. And even if they do, it's not going to be a slightly higher price than before. It will be a lot more expensive.\n\nTo help illustrate the chaos of all of this a little better, consider a Chinese company staring down the barrel of a 145% tariff. That's so unbelievably high that they're going to start looking into moving operations to another country with lower tariffs such as Vietnam (46%) or Thailand (36%). And then a month later, Trump backs down and changes the China tariff to 30%. Well now it doesn't make any sense to move to those two countries after all, since it will be more expensive now. And when supply chain shifts like this take on the order of several years to complete, and Trump is tweeting changes from the toilet at 3am every other day, it's completely impossible to make plans like that.\n\nAnd furthermore, to circle back to shower heads again, *even if* a company builds a factory here in the US, almost every single good requires parts and resources that aren't found in the US. And when those parts and resources get imported, they get charged the requisite tariff. So it's not even simply a matter of building a facility here. It's straight up not possible to source everything domestically, so prices will still rise.\n\nHopefully you're starting to get the picture here. These tariffs, combined with the nature of their implementation, is the equivalent of a crazy person on the subway swinging a bag of piss around. Totally unpredictable and making a fucking mess of everything. And people here are still clapping for him and calling him a genius.",
                      "score": 21,
                      "created_utc": 1747254778.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms96cjp",
              "author": "f8Negative",
              "body": "They'll assemble in the US if anything. Assembly by automated robots.",
              "score": 13,
              "created_utc": 1747223414.0,
              "replies": []
            },
            {
              "id": "msc8swp",
              "author": "Lindaspike",
              "body": "So they’re going to build some beautiful new factories to make PlayStations from parts made in China? Or are they gonna build another factory to make the parts?",
              "score": 4,
              "created_utc": 1747257088.0,
              "replies": [
                {
                  "id": "mscggzu",
                  "author": "HereForTheComments57",
                  "body": "That's the thing, the parts made in USA would be more expensive to manufacture and the tariffs from parts coming from China would increase the cost. Either way, in the end PlayStation's would cost more",
                  "score": 6,
                  "created_utc": 1747259444.0,
                  "replies": []
                },
                {
                  "id": "mshhdx6",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1747330984.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mse0vu2",
              "author": "EnormousGucci",
              "body": "I was about to say… so what they’re saying is they’re gonna have to do a price hike or a… price hike? Am I getting this right",
              "score": 2,
              "created_utc": 1747279238.0,
              "replies": []
            },
            {
              "id": "msdksx9",
              "author": "Ohiostate717",
              "body": "Just say you like slave labor haha it’s ok, we won’t judge",
              "score": 1,
              "created_utc": 1747273218.0,
              "replies": []
            },
            {
              "id": "ms9zwne",
              "author": "woodcookiee",
              "body": "Idk much about economics, but couldn’t they just manufacture only for domestic sales?",
              "score": -9,
              "created_utc": 1747233578.0,
              "replies": [
                {
                  "id": "msaret5",
                  "author": "llamapower13",
                  "body": "Yes it’s possible. \n\nBut even a domestic made PS5 would be assembled here and not made. Things like mother boards have very limited manufacturing options and all are over seas. \n\nMy out of my butt guess is we wouldn’t see a completely US made PS until PS7 because it would take that long to recreate the total supply chain stateside (and that’s even if you could)",
                  "score": 5,
                  "created_utc": 1747241520.0,
                  "replies": []
                },
                {
                  "id": "msa0ttl",
                  "author": "HereForTheComments57",
                  "body": "So they would manufacture overseas for overseas sales only and then manufacture domestically for domestic sales only?\n\nThat's 2 manufacturing facilities, 2 times the number of employees, 2 times the amount of assembly equipment, etc. The US made one would still have a cost increase because of the cost to manufacture goods in the US. Plus if they don't send any overseas, then they will be taking a huge profit hit, which they will try to recover from another cost increase.",
                  "score": 14,
                  "created_utc": 1747233851.0,
                  "replies": [
                    {
                      "id": "msau7yl",
                      "author": "woodcookiee",
                      "body": "The North American markets account for nearly 40% of PS5 sales, which seems like enough to justify a dedicated facility. To me (again, not even an armchair expert) it makes sense to consolidate as much of the supply chain as close to the consumer as possible",
                      "score": -4,
                      "created_utc": 1747242313.0,
                      "replies": [
                        {
                          "id": "msb8u5b",
                          "author": "HereForTheComments57",
                          "body": "Yes, but all those parts being produced domestically will cost more to manufacture and raise the price that much more.",
                          "score": 5,
                          "created_utc": 1747246425.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ms9ds6u",
          "author": "colemaker360",
          "body": "Exactly. This guy has 1347 days from today left in office, which is the max time available before this policy changes. No one’s building a factory in the US for that tiny policy window. I’m not sure why so many people can’t seem to put that together.",
          "score": 53,
          "created_utc": 1747226333.0,
          "replies": [
            {
              "id": "ms9hd4i",
              "author": "WarbossTodd",
              "body": "It’s cute how you think he’s going to willingly leave office.",
              "score": 29,
              "created_utc": 1747227618.0,
              "replies": [
                {
                  "id": "ms9mqmp",
                  "author": "boyyouvedoneitnow",
                  "body": "You’re right, he’s going to die in it",
                  "score": 15,
                  "created_utc": 1747229468.0,
                  "replies": [
                    {
                      "id": "ms9mw23",
                      "author": "WarbossTodd",
                      "body": "Yes but how? I’m thinking Nick Offerman in Civil War style.",
                      "score": -4,
                      "created_utc": 1747229519.0,
                      "replies": [
                        {
                          "id": "ms9xftg",
                          "author": "gatsby712",
                          "body": "All the hamberders",
                          "score": 2,
                          "created_utc": 1747232842.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "msdl0c3",
                  "author": "Ohiostate717",
                  "body": "He legally has to and will, you’re so far down your own rabbit hole if you think he’d just take another term. Just keep your tin foil hat on and eat your bagel bites in your mom’s basement.",
                  "score": -5,
                  "created_utc": 1747273288.0,
                  "replies": [
                    {
                      "id": "msdl9q7",
                      "author": "WarbossTodd",
                      "body": "First, it’s my basement thank you very much and secondly, HE’S LITERALLY SELLING 3RD TERM MERCH",
                      "score": 8,
                      "created_utc": 1747273378.0,
                      "replies": [
                        {
                          "id": "msdljm9",
                          "author": "Ohiostate717",
                          "body": "And? I’m a nobody and I can start selling merch that says I’m and idiot and an astronaut like Katy Perry . Doesn’t mean it’s true mf real, or legal haha. I hope it’s a nice basement that’s finish at least.",
                          "score": -4,
                          "created_utc": 1747273473.0,
                          "replies": [
                            {
                              "id": "msdrrqa",
                              "author": "WarbossTodd",
                              "body": "He, his surrogates, GOP members of the house and senate have all said he’s going to go for a 3rd term. It won’t be legal, it won’t be right but he’s going to try and do it.",
                              "score": 5,
                              "created_utc": 1747275704.0,
                              "replies": [
                                {
                                  "id": "msrjxsb",
                                  "author": "MrHedgehogMan",
                                  "body": "He will make it legal",
                                  "score": 1,
                                  "created_utc": 1747471460.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "msezx8a",
                      "author": "noeydoesreddit",
                      "body": ">He legally has to and will\n\nHe is legally required to facilitate the return of Abrego Garcia according to the 9-0 SC ruling. He hasn’t, and no one has held him accountable.\n\nHe is legally required to give immigrants due process before deportation. He hasn’t, and no one has held him accountable\n\nHe is legally required to fund colleges despite any misgivings he has with their “ideology.” He hasn’t, and no one has held him accountable.\n\nHe is legally required to reject “gifts” from other countries. He hasn’t, and no one has held him accountable. \n\nHe is legally required to get congressional approval to implement the vast majority of his agenda instead of issuing illegal executive orders. He hasn’t, and no one has held him accountable.\n\nHe was legally required to accept the results of the 2020 election. He still hasn’t, and no one has held him accountable.\n\nHe was legally required to not incite a mob of his supporters to attack the capitol. He did, and no one has held him accountable.\n\nHe was legally required to not call Georgia and try to get them to “find votes” after he lost the election. He did, and no one has held him accountable \n\nHe is legally required to not deport US citizens. He has, and no one has held him accountable.\n\nHe was legally required to return the classified documents that he took from the White House. He didn’t (they had to be seized), and no one has held him accountable.\n\nDo I need to go on? Without enforcers, “the law” is just words on a page. You’re literally not paying attention if you think this administration gives a fuck about the law or will somehow be held accountable for their flagrant disregard of it. He has brazenly broken the law for nearly a decade now and suffered absolutely 0 meaningful consequences, and somehow you think that’s about to change? \n\nThe Supreme Court also gave him immunity for all “official” acts. All he has to do is claim election fraud and shut down the polling stations and say it’s an “official act” because “as president I have an official responsibility to protect the integrity of our elections.” Same argument he used in the Georgia case. The Supreme Court has told him that he’s above the law, the deliberate lack of urgency of the DOJ has told him that he’s above the law, and—perhaps most damningly—the country itself has told him that he’s above the law by choosing to re-elect him despite his 30+ felony convictions and the many pending charges against him. \n\nDon’t be so naive.",
                      "score": 2,
                      "created_utc": 1747297772.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "msaao4d",
              "author": "daemon_panda",
              "body": "To rephrase what I said before, because people think I am implying the opposite:\n\nTrump is going to run again, then IF he loses, he will blame his failure on a rigged election and not leave",
              "score": 5,
              "created_utc": 1747236711.0,
              "replies": []
            },
            {
              "id": "ms9mx3x",
              "author": "daemon_panda",
              "body": "Why do you think his term ends then?",
              "score": 3,
              "created_utc": 1747229529.0,
              "replies": [
                {
                  "id": "ms9z8q2",
                  "author": "theoutsider91",
                  "body": "There’s Trump 2028 merch out now. He’s gonna run again, and if he loses, he’ll just say the election was rigged and not leave office. Who would drag him out of there?",
                  "score": 12,
                  "created_utc": 1747233381.0,
                  "replies": [
                    {
                      "id": "msa9ii8",
                      "author": "daemon_panda",
                      "body": "Not sure why I am getting down votes when you are obviously correct and I am basically asking why people thinks he leaves in 2.5 years.\n\nEdit: I seem to have left out a sentence I mean to write",
                      "score": 2,
                      "created_utc": 1747236378.0,
                      "replies": [
                        {
                          "id": "msap1uc",
                          "author": "theoutsider91",
                          "body": "Sorry, I misunderstood you",
                          "score": 2,
                          "created_utc": 1747240841.0,
                          "replies": [
                            {
                              "id": "msapd3s",
                              "author": "daemon_panda",
                              "body": "Yea... I was vague. It would probably help to use my words. If my worst problem today is being downvoted on Reddit, I am in a good spot. I am the problem here",
                              "score": 2,
                              "created_utc": 1747240931.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ms9m9oi",
          "author": "Betancorea",
          "body": "People already freaking out at the Xbox price increase. A “Made in USA” price bump would drive them insane",
          "score": 12,
          "created_utc": 1747229310.0,
          "replies": []
        },
        {
          "id": "msa2aj7",
          "author": "greatuncleglazer",
          "body": "Are the screws the same quality of metal that come with every piece of furniture in a box these days? One twist too many and you’ve stripped everything for life. Have to superglue the shit in afterwards. I’d rather pay a few more bucks for metal that wasn’t made out of recycled tin foil.",
          "score": 4,
          "created_utc": 1747234282.0,
          "replies": [
            {
              "id": "msakzs3",
              "author": "Sam_Cobra_Forever",
              "body": "That’s really it and why they had to travel there. I had to replace a part on my electric skateboard purely because cheap screws stripped and I couldn’t fix something repairable. When you are making a million PlayStations you can’t use cheap-ass screws, so if a place is saying they are cheap and good you need to verify.",
              "score": 2,
              "created_utc": 1747239669.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msaan1n",
          "author": "Vitaminpartydrums",
          "body": "Exactly this, and even it if was just “assembled” in the US the amount of chips and tiny screws imported facing tariffs would still Jack the price up \n\nEveryone complaining about egg prices and inflation proceeded to vote for a price hike on legit everything.\n\nA price hike that Trump gleefully told you about over and over before the election.",
          "score": 3,
          "created_utc": 1747236702.0,
          "replies": []
        },
        {
          "id": "ms95j7n",
          "author": "Seeteuf3l",
          "body": "Also Trump will be long gone (🤞) since the hypothetical Playstation factory is up and running",
          "score": 8,
          "created_utc": 1747223072.0,
          "replies": []
        },
        {
          "id": "mse2jq8",
          "author": "Mediocre_Focus9238",
          "body": "why dont we just get rid of unions and the minimum wage so we can make those screws for cheaper /s",
          "score": 2,
          "created_utc": 1747279933.0,
          "replies": []
        },
        {
          "id": "mserf0x",
          "author": "Zaku99",
          "body": "Not to mention quality control issues.",
          "score": 2,
          "created_utc": 1747292439.0,
          "replies": []
        },
        {
          "id": "ms99pd7",
          "author": "Atilim87",
          "body": "Look at the previous “commitments” countries and businesses made to Trump.\n\nOnly ones that did a dam between Trumps 2 terms are the ones that got a lot of money from Biden.",
          "score": 3,
          "created_utc": 1747224771.0,
          "replies": []
        },
        {
          "id": "ms9xw90",
          "author": "chirpz88",
          "body": "The idea that it would raise the price is also insane. Every part would need to be created in the US to avoid Tarrifs and that would absolutely increase the price.",
          "score": 1,
          "created_utc": 1747232978.0,
          "replies": []
        },
        {
          "id": "msahjwe",
          "author": "WasabiParty4285",
          "body": "That not true. Sony would happily build them in the United States, if someone else build the factory and hires the labor and then charges Sony the same price they are paying now. Who wants to sign up to build the factory and hope tarrifs are still in place in 3 years once you get the factory open and can hopefully hire workers for the price you need?",
          "score": 1,
          "created_utc": 1747238673.0,
          "replies": []
        },
        {
          "id": "msalbnw",
          "author": "Jebus_UK",
          "body": "Yeah saying the are open to moving manufacturing to the US and actually doing it are two very different things ",
          "score": 1,
          "created_utc": 1747239764.0,
          "replies": []
        },
        {
          "id": "msb2lqm",
          "author": "kalisun87",
          "body": "You have to get the notion of manufacturing facilities being filled with human labor. These mfg jobs will be staffed by robots with minimal human input. Look at the xaomi phone new mfg plant with 0 humans",
          "score": 1,
          "created_utc": 1747244665.0,
          "replies": []
        },
        {
          "id": "mscuysc",
          "author": "anm767",
          "body": "What are working conditions for those Vietnamize workers making screws for less? Would you work there?",
          "score": 1,
          "created_utc": 1747264290.0,
          "replies": []
        },
        {
          "id": "msf52vi",
          "author": "BigfootEatsBabys",
          "body": "Kind of a different world now vs then though",
          "score": 1,
          "created_utc": 1747301081.0,
          "replies": []
        },
        {
          "id": "mskea0e",
          "author": "DocRedbeard",
          "body": "Most of the cost now is the main processor and graphics card. Build those in the US and you've cut out tariff costs for most of the device. We don't know exactly how the tariffs will work, but they often will accept some amount of imported material if the majority is local or if most of production is done in country.",
          "score": 1,
          "created_utc": 1747365871.0,
          "replies": [
            {
              "id": "msli2t3",
              "author": "Sam_Cobra_Forever",
              "body": "Trumps tariffs are pure grift to benefit himself personally",
              "score": 1,
              "created_utc": 1747387791.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msdldkj",
          "author": "Ohiostate717",
          "body": "Doesn’t mean he can’t still buy those tiny screws over there and then build it in the US. That’s how lots of car manufacturers are",
          "score": 0,
          "created_utc": 1747273415.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms97nsm",
      "author": "nelly2929",
      "body": "Trump will accept a gold PS5 to put on his plane from Qatar and remove Sony from the tariff list…. It’s how the USA works now ",
      "score": 489,
      "created_utc": 1747223948.0,
      "replies": [
        {
          "id": "msam1of",
          "author": "CrocodylusRex",
          "body": "He wouldn't know how to use it. He'd put it on Baron's plane",
          "score": 64,
          "created_utc": 1747239972.0,
          "replies": [
            {
              "id": "msatbnp",
              "author": "SwingingtotheBeat",
              "body": "“It’s all computer.”",
              "score": 41,
              "created_utc": 1747242055.0,
              "replies": [
                {
                  "id": "msb62cv",
                  "author": "stefanopolis",
                  "body": "“He’s very smart, Barron. Very smart. Everything’s computers now and he knows computers. Many very good people are saying he knows how to send mail electronically through the interwebs. He knows how to do a blockchain, I’ve heard. And we’re going to bring blockchain manufacturing back to America, I tell you. You’ll say ‘This is the best chain I’ve ever seen made with only the best blocks.’”",
                  "score": 30,
                  "created_utc": 1747245628.0,
                  "replies": [
                    {
                      "id": "msc1024",
                      "author": "andrewmmm",
                      "body": "I think it would be filled with more tangents like \"You look at Barron. Smart kid, unbelievably smart. And you know, I know smart people, really, I’ve known them my whole life. But Barron, he’s something else with these computers. He’s on there doing things, emails, I think they call it electronic mail, did you know that? People didn’t know about electronic mail until recently, very new, very complicated. He sends emails like nobody’s business. They come up to me, big tough guys, they have tears in their eyes, and they say, ‘Sir, we’ve never seen anyone email like your son Barron.’ Incredible.\n\nAnd blockchain, he’s tremendous at blockchain. Blockchain, nobody understands blockchain, really when you think about it! It’s very complicated, you’ve got blocks, you’ve got chains, they’re all linked somehow, believe me, they’re linked, very strongly linked. We’re gonna make our own blockchain right here in America, we’re bringing blockchain manufacturing home, folks. China, they do blocks, but not like ours. Ours are bigger, better, stronger blocks. Beautiful blocks, tremendous chains. You’re gonna see our chains and say, ‘Wow, that’s a fantastic chain, Sir. Nobody builds chains like America does.’ And Barron, he’s leading the charge. Terrific kid. Very, very smart.\"",
                      "score": 8,
                      "created_utc": 1747254703.0,
                      "replies": [
                        {
                          "id": "mslvmhl",
                          "author": "stefanopolis",
                          "body": "Alright you definitely did it better.",
                          "score": 1,
                          "created_utc": 1747394848.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "msatmm3",
              "author": "Torchy84",
              "body": "“Baron , how do you turn on the dvd player!”",
              "score": 5,
              "created_utc": 1747242143.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msbflz0",
          "author": "spreadthaseed",
          "body": "Pay to play(station)",
          "score": 4,
          "created_utc": 1747248395.0,
          "replies": [
            {
              "id": "msca0i9",
              "author": "kungfungus",
              "body": "Or! Pay and pray, then game.",
              "score": 1,
              "created_utc": 1747257456.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ms8xzl7",
      "author": "CamiloArturo",
      "body": "Which means they’ll buy $2m in Trump coin and suddenly we’ll see the tarries  on “video game consoles which use X chip- only used in the PS5” to be abolished",
      "score": 137,
      "created_utc": 1747219627.0,
      "replies": [
        {
          "id": "ms953vo",
          "author": "No_Doubt_About_That",
          "body": "Either that or offer him a plane",
          "score": 21,
          "created_utc": 1747222892.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msai3w3",
      "author": "None",
      "body": "[deleted]",
      "score": 32,
      "created_utc": 1747238833.0,
      "replies": [
        {
          "id": "msezlaq",
          "author": "malagic99",
          "body": "Same, I always waited a few years before getting the new console… this might be the first generation of PlayStation I will skip",
          "score": 6,
          "created_utc": 1747297554.0,
          "replies": [
            {
              "id": "msf6w5y",
              "author": "mythical_tiramisu",
              "body": "Honestly, having gone from PS4 to 5, you aren’t missing out on much. Just save your money and stick with the 4.",
              "score": 3,
              "created_utc": 1747302203.0,
              "replies": [
                {
                  "id": "msgxrj9",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1747325299.0,
                  "replies": [
                    {
                      "id": "mshgxc4",
                      "author": "mythical_tiramisu",
                      "body": "The load times on the 5 are much better/quicker than the 4, but personally I wouldn’t say upgrade on that alone. TBH unless the next gen offer something significantly better than the current one I can’t see myself bothering with it.",
                      "score": 2,
                      "created_utc": 1747330854.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ms91e84",
      "author": "ZealousidealEntry870",
      "body": "Can we please stop saying company x is going to move manufacturing to the US? None of them are going to follow through. It’s a lie to appease the king orange turd because he’s too dumb to realize it’s a lie.",
      "score": 362,
      "created_utc": 1747221247.0,
      "replies": [
        {
          "id": "ms97jqv",
          "author": "baumpop",
          "body": "Asia collectively just went, what if we just tell him whatever and then just do whatever else. ",
          "score": 107,
          "created_utc": 1747223903.0,
          "replies": [
            {
              "id": "msa0hjn",
              "author": "marine72",
              "body": "Literally, is he keeping tabs or remembering anything? If i ever meet Trump, I'm just gonna be like, i hope you're enjoying that $10m gold toaster i gave ya. \n\nHe'll be like oh yea, what a fantastic toaster, the best bread that became toast you ever seen, thanks, here's a card to ignore tariff hikes at checkout.",
              "score": 16,
              "created_utc": 1747233749.0,
              "replies": []
            },
            {
              "id": "ms9j2fg",
              "author": "GWooK",
              "body": "As much as I don’t buy Sony will want to move their manufacturing to America, it’s Sony. Here in Japan, we don’t get same products as American counterparts. You can go to any stores and literally Sony TV will be priced two to five times above the competition. Sony doesn’t even prioritize Japan at all. In name, Sony is Japanese but in practice, Sony is American. Sony is so anti-consumer protection in Japan that they rarely provide warranty to people buying from certified third-party stores.   \n\nPeople can say Sony is Japanese but as Japanese resident, Sony is an American company. It will always be an American company. If it can, it will leave Japan and move everything to America. Only reason Sony is not doing that is that Japanese consumers are so infatuated by Sony marketing that they don’t know they are getting fucked over by Sony. If Sony moved, Japanese consumers would quickly noticed they were being duped.   \n\nFuck Sony and everything it represents. I wouldn’t be surprised if Sony did move headquarter to America.",
              "score": 19,
              "created_utc": 1747228218.0,
              "replies": [
                {
                  "id": "msa79rk",
                  "author": "locky_",
                  "body": "They can move their headquarters wherever they want. \n\nThe cost is where they manufacture the goods. And that, will not be the USA for the foreseable future, is not economically feasable, unless the prices go x3 or x4, and no one is gonna buy at that price in the USA or Europe.",
                  "score": 11,
                  "created_utc": 1747235737.0,
                  "replies": []
                },
                {
                  "id": "ms9wejl",
                  "author": "tylerderped",
                  "body": ">You can go to any stores and literally Sony TV will be priced two to five times above the competition.\n\nThat's because they have the best TV's and it's not even close. If you want a TV that doesn't have a shitty OS and is likely to last 10 years or more, Sony is it.",
                  "score": -3,
                  "created_utc": 1747232532.0,
                  "replies": [
                    {
                      "id": "msa0utx",
                      "author": "etenightstar",
                      "body": "I have a LG going on 7 years with no problems so Sony isn't alone in that.",
                      "score": 13,
                      "created_utc": 1747233859.0,
                      "replies": [
                        {
                          "id": "msnr8vy",
                          "author": "tylerderped",
                          "body": "Ewwwww, crappy OS.",
                          "score": 1,
                          "created_utc": 1747416589.0,
                          "replies": []
                        },
                        {
                          "id": "mspe5qx",
                          "author": "heyhotnumber",
                          "body": "And your TVos is hot summertime garbage. Ask me how I know.",
                          "score": 1,
                          "created_utc": 1747434955.0,
                          "replies": [
                            {
                              "id": "mssc5g5",
                              "author": "aleksndrars",
                              "body": "you only have to use the tv remote like twice a year though. the tv gui doesn’t matter",
                              "score": 1,
                              "created_utc": 1747486690.0,
                              "replies": [
                                {
                                  "id": "msw3o80",
                                  "author": "heyhotnumber",
                                  "body": "Uhh, no? \n\nWhat good is buying a premium TV setting if I can’t calibrate it to the video sources I’m using? \n\nAnd the constant aggressive inescapable homescreen advertisements alone make it a nightmare, even if you just used a set-too box for everything. \n\nIt’s okay to admit it’s ass.",
                                  "score": 1,
                                  "created_utc": 1747534185.0,
                                  "replies": [
                                    {
                                      "id": "mt3qc54",
                                      "author": "aleksndrars",
                                      "body": "i’ve never had a problem with it so idk i don’t think it’s ass. i prefer the apple tv so i have that too, but before i bought it i used the regular LG tv os. i didn’t ever have ads on mine. maybe that’s specific to each model? ads are indeed annoying, especially on stuff you already bought, but idk i never had any.\n\nmost people don’t need to change their tv profile from gaming, to cinema, to sports, etc. all the time. i just turned off the motion smoothing mode (forget what it’s called) and leave it alone. the most interaction i see with the LG OS is the little notification on the top right corner of the screen whenever i start a movie that has HDR",
                                      "score": 1,
                                      "created_utc": 1747653358.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "msa2qfn",
                      "author": "Exodite1",
                      "body": "In past years but not recently. They have much higher failure rates in their newer TVs",
                      "score": 8,
                      "created_utc": 1747234412.0,
                      "replies": []
                    },
                    {
                      "id": "msaj7ti",
                      "author": "GWooK",
                      "body": "You don’t understand because you don’t live here. When companies like LG and Panasonic are close in competition, Sony has prices that are twice or three times more than their competitor’s best products. Make it make sense. Even employees working at electronics stores would just straight up tell me not to buy Sony. It’s actually cheaper to buy Sony tv from US and import it than buy a Sony TV in Japan. That’s how anti-consumer protection Sony is in Japan. \n\nBut Sony basically won marketing campaign long ago in Japan. People will only buy Sony because they think competition doesn’t even come close. I’m sorry but the price point for Sony products are ridiculous. Sony treats Japan like shit because Sony doesn’t care about Japanese market. People literally cannot afford Sony TV. Sony only cares about its bread and butter and that is America. This is the main reason why Sony will make enemy with the entire world for America. Sony makes insane amount of revenue from America that it doesn’t care about rest of the world. I would be an idiot to pay five times more for a Sony product that is more of the same as foreign competitor’s product.",
                      "score": 3,
                      "created_utc": 1747239155.0,
                      "replies": [
                        {
                          "id": "msrk6m1",
                          "author": "MrHedgehogMan",
                          "body": "I used to sell TVs and I told people that with a Sony you’re paying for four things. \n\nThe letters ‘S’, ‘O’, ‘N’ and ‘Y’ that are stuck to the front. \n\nEverything but their top tier models (at the time) were made by Samsung, and for the money the software, picture quality and ease of use was better in Panasonics.",
                          "score": 1,
                          "created_utc": 1747471620.0,
                          "replies": [
                            {
                              "id": "msy9w9g",
                              "author": "ghost_of_mr_chicken",
                              "body": "I was a home theater/automation tech for a couple decades. To me, Sony used to always have the best picture, until you took it out of torch mode or calibrated it. Panasonics had awesome video when calibrated (not saying it had poor video out of the box). Overall though, IMO, the Pioneer Elite blew everything else out of the water without even breaking a sweat.",
                              "score": 1,
                              "created_utc": 1747575167.0,
                              "replies": [
                                {
                                  "id": "msygioe",
                                  "author": "MrHedgehogMan",
                                  "body": "The Pioneers were indeed fantastic. The ‘Kuro’ plasmas were unbeatable.",
                                  "score": 1,
                                  "created_utc": 1747577522.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "msfi20c",
                      "author": "Tokemon12574",
                      "body": "I used to think that. I bought an X90J a couple years back and it quickly developed a blob in the middle. Had it replaced before the extended warranty ran out and went home with a brand new X90L. \n\n\nA couple months later,  dead pixels, and weird lines. Replaced with another. \n\n\nIt's started to freeze, and I'm convinced it won't last the 7-odd years I'd expect to get out of a flagship TV. \n\n\nTheir quality control simply isn't what it used to be. ",
                      "score": 2,
                      "created_utc": 1747307995.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "msghtpi",
              "author": "escalinci",
              "body": "Foxconn promised to build chip factories during Trump 1 and that completely withered.",
              "score": 1,
              "created_utc": 1747320631.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms95rxk",
          "author": "TheCuriousGamer",
          "body": "I wonder how high tariffs would actually need to be that it makes financial sense to build factories and produce with US workers.\nEither way the US consumer would be paying higher prices.",
          "score": 16,
          "created_utc": 1747223175.0,
          "replies": [
            {
              "id": "ms97yiq",
              "author": "Wtfplasma",
              "body": "Enough to make Harbor Freight tools cost as much as a Snap On.",
              "score": 10,
              "created_utc": 1747224071.0,
              "replies": [
                {
                  "id": "ms9ielo",
                  "author": "TingleyStorm",
                  "body": "And I’d still buy them over Snap On.\n\nOnce upon a time, Snap On was the pinnacle of tool quality. If you bought a wrench, there was a good chance your great-grandchild would still be able to turn it. If it broke or wore out before then, they would replace it free of charge. These days everyone else has caught up in terms of quality, so you only buy Snap On to show off how much debt you’re willing to put yourself into.\n\nBesides, HF’s Icon sets are made in the US already, at a fraction of the price of Snap On.",
                  "score": -1,
                  "created_utc": 1747227983.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ms9fxnz",
              "author": "Mr_Slippery1",
              "body": "To be honest I am not sure there is a real number, once tariffs gets to 100%+ it stops a lot of the normal day to day trade, only essentials or things already in transit are moving.  We saw a huge decrease in ordering from our customer base.\n\nFor a company like Sony to plan and build a factory, employ workers, etc not only would it cost a huge amount it would take 2-4 years best case scenario to get up and running.  I would say the system would likely cost double and would still have quite a few offshore parts.",
              "score": 3,
              "created_utc": 1747227112.0,
              "replies": [
                {
                  "id": "ms9h26m",
                  "author": "TheTyger",
                  "body": "2-4 years is also a very optimistic outlook on getting a factory up and running.",
                  "score": 3,
                  "created_utc": 1747227511.0,
                  "replies": [
                    {
                      "id": "ms9m878",
                      "author": "Mr_Slippery1",
                      "body": "I agree...that would be best case scenario as in they took over an existing empty space and had to add on, etc.\n\nMost companies also know in 3.5 years things might be totally different so unless they are certain this move will be quick and easy and the big factor...make them more money they are not likely to do it.",
                      "score": 3,
                      "created_utc": 1747229296.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "msa3y3w",
                  "author": "theorgangrindr",
                  "body": "You also need to be able to source a significant amount of the components in the US because you'll be paying tariffs on all of those too.",
                  "score": 1,
                  "created_utc": 1747234763.0,
                  "replies": [
                    {
                      "id": "msa9kpa",
                      "author": "Mr_Slippery1",
                      "body": "Correct, which in many cases won't be possible or cost effective.  Even \"USA made\" are generally not actually that, we have loads of equipment builders in North America supporting jobs, etc yet a large portion of the components come in from overseas.\n\nElectronics here...good luck unless its all automated which means very little to no jobs.",
                      "score": 1,
                      "created_utc": 1747236395.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms9bbsd",
              "author": "ZealousidealEntry870",
              "body": "The issue is that companies don’t build out new manufacturing sites because of a knee jerk idiot adding tariffs that will be removed by the next democratic president. It takes a ridiculous amount of time and money to start planning, much less actually building the new facilities. \n\nJust my random guess, you’d shutdown the US economy and put us back to the dark ages before you could tariff high enough to bring manufacturing back.\n\nAnother important thing to note, there are some companies building/planning out new US sites. It has nothing to do with the orange turd. They are doing so because they saw how disruptive Covid was.",
              "score": 9,
              "created_utc": 1747225403.0,
              "replies": []
            },
            {
              "id": "ms9ize1",
              "author": "Servebotfrank",
              "body": "They would need to be guaranteed to stay forever, which we know they aren't. As of now, cheaper to eat the costs and just assume they go away after four years. If Republicans give reason to believe that they will keep doing this even after Trump is gone, then companies will back Democratic politicians to make sure it doesn't.\n\nWhich is still cheaper than moving factories over here.",
              "score": -1,
              "created_utc": 1747228188.0,
              "replies": [
                {
                  "id": "msbr2ou",
                  "author": "tiandrad",
                  "body": "They don’t need a guarantee, by the time they are up and running most of the manufacturing will be automated. Once you eliminate the workers cost it’s beneficial to be in the place that purchases most of your products.",
                  "score": 0,
                  "created_utc": 1747251759.0,
                  "replies": [
                    {
                      "id": "msbwly6",
                      "author": "Servebotfrank",
                      "body": ">Once you eliminate the workers cost it’s beneficial to be in the place that purchases most of your products.\n\nMost of the materials necessary to make these products still need to be imported, that's literally the main issue. A lot of the materials necessary to make a lot of products don't exist in the US. Manufacturing stuff here is still more expensive, if it wasn't companies would do it.",
                      "score": 1,
                      "created_utc": 1747253378.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ms9tvo9",
          "author": "furyotter",
          "body": "They know all trump wants is an empty promise he can make into a sound bite",
          "score": 2,
          "created_utc": 1747231764.0,
          "replies": []
        },
        {
          "id": "msbqlih",
          "author": "tiandrad",
          "body": "If that was true, no one would be freaking out.",
          "score": 2,
          "created_utc": 1747251617.0,
          "replies": [
            {
              "id": "mscdtgn",
              "author": "ZealousidealEntry870",
              "body": "This isn’t r/conservative. Go back to your hole.",
              "score": 0,
              "created_utc": 1747258619.0,
              "replies": [
                {
                  "id": "msdg162",
                  "author": "obvious-but-profound",
                  "body": "You’re probably just mad those mods keep deleting your comments 🤣",
                  "score": 4,
                  "created_utc": 1747271580.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ms9cp0n",
      "author": "tignasse",
      "body": "The whole planet have to spend more money because of the US tariffs ???",
      "score": 37,
      "created_utc": 1747225925.0,
      "replies": [
        {
          "id": "msan9nz",
          "author": "Blackliquid",
          "body": "Reddit might not like it but this aspect of trumps plan is working out so far. I don't like it either.",
          "score": 8,
          "created_utc": 1747240326.0,
          "replies": []
        },
        {
          "id": "msxayic",
          "author": "rjksn",
          "body": "Dont buy american. Ever. ",
          "score": 1,
          "created_utc": 1747557046.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms90imj",
      "author": "Sellazar",
      "body": ">\"Is open to moving PlayStation manufacturing to the US.\"\n\nThat's corporate speak for we are to talk about it, but unless the move is of any value, we will politely decline.\n\nThey know how Trump works, this wording will be enough to make sure Trump runs with.",
      "score": 46,
      "created_utc": 1747220840.0,
      "replies": [
        {
          "id": "ms935am",
          "author": "grilledcheeseburger",
          "body": "Sure they're open to it, if you build them the facility.",
          "score": 14,
          "created_utc": 1747222033.0,
          "replies": []
        },
        {
          "id": "msjd990",
          "author": "pixel_of_moral_decay",
          "body": "“Give us a tariff waver and we’ll pretend to go along until the end of your term”",
          "score": 1,
          "created_utc": 1747351930.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms9aqhp",
      "author": "rccola85",
      "body": "Ah yes, manufacture the PS5 here to save us from the tariffs. Nevermind the fact the PS5 would probably cost 3x as much in that scenario.",
      "score": 27,
      "created_utc": 1747225173.0,
      "replies": [
        {
          "id": "ms9eszi",
          "author": "urbanshack",
          "body": "Sometimes you have to scratch your head and wonder who’s the bright person to come up with that idea.",
          "score": 13,
          "created_utc": 1747226705.0,
          "replies": [
            {
              "id": "ms9g8nw",
              "author": "rccola85",
              "body": "It’s like someone else said, it’s probably an unserious suggestion meant to appease Trump, who actually believes it’s a reasonable option for some reason. 🤦‍♂️",
              "score": 8,
              "created_utc": 1747227221.0,
              "replies": []
            },
            {
              "id": "msavz44",
              "author": "EngineOrnery5919",
              "body": "It's the orange man that's to blame\n\nHe's been obsessed with tarriffs since the 80s. Still hasn't learned basic economy class\n\nSo here we are, a nice Trump tax to fill their rich pockets while we can hardly afford food much less chips",
              "score": 2,
              "created_utc": 1747242815.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ms9a654",
      "author": "Im_with_stooopid",
      "body": "Ever wonder what it would be like to pay Australian pricing on a PS5 in America. We are soon to find out.",
      "score": 15,
      "created_utc": 1747224954.0,
      "replies": []
    },
    {
      "id": "ms9xy66",
      "author": "firedrakes",
      "body": "But Sony would never do hikes... wait they already did around the world",
      "score": 6,
      "created_utc": 1747232994.0,
      "replies": []
    },
    {
      "id": "msbfhks",
      "author": "Remic75",
      "body": "Aaaaand that’s another product that may rise the prices but never bring it down even after the whole tariffs bs gets resolved. \n\nIf you were thinking of getting one for GTA VI, now’s a great time to consider.",
      "score": 3,
      "created_utc": 1747248360.0,
      "replies": []
    },
    {
      "id": "ms8wiq7",
      "author": "ken120",
      "body": "Be cheaper to just pass the tariffs to the customers.",
      "score": 26,
      "created_utc": 1747218876.0,
      "replies": [
        {
          "id": "ms8xyry",
          "author": "sketchysuperman",
          "body": "I mean, clearly not if they’re considering moving manufacturing.",
          "score": -35,
          "created_utc": 1747219616.0,
          "replies": [
            {
              "id": "ms91mem",
              "author": "hedoeswhathewants",
              "body": "0.0000% chance that happens",
              "score": 28,
              "created_utc": 1747221351.0,
              "replies": [
                {
                  "id": "ms9e3d6",
                  "author": "XxOmegaSupremexX",
                  "body": "Even if they do they are not going to bring the jobs people think they are. They would most likely be fully automated factories. If by chance some jobs are made available, Americans are not lining up for factory jobs.",
                  "score": 10,
                  "created_utc": 1747226448.0,
                  "replies": [
                    {
                      "id": "ms9wvv4",
                      "author": "LeccaTheTrapGod",
                      "body": "You think fully automated factories require no human intervention at all? Preventative maintenance? Scheduled shutdowns? Lubrication of machinery? Someone to be there to oversee the machinery?",
                      "score": -2,
                      "created_utc": 1747232677.0,
                      "replies": [
                        {
                          "id": "msa4sbb",
                          "author": "XxOmegaSupremexX",
                          "body": "Those few and far between jobs are not what maga was promising when they said they will be brining manufacturing back to the USA. What they really meant was that they and their cronies can now start up new businesses with few labour costs. \n\nDon’t be so pedantic.",
                          "score": 5,
                          "created_utc": 1747235008.0,
                          "replies": [
                            {
                              "id": "msarlfp",
                              "author": "LeccaTheTrapGod",
                              "body": "I voted for Trump and I work at a place that’s pretty automated lol, used to require way more than 1-4 people to operate a refinery unit, it’s exactly what I had in mind when he said bring jobs back",
                              "score": -3,
                              "created_utc": 1747241572.0,
                              "replies": [
                                {
                                  "id": "msb8myn",
                                  "author": "XxOmegaSupremexX",
                                  "body": "Enjoy your vote.",
                                  "score": 3,
                                  "created_utc": 1747246369.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ms91r1d",
                  "author": "sketchysuperman",
                  "body": "That’s just 0, no decimals needed.\n\nI would also argue it’s a greater than 0% chance if the company stated they’d consider it. That at least deserves a 0.01%",
                  "score": -23,
                  "created_utc": 1747221409.0,
                  "replies": [
                    {
                      "id": "ms98pvx",
                      "author": "David-Puddy",
                      "body": "Significant figures matter. \n\n\n0.000000% indicates a greater level of accuracy than 0%.",
                      "score": 14,
                      "created_utc": 1747224380.0,
                      "replies": []
                    },
                    {
                      "id": "ms92lw5",
                      "author": "IndyMLVC",
                      "body": "You believe everything companies tell you? Interesting.",
                      "score": 7,
                      "created_utc": 1747221794.0,
                      "replies": [
                        {
                          "id": "ms92zbf",
                          "author": "sketchysuperman",
                          "body": "Yes, I do. Because clearly you can deduce that from my comment. Jesus this subreddit doesn’t have the brightest folks.",
                          "score": -23,
                          "created_utc": 1747221958.0,
                          "replies": [
                            {
                              "id": "ms934l5",
                              "author": "IndyMLVC",
                              "body": "You mean like someone who doesn't understand that the OP added 0's for emphasis? You are one to talk.",
                              "score": 8,
                              "created_utc": 1747222024.0,
                              "replies": [
                                {
                                  "id": "ms940i2",
                                  "author": "sketchysuperman",
                                  "body": "Adding 0s to 0 doesn’t do that for me, because 0 is 0. Can’t emphasize nothing harder than saying nothing. \n\nAlso not wise to assume something is absolutely certain to happen or not when you know absolutely nothing about that thing.\n\nAll these keyboard warriors acting like they’re business analysts because they read tech news.",
                                  "score": -3,
                                  "created_utc": 1747222418.0,
                                  "replies": [
                                    {
                                      "id": "ms9457p",
                                      "author": "IndyMLVC",
                                      "body": "Ahhh. So you have to stick to imperial logic at all times and don't understand sarcasm? Welcome, my fellow neurodivergent.",
                                      "score": 6,
                                      "created_utc": 1747222476.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms96x1y",
              "author": "mishap1",
              "body": "Where is most of the value in a PlayStation?  Is it in soldering the chips to a board?  Is it molding some plastic?  The US doesn't have the people and scale needed to wholesale move manufacturing here. Japan designs it but they make them in China or other lower cost regions because it's just a box that needs shit screwed together at huge scale and they don't have the people. \n\nWhat workforce can they use in the US? Do you see thousands of out of work skilled manufacturing employees sitting around ready to earn $8/hr on the high end?\n\nThey make a statement like this to show wall st they're being responsive and exploring options, raise prices because that still makes sense over changing their supply chain, and continue on.",
              "score": 4,
              "created_utc": 1747223648.0,
              "replies": []
            },
            {
              "id": "ms8yd2c",
              "author": "ken120",
              "body": "Not really makes for some good pr.  But with the high regulatory cost not to mention cost in the time to find a location and equip the place be ready to release the ps6 if not 7 before they make the money back.   Not to mention mostly.  Automated so very few actual will get hired.",
              "score": 3,
              "created_utc": 1747219813.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ms94pzc",
      "author": "wolfannoy",
      "body": "Uh huh",
      "score": 3,
      "created_utc": 1747222728.0,
      "replies": []
    },
    {
      "id": "msbttwv",
      "author": "flirtmcdudes",
      "body": "No way they actually start manufacturing them in the US… even if they did all the components come from overseas anyway and will still be tariffed",
      "score": 3,
      "created_utc": 1747252560.0,
      "replies": []
    },
    {
      "id": "ms9cc6q",
      "author": "I_R0M_I",
      "body": "The Japanese company will move production of a console that hasn't historically, been the best seller in the US. To the US.\n\nSure.",
      "score": 5,
      "created_utc": 1747225789.0,
      "replies": []
    },
    {
      "id": "ms8w8ww",
      "author": "VintageKofta",
      "body": "Fucking cowards, about to bend the knee..\n\nStand up to the bully and just say no ffs..",
      "score": 31,
      "created_utc": 1747218735.0,
      "replies": [
        {
          "id": "ms93kyp",
          "author": "Nerdenator",
          "body": "The only way to do that is to simply stop importing them into the United States. \n\nThey’re not going to do that.",
          "score": 12,
          "created_utc": 1747222226.0,
          "replies": []
        },
        {
          "id": "ms8zexa",
          "author": "xarkness",
          "body": "That's not how that works lol...",
          "score": 19,
          "created_utc": 1747220319.0,
          "replies": []
        },
        {
          "id": "ms8yz46",
          "author": "Ven18",
          "body": "How do you exactly want them to not “bend the knee” they are a business are they are never just going to eat needless cost that could go up to over 100% without warning. What is your plan just not sell your product in the US?",
          "score": 10,
          "created_utc": 1747220110.0,
          "replies": [
            {
              "id": "ms91yw0",
              "author": "AxCel91",
              "body": "I think they’ll survive making 600 million instead of 800 million",
              "score": -6,
              "created_utc": 1747221508.0,
              "replies": [
                {
                  "id": "ms95x3p",
                  "author": "PageOthePaige",
                  "body": "PlayStation's profit margins are about 6%. Their revenue is about 10 billion. The tariffs range from 10% to 50% from non Chinese companies, and 150% at its peak from China. If your profits are only 6% and your costs go up 10% in the most absolute generous of circumstances, no they won't survive that lmao. ",
                  "score": 8,
                  "created_utc": 1747223235.0,
                  "replies": [
                    {
                      "id": "msbeg1i",
                      "author": "xarkness",
                      "body": "Wow, someone actually did some \"math\" while the other is just babbling random numbers 👏",
                      "score": 4,
                      "created_utc": 1747248056.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ms96fin",
          "author": "PageOthePaige",
          "body": "How, exactly? Legally they have to pay the tariffs. Their options are either raise prices to absorb artificially increase costs, or stop selling to the US. Taking the cost hit for the consumer would drown them. \n\n\nThere's no alternative. ",
          "score": 5,
          "created_utc": 1747223448.0,
          "replies": []
        },
        {
          "id": "ms8xtgy",
          "author": "sketchysuperman",
          "body": "I mean. I hear you. But Sony is a business and exists for the soul purpose to make money. Taking a stand or proving a point isn’t really going to do anything for them.",
          "score": 7,
          "created_utc": 1747219542.0,
          "replies": [
            {
              "id": "ms91vbk",
              "author": "AxCel91",
              "body": "God forbid they make 700 million instead of 800 million. The horror.",
              "score": -5,
              "created_utc": 1747221463.0,
              "replies": [
                {
                  "id": "ms92xhf",
                  "author": "fr0st",
                  "body": "I mean I get the sentiment but the point of a business is to make money. So given the option of an extra $100 million you'd be stupid not to take it. To the executive who said \"well we're standing by our values\", the board would say \"we value money, get out\".",
                  "score": 3,
                  "created_utc": 1747221936.0,
                  "replies": [
                    {
                      "id": "ms938rx",
                      "author": "AxCel91",
                      "body": "I’m not one of those “capitalism bad corporations bad” kinda people but it makes my blood boil when large corporations would rather fuck the consumer with higher prices than take a little less profit, meanwhile the CEO gets a 50 million dollar bonus.",
                      "score": 6,
                      "created_utc": 1747222076.0,
                      "replies": [
                        {
                          "id": "msax0ao",
                          "author": "EngineOrnery5919",
                          "body": "So you are one of those capitalism is bad people!! ;)\n\n...Because it is\n\nWe see how quickly they bend the knee and beg to support the latest fascist regime\n\nSame thing happened in Nazi Germany. Companies profited off of the mass genocide. Some of those companies still exist today in the US and are one of the big ones...\n\nCorporations do what is opportunistic and they will pander to the government. If the government wants genocide, corporations will race through the door to be the ones selling the shovels\n\nIf the consumers keep voting for evil with their wallet, that is what corps will do\n\nBut, that requires smart people. Given that many in the US and in our regime ownership are now incompetent as ever and anti science or thinking...",
                          "score": -1,
                          "created_utc": 1747243103.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ms950sh",
                  "author": "ylerta",
                  "body": "They have a fiduciary responsibility to make that extra $100 million",
                  "score": 2,
                  "created_utc": 1747222856.0,
                  "replies": [
                    {
                      "id": "ms9ns3b",
                      "author": "AxCel91",
                      "body": "Someone I know who’s owned a large local business for 30+ years and did extremely well financially once told me if you take care of the customers and always put them first money will never be an issue. Wish corporations had the same mindset.",
                      "score": 1,
                      "created_utc": 1747229815.0,
                      "replies": [
                        {
                          "id": "ms9thjh",
                          "author": "ylerta",
                          "body": "I'm not against that, but unfortunately, Sony is a corporation and is liable to lawsuits if they don't do what is in the shareholder's best interest.",
                          "score": 4,
                          "created_utc": 1747231641.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ms92kat",
                  "author": "sketchysuperman",
                  "body": "You should look into what a publicly traded company is. There’s this thing called “profit” that share holders care about. \n\nIf a company reports an annual or quarterly revenue drop of 13%, their share price will go down, which is the opposite of what the company and share holders want to happen.",
                  "score": -5,
                  "created_utc": 1747221775.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ms8wmwx",
          "author": "methiasm",
          "body": "![gif](giphy|ZQIs3uUUe7NizBBOAa|downsized)",
          "score": -20,
          "created_utc": 1747218938.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msbvzjo",
      "author": "Raul_Duke_1755",
      "body": "I hear they're designing a whole franchise for him. Grand Theft White House",
      "score": 2,
      "created_utc": 1747253195.0,
      "replies": []
    },
    {
      "id": "msc5q8a",
      "author": "TheFettz79",
      "body": "Then the Empire has already won",
      "score": 2,
      "created_utc": 1747256167.0,
      "replies": []
    },
    {
      "id": "msc9go6",
      "author": "AFatz",
      "body": "Both will hike the price of the PS5",
      "score": 2,
      "created_utc": 1747257289.0,
      "replies": []
    },
    {
      "id": "msdlh4r",
      "author": "PurringWolverine",
      "body": "Lol…..No, they’re not. My the time they got a factory ready the PS5 won’t even be in production.",
      "score": 2,
      "created_utc": 1747273449.0,
      "replies": [
        {
          "id": "msgwdgo",
          "author": "ChaosNomad",
          "body": "Nvm them having to pay tariffs on the components. It makes almost 0 sense to build a facility in the US unless everything could be produced there, which it can’t reasonably.",
          "score": 1,
          "created_utc": 1747324887.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msff17e",
      "author": "Hedanielld",
      "body": "I want the psn prices to go back to the original prices.",
      "score": 2,
      "created_utc": 1747306585.0,
      "replies": []
    },
    {
      "id": "msjzfjd",
      "author": "jmillermcp",
      "body": "How is a maker of a console that is 100% manufactured and assembled outside of the U.S. going to raise prices because of something they don’t even pay?  Tariffs are paid by the *importer*.  Isn’t Sony the exporter in this scenario?  So, they raise prices…wouldn’t importers then have to pay even more? This is just textbook price gouging.",
      "score": 2,
      "created_utc": 1747360147.0,
      "replies": []
    },
    {
      "id": "msn663q",
      "author": "UsedScene8812",
      "body": "Just build a PC and free yourselves.  You can bring your controllers.",
      "score": 2,
      "created_utc": 1747410444.0,
      "replies": []
    },
    {
      "id": "ms97lrf",
      "author": "agentchuck",
      "body": "And several countries now have reciprocal tariffs so if they move to the US they'll be impacting profits from other regions.",
      "score": 3,
      "created_utc": 1747223925.0,
      "replies": [
        {
          "id": "ms9ftcz",
          "author": "DigitallyDetained",
          "body": "Yeah but the US market is so massive that wouldn’t matter.\n\nHowever, manufacturing in the US would also be so expensive that it would make a PS5 cost like $8k, so it will never happen.",
          "score": 3,
          "created_utc": 1747227070.0,
          "replies": [
            {
              "id": "ms9k3mj",
              "author": "agentchuck",
              "body": "I don't know about that. It's a massive market but it's smaller than the rest of the world. According to this: [Link](https://www.vgchartz.com/article/462864/ps5-outsells-nes/#:~:text=Breaking%20down%20sales%20by%20region,the%20rest%20of%20the%20world.)  North America (which includes Canada) is about 24M units, while the EU is about 20M units. And there's another 17M units elsewhere in the world, too.\n\nSo yeah, the US makes the lion's share, but it's going to be less than 40% of total sales. It'd really depend on how reciprocal tariffs were structured. And, as you mentioned, whether they could actually make a unit for a reasonable price on US soil.",
              "score": 4,
              "created_utc": 1747228578.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msbq214",
          "author": "tiandrad",
          "body": "You really think that is going to out weigh the US market. There is a reason everyone is freaking out over the US tariffs. The only other single country that can impact the world like this is China.",
          "score": 2,
          "created_utc": 1747251458.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms9z6or",
      "author": "None",
      "body": "Why would I want to buy anything made in USA? I want to buy quality products with good manufacturing practices. Give me made in Japan any day over crap USA made.",
      "score": 4,
      "created_utc": 1747233364.0,
      "replies": []
    },
    {
      "id": "ms8y57r",
      "author": "BUROCRAT77",
      "body": "I’d be curious if they’d have to jack the price way up after making them in the US considering wages would be much higher",
      "score": 4,
      "created_utc": 1747219704.0,
      "replies": [
        {
          "id": "ms8z7k5",
          "author": "Ven18",
          "body": "They are never going to actually manufacture in the US. They would still need to import essential parts into the country because the US simply does not have those resources internally so it wouldn’t really impact the tariffs. The considering line is just a PR move for headlines with zero actual plan to follow through.",
          "score": 16,
          "created_utc": 1747220223.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms9fmfr",
      "author": "colonelc4",
      "body": "They are testing the limits, they will not stop until sells will go down and looking at it, it won't since the world is full of reta...fortunate people.",
      "score": 2,
      "created_utc": 1747227001.0,
      "replies": []
    },
    {
      "id": "ms9qn67",
      "author": "TofTravels",
      "body": "“Open to”.. which means, they will say that, have a press conference saying they will move manufacturing to the US, they will be spared in the tariffs, and will never actually build a factory here..",
      "score": 2,
      "created_utc": 1747230747.0,
      "replies": []
    },
    {
      "id": "ms9jsdc",
      "author": "pseudopad",
      "body": "Just to be clear, when they say \"US manufacturing\" they mean \"Assembled in the US\". Literally every component will still be manufactured elsewhere.\n\nBut that still won't actually happen.",
      "score": 2,
      "created_utc": 1747228470.0,
      "replies": []
    },
    {
      "id": "ms99gg8",
      "author": "Due-Dragonfruit-1303",
      "body": "Glad I got mine a few months ago 😎 US may be falling apart but I can play oblivion on solar in the afterwards.",
      "score": 1,
      "created_utc": 1747224675.0,
      "replies": []
    },
    {
      "id": "ms9i767",
      "author": "cronopius",
      "body": "Guess which one will be",
      "score": 1,
      "created_utc": 1747227911.0,
      "replies": []
    },
    {
      "id": "msaaao8",
      "author": "Barnowl-hoot",
      "body": "Sony should give trump a gift and then trump will be like ps5 is exempt from tariffs…make a golden gilded ps5 or large TV",
      "score": 1,
      "created_utc": 1747236603.0,
      "replies": []
    },
    {
      "id": "msaaquz",
      "author": "One-life-remains",
      "body": "Both of those options are going to raise the cost of the PS5.",
      "score": 1,
      "created_utc": 1747236733.0,
      "replies": []
    },
    {
      "id": "msazdfn",
      "author": "KrazyCroat",
      "body": "Ok Japan, wtf. Toyota, Honda and now Sony?",
      "score": 1,
      "created_utc": 1747243760.0,
      "replies": []
    },
    {
      "id": "msbd2kk",
      "author": "Humble_Ad9815",
      "body": "The death nail for Sony PlayStation",
      "score": 1,
      "created_utc": 1747247658.0,
      "replies": []
    },
    {
      "id": "msbsfpq",
      "author": "strfish1",
      "body": "And here thinking of buying a PS5 pro just for GTA.",
      "score": 1,
      "created_utc": 1747252155.0,
      "replies": []
    },
    {
      "id": "msckbi5",
      "author": "prospekt403",
      "body": "Odd...the chips and components used cant be made (yet) in the US, so production is still going to get taxed as its imported. The manual labor to assemble the devices will be a big investment as well, and it'll never be as cheap as getting it made overseas....",
      "score": 1,
      "created_utc": 1747260691.0,
      "replies": []
    },
    {
      "id": "mscum83",
      "author": "anm767",
      "body": "I thought they increase prices to increase profits, my mistake.",
      "score": 1,
      "created_utc": 1747264171.0,
      "replies": []
    },
    {
      "id": "msdrtjn",
      "author": "gu_doc",
      "body": "I wonder how automated manufacturing is",
      "score": 1,
      "created_utc": 1747275723.0,
      "replies": []
    },
    {
      "id": "msdys82",
      "author": "Howboutnow82",
      "body": "Brilliant business strategy! I just know that consumers will be salivating at the chance to pay extra for a 5 year old console!!!",
      "score": 1,
      "created_utc": 1747278385.0,
      "replies": []
    },
    {
      "id": "msed1qz",
      "author": "omicron_persei",
      "body": "I hope is only for the US, theres no reason for a hike in price for the rest of the world, it would only mean the rest of the world would subside the tariffs imposed by the orange guy",
      "score": 1,
      "created_utc": 1747284601.0,
      "replies": []
    },
    {
      "id": "msegdez",
      "author": "heitiki",
      "body": "Fuck Sony then.",
      "score": 1,
      "created_utc": 1747286254.0,
      "replies": []
    },
    {
      "id": "msgb44t",
      "author": "no6969el",
      "body": "Okay cool so it looks like it's working a little bit there actually considering it.",
      "score": 1,
      "created_utc": 1747318619.0,
      "replies": []
    },
    {
      "id": "msgfv1u",
      "author": "metalsatch",
      "body": "The tariffs are still cheaper than paying American wages.",
      "score": 1,
      "created_utc": 1747320053.0,
      "replies": []
    },
    {
      "id": "msjinzl",
      "author": "FondleMiGrundle",
      "body": "Now PS5 will come with oily potato chip finger prints straight from the box!",
      "score": 1,
      "created_utc": 1747353871.0,
      "replies": []
    },
    {
      "id": "msrm8rs",
      "author": "PrimeWolf88",
      "body": "They announced a price hike for the entire world though, not just the US. Sony is clearly priced gouging here and they're likely doing it solely because the switch 2 is about to launch at a high price. This is nothing to do with tariffs and all about price gouging - And Sony deserves the negative press for this obvious greed.",
      "score": 1,
      "created_utc": 1747472961.0,
      "replies": []
    },
    {
      "id": "mt0suou",
      "author": "Festering-Fecal",
      "body": "Hahaha absolutely no way anyone here makes them as cheap as we're they are made now.\n\n\nThat's what these idiots don't get you can move manufacturing here that's not the problem it's finding workers for as cheap as they do it overseas.\n\n\nBonus round is since we are disappearing immigrants there's not even illegal labor to do this.\n\n\n200iq maga well played.",
      "score": 1,
      "created_utc": 1747604430.0,
      "replies": []
    },
    {
      "id": "ms9dm72",
      "author": "tge90",
      "body": "Oh sure…the tariffs…🙄 but bring manufacturing to the US would be awesome!  PS6 the stamp, made in America would be cool lol",
      "score": 2,
      "created_utc": 1747226270.0,
      "replies": []
    },
    {
      "id": "ms97kkz",
      "author": "Jonathank92",
      "body": "Outside of food, most purchases are discretionary/optional. These companies will find this out ",
      "score": 1,
      "created_utc": 1747223912.0,
      "replies": []
    },
    {
      "id": "msa50pa",
      "author": "None",
      "body": "I just sold my PS5 yesterday, there’s nothing of interest coming to the platform, I was waiting for GTA 6 but who knows if it will ever get released. Besides I’m tired of paying $80 a year to play online. It used to be free to play online now they have gotten down right greedy.",
      "score": 1,
      "created_utc": 1747235077.0,
      "replies": []
    },
    {
      "id": "msarq7f",
      "author": "ptraugot",
      "body": "Moving production to the US for a Japanese company is a non starter. Costs would be comparably insane.",
      "score": 1,
      "created_utc": 1747241609.0,
      "replies": []
    },
    {
      "id": "msb6mt8",
      "author": "cabalavatar",
      "body": "Do not give in to Chump's extortion, Sony. If you give a belligerent bully an inch, they will take a mile. Nothing will appease them; just ask Neville Chamberlain.",
      "score": 1,
      "created_utc": 1747245793.0,
      "replies": []
    },
    {
      "id": "ms9e201",
      "author": "Trust-Me-Im-A-Potato",
      "body": "Again, they could maaaaybe build a factory to assemble PS5s in the US sometime in the next 4 years, but the core components can't be made here anytime in the next 2 decades so it's a moot point",
      "score": 1,
      "created_utc": 1747226434.0,
      "replies": [
        {
          "id": "ms9lloa",
          "author": "None",
          "body": "[removed]",
          "score": 0,
          "created_utc": 1747229085.0,
          "replies": [
            {
              "id": "ms9mv01",
              "author": "Ahindre",
              "body": "I think it's conceivable that some part of the manufacturing process could happen in the USA, like the final assembly.  Inputs like chips/screws are never going to all be made by any company in-house.",
              "score": 2,
              "created_utc": 1747229509.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "msbys1v",
      "author": "ZaMelonZonFire",
      "body": "PS6 will now cost 1499.  Great.",
      "score": 1,
      "created_utc": 1747254008.0,
      "replies": []
    },
    {
      "id": "msczfj5",
      "author": "goldaxis",
      "body": "Don't fall for the tariff ruse. Multi-billion dollar international corporations are using it as an excuse to gouge you. The prices won't come back down, and quarterly reports will reveal the tariffs never warranted a price increase in the first place.",
      "score": 1,
      "created_utc": 1747265844.0,
      "replies": []
    },
    {
      "id": "msi40j3",
      "author": "anon-stocks",
      "body": "They're not open to moving manufacturing to the US.  They just say that to appease the dictator.",
      "score": 1,
      "created_utc": 1747337666.0,
      "replies": []
    },
    {
      "id": "ms9h14f",
      "author": "Dhiox",
      "body": "They are 100% lying. The tariffs make moving manufacturing to the US impossible. Importing alerts is too expensive, and then exporting the finished goods is too expensive. The tariffs make importing and exporting expensive, so the easier thing to do is just cut America out of the process altogether.",
      "score": 0,
      "created_utc": 1747227501.0,
      "replies": []
    },
    {
      "id": "ms9lga0",
      "author": "WordNERD37",
      "body": "Anything to get these headlines out there. No substance in the article but anything to curry favor with the fascists.",
      "score": -2,
      "created_utc": 1747229035.0,
      "replies": []
    },
    {
      "id": "ms9dgof",
      "author": "FdPros",
      "body": "i hope people here understand that by the time they set up manufacturing in the US, the ps7 would be out.",
      "score": -1,
      "created_utc": 1747226214.0,
      "replies": []
    },
    {
      "id": "ms9vnnv",
      "author": "DaxSpa7",
      "body": "Nobody believed that.",
      "score": -1,
      "created_utc": 1747232306.0,
      "replies": []
    },
    {
      "id": "msbalyn",
      "author": "Killance1",
      "body": "Didn't the tariffs end because people stood up to him and he backed down? Sony was already increasing prices before the tariffs were even a thing.",
      "score": -1,
      "created_utc": 1747246942.0,
      "replies": [
        {
          "id": "msbtrew",
          "author": "flirtmcdudes",
          "body": "There is still a 10% across the board tariff, along with about 30% on China. So prices are gonna go up",
          "score": 0,
          "created_utc": 1747252540.0,
          "replies": [
            {
              "id": "msbuftj",
              "author": "Killance1",
              "body": "Doesn't change that Sony was already increasing prices before the tariffs were event a thing. Their PSN increase was a nail in the coffin for a lot of folk, myself included.\n\nPC gaming was increasing immensely after covid and was still rising. For those components, tariffs were an excuse to make them even more expensive.\n\nA lot of these companies were looking for a scapegoat to raise prices and now they have one.",
              "score": 0,
              "created_utc": 1747252733.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ms97mb4",
      "author": "IveKnownItAll",
      "body": "Sony made $7.7b in profit in 2024..yeah it's your tarrifs that are the problem here.\n\nI thought we hated billionaires and big business.",
      "score": -5,
      "created_utc": 1747223931.0,
      "replies": []
    }
  ]
}