{
  "post": {
    "title": "Nvidia RTX 50 series supply woes extend to system builders as scalpers drive up prices",
    "author": "chrisdh79",
    "id": "1jcqvbh",
    "score": 1310,
    "created_utc": 1742146536.0,
    "selftext": "",
    "num_comments": 265,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jcqvbh/nvidia_rtx_50_series_supply_woes_extend_to_system/"
  },
  "comments": [
    {
      "id": "mi4crau",
      "author": "bmack083",
      "body": "I feel like it’s been a decade of RTX supply “problems”",
      "score": 787,
      "created_utc": 1742146744.0,
      "replies": [
        {
          "id": "mi4gkun",
          "author": "HiddenoO",
          "body": "The \"problem\" is that crypto mining and now AI data centres are more profitable, so Nvidia has no reason to saturate the market when they can inflate prices instead.",
          "score": 338,
          "created_utc": 1742147846.0,
          "replies": [
            {
              "id": "mi4qe2t",
              "author": "baobabKoodaa",
              "body": "Inflate prices of what? Of the 4 units of GPUs that hit Finland's biggest store this week? Wow, good job, must have made a lot of money on those 4 units.",
              "score": 160,
              "created_utc": 1742150731.0,
              "replies": [
                {
                  "id": "mi4tvlr",
                  "author": "HiddenoO",
                  "body": "All their GPUs for the past five years or so. They could've probably sold twice as many, but if it's at a 20% lower price, that might halve their profit margin, so they would've ended up with the same consumer GPU profit but fewer wafers allocated to data centres where they have even larger profit margins.\n\nPretty much the only reason they're releasing consumer GPUs at the moment at all is to stay relevant in the consumer GPU market. If it were purely about immediate profits, they'd either dedicate all their wafers to data centres or only sell consumer GPUs at even higher prices to match data centre margins.",
                  "score": 101,
                  "created_utc": 1742151763.0,
                  "replies": [
                    {
                      "id": "mi6z9re",
                      "author": "Vokasak",
                      "body": ">They could've probably sold twice as many\n\nThey've already sold all the ones they make. How could they have sold twice as many as they made?",
                      "score": -4,
                      "created_utc": 1742176946.0,
                      "replies": [
                        {
                          "id": "mi74ju9",
                          "author": "RadicalMeowslim",
                          "body": "They're saying that they could produce hypothetically twice as many and still sell them all.",
                          "score": 24,
                          "created_utc": 1742178956.0,
                          "replies": [
                            {
                              "id": "mi7tufz",
                              "author": "tommyk1210",
                              "body": "Then why don’t they?",
                              "score": -17,
                              "created_utc": 1742190873.0,
                              "replies": [
                                {
                                  "id": "mi7xrab",
                                  "author": "RadicalMeowslim",
                                  "body": "Because it all comes from the same silicon. Making more cheaper consumer GPUs means they can't make as many expensive enterprise GPUs. So they make fewer consumer GPUs, charge a higher price for those since demand will be higher and people will still pay. They can then make more enterprise GPUs, generating much more profit.",
                                  "score": 23,
                                  "created_utc": 1742193253.0,
                                  "replies": []
                                },
                                {
                                  "id": "mi7wixt",
                                  "author": "MrKillerToad",
                                  "body": "Are yall purposely not reading?",
                                  "score": 21,
                                  "created_utc": 1742192488.0,
                                  "replies": [
                                    {
                                      "id": "mieaab2",
                                      "author": "prudentWindBag",
                                      "body": "I'm certain that they've read it. It's the understanding that's missing. Lord help us all...",
                                      "score": 2,
                                      "created_utc": 1742279345.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mi749n1",
                          "author": "HiddenoO",
                          "body": "I never wrote they could've sold twice as many as they made. They could've sold twice as many as they sold by simply producing more consumer GPUs instead of using those same wafers for data centre compute units.",
                          "score": 5,
                          "created_utc": 1742178845.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mi4ud46",
                      "author": "baobabKoodaa",
                      "body": "3090s and 4090s were available on store shelves for a long period of time. The situation today with 5090s is completely different and NVIDIA is not doing that voluntarily. I'm sure they would prefer to sell more than 4 GPUs per week, but for whatever reason, supply is constrained right now.",
                      "score": -34,
                      "created_utc": 1742151907.0,
                      "replies": [
                        {
                          "id": "mi4wfex",
                          "author": "HiddenoO",
                          "body": "Are you living in a different reality? 3090s and 4090s also had massive shortages on launch, and 4090s were practically never available at MSRP throughout their whole life cycle.\n\nThe reason it's worse now is that AI hype has completely taken off between the 4090 launch and now the 5090 launch. Have you even looked at Nvidia's revenue statistics?\n\nIn million US dollars (https://www.statista.com/statistics/988034/nvidia-revenue-by-segment):\n\n* 2024: 13,517 graphics, 47,405 compute & networking\n* 2022: 15,868 graphics, 11,046 compute & networking\n* 2020: 7,639 graphics, 3,279 compute & networking\n\nThe supply isn't \"constrained\" any more than it was previously, you can clearly see where it's going, and it's not GPUs.",
                          "score": 60,
                          "created_utc": 1742152527.0,
                          "replies": [
                            {
                              "id": "mi6aane",
                              "author": "sigmoid10",
                              "body": "The entire 30 series was hit on both fronts because of covid: Tons of supply chain issues and drastically increased demand. The 4090 was actually pretty easy to get for the most part of its life-cycle and only had issues at the beginning (when things were still recovering from covid) and at the end (when production was ramped down to make room for the 50 series and it became clear that the next gen would cost a lot more but only deliver very little extra performance once you disregard DLSS 4).",
                              "score": -2,
                              "created_utc": 1742168068.0,
                              "replies": [
                                {
                                  "id": "mi6e9af",
                                  "author": "HiddenoO",
                                  "body": "The 4090 wasn't \"pretty easy\" to get at the beginning (where we are in 50 series right now), and, at least here, you could practically never get it at MSRP.\n\nAlso, the 30 series was also largely affected by crypto buying up all consumer cards.",
                                  "score": 8,
                                  "created_utc": 1742169422.0,
                                  "replies": [
                                    {
                                      "id": "mi84ixg",
                                      "author": "sigmoid10",
                                      "body": ">The 4090 wasn't \"pretty easy\" to get at the beginning\n\nLiterally what was said above. But you could get one at MSRP just a few months after release and it remained available at that price until the 50 series dawned on the horizon. Mining on the 3090 was never cost effective, that only affected some particular models that happened to have a good performance/price/energy usage ratio. And even that was made less attractive with Nvidia's hardware locks for mining.",
                                      "score": -4,
                                      "created_utc": 1742197622.0,
                                      "replies": [
                                        {
                                          "id": "miaxf1k",
                                          "author": "HiddenoO",
                                          "body": "Once again, where I live that wasn't the case (regarding 4090 @ MSRP), and my market is very similar to the one of the person I was responding to.\n\nAs for the 3090, it doesn't matter whether the 3090 itself was bought for crypto when consumers were pushed into buying it because other cards were unavailable because of crypto. In either case, you get a much higher demand than without the crypto bubble.\n\nObviously, this only holds true to an extent. For example, the 4080 was so expensive and low-value that it didn't sell out even when the rest of the market was sold out.",
                                          "score": 1,
                                          "created_utc": 1742236500.0,
                                          "replies": [
                                            {
                                              "id": "mjnj7lz",
                                              "author": "sigmoid10",
                                              "body": "MSI 4090 was around MSRP for most of its life until a few months before the 50 series announcement. [See here for example.](https://camelcamelcamel.com/product/B0BG94PS2F) Same for most other manufacturers. You'll see a similar graph for the 3090 but with a high start in early 2022 due to the remaining supply chain issues. But they sorted this out quickly and the price came down very fast afterwards.",
                                              "score": 0,
                                              "created_utc": 1742910470.0,
                                              "replies": [
                                                {
                                                  "id": "mjqce44",
                                                  "author": "HiddenoO",
                                                  "body": "First off, the initial comment was about shortly after release (for comparison against the 5090 now). Your chart literally only starts months after release.\n\nSecondly, the guy was talking about a European market, and I specifically mentioned that I'm talking about a similar (European) market, and you think linking a site tracking US prices makes any sort of sense? Can you at least read before responding?",
                                                  "score": 0,
                                                  "created_utc": 1742939695.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mi7qa14",
                                  "author": "xsilas43",
                                  "body": "The 4090 was never readily available here in Canada, definitely not anywhere close to msrp.",
                                  "score": 3,
                                  "created_utc": 1742188839.0,
                                  "replies": [
                                    {
                                      "id": "mieapek",
                                      "author": "prudentWindBag",
                                      "body": "Not once.",
                                      "score": 1,
                                      "created_utc": 1742279607.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mi537u6",
                              "author": "baobabKoodaa",
                              "body": "You're arguing that we're getting 4 GPUs per week because that maximizes Nvidia's revenue? Even if you want to assume that Nvidia is creating artificial scarcity to boost revenue, surely you would agree that the optimal point is higher than 4 GPUs per week?",
                              "score": -13,
                              "created_utc": 1742154555.0,
                              "replies": [
                                {
                                  "id": "mi572xr",
                                  "author": "Maragii",
                                  "body": "Optimal would be 0 consumer gpus, any consumer gpus is taking away limited wafer capacity from data center gpus which sell for way higher margins. When data center gpus stop selling, they'll get repurposed to consumer gpus and supply will increase. What we're getting are essentially the leftovers",
                                  "score": 26,
                                  "created_utc": 1742155706.0,
                                  "replies": []
                                },
                                {
                                  "id": "mi57dpl",
                                  "author": "HiddenoO",
                                  "body": ">You're arguing that we're getting 4 GPUs per week because that maximizes Nvidia's revenue?\n\nYes, if they get higher profit margins for the same wafers by selling data centre cards, that's how it works.\n\n>Even if you want to assume that Nvidia is creating artificial scarcity to boost revenue, surely you would agree that the optimal point is higher than 4 GPUs per week?\n\nYour \"4 cards\" figure is obviously made up, but leaving that aside, no, it doesn't have to be.\n\nOnce again, you're not taking into account that you're only looking at consumer GPUs. They cannot produce unlimited amounts of wafers at TSMC, so it makes sense for them as a for-profit company to prioritize assigning those wafers to data centres where they have larger profit margins.\n\nIf you were able to produce the best-tasting apples in the world, but only in limited quantities, would you prioritize selling them in supermarkets for $1 each, or would you prioritize selling them to luxury hotels for $5 each while also raising supermarket prices to $2 each because of limited supply?",
                                  "score": 11,
                                  "created_utc": 1742155794.0,
                                  "replies": []
                                },
                                {
                                  "id": "miebo3k",
                                  "author": "prudentWindBag",
                                  "body": "For the last time. Nvidia is not selling GPUs in good faith. This is clearly a strategic play to push demand to new heights. We're being toyed with to accept a new pricing tier!\n\nEdit: The comment I replied to is either deleted or I have been blocked. Lol.",
                                  "score": -1,
                                  "created_utc": 1742280212.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mi6j3fm",
                  "author": "seamus_quigley",
                  "body": "The problem is every gaming GPU produced is money left on the table. \n\nThey have a limited wafer allocation from TSMC. Each wafer costs them a certain amount of money. Whether they use the wafer to produce gaming graphic cards or to produce the professional cards that cost $10k plus, their costs are more or less the same.\n\nIt's honestly surprising they bother to produce any gaming GPUs.",
                  "score": 19,
                  "created_utc": 1742171088.0,
                  "replies": [
                    {
                      "id": "mi6yru5",
                      "author": "CheesyRamen66",
                      "body": "Remaining the consumer name brand not only helps make them the default for future enterprise procurement but more importantly makes sure developers are starting out with CUDA.",
                      "score": 7,
                      "created_utc": 1742176757.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mi5kmzv",
                  "author": "None",
                  "body": "The more you buy, the more you save! Finland's store manager, probably",
                  "score": 4,
                  "created_utc": 1742159788.0,
                  "replies": [
                    {
                      "id": "miats2n",
                      "author": "ValuableFace1420",
                      "body": "Yes, we indeed have only the one! They manage all five of our stores; the pharmacy, the grocery, the ikea, the H&M and the car store",
                      "score": 1,
                      "created_utc": 1742235458.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mi6xjg4",
                  "author": "CheesyRamen66",
                  "body": "If you can raise your profit margin from $50 to $200 then you only need to sell 1/4 as many units to achieve the same profits. By reducing supply like that you’re almost guaranteeing prices will go up a lot. TSMC can only allocate so many wafers to Nvidia so even if they make a little less from GeForce they can take all those saved wafers and make way more money from datacenter. Customers accept this is the new normal and whenever datacenter demands dip they can always turn around and flood the consumer market for a few months without dropping prices below their old margins.",
                  "score": 2,
                  "created_utc": 1742176295.0,
                  "replies": []
                },
                {
                  "id": "mi9ipbx",
                  "author": "NsRhea",
                  "body": "They don't give a fuck about 4 gpu's because before they hit the streets they've sold 20,000 to Microsoft, 30,000 to tesla, 40,000 to Facebook, etc etc etc",
                  "score": 1,
                  "created_utc": 1742221691.0,
                  "replies": [
                    {
                      "id": "mi9zjq7",
                      "author": "baobabKoodaa",
                      "body": "My point is that they wouldn't artificially constrict the supply to 4 GPUs just to inflate the prices of those 4 GPUs. Because 4 GPUs is a really small amount of GPUs. The fact that we don't see more GPUs indicates that there are some real supply constraints, as opposed to artificial constraints.",
                      "score": 1,
                      "created_utc": 1742226788.0,
                      "replies": [
                        {
                          "id": "mia19su",
                          "author": "NsRhea",
                          "body": "I would assume they've run the numbers and look at average buys for areas.\n\nThen they throw them in the trash and sell 200,000 units to companies first before spreading around the stock they do have.\n\n4 units is a shortage in your area it would appear, so it's working as intended for them.",
                          "score": 0,
                          "created_utc": 1742227284.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mi6gsdl",
                  "author": "j0s3f",
                  "body": "The chips are all in expensive AI cards.",
                  "score": 0,
                  "created_utc": 1742170296.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mi5l38v",
              "author": "sargonas",
              "body": "It’s not about inflating prices, it’s about not even manufacturing the cards.\n\nWhy would they manufacture 50 series cards for consumers to pay a few hundred bucks to $1000 for, when they can use the same limited supply of silicon to manufacturer multi thousand dollar car that they can sell 10 times more of that volume to AI corporations?\n\nThere is a finite amount of silicon that can be made within a certain time frame, and every chip they slap onto a card for dedicated AI use has 10 times the market value of a consumer gaming card. Gaming market segments is now an annoying baggage piece for Nvidia they have to maintain, and a fractional percentage of their overall market dominance these days.  Making these chips is an inconvenience and they’re only doing the bare minimum necessary.",
              "score": 23,
              "created_utc": 1742159928.0,
              "replies": [
                {
                  "id": "mi5pr32",
                  "author": "HiddenoO",
                  "body": "It's about both. If they didn't give a shit about the consumer GPU market at all, they wouldn't be releasing any more cards. The way they're acting now, they can simultaneously stay relevant on the consumer GPU market and normalize inflated consumer GPU prices for when/if the AI bubble bursts while also raking in the big data centre money right now.",
                  "score": 6,
                  "created_utc": 1742161361.0,
                  "replies": [
                    {
                      "id": "mi6ngxb",
                      "author": "firedrakes",
                      "body": "no its not. am sorry but gamers wont fund the cost to research and dev the hardware anymore . with the real price of the card.\n\nlook how console starting at 360 era and pc following suite a year or two later.\n\nwhere stuff has to be uspcale due to hardware is under power.\n\nbut but pc game.... is still under power. ask yourself why  we need fake frames,fake rez,fake rt/pt etc.\n\nconsumer will not pay the real cost of the hardware needed for it.",
                      "score": -4,
                      "created_utc": 1742172608.0,
                      "replies": [
                        {
                          "id": "mi75do1",
                          "author": "HiddenoO",
                          "body": ">but but pc game.... is still under power. ask yourself why we need fake frames,fake rez,fake rt/pt etc.\n\nWe don't *need* any of that. Developers make use of it because it exists.\n\nThe new Monster Hunter, one of the most popular games relying on those techniques, looks worse at lower FPS on the same hardware as previous titles.\n\n>the real price of the card  \n\\[...\\]  \nconsumer will not pay the real cost of the hardware needed for it\n\nImagine typing that after Nvidia had a gross profit of $44bil on a $60bil revenue last year.",
                          "score": 5,
                          "created_utc": 1742179285.0,
                          "replies": [
                            {
                              "id": "mi77wi2",
                              "author": "firedrakes",
                              "body": "Did not bother to check which sector make the profit. \nServer/ hpc/ networking. \nNice bs try thru.\n\nMy og point stands.  So much legacy  support and half ass standards. \nWe gotten to the point now. Industry is regression backwards.\nuser block me. common gamer bro dumb",
                              "score": -1,
                              "created_utc": 1742180288.0,
                              "replies": [
                                {
                                  "id": "mi78eim",
                                  "author": "HiddenoO",
                                  "body": ">Did not bother to check which sector mafe the profit. Server/ hpc/ networking. Nice bs try thru.\n\nI never claimed it was consumer GPUs. The point is that they're having insane profit margins on server compute, so those are clearly not \"real prices\", whatever that's even supposed to mean.\n\n>My og point stands. So much legacy support and half ass standards. We gotten to the point now. Industry is regression backwards\n\nThat's not a point, that's just rambling about things that have little to do with the topic.",
                                  "score": 3,
                                  "created_utc": 1742180493.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mi605b6",
                  "author": "midnitefox",
                  "body": "~~So then they need to invest in expanding manufacturing to meet demand.~~\n\nWelp nevermind. Learned a lot tonight.",
                  "score": -2,
                  "created_utc": 1742164677.0,
                  "replies": [
                    {
                      "id": "mi6gqmk",
                      "author": "soulsoda",
                      "body": "Chip fabs do not scale up. The investment required is on the scale of 10s of billions, ~4 years before you even start making anything. Not to mention, these facilities are designed by/run by highly specialized professionals, you can't just grab these people off the street. There's a reason one company in the world dominates the world when it comes to chip fabrication.",
                      "score": 8,
                      "created_utc": 1742170279.0,
                      "replies": []
                    },
                    {
                      "id": "mi6i3no",
                      "author": "j0s3f",
                      "body": "They don't have the knowledge and skills to manufacture those chips.\nThat's why they pay TSMC to do it.\nBuilding a fab takes TSMC around a year in Taiwan and 2-4 years somewhere else. The costs are about $20 billion per fab.\n\nThat's not something where Nvidia can throw in a few millions and double their output.",
                      "score": 3,
                      "created_utc": 1742170749.0,
                      "replies": []
                    },
                    {
                      "id": "mi6n23z",
                      "author": "sargonas",
                      "body": "That's not the answer. The problem is there is a *finite* amount of chips that TSMC can make for them per year. They then divide those chips up into AI cards, other high-enterprise chips (like self-driving automation processors) and then gaming gpus. The first two can be sold for 10x the price per chip than the gaming gpus. There is simply no motivation for them to allocate more than they absolutely feel they must to gaming gpus, because they are literally losing money when they do so.",
                      "score": 2,
                      "created_utc": 1742172462.0,
                      "replies": []
                    },
                    {
                      "id": "mi6gm0z",
                      "author": "ArseBurner",
                      "body": "I was gonna say this is down to TSMC, then I remembered that Apple is actually investing in them which is why they have super preferred status.",
                      "score": -1,
                      "created_utc": 1742170233.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mi5ku37",
              "author": "Midnight_Oil_",
              "body": "Helps keep their stock price artificially high. Basically the only thing keeping it absurdly high until this AI bubble bursts and destroys the economy along with it.",
              "score": 5,
              "created_utc": 1742159849.0,
              "replies": [
                {
                  "id": "mi7s6oo",
                  "author": "EmmEnnEff",
                  "body": "They could shut down their entire gaming card division and their stock price wouldn't notice.\n\nThey make *way* more money per card they sell to Google than per card they sell to you.\n\nLiterally the only reason they still make gaming cards is so they can starve AMD.",
                  "score": 3,
                  "created_utc": 1742189912.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mi4zn7x",
              "author": "BarfHurricane",
              "body": "But all I hear from the supply and demand folks is that corporations will just build more and prices will go down! Just like with the housing market!",
              "score": 5,
              "created_utc": 1742153489.0,
              "replies": [
                {
                  "id": "mi5a4nj",
                  "author": "Hopnivarance",
                  "body": "They are building more, but it takes many billions of dollars and years to get new production on line for high end chips which gpu's are.",
                  "score": 5,
                  "created_utc": 1742156616.0,
                  "replies": []
                },
                {
                  "id": "mi5d3qf",
                  "author": "AuryGlenz",
                  "body": "In this case they’re almost a monopoly when it comes to chips used for AI, due to their efforts on the software side. They’d still love to make more but they can’t just flip a switch and have that happen.\n\nAs far as housing goes, do you think that’s somehow insulated from supply and demand?  Anyone mentioning this in regards to the US (as opposed to say, Canada) gets downvoted but the mass immigration we’ve had in our country means we simply couldn’t build houses fast enough.  If you’re only making enough homes 1 million new people per year but your population is growing at 1.5 million per year of course that’s going to put pressure on housing prices. \n\nAgain, you can’t exactly flip a switch and it’s the land that’s the more expensive part, not the actual homes - meaning there isn’t a huge economic incentive to get more people into home building.   However, there’s still some incentive and we’ve absolutely seen more housing units being made in recent years. \n\nI guarantee you if COVID 2027 comes around and it kills half the population home prices will indeed drop. \n\nProbably GPUs too, for that matter.",
                  "score": -1,
                  "created_utc": 1742157512.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mi7vw0j",
              "author": "Perfect_Cost_8847",
              "body": "I worry about what this means for chip designs. It’s clear they’re now optimising for AI workflows instead of graphics. Raster performance improvements are quite poor because they’re dedicating more and more die space to AI. They’re trying to make this useful for gaming with DLSS, but it really is a case of backfilling the value instead of being gaming led. We’d have much better GPUs right now if not for the AI craze. They’d also be much better value.",
              "score": 2,
              "created_utc": 1742192098.0,
              "replies": []
            },
            {
              "id": "mi5ubkp",
              "author": "dandroid126",
              "body": "I thought you couldn't mine crypto with GPUs anymore?",
              "score": 1,
              "created_utc": 1742162808.0,
              "replies": [
                {
                  "id": "mi68egt",
                  "author": "HiddenoO",
                  "body": "I have no idea about crypto right now. That's what started the GPU shortage alongside COVID, though. When crypto finally started dying down, the AI hype started.",
                  "score": 2,
                  "created_utc": 1742167422.0,
                  "replies": []
                },
                {
                  "id": "mi7i0fi",
                  "author": "mug3n",
                  "body": "Ever since ethereum went to proof of stake, it killed the mainstream way of crypto mining but it's still there on other alt coins.",
                  "score": 2,
                  "created_utc": 1742184634.0,
                  "replies": []
                },
                {
                  "id": "mi6fwy2",
                  "author": "soulsoda",
                  "body": "Absolutely still mine certain crypto with GPUs.",
                  "score": 2,
                  "created_utc": 1742169992.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mi5uuwt",
              "author": "Quigleythegreat",
              "body": "They need to start making GPUs with another supplier a process node larger than whatever the data center chips are using. Not enough fav capacity for everyone.",
              "score": 1,
              "created_utc": 1742162980.0,
              "replies": [
                {
                  "id": "mi68n2l",
                  "author": "HiddenoO",
                  "body": "They wouldn't be able to compete with AMD then. Looking at their generational improvements, you will see those primarily came from node shrinks. This generation, there was no node shrink and cards are getting practically the same performance per core as last gen.",
                  "score": 2,
                  "created_utc": 1742167505.0,
                  "replies": []
                },
                {
                  "id": "mi6kfe9",
                  "author": "ArseBurner",
                  "body": "That's what Nvidia tried to do with 30 series. Geforce cards were fabbed on Samsung so they could focus all of their TSMC allocation on A100. Sadly Samsung screwed up their 5 and 4nm nodes (something about executives faking yields and the money meant for improving those yields mysteriously disappearing) so 40 series had to return to TSMC.",
                  "score": 2,
                  "created_utc": 1742171545.0,
                  "replies": []
                },
                {
                  "id": "mi7fm6n",
                  "author": "PoisonMikey",
                  "body": "Well Biden tried to do some sort of chip initiative in the states as a strategic investment to protect chip dependance for future global conflicts but who knows what the Rs are mucking about with it.",
                  "score": 1,
                  "created_utc": 1742183538.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mi5qc25",
          "author": "Drastic-Rap-Tactics",
          "body": "This is correct, all of this is artificial and intentionally created by Nvidia. The reasoning behind it is already stated here in comments though the simple answer is they have no reason to make any changes to production.",
          "score": 8,
          "created_utc": 1742161545.0,
          "replies": [
            {
              "id": "mi7se72",
              "author": "EmmEnnEff",
              "body": "There is nothing artificial about the world producing a limited amount of silicon that they can make cards from.\n\nThere is also nothing artificial about them making 5x more margins from making and selling a datacenter card, than from making and selling a consumer card.",
              "score": 2,
              "created_utc": 1742190030.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mi5dshi",
          "author": "DirtyDanChicago",
          "body": "Honestly I don't remember the 20 series having these woes, but I'm probably wrong. The 30 onwards for sure though.",
          "score": 7,
          "created_utc": 1742157716.0,
          "replies": [
            {
              "id": "mi6sojl",
              "author": "WeirdSysAdmin",
              "body": "I’m using a 2080 still.  There was no search for inventory when I bought it.",
              "score": 5,
              "created_utc": 1742174488.0,
              "replies": [
                {
                  "id": "mi6wghl",
                  "author": "DirtyDanChicago",
                  "body": "I have a 4080 super now, but my previous card was a 2070 super. I found one and bought it immediately with no issue. But with my 4080 super, I barely got it. I had to haul ass to my nearest micro-center when I heard they restocked. When I got there they had 3 left. I was with the other 2 people that bought theirs.",
                  "score": 1,
                  "created_utc": 1742175890.0,
                  "replies": [
                    {
                      "id": "mi8gedc",
                      "author": "None",
                      "body": "Replying 1 comment down because we share a name and a (your former) GPU.\n\n![gif](giphy|kGd4loNLGfJXqafsCF)",
                      "score": 2,
                      "created_utc": 1742205422.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mi8g2pe",
                  "author": "None",
                  "body": "I’m still on my 2070 Super, which runs like a champ/was $450 brand new.\n\nI feel like it all began with the release of the 2080ti, though.",
                  "score": 1,
                  "created_utc": 1742205224.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mi4fgn0",
          "author": "aroc91",
          "body": "Same shit happened when the 3 series came out. I haven't done any serious PC gaming since about 2013 for this very reason. Trying to get a worthwhile GPU upgrade for 4k has been absolutely exhausting.",
          "score": 25,
          "created_utc": 1742147522.0,
          "replies": [
            {
              "id": "mi4g7wa",
              "author": "ialsoagree",
              "body": "I got my 3080 thanks to EVGAs step up program. God I miss them making GPUs.",
              "score": 21,
              "created_utc": 1742147740.0,
              "replies": [
                {
                  "id": "mi4ji7r",
                  "author": "CosmicCreeperz",
                  "body": "I got mine from EVGA’s wait list.  It took a year, but in the end it was so much less aggravating than repeatedly losing to scalpers trying to get on off of an online site when they trickled in.\n\nYou can see why EVGA would want to get out of that business, though.  Nvidia must be a nightmare to deal with.",
                  "score": 14,
                  "created_utc": 1742148704.0,
                  "replies": []
                },
                {
                  "id": "mi4yft8",
                  "author": "RevolvinOcelot",
                  "body": "I got lucky and got a 3060ti from a guy who “upgraded” to a 3080 for like $200. It’s just now starting to feel rough on the newest titles but I’m going to ride it until the fans fall off. My EVGA 1070 is still kicking on my old PC too",
                  "score": 3,
                  "created_utc": 1742153129.0,
                  "replies": [
                    {
                      "id": "mi4z9ln",
                      "author": "Fredasa",
                      "body": "Sad part is that there's nothing spectacular about those newest titles compared to four years ago.  They're just that much less efficient.  Hell, the biggest game of the year, _Monster Hunter Wilds,_ has indefensible visuals—a mishmash of PS3 and PS4 if I'm being frank.",
                      "score": 6,
                      "created_utc": 1742153376.0,
                      "replies": [
                        {
                          "id": "mi7tbln",
                          "author": "ToMorrowsEnd",
                          "body": "dude there is nothing about those titles compared to 10 years ago.  not a single game today has any advances that are worth spending  thousands to upgrade hardware.",
                          "score": 2,
                          "created_utc": 1742190563.0,
                          "replies": [
                            {
                              "id": "mi8102h",
                              "author": "Fredasa",
                              "body": "And Nvidia knows this.  The exact reason why they artificially constrained VRAM—because it would end up becoming the reason people upgrade.  Not because they depended on improved performance but because they literally could not play the f'n games without more VRAM.",
                              "score": 2,
                              "created_utc": 1742195300.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mi9adhi",
                          "author": "RevolvinOcelot",
                          "body": "Person below also pointed out the VRAM problem and you’re absolutely right, Veilguard and MHW ran like dogwater because they immediately slam the VRAM when I open them. If I tinker and turn off all the weird nonsense settings, they’ll play fine without almost everything else at highest settings. I play Cyberpunk on the highest settings and it doesn’t even sneeze, which is wild to me considering how much more visually busy it is than either of those two titles. Newer games just feel wildly unoptimized and bloated with settings I never used in the first place.",
                          "score": 2,
                          "created_utc": 1742218981.0,
                          "replies": [
                            {
                              "id": "miauikd",
                              "author": "Fredasa",
                              "body": "On my 3080, Cyberpunk ran without issue on launch day.  When I returned to the game in 2024, the game had gotten an overhaul and it now demanded more VRAM than the 3080 could muster, even with every scrap of it devoted to the game.  I could play the game fine as long a I didn't open the main map, which is of course a bonkers thing to do without in that game.\n\nPlaying in 4K / DLSS Quality.",
                              "score": 1,
                              "created_utc": 1742235667.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mi6n0zh",
                          "author": "DynaSarkArches",
                          "body": "I also own a 3060ti and the biggest issue is actually vram in many titles that are optimized as well. 8gb is not a lot these days.",
                          "score": 1,
                          "created_utc": 1742172451.0,
                          "replies": [
                            {
                              "id": "mi78y71",
                              "author": "Fredasa",
                              "body": "Be afraid.  Nvidia wants to \"solve\" this issue by instigating the DLSS equivalent of textures, rather than putting a couple bucks more worth of VRAM on their $2000 GPUs.",
                              "score": 1,
                              "created_utc": 1742180716.0,
                              "replies": [
                                {
                                  "id": "mi7azu6",
                                  "author": "DynaSarkArches",
                                  "body": "Ez I don’t buy nvidia for my next gpu.",
                                  "score": 1,
                                  "created_utc": 1742181558.0,
                                  "replies": [
                                    {
                                      "id": "mi7cel6",
                                      "author": "Fredasa",
                                      "body": "As long as AMD continues to capitalize on Nvidia's fumbling, that should remain a viable option.",
                                      "score": 1,
                                      "created_utc": 1742182147.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mi80tfm",
                      "author": "jsamuraij",
                      "body": "1080ti gang represent.",
                      "score": 3,
                      "created_utc": 1742195179.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mi762d8",
                  "author": "NotAHost",
                  "body": "Damn I forgot they stopped. They were the best too.",
                  "score": 1,
                  "created_utc": 1742179557.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mi5ahfc",
              "author": "Hopnivarance",
              "body": "If you haven't done serious gaming since 2013, it's because you aren't a gamer.  It hasn't been that hard to find a gpu.",
              "score": 4,
              "created_utc": 1742156722.0,
              "replies": [
                {
                  "id": "mi5t4q4",
                  "author": "aroc91",
                  "body": "Why did you and the other guy ignore the PC part? I hopped back on the console train for a bit. I've been an equal opportunity gamer for the past 25 years. I don't need your approval, but thanks.",
                  "score": 7,
                  "created_utc": 1742162435.0,
                  "replies": [
                    {
                      "id": "mi7w075",
                      "author": "Perfect_Cost_8847",
                      "body": "Consoles have been great value for a while now. Prior to AI, one could build a competitive PC for the same price. Good luck with that today.",
                      "score": 3,
                      "created_utc": 1742192168.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mi4htjz",
              "author": "KnightFan2019",
              "body": "It hasn’t, quit saying this kind of bs. “I haven’t done any kind of serious gaming since 2013” because it’s been “absolutely exhausting” is such bs im sorry",
              "score": -7,
              "created_utc": 1742148206.0,
              "replies": [
                {
                  "id": "mi560p2",
                  "author": "UnknownCode",
                  "body": "Dunno why you're getting downvoted. You're right. You don't need an ultra high end card to game on PC and anyone who says otherwise is too afraid to lower a few settings and find good balance",
                  "score": 10,
                  "created_utc": 1742155391.0,
                  "replies": [
                    {
                      "id": "mi5xbyv",
                      "author": "KnightFan2019",
                      "body": "Exactly!",
                      "score": 2,
                      "created_utc": 1742163771.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mi547ce",
          "author": "evangelism2",
          "body": "There are supply problems across the globe and multiple industries for a decade+ now as everything from your high end gpu to your fuckin toaster wants some silicon in it. The US and the rest of the world are woefully behind Taiwan when it comes to the investment and spinning up of fabs needed to keep up with demand. Demand is far greater than production capacity at every cutting edge node currently. Add onto that the crypto booms and now AI bubble and you have even larger demands from groups willing to pay much more than your average gamer. Look at how much people around reddit were losing their minds over a 2k prosumer GPU, that honestly was quite a good deal if you looked at it beyond just gaming.",
          "score": 7,
          "created_utc": 1742154849.0,
          "replies": []
        },
        {
          "id": "mi4sk8e",
          "author": "Juuiken",
          "body": "Because they enjoy the problem.\nMade them into the Goliath they are today and the anti-consumer shit they pull a norm",
          "score": 1,
          "created_utc": 1742151372.0,
          "replies": []
        },
        {
          "id": "mi7077v",
          "author": "JoostinOnline",
          "body": "The 20 series and the 40 series were pretty easy to get at MSRP. The 4090 and 4080 were the only exceptions, because of the AI boom. I had to wait a year and a half to get an MSRP RTX 3070.",
          "score": 1,
          "created_utc": 1742177296.0,
          "replies": [
            {
              "id": "mi7n7fd",
              "author": "ArmedWithBars",
              "body": "3070 was really the canary in the coal mine for future gpu prices. People were buying them for 1k+ on ebay during the covid crypto boom. 2x retail for a 8gb mid tier card.\n\nTbh I don't blame the AIBs either. EVGA dipped cause margins on MSRP cards sucks. Its expensive to design and manufacture a full gpu and nvidia not only rakes them over the coal for the gpu, but sets the msrp pricing. With dumbasses throwing 2x retail for cards 3rd party I don't blame AIBs for trying to get a slice of that pie.",
              "score": 1,
              "created_utc": 1742187197.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mi74pmw",
          "author": "dweakz",
          "body": "and they still wont change because why would they? they do the bare minimum but people will still buy on first day release",
          "score": 1,
          "created_utc": 1742179019.0,
          "replies": []
        },
        {
          "id": "mi7rym6",
          "author": "EmmEnnEff",
          "body": "The consumer market is an afterthought for them, 99% of their revenue comes from selling to AI data centers.",
          "score": 1,
          "created_utc": 1742189784.0,
          "replies": []
        },
        {
          "id": "midw42s",
          "author": "timfountain4444",
          "body": "Agreed. Supply is limited to drive up prices. It’s a feature not a bug…",
          "score": 1,
          "created_utc": 1742271626.0,
          "replies": []
        },
        {
          "id": "mi55p28",
          "author": "Gravelayer",
          "body": "It's not a supply problem it's by design",
          "score": -2,
          "created_utc": 1742155294.0,
          "replies": [
            {
              "id": "mi5c2u6",
              "author": "bmack083",
              "body": "Hence the quotation marks.",
              "score": 1,
              "created_utc": 1742157202.0,
              "replies": []
            },
            {
              "id": "mi5aq1i",
              "author": "Hopnivarance",
              "body": "No, it's a supply problem.",
              "score": 2,
              "created_utc": 1742156795.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mi4fdo9",
          "author": "lostinspaz",
          "body": "playstation backorders, the next generation",
          "score": -4,
          "created_utc": 1742147498.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mi5lerq",
      "author": "CrazyBrosCael",
      "body": "Why is everything going to shit?",
      "score": 42,
      "created_utc": 1742160026.0,
      "replies": [
        {
          "id": "mi7me9m",
          "author": "hartzonfire",
          "body": "Money. We are reaching an inflection point for capitalism I believe.",
          "score": 23,
          "created_utc": 1742186786.0,
          "replies": []
        },
        {
          "id": "mia1ucw",
          "author": "Imperial_Bouncer",
          "body": "Gilded Age 2.0",
          "score": 3,
          "created_utc": 1742227451.0,
          "replies": []
        },
        {
          "id": "mi89fzq",
          "author": "GeT_Tilted",
          "body": "[Enshittification](https://en.wikipedia.org/wiki/Enshittification)",
          "score": 6,
          "created_utc": 1742200935.0,
          "replies": []
        },
        {
          "id": "mi87neu",
          "author": "sai-kiran",
          "body": "Dont know if this is extremely US specific or something but I got my 5070ti at MSRP and I do see a lot in stock too.",
          "score": 1,
          "created_utc": 1742199712.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mi4iit0",
      "author": "DefinitelyNWYT",
      "body": "Is this an artificial scarcity or a reflection of data center deployment? Like where is the production capacity for some of the world's largest companies? I just don't understand how the demand for GPUs remains \"unprecedented\" to either company at this point.",
      "score": 115,
      "created_utc": 1742148414.0,
      "replies": [
        {
          "id": "mi4izh5",
          "author": "salcedoge",
          "body": "The demand for data center chips are just way too high.\n\nThe demand for gaming/consumer GPUs are still the same as it ever was but Nvidia and even AMD are just allocating less and less resources for it",
          "score": 86,
          "created_utc": 1742148550.0,
          "replies": []
        },
        {
          "id": "mi4nbng",
          "author": "mystlurker",
          "body": "Its a supply side problem with TSMC having limited capacity and no other fabs able to get close in terms of performance.",
          "score": 43,
          "created_utc": 1742149833.0,
          "replies": [
            {
              "id": "mi4rom2",
              "author": "Noctew",
              "body": "Also, AFAIK TSMC refuse to build fabs for their most modern chips anywhere but in Taiwan, so countries dependant on these chips are motivated to defend them from mainland China.",
              "score": 51,
              "created_utc": 1742151112.0,
              "replies": [
                {
                  "id": "mi4sg24",
                  "author": "Fugalism",
                  "body": "Haven't they begun building factories in the EU and US since then? Obviously will be years before those become active but they will eventually produce abroad too.",
                  "score": 13,
                  "created_utc": 1742151339.0,
                  "replies": [
                    {
                      "id": "mi4t761",
                      "author": "drmirage809",
                      "body": "And they won't get the most high tech processes. They'll be keeping those in Taiwan as a safety measure. \"Defend Taiwan, or nobody gets the most advanced chips that you all need.\"\n\nI'd say it's a pretty good self defense mechanism.",
                      "score": 47,
                      "created_utc": 1742151560.0,
                      "replies": [
                        {
                          "id": "mi4tpss",
                          "author": "NorysStorys",
                          "body": "It’s still not a great security assurance because although TSMC are the bleeding edge on making these things, it’s entirely subject to the EU (Dutch and Germans specifically) who make the EUV machines that make it all possible.",
                          "score": 11,
                          "created_utc": 1742151715.0,
                          "replies": [
                            {
                              "id": "mi594b6",
                              "author": "shmed",
                              "body": "The whole supply chain for advanced microchip is so brittle. We're one natural disaster away from incapacitating our ability to produce chips.",
                              "score": 25,
                              "created_utc": 1742156313.0,
                              "replies": [
                                {
                                  "id": "mi5f1t1",
                                  "author": "NorysStorys",
                                  "body": "not exactly, Chips a few processes behind are made in a great many places, its just the absolute cutting edge thats in Taiwan. Samsung, Intel, Global Foundries, all make near bleeding edge stuff that goes into a great many things.",
                                  "score": 18,
                                  "created_utc": 1742158094.0,
                                  "replies": [
                                    {
                                      "id": "mi5fnfe",
                                      "author": "shmed",
                                      "body": "Sure but as you mentioned, most of them depends on lithograph made by ASML in the Netherland. They also mostly depends on waffer fabricator and design software made in California. The chemical needed are mostly produced in Tokyo. If any of those critical points in the production chain are hit, it will have major repercussions on the world production capabilities.",
                                      "score": 18,
                                      "created_utc": 1742158273.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "mi6jh6e",
                                  "author": "VampireFrown",
                                  "body": "Nah. Older chips are comparatively easy to make.\n\nWorst comes to the worst, we dust off the tech from 10 years ago and get moving. There are way more fabs around the world churning out those chips for lower-end applications (and even older processes).\n\nAnd tech 10 years ago was plenty powerful already to do essentially anything we'd reasonably do today.",
                                  "score": 2,
                                  "created_utc": 1742171218.0,
                                  "replies": []
                                },
                                {
                                  "id": "mi5rwz5",
                                  "author": "whk1992",
                                  "body": "Or one more Donald Trump.",
                                  "score": -1,
                                  "created_utc": 1742162051.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mi7wm65",
                              "author": "Perfect_Cost_8847",
                              "body": "ASML cutting off TSMC is mutually assured destruction. In reality, both companies need to be protected. The user above is correct.",
                              "score": 1,
                              "created_utc": 1742192543.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mi4tym4",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1742151788.0,
                      "replies": [
                        {
                          "id": "mi5dyjz",
                          "author": "AuryGlenz",
                          "body": "Yeah it is. The first one going up in Arizona is supposed to be a 4nm process node, which is what the 5000 series uses. The others are supposed to be 3 and 2nm. \n\nHowever, it’s literally against Taiwanese law to make the most advanced chips elsewhere. By the time any of those go up they’ll be making better stuff in Taiwan.",
                          "score": 2,
                          "created_utc": 1742157767.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mi52sur",
                  "author": "Tobix55",
                  "body": "Hopefully China takes back Taiwan so that bullshit can stop and they can build a bunch of factories in the mainland",
                  "score": -27,
                  "created_utc": 1742154430.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mi5g1vc",
          "author": "BuckNZahn",
          "body": "The reason is that everyone thinks that everything needs AI right now. Every other company wants to be the next AI first company. \n\nThat requires a lot of compute.",
          "score": 8,
          "created_utc": 1742158392.0,
          "replies": []
        },
        {
          "id": "mi7wfow",
          "author": "Perfect_Cost_8847",
          "body": "Singapore accounts for 18% of all Nvidia revenue. They are funnelling cards to China, which is seeking to aggressively expand their AI capabilities. The is a common story for the rest of the world, too, with a lot of investment in that sector. That’s why so much capacity is aimed at AI. Recent reports indicate that investment is slowing down, however, at least in the West. It’s not easy to retool, though, so it will take many months before we see improved consumer supply.",
          "score": 2,
          "created_utc": 1742192431.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mi4jx5v",
      "author": "PatSajaksDick",
      "body": "Even my 4070 I bought in 2023 is worth more than I bought it wow",
      "score": 56,
      "created_utc": 1742148827.0,
      "replies": [
        {
          "id": "mi4p7u3",
          "author": "locofspades",
          "body": "My 4090 i bought around summer of 23 is going for almost 3x what i paid lol bonkers",
          "score": 36,
          "created_utc": 1742150384.0,
          "replies": [
            {
              "id": "mi4qbde",
              "author": "Dirty_Dragons",
              "body": "This would be a great time to change hobbies and make some profit.",
              "score": 14,
              "created_utc": 1742150709.0,
              "replies": [
                {
                  "id": "mi4w5l4",
                  "author": "locofspades",
                  "body": "My 4090 still works great though and im enjoying it everyday.  More like great time to hold onto it and make it count.  Money comes and goes, but a 4090 for $1600 is a deal of the decade at this point.",
                  "score": 17,
                  "created_utc": 1742152446.0,
                  "replies": [
                    {
                      "id": "mi4y30t",
                      "author": "Dirty_Dragons",
                      "body": "Oh I'm sure. I was just thinking that you were to get out of gaming you could make a lot of money selling it. As you said it's worth 3x now",
                      "score": 7,
                      "created_utc": 1742153023.0,
                      "replies": [
                        {
                          "id": "mi5ppfl",
                          "author": "locofspades",
                          "body": "I wont be \"getting out of gaming\" until im put in a box ha ha its in my blood",
                          "score": 11,
                          "created_utc": 1742161347.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mi9xdp8",
                      "author": "crazysoup23",
                      "body": "I think the 4090 has the staying power of a 1080ti.",
                      "score": 1,
                      "created_utc": 1742226156.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mi5sw4v",
              "author": "RubberedDucky",
              "body": "No it’s not. Sort by “sold” listings on eBay, not what’s listed.",
              "score": 2,
              "created_utc": 1742162359.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mi6i2ik",
          "author": "QueenBae2",
          "body": "I'm trying to buy a 5070 now and my friends are all just like \"buy a 4070 and save some money\". In most cases they're used and cost more than a 5070. More than happy just to keep waiting, but with more tariffs I think I missed the boat for 4+ years.",
          "score": 3,
          "created_utc": 1742170739.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mi4fab4",
      "author": "Pure-Wing6824",
      "body": "Scalpers are the scum of the earth",
      "score": 120,
      "created_utc": 1742147471.0,
      "replies": [
        {
          "id": "mi4fuwz",
          "author": "dubbzy104",
          "body": "The people supporting scalpers also have a part",
          "score": 57,
          "created_utc": 1742147637.0,
          "replies": [
            {
              "id": "mi6335x",
              "author": "Woyaboy",
              "body": "This. I couldn’t find a PS5 to save my life a few years back and was more than happy to wait till supply caught up. People and their clout and FOMO are ruining every last piece of purchasing power we as the consumer once had.",
              "score": 16,
              "created_utc": 1742165639.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mi4s5dr",
          "author": "0r0B0t0",
          "body": "Paper launching a product doesn't help. Nobody scalps apple products anymore because there is enough supply.",
          "score": 58,
          "created_utc": 1742151251.0,
          "replies": [
            {
              "id": "mi5fg41",
              "author": "UniQue1992",
              "body": "This",
              "score": 1,
              "created_utc": 1742158212.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mi59h07",
          "author": "shmed",
          "body": "It's not just the scalpers cashing in. Every gamer out there are selling their used GPUs for ridiculous price too. Can't even find a used 4070 for less than $1000 where I am",
          "score": 13,
          "created_utc": 1742156418.0,
          "replies": [
            {
              "id": "mi6awoc",
              "author": "VagueSomething",
              "body": "Most people don't want to sell for less than market value, especially when they need to sell it to make up for the cost of their next GPU being more than last time.",
              "score": 12,
              "created_utc": 1742168280.0,
              "replies": [
                {
                  "id": "mihoby9",
                  "author": "RadiantTurtle",
                  "body": "Almost sounds like the housing market, doesn't it? Why would I sell my house at $250,000 less than the market price? Buyers keep these prices high, not sellers. ",
                  "score": 2,
                  "created_utc": 1742326115.0,
                  "replies": [
                    {
                      "id": "miht78u",
                      "author": "VagueSomething",
                      "body": "If sellers have control of supply and won't drop, eventually buyers will buy unless enough alternative supply can meet demand. Housing bubble is artificially forced to stay high just like GPUs.",
                      "score": 1,
                      "created_utc": 1742327488.0,
                      "replies": [
                        {
                          "id": "mihtg23",
                          "author": "RadiantTurtle",
                          "body": "No one is forcing buyers to buy. If no one bought, I can guarantee you prices would drop overnight. ",
                          "score": 0,
                          "created_utc": 1742327558.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mi7du2x",
          "author": "DoubleJumps",
          "body": "I don't have any hobby that doesn't have scalpers harming it in one way or the other.\n\nIf people enjoy it, scalpers will try to exploit it, and honestly I feel like we are way past the point where these people should have been treated with outright hostility to scare them away.",
          "score": 4,
          "created_utc": 1742182760.0,
          "replies": [
            {
              "id": "mi805sl",
              "author": "TheOtherGuy89",
              "body": "You should hate the popl buying from them just as much if not more.\nNo one would scalp if you wouldnt make profit from it",
              "score": 0,
              "created_utc": 1742194756.0,
              "replies": [
                {
                  "id": "mi81bn5",
                  "author": "DoubleJumps",
                  "body": "I am disappointed in those people, but in a lot of these cases scalpers are effectively becoming the only way to find a lot of things, and some of the things that are being scalped are essentials for certain hobbies. So it's either quit the hobby or pay the fucking asshole.\n\nI've seen scalpers hoard hobby tools and end up worsening shortages for stretches longer than a year.",
                  "score": 2,
                  "created_utc": 1742195508.0,
                  "replies": [
                    {
                      "id": "mi85vz7",
                      "author": "TheOtherGuy89",
                      "body": "Then let them sit on it for a year.\nIf you allow people to make 50%+ profit in a few days, as it was and is the case for GPUs, then you cant really blame the scalpers.\nIf there are 1 or 2 making such profit, because there are 1 or 2 people where the old GPU brakes, then bist would stop it fast.",
                      "score": 0,
                      "created_utc": 1742198529.0,
                      "replies": [
                        {
                          "id": "mia59ck",
                          "author": "DoubleJumps",
                          "body": "I don't know how to further explain that scalpers scooping up supply for essential items for certain hobbies isn't something you can just wait a year for without just completely halting that hobby. \n\nI don't know why you don't want me to primarily blame the scalpers, but I'm clearly not going to get you to understand why this is a problem if you don't want to",
                          "score": 2,
                          "created_utc": 1742228445.0,
                          "replies": [
                            {
                              "id": "miedelu",
                              "author": "TheOtherGuy89",
                              "body": "I totally get why thats a problem. \nBut the solution requires time.\nYou cant stop scalping as long as people buy from them. \nSo you need to sit it out as they are sitting on their overpriced items which they cant sell.\nA Scalper will stop scalping soon when there is no profit to be made. \n\nYes this might lead to you pausing your Hobby, but nothing else will bring a solution. \nWhat do you think you can do about it?",
                              "score": 0,
                              "created_utc": 1742281323.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mi5gbvu",
          "author": "danielbauer1375",
          "body": "Companies could easily combat this, but they’ve decided to not care. They’re seemingly already at maximum production capacity and their products going for crazy amounts on the secondary market makes them look better, I guess.",
          "score": 6,
          "created_utc": 1742158476.0,
          "replies": []
        },
        {
          "id": "mi66kng",
          "author": "ImFriendsWithThatGuy",
          "body": "Although this is true, every company selling GPUs is complicit in allowing it without providing scalper prevention measures of any sort.",
          "score": 2,
          "created_utc": 1742166805.0,
          "replies": [
            {
              "id": "mi802vp",
              "author": "TheOtherGuy89",
              "body": "There is none.\nHere were stores, where you could only go and personally buy a card.\nA few hours after you could see a suspicious amount of cards on eBay from this area.\n\nOnly thing which can stop scalping is when the f*ing buyers stop buying from them at high prices.\nYou loose guarantees and if anything happens with the card you have to try to get the scalper contact the Shop. I would pay 75% of a new card Max.",
              "score": 1,
              "created_utc": 1742194704.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mi6oig9",
          "author": "cutelyaware",
          "body": "Woes? I wish I had Nvidia's woes.",
          "score": 2,
          "created_utc": 1742172980.0,
          "replies": []
        },
        {
          "id": "mi6znf2",
          "author": "dasoxarechamps2005",
          "body": "They literally add no value to society",
          "score": 3,
          "created_utc": 1742177090.0,
          "replies": [
            {
              "id": "mi7dozj",
              "author": "ChiefStrongbones",
              "body": "Scalpers add liquidity to illiquid markets.  That's the value they add.  They accept some risk that their product will go unsold (like concert tickets) or drop in value.  In return scalpers maintain a market where anyone can buy a scarce product at the current fair market price.\n\nIf we should blame anyone, it's manufacturers for failing to set a more reasonable MSRP before selling their products at a low fixed price on a first-come first-serve basis.",
              "score": -5,
              "created_utc": 1742182699.0,
              "replies": [
                {
                  "id": "miauj7i",
                  "author": "BurritoSupreeeme",
                  "body": "It's so funny that you are getting downvoted. The problem is the ratio of supply and demand, nothing more, nothing less. If scalpers just ceased to exist, you still wouldn't get your dream card at your dream price, because they would still just sell out instantly.",
                  "score": 3,
                  "created_utc": 1742235672.0,
                  "replies": []
                },
                {
                  "id": "mi7s71o",
                  "author": "kafkaesqe",
                  "body": "Free markets are unpopular on reddit",
                  "score": 3,
                  "created_utc": 1742189918.0,
                  "replies": [
                    {
                      "id": "mi7tl2m",
                      "author": "Pure-Wing6824",
                      "body": "Being an ass hole and ruining things for others because you are a greedy pos is unpopular on earth",
                      "score": 6,
                      "created_utc": 1742190718.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "miho32m",
          "author": "RadiantTurtle",
          "body": "Scalpers wouldn't exist if people didn't buy from them. Do you blame the gun or the person shooting it? The scalper (gun) is just doing what it's wired to do, but with no buyer (finger on the trigger) its worthless. It's the nasty truth about this; scalpers are just another vendor at this point, one that many people are happily willing to support.",
          "score": 1,
          "created_utc": 1742326045.0,
          "replies": []
        },
        {
          "id": "mi4qkuv",
          "author": "baobabKoodaa",
          "body": "somebody wants a new rig",
          "score": -29,
          "created_utc": 1742150787.0,
          "replies": [
            {
              "id": "mi5ba7i",
              "author": "Pure-Wing6824",
              "body": "Somebody is a scalper",
              "score": 8,
              "created_utc": 1742156965.0,
              "replies": []
            },
            {
              "id": "mi4vrbv",
              "author": "MakeThanosGreatAgain",
              "body": "Even if he didn't they're scum",
              "score": 5,
              "created_utc": 1742152327.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mi6dssw",
      "author": "Kitakitakita",
      "body": "I've never seen online stores as unsupportive as computer stores though. They'll toss everything online at the same time, don't care if someone buys a dozen, don't care if multiple accounts have the same address, don't care about reservations, don't care about waiting lines, don't care if an item is in your cart at checkout, don't care if you even manage to buy it but they respond with a cancellation, it goes on and on.\n\nAnd now BestBuy is doing this thing where they always have the item in stock. You enter a wait list, you give them your phone number, you enter another wait list, and then it tells you there aren't any shops nearby with it in stock.\n\nI'm trying to upgrade from a 1070. I waited this long. My only real hope now is for the Nvidia lottery to select me. Maybe they'll notice I've used a 1070 for nearly 8 years and take pity",
      "score": 12,
      "created_utc": 1742169265.0,
      "replies": [
        {
          "id": "mii3xqu",
          "author": "None",
          "body": "[removed]",
          "score": 1,
          "created_utc": 1742330526.0,
          "replies": [
            {
              "id": "mii6kvk",
              "author": "Kitakitakita",
              "body": "I'm in one, but they're still fairly overpriced. Right now it's mostly Amazon, Newegg and BestBuy notifications. Amazon pings whenever someone sells a single one so that never works, NewEgg has a crazy surcharge now thanks to tariffs, and Best Buy's API is broken to combat bot scalpers",
              "score": 2,
              "created_utc": 1742331277.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mi4orec",
      "author": "OneSwords",
      "body": "This shit is so aggravating and it doesn’t seem like it’s going to get any better. \n\nGenuinely contemplating spending the ~$400 to upgrade my ps5 to a pro and rocking with console gaming for a few years lmao.",
      "score": 28,
      "created_utc": 1742150249.0,
      "replies": [
        {
          "id": "mi4pzts",
          "author": "TrickOut",
          "body": "You know you could just go on Newegg right now and get a 4070 or 4080 at msrp that would run anything you want to play at 60 fps on pretty good settings (outside a few poorly optimized games from eastern studios but that has nothing to do with the hardware)",
          "score": -29,
          "created_utc": 1742150613.0,
          "replies": [
            {
              "id": "mi4vqxr",
              "author": "ShadowthecatXD",
              "body": "You must not have been on Newegg recently, literally no 40x0 series cards are in stock and if they are they're far  above MSRP. A 4070 is going for close to or over 1k right now. 4080s are even worse, all over 1.5k closer to 2k.",
              "score": 21,
              "created_utc": 1742152324.0,
              "replies": [
                {
                  "id": "mi500bd",
                  "author": "quirkelchomp",
                  "body": "Yep, and I don't even feel like paying MSRP is justified even if I could get it at that price. It's a last gen card, I should pay last gen prices, right?! This situation is so fucked.",
                  "score": 12,
                  "created_utc": 1742153599.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mi4z1sw",
              "author": "LilQueazy",
              "body": "There literally no rtx cards in stock unless it’s a 4060 8gb. If you’re gonna pay 1300 for a 4080 just pay 1400 for a 5080 and Atleast get gddr7",
              "score": 18,
              "created_utc": 1742153311.0,
              "replies": [
                {
                  "id": "mi5wt92",
                  "author": "TrickOut",
                  "body": "I am legit looking at it right now lol",
                  "score": -10,
                  "created_utc": 1742163604.0,
                  "replies": [
                    {
                      "id": "mi6pyr7",
                      "author": "jspeed04",
                      "body": "Not seeing any 4080’s, and 4080 Supers are listed in the [thousands of dollars](https://www.newegg.com/p/pl?d=rtx+4080) right now.\n\nThis shit is crazy.",
                      "score": 6,
                      "created_utc": 1742173500.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mi4r3m1",
              "author": "OneSwords",
              "body": "Only thing I see at “msrp” is a $1300 4080 super… and yeah, I ain’t buying that shit.",
              "score": 20,
              "created_utc": 1742150941.0,
              "replies": []
            },
            {
              "id": "mi4td9m",
              "author": "Boltrag",
              "body": "So, spend 4x more than a console?",
              "score": 11,
              "created_utc": 1742151611.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mi616yx",
      "author": "Vatican87",
      "body": "Just pray the AI market has a crash and fails miserably to get Nvidia back in line.",
      "score": 13,
      "created_utc": 1742165018.0,
      "replies": []
    },
    {
      "id": "mi8eqbu",
      "author": "Tazmya",
      "body": "It would be very easy to simply allow one purchase per person and ask and ID to confirm the person is real. Scalper problem would be easily solved.",
      "score": 7,
      "created_utc": 1742204390.0,
      "replies": [
        {
          "id": "mi8t2dp",
          "author": "KursedBeyond",
          "body": "I agree. These retailers are driving up the prices.",
          "score": 2,
          "created_utc": 1742212132.0,
          "replies": []
        },
        {
          "id": "mi8hu37",
          "author": "-Aeryn-",
          "body": "It wouldn't really, because for example some major retailers took 5000 orders on day 1 from real people and recieved only 20 cards per day since then. Some SKU's have not shipped even a single unit to major retailers since January.\n\nYou cannot split 500 cards between 5000 real people. The supply just does not exist.\n\nNobody wants to spend the fab time & wafers to produce these products in volume because they're making much more money for the same production resources with other products such as zen 5 and blackwell server GPU's. There isn't enough e.g. TSMC N4 to produce all of that stuff and have leftover capacity for less profitable products.",
          "score": 1,
          "created_utc": 1742206277.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mi4lsx2",
      "author": "ottoIovechild",
      "body": "Were you expecting humanity to work together?",
      "score": 14,
      "created_utc": 1742149385.0,
      "replies": [
        {
          "id": "mi4w0u6",
          "author": "MakeThanosGreatAgain",
          "body": "Not with that attitude",
          "score": 2,
          "created_utc": 1742152406.0,
          "replies": [
            {
              "id": "mi4w7et",
              "author": "ottoIovechild",
              "body": "We just couldn’t let a few dollars go",
              "score": 5,
              "created_utc": 1742152460.0,
              "replies": [
                {
                  "id": "mi4x1q2",
                  "author": "MakeThanosGreatAgain",
                  "body": "One jump ahead of the lawmen\nThat's all, and that's no joke\nThese guys don't appreciate I'm broke",
                  "score": 1,
                  "created_utc": 1742152712.0,
                  "replies": [
                    {
                      "id": "mi5z086",
                      "author": "stefanopolis",
                      "body": "I steal only what I can’t afford, and that’s GPUs",
                      "score": 2,
                      "created_utc": 1742164309.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mi4ncl2",
      "author": "zkyevolved",
      "body": "And this is why I don't have a new graphics card. Long live my 1070. I wanted the 4070 ti, but I couldn't get it for MSRP. Now I can't get the 5070 ti, so I guess I'm not getting a new graphics card this generation either.",
      "score": 15,
      "created_utc": 1742149841.0,
      "replies": [
        {
          "id": "mi51ik2",
          "author": "DeceptiveGold57",
          "body": "5070Ti gets slapped by the 9070XT anyways. You dodged a bullet there\n\nEdit: Nvidia shills be downvoting. Tech tubers prove you wrong.",
          "score": 0,
          "created_utc": 1742154043.0,
          "replies": [
            {
              "id": "mi52fy7",
              "author": "zkyevolved",
              "body": "I really did! I checked out the 9070XT as well, and I can't find it either for MSRP!",
              "score": 6,
              "created_utc": 1742154321.0,
              "replies": [
                {
                  "id": "mi53b6u",
                  "author": "DeceptiveGold57",
                  "body": "Their are a lot of higher end third party models going for the $800 range, which aren’t to bad either. \n\nJust keep an eye out for one of the frequent restocks",
                  "score": 4,
                  "created_utc": 1742154584.0,
                  "replies": [
                    {
                      "id": "mi8qvlc",
                      "author": "zkyevolved",
                      "body": "I'm not obsessed with getting a new card, and I'd like to get one, and the ONLY 9070 XT in stock is 1478€... [https://www.pccomponentes.com/tarjeta-grafica-asrock-steel-legend-amd-radeon-rx-9070-xt-16gb-gddr6-fsr-4](https://www.pccomponentes.com/tarjeta-grafica-asrock-steel-legend-amd-radeon-rx-9070-xt-16gb-gddr6-fsr-4) That's 3x higher than the MSRP. Insane.\n\nThe RTX 5070 ti is 1250€  That's a lot higher than MSRP. Insane.   [https://www.pccomponentes.com/search?query=5070%20ti&or-relevance&fm-6](https://www.pccomponentes.com/search?query=5070%20ti&or-relevance&fm-6)\n\nI don't know if you're in Europe or not, but if you find a link let me know!",
                      "score": 1,
                      "created_utc": 1742211111.0,
                      "replies": [
                        {
                          "id": "mi93wdn",
                          "author": "DeceptiveGold57",
                          "body": "Europe always gets shafted with their need to VAT tax everything. I do not have a solution for you on that unfortunately",
                          "score": 1,
                          "created_utc": 1742216641.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mi5m0jg",
              "author": "ChrisFhey",
              "body": "The 9070XT is within a couple FPS of the 5070Ti in most cases, and gets utterly destroyed once you turn on ray tracing. Doesn’t quite sound like getting slapped…",
              "score": -1,
              "created_utc": 1742160212.0,
              "replies": [
                {
                  "id": "mi6fz07",
                  "author": "DeceptiveGold57",
                  "body": "Within a few frames, while using 2/3rds the power, and costing $200-300 less. When 90% of the population only cares about raster, that is getting slappes",
                  "score": 0,
                  "created_utc": 1742170011.0,
                  "replies": [
                    {
                      "id": "mi6l0jk",
                      "author": "ChrisFhey",
                      "body": "Ah, so you’re comparing one card’s msrp to the other’s inflated price even though both can’t be had for their msrp? And simply lying about the efficiency. As shown in Gamers Nexus’ review the 5070 Ti beats the 9070 in efficiency in every game. \n\nAnd the only people who don’t care about RT are people whose card sucks at RT. But by all means, keep living in the past.\n\nYou can fanboy as much as you as you want, but the 9070 XT is on par with the 5070 Ti at best. In no circumstances is it “slapping” a 5070 Ti.",
                      "score": 2,
                      "created_utc": 1742171748.0,
                      "replies": [
                        {
                          "id": "mi76ys5",
                          "author": "DeceptiveGold57",
                          "body": "I am comparing MSRP to MSRP. Base model card MSRP is a $150-200 difference minimum. \n\nAnd uh, the statistics of RT don’t support your statement about popularity. Rasterization is always king. Stats don’t lie. Sorry!",
                          "score": 0,
                          "created_utc": 1742179915.0,
                          "replies": [
                            {
                              "id": "mi8auk0",
                              "author": "ChrisFhey",
                              "body": "No you weren't. MSRP difference is only $150. You were trying to make the 5070 Ti look worse than it does. And keep in mind that for non MSRP cards the price difference is even smaller. Around where I live, the price difference is closer to €50, making the 5070 Ti a no-brainer over the 9070 XT.\n\nThe statistics of RT don't matter. RT is the future of graphics. If it wasn't, AMD wouldn't be doing their utmost to improve RT performance every generation. You can keep lying to yourself, but anyone saying RT doesn't matter is stuck living in the past.",
                              "score": 1,
                              "created_utc": 1742201878.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mi5jiua",
              "author": "Sopel97",
              "body": "in some gaming workloads*",
              "score": 0,
              "created_utc": 1742159444.0,
              "replies": [
                {
                  "id": "mi6ehql",
                  "author": "DeceptiveGold57",
                  "body": "Same performance, for 2/3rds the power, and $200-$400 less. \n\nThat is getting slapped",
                  "score": 3,
                  "created_utc": 1742169502.0,
                  "replies": [
                    {
                      "id": "mi6h4i4",
                      "author": "Sopel97",
                      "body": "my ass can produce way better numbers than yours",
                      "score": 0,
                      "created_utc": 1742170412.0,
                      "replies": [
                        {
                          "id": "mi6i9ig",
                          "author": "DeceptiveGold57",
                          "body": "Well considering I’m not the one providing any numbers, would make sense that you provide 0 numbers",
                          "score": 0,
                          "created_utc": 1742170804.0,
                          "replies": [
                            {
                              "id": "mi6kn8x",
                              "author": "Sopel97",
                              "body": "you provided quite a few numbers, don't feel like talking to a bad troll, cya",
                              "score": 0,
                              "created_utc": 1742171619.0,
                              "replies": [
                                {
                                  "id": "mi774dh",
                                  "author": "DeceptiveGold57",
                                  "body": "Go complain to gamers nexus and hardware unboxed and the like. They provide the numbers. \n\nNot my fault you can’t read them. Only trolls can’t read",
                                  "score": 1,
                                  "created_utc": 1742179977.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mi6a1ag",
          "author": "darkmacgf",
          "body": "Any reason you didn't get a 4070ti Super? Those were pretty widely available when they launched.",
          "score": -1,
          "created_utc": 1742167979.0,
          "replies": [
            {
              "id": "mi8s93g",
              "author": "zkyevolved",
              "body": "It was not available readily nor was it available at MSRP. It's still over MSRP. Even the refurbs are over MSRP haha.",
              "score": 1,
              "created_utc": 1742211759.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mi88kr9",
      "author": "Oxissistic",
      "body": "Went team red for the first time in decades. Better supply build up, lower prices and a great card. If you’re not going suuuuuper high end give them a go. Also the software and undervolting has been a lot of fun.",
      "score": 4,
      "created_utc": 1742200343.0,
      "replies": []
    },
    {
      "id": "mi4tloo",
      "author": "gymbeaux5",
      "body": "The 5090 is a fire hazard anyway. As for the rest… it’s a bummer.",
      "score": 9,
      "created_utc": 1742151680.0,
      "replies": [
        {
          "id": "mi4ufc6",
          "author": "SpamingComet",
          "body": "Not if you plug it in correctly with the right cable",
          "score": -12,
          "created_utc": 1742151926.0,
          "replies": [
            {
              "id": "mi4wuwq",
              "author": "gymbeaux5",
              "body": "https://www.tomshardware.com/pc-components/gpus/nvidias-rtx-5090-power-cables-may-be-doomed-to-burn",
              "score": 8,
              "created_utc": 1742152655.0,
              "replies": [
                {
                  "id": "mi6boq5",
                  "author": "SpamingComet",
                  "body": "Right, and after the initial 3-4 posts on Reddit about it how has it gone? Same as the 40 series where people learned how to plug things in correctly and it no longer catches fire? That’s what I thought.",
                  "score": -4,
                  "created_utc": 1742168544.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mi5mhpg",
      "author": "Pankosmanko",
      "body": "Don’t buy from scalpers",
      "score": 2,
      "created_utc": 1742160358.0,
      "replies": []
    },
    {
      "id": "mi60k1d",
      "author": "Spastik2D",
      "body": "Scalping needs to be illegal",
      "score": 2,
      "created_utc": 1742164810.0,
      "replies": []
    },
    {
      "id": "mi7cs12",
      "author": "Fortune_Cat",
      "body": "Chuckles in not giving a shit about 5 seriez",
      "score": 2,
      "created_utc": 1742182306.0,
      "replies": []
    },
    {
      "id": "mi4s20p",
      "author": "UltraHotNeptune",
      "body": "I’m willing to bet the massive orders for tech companies like Dell, HP, IBM, etc aren’t held up by ‘supply woes’. I’m guessing these problems are only for plebians buying one or two cards max.",
      "score": 4,
      "created_utc": 1742151223.0,
      "replies": []
    },
    {
      "id": "mi4pg72",
      "author": "wolfiasty",
      "body": "It's a perfect situation for AMD, and the only thing they would have to do is to deliver something not that far away regarding graphics power and properly adjusted price, but bit lower. \"Simple\" as that.",
      "score": 2,
      "created_utc": 1742150451.0,
      "replies": []
    },
    {
      "id": "mi4pw81",
      "author": "cyrixlord",
      "body": "Also, why doesn't Nvidia stop beating around the bush and just put a damn C14 socket on the RTX 50 series GPUS? /s (sorta)",
      "score": 2,
      "created_utc": 1742150583.0,
      "replies": [
        {
          "id": "mi4tmc6",
          "author": "drmirage809",
          "body": "I've been joking since the 4090 released with its cable melting power draw that maybe one day we'll see GPUs with their own dedicated power supply. The kinda power that the top of end of Nvidia's GPU stack demands is utterly ridiculous. I already find the 300 or so watts that my 4080 asks for to be a lot.",
          "score": 4,
          "created_utc": 1742151686.0,
          "replies": [
            {
              "id": "mi6k4iz",
              "author": "VampireFrown",
              "body": "You already see this in server applications. PCIe has its own power supply if there are enough slots in play.",
              "score": 1,
              "created_utc": 1742171441.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mi4wb0w",
      "author": "astrofed",
      "body": "Had to upgrade my PC as my MB was not win 11 compliant, and was going to go with either 5070 ti or 9070 XT, as long as I could buy one that was not from a scalper.  So over the course of 2 weeks, since the 9070s were released, I was checking all the sites multiple times a day to fine any gpu that was available and not marked up ridiculously.  Finally found an ASUS 5070 ti prime OC at $900, so 150 over initial MSRP, but still better than 1200 from a scalper.",
      "score": 1,
      "created_utc": 1742152491.0,
      "replies": []
    },
    {
      "id": "mi56v0y",
      "author": "zbaruch20",
      "body": "Just built a new PC but kept my 1660 from my old PC mainly because of this. Might get a B580 soon since I don't game that much for a 40xx/50xx/90xx to be worth it for me",
      "score": 1,
      "created_utc": 1742155641.0,
      "replies": []
    },
    {
      "id": "mi6copw",
      "author": "pimp_bizkit",
      "body": "everything about this \"launch\" is a FAIL im not even interested in a 50xx anymore",
      "score": 1,
      "created_utc": 1742168883.0,
      "replies": []
    },
    {
      "id": "mi6v33l",
      "author": "YZYSZN1107",
      "body": "I feel like I've heard this story before 🤔",
      "score": 1,
      "created_utc": 1742175379.0,
      "replies": []
    },
    {
      "id": "mi7f51x",
      "author": "None",
      "body": "Just living the best timeline",
      "score": 1,
      "created_utc": 1742183326.0,
      "replies": []
    },
    {
      "id": "mi7habi",
      "author": "thedude213",
      "body": "aw shit here we go again",
      "score": 1,
      "created_utc": 1742184295.0,
      "replies": []
    },
    {
      "id": "mi7juku",
      "author": "h3rpad3rp",
      "body": "I have a backlog of like 300 games that my 30 series card will play just fine. I'm good Nvidia, you can keep your overpriced and under stocked cards.",
      "score": 1,
      "created_utc": 1742185520.0,
      "replies": []
    },
    {
      "id": "mi7n05w",
      "author": "iwonttolerateyou2",
      "body": "Scalpers working on behalf of manufacturers 😏",
      "score": 1,
      "created_utc": 1742187092.0,
      "replies": []
    },
    {
      "id": "mi7n8on",
      "author": "mayersdz",
      "body": "that's it, im changing my hobby!",
      "score": 1,
      "created_utc": 1742187215.0,
      "replies": []
    },
    {
      "id": "mi7swxa",
      "author": "ToMorrowsEnd",
      "body": "As long as people focus on the 50 series hard and the 40 series prices drop more on the used market.  let the suckers buy the 50 series",
      "score": 1,
      "created_utc": 1742190326.0,
      "replies": []
    },
    {
      "id": "mi8ju7w",
      "author": "DoomshrooM8",
      "body": "So same thing that happens every fucken time?!? What a shocker",
      "score": 1,
      "created_utc": 1742207437.0,
      "replies": []
    },
    {
      "id": "mi8txoy",
      "author": "Alex_Strgzr",
      "body": "Just buy something else.",
      "score": 1,
      "created_utc": 1742212522.0,
      "replies": []
    },
    {
      "id": "mi92i0s",
      "author": "Hottentott14",
      "body": "Scalping as a way to earn profit is such a low form of living.",
      "score": 1,
      "created_utc": 1742216107.0,
      "replies": []
    },
    {
      "id": "mi9lh0g",
      "author": "DavidinCT",
      "body": "It's why I won't buy one.... I run a RTX3070 and my next card will be a RTX4070 or 4080..\n\nOne gen behind does just as well, unless you have all the cash burning a hole in your pocket.",
      "score": 1,
      "created_utc": 1742222554.0,
      "replies": []
    },
    {
      "id": "midf1ku",
      "author": "prick-in-the-wall",
      "body": "Most of nvidias production is going toward Ai data enter shit. They dgaf about how many 50s they are putting out",
      "score": 1,
      "created_utc": 1742264693.0,
      "replies": []
    },
    {
      "id": "mie9z0b",
      "author": "prudentWindBag",
      "body": "Hmm, this is fun. It's great. It's not like I waited 1.5 years for this release... FML.",
      "score": 1,
      "created_utc": 1742279151.0,
      "replies": []
    },
    {
      "id": "mifxpg8",
      "author": "Select_Factor_5463",
      "body": "Why do people have to scalp and over charge?",
      "score": 1,
      "created_utc": 1742308319.0,
      "replies": []
    },
    {
      "id": "migeese",
      "author": "Kenzzarooo",
      "body": "Oh no! Anyway.....\n\n\nWait, is this seriously shocking or even news to anyone?",
      "score": 1,
      "created_utc": 1742313237.0,
      "replies": []
    },
    {
      "id": "miu9m72",
      "author": "Wonderful-Mousse-335",
      "body": "\"why do you hate AI so much?\"",
      "score": 1,
      "created_utc": 1742495921.0,
      "replies": []
    },
    {
      "id": "mi4svk6",
      "author": "its_a_metaphor_fool",
      "body": "Everyone selling their cards second-hand right now are scumbags, too. Charging above MSRP for cards that are a year or two old and making the problem even worse. Gamers are just truly some of the worst people.",
      "score": -2,
      "created_utc": 1742151465.0,
      "replies": [
        {
          "id": "mi5ebp5",
          "author": "AuryGlenz",
          "body": "Should they sell them for less than they’re effectively worth because of altruism?\n\nScalpers are assholes. People selling their used cards at market prices are not.",
          "score": 11,
          "created_utc": 1742157877.0,
          "replies": [
            {
              "id": "mi5q7g1",
              "author": "sat-soomer-dik",
              "body": "How are they different? Could argue scalpers are just selling at market prices. They'll also sell used cards if they get the chance.\n\nIf profiteers / scalpers are \"assholes\" then so are the 'gamers' becoming part-time scalpers. Not least knowing what they're selling may not have much life left in it. Some of them try and sell as 'refurbished' too 🤔😒🙄",
              "score": -2,
              "created_utc": 1742161503.0,
              "replies": [
                {
                  "id": "mi6shp6",
                  "author": "AuryGlenz",
                  "body": "Scalpers take a card from someone that could pay MSRP. People selling their old cards either need to sell below the new price, if available, or just at whatever price people will pay for them.  \n\nScalpers add no stock. People selling used cards effectively add to the stock, causing overall pricing to *lower*.",
                  "score": 5,
                  "created_utc": 1742174417.0,
                  "replies": []
                },
                {
                  "id": "mi6b6r6",
                  "author": "mywik",
                  "body": "Unless they are leaving the hobby they also pay inflated prices for their upgrades/replacements. \n\nThats the main difference between someone selling their used card and a scalper. \n\nPeople are angry at scalpers but they are doing nothing illegal. \n\nIn the end no one is going to sell you their card (scalped or used) at way under market value just because of some moral high ground.",
                  "score": 1,
                  "created_utc": 1742168375.0,
                  "replies": [
                    {
                      "id": "mi6fhsi",
                      "author": "sat-soomer-dik",
                      "body": "Indeed, though if they end up selling for the same or significantly more than they bought it, and it's used, that is also arguably scalping.\n\nPoint is you can use the arguments for both. Not sure making a point justifies downvotes but that's Reddit 🤷🏻‍♂️",
                      "score": 1,
                      "created_utc": 1742169846.0,
                      "replies": [
                        {
                          "id": "mi6hevv",
                          "author": "mywik",
                          "body": "I still think theres a difference between selling your used card at a high price cause of high demand to pay for an upgrade and buying an msrp priced new card only to directly hike up the price because theres not enough supply to make a quick buck.",
                          "score": 1,
                          "created_utc": 1742170513.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mi5trvv",
              "author": "its_a_metaphor_fool",
              "body": "What is market value for stuff that's never in stock for MSRP? It's a scalper's market.\n\n\nI don't think they should take a huge loss or anything, but most of these cards are going for more on eBay than they just replaced their cards for. I do think it's a dick move to buy a 9070 for $550 and then turn around and post your 4070 for like $700-$900, but I guess I'm not the one buying their cards",
              "score": -1,
              "created_utc": 1742162638.0,
              "replies": [
                {
                  "id": "mi6ioks",
                  "author": "AuryGlenz",
                  "body": "The market price is whatever they’re currently selling for. If you listed that card for $4,000 it wouldn’t sell. That’s how capitalism works.",
                  "score": 1,
                  "created_utc": 1742170945.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mi4y501",
          "author": "MagnaCamLaude",
          "body": "It's not exclusive to gamers, what a disrespectful and completely ignorant thing to say. \n\nThis is much more rampant in the sneaker industry. This is rampant in HOUUUUSSIIIIIINNNNGGGG.... MEEEDICIIIINE...!!!!\n\nAre you really more upset at the people scalping a piece of technology meant for entertainment, then you are for people who are f****** people over with prices for things people actually need. \n\nHonestly go crank one out and touch grass. Maybe you're head will just magically fall out of your ass is you go for a walk.",
          "score": -4,
          "created_utc": 1742153039.0,
          "replies": [
            {
              "id": "mi4yi7b",
              "author": "its_a_metaphor_fool",
              "body": "PC component scalpers make sneaker scalpers look like amateurs lol. Sorry if I called out one of your eBay listings bud. Or are you on Stockx?",
              "score": 6,
              "created_utc": 1742153149.0,
              "replies": []
            },
            {
              "id": "mi53udk",
              "author": "Symphonic7",
              "body": "This is bait right?",
              "score": 3,
              "created_utc": 1742154742.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mi4zu9g",
      "author": "qmacaulay",
      "body": "While AMD brings the prices down",
      "score": 1,
      "created_utc": 1742153548.0,
      "replies": []
    },
    {
      "id": "mi6p3h7",
      "author": "Didact67",
      "body": "Shit cards anyway.",
      "score": 1,
      "created_utc": 1742173189.0,
      "replies": []
    },
    {
      "id": "mi7xvi3",
      "author": "CriticalHitGaming",
      "body": "Stop living under the hype and underproduction of massive corporations. Artificial scarcity builds publicity which they use to drive their stock price. Either way the consumer always suffers.",
      "score": 1,
      "created_utc": 1742193327.0,
      "replies": []
    },
    {
      "id": "mi6fmkh",
      "author": "Sammoonryong",
      "body": "I got my 4090 for 800€ in december. I am gucci.\n\n(yes brandnew one with warranty)",
      "score": 0,
      "created_utc": 1742169892.0,
      "replies": []
    },
    {
      "id": "mi4loo9",
      "author": "ricktor67",
      "body": "Buy something else?  Be happy with your current card that still works perfectly well? Switch to a console for a fraction of the cost? Nope, keep spending a small fortune to be fucked by nvidia.\n\nEdit: I guess I hit a nerve with the Nvidia fanbois. Sure this has been EVERY card launch for almost a decade now and now top tier cards are pushing $3000! but sure, downvote me, that will fix it.",
      "score": -8,
      "created_utc": 1742149350.0,
      "replies": [
        {
          "id": "mi4mdho",
          "author": "abear247",
          "body": "Been holding onto a 1080 ti forever, going 9070xt this time because tired of nvidia BS",
          "score": 15,
          "created_utc": 1742149551.0,
          "replies": [
            {
              "id": "mi4oyts",
              "author": "jesbiil",
              "body": "Hah I thought the same with my 1080ti, heard the 9070xt, figured good upgrade for a while and so far only the expensive versions exist.  My buddy waited in line for 2 hours the first day to get one at $650.  Whelp guess I'll just buy his old card instead.",
              "score": 7,
              "created_utc": 1742150310.0,
              "replies": []
            },
            {
              "id": "mi539iz",
              "author": "Symphonic7",
              "body": "I hope one day I can have a card last that long, but with the way things are now I dont think any company would dare release something as GOATED as the 1080Ti. Shame really.",
              "score": 3,
              "created_utc": 1742154570.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mi4ibmx",
      "author": "Diconius",
      "body": "Oh noooooo! Won’t anyone think of the overpriced terribly made prebuilt scum resellers?!?! The horror! /s  \n   \nThey’re just as trash as scalpers.",
      "score": -11,
      "created_utc": 1742148355.0,
      "replies": [
        {
          "id": "mi4kbcy",
          "author": "lowercaset",
          "body": "Pc builders charge a markup but also have a value add. If you completely get rid of supply constraints, builders will still exist. The same is not true of scalpers.",
          "score": 10,
          "created_utc": 1742148944.0,
          "replies": []
        },
        {
          "id": "mi4juqi",
          "author": "TheCookiez",
          "body": "Integrators have their place in the market. Not everyone has the know how or want to have to build their own PC.\n\nSome times it's just easier to have done designed and tested for what you want than to spend countless hours trying to figure it out yourself.",
          "score": 7,
          "created_utc": 1742148806.0,
          "replies": []
        },
        {
          "id": "mi62g14",
          "author": "dandandanman737",
          "body": "PC builders have more risk and put more effort into their business than scalpers do. \n\n  \nSome people are willing to pay a little extra because they're too intimidated/busy/whatever to build a PC.\n\n  \nAre there terrible PC builders? Yes, every industry has bad apples. Are the majority of PC builders worse than scalpers? NO, they provide a service that people are willing to pay for.",
          "score": 1,
          "created_utc": 1742165429.0,
          "replies": []
        },
        {
          "id": "mi4lhek",
          "author": "2roK",
          "body": "Yeah fuck these people, the prices in the stores are just as bad as the scapler prices. 1000€ over MSRP",
          "score": -1,
          "created_utc": 1742149290.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mi5nmks",
      "author": "SuppleDude",
      "body": "Rubs his 4090 FE.",
      "score": -1,
      "created_utc": 1742160706.0,
      "replies": []
    }
  ]
}