{
  "post": {
    "title": "Nvidia confirms the Switch 2 supports DLSS, G-Sync, and ray-tracing | Nvidia says the Switch 2's GPU is 10 times faster than the original Switch.",
    "author": "chrisdh79",
    "id": "1jqu62q",
    "score": 3047,
    "created_utc": 1743714168.0,
    "selftext": "",
    "num_comments": 377,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jqu62q/nvidia_confirms_the_switch_2_supports_dlss_gsync/"
  },
  "comments": [
    {
      "id": "mla0sk8",
      "author": "BengalFan85",
      "body": "I know no one trusts nvidia rn but also keep in mind the OG switch was extremely underpowered even back in 2017 when it launched so this claim is probably legit just based on that.",
      "score": 193,
      "created_utc": 1743718607.0,
      "replies": [
        {
          "id": "mlc39ig",
          "author": "Ubermidget2",
          "body": "Yeah, if they cut a new Tegra SKU with a 10 year jump in GPU tech, this claim passes the sniff test",
          "score": 37,
          "created_utc": 1743749396.0,
          "replies": []
        },
        {
          "id": "mlixz41",
          "author": "ShadowFlux85",
          "body": "legit 10x the old switch isnt really saying much",
          "score": 10,
          "created_utc": 1743853112.0,
          "replies": []
        },
        {
          "id": "mlf06jy",
          "author": "Chrisnness",
          "body": "Switch wasn’t underpowered at all. Compare Switch 1 to iPhone 7",
          "score": -10,
          "created_utc": 1743791249.0,
          "replies": [
            {
              "id": "mlgx1pi",
              "author": "ElJanitorFrank",
              "body": "I think the fact that you're comparing something meant to replace a home console with a mobile phone is sort of proving the point.",
              "score": 13,
              "created_utc": 1743814485.0,
              "replies": [
                {
                  "id": "mlltc6z",
                  "author": "Chrisnness",
                  "body": "It’s a hybrid console that can be mobile. Was the Steam Deck underpowered when it launches?",
                  "score": 0,
                  "created_utc": 1743889985.0,
                  "replies": [
                    {
                      "id": "mlrurtn",
                      "author": "eskimospy212",
                      "body": "The switch even when docked was underpowered.\n\nThere’s no problem here - it’s a great console! It was not very powerful even by the standard of its time though. ",
                      "score": 1,
                      "created_utc": 1743979159.0,
                      "replies": [
                        {
                          "id": "mlrv0fr",
                          "author": "Chrisnness",
                          "body": "It was decent.",
                          "score": 1,
                          "created_utc": 1743979244.0,
                          "replies": [
                            {
                              "id": "mlrvh9l",
                              "author": "eskimospy212",
                              "body": "It was! It’s no slam on it - it’s a fantastic console. It just wasn’t super powerful. \n\nIf anything it’s a testament to how graphical power isn’t the be all. ",
                              "score": 1,
                              "created_utc": 1743979411.0,
                              "replies": [
                                {
                                  "id": "mlrvn2e",
                                  "author": "Chrisnness",
                                  "body": "It was more powerful than a 360. Great for a handheld that can dock",
                                  "score": 1,
                                  "created_utc": 1743979468.0,
                                  "replies": [
                                    {
                                      "id": "mlrvyu2",
                                      "author": "eskimospy212",
                                      "body": "Yes, it was more powerful than a console that came out 12 years prior.\n\nI’m not sure why this is a sticking point for you. It was not a very powerful console when released in terms of graphics. It was still a great console. ",
                                      "score": 1,
                                      "created_utc": 1743979583.0,
                                      "replies": [
                                        {
                                          "id": "mlrw2vo",
                                          "author": "Chrisnness",
                                          "body": "It was extremely powerful for a handheld",
                                          "score": 1,
                                          "created_utc": 1743979623.0,
                                          "replies": [
                                            {
                                              "id": "mm29s8d",
                                              "author": "ItemFast",
                                              "body": "I would argue against it - the components inside could have been more powerful. They were using 4 year old architecture in order to increase margins which was pretty underpowered compared to available hardware with better efficiency. They sold each console with a decent margin of 14%. The console and dock itself only cost them $167 to make. They could eaten up the 14% margin and ended up with a better processor which by far the worst aspect it had. They made a ton of money on games that they never drop in price. So yes there is a point of view to critic them but that is just the general opinion. 85billion was made on the switch including its games. 75 billion would also be nice and we would get a more future proof handheld console",
                                              "score": 1,
                                              "created_utc": 1744131473.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ml9nsns",
      "author": "King7up",
      "body": "With nvidias track record recently, I can’t trust this whatsoever.",
      "score": 1547,
      "created_utc": 1743714362.0,
      "replies": [
        {
          "id": "ml9pzo1",
          "author": "Blacklightrising",
          "body": "10x faster than original switch! \\* *Only applies in certain games where our new ultra-lite frame gen is used, ten hallucinated frames, for every one real frame. Available only for paying customers, monthly subscription required to use and update.* *Give us your money, you little money piggy.*",
          "score": 923,
          "created_utc": 1743715044.0,
          "replies": [
            {
              "id": "mla0jix",
              "author": "kurotech",
              "body": "Please stop giving them ideas for subscriptions if this does happen I'm gonna blame you 😭😭",
              "score": 149,
              "created_utc": 1743718520.0,
              "replies": [
                {
                  "id": "mlaeprk",
                  "author": "snil4",
                  "body": "The new RTX 5070 TI Super now with an ethernet port to download the missing ROPs",
                  "score": 66,
                  "created_utc": 1743723464.0,
                  "replies": [
                    {
                      "id": "mlb2eqm",
                      "author": "alwtictoc",
                      "body": "Gonne need a fiber connection for that.",
                      "score": 17,
                      "created_utc": 1743732297.0,
                      "replies": []
                    },
                    {
                      "id": "mlbu482",
                      "author": "Avengedx47",
                      "body": "FUCK IT, WE'LL JUST STREAM THE TEXTURES",
                      "score": 11,
                      "created_utc": 1743744513.0,
                      "replies": [
                        {
                          "id": "mlgwpp0",
                          "author": "mister2forme",
                          "body": "STREAM IT LIVE!",
                          "score": 3,
                          "created_utc": 1743814356.0,
                          "replies": [
                            {
                              "id": "mlhubf2",
                              "author": "Avengedx47",
                              "body": "You don't know how much I appreciate this reference.",
                              "score": 1,
                              "created_utc": 1743828982.0,
                              "replies": [
                                {
                                  "id": "mljazdd",
                                  "author": "mister2forme",
                                  "body": "Haha well I'm happy to bring a smile to an internet stranger.",
                                  "score": 2,
                                  "created_utc": 1743859078.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mlbudlq",
                  "author": "phoenixmatrix",
                  "body": "Drivers as micro transactions! Only 4.99 per update! Or you can buy the season pass!",
                  "score": 4,
                  "created_utc": 1743744656.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mlbmyzs",
              "author": "Schwertkeks",
              "body": "Switch 2 gpu is based on ampere architecture (rtx 3000 gen) and that doesn’t support frame gen. Switch 1 was based on maxwell (gtx900). Such a gain doesn’t sound that impossible, it just shows how fucking weak switch 1 was even on release day",
              "score": 42,
              "created_utc": 1743740946.0,
              "replies": [
                {
                  "id": "mlezsmp",
                  "author": "Chrisnness",
                  "body": "Maxwell wasn’t weak at all back then",
                  "score": 3,
                  "created_utc": 1743791131.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mlbbnaz",
              "author": "AtariAtari",
              "body": "If things like that start happening, I bet we’ll see more Luigis than Marios!\n\n![gif](giphy|XBoYoCVQNBpJe)",
              "score": 11,
              "created_utc": 1743735915.0,
              "replies": []
            },
            {
              "id": "mlc77q4",
              "author": "TornadoFS",
              "body": "Man, I get what you are saying, but frame gen does make games fluctuating around \\~50FPS run well at a cost of visual artifacts. I have been using frame gen in Monster Hunter Wilds (with AMD FSR because I have a 3080, which doesn't support DLSS frame gen).\n\nFor that game specifically it is worth the tradeoff and I imagine that a lot of games on the switch will turn it on and that is a good thing.\n\nBut yeah don't trust whatever nvidia is saying, frame gen is not magic and makes visuals worse. Ideally it should be used only 4k modes with the user having an option to turn on a 1080p performance mode that doesn't use it.",
              "score": 6,
              "created_utc": 1743751832.0,
              "replies": []
            },
            {
              "id": "mlb4wpv",
              "author": "Hypernatremia",
              "body": ">10 hallucinated frames\n\n\nLmaooo",
              "score": 3,
              "created_utc": 1743733250.0,
              "replies": []
            },
            {
              "id": "mlazv4c",
              "author": "benefit420",
              "body": "The more you buy…",
              "score": 2,
              "created_utc": 1743731354.0,
              "replies": []
            },
            {
              "id": "mlcxqtv",
              "author": "TreeBoyApparel",
              "body": "i mean, we all saw the frame drops during the presentation— right?",
              "score": 2,
              "created_utc": 1743767280.0,
              "replies": []
            },
            {
              "id": "mldgmsc",
              "author": "edvek",
              "body": "And the camera has to be still. All of the enhancements are lost when you touch any button.",
              "score": 2,
              "created_utc": 1743774463.0,
              "replies": []
            },
            {
              "id": "mlbd51p",
              "author": "DaSn3akerH0lic",
              "body": "😆😅🤣😂😆😅🤣😂",
              "score": 1,
              "created_utc": 1743736524.0,
              "replies": []
            },
            {
              "id": "mlc3xzo",
              "author": "ILikeCutePuppies",
              "body": "10 cent per a million frames generated... not bad except for those 80 hour a week players.",
              "score": 1,
              "created_utc": 1743749788.0,
              "replies": []
            },
            {
              "id": "mlau8zu",
              "author": "SquashSquigglyShrimp",
              "body": "Damn they're insulating us even in the fine print",
              "score": 0,
              "created_utc": 1743729225.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ml9opv0",
          "author": "Untitled_One-Un_One",
          "body": "If the leaks are true, then it isn’t capable of frame gen. So we can rule out some of nvidia’s more recent chart shenanigans. Still, plenty of other ways for them to massage the truth.",
          "score": 88,
          "created_utc": 1743714648.0,
          "replies": [
            {
              "id": "mla0sca",
              "author": "eestionreddit",
              "body": "It's completely possible that Ampere was able to do frame gen all along. But if it did support frame gen, NVIDIA would be talking about it.",
              "score": 24,
              "created_utc": 1743718605.0,
              "replies": [
                {
                  "id": "mla9p0d",
                  "author": "fvck_u_spez",
                  "body": "Technically it does support frame gen in that FSR 3 frame gen works on Ampere. Wouldn't be out of the norm for Nintendo to go that route, I believe that there were some games they shipped that used a modified version of FSR on the Switch.",
                  "score": 17,
                  "created_utc": 1743721699.0,
                  "replies": [
                    {
                      "id": "mlb30wn",
                      "author": "round-earth-theory",
                      "body": "Nintendo is very protective though. I don't think they'll turn on AI features because they can't control the results. They'd rather the low frame rate.",
                      "score": -9,
                      "created_utc": 1743732531.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mlc57zx",
                  "author": "ArdiMaster",
                  "body": "I seem to recall reports that yes, Ampere cards could technically run frame gen models, but not fast enough to be useful.",
                  "score": 2,
                  "created_utc": 1743750563.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ml9ugh1",
              "author": "FreddiePEEPEE",
              "body": "Well pretty much any device is capable of frame gen. They’d just slap FSR frame gen in there somehow.",
              "score": 15,
              "created_utc": 1743716490.0,
              "replies": [
                {
                  "id": "ml9uvzj",
                  "author": "Untitled_One-Un_One",
                  "body": "Fair point, I don’t think nvidia would be bragging about FSR support though.",
                  "score": 7,
                  "created_utc": 1743716628.0,
                  "replies": [
                    {
                      "id": "mla8dt1",
                      "author": "FreddiePEEPEE",
                      "body": "Of course not! But methinks that’s how they hit 120fps on some titles.",
                      "score": 4,
                      "created_utc": 1743721246.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ml9ptwy",
              "author": "King7up",
              "body": "Exactly. All I’m saying is I’ll for a more trusted resource then them.",
              "score": 18,
              "created_utc": 1743714994.0,
              "replies": []
            },
            {
              "id": "mlat4ul",
              "author": "stellvia2016",
              "body": "AFAIK they're comparing the docked performance of the Switch to the docked performance of the Switch2, possibly with DLSS enabled.\n\nThe docked Switch was around 384Gflops, and the new SoC in the Switch2 at full power is predicted to be a bit over 3Tflops aka 3000Gflops. So I could see DLSS bringing that up to a perf roughly equivalent to 3.8Tflops then.",
              "score": 9,
              "created_utc": 1743728802.0,
              "replies": []
            },
            {
              "id": "mlad6f4",
              "author": "PM_artsy_fartsy_nude",
              "body": "It doesn't seem like they would need to massage the truth. The Switch 1 came out in 2017, same time as the GTX 1080. Is the 5080 ten times faster than the 1080? That would be hard to measure fairly, but it seems likely that it is.\n\nMoor's Law says that the new chip should be forty times faster.",
              "score": 3,
              "created_utc": 1743722915.0,
              "replies": [
                {
                  "id": "mlafng1",
                  "author": "Untitled_One-Un_One",
                  "body": "Moore’s law hasn’t been a thing in ages. The 5080 doesn’t even deliver tens times the frames of a 1070. Either way neither the Switch or the Switch 2 are using GPU architectures from their launch year, so the comparison is entirely pointless.",
                  "score": 17,
                  "created_utc": 1743723800.0,
                  "replies": [
                    {
                      "id": "mlal4xz",
                      "author": "pinkynarftroz",
                      "body": "Moore’s law is about economy of transistor density, not performance. Looking at the graphs on Wikipedia, it still seems to be holding strong.",
                      "score": 9,
                      "created_utc": 1743725809.0,
                      "replies": [
                        {
                          "id": "mlc6gea",
                          "author": "Untitled_One-Un_One",
                          "body": "That chart is showing raw transistor counts, not density. Companies have been needing to make larger and larger chips in order to keep up with the consumer expectations built by Moore’s law.\n\nNvidia’s top of the line GPU in 2012 was a GTX 680. It sits at about 3.5 billion transistors. Moore’s law suggests the RTX 3090, their 2020 top end chip, should have 56 billion. It has just a little over half at 28.3 billion. To make matters worse the 3090 has over twice the total die area of the 680.",
                          "score": 6,
                          "created_utc": 1743751341.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mlanf43",
                      "author": "fullsaildan",
                      "body": "Judging performance by frames *alone* isn’t really meaningful. They architect the chips to handle complex tasks that may or may not increase frames on specific games, depending on what features they use. Not everything is just “render the same thing more quickly”. Nevermind that driver profiles likely need to be updated for a lot of games to fully utilize those features.",
                      "score": 6,
                      "created_utc": 1743726652.0,
                      "replies": [
                        {
                          "id": "mlc717n",
                          "author": "Untitled_One-Un_One",
                          "body": "I don’t see what you’re getting at here. Are you talking about certain render methods? The workloads were normalized for testing in order to get those numbers. It’s about as apples to apples of a comparison as you can get.",
                          "score": 3,
                          "created_utc": 1743751713.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mlagmkk",
                      "author": "PM_artsy_fartsy_nude",
                      "body": "> Either way neither the Switch or the Switch 2 are using GPU architectures from their launch year, so the comparison is entirely pointless.\n\nExplain your logic. Regardless of their specific launch years, they are eight years apart.",
                      "score": -2,
                      "created_utc": 1743724149.0,
                      "replies": [
                        {
                          "id": "mlah2py",
                          "author": "Untitled_One-Un_One",
                          "body": "The tech the Switch runs on was launched in 2015. The tech the Switch 2 runs on was launched in 2020.",
                          "score": 8,
                          "created_utc": 1743724311.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mlalsvy",
                  "author": "PM_ME_UR_GRITS",
                  "body": "The Switch 1 was old for its own time since it was Maxwell based, worse than a 950 going by raw specs. So 10x might be an easy feat.",
                  "score": 11,
                  "created_utc": 1743726054.0,
                  "replies": [
                    {
                      "id": "mlaubnu",
                      "author": "Triplescrew",
                      "body": "Considering I ran Witcher 3 on a 670mx better than a switch can I'd say it's far far worse than a 950",
                      "score": 8,
                      "created_utc": 1743729253.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mla9su0",
              "author": "Fredasa",
              "body": "DLSS below \"Quality\" is still on the table.  (Dynamic, probably, which is just straight up worse because it's like a new kind of compression that just gets muddier the more that's going on.)",
              "score": 2,
              "created_utc": 1743721735.0,
              "replies": [
                {
                  "id": "mlabzdh",
                  "author": "kurdiii",
                  "body": "the new transformer model looks great even under quality mode",
                  "score": 2,
                  "created_utc": 1743722492.0,
                  "replies": [
                    {
                      "id": "mlad4i1",
                      "author": "Fredasa",
                      "body": "I think users of a platform like Switch 2 will be far less aware / critical of the fact that almost all of the detail they're seeing is invented by an algorithm—and they'll also be less sensitive to the kind of artifacts you get from that kind of guessing game—so tech like DLSS definitely works in the favor of Nintendo/Playstation.",
                      "score": 5,
                      "created_utc": 1743722896.0,
                      "replies": [
                        {
                          "id": "mlb8iv0",
                          "author": "TrptJim",
                          "body": "Not just that, you can tailor your game to work extremely well at low input resolutions. Nintendo has a great track record for putting art design above graphics.\n\nMarvel Rivals is a good recent example. Details still look crisp on DLSS Ultra Performance with the Transformer model.",
                          "score": 1,
                          "created_utc": 1743734652.0,
                          "replies": [
                            {
                              "id": "mlc1zwh",
                              "author": "Fredasa",
                              "body": "Frankly put, people give Transformer a bit of a pass.\n\nYou _have_ to raise your eyebrow when you compare a natively rasterized 4K screenshot to a Transformer-upscaled one, and the latter has like 2x more detail.  Yes, 90% of folks will land in the \"I don't care\" bracket, which is the same as saying that 90% of folks don't care that James Cameron's 4K blurays are an abomination that essentially discards the original visuals for a hallucinated alternative—in any meaningful sense, that doesn't ding the overriding point that you're not getting the intended visuals, and if you could throw more GPU power at it, you would.\n\nBut it _is_ useful when you're selling the most casual platform that can still reasonably be labeled as a \"console\" rather than just a glorified smart device with some nice first party titles, which incidentally sums up how I feel about the Switch 1.\n\nAnd of course I actually reckon this is moot because I'm not expecting games on the platform to use Transformer preferentially.  Not for a portable screen at 120Hz.  Nintendo's userbase aren't going to be that demanding.",
                              "score": 1,
                              "created_utc": 1743748690.0,
                              "replies": [
                                {
                                  "id": "mlc463c",
                                  "author": "Techno-Diktator",
                                  "body": "Not much reason not to use transformer honestly",
                                  "score": 1,
                                  "created_utc": 1743749921.0,
                                  "replies": [
                                    {
                                      "id": "mlcdvml",
                                      "author": "Fredasa",
                                      "body": "It uses more GPU power, and while it's not like \"twice as much\", it's very non zero.  Developers making games that are going to be played on a portable 1080p screen are definitely going to ask why they need to lower their game's performance by ~15% for something that almost nobody in the platform's user base will understand is being utilized, and probably couldn't tell the difference between DLSS and native either way.",
                                      "score": 1,
                                      "created_utc": 1743756186.0,
                                      "replies": [
                                        {
                                          "id": "mlchwfv",
                                          "author": "Techno-Diktator",
                                          "body": "Yes, but balanced on transformer looks better than ultra quality on the normal one, so that do doesn't really matter",
                                          "score": 1,
                                          "created_utc": 1743758812.0,
                                          "replies": [
                                            {
                                              "id": "mlcjnmc",
                                              "author": "Fredasa",
                                              "body": "Since Nintendo is plainly positioning the Switch 2 as a first foray back into the core gaming market, studios/publishers developing for it also have to balance what gets revealed by review and analysis sites (Digital Foundry et al).  If a game spends the majority of its time upscaling from 1/4th the native resolution of 1080p, it doesn't much matter that you could say a screenshot of that looks \"good\"—it will have a blatantly obvious impact on the intent of the visuals, and DF and friends will hasten to point that out and, quite reasonably, underscore that it's a compromise and not ideal.",
                                              "score": 1,
                                              "created_utc": 1743759921.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mlc46g2",
                                  "author": "Techno-Diktator",
                                  "body": "Not much reason not to use transformer honestly",
                                  "score": 0,
                                  "created_utc": 1743749927.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mlc7g1e",
              "author": "TornadoFS",
              "body": "AMD FSR frame-gen runs on Ampere and Nintendo has used AMD FSR in Tears of the Kingdom even though they are an nVidia partner. So don't discount frame gen on the Switch just yet, it might just not be nVidia framegen.",
              "score": 1,
              "created_utc": 1743751981.0,
              "replies": []
            },
            {
              "id": "mlk6ntw",
              "author": "mule_roany_mare",
              "body": "It has a 120hz screen.\n\nNintendo are cheapskates & I suspect they wouldn't pay for the feature if it wasn't really possible to utilize. \n\nThen again 120hz eats battery so it's often not worth it. When docked & actively cooled 120 fps is a different story, but that won't use the onboard screen.",
              "score": 1,
              "created_utc": 1743870178.0,
              "replies": []
            },
            {
              "id": "mlaas0v",
              "author": "RailGun256",
              "body": "excuse me if i dont believe Ngreedia info given their recent track record. if we're lucky. it wont burn our houses down",
              "score": -3,
              "created_utc": 1743722072.0,
              "replies": [
                {
                  "id": "mlaebbi",
                  "author": "SpamingComet",
                  "body": "Name 1 house that burned down, I’ll wait",
                  "score": -3,
                  "created_utc": 1743723320.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ml9oa6q",
          "author": "mikeyd85",
          "body": "I mean, I have some old potatoes in my cupboard which have started sprouting and even they have 10x the GPU power of the OG Switch.",
          "score": 42,
          "created_utc": 1743714514.0,
          "replies": [
            {
              "id": "mlak9sn",
              "author": "None",
              "body": "[deleted]",
              "score": 3,
              "created_utc": 1743725486.0,
              "replies": [
                {
                  "id": "mlc4be0",
                  "author": "KalashnikittyApprove",
                  "body": "Upfront: I don't disagree, and with a stronger third party lineup on top of Nintendo's first party offering the Switch 2 will probably cover more people's overall console needs, which makes the price increase easier to stomach. \n\nBut, I think price/performance alone also misses the mark because I think what you're getting at is whether it's a good deal, which has to include the games. \n\nThe Ally is £250 more, but if you limit yourself to sales (assume £20 average) that gets you 12 games. Even at full price (often around £50 here in the UK) that's 5 games. On the Switch, you get 3.",
                  "score": 7,
                  "created_utc": 1743750011.0,
                  "replies": []
                },
                {
                  "id": "mlc49pt",
                  "author": "Techno-Diktator",
                  "body": "It was 250 dollars for basically a tablet back then, right now it's just dogwater.",
                  "score": 4,
                  "created_utc": 1743749983.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ml9wznq",
          "author": "StarsMine",
          "body": "The gpu is like 4x faster. So with dlss I guess that’s 10x",
          "score": 9,
          "created_utc": 1743717311.0,
          "replies": [
            {
              "id": "mlc7zje",
              "author": "weegee19",
              "body": "Is it not 10x faster docked? I mean 4x faster at handheld than the OG docked works out.",
              "score": 1,
              "created_utc": 1743752337.0,
              "replies": [
                {
                  "id": "mlcjna7",
                  "author": "Alfiewoodland",
                  "body": "There's a lot of uncertainty about this, but the extra cooling in the dock does imply they're pushing it quite hard... so maybe? 10x seems incredibly optimistic though. I assume the 10x figure is actually 4-5x + DLSS making it \"effectively\" 10x. Nvidia have been known to twist the truth like this.",
                  "score": 1,
                  "created_utc": 1743759916.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mla46nh",
          "author": "rowdymatt64",
          "body": "\"My switch 2 is missing ROPs 😢\"",
          "score": 11,
          "created_utc": 1743719799.0,
          "replies": []
        },
        {
          "id": "ml9sdmc",
          "author": "icebeancone",
          "body": "Not to mention the graphics shown in the Nintendo Direct certainly didn't look like it was 10x more powerful. 2.5x maybe then add whatever DLSS mental gymnastics on top.",
          "score": 8,
          "created_utc": 1743715812.0,
          "replies": [
            {
              "id": "ml9vgr4",
              "author": "DRazzyo",
              "body": "Considering that the GPU in a Switch is a Maxwell, which is an architecture from 2014, I don't actually doubt this claim.  \nWith DLSS, in any case.",
              "score": 37,
              "created_utc": 1743716816.0,
              "replies": [
                {
                  "id": "mlcfo0e",
                  "author": "None",
                  "body": "The GPU in Switch 2 ( if leaks are true ) is basically a HEAVILY cut down 3050 which is almost a 5 year old design. 12gb is nice but this is not even GDDR6 performance memory. It's attached to what is basically a small weak mobile phone CPU.\n\nNeither console has anything modern or powerful. This 10x claim i guarantee is being bottlenecked by memory or some other metric. Basically, Nvidia misleading claims as usual.",
                  "score": 6,
                  "created_utc": 1743757350.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ml9uw8w",
              "author": "Veranova",
              "body": "It can drive 4k instead of 1080p which requires roughly 4x the grunt, so 2.5x actually checks out",
              "score": 13,
              "created_utc": 1743716630.0,
              "replies": [
                {
                  "id": "ml9vt48",
                  "author": "DBeumont",
                  "body": "Only while docked, mind you.",
                  "score": -11,
                  "created_utc": 1743716925.0,
                  "replies": [
                    {
                      "id": "ml9yjay",
                      "author": "fafarex",
                      "body": ">Only while docked, mind you.\n\nSame has the OG one...\n\nno need to render beyond your screen in portable even before considering battery life.",
                      "score": 19,
                      "created_utc": 1743717830.0,
                      "replies": [
                        {
                          "id": "mla015m",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 0,
                          "created_utc": 1743718342.0,
                          "replies": [
                            {
                              "id": "mla29n2",
                              "author": "fafarex",
                              "body": ">The Switch isn't internally rendering at this resolution, though. It's upscaling.\n\ndepend on the game, MK8 is render at 1080p.\n\n>the dock also increases power throughput\n\nyes, because it's reduced in portable mode to preserve battery life and because it's usless at the smaller res not because the hardware can't.\n\n>as well as active cooling\n\nthat's just false it doesnt.\n\n>Meaning the Switch, by itself, is not capable of rendering that resolution on its base hardware.\n\nfalse again, the switch hardware is perfectly capable to do it on it's own, it's just configured not to because it would be stupid to do so.\n\nlot's of misinformation in your post.",
                              "score": 7,
                              "created_utc": 1743719121.0,
                              "replies": [
                                {
                                  "id": "mla2yrk",
                                  "author": "None",
                                  "body": "[deleted]",
                                  "score": -1,
                                  "created_utc": 1743719365.0,
                                  "replies": [
                                    {
                                      "id": "mla3qmu",
                                      "author": "fafarex",
                                      "body": "Nice you prove that the switch 2 has a cooling fan in the dock when I'm obviously talking about the switch 1 from the start ...",
                                      "score": 5,
                                      "created_utc": 1743719640.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mla3lvp",
                      "author": "Untitled_One-Un_One",
                      "body": "Why would you want to render in 4k for a 7.9 inch 1080p screen?",
                      "score": 8,
                      "created_utc": 1743719593.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mlc8369",
              "author": "weegee19",
              "body": "Probably because the Switch 2's life cycle has barely begun yet lmao. PS5 is 6x faster than the 4 yet it doesn't look it even now.",
              "score": 3,
              "created_utc": 1743752403.0,
              "replies": []
            },
            {
              "id": "ml9unmo",
              "author": "None",
              "body": "Or you could wait until we officially have full specifications instead of just piling on and going off of what you feel you saw during a live stream of limited gameplay.",
              "score": 12,
              "created_utc": 1743716553.0,
              "replies": [
                {
                  "id": "ml9wcr3",
                  "author": "icebeancone",
                  "body": "This comment reaks of copium",
                  "score": -13,
                  "created_utc": 1743717102.0,
                  "replies": [
                    {
                      "id": "ml9zlwu",
                      "author": "None",
                      "body": "Copium is telling you to wait until we have information before making assumptions? lol ok",
                      "score": 8,
                      "created_utc": 1743718197.0,
                      "replies": [
                        {
                          "id": "mla3s2t",
                          "author": "icebeancone",
                          "body": "Copium is watching the video that Nintendo put out themselves and saying \"it can't possibly be that bad\". They had months to cherry pick and *THAT* was their best footage? Bruh \n\nAnd I'm saying this as a Nintendo fan. I'll be buying the switch 2 regardless. But I can't say I'm not disappointed in the graphics.",
                          "score": -6,
                          "created_utc": 1743719655.0,
                          "replies": [
                            {
                              "id": "mla8mxp",
                              "author": "Key_Amazed",
                              "body": "Nintendo has never been the go-to console / handheld maker if you're worried about graphics since at least the Wii if not earlier. At this point expecting a massive upgrade is kind of self-inflicted disappointment. Heck, expecting a massive upgrade from any console generation at this point will leave you disappointed.",
                              "score": 2,
                              "created_utc": 1743721333.0,
                              "replies": [
                                {
                                  "id": "mlala9i",
                                  "author": "icebeancone",
                                  "body": "My expectations were very low and I'm still disappointed. I'm not expecting PS5 level graphics. Hell I was barely expecting PS4 level. It seems like they prioritized 60fps gameplay, which is great. I really appreciate that. But to have to turn it down so low to accomplish such really doesn't bode well for longevity.",
                                  "score": -3,
                                  "created_utc": 1743725864.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mla2uuf",
          "author": "Betancorea",
          "body": "I’m guessing the Switch 2 will have stock issues continuing way past launch based on that track record",
          "score": 1,
          "created_utc": 1743719327.0,
          "replies": []
        },
        {
          "id": "mlacn6k",
          "author": "CameronP90",
          "body": "Was about to say that too. The 10 times is probably 0.x6 times (replace x with a number between 0 and 4) faster once it actually comes out.",
          "score": 1,
          "created_utc": 1743722724.0,
          "replies": []
        },
        {
          "id": "mladqtq",
          "author": "None",
          "body": "Also gonna rise in price because of tariffs",
          "score": 1,
          "created_utc": 1743723119.0,
          "replies": []
        },
        {
          "id": "mlc5sk1",
          "author": "Santsiah",
          "body": "Probably means it’s being shipped by air cargo instead of ships",
          "score": 1,
          "created_utc": 1743750925.0,
          "replies": []
        },
        {
          "id": "mlcki0k",
          "author": "mrjasong",
          "body": "It's pretty much what we already estimated from the known hardware leaks. Somewhere around 3 teraflops for docked mode.",
          "score": 1,
          "created_utc": 1743760429.0,
          "replies": []
        },
        {
          "id": "mlgwj5w",
          "author": "mister2forme",
          "body": "Recently? Every release since they got caught cheating on benchmarks have been overstated.  I worked for an OEM years ago and we used to do the 50% rule - whatever Nvidia claimed, the best case scenario was 50% of that. \n\nIt's gotten worse now that they fudge numbers with fake frames and all that. \n\nThat's not to say they haven't made good hardware in the past, but their marketing team are masters at number padding. Real world (read: not influencer content posing as reviews) was always a bit lower.",
          "score": 1,
          "created_utc": 1743814285.0,
          "replies": []
        },
        {
          "id": "ml9qtsw",
          "author": "SpacemanCraig3",
          "body": "You can trust that with dlss on you can get 10x more frames on at least one thing, and that it supports ray tracing, but probably not both at the same time.",
          "score": -7,
          "created_utc": 1743715310.0,
          "replies": [
            {
              "id": "ml9tju2",
              "author": "steves_evil",
              "body": "DLSS is basically mandatory to make the performance cost of raytracing tolerable, so there's zero chance that any titles that use raytracing won't also be using DLSS to make up for the performance cost. \n\n\nRaytracing consumes a lot more power than DLSS since it is more computationally expensive, and DLSS helps that by rendering at a lower internal resolution, lowering the amount of computations needed for ray tracing.",
              "score": 6,
              "created_utc": 1743716193.0,
              "replies": [
                {
                  "id": "ml9ysq7",
                  "author": "fafarex",
                  "body": ">DLSS is basically mandatory to make the performance cost of raytracing tolerable, so there's zero chance that any titles that use raytracing won't also be using DLSS to make up for the performance cost.\n\nHe meant you won't have RT and 10 time more frame.",
                  "score": 0,
                  "created_utc": 1743717919.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ml9s8vm",
      "author": "BTBAM797",
      "body": "Hope them joycons are fixed cause pretty sure I saw they will be $90.",
      "score": 375,
      "created_utc": 1743715769.0,
      "replies": [
        {
          "id": "mla341v",
          "author": "TrippyVision",
          "body": "They better be Hall effect joysticks at that fucking price, it’s the only way they can justify it",
          "score": 211,
          "created_utc": 1743719418.0,
          "replies": [
            {
              "id": "mla8cy6",
              "author": "eljudio42",
              "body": "Nintendo will never admit to changing the hardware because that would be an acknowledgement that they fucked up the hardware on last gen which was never replaced with a new design. Per all the leaks prior to the console reveal, everything suggested hall effect sticks. I'm sure we'll find out soon or on launch day when folks disassemble it",
              "score": 124,
              "created_utc": 1743721237.0,
              "replies": [
                {
                  "id": "mladl43",
                  "author": "picardo85",
                  "body": "There's enough documentation that they fucked up over here in the EU already.\n\n[Nintendo promises unlimited repairs for “drifting” Joy-Cons throughout Europe - Ars Technica](https://arstechnica.com/gaming/2023/04/nintendo-promises-unlimited-repairs-for-drifting-joy-cons-throughout-europe/#:~:text=Nintendo%20has%20agreed%20to%20offer%20free%20lifetime%20repairs,pressure%20campaign%20from%20the%20European%20Consumer%20Organization%20%28BEUC%29.)",
                  "score": 77,
                  "created_utc": 1743723061.0,
                  "replies": [
                    {
                      "id": "mlahkkm",
                      "author": "eljudio42",
                      "body": "You make a good point, but announcing a hardware change or putting it on a fact sheet is too much of an admission of defeat from Nintendo's part. They'll let users disassemble it and reveal it to the world instead",
                      "score": 30,
                      "created_utc": 1743724490.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mlaleay",
                  "author": "blank_isainmdom",
                  "body": "Everyone loves overlooking that drift was a serious issue with every console for the last ten years. PS5 has serious drift issues, as does the xbox.",
                  "score": 17,
                  "created_utc": 1743725906.0,
                  "replies": [
                    {
                      "id": "mlarlwx",
                      "author": "southworthmedia",
                      "body": "I mean yeah, but joycons were just so much faster and consistent to drift compared to every console I know of. It’s pretty much a 100% chance they will drift eventually and about a 50% chance it’s in the first 3-6 months.",
                      "score": 45,
                      "created_utc": 1743728222.0,
                      "replies": [
                        {
                          "id": "mlchaiu",
                          "author": "blank_isainmdom",
                          "body": "I still have my original launch day joycons. They drifted a little bit around 2021/2022 for a while and I swapped to 3rd party for a year. Then i went back, cleaned my joycon slightly and boom. Good as new",
                          "score": 5,
                          "created_utc": 1743758416.0,
                          "replies": []
                        },
                        {
                          "id": "mlchjzj",
                          "author": "blank_isainmdom",
                          "body": "It's insane to me that people had experiences that bad! I swear, it has to be something stupid like being especially prone to dust in sandy places. I live in Ireland and played almost exclusively handheld all that time and it was years before i had any issues at all.",
                          "score": 1,
                          "created_utc": 1743758587.0,
                          "replies": [
                            {
                              "id": "mldtdjf",
                              "author": "Matticas",
                              "body": "Yeah I’ve never had my joy cons drift at all despite tons of use. \n\nI HAVE however gone through about 4 Xbox controllers in the past 4 or 5 years due to drift.\n\nLike I’m aware the joy con drift isn’t some hoax, a friend of mines had issues with his multiple times, but I’m just amazed I’ve had zero issue.",
                              "score": 2,
                              "created_utc": 1743778428.0,
                              "replies": [
                                {
                                  "id": "mle9uwe",
                                  "author": "blank_isainmdom",
                                  "body": "Right? Like, fuck. I don't know anyone who had to replace theres. I really think maybe it's like arizona, texas, etc that are dusty as fuck and that's causing the issue. Or maybe fucking cheeto hands or some shit, because mine are 8 years old now and fine.",
                                  "score": 2,
                                  "created_utc": 1743783356.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mlcvcu5",
                          "author": "None",
                          "body": "I bought one of those Nintendo partner controllers on accident and it got stick drift in 15 days haha. I was even able to return it.",
                          "score": 1,
                          "created_utc": 1743766212.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mlbqlq2",
                      "author": "rpkarma",
                      "body": "Joycons were way worse.",
                      "score": 8,
                      "created_utc": 1743742683.0,
                      "replies": []
                    },
                    {
                      "id": "mlb60ab",
                      "author": "C-C-X-V-I",
                      "body": "None of those had it to the degree the switch had though, you can't possibly think they're on the same level.",
                      "score": 9,
                      "created_utc": 1743733670.0,
                      "replies": []
                    },
                    {
                      "id": "mlfs4g4",
                      "author": "Voldemort57",
                      "body": "I’ve never had drift from other consoles controllers… maybe I’m lucky, but joycons began drifting within a year.",
                      "score": 1,
                      "created_utc": 1743799880.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mlf9myd",
                  "author": "rooftops",
                  "body": ">Nintendo will never admit to changing the hardware because that would be an acknowledgement that they fucked up the hardware on last gen which was never replaced with a new design.\n\nHow would changing to Hall effect joysticks be an acknowledgement of the last gen fuckups? I might not be neck deep in tech standards but Hall effect sticks seem like a relatively recent thing (ie after Switch 1 developmental period). It might've been possible with a hardware refresh but who knows what development costs would have to go into it.\n\nI have a controller with Hall effect sticks, that I bought specifically for after learning they existed at all, but it's 3rd party. I would almost expect Nintendo to advertise them for being the first (correct me if I'm wrong) first-party controller to have Hall effect sticks.",
                  "score": 1,
                  "created_utc": 1743794161.0,
                  "replies": [
                    {
                      "id": "mlfci3t",
                      "author": "eljudio42",
                      "body": "So after all the backlash around the joy cons last gen and the EU also addressing it, Nintendo offered free repairs to all joy cons indefinitely. That was probably more cost effective than going back to the drawing board and releasing a 2.0 model. When Nintendo started to offer repairs, I think it's safe to say people might have expected a redesign where this happens less frequently. Because compared to any other controller, joy cons were reported to drift very quickly using the same tech.\n\nNow I'm not saying at the time they would have started to offer hall effect, because like you said it's relatively new (at least as far as I am aware), but why do joy cons drift so much sooner than their pro controller, the PlayStation controllers and the Xbox who all use pentominner sticks.\n\nSo since they never did a redesign, they clearly didn't think there was anything to change. By saying \"hey we changed the tech in the joy con 2 so these won't drift as much\" you're going to have a big crowd of people who will say \"why didn't you offer this last gen\".",
                      "score": 1,
                      "created_utc": 1743795061.0,
                      "replies": [
                        {
                          "id": "mlfl79z",
                          "author": "rooftops",
                          "body": ">people might have expected a redesign where this happens less frequently.\n\nAh yeah that's a good point, as I also would expect at least some attempt to fix the problem instead of just replacing it with the same hardware.\n\n>So since they never did a redesign, they clearly didn't think there was anything to change. By saying \"hey we changed the tech in the joy con 2 so these won't drift as much\" you're going to have a big crowd of people who will say \"why didn't you offer this last gen\".\n\nThat's the thing though, they don't have to say \"new tech to fix the old problems\" they just have to market it as \"this is fancy new technology\" and pretend to be forerunners of the tech. The people who'd complain about it not being offered are going to complain regardless, and your average consumer probably would probably understand \"this wasn't really a thing back then but it is now\" over \"maybe we could've but it would've cost lots of money and development time\".\n\nBut I suppose saying nothing is the safest option for brand protection so who am I to argue lol.\n\n\nTangent but I've been meaning to learn more about the technical side of things; I've always wondered if it's feasible to have some module to swap out analogs for in existing systems but I doubt it's translatable without some major hardware/programming changes (at least from what I've gleaned in my work experience).",
                          "score": 2,
                          "created_utc": 1743797749.0,
                          "replies": [
                            {
                              "id": "mlgm55v",
                              "author": "eljudio42",
                              "body": "That makes things repairable and too pro consumer. Which major corporations are very against 😆",
                              "score": 2,
                              "created_utc": 1743810332.0,
                              "replies": [
                                {
                                  "id": "mnzi8yh",
                                  "author": "rooftops",
                                  "body": "So mild disappointment of the news aside I just noticed my controller manufacturer now has drop-in TMR sticks for joycons, so that both kinda answers my question and gives me a little hope for 3rd party stuff lol.",
                                  "score": 1,
                                  "created_utc": 1745095617.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mlac3tm",
                  "author": "TrippyVision",
                  "body": "Yeah that’s a good point floodgates would open if that were the case\n\nThank god, crossing my fingers it’s true, I’ve gone through so many pairs cause of young siblings/relatives coming over to play games.. I’ve spent more on joy-cons then the actual console itself smh",
                  "score": -3,
                  "created_utc": 1743722536.0,
                  "replies": [
                    {
                      "id": "mlahb9n",
                      "author": "eljudio42",
                      "body": "As many advantages that the joy cons brought into gaming; smaller controllers, easier to press buttons for those with small hands and fine motor problem, the ability to hold your arms apart and not have to deal with shoulder tension, I never thought it was worth playing with my joy cons and kept them on for aesthetic purposes only. I hope this time around they're high quality, cause I'd love to use them",
                      "score": 2,
                      "created_utc": 1743724396.0,
                      "replies": []
                    },
                    {
                      "id": "mlbvtg0",
                      "author": "mylanscott",
                      "body": "They’ve had a free program to fix joycons for years now. Instead of buying new ones all the time, just send them in",
                      "score": 1,
                      "created_utc": 1743745436.0,
                      "replies": [
                        {
                          "id": "mlbwztb",
                          "author": "TrippyVision",
                          "body": "Wow how is this the first time I’m hearing about this.. I’ve got a few pairs to send in then, thanks! \n\nDid some research on it, good on Nintendo to finally do it but super shitty that it took a couple years of complaints and multiple lawsuits to actually do something about it",
                          "score": 1,
                          "created_utc": 1743746087.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mlb3gud",
              "author": "None",
              "body": "8bitdo Pro controllers are hall effect now and like $45",
              "score": 5,
              "created_utc": 1743732700.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mlaysjd",
          "author": "Product_ChildDrGrant",
          "body": "It was confirmed they’re using Hall Effect joysticks. Thank God.",
          "score": 8,
          "created_utc": 1743730951.0,
          "replies": []
        },
        {
          "id": "mlcp5te",
          "author": "None",
          "body": "Wait 6 months, there will be cheap dupes on Ali express",
          "score": 1,
          "created_utc": 1743763148.0,
          "replies": []
        },
        {
          "id": "mlioahw",
          "author": "steinrrr",
          "body": "The constant disconnects made them unusable",
          "score": 1,
          "created_utc": 1743847313.0,
          "replies": []
        },
        {
          "id": "mlbisn2",
          "author": "Enderkr",
          "body": "Hurray tariffs!*\n\n*Not a guarantee that this is the fault of tariffs and not good old fashioned greed",
          "score": 1,
          "created_utc": 1743738995.0,
          "replies": [
            {
              "id": "mlbzp3t",
              "author": "tommyk1210",
              "body": "It’s absolutely tariffs - everything Switch2 related is being priced with tariffs included.",
              "score": 4,
              "created_utc": 1743747556.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ml9zqqm",
      "author": "Revoldt",
      "body": "10x a mid range mobile chip from 10 years ago isn’t really that impressive…",
      "score": 137,
      "created_utc": 1743718243.0,
      "replies": [
        {
          "id": "mla9zbe",
          "author": "Nathexe",
          "body": "10 times more powerful than an outdated on launch system, so like at least 12-14 year old tech now? Yeesh",
          "score": 37,
          "created_utc": 1743721798.0,
          "replies": [
            {
              "id": "mlajt0g",
              "author": "None",
              "body": "[deleted]",
              "score": -32,
              "created_utc": 1743725312.0,
              "replies": [
                {
                  "id": "mlbk7co",
                  "author": "Shot_Mud_1438",
                  "body": "Weird.   My steam deck runs shit that’s current",
                  "score": 17,
                  "created_utc": 1743739638.0,
                  "replies": [
                    {
                      "id": "mlcfhue",
                      "author": "Azure-April",
                      "body": "..And so does the Switch 2. Do you *seriously* think the Deck is more powerful?",
                      "score": -9,
                      "created_utc": 1743757239.0,
                      "replies": [
                        {
                          "id": "mldk0tp",
                          "author": "Shot_Mud_1438",
                          "body": "Ah yes, the console that doesn’t exist for consumers runs current games? Gtfo.  You’re just going to believe the propaganda being spit by Nintendo and nvidia? Because they said it would? You’re a clown",
                          "score": 3,
                          "created_utc": 1743775568.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mlc2mhj",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -8,
                      "created_utc": 1743749041.0,
                      "replies": [
                        {
                          "id": "mlc4o0h",
                          "author": "Techno-Diktator",
                          "body": "That game runs like shit on almost everything though. \n\nSteam deck frankly punches way above it's weight class, it's quite impressive.",
                          "score": 8,
                          "created_utc": 1743750215.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mlezx2p",
              "author": "Chrisnness",
              "body": "The switch wasn’t outdated at launch at all. Compare what an iPhone 7 can run compared to Switch games",
              "score": -4,
              "created_utc": 1743791169.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mlc864g",
          "author": "weegee19",
          "body": "10x the speed, slap on the additional features and architectural differences, it's gonna be a massive difference.",
          "score": 8,
          "created_utc": 1743752456.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ml9qr0s",
      "author": "wolverineFan64",
      "body": "On no planet will this thing handle raytracing at any playable fps, but sure I guess.",
      "score": 205,
      "created_utc": 1743715286.0,
      "replies": [
        {
          "id": "ml9xnl3",
          "author": "None",
          "body": "There will be one ray traced**",
          "score": 104,
          "created_utc": 1743717534.0,
          "replies": [
            {
              "id": "mlae8zh",
              "author": "EHP42",
              "body": "It's in the name! \"Ray\" tracing, not \"rays\" tracing.",
              "score": 44,
              "created_utc": 1743723298.0,
              "replies": [
                {
                  "id": "mlcmp10",
                  "author": "KingSwank",
                  "body": "They hired Ray Barone to trace the art in the new Mario Kart",
                  "score": 4,
                  "created_utc": 1743761753.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mlaovxt",
          "author": "Trunks252",
          "body": "What about Tatooine?",
          "score": 9,
          "created_utc": 1743727203.0,
          "replies": [
            {
              "id": "mlap35s",
              "author": "wolverineFan64",
              "body": "Definitely not. Too much sand. It’s coarse and rough and irritating and it will mess with the gpu.",
              "score": 13,
              "created_utc": 1743727279.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mlc4wik",
          "author": "tetrahedronss",
          "body": "Sorry you guys misheard, it supports Rayman.",
          "score": 7,
          "created_utc": 1743750364.0,
          "replies": []
        },
        {
          "id": "mlb2kqy",
          "author": "Boom-Doc-a-Locka",
          "body": "It's just a ghost image on the screen of a guy named Ray who was involved in the development of the system.",
          "score": 12,
          "created_utc": 1743732360.0,
          "replies": []
        },
        {
          "id": "mlcrg3y",
          "author": "Ub3ros",
          "body": "Lol? 20-series nvidia cards could do light raytracing on playable fps. This thing won't be doing pathtraced cyberpunk at 4k, but it will absolutely do regular raytracing when the games are built for the specific hardware.",
          "score": 4,
          "created_utc": 1743764341.0,
          "replies": []
        },
        {
          "id": "mlax4k0",
          "author": "Noselessmonk",
          "body": "I wouldn't doubt some games will do it. The Steam Deck can play \\*\\*some\\*\\* ray traced games at ok fps. An Nvidia GPU should be better than an RDNA2 gpu.",
          "score": 7,
          "created_utc": 1743730314.0,
          "replies": []
        },
        {
          "id": "mlbz0gj",
          "author": "Hugebigfan",
          "body": "Why would the T239 not be able to handle ray tracing? \n\n[it seemed pretty capable from what people have been saying even from last year](https://m.youtube.com/watch?v=czUipNJ_Qqs)",
          "score": 3,
          "created_utc": 1743747214.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ml9xdbu",
      "author": "docyeti",
      "body": "Over 10,000 times faster than a toaster as well.",
      "score": 38,
      "created_utc": 1743717438.0,
      "replies": [
        {
          "id": "mlaw2yu",
          "author": "LakersAreForever",
          "body": "Switch 2 will basically be a ps4 \n\n\nThey can stop trying to dazzle us with all these buzzwords ",
          "score": 18,
          "created_utc": 1743729917.0,
          "replies": [
            {
              "id": "mlbpj3x",
              "author": "Hugebigfan",
              "body": "I don’t understand. The current claim is 120 fps at 1080p and 60fps at 4k, isn’t that superior to a ps4 pro in terms of performance and graphics? \n\nIt could be that Nintendo is lying, but the $450 price tag suggests otherwise.",
              "score": 15,
              "created_utc": 1743742153.0,
              "replies": [
                {
                  "id": "mlbrhew",
                  "author": "Mother_Restaurant188",
                  "body": "Much like the Switch was basically a PS3+ with modern hardware, the Switch 2 is roughly a PS4+ with modern hardware.\n\nOverly simplistic take but in terms of what the average gamer will see visually, I think that’s a fair assessment.",
                  "score": 16,
                  "created_utc": 1743743129.0,
                  "replies": []
                },
                {
                  "id": "mlc4uho",
                  "author": "Techno-Diktator",
                  "body": "Yeah you might get those numbers in games that look like they were released a decade or two ago",
                  "score": 8,
                  "created_utc": 1743750329.0,
                  "replies": []
                },
                {
                  "id": "mlg0wm5",
                  "author": "Eruannster",
                  "body": "I will eat my hat if most games come even close to actually rendering that many pixels natively on Switch 2. Some simpler graphics games might, but the vast majority are very likely rendering from a much lower internal resolution and running VRR ”up to 120 FPS”. Cyberpunk was apparently rendering at ~540p upscaled to 1080 and runs at 30-40 FPS. So… yeah.",
                  "score": 3,
                  "created_utc": 1743802746.0,
                  "replies": []
                },
                {
                  "id": "mlc4uqz",
                  "author": "Techno-Diktator",
                  "body": "Yeah you might get those numbers in games that look like they were released a decade or two ago",
                  "score": 1,
                  "created_utc": 1743750333.0,
                  "replies": []
                },
                {
                  "id": "mlpw89u",
                  "author": "Rethawan",
                  "body": "The problem isn’t necessarily the hardware per se, it’s the balance of performance vs graphical fidelity. There’s nothing inherent about the PS4 which prevents it from rendering 120 fps in 4K, but the graphical fidelity would take a major hit in terms of lighting, physics, tessellation etc. That conundrum will always exist regardless of generation until the console makers mandate or enforce developers that the bare minimum for any released game needs to hit x amount of frames or y amount of resolution.",
                  "score": 1,
                  "created_utc": 1743956166.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mlaeoqi",
      "author": "dexterward4621",
      "body": "People are skeptical of this, but it's not that hard to believe considering how old and underpowered switch 1 is.\n\nSwitch 2 is an 8 core A78c and 1536 cuda core Ampere with back ported Lovelace features. That's significantly more powerful than switch, which was basically a PS3+.",
      "score": 34,
      "created_utc": 1743723454.0,
      "replies": []
    },
    {
      "id": "mla98th",
      "author": "fvck_u_spez",
      "body": "And a 5070 is better than a 4090! Oh wait...",
      "score": 19,
      "created_utc": 1743721544.0,
      "replies": []
    },
    {
      "id": "ml9sbmc",
      "author": "Axisl",
      "body": "New sheild? Please new sheild",
      "score": 32,
      "created_utc": 1743715794.0,
      "replies": [
        {
          "id": "mlb2sqi",
          "author": "Mental_Medium3988",
          "body": "yes please.",
          "score": 3,
          "created_utc": 1743732445.0,
          "replies": []
        },
        {
          "id": "mlaae03",
          "author": "TrippySubie",
          "body": "Just use sunshine",
          "score": -7,
          "created_utc": 1743721938.0,
          "replies": [
            {
              "id": "mlalhqy",
              "author": "youhavechosenwisely",
              "body": "I think they mean the android TV box.",
              "score": 13,
              "created_utc": 1743725941.0,
              "replies": [
                {
                  "id": "mlejowk",
                  "author": "TrippySubie",
                  "body": "The nvidia shield yes? Just use sunshine lol",
                  "score": 0,
                  "created_utc": 1743786325.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ml9viti",
      "author": "TheEclipse0",
      "body": "Considering the fiasco that is the 5000 series gpu’s, I wouldn’t bother with Nvidia’s trumped up tech specs. They’re liars.",
      "score": 74,
      "created_utc": 1743716833.0,
      "replies": [
        {
          "id": "mla9c7r",
          "author": "Jonoyk",
          "body": "Missed the news about the 5000 series. What happened?",
          "score": 12,
          "created_utc": 1743721576.0,
          "replies": [
            {
              "id": "mlado1k",
              "author": "LBPPlayer7",
              "body": "they're barely more powerful than the 40 series and just use slightly better dlss and frame gen as a crutch",
              "score": 28,
              "created_utc": 1743723091.0,
              "replies": [
                {
                  "id": "mlag5pj",
                  "author": "CompromisedToolchain",
                  "body": "5000 series is the garbage that couldn’t end up as a workstation chip.",
                  "score": 11,
                  "created_utc": 1743723980.0,
                  "replies": [
                    {
                      "id": "mlb82rp",
                      "author": "PIO_PretendIOriginal",
                      "body": "But Isnt that the case for every generation",
                      "score": 3,
                      "created_utc": 1743734476.0,
                      "replies": [
                        {
                          "id": "mlc2no0",
                          "author": "LBPPlayer7",
                          "body": "but it's happened twice already\n\nthe 40 series was also underwhelming for the power draw it took, and the 50 series just continues this trend of just throw more cores at the problem, you have power supplies that can pull that much wattage, right?",
                          "score": 2,
                          "created_utc": 1743749062.0,
                          "replies": [
                            {
                              "id": "mlc4rr9",
                              "author": "PIO_PretendIOriginal",
                              "body": "Nvidia dont make silicon. TSMC do, silicon advancements are slowing down a lot compared to the preceding decade.\n\nNow nvidia being cheapskates on vram is something I can get behind. But the power draw is just the reality of the technology right now.\n\nBecause advancements in silicon have slowed so much. The only way to increase performance is through higher power draw. Hopefully next generation tsmc 2nm is ready (but that may not be until 2028)",
                              "score": 2,
                              "created_utc": 1743750280.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mlaw22g",
                  "author": "MetalstepTNG",
                  "body": "The 40 series was almost like that as well tbh.",
                  "score": 1,
                  "created_utc": 1743729907.0,
                  "replies": []
                },
                {
                  "id": "mlaemwn",
                  "author": "SpamingComet",
                  "body": "5090 is league’s ahead, wtf are you on about?",
                  "score": -5,
                  "created_utc": 1743723436.0,
                  "replies": [
                    {
                      "id": "mlaggcz",
                      "author": "LBPPlayer7",
                      "body": "33% faster than the 4090 is quite far off from nvidia's 100% faster claim",
                      "score": 9,
                      "created_utc": 1743724087.0,
                      "replies": [
                        {
                          "id": "mlambbu",
                          "author": "Super_XIII",
                          "body": "It's also 33% larger and consumes 33% more power. So the technology didn't even improve at all, they just made a 4090 XL.",
                          "score": 15,
                          "created_utc": 1743726245.0,
                          "replies": [
                            {
                              "id": "mlb8un1",
                              "author": "NervyDeath",
                              "body": "33% larger in what way?",
                              "score": 2,
                              "created_utc": 1743734782.0,
                              "replies": [
                                {
                                  "id": "mlb9e4e",
                                  "author": "Super_XIII",
                                  "body": "die size. It's actually just a single chip on the graphics card that does all the actual processing, the rest of the size is mostly just power management and keeping the chip cool. The chip increased about 33% in size. It's not noticeable at all from the outside since it isn't visible though.",
                                  "score": 2,
                                  "created_utc": 1743734999.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mlau1rp",
                              "author": "SupremeDictatorPaul",
                              "body": "Yeah, that was my impression. When you see this sort of thing with CPU generations (performance increase proportional to power consumption increase) it usually means that the architecture design they’re basing everything on has reached the limits of its capabilities, and they need to go back to the drawing board to start from the ground up for the next generation. \n\nI’m predicting that the 6xxx generation will either use an entirely new design, or get even crazier with power requirements.",
                              "score": 1,
                              "created_utc": 1743729147.0,
                              "replies": [
                                {
                                  "id": "mlc37ki",
                                  "author": "LBPPlayer7",
                                  "body": "judging that nvidia is following the ai craze cash, i doubt that they'll care about realtime rendering enough to rearchitecture that portion of the die any time soon",
                                  "score": 1,
                                  "created_utc": 1743749365.0,
                                  "replies": []
                                },
                                {
                                  "id": "mlc8twr",
                                  "author": "cgaWolf",
                                  "body": ">I’m predicting that the 6xxx generation\n\nI agree with your general point, but on that i think you're early. i think the 6000 series will do the exact thing once more, as 1) right now that strategy still works*, and 2) we'd have heard rumors if they were at a stage that would bring a new architecture to market in 1.5-2 years.\n\n*) meaning the money is in AI, and that craze is still good for one more generation of chips.",
                                  "score": 1,
                                  "created_utc": 1743752886.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mlbohg8",
                          "author": "SpamingComet",
                          "body": "I don’t think it matters that it’s not 100% faster, 33% is in no world “barely”. Them being disingenuous doesn’t mean you should be as well",
                          "score": -1,
                          "created_utc": 1743741658.0,
                          "replies": [
                            {
                              "id": "mlc314e",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 0,
                              "created_utc": 1743749268.0,
                              "replies": [
                                {
                                  "id": "mlc3ypi",
                                  "author": "SpamingComet",
                                  "body": "While I agree frame gen shouldn’t have been used for comparisons, if you’re dumb enough to call it lies because you don’t like how they did it then you’re no longer worth talking to. Bye!",
                                  "score": 1,
                                  "created_utc": 1743749800.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mlaolm7",
                      "author": "phillz91",
                      "body": "And the 70 and 80 series are barely better than the previous gen with an average of less than 12% uplift across multiple games, sometimes even losing to the previous gen comparable cards.\n\nThe 5090 also eats as much more power than the increase in performance, so it's not even that much of a generational uplift, they just threw more power at it.",
                      "score": 1,
                      "created_utc": 1743727095.0,
                      "replies": [
                        {
                          "id": "mlbomsv",
                          "author": "SpamingComet",
                          "body": "Who cares about the 70s? The 80 is essentially a cheaper 4090, and the 5090 is the new best card. It doesn’t matter how they made it happen, it happened",
                          "score": -3,
                          "created_utc": 1743741726.0,
                          "replies": [
                            {
                              "id": "mlbq47u",
                              "author": "phillz91",
                              "body": "What an ignorant comment. The 5080 is 20% slower or more while only being 15% cheaper than the 4090 in my market. This is not the same as the leap from 20-30 or 30-40 series, the 50 series is only marginally better than the previous across the board.\n\nAnd who cares about 70 series? You understand the 60 and 70 series cards out perform the higher end card in sales numbers every generation right? The 80 and 90 series are nice to look at on a graph but most people are not spending that much on a GPU.\n\nNvidias own fucking [marketing](https://au.pcmag.com/graphics-cards/110094/nvidia-says-it-shipped-twice-as-many-rtx-5000-gpus-than-4000-but-theres-a-catch) compared the sales numbers for the 4000 to the 5000 series and the new cards had only sold slightly more, despite having 4 separate SKU's compared to basically just the 4090 for 4 of the 5 weeks measured.\n\nStop falling for marketing hype my dude.",
                              "score": 1,
                              "created_utc": 1743742440.0,
                              "replies": [
                                {
                                  "id": "mlbra7v",
                                  "author": "SpamingComet",
                                  "body": "That’s nice that people buy e-waste, but I don’t care. I care about performance, and the 5090 has that, so it’s a good card. You’re whining about a base trim corolla while my only concern is a supra.",
                                  "score": -2,
                                  "created_utc": 1743743027.0,
                                  "replies": [
                                    {
                                      "id": "mlbtq3h",
                                      "author": "phillz91",
                                      "body": "Mate, you asked who cared, I answered. Just cus you like to buy over priced electronics does not make you incapable of considering the market as a whole.\n\nIf you want the power, great. But that does not inherently make the 5090 a **good buy**, and it only gets worse the further down the stack you go. That was the point of the comment you replied to, remember.",
                                      "score": 0,
                                      "created_utc": 1743744304.0,
                                      "replies": [
                                        {
                                          "id": "mlc183d",
                                          "author": "SpamingComet",
                                          "body": "The comment I replied to is this:\n\n> they’re barely more powerful than the 40 series and just use slightly better dlss and frame gen as a crutch\n\nI replied that the 5090 specifically was leagues better, and you went on about 70s and 80s and other nonsense. I was correct with my initial comment, the 5090 is leagues better than anything else out right now, and no amount of you whining about it will change that.",
                                          "score": 1,
                                          "created_utc": 1743748301.0,
                                          "replies": [
                                            {
                                              "id": "mlc1w15",
                                              "author": "phillz91",
                                              "body": "So the original comment is about the 50 series as a whole. Your comment was about the 5090 specifically, which was not what OP was really talking about.\n\nI then addressed both your claim of the 5090 being 'leagues better' (to paraphrase; it's not, 30% is a pretty standard uplift for a generation. It's good but not amazing in context. 3090 to 4090 was a 50% jump on average) and the original comment referring to the rest of the product stack, which are barely better if at all.\n\nMy man, you are the one that can't seem to comprehend context here",
                                              "score": 0,
                                              "created_utc": 1743748635.0,
                                              "replies": [
                                                {
                                                  "id": "mlc3p6r",
                                                  "author": "SpamingComet",
                                                  "body": "> So the original comment is about the 50 series as a whole. Your comment was about the 5090 specifically, which was not what OP was really talking about.\n\nYou must be clinically insane. If I start a conversation about bread, it’s a general topic. You can move it into favorite types of bread, how to make bread, how to use bread, anything that still relates to bread, because you’re simply narrowing down a general topic. But if you narrow it down to favorite types, and I say I hate a certain type, well that’s the complete opposite, so that doesn’t really make sense.\n\nIn this scenario the comment I responded to was about the 50 series as a whole, again, a general topic. I narrowed it down to the 5090, because their wording did not apply to that one. You then ignored the 90 and went on about the 80 and 70, which doesn’t follow what I said. If you had responded to the same comment I responded to, that would have made more sense.\n\nHope this helps! Maybe when you get out the ward you’ll be able to practice more.",
                                                  "score": 1,
                                                  "created_utc": 1743749645.0,
                                                  "replies": [
                                                    {
                                                      "id": "mlc5nyh",
                                                      "author": "phillz91",
                                                      "body": ">The 5090 also eats as much more power than the increase in performance, so it's not even that much of a generational uplift, they just threw more power at it.\n\nLook man, this was my response to the claim about the 5090. The rest of the comment was qualifying the statement of the person you replied to as being correct, which then became the topic in your reply.\n\nThe 5090 is more powerful, but it is not significantly better, as you claim, and it is certainly not impressively better compared to previous generational leaps.\n\nThe 5000 series as a whole is also, on average, barely more powerful than the 4000 series.\n\nBoth of these things can be and are true. Have a good one",
                                                      "score": 0,
                                                      "created_utc": 1743750844.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "mlbxphx",
                                      "author": "Reeyous",
                                      "body": "Your 5090 will certainly become e-waste if the [power cable melts and bricks your GPU.](https://www.theverge.com/news/609207/nvidia-rtx-5090-power-connector-melting-burning-issues)",
                                      "score": 0,
                                      "created_utc": 1743746488.0,
                                      "replies": [
                                        {
                                          "id": "mlc10aq",
                                          "author": "SpamingComet",
                                          "body": "If you don’t know how to plug in cables and what cables to use (and what ones *not* to use) you shouldn’t be buying top tier hardware. Anyone with a brain can avoid that",
                                          "score": 1,
                                          "created_utc": 1743748192.0,
                                          "replies": [
                                            {
                                              "id": "mlc1m0s",
                                              "author": "Reeyous",
                                              "body": "\"YouTuber der8auer has also examined the Reddit poster’s equipment in person, and ruled out any form of user error in the process.\"\n\nFE card, FE cable supplied by Nvidia, secured properly into the port. Still melted, because pushing *600 freaking watts through a single tiny cable and connector* is a stupid idea in any context.\n\nAt least read the damn article before replying next time. Might make someone wonder if you're just a Userbenchmark alt account if you keep acting like this.",
                                              "score": 0,
                                              "created_utc": 1743748494.0,
                                              "replies": [
                                                {
                                                  "id": "mlc358m",
                                                  "author": "SpamingComet",
                                                  "body": "> YouTuber\n\n> Reddit poster\n\nWe’ve seen the same thing for 3 generations now. A couple people post on Reddit, people act like the sky is falling, a YouTuber makes a video, people act like the sky is falling, and then it dies down because no real incidents occur. If this was a serious issue there would be mass recalls.",
                                                  "score": 1,
                                                  "created_utc": 1743749329.0,
                                                  "replies": [
                                                    {
                                                      "id": "mlc3efn",
                                                      "author": "Reeyous",
                                                      "body": "Der8auer, aka the CEO of Thermal Grizzly cooling solutions...\n\nWho has been in the cooling and overclocking scenes (aka dealing with extreme temps) for two decades...\n\nWho you just dismissed because you can't do even the slightest bit of research before trying to mindlessly morally grandstand for one of the richest corporations on the planet.\n\nI'm done with this conversation. Do better.",
                                                      "score": 0,
                                                      "created_utc": 1743749475.0,
                                                      "replies": [
                                                        {
                                                          "id": "mlc404s",
                                                          "author": "SpamingComet",
                                                          "body": "Take your own advice, kiddo!",
                                                          "score": 1,
                                                          "created_utc": 1743749823.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mlb872d",
              "author": "NervyDeath",
              "body": "Must have missed it too, too busy enjoying my upgrade",
              "score": 2,
              "created_utc": 1743734524.0,
              "replies": []
            },
            {
              "id": "mlb53hb",
              "author": "datnetcoder",
              "body": "It’s not a fiasco, a bunch of people are whining that we’re not still o a 2x per generation growth curve. 5090 has a ~30% raw improvement over the 4090 which is still significant. People are also angry that it gets that partly by drawing more power.",
              "score": 2,
              "created_utc": 1743733322.0,
              "replies": []
            },
            {
              "id": "mlam5pc",
              "author": "TheEclipse0",
              "body": "A lot of things, too many to list here. \n\nBasically, Nvidia promised a lot of things that just arn't true. The most prominent one being that the 5070 is just as powerful as a 4090, for $500 MSRP (a fraction of the cost). If this were true, that would be AMAZING. Well, if I recall correctly (someone correct me if I’m wrong), the 5070 actually performs WORSE than last gen’s budget card, while all of those extra frames come from DLSS. DLSS is very good in many instances, allowing us to play games at higher frame rates than the card is capable of running by itself… but there can be too much DLSS. So, when you turn it off, we find that the card runs games at a single digit frame rate. Yes, single digit on modern hardware, whereas its predecessor could get playable frame rates on the same games without DLSS. In fact, the entire 5000 series cards performs WORSE across the board on OLD games from the early 2000’s because Nvidia removed PhysX. People are getting half the frame rate in games like boarderlands 2 on their $2000+ graphics card, when their old card ran it at double the speed. Eitherway, with the 5070 and DLSS, the AI is doing so much that it causes severe ghosting… imagine driving a car in gta5, at half the frame rate as your old card, and everytime you go around a corner, your car splits into 5 versions of itself like a fan.\n\nNvidia basically false advertising. ",
              "score": 2,
              "created_utc": 1743726188.0,
              "replies": []
            },
            {
              "id": "mlfy87g",
              "author": "zerGoot",
              "body": "genuinely some of the worst \"generational uplift\" from the previous gen, as nvidia has replaced any proper improvements with AI",
              "score": 1,
              "created_utc": 1743801856.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mlalled",
      "author": "Reciprocity2209",
      "body": "Just like the 5070 has 4090 performance, right?",
      "score": 12,
      "created_utc": 1743725978.0,
      "replies": [
        {
          "id": "mlb3gsq",
          "author": "ChrisOz",
          "body": "From a profit margin perspective I think Nvidia feels it has equivalent performance.",
          "score": 1,
          "created_utc": 1743732699.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlab7a6",
      "author": "xensiz",
      "body": "Soon to be tarriffed!",
      "score": 5,
      "created_utc": 1743722220.0,
      "replies": [
        {
          "id": "mlcg0mu",
          "author": "WolfyTn615",
          "body": "Looks like they already put their own tariffs on it at these prices",
          "score": 1,
          "created_utc": 1743757582.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlb0dzo",
      "author": "KoyReane",
      "body": "So Gamefreak has absolutely no excuse to make Pokémon games with their Ps2 ass 3d graphics",
      "score": 5,
      "created_utc": 1743731547.0,
      "replies": [
        {
          "id": "mlcgi44",
          "author": "WolfyTn615",
          "body": "Nope.. but they will.. Z-A is pretty and all.. but pretty like a high school cheerleader from the movies.. a lot of empty space up top",
          "score": 0,
          "created_utc": 1743757899.0,
          "replies": [
            {
              "id": "mld2v7s",
              "author": "KoyReane",
              "body": "Yeah these new gen games all have these creepy vacant liminal spaces. Bring back 2D!",
              "score": 1,
              "created_utc": 1743769425.0,
              "replies": [
                {
                  "id": "mlq28c4",
                  "author": "holyluigi",
                  "body": "bringing Pokemon back to 2D and making it HD 2D like Octopath Traveler would look glorious and be way better received than what they are putting out now. They can still keep the Battles 3D and make specified environments too so the competetive scene looks more presentable to an audience and be more of a spectacle. Just... make the overworld look good again. And I doubt they will ever try to which is a shame.",
                  "score": 2,
                  "created_utc": 1743958123.0,
                  "replies": [
                    {
                      "id": "mlq4ugj",
                      "author": "KoyReane",
                      "body": "Absolutely agree across the board",
                      "score": 1,
                      "created_utc": 1743958956.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ml9wu61",
      "author": "Alarmed-dictator",
      "body": "It’s gonna make a great space heater for the winter months",
      "score": 8,
      "created_utc": 1743717261.0,
      "replies": [
        {
          "id": "mlcfzgl",
          "author": "WolfyTn615",
          "body": "Just make sure to play Cyberpunk on it for a few minutes to get it nice and hot 🤣 this Nintendo future gen is very disappointing I really hope they can turn it around",
          "score": 1,
          "created_utc": 1743757560.0,
          "replies": []
        },
        {
          "id": "mlavoqx",
          "author": "opeth10657",
          "body": "For like 10 minutes until the battery dies",
          "score": -1,
          "created_utc": 1743729768.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ml9u1kl",
      "author": "manyeggplants",
      "body": "Just checking, is this the same Nvidia who has been exaggerating performance for decades and more recently misrepresenting benchmarks and faulty hardware?  That Nvidia?",
      "score": 22,
      "created_utc": 1743716356.0,
      "replies": []
    },
    {
      "id": "mlatgyd",
      "author": "h3rpad3rp",
      "body": "I would hope so, the Switch was slow when it came out almost 10 years ago. \n\nCouldn't even run the Zelda games without choppy frame rate in some places.",
      "score": 3,
      "created_utc": 1743728928.0,
      "replies": [
        {
          "id": "mlcge6q",
          "author": "WolfyTn615",
          "body": "Now we get to replay BoTW and ToTK with prettier detail.. unfortunately, I don’t replay games I’ve put hundreds of hours on lol",
          "score": 1,
          "created_utc": 1743757828.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ml9u6tc",
      "author": "Fairuse",
      "body": "So it is only 2.5x faster because frame gen does 4x based on how nvidia calculates performance increases ",
      "score": 35,
      "created_utc": 1743716403.0,
      "replies": [
        {
          "id": "mla0qds",
          "author": "mavven2882",
          "body": "The article clearly states that frame gen is not supported, only DLSS.",
          "score": 51,
          "created_utc": 1743718586.0,
          "replies": [
            {
              "id": "mlb87gq",
              "author": "PIO_PretendIOriginal",
              "body": "That would require people to read the article.",
              "score": 11,
              "created_utc": 1743734528.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mladsc1",
          "author": "SlovenianSocket",
          "body": "T239 SoC uses an ampere core, does not support frame gen.",
          "score": 10,
          "created_utc": 1743723133.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlao3z1",
      "author": "hweird",
      "body": "Just leave an exploit in there so the masters can hack it lol",
      "score": 5,
      "created_utc": 1743726911.0,
      "replies": []
    },
    {
      "id": "ml9nzud",
      "author": "ThatDandyFox",
      "body": "I'll admit I did not expect the Nintendo switch to support raytracing, the price of the console makes a little more sense *if* the hardware is as good as claimed.\n\nPrice of the games... Still not so much.",
      "score": 17,
      "created_utc": 1743714425.0,
      "replies": [
        {
          "id": "ml9rs8t",
          "author": "steves_evil",
          "body": "Ray tracing support is probably more of a byproduct of using an Ampere based GPU than a deliberate decision (Tegra T239). The GPU is going to be somewhere around or under a rtx 2050 laptop depending on whether the switch is docked or in handheld. Much more powerful than the og Switch, but Ray tracing is still incredibly demanding so DLSS and actual optimization will have to put in a lot of work to make any use of those effects.",
          "score": 26,
          "created_utc": 1743715619.0,
          "replies": []
        },
        {
          "id": "mlb32eb",
          "author": "Mental_Medium3988",
          "body": "given nintendos history i wouldnt be surprised if first party titles could run it, but third party titles might struggle with it or not support it.",
          "score": 2,
          "created_utc": 1743732547.0,
          "replies": []
        },
        {
          "id": "ml9tot3",
          "author": "Gunfreak2217",
          "body": "Bruh the console is literally using a chip that was like 150$ to manufacture and sell like 4 years ago lmao.shits in an incredibly old node using cheap Samsung foundry’s. The switch 1 was a rip off, incredibly so especially this late in its life cycle since it maintained its msrp essentially. \n\nThe switch 2is more overpriced hardware and now overpriced software as well. Those Pokémon games just cost so much money to develop ya know. Reusing 80% of their assets and using animation and graphic quality from the late 2000s.\n\nNo one should ever defend Nintendo from a value proposition. We can argue their games are silly fun. But they are no powerhouse of quality and innovation for the most part.",
          "score": 2,
          "created_utc": 1743716238.0,
          "replies": [
            {
              "id": "ml9xvoz",
              "author": "trusty20",
              "body": "I am noticing a LOT of comments, and I mean a shit ton, that sure do seem pretty triggered by this release, and I find that interesting more than anything. Like if this console is no big deal these accounts sure seem pretty worked up about spamming every thread with just about every angle possible to minimize it lol",
              "score": 12,
              "created_utc": 1743717608.0,
              "replies": [
                {
                  "id": "mla5388",
                  "author": "AlekBalderdash",
                  "body": "I just want to be excited about a cool thing with people.\n\nThis negativity is really annoying  :/\n\nNew consoles have to cost *something*.  We've known it was coming for months.  So save a few bucks every month and spread out the cost.",
                  "score": -8,
                  "created_utc": 1743720117.0,
                  "replies": [
                    {
                      "id": "mla9dnq",
                      "author": "Key_Amazed",
                      "body": "The internet does not allow you to be excited about anything. The internet is where reactionary people flock to so they can rage farm for brownie points, or if they're a streamer or YouTuber, money and reputation. It's filled with people who only want things to fail to justify their misery.",
                      "score": 5,
                      "created_utc": 1743721590.0,
                      "replies": [
                        {
                          "id": "mlakmgs",
                          "author": "AlekBalderdash",
                          "body": "Bring on the downvotes!  Come at me bro!",
                          "score": -3,
                          "created_utc": 1743725617.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ml9qon4",
          "author": "Travelingman9229",
          "body": "Starfox 64 was $80 on release over 20 years ago",
          "score": -3,
          "created_utc": 1743715264.0,
          "replies": [
            {
              "id": "ml9rimx",
              "author": "clichepioneer",
              "body": "Didn't that also have the pack in Rumble Pak? So like a game & a 20-30 peripheral? ",
              "score": 14,
              "created_utc": 1743715531.0,
              "replies": []
            },
            {
              "id": "ml9rjl5",
              "author": "CosmicChar1ey",
              "body": "With a rumble pack, correct?",
              "score": 8,
              "created_utc": 1743715540.0,
              "replies": [
                {
                  "id": "ml9ry7f",
                  "author": "Travelingman9229",
                  "body": "Ok, so let’s say Starfox was a $60 value back then… it makes sense that this jump will take place at some point.",
                  "score": -10,
                  "created_utc": 1743715673.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ml9w0im",
              "author": "None",
              "body": "80$ in 1997 is equivalent to 159$ today. The price increase sucks but the cost of games has gone down.",
              "score": 4,
              "created_utc": 1743716991.0,
              "replies": [
                {
                  "id": "mla2906",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 0,
                  "created_utc": 1743719114.0,
                  "replies": [
                    {
                      "id": "mla9l33",
                      "author": "WFlumin8",
                      "body": "Average wages in the US have kept up with inflation since 1997. Minimum wage hasn’t. The average non minimum wage worker is paying significantly less for video games. This is easily verifiable information. You’re misinformed and spreading misinformation. \n\nhttps://www.bls.gov/bls/news-release/realer.htm",
                      "score": -6,
                      "created_utc": 1743721661.0,
                      "replies": [
                        {
                          "id": "mldqpsj",
                          "author": "GokuBlack722",
                          "body": "You are correct, thank you for correcting me on this I was definitely conflating average wages with minimum wage. I’ll go ahead and delete my previous comment.",
                          "score": 1,
                          "created_utc": 1743777642.0,
                          "replies": []
                        },
                        {
                          "id": "mlawnz7",
                          "author": "MetalstepTNG",
                          "body": "Inflation is underreported. Take a look at home prices, cars, and groceries, then tell me median individual income has kept up.",
                          "score": 0,
                          "created_utc": 1743730139.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mlawv8g",
                  "author": "MetalstepTNG",
                  "body": "1) Games were more complete on release. At least the prices were justifiable. Also, games didn't average $80.\n\n\n2) Median income hasn't kept up with average prices.",
                  "score": -2,
                  "created_utc": 1743730215.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ml9t66d",
              "author": "gregallen1989",
              "body": "The gaming industry was way different 20 years ago. There are hundreds of millions of more gamers now. Starfox sold 1 million total copies. If a first party Nintendo game did that today it would be a colossal failure.",
              "score": 2,
              "created_utc": 1743716068.0,
              "replies": [
                {
                  "id": "mlb7dzi",
                  "author": "thepoga",
                  "body": "Also costs many more times to develop a game now.",
                  "score": 2,
                  "created_utc": 1743734206.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ml9s5zu",
              "author": "chuckms6",
              "body": "Most AAA games were without peripherals.",
              "score": 1,
              "created_utc": 1743715744.0,
              "replies": []
            },
            {
              "id": "ml9x80v",
              "author": "None",
              "body": "[deleted]",
              "score": -1,
              "created_utc": 1743717389.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mlbjsdg",
          "author": "Luxuriosa_Vayne",
          "body": "you can't actually believe it'll run ray tracing at acceptable fps lmao",
          "score": 1,
          "created_utc": 1743739445.0,
          "replies": [
            {
              "id": "mlcvyda",
              "author": "ThatDandyFox",
              "body": "No but I also didn't believe it would cost as much as a steam deck, so I'm open to surprises.",
              "score": 0,
              "created_utc": 1743766489.0,
              "replies": [
                {
                  "id": "mle2nbp",
                  "author": "Luxuriosa_Vayne",
                  "body": "What's the price of it?",
                  "score": 1,
                  "created_utc": 1743781194.0,
                  "replies": [
                    {
                      "id": "mle36lp",
                      "author": "ThatDandyFox",
                      "body": "Switch 2: $449\n\nSteam deck lcd: $399\n\nSteam deck oled: $549",
                      "score": 1,
                      "created_utc": 1743781353.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ml9ptk0",
          "author": "Opetyr",
          "body": "Supporting is kinda worthless. Also probably will be 120hz because it is only 24 real frames and 96 fake frames which will mean a really bad latency. It will probably also have games at a real 780p but smeared to 4k. It will look good when you stand still but will look bad with any real movement.",
          "score": -12,
          "created_utc": 1743714991.0,
          "replies": [
            {
              "id": "ml9qglo",
              "author": "fmaz008",
              "body": "I thought the Switch2 didn't support framegen?",
              "score": 8,
              "created_utc": 1743715193.0,
              "replies": []
            },
            {
              "id": "mlb8eq2",
              "author": "PIO_PretendIOriginal",
              "body": "The article says that framegen is not supported.",
              "score": 1,
              "created_utc": 1743734607.0,
              "replies": []
            },
            {
              "id": "ml9spe3",
              "author": "HatefulSpittle",
              "body": "My god, that is the worst description of dlss 4 mfg I've ever seen. Go and watch a digital foundry video on it before you start your reddit lecture series.",
              "score": 1,
              "created_utc": 1743715917.0,
              "replies": []
            },
            {
              "id": "ml9s21q",
              "author": "yogopig",
              "body": "Whats your source on this?",
              "score": 1,
              "created_utc": 1743715707.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ml9q63z",
          "author": "a_sonUnique",
          "body": "Well if the games take longer to develop because there is more power from the console it’ll cost more to develop the games so they need to sell them at a higher price to cover costs.",
          "score": -8,
          "created_utc": 1743715101.0,
          "replies": [
            {
              "id": "ml9qnyw",
              "author": "ThatDandyFox",
              "body": "Some Pc games are just now broaching $70 and the limit is truly the sky there.\n\n$80 for console games that never go on sale or drop in price is insane.",
              "score": 3,
              "created_utc": 1743715258.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mlbpy36",
      "author": "SheevPalps_",
      "body": "There it is, I bet any claims they make on fps will be woth dlss on (which I guess isn't the biggest deal for singleplayer handheld games, but still seems disingenuous)",
      "score": 2,
      "created_utc": 1743742356.0,
      "replies": [
        {
          "id": "mlcgkzo",
          "author": "WolfyTn615",
          "body": "Not everyone likes playing 100% handheld.. I’ve had my old Switch docked 96% of its life",
          "score": 3,
          "created_utc": 1743757951.0,
          "replies": [
            {
              "id": "mlcp0ox",
              "author": "SheevPalps_",
              "body": "That doesn't change that many people use it as a portable console though. If anything it is competing with the Steam Deck and PS5/Xbox",
              "score": 1,
              "created_utc": 1743763072.0,
              "replies": [
                {
                  "id": "mlcttj6",
                  "author": "WolfyTn615",
                  "body": "Theyll never be able to compete w steam deck lol this launch proves it alone.. they’re over charging for outdated tech and only have one first party game smh.. no one buys Nintendo to play 3rd party shit",
                  "score": 1,
                  "created_utc": 1743765497.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mldbf12",
      "author": "yowsaSC2",
      "body": "No one cares when it will cost 700 because a chito made poor choices",
      "score": 2,
      "created_utc": 1743772665.0,
      "replies": []
    },
    {
      "id": "mla9bbj",
      "author": "Godzirrraaa",
      "body": "I say I’m ten times faster than I used to be, prove me wrong.",
      "score": 3,
      "created_utc": 1743721567.0,
      "replies": [
        {
          "id": "mlepf0v",
          "author": "TheLastNameR",
          "body": "In bed. Yeah I believe it.\n\n\n\nSorry bro you left yourself wide open for that.",
          "score": 4,
          "created_utc": 1743788026.0,
          "replies": []
        },
        {
          "id": "mlcgmad",
          "author": "WolfyTn615",
          "body": "I’m not 🤣 I’m getting old",
          "score": 1,
          "created_utc": 1743757976.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlae4za",
      "author": "YZYSZN1107",
      "body": "not sure I need this just to check my turnip prices every day.",
      "score": 3,
      "created_utc": 1743723259.0,
      "replies": [
        {
          "id": "mlcg9xa",
          "author": "WolfyTn615",
          "body": "Well with no word of Animal Crossing 2 (or any other RPG first party game) you may be comfortable where you’re at for now lol and new DK preview doesn’t look good at all so far btw.. DK 64 had heart and soul.. this one looks like a watered down money grab \n\n“bUt I cAN sMaSh StUfF!”",
          "score": 1,
          "created_utc": 1743757751.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlaozze",
      "author": "jacksonkr_",
      "body": "But can it play crisis?",
      "score": 3,
      "created_utc": 1743727245.0,
      "replies": []
    },
    {
      "id": "mlacdzj",
      "author": "Optimus_Prime_Day",
      "body": "I'm gonna get one. Fuck it.\n\nThat DK game looked pretty fun and I'm interested in MK open world stuff.",
      "score": 5,
      "created_utc": 1743722634.0,
      "replies": [
        {
          "id": "mldd5ow",
          "author": "Soul-Burn",
          "body": "Honestly, wishing you a great time with it.\n\n\nNintendo has their own niche you can't get anywhere else (ignoring the high seas), so many people value them favorably.",
          "score": 1,
          "created_utc": 1743773273.0,
          "replies": []
        },
        {
          "id": "mlch0j7",
          "author": "WolfyTn615",
          "body": "I respect your opinion, honestly I do, but from what I seen of the new DK game looked bland like it didn’t have heart.. Spiritual DK 64 this is not unfortunately and this game alone doesn’t sell me of Switch 2..\n\nHell, without reworked years old 3rd party games, their lineup is the worst ive ever seen.. how could they not be prepared with a new Mario 3D adventure.. I get Zelda cuz of the 2D one that just came out.. but come on Nintendo",
          "score": 1,
          "created_utc": 1743758237.0,
          "replies": [
            {
              "id": "mlcyn19",
              "author": "Optimus_Prime_Day",
              "body": "I watched a 30 minute gameplay demo and it actually looks really fun. Based on the base move sets and how the ground sturdyness reacts in the world, I can tell Nintendo will have some very clever usage of it as the game progresses. The ign guys say it totally feels like Mario odyssey 2 in terms of gameplay.\n\nThe IGN metroid prime 4 gameplay demo also looked great. I thought the graphics were plain until I watched the s2 edition gameplay in more depth, and I've been dying for a true prime gameplay again.",
              "score": 1,
              "created_utc": 1743767664.0,
              "replies": [
                {
                  "id": "mlczw02",
                  "author": "WolfyTn615",
                  "body": "Haven’t seen the demo.. I hope ur right!",
                  "score": 1,
                  "created_utc": 1743768194.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mla6g1a",
      "author": "crom_laughs",
      "body": "and 10x more expensive than Switch 1 thanks to tariffs.\n\nI feel so Liberated",
      "score": 3,
      "created_utc": 1743720584.0,
      "replies": [
        {
          "id": "mlbz3pr",
          "author": "Readiness11",
          "body": "Why do you want to buy a console from the game company equivalent of Trump anyways?",
          "score": -3,
          "created_utc": 1743747260.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlbbsbs",
      "author": "LiliGooner_",
      "body": ">Nvidia confirms\n\nSo it's a lie.",
      "score": 2,
      "created_utc": 1743735971.0,
      "replies": []
    },
    {
      "id": "mla9mc8",
      "author": "None",
      "body": "[deleted]",
      "score": 2,
      "created_utc": 1743721673.0,
      "replies": [
        {
          "id": "mlbrnw4",
          "author": "Mother_Restaurant188",
          "body": "Split Fiction, Elden Ring, Cyberpunk, and Borderlands 4 all had footage from the Direct.\n\nIsn’t that exactly Steam Deck territory?",
          "score": 3,
          "created_utc": 1743743222.0,
          "replies": [
            {
              "id": "mlbrzj4",
              "author": "None",
              "body": "[deleted]",
              "score": -1,
              "created_utc": 1743743389.0,
              "replies": [
                {
                  "id": "mleh5ia",
                  "author": "Mother_Restaurant188",
                  "body": "That’s great. I wonder how much your PC setup costs though? And is it a laptop or portable like a Steam Deck or Switch?\n\nPersonally I almost always play on the go. Only ever docked my Switch when playing local multiplayer.\n\nSo Switch/handheld is my personal way to go + I tend to like Nintendo’s exclusives.",
                  "score": 2,
                  "created_utc": 1743785568.0,
                  "replies": []
                },
                {
                  "id": "mlcgqa2",
                  "author": "WolfyTn615",
                  "body": "You mean you don’t wanna rebuy games that makes you retrain your mind on button configurations for no reason??? Ur insane.. can’t wait to see Cyberpunk playing on this lol",
                  "score": -1,
                  "created_utc": 1743758049.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ml9up0y",
      "author": "Supermkcay",
      "body": "Interesting",
      "score": 1,
      "created_utc": 1743716566.0,
      "replies": []
    },
    {
      "id": "mla9eof",
      "author": "Majorjim_ksp",
      "body": "Is that 10X faster or 10X DLSS/frame gen faster?",
      "score": 1,
      "created_utc": 1743721599.0,
      "replies": []
    },
    {
      "id": "mla9gos",
      "author": "MissionKale",
      "body": "April foolzz",
      "score": 1,
      "created_utc": 1743721619.0,
      "replies": []
    },
    {
      "id": "mladrw8",
      "author": "Mechagouki1971",
      "body": "Did Nvidia happen to memtion if they've included an unpatchable hardware exploit on this new hardware?",
      "score": 1,
      "created_utc": 1743723129.0,
      "replies": []
    },
    {
      "id": "mlaq92f",
      "author": "Knudson95",
      "body": "P",
      "score": 1,
      "created_utc": 1743727710.0,
      "replies": []
    },
    {
      "id": "mlar9tq",
      "author": "BigDaddyPage",
      "body": "So it might actually run Minecraft decently?",
      "score": 1,
      "created_utc": 1743728095.0,
      "replies": []
    },
    {
      "id": "mlarof8",
      "author": "None",
      "body": "Sniff sniff... yup",
      "score": 1,
      "created_utc": 1743728248.0,
      "replies": []
    },
    {
      "id": "mlasdl9",
      "author": "HeyGeneralKenobi",
      "body": "It just works :D",
      "score": 1,
      "created_utc": 1743728512.0,
      "replies": []
    },
    {
      "id": "mlaux9o",
      "author": "BipedalWurm",
      "body": "and only 25 times more power hungry",
      "score": 1,
      "created_utc": 1743729480.0,
      "replies": []
    },
    {
      "id": "mlb0woe",
      "author": "None",
      "body": "Does this news more or less seal the deal that Switch 2 probably won't be powerful enough to run GTA 6?",
      "score": 1,
      "created_utc": 1743731738.0,
      "replies": []
    },
    {
      "id": "mlb6qwe",
      "author": "swaite",
      "body": "If only I knew what any of those words meant 🤤",
      "score": 1,
      "created_utc": 1743733957.0,
      "replies": [
        {
          "id": "mlbbxcy",
          "author": "PIO_PretendIOriginal",
          "body": "Here is the simplest I can dum it down too.\n\nG-sync makes games not stutter (lag).\n\nDlss improves image quality.",
          "score": 0,
          "created_utc": 1743736028.0,
          "replies": [
            {
              "id": "mlbpfo2",
              "author": "Zakatikus",
              "body": "Gsync reduces screen tearing effects, has nothing to do with stutter or lag",
              "score": 1,
              "created_utc": 1743742107.0,
              "replies": [
                {
                  "id": "mlgiewm",
                  "author": "PIO_PretendIOriginal",
                  "body": "If you have a game running at 51fps on a 60hz fixed framerate monitor, it will cause uneven frame-pacing. Uneven framepacing looks like stutter. (Edit: keep in mind this is whithin the context of many consoles trying to force V-sync, even if they cant hold that v-sync framerate, which also massively increases latency)\n\nIts why most 60hz tvs have “motion smoothing” for 24fps movies. Because otherwise you end up with a 3:2 pull down, which looks like stutter (I personally always turn motion smoothing off, as I think it looks awful, and I have a 120hz tv which does divide evenly into 24fps).\n\nYes screen tearing is also caused by a mismatch between the monitor framerate and GPU target, but I didnt mention it as the word “screen tearing” is technical jargon that the average street person doesn’t know. \n\nIf I told my mom “g-sync matches the GPU framerate to the monitor, this improves uneven frame-pacing, and removes image tearing….. however make sure you cap your framerate to 5fps below your monitors refresh rate to stay within the monitors refresh rate, this also keeps latency lower in a similar way to nvidia reflex”……… my moms response would be “match the what to the what now, it makes the game tear less? Whats a tear?”. \n\nWhere as if I just say “it make game look smoother”, then thats a simple enough explanation. And on a handheld like switch 2, the console will automatically handle all the g-sync settings. So the technical breakdown and jargon will just confuse many console players.",
                  "score": 1,
                  "created_utc": 1743808955.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mlbg95u",
      "author": "haarschmuck",
      "body": "Doesn't matter when games are already being listed for $80 for the handheld.",
      "score": 1,
      "created_utc": 1743737863.0,
      "replies": [
        {
          "id": "mlbyvow",
          "author": "ahzzyborn",
          "body": "$80 is not that bad considering how little games have gone up over the last several decades",
          "score": 1,
          "created_utc": 1743747147.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlbwhna",
      "author": "dimaveshkin",
      "body": "Then why did no one seem to use the DLSS in the games features in the presentation? Graphics were very aliased.",
      "score": 1,
      "created_utc": 1743745804.0,
      "replies": []
    },
    {
      "id": "mlc1s0m",
      "author": "mangelito",
      "body": "I really don't like Nintendo but it's the only gaming platform where I can get good games for my younger kids to play. So I'm quite excited that it seems to be a big jump hardware wise",
      "score": 1,
      "created_utc": 1743748578.0,
      "replies": []
    },
    {
      "id": "mlc5phj",
      "author": "MulleDK19",
      "body": "Cool, so it's like 50% faster.",
      "score": 1,
      "created_utc": 1743750870.0,
      "replies": []
    },
    {
      "id": "mlc89me",
      "author": "esadatari",
      "body": "Lmao that’s okay, I can’t think of a single Nintendo made game that’s ever been anywhere near on par with modern games.\n\nSo like.. wasted hardware but go off.",
      "score": 1,
      "created_utc": 1743752520.0,
      "replies": []
    },
    {
      "id": "mlcdc6e",
      "author": "None",
      "body": "So, it’s still behind then?",
      "score": 1,
      "created_utc": 1743755837.0,
      "replies": []
    },
    {
      "id": "mlcdjke",
      "author": "ShotofHotsauce",
      "body": "Here we go with the Nvidia marketing train again. Choo-choo!",
      "score": 1,
      "created_utc": 1743755967.0,
      "replies": []
    },
    {
      "id": "mlcfrxx",
      "author": "None",
      "body": "There are many ways to manipulate this type of benchmarking.\n\nThe GPU in Switch 2 ( if leaks are true ) is basically a HEAVILY cut down 3050 which is almost a 5 year old design. 12gb is nice but this is not even GDDR6 performance memory. It's attached to what is basically a small weak mobile phone CPU.\n\nNeither console has anything modern or powerful. This 10x claim i guarantee is being bottlenecked by memory or some other metric. Basically, Nvidia misleading claims as usual.",
      "score": 1,
      "created_utc": 1743757422.0,
      "replies": []
    },
    {
      "id": "mlcg1u9",
      "author": "AyyyyLeMeow",
      "body": "Since Nintendo fans are the target audience, they'll believe it...",
      "score": 1,
      "created_utc": 1743757604.0,
      "replies": []
    },
    {
      "id": "mlci3zr",
      "author": "lolschrauber",
      "body": "That'd explain the 4k 60 fps claims.\n\nFrame gen will feel like dog shit with low base framerate though. Especially if multi frame gen is used.",
      "score": 1,
      "created_utc": 1743758944.0,
      "replies": []
    },
    {
      "id": "mlcinmh",
      "author": "fullmetalalchymist9",
      "body": "Imagine paying so much money for these games that are basically just the same as switch 1 games but with upscaling programed into them ROFL. Nintendo is gonna get them fan boys good.",
      "score": 1,
      "created_utc": 1743759294.0,
      "replies": []
    },
    {
      "id": "mlcljcd",
      "author": "Designer_Lake_5111",
      "body": "Nvidia lies yet again",
      "score": 1,
      "created_utc": 1743761058.0,
      "replies": []
    },
    {
      "id": "mlcn7gs",
      "author": "PsyJak",
      "body": "And yet is still not worth it",
      "score": 1,
      "created_utc": 1743762053.0,
      "replies": []
    },
    {
      "id": "mlcpgxk",
      "author": "Wiggles69",
      "body": "For the price they are asking it would fucking want to be.",
      "score": 1,
      "created_utc": 1743763314.0,
      "replies": []
    },
    {
      "id": "mlctcum",
      "author": "TheRedFurios",
      "body": "Unfortunately people will buy it",
      "score": 1,
      "created_utc": 1743765277.0,
      "replies": []
    },
    {
      "id": "mlcxll3",
      "author": "EatTheRichbish",
      "body": "But the battery life… gross",
      "score": 1,
      "created_utc": 1743767217.0,
      "replies": []
    },
    {
      "id": "mlcxxyv",
      "author": "Sandokan13",
      "body": "Switch 2 faster than a  rtx 4090. Trust me, I wear shiny kid  jackets.",
      "score": 1,
      "created_utc": 1743767366.0,
      "replies": []
    },
    {
      "id": "mlcypf3",
      "author": "Roxelchen",
      "body": "And I will happily buy the OLED Version one or two years later",
      "score": 1,
      "created_utc": 1743767692.0,
      "replies": []
    },
    {
      "id": "mldmykr",
      "author": "ffffff00000066ff33",
      "body": "Just half the battery life too.",
      "score": 1,
      "created_utc": 1743776488.0,
      "replies": []
    },
    {
      "id": "mle4arl",
      "author": "Doppelkammertoaster",
      "body": "Probably takes twice as much battery power and still has no way to remove the battery and use it without.",
      "score": 1,
      "created_utc": 1743781682.0,
      "replies": []
    },
    {
      "id": "mledix9",
      "author": "Infamous-Metal-103",
      "body": "Sucks that they didn't give it frame gen.30fps is awful ",
      "score": 1,
      "created_utc": 1743784473.0,
      "replies": []
    },
    {
      "id": "mlehw3h",
      "author": "spaceocean99",
      "body": "![gif](giphy|b0E3PPld4558irObaY)",
      "score": 1,
      "created_utc": 1743785786.0,
      "replies": []
    },
    {
      "id": "mlg2wal",
      "author": "XuX24",
      "body": "I wonder what might happen if the switch performs good if it will make Sony or Microsoft switch to nvidia.",
      "score": 1,
      "created_utc": 1743803410.0,
      "replies": []
    },
    {
      "id": "mlgl3ls",
      "author": "endresz",
      "body": "Pixel count is 4k is 9x720p so using the dock you should be able to achieve switch level graphics rendered at 4k, with an 11% increase in frame rate!",
      "score": 1,
      "created_utc": 1743809945.0,
      "replies": []
    },
    {
      "id": "mlk9cw3",
      "author": "Illustrious-Slice-91",
      "body": "Something to convince us when they raise the price by $200",
      "score": 1,
      "created_utc": 1743871085.0,
      "replies": []
    },
    {
      "id": "ml9wdnx",
      "author": "winniekawaii",
      "body": "That's about 5080 performance /s",
      "score": 1,
      "created_utc": 1743717111.0,
      "replies": []
    },
    {
      "id": "mla072g",
      "author": "hitsujiTMO",
      "body": "I initially thought they would have gone with Orin for the architecture for the Switch 2 as Nvidia tends to go with already established chips, but this whole 10X doesn't make sense if they did.\n\nEven with DLSS and frame gen trickery, ampere just doesn't make that 10X leap. You'd be expecting to run 30+W on Orin for that.\n\nIt looks like they actually might have held out for Thor and using Blackwell. Especially if they are boasting Ray Tracing. Very unusual for Nintendo to go with cutting edge.",
      "score": 1,
      "created_utc": 1743718399.0,
      "replies": [
        {
          "id": "mlahuda",
          "author": "Arikadoo",
          "body": "I saw somewhere the switch 2 docked would run on 40w",
          "score": 3,
          "created_utc": 1743724587.0,
          "replies": [
            {
              "id": "mlajrvp",
              "author": "hitsujiTMO",
              "body": "There's a cooling fan alright in the dock, but I wouldn't expect reliance on an external fan when docked. Adds a lot of complications.",
              "score": 0,
              "created_utc": 1743725300.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mlbbdee",
          "author": "PIO_PretendIOriginal",
          "body": "Probably 5x raw performance.\n\n10x with dlss upscaling (switch 2 doesn’t support framegen, as mentioned in the article)",
          "score": 2,
          "created_utc": 1743735802.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlajpvb",
      "author": "DoubleShot027",
      "body": "Ray tracing on a switch. Bet this thing performs the same as a 4090 too!",
      "score": 1,
      "created_utc": 1743725279.0,
      "replies": []
    },
    {
      "id": "mlal3qa",
      "author": "ghostpicnic",
      "body": "Yeah… they’ve said a lot of things recently, haven’t they?",
      "score": 1,
      "created_utc": 1743725796.0,
      "replies": []
    },
    {
      "id": "mlaznwi",
      "author": "EvoSphinx",
      "body": "Every time a new console is revealed,they talk so much about how much faster and more powerful it is than the last and it means almost nothing when you actually get to using it.",
      "score": 1,
      "created_utc": 1743731279.0,
      "replies": []
    },
    {
      "id": "mlb1btj",
      "author": "esmelusina",
      "body": "So… 1.2 times faster, got it.",
      "score": 1,
      "created_utc": 1743731893.0,
      "replies": []
    },
    {
      "id": "mlbx2kb",
      "author": "CloudPeels",
      "body": "So it's 2.5x faster?",
      "score": 1,
      "created_utc": 1743746129.0,
      "replies": []
    },
    {
      "id": "mlcr7kn",
      "author": "ToMorrowsEnd",
      "body": "so its still slower than a 3 year old Steam deck, and 9000% slower than any modern handheld. Have they at least finally started using quality joysticks that will not drift?",
      "score": 1,
      "created_utc": 1743764220.0,
      "replies": [
        {
          "id": "mldcsqg",
          "author": "Soul-Burn",
          "body": "Hall effect joysticks was indicated, but not confirmed.",
          "score": 1,
          "created_utc": 1743773149.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ml9wpdc",
      "author": "Grieveruz",
      "body": "Tldr: Trust me bro",
      "score": 0,
      "created_utc": 1743717217.0,
      "replies": []
    },
    {
      "id": "mlaabjv",
      "author": "MinimumArmadillo2394",
      "body": "Still costs too much. Still has too little battery. Still has games that cost too much.",
      "score": 0,
      "created_utc": 1743721915.0,
      "replies": [
        {
          "id": "mlajrk1",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1743725296.0,
          "replies": [
            {
              "id": "mlar0my",
              "author": "MinimumArmadillo2394",
              "body": "Because Nintendo has very few games that most people would be interested in.\n\nI can count on 1 hand how many games I was interested in and purchased for my switch that I bought shortly after launch.\n\nYou expect me to pay the same price as a graphics card to play a handful of games over a period of 5-7 years? You gotta be kidding me.\n\nComparing it to an also overpriced system doesnt help you.\n\nI can buy an entire PC for that much that can play at 1080 60 fps while this switch 2 can maybe reach 1080 30fps for at most 4 hours.",
              "score": -4,
              "created_utc": 1743727998.0,
              "replies": [
                {
                  "id": "mlb8glm",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 5,
                  "created_utc": 1743734628.0,
                  "replies": [
                    {
                      "id": "mlcjd0y",
                      "author": "MinimumArmadillo2394",
                      "body": "My point wasnt that only a few people are interested in all of their products. My point was that most people are only interested in a few of their products.",
                      "score": 1,
                      "created_utc": 1743759740.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mlbut9p",
      "author": "Glad_Atmosphere_6492",
      "body": "10x faster 'with AI', not 10x faster.\n\nJust like the 5070 has 4090 performance. What a joke of a company.",
      "score": 0,
      "created_utc": 1743744891.0,
      "replies": [
        {
          "id": "mlcsd5t",
          "author": "Prodigle",
          "body": "A 10x raw performance increase is easily believable. The switch 1 was using underpowered and old GPU hardware even for the time",
          "score": 2,
          "created_utc": 1743764801.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mla94y1",
      "author": "kr4ckenm3fortune",
      "body": "Lmao...how much you all wanna bet there going to be shitton of rma of overheating and brunt sockets?",
      "score": 0,
      "created_utc": 1743721506.0,
      "replies": []
    },
    {
      "id": "mlb3sol",
      "author": "kegastam",
      "body": "nintendo supporters are just like maga crowd, getting into a hype with no vision, no context and only \"feeelings\"",
      "score": 0,
      "created_utc": 1743732826.0,
      "replies": [
        {
          "id": "mlbz0m3",
          "author": "ahzzyborn",
          "body": "Considering the original switch was one of the best gaming systems ever made, I think people rightfully deserve to hype the sequel",
          "score": 2,
          "created_utc": 1743747216.0,
          "replies": []
        },
        {
          "id": "mlbz1l1",
          "author": "ahzzyborn",
          "body": "Considering the original switch was one of the best gaming systems ever made, I think people rightfully deserve to hype the sequel",
          "score": 1,
          "created_utc": 1743747231.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlahves",
      "author": "Radgris",
      "body": "0 times 10 is still 0",
      "score": -1,
      "created_utc": 1743724599.0,
      "replies": []
    },
    {
      "id": "mla0ye3",
      "author": "None",
      "body": "[deleted]",
      "score": -5,
      "created_utc": 1743718664.0,
      "replies": [
        {
          "id": "mla4laa",
          "author": "GokuBlack722",
          "body": "As someone who loves their Steam Deck, shitting on the power of the Switch 2 and then praising the Steam Deck is pretty hilarious. With the Switch 2’s specs it looks like it’ll be on par or more powerful than the Steam Deck is. And the Switch 2 has a higher resolution 1080p screen with a higher 120hz refresh rate. Of course the Steam Deck has the Switch 2 beat in terms of customizability, utility, game prices and the option for an OLED screen but clearly the Switch 2 has the Steam Deck beat on the hardware side. Both are powerful in their own ways.",
          "score": 5,
          "created_utc": 1743719943.0,
          "replies": [
            {
              "id": "mla7c3f",
              "author": "None",
              "body": "[deleted]",
              "score": -3,
              "created_utc": 1743720885.0,
              "replies": [
                {
                  "id": "mlaafy9",
                  "author": "Dt2_0",
                  "body": "Then why the heck are you even here? If you were never in the market in the first place, why bother to comment?",
                  "score": 5,
                  "created_utc": 1743721957.0,
                  "replies": []
                },
                {
                  "id": "mladpw2",
                  "author": "Indifferent9007",
                  "body": "So you’re hating on stuff you have no vested interest in, that’s just sad lol.",
                  "score": 5,
                  "created_utc": 1743723109.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ml9ra1e",
      "author": "Moscato359",
      "body": "10 times faster than original switch with 10x frame gen, right?",
      "score": -3,
      "created_utc": 1743715454.0,
      "replies": []
    },
    {
      "id": "mla0kqy",
      "author": "dramafan1",
      "body": "Specs never seemed to matter as much for Nintendo devices but it does seem pretty disappointing on paper especially compared to other gaming consoles with similar prices.\n\nGaming consoles are supposed to be powerful upon release so it can handle future games that require more power and performance. Otherwise developers have to make use of the console’s limits for a good couple years until the next iteration.",
      "score": -2,
      "created_utc": 1743718532.0,
      "replies": [
        {
          "id": "mla6ob2",
          "author": "W4mbo",
          "body": "For a handheld I think this thing is actually really impressive. It's kind of unfair to compare it to other big stationary consoles that consume about 10x the power. While true it might not handle future AAA games well I would generally not even consider buying a Nintendo console for those types of games.",
          "score": 13,
          "created_utc": 1743720663.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mla46y4",
      "author": "Dandri1211",
      "body": "It was so disappointing buying TotK for my og switch I bought May 2017 and it couldn’t even play it at 30 fps. How will this one hold up in a few years?",
      "score": 0,
      "created_utc": 1743719802.0,
      "replies": []
    },
    {
      "id": "mlalkep",
      "author": "CareApart504",
      "body": "X",
      "score": 0,
      "created_utc": 1743725968.0,
      "replies": []
    },
    {
      "id": "mlbiqrm",
      "author": "Mehhish",
      "body": "I wanna believe, but, it's NVIDIA, so there is most likely some huge ass asterisk somewhere!",
      "score": 0,
      "created_utc": 1743738971.0,
      "replies": []
    },
    {
      "id": "mlbjsl7",
      "author": "robohazard1",
      "body": "I guess Linus doesn’t have to eat the old Nintendo cereal after all.",
      "score": 0,
      "created_utc": 1743739448.0,
      "replies": []
    },
    {
      "id": "mlbwx72",
      "author": "None",
      "body": "Will need this independently verified if that’s even possible these days",
      "score": 0,
      "created_utc": 1743746047.0,
      "replies": []
    },
    {
      "id": "mlc9obr",
      "author": "MrSkavenger",
      "body": "Why does is matter? Just gonna be old ass remastered games for $90. Why does it need to be any better lmao. Not like people will be playing gta 6 on this.",
      "score": 0,
      "created_utc": 1743753426.0,
      "replies": []
    },
    {
      "id": "mle007n",
      "author": "Kanguin",
      "body": "Wow so it has the power of 10 potatoes (with dlss enabled)",
      "score": 0,
      "created_utc": 1743780406.0,
      "replies": []
    },
    {
      "id": "mla6a9p",
      "author": "Main-Algae-1064",
      "body": "And yet no one will be able to afford one except the dink gays.  And I’m one of them.   *bowser laugh*",
      "score": -1,
      "created_utc": 1743720530.0,
      "replies": []
    },
    {
      "id": "ml9x5qc",
      "author": "MessiahPrinny",
      "body": "As much as I doubt Nvidia I have farts with more power than the Switch GPU. If it really is Ampere based it probably is ten times more powerful.",
      "score": -2,
      "created_utc": 1743717368.0,
      "replies": [
        {
          "id": "mla5a8k",
          "author": "eestionreddit",
          "body": "The Orin SOC's GPU (and presumably the Drake SOC in the Switch 2) has 8x the CUDA cores of the Tegra X1. 10x feels plausible once other factors are considered (clock speed, architecture, memory bandwidth).",
          "score": 2,
          "created_utc": 1743720185.0,
          "replies": []
        },
        {
          "id": "mla1cal",
          "author": "hitsujiTMO",
          "body": "I don't think it is. Power requirements would be too high for a handheld on Odin + Ampere for 10x, even with DLSS and FrameGen. I think they waited for Thor + Blackwell.",
          "score": 1,
          "created_utc": 1743718799.0,
          "replies": [
            {
              "id": "mluug7y",
              "author": "OwnWorker9521",
              "body": "It’s literally on ampere…",
              "score": 1,
              "created_utc": 1744030842.0,
              "replies": [
                {
                  "id": "mlv0c79",
                  "author": "hitsujiTMO",
                  "body": "Have you any source for that as it's 100% just been rumours to date on the actual architecture?",
                  "score": 1,
                  "created_utc": 1744033066.0,
                  "replies": [
                    {
                      "id": "mm9oztn",
                      "author": "OwnWorker9521",
                      "body": "Nvidia",
                      "score": 1,
                      "created_utc": 1744228471.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mla2e70",
      "author": "Kuli24",
      "body": "Rough calculation here.\n\nSwitch 1 is 0.5 teraflops of gpu power.  x10 = 5teraflops.\n\nPS5 is 10.28 teraflops and PS4 pro is 4.2 teraflops.\n\nSo we're basically getting a ps4 pro, which didn't support a heck of a lot of games at 4k.  I buy it.  That sounds very nintendo.",
      "score": -2,
      "created_utc": 1743719164.0,
      "replies": [
        {
          "id": "mlbb6hq",
          "author": "PIO_PretendIOriginal",
          "body": "I have a feeling its more like 2flops, and nvidia are just saying 10x because of DLSS upscaling(switch 2 does not have framegen)",
          "score": 3,
          "created_utc": 1743735723.0,
          "replies": [
            {
              "id": "mldpvyj",
              "author": "Kuli24",
              "body": "even more likely, i agree.",
              "score": 1,
              "created_utc": 1743777389.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mla4nxi",
          "author": "a_rabid_buffalo",
          "body": "To be fair does Nintendo games need to be 4k? The majority of people buying this are in it for first party games not call of duty or borderlands etc. these games will be fine upscaled for years to come as long as they can hit 60fps.",
          "score": 4,
          "created_utc": 1743719968.0,
          "replies": [
            {
              "id": "mlarbyb",
              "author": "Kuli24",
              "body": "Well, games would look better in 4k.  Even games like mario 3d world and such.",
              "score": 1,
              "created_utc": 1743728117.0,
              "replies": [
                {
                  "id": "mlaruvb",
                  "author": "a_rabid_buffalo",
                  "body": "My point is that Mario doesn’t need to be in 4k would it be nice if it ran in native 4k but the ps5 and Xbox don’t even run AAA in native 4k and forget about 4k and 60 fps without some kind of upscaling. Nintendo has never been about graphics, and for the most part their cartoonish style tend to hold up as time goes by. These games will look fine upscale to 4k which the switch 2 will do.",
                  "score": 2,
                  "created_utc": 1743728317.0,
                  "replies": [
                    {
                      "id": "mldq0d6",
                      "author": "Kuli24",
                      "body": "Very true with upscale to 4k plus dlss.  Should be nice and crisp.",
                      "score": 1,
                      "created_utc": 1743777426.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mlaiwdl",
      "author": "clorox2",
      "body": "Nintendo fans hear ‘ya. Nintendo fans don’t care.",
      "score": -2,
      "created_utc": 1743724973.0,
      "replies": []
    },
    {
      "id": "ml9vagh",
      "author": "None",
      "body": "[deleted]",
      "score": -2,
      "created_utc": 1743716758.0,
      "replies": [
        {
          "id": "ml9xikj",
          "author": "gman5852",
          "body": "And most people complaining about it sound like they were born 12 years ago.",
          "score": 2,
          "created_utc": 1743717487.0,
          "replies": []
        }
      ]
    }
  ]
}