{
  "post": {
    "title": "AMD Radeon RX 9070 can be BIOS modded with XT firmware, surpasses reference RX 9070 XT when overclocked",
    "author": "chrisdh79",
    "id": "1jtk5gd",
    "score": 544,
    "created_utc": 1744029265.0,
    "selftext": "",
    "num_comments": 33,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jtk5gd/amd_radeon_rx_9070_can_be_bios_modded_with_xt/"
  },
  "comments": [
    {
      "id": "mlus008",
      "author": "None",
      "body": "[deleted]",
      "score": 139,
      "created_utc": 1744029889.0,
      "replies": [
        {
          "id": "mlv81ly",
          "author": "AnimalNo5205",
          "body": "It’s always a crap shoot, AMD wants to sell the cards as XTs but not all of them will pass validation. If it fails validation for a workload you don’t personally use though then you may have a fine experience flashing the non XT to an XT. It’s still safer for AMD to sell it as an non-XT though as any large scale RMAs would both cost a lot and be bad PR",
          "score": 106,
          "created_utc": 1744035630.0,
          "replies": [
            {
              "id": "mlzolot",
              "author": "kurotech",
              "body": "Yep just rebend cards I feel like that's amd 101 reminds me of the fx series lol",
              "score": 9,
              "created_utc": 1744091438.0,
              "replies": [
                {
                  "id": "mm0wxmr",
                  "author": "dead_fritz",
                  "body": "It's what they always done, Ryzen was the same with X skus. Nvidia has been known to do it too.",
                  "score": 4,
                  "created_utc": 1744116110.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mlwrala",
          "author": "diuturnal",
          "body": "We've possibly gone full cycle on CPU's too. You used to be able to unlock a fourth core on Athlon x3's, and now with Google's bug hunters doing their thing to Zen's microcode there's a possibility you could take an r5(rip the r3) to an r7 or higher.",
          "score": 13,
          "created_utc": 1744052499.0,
          "replies": [
            {
              "id": "mlzw2yj",
              "author": "DonutConfident7733",
              "body": "I used to unlock my Amd Phenom 2 550 Black Edition to Phenom 2 x4 B50 and it worked fine from 2009 to 2021 (still works even now). It unlocked two cores.(or equivalent of enabling hyper threading)",
              "score": 3,
              "created_utc": 1744095657.0,
              "replies": [
                {
                  "id": "mm160gx",
                  "author": "as_riel",
                  "body": "Same here. I vaguely recall the processor renaming to B55 in windows and bios after unlock",
                  "score": 2,
                  "created_utc": 1744119388.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mlwzbf3",
              "author": "jjayzx",
              "body": "AMD CPUs are chiplet based so you are physically limited. So no, you can't go higher.",
              "score": -5,
              "created_utc": 1744055005.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mlw2kbn",
          "author": "M2J9",
          "body": "It's possible with many cards.. in this case, the non XT cards has non functioning rdna cores (simplified explanation) that resulted in AMD not being able to guarantee that they could deliver on what was sold on the spec sheet.\n\nWhat will likely be the case is that 10% or so off these cards tend to work perfectly as a 9070xt, 50% don't work at all, and the rest might be semi stable for most workloads..",
          "score": 28,
          "created_utc": 1744045026.0,
          "replies": []
        },
        {
          "id": "mm6fzrr",
          "author": "Rock_Strongbro",
          "body": "the radeon 9500 could be modded via rivatuner to a 9700… good times",
          "score": 2,
          "created_utc": 1744186763.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mluvajx",
      "author": "trucorsair",
      "body": "I did this with Vega 56’s flashed with the Vega 64’s bios.  That and some power management (overclock & undervolt) was well worth the effort,  I used that configuration for quite a while.",
      "score": 42,
      "created_utc": 1744031173.0,
      "replies": [
        {
          "id": "mlv2yj1",
          "author": "richterlevania3",
          "body": "Indeed, and I sold mine after that to a Ethereum miner for 5 times what I paid for it after using it for 3 years. That card was a beast. HBM rules.",
          "score": 28,
          "created_utc": 1744033977.0,
          "replies": [
            {
              "id": "mlv7yu7",
              "author": "trucorsair",
              "body": "Exactly, Vega 56/64 was an underappreciated card",
              "score": 6,
              "created_utc": 1744035606.0,
              "replies": []
            },
            {
              "id": "mlw2tiu",
              "author": "M2J9",
              "body": "As long as you could keep that hbm cool lol.. it was a beast of a card and overclocked like crazy when water-cooled.",
              "score": 3,
              "created_utc": 1744045102.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mlxmx54",
          "author": "TheSchlaf",
          "body": "And the RX 5700 and the R9 290.  Seems to be common with ATI / AMD stuff.",
          "score": 1,
          "created_utc": 1744062460.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlwhst9",
      "author": "None",
      "body": "we are so back. where are my pencil mod vets at?",
      "score": 25,
      "created_utc": 1744049589.0,
      "replies": [
        {
          "id": "mlwnzui",
          "author": "thenerfviking",
          "body": "If you were smart you didn’t use a pencil, which questionably works. You went to AutoZone and you bought the conductive paint they make for repairing rear windshield defoggers. You then lay down electrical or painters tape so you don’t spill it, paint between the two points and once it dries you can break 1ghz.",
          "score": 16,
          "created_utc": 1744051494.0,
          "replies": [
            {
              "id": "mlwzn9t",
              "author": "Haelphadreous",
              "body": "The pencil trick was good for modifying voltages, you could lay a stripe down over a resistor to partially bridge it, usually to increase the voltage to your CPU, I always did it with a mechanical pencil and checked my values after literally every stripe so this video feels a bit haphazard but it covers things.\n\n[https://www.youtube.com/watch?v=ZCClCsJtSN0&t=19s](https://www.youtube.com/watch?v=ZCClCsJtSN0&t=19s)\n\nThe mask and conductive paint trick was usually to enable features on CPU's or GPU's that had been disabled by simply cutting a trace on the PCB. I tried to find a video of it but mostly what I got was a bunch of \"can you paint your motherboard?\" DIY \"computer mods\" content.",
              "score": 3,
              "created_utc": 1744055108.0,
              "replies": [
                {
                  "id": "mlx56wp",
                  "author": "thenerfviking",
                  "body": "You can pin mod with a pencil but the paint is much more reliable.",
                  "score": 4,
                  "created_utc": 1744056830.0,
                  "replies": [
                    {
                      "id": "mlxkb9w",
                      "author": "happy-cig",
                      "body": "As a 7th grader pencil was more reliable for me. ",
                      "score": 2,
                      "created_utc": 1744061602.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mlxsvtn",
              "author": "rpkarma",
              "body": "Still so wild that some conductive paint would unlock the multiplier haha\n\nI miss the Athlon XP days.",
              "score": 2,
              "created_utc": 1744064488.0,
              "replies": [
                {
                  "id": "mlxzbdl",
                  "author": "thenerfviking",
                  "body": "I mean it made sense, those were generally chips that didn’t pass QC to run at higher speeds. Back when you couldn’t even assume that someone would have more than one fan in their PC that kind of thing mattered more.",
                  "score": 2,
                  "created_utc": 1744066709.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mlwp7qa",
          "author": "MadMaui",
          "body": "I did that back in the day..\n\nWas it the Athlon Thunderbird CPU?",
          "score": 2,
          "created_utc": 1744051865.0,
          "replies": [
            {
              "id": "mm1ae6a",
              "author": "1911z",
              "body": "Did it with AMD Duron too!!! :D",
              "score": 1,
              "created_utc": 1744120842.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mlws7rn",
          "author": "Haelphadreous",
          "body": "Ahh those were the days. did you ever build tiny masks out of scotch tape and rebuild cut traces with conductive paint?",
          "score": 2,
          "created_utc": 1744052786.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlvatfw",
      "author": "shalol",
      "body": "Mom can we have 9070XT at MSRP\n\n\"We have 9070XT at MSRP at home\"\n\n9070XT at MSRP at home:",
      "score": 20,
      "created_utc": 1744036498.0,
      "replies": []
    },
    {
      "id": "mlywako",
      "author": "isthisagoodname69",
      "body": "What is the softwareeee",
      "score": 2,
      "created_utc": 1744078569.0,
      "replies": []
    },
    {
      "id": "mm0bc4d",
      "author": "mule_roany_mare",
      "body": "Is there any ability to fine tune which cores are disabled?\n\nIt's really hard to say how many cards need to be binned because they have failures & how many need to be binned just to meet market demand. I wouldn't assume that any 9070 you buy will be stable flashed as a 9070xt, but I suspect most every 9070 has some disabled cores that are functional.\n\nHopefully AMD doesn't disable the feature for consumers, it's bad for business if Dell & OEM can get more than they paid for (and make the cards appear less reliable in the process), but if a consumer with a bit of knowledge and skill can squeeze out a bit extra it may well be worth the good will.\n\nYou just have to gate the process behind some technical skill which leaves a record to prevent warranty abuse. An easily cuttable lead or resistor would do it.\n\nEdit: it's just clocks and not cores. That said what is the actual process used to disable chunks of silicon?",
      "score": 2,
      "created_utc": 1744105697.0,
      "replies": []
    },
    {
      "id": "mm1u3fr",
      "author": "None",
      "body": "Would rather just keep it stock, Or spend a little more money and get a better card.\nThe time and effort isn’t worth the gains.",
      "score": 2,
      "created_utc": 1744126832.0,
      "replies": [
        {
          "id": "mmfrk5m",
          "author": "Kajega",
          "body": "Right, it's cool, but I don't think anyone capable of doing this is buying the base 9070.",
          "score": 1,
          "created_utc": 1744312048.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm6a42t",
      "author": "Sandokan13",
      "body": "I can push my 9070 to 3170 mhz just by turning the power to 110.",
      "score": 1,
      "created_utc": 1744182961.0,
      "replies": []
    },
    {
      "id": "mm0y9eu",
      "author": "dead_fritz",
      "body": "The slight upgrade skus have often just been binned chips (or non-artificially kneecapped chips). This isn't anything new and the overclock-ability of your chip is really just the silicon lottery.",
      "score": 0,
      "created_utc": 1744116612.0,
      "replies": []
    }
  ]
}