{
  "post": {
    "title": "Nintendo Switch 2’s gameless Game-Key cards are going to be very common",
    "author": "chrisdh79",
    "id": "1k73140",
    "score": 2266,
    "created_utc": 1745527758.0,
    "selftext": "",
    "num_comments": 676,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1k73140/nintendo_switch_2s_gameless_gamekey_cards_are/"
  },
  "comments": [
    {
      "id": "mouvxuw",
      "author": "aircooledJenkins",
      "body": "Thanks, I hate it.\n\nI don't buy many AAA games, but the ones I do I want to keep so I only buy as a cartridge. This bs keycard is a big no for me buying AAA titles.",
      "score": 1728,
      "created_utc": 1745528474.0,
      "replies": [
        {
          "id": "mova7m5",
          "author": "dmfreelance",
          "body": "Cartridges are one big reason why i trust my Nintendo consoles to last a long time.",
          "score": 734,
          "created_utc": 1745532997.0,
          "replies": [
            {
              "id": "movqcxz",
              "author": "Strikereleven",
              "body": "Tried and true, my 40+ year old Nintendo plays on",
              "score": 248,
              "created_utc": 1745538377.0,
              "replies": [
                {
                  "id": "movzh3g",
                  "author": "beadzy",
                  "body": "I have a dsi from 2009? Works like the day i got it. I was considering jail breaking it so i could play games from a SD card, but don’t want to ruin it",
                  "score": 62,
                  "created_utc": 1745541465.0,
                  "replies": [
                    {
                      "id": "mow7726",
                      "author": "RakDream",
                      "body": "There is no risk of fucking up with a dsi hack, so go ahead and hack away. People are way too scared about this stuff, but companies are leaving us no choice with this not-owning-stuff policies",
                      "score": 114,
                      "created_utc": 1745544105.0,
                      "replies": [
                        {
                          "id": "mowfc8w",
                          "author": "jimgolgari",
                          "body": "I heard a clever phrase when discussing DRM.\n“If purchase isn’t ownership, then piracy isn’t theft.”\n\nAnd I think that’s a pretty compelling argument.",
                          "score": 169,
                          "created_utc": 1745546855.0,
                          "replies": [
                            {
                              "id": "moyx6dm",
                              "author": "OperativePiGuy",
                              "body": "Especially long after the console is already off life support, should just be free reign at that point. That's usually what I do, anyway.",
                              "score": 15,
                              "created_utc": 1745588949.0,
                              "replies": []
                            },
                            {
                              "id": "mowityg",
                              "author": "Intrigued1423",
                              "body": "Hell yeah",
                              "score": 10,
                              "created_utc": 1745548069.0,
                              "replies": []
                            },
                            {
                              "id": "moxe4ae",
                              "author": "rowenstraker",
                              "body": "I'm just borrowing it! I can give it back at any point, so did I really ever steal it?",
                              "score": 6,
                              "created_utc": 1745561780.0,
                              "replies": []
                            },
                            {
                              "id": "moxqz5z",
                              "author": "chocobowler",
                              "body": "I wonder if a judge would agree with that. Anyone want to test it out?",
                              "score": 3,
                              "created_utc": 1745569606.0,
                              "replies": [
                                {
                                  "id": "mp1igiv",
                                  "author": "TooStrangeForWeird",
                                  "body": "It's been tested. *Sharing* pirated software/games/hacks is illegal. Downloading them for personal use, afaik, hasn't been prosecuted. \n\nHowever as soon as you make money off of it (like the recent one with a streamer using pirated games), try to sell the hacks (mod chip sellers), or share it to others (like ROM sharing) they can come after you. \n\nThat's the simplest way to put it.",
                                  "score": 6,
                                  "created_utc": 1745616647.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mownt1w",
                              "author": "Acrobatic-Error4160",
                              "body": "You should post about this in r/Piracy they would love it",
                              "score": 1,
                              "created_utc": 1745549823.0,
                              "replies": []
                            },
                            {
                              "id": "moycs7l",
                              "author": "Murky_Macropod",
                              "body": "It’s a cute phrase but it’s not very logically sound.",
                              "score": 1,
                              "created_utc": 1745581550.0,
                              "replies": [
                                {
                                  "id": "moym511",
                                  "author": "jimgolgari",
                                  "body": "Please expound.",
                                  "score": 1,
                                  "created_utc": 1745585201.0,
                                  "replies": [
                                    {
                                      "id": "moz2wu9",
                                      "author": "Phoenix__Light",
                                      "body": "Say I write a software that works on a license. I pay people to make the software and the license money keeps the company in business. If a bunch of people cracked the software and pirated it, we don’t get paid for the software we spent money to produce and thus we can sue for financial damages to the pirate",
                                      "score": -2,
                                      "created_utc": 1745590735.0,
                                      "replies": [
                                        {
                                          "id": "moz5ta6",
                                          "author": "jimgolgari",
                                          "body": "Ok, but that’s software as a service. At work I use 3 of those off hand. I think that’s a great business model ::when it is presented to the customer that way from the beginning::.\n\nSo should all software be SaaS? Including video games? If so I suppose that’s fine but then call it an annual license, not “ownership”.",
                                          "score": 3,
                                          "created_utc": 1745591599.0,
                                          "replies": [
                                            {
                                              "id": "moz7qsa",
                                              "author": "Phoenix__Light",
                                              "body": "It’s a free country. If the people who make the game decide on it, they’re within their rights to do so. \n\nIf you don’t like the model, you’re within your rights to simply not purchase the game. \n\nAnd if people crack and pirate it they’re also within their rights to come after them.\n\n\n\nJust because you feel like something shouldn’t be SaaS doesn’t mean that you’re legally justified to steal it. This is delusional thinking",
                                              "score": -3,
                                              "created_utc": 1745592167.0,
                                              "replies": [
                                                {
                                                  "id": "mozdzbk",
                                                  "author": "jimgolgari",
                                                  "body": "And I think selling someone something under false pretenses is fraud.\n\nIf it’s a license call it a license. If it’s a subscription call it a subscription. If I “own” a copy of Charlie Brown Christmas on Prime, but then they sell exclusive rights to Apple+, and I shrug and buy it again, and then they make it Apple+ with subscription only, I’ve been duped. I was told by 2 separate companies that I own the rights to stream that content as the owner of that “copy”.\n\nI have over the last 2 years begun focusing more on buying physical media and my son and I have been collecting a pretty significant collection of vintage game consoles, cartridges, and discs.\n\nEveryone should vote with their wallet, but companies selling in good faith would be a great start.",
                                                  "score": 2,
                                                  "created_utc": 1745593987.0,
                                                  "replies": [
                                                    {
                                                      "id": "mp0n1kt",
                                                      "author": "Phoenix__Light",
                                                      "body": "It’s false pretenses if people don’t know what ownership means. The reality is they people know, they just don’t actually care as much as the vocal minority online does.",
                                                      "score": -3,
                                                      "created_utc": 1745607045.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mowyly3",
                          "author": "kurisu7885",
                          "body": "Was told the same about 3DS. I have a New Nintendo 3DS I'm tempted to work on since it doesn't get updated anymore.",
                          "score": 11,
                          "created_utc": 1745554059.0,
                          "replies": [
                            {
                              "id": "mox2izx",
                              "author": "RakDream",
                              "body": "Hacking a 3ds with a modern guide/method should also be without risks. Source: I hacked several systems for all my nephews and nieces back in the day.\n\nBut for the sake of full disclosure: You could, in the past, fuck up a 3ds and damage it beyond repair. (A friend of mine did his 3ds in by not reading properly back in those days.) Those methods are deprecated and there shouldn't be any risk now a days, but I aim for full transparency: Some people did fuck up their 3ds systems at one point in time. The same is not true for regular DS/DSi family systems which never had a dangerous method to begin with.",
                              "score": 9,
                              "created_utc": 1745555791.0,
                              "replies": [
                                {
                                  "id": "mox4jfx",
                                  "author": "DEdwards22",
                                  "body": "Can confirm, it takes maybe an hour reading a guide. You can even rip saves off of your existing cartridges and play them on an emulator on your phone if you want, the homebrew is really nice!",
                                  "score": 8,
                                  "created_utc": 1745556739.0,
                                  "replies": []
                                },
                                {
                                  "id": "mozi24y",
                                  "author": "Tigerballs07",
                                  "body": "The old dangerous method is how I did mine and frankly it was pretty cool to be fair. The random game bugs that they had a list of that you could do to crash to the bootloader. And then the reformatting the the loader and the storage in the right order after certain changes to keep a certain integer of set from eachother to allow you back in after reset.\n\nThe entire thing made me wonder how the fuck someone figured it out.",
                                  "score": 3,
                                  "created_utc": 1745595161.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "moxej6p",
                              "author": "AFuzzyCat",
                              "body": "It takes an hour of your time, join us on r/3dshacks",
                              "score": 3,
                              "created_utc": 1745562019.0,
                              "replies": []
                            },
                            {
                              "id": "moxfxxf",
                              "author": "EdJonwards",
                              "body": "It takes about 30-45 minutes and you can fill your entire SD card up with every game you want from nes to 3DS in minutes. You can’t mess it up",
                              "score": 2,
                              "created_utc": 1745562840.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "moy8nuu",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 1,
                          "created_utc": 1745579720.0,
                          "replies": [
                            {
                              "id": "mozpz94",
                              "author": "RakDream",
                              "body": "> Renegade Platinum\n\nI haven't tried any rom hack, but if they run on a flashcard, they should run on a hacked dsi.",
                              "score": 1,
                              "created_utc": 1745597474.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mowe2x0",
                      "author": "tylerbrainerd",
                      "body": "a quality flash cart requires no jail breaking or modifying of the console, and has no chance of ruining the console.",
                      "score": 13,
                      "created_utc": 1745546432.0,
                      "replies": []
                    },
                    {
                      "id": "mow98ca",
                      "author": "Comprehendium",
                      "body": "Swear to the gods, the battery life on these things is monstrous. I uncovered mine after maybe 6 years of not touching it and the battery was full",
                      "score": 8,
                      "created_utc": 1745544802.0,
                      "replies": []
                    },
                    {
                      "id": "mowmcmg",
                      "author": "fezmessiter",
                      "body": "In that case you can get a jail broken DS cartridge, I had the R4 revolution. You can put Roms onto the a micro sd card that fits into the R4. I had like 100+ on mine before my DS’s bumpers broke",
                      "score": 2,
                      "created_utc": 1745549302.0,
                      "replies": [
                        {
                          "id": "moxk6ia",
                          "author": "Bran04don",
                          "body": "When you say bumpers broke, do you mean became unresponsive or noticeable damage? \n\nI worked out an easy but somewhat temporary fix for a lot of unresponsive cases for ds bumpers. Seemed to work for a lot of other people who saw an ifixit forum post I made about it a decade ago.",
                          "score": 1,
                          "created_utc": 1745565353.0,
                          "replies": [
                            {
                              "id": "mozqmiw",
                              "author": "fezmessiter",
                              "body": "Unresponsive, please do share. 👀",
                              "score": 1,
                              "created_utc": 1745597664.0,
                              "replies": [
                                {
                                  "id": "mozsnur",
                                  "author": "Bran04don",
                                  "body": "This was my original solution. I can't believe it is still getting comments! https://www.ifixit.com/Answers/View/45326/How+do+I+fix+unresponsive+shoulder+buttons?permalink=answer-298042#answer298042\n\nThere are some warnings there which are valid this isn't risk free but it seems to work for most and mine hasn't broken yet since then (although i haven't touched it much since either). Just be a little careful. But if you had stopped using it because of that issue anyway then it's worth trying I think.",
                                  "score": 2,
                                  "created_utc": 1745598266.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "moxjtdy",
                      "author": "Bran04don",
                      "body": "Just get an r4i cartridge. Its basically a microsd to nintendo ds cart converter that you can load all ds games onto. Just not 3ds. No jailbreak needed. Just download the roms to the sd card.",
                      "score": 2,
                      "created_utc": 1745565131.0,
                      "replies": [
                        {
                          "id": "mp9lsv4",
                          "author": "beadzy",
                          "body": "Yes brilliant. It’s so hard to find the info on your own. I found so many complicated directions on forums when casually internet searching",
                          "score": 1,
                          "created_utc": 1745730095.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mpnm0bi",
                      "author": "soopydoodles4u",
                      "body": "Never hacked anything before, and I was able to successfully jailbreak my 3DS on the first try. There’s a very detailed step by step website to show you exactly how, I’d say go for it! You can back up your original settings if you’re worried.",
                      "score": 2,
                      "created_utc": 1745933073.0,
                      "replies": []
                    },
                    {
                      "id": "mowzk49",
                      "author": "yzkv_7",
                      "body": "You don't need to jailbreak it. You can just get a cheap r4 card.",
                      "score": 1,
                      "created_utc": 1745554473.0,
                      "replies": []
                    },
                    {
                      "id": "moxxfgj",
                      "author": "Nitr0_CSGO",
                      "body": "You'd be better off buying an R4 card, don't have to modify the console that way\n\nGames go on a Micro SD card and it can even run cheats (if that's your thing)",
                      "score": 1,
                      "created_utc": 1745573676.0,
                      "replies": [
                        {
                          "id": "mp9lo3m",
                          "author": "beadzy",
                          "body": "Thanks for this tip. Way better than what I found online when causing searching about this idea",
                          "score": 2,
                          "created_utc": 1745730026.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mox38nq",
                  "author": "Daday_blessed",
                  "body": "Yasss. My first Nintendo console!",
                  "score": 1,
                  "created_utc": 1745556121.0,
                  "replies": []
                },
                {
                  "id": "mp0ti9j",
                  "author": "NoMoreVillains",
                  "body": "Switch game cards aren't going to last 40 years. They're a different technology than old game cartridges",
                  "score": 1,
                  "created_utc": 1745608993.0,
                  "replies": []
                },
                {
                  "id": "movryq5",
                  "author": "LouBerryManCakes",
                  "body": "I'm sorry but if you're talking about the North American NES, 39 is the absolute oldest it could possibly be, if you happened to be in the New York or LA test market. Otherwise if you bought a day 1 NES it would currently be 38.\n\nEdit: Getting downvoted for a polite fact correction is the worst thing that's happened to me in my 25+ years on Reddit.",
                  "score": -62,
                  "created_utc": 1745538911.0,
                  "replies": [
                    {
                      "id": "movs8ji",
                      "author": "Kotobuki_Tsumugi",
                      "body": "It’s close enough dude",
                      "score": 35,
                      "created_utc": 1745539002.0,
                      "replies": [
                        {
                          "id": "movt1o5",
                          "author": "LouBerryManCakes",
                          "body": "I know, their point doesn't change buy why specify that it is *more than* 40 when that's not possible? The truth is interesting enough that there's no reason to exaggerate.",
                          "score": -27,
                          "created_utc": 1745539276.0,
                          "replies": [
                            {
                              "id": "movy1zw",
                              "author": "bacchusku2",
                              "body": "I agree, I’ve told u/Kotobuki_Tsumugi +1million times never to exaggerate.",
                              "score": 12,
                              "created_utc": 1745540982.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "movvs8n",
                      "author": "Strikereleven",
                      "body": "Bro my NES says copyright 1985, it's 2025.",
                      "score": 11,
                      "created_utc": 1745540215.0,
                      "replies": [
                        {
                          "id": "movwwqy",
                          "author": "YamaguchiJP",
                          "body": "Lol are you 15 years old?",
                          "score": -12,
                          "created_utc": 1745540591.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mow08ip",
                      "author": "DrSpaceman667",
                      "body": "We don't take kindly to polite facts 'round these parts, mister.",
                      "score": 0,
                      "created_utc": 1745541728.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "movruws",
              "author": "AtomicSymphonic_2nd",
              "body": "Well’p… not any more. \n\nNow ***no*** console manufacturer guarantees physical media will have the actual game in it. 🙃",
              "score": 28,
              "created_utc": 1745538877.0,
              "replies": [
                {
                  "id": "movtwjq",
                  "author": "Statharas",
                  "body": "Technically, it is the publisher who decides to go physical or not.\n\nOtherwise, they may choose to put down a key within the game card that will redeem in your account. Or at least that's what I am understanding.",
                  "score": 20,
                  "created_utc": 1745539571.0,
                  "replies": [
                    {
                      "id": "movv0t6",
                      "author": "AtomicSymphonic_2nd",
                      "body": "Correct, it’s a cryptographic key to unlock a downloaded game and play it on the system you’re using.\n\nDifference is you can download that game to any system you own or that someone else owns… they just need that key card to play it.\n\nIt is very similar to old-school days where you’d let your friend or someone borrow your GBA or DS cartridge game for a while and then you wouldn’t be able to play it until they were done with it. \n\nExact same system, just now the game data is downloaded digitally. Key card inserted to play the game… pull out the key card and give it to someone else for them to download, then play.\n\nIt’s honestly kinda genius. But still… the game no longer resides on the key card itself, which is highly infuriating for game archivists (and some reverse engineer enthusiasts) and folks that like to enjoy *owning* a full copy of the game data itself in *their* hands.",
                      "score": 16,
                      "created_utc": 1745539954.0,
                      "replies": [
                        {
                          "id": "mow1g6l",
                          "author": "hyperforms9988",
                          "body": "That's the thing.  I love this idea... for digital games.  If Switch 2 was digital only, fine.  It's not, so I'm in a weird spot now where I see myself not buying a lot of games that I otherwise would've bought if they had the game on the cart.  If Nintendo insists on putting their games on the carts... I guess that means even more sales than they already get from me?\n\nIt's not the same as Steam.  I've had Steam for like 20 years.  The library is still what it is.  PCs don't change generations and there's no concept of losing access to games because previous generations of games reside in shops that are no longer online so you can't redownload something you bought.  Backwards compatibility is pretty good too... about the only thing you have to worry about are really old games that want older OSes and weird shit like that.  I'm comfortable buying shit on Steam as a result... plus, you kind of don't have a choice for PCs anyway.  Physical media for PC died out a long time ago.",
                          "score": 11,
                          "created_utc": 1745542147.0,
                          "replies": [
                            {
                              "id": "moxlydk",
                              "author": "Statharas",
                              "body": "I'm glad steam replaced physical media...",
                              "score": 1,
                              "created_utc": 1745566454.0,
                              "replies": []
                            },
                            {
                              "id": "moxl1za",
                              "author": "AStringOfWords",
                              "body": "Worrying about shops going offline and not being able to download the game is such a waste of brain power.\n\nUnless you’re an early adopter of the Ouya, it’s not a thing.",
                              "score": -2,
                              "created_utc": 1745565891.0,
                              "replies": [
                                {
                                  "id": "moxm32h",
                                  "author": "Statharas",
                                  "body": "Well, the 3DS store is no longer available. What happens in 10, 20, 30 years? Will Nintendo shut down the switch shop for the switch 5?",
                                  "score": 4,
                                  "created_utc": 1745566536.0,
                                  "replies": [
                                    {
                                      "id": "moxmmgq",
                                      "author": "AStringOfWords",
                                      "body": "lol wut? No it isn’t. You can still download 3DS games you bought digitally. Nintendo are never shutting that down.",
                                      "score": -2,
                                      "created_utc": 1745566874.0,
                                      "replies": [
                                        {
                                          "id": "moyl3yh",
                                          "author": "Statharas",
                                          "body": "The store has, however. You can no longer buy the digital only games. It is very much possible that at some point in the far future, the switch 2 store will also shut down, and at some point even the download service will.",
                                          "score": 2,
                                          "created_utc": 1745584827.0,
                                          "replies": [
                                            {
                                              "id": "moymaqr",
                                              "author": "AStringOfWords",
                                              "body": "Ok? Who cares? We’re talking about download key carts, not digital shopfronts.\n\nIf 3DS had download key carts, they’d still work now, and will still work for 20-30 more years.",
                                              "score": 1,
                                              "created_utc": 1745585258.0,
                                              "replies": [
                                                {
                                                  "id": "moyn1tf",
                                                  "author": "Statharas",
                                                  "body": "That's the thing. We can only hope it does, there's no guarantee that it will. For all we know, Nintendo HQ may get hit by a meteor, disintegrating the company.",
                                                  "score": 1,
                                                  "created_utc": 1745585524.0,
                                                  "replies": [
                                                    {
                                                      "id": "mozb16j",
                                                      "author": "AStringOfWords",
                                                      "body": "This is not a rational thing to worry about when buying Shovel Knight for the 45th time.",
                                                      "score": 1,
                                                      "created_utc": 1745593127.0,
                                                      "replies": []
                                                    },
                                                    {
                                                      "id": "mp4o6dy",
                                                      "author": "BitingSatyr",
                                                      "body": "If Nintendo as a company disintegrated, then there will be no one to come after you for pirating their games (which is really the only “game preservation” worth talking about)",
                                                      "score": 1,
                                                      "created_utc": 1745666827.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                },
                                                {
                                                  "id": "moz2qif",
                                                  "author": "hyperforms9988",
                                                  "body": "You still need some method of actually downloading the game if you don't already have the data for it.  That's in theory not always going to be around.  I'd feel more comfortable about it if they would just stick to the same infrastructure, OS, whatever, from now to infinity, so it's always one store, one place, etc, and we don't have these generations that are like a hard reset.  I hope that's the direction that things are going in for everybody.  Switch 2 makes that promising... so far.  We won't know what that looks like until the next generation or two.\n\nQuite honestly, the only thing that's going to get me to fully adopt digital on console is the death of physical media.  I hope by then, we have that kind of shit in place where your library just travels with you from generation to generation and a game you bought 15 years ago just works on the console you're playing now.  I get that physical media has this same problem where you need the older console connected and plugged in to play it, but I'm saying if digital is going to have the same restrictions **and more** than physical does... then I have no real incentive to buy digital and so I generally don't for consoles.\n\nThat's a little different for Switch because it's portable and you have to think about carrying carts with you... that's finally a positive thing for digital and it makes the desirability for digital go up for me as a result.  I don't want to carry carts with me all the time, and so smaller games, I'm willing to buy digital to have a library of stuff that just lives on the console.  Another positive for digital with Switch 2 is that finally, it's looking like some carts will be more expensive than their digital counterparts, and so there's now a pricing incentive that generally didn't used to be there.\n\nWhile this is a fringe case... we now have Ubisoft ripping The Crew out of people's digital libraries.  Sony has ripped movies and TV shows out of people's libraries.  The idea bothers me, and if physical media still exists, that's what I'll prefer probably right up to its death.  But like... again, *real* physical media and not what these game key cards are.  The data is on the cart, I can play it off the cart, I don't need an online connection or service or whatever the fuck to play it or download the rest of it or whatever, and that's it.",
                                                  "score": 1,
                                                  "created_utc": 1745590682.0,
                                                  "replies": [
                                                    {
                                                      "id": "moz8rpd",
                                                      "author": "AStringOfWords",
                                                      "body": "Sorry that happened",
                                                      "score": 1,
                                                      "created_utc": 1745592469.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mowgblt",
                          "author": "nicgeolaw",
                          "body": "So, can I sell the game cartridge to someone else and it will still work properly?",
                          "score": 8,
                          "created_utc": 1745547195.0,
                          "replies": [
                            {
                              "id": "mowp6pz",
                              "author": "AtomicSymphonic_2nd",
                              "body": "##[***YES!***](https://www.theverge.com/news/644803/nintendo-switch-2-game-key-cards-trade-borrow-resell)",
                              "score": 5,
                              "created_utc": 1745550315.0,
                              "replies": [
                                {
                                  "id": "moy9jz1",
                                  "author": "SmokelessSubpoena",
                                  "body": "Unless you don't have internet access, or download space. \n\n\n\n\n\nYou are buying a key, NOT a game. You are buying an **ACCESS KEY**, not a game. \n\n\n\n\n\nResell your key all you want, YOU STILL NEVER OWN A PHYSICAL COPY OF THE GAME. \n\n\n\n\n\nAnd it has _nothing_ to do with \"data space\" because we can put multiple TB space on the size of your pinky nail. \n\n\n\n\n\nConsumers need to stand up to this arguable bullshit. We deserve better, especially from Nintendo...",
                                  "score": 2,
                                  "created_utc": 1745580136.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "movzmip",
                          "author": "beadzy",
                          "body": "I assume the code would only work once, is that not the case?\nEdit: nevermind I just have compromised reading comprehension skills, apparently lol",
                          "score": 5,
                          "created_utc": 1745541516.0,
                          "replies": [
                            {
                              "id": "mow0hev",
                              "author": "AtomicSymphonic_2nd",
                              "body": "Game card can be redeemed an infinite amount of times, as far as we all understand.\n\nIn a nutshell, it’s a hybrid version of a digital game. It’s for games that are too big to fit in 64GB Switch 2 cards (like Eldin Ring and probably the annual Call of Duty release) or for indie devs and publishers that cannot afford producing full Switch 2 cards… this option is much cheaper for indie devs to put their games on physical store shelves instead. 😄",
                              "score": 7,
                              "created_utc": 1745541815.0,
                              "replies": [
                                {
                                  "id": "mox9r26",
                                  "author": "StrawHat89",
                                  "body": "At this point it's clearly just for any game a publisher doesn't want to pay for a real game card. The only game that exceeds 64 GB, right now, is Split Fiction at over 70. Cyberpunk is the second largest at 59 GB and IS on a Game Card while virtually no other 3rd party game is.",
                                  "score": 2,
                                  "created_utc": 1745559398.0,
                                  "replies": [
                                    {
                                      "id": "moxm2h9",
                                      "author": "AtomicSymphonic_2nd",
                                      "body": "CDPR also packed in a whole bunch of free things with their physical deluxe edition of the Witcher 3. It was really neat at the time!\n\nPerhaps this is CDPR trying to win over the goodwill of the gaming industry again. They could have easily chosen to do the key card method, but they opted to put the whole game into a full Switch 2 game card.\n\nFor a game that has made even the mighty RTX 4090 sweat when it first released and is sometimes seen as the new “Can it run Crysis?”, it’s a fucking feat of software engineering that they, along with Virtuos, managed to squeeze the entire game into 59 GB.\n\nWill be interesting to see how it runs on the Switch 2, tbh.",
                                      "score": 1,
                                      "created_utc": 1745566525.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "moya3cu",
                                      "author": "SmokelessSubpoena",
                                      "body": "It has nothing to do with game size. You can fit multiple TBs of data on your pinky nail. The fact folks are believing that shows how naive the average consumer is. And I hate producers taking advantage of uneducated buyers. Nintendo is now fairly dead to me. Guess I'll go touch grass.",
                                      "score": 0,
                                      "created_utc": 1745580378.0,
                                      "replies": [
                                        {
                                          "id": "mp4oxyb",
                                          "author": "BitingSatyr",
                                          "body": ">You can fit multiple TBs of data on your pinky nail\n\nMmhmm, and how much would that cost?",
                                          "score": 1,
                                          "created_utc": 1745667191.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mowl7yh",
                                  "author": "niveksng",
                                  "body": "I have a feeling the annual Call of Duty release is too big for the Switch 2 itself tbh",
                                  "score": 1,
                                  "created_utc": 1745548906.0,
                                  "replies": []
                                },
                                {
                                  "id": "moy9vaa",
                                  "author": "SmokelessSubpoena",
                                  "body": "Brother, you can fit multiple terabytes of data on a size smaller than your pinky nail. Don't let Nintendo sell you that bullshit. This is to cut production cost and remove private game ownership. Digital is where it's heading, and general private consumer ownership is not what corporate overlords want.",
                                  "score": 1,
                                  "created_utc": 1745580279.0,
                                  "replies": [
                                    {
                                      "id": "mozz18b",
                                      "author": "AtomicSymphonic_2nd",
                                      "body": "Oh I agree with you. I’d rather have the whole game on the card itself, like what CDPR is doing with Cyberpunk for the Switch 2.\n\nIt’s frustrating, but beyond a coordinated boycott, I’m not sure this would stop. Every console manufacturer now allows this.\n\nIt’s like trying to stop a tidal wave.",
                                      "score": 1,
                                      "created_utc": 1745600104.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mp4phkj",
                                      "author": "BitingSatyr",
                                      "body": ">This is to cut production cost\n\nYou say this as though it’s not an extremely important factor you’re ignoring in this. Estimates have put the 64GB game card at something like $15, so presumably a 128GB card would be even more expensive. A publisher only recoups about 40-50% of a physical game’s retail price, and adding an extra $20 to manufacturing costs actually does have a measurable impact on the economics of making games.",
                                      "score": 1,
                                      "created_utc": 1745667447.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "moy98pp",
                          "author": "SmokelessSubpoena",
                          "body": "I get the context, but it's still not going to sell to 90's kids, IMO. \n\n\n\n\n\n\n\nYou're still requiring internet connection, download data space, etc. \n\n\n\n\n\n\nYOU ARE NOT BUYING A PHYSICAL GAME, WHY ARE WE ALLOWING THIS AS CONSUMERS TO BECOME PRACTICE?!?!",
                          "score": 2,
                          "created_utc": 1745579990.0,
                          "replies": [
                            {
                              "id": "mozi046",
                              "author": "Ventira",
                              "body": "Per nintendo's own statement, this exists primarily to allow for games that exceed the 64 gb limit of the cartridge to have physical presence. Games under that (and especially nintendo's first party titles, as they optimization wizards) will be purely physical.",
                              "score": 2,
                              "created_utc": 1745595145.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "moxkvqa",
                          "author": "AStringOfWords",
                          "body": "Yeah but nobody cares about those guys. They’re just Redditors. They will boycott game cards just like they boycotted the switch 2.",
                          "score": 1,
                          "created_utc": 1745565786.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "moxgfw8",
              "author": "Kazer67",
              "body": "I trust more the law in my coutry and mostly the exception we have in our copyright law that allow me to remove copy-protection on product I buy for interoperability purpose which allow me to make my private copy on product I buy and not wait for the publisher (and yes, we even pay a tax on all storage medium to have the right of private  copy).\n\nThat and all the devs who make the tool for that (OpenTendo and NESsessity are impressive project).",
              "score": 2,
              "created_utc": 1745563130.0,
              "replies": []
            },
            {
              "id": "moy0e96",
              "author": "Suicicoo",
              "body": "*trusted",
              "score": 1,
              "created_utc": 1745575432.0,
              "replies": []
            },
            {
              "id": "mp0f1c0",
              "author": "sekazi",
              "body": "Cartridges on the DS and 3DS are starting to die now.",
              "score": 1,
              "created_utc": 1745604671.0,
              "replies": []
            },
            {
              "id": "mowiaga",
              "author": "jossta8008",
              "body": "Cartridge slot on my switch stopped working after a year or very sporadic use",
              "score": 1,
              "created_utc": 1745547884.0,
              "replies": []
            },
            {
              "id": "mowujmo",
              "author": "r31ya",
              "body": "Two reason on the game key,\n\nThe game is too big for cartridge. The known largest variant is 64gb, that being used to contain the entire cyberpunk 2.0\n\nOr the game is too small for the smallest cartridge. If you have indie game with smaller than 5gb (sub $30 pricing) and the smallest cartridge is like 16/32gb, the cartridge price is not gonna worth it.",
              "score": 1,
              "created_utc": 1745552366.0,
              "replies": [
                {
                  "id": "mox24cl",
                  "author": "Abba_Fiskbullar",
                  "body": "The only cartridge size for Switch 2 is 64GB. There aren't any smaller cartridges, and at the moment there aren't any larger.",
                  "score": 1,
                  "created_utc": 1745555603.0,
                  "replies": [
                    {
                      "id": "mox2h1a",
                      "author": "r31ya",
                      "body": "CDPR people that in the hands-on event specific wording were\n\n*\"We pick the largest cartridge size available, which is 64gb, to put all cyberpunk into it\"*\n\ni assume that that would mean variations available, like in OG Switch.",
                      "score": 1,
                      "created_utc": 1745555766.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "movdy32",
          "author": "mrwho995",
          "body": "For me whether this is a good or bad thing comes down to how developers respond to it. My understanding is that it was pretty rare for 3rd party developers to have physical releases on Switch, often resorting to download codes in boxes. If this means those same developers are now using game cards over download codes or digital only, then it's a definite improvement, given the cards can be lent and resold. If it means developers who previously did physics not are moving to key cards, obivously that's a big loss. Unless there's info I'm not aware of I think it's too early to say whether this is a good or bad thing.",
          "score": 54,
          "created_utc": 1745534247.0,
          "replies": [
            {
              "id": "moves7d",
              "author": "aircooledJenkins",
              "body": "That's essentially what I'm saying. If a AAA game isn't available as a physical game, I'm not buying it. If developers who previoulsy released cartridges decide to go with key cards, I'm not buying it.\n\nI acknowledge that if indie developers who previously only released digital, now offer key cards, that is an improvement and I applaud that change. It is annoying to not be able to share some of the fun cheap games I have with my kid.",
              "score": 46,
              "created_utc": 1745534523.0,
              "replies": [
                {
                  "id": "movzmf7",
                  "author": "AnRealDinosaur",
                  "body": "Same for me. I have a huge library of indie digital downloads, but first party games or big releases I always buy a physical copy to put on my shelf. If that doesn't exist I'm more likely to just not buy them. And if they want $80 for a game, not having a physical copy is a deal breaker.",
                  "score": 4,
                  "created_utc": 1745541515.0,
                  "replies": []
                },
                {
                  "id": "movqyes",
                  "author": "dorath20",
                  "body": "You can share digital games with the current switch.\n\nYou just can't both play same time.",
                  "score": 6,
                  "created_utc": 1745538573.0,
                  "replies": [
                    {
                      "id": "movxl6t",
                      "author": "brickmaster32000",
                      "body": "The process is ass backwards though. If I want to share a game with a friend I need to register their switch as my primary switch so they can play it on their account while pretending that the switch I actually own is my secondary console that I just so happen to be logging into with my account.\n\nSo while there is a system in place that allows people to share games, the prerequisite is to lie about your console ownership.",
                      "score": 6,
                      "created_utc": 1745540822.0,
                      "replies": [
                        {
                          "id": "movz5xp",
                          "author": "MC7",
                          "body": "That’s not what was announced.  You can share with anyone in your family group for 2 weeks.",
                          "score": 6,
                          "created_utc": 1745541361.0,
                          "replies": [
                            {
                              "id": "mow00a4",
                              "author": "brickmaster32000",
                              "body": "The person I responded to is talking about the current switch. \n\nOn the current switch you can only share games on your primary console. This means the person you want to share with needs physical access to the primary console to play games with their account. You can always play games you own on your account. So to share games on the current switch you set their switch as the primary console and then simply play the game on your, know secondary switch, through your account, which you would have done anyways.",
                              "score": 7,
                              "created_utc": 1745541649.0,
                              "replies": [
                                {
                                  "id": "mow95uj",
                                  "author": "MC7",
                                  "body": "https://www.nintendo.com/us/gaming-systems/virtual-game-cards/\n\nI understand the concept of game sharing on consoles but that’s not what was announced.",
                                  "score": -2,
                                  "created_utc": 1745544779.0,
                                  "replies": [
                                    {
                                      "id": "mowcs1b",
                                      "author": "brickmaster32000",
                                      "body": "I wasn't responding to someone talking about what was announced for the new switch. I was responding to someone talking about what is possible on the current switch.",
                                      "score": 3,
                                      "created_utc": 1745545998.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "moxlngj",
                                  "author": "None",
                                  "body": "[removed]",
                                  "score": -2,
                                  "created_utc": 1745566262.0,
                                  "replies": [
                                    {
                                      "id": "moy23t5",
                                      "author": "whilst",
                                      "body": "> You can share digital games with the current switch.\n\nThis is the text of the comment they were responding to.  So, no, *this* comment thread is *not* about the switch 2.  Jackass.",
                                      "score": 2,
                                      "created_utc": 1745576401.0,
                                      "replies": [
                                        {
                                          "id": "moy5gam",
                                          "author": "AStringOfWords",
                                          "body": "Why are you even talking about digital game sharing on Switch 1? Everyone knows that’s horrible.",
                                          "score": 0,
                                          "created_utc": 1745578179.0,
                                          "replies": [
                                            {
                                              "id": "mp1rfyl",
                                              "author": "whilst",
                                              "body": "Because we're talking about how it's horrible.\n\nIt's so, so easy for you to just read the comments you're replying to.  I have no idea why you're coming in here with all this anger.",
                                              "score": 2,
                                              "created_utc": 1745619595.0,
                                              "replies": [
                                                {
                                                  "id": "mp3ucfb",
                                                  "author": "AStringOfWords",
                                                  "body": "You’re talking about how it’s horrible in a thread related to switch 2 game key cards. Which address exactly this issue, you don’t need to sign in as yourself on another console to use them or do any transferring stuff, you just put the card in and download the game.",
                                                  "score": 1,
                                                  "created_utc": 1745649304.0,
                                                  "replies": [
                                                    {
                                                      "id": "mp3uq4f",
                                                      "author": "whilst",
                                                      "body": "... yes.  That's the point.  That it used to be worse.\n\nI'm really not sure what you're arguing about.",
                                                      "score": 2,
                                                      "created_utc": 1745649518.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "movzmqi",
                              "author": "MooMookay",
                              "body": "He's being dense and hasn't even looked it up.\nHe's mentioning how it works with current switch. Example of the internet, easy to google but why would they huh?",
                              "score": 1,
                              "created_utc": 1745541518.0,
                              "replies": [
                                {
                                  "id": "mow2exw",
                                  "author": "brickmaster32000",
                                  "body": "> You can share digital games with the **current switch.**\n\nYes I mentioned how it worked on the current switch because that is exactly what was being discussed.",
                                  "score": 5,
                                  "created_utc": 1745542476.0,
                                  "replies": [
                                    {
                                      "id": "mowwqj3",
                                      "author": "Gingingin100",
                                      "body": "The current switch is receiving this system as well",
                                      "score": 1,
                                      "created_utc": 1745553257.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mowmsws",
                          "author": "adrian783",
                          "body": "ok, what do you suggest?",
                          "score": 1,
                          "created_utc": 1745549464.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "movwk2u",
                  "author": "brickmaster32000",
                  "body": "> If a AAA game isn't available as a physical game\n\nSo have you just not bought any AAA games in the last decade? Because any AAA game with multiplayer is going to force you to operate off of the most recent update which will only be available as a download. Single player games you might be able to continue to play without downloading anything but there are a large chunk of those that will require patches to fix bugs.",
                  "score": 4,
                  "created_utc": 1745540472.0,
                  "replies": [
                    {
                      "id": "mowinz1",
                      "author": "aircooledJenkins",
                      "body": "I do stick primarily to single player games. 🤷",
                      "score": 1,
                      "created_utc": 1745548011.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mox02ih",
              "author": "damnsignin",
              "body": "It's a bad thing. You're only considering this at the point of retail. Once Nintendo shuts down the Switch 2 server, like with the 3DS, these game-key cards become junk. The point of buying a cartridge is to own the game past whenever the companies decide to shut down the service and make the data obsolete.",
              "score": 6,
              "created_utc": 1745554698.0,
              "replies": [
                {
                  "id": "moy9121",
                  "author": "XTornado",
                  "body": "Yeah and that is the same with the code ones. The idea is that if we change the code ones with key cartridges is a win. \n\nThe issue is publishers start switching cartridges to key cartridges then we have a problem.\n\nIn the ideal world only cartridges with the game inside would be the only way unfortunately that will not happen.\n\nPlus even if that was the case with the current state of affairs there is always updates you need that sometimes never get added to a cartridge.\n\nAt the end... PC + GOG or PC + CRACKED",
                  "score": 1,
                  "created_utc": 1745579891.0,
                  "replies": []
                },
                {
                  "id": "mp4q43s",
                  "author": "BitingSatyr",
                  "body": ">Once Nintendo shuts down the Switch 2 server, like with the 3DS, these game-key cards become junk.\n\nThey didn’t do that though. They shut down the 3DS *store*, so you can’t make new purchases, but you can redownload things you already own. FWIW the Wii and Wii U e-shops are like this too, and probably will be as long as Nintendo is a going concern.",
                  "score": 0,
                  "created_utc": 1745667740.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "movhiui",
              "author": "Ekyou",
              "body": "We have well over 100 Switch games and not a single one was a code in a box. And the only “cartridge that just triggers a download” game I have is Danganronpa Decadence. (And I think that’s only the 1st and 2nd game and V3 is actually on the cartridge)",
              "score": 10,
              "created_utc": 1745535435.0,
              "replies": [
                {
                  "id": "moxkhmz",
                  "author": "mrwho995",
                  "body": "From what I understand, download codes in a box were reasonably common for 3rd party games, especially larger ones",
                  "score": 1,
                  "created_utc": 1745565543.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "movnukl",
              "author": "Pauly_Amorous",
              "body": "> If this means those same developers are now using game cards over download codes\n\nWhat is the difference between these two? I know you said the game cards can be resold, but I've never heard of these before.\n\nEdit: For others of you who are confused by the nomenclature, game cards = game cartridges.",
              "score": 3,
              "created_utc": 1745537539.0,
              "replies": [
                {
                  "id": "movsji6",
                  "author": "Aritra319",
                  "body": "The download code is redeemed and the game gets added to your account. Meaning you can only do this once. \n\nThe key cards are instead physical keys to access a digital version of the game. You still have to download it, but the card otherwise works like a card would. \n\nThink of them as a game disc for PS or Xbox that needs a giant day one patch to run. \n\nIt’s mainly a way to cut costs. Especially if a game is large. It’s also pretty much a no brainer for games with a large online, or full live service game like Monster Hunter, where the game gets patched so much, the initial data on the card becomes irrelevant after a while anyway.",
                  "score": 8,
                  "created_utc": 1745539106.0,
                  "replies": [
                    {
                      "id": "mowb0b6",
                      "author": "Pauly_Amorous",
                      "body": "> The key cards are instead physical keys to access a digital version of the game. You still have to download it, but the card otherwise works like a card would. \n\nOkay, I gotcha. I didn't realize that 'cards' on the Switch were actual game cartridges.",
                      "score": 1,
                      "created_utc": 1745545398.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mowgmg8",
              "author": "stellvia2016",
              "body": "It's more annoying, but another thing you could do would be to include the full game files on a microsd. AFAIK it's going to be very similar to archiving Steam games where the game files don't matter, bc that's not what proves proof of ownership.",
              "score": 1,
              "created_utc": 1745547298.0,
              "replies": []
            },
            {
              "id": "moxlk3t",
              "author": "AStringOfWords",
              "body": "Literally who cares just play the games and shut up.",
              "score": -1,
              "created_utc": 1745566203.0,
              "replies": []
            }
          ]
        },
        {
          "id": "movxxdh",
          "author": "Mr_Lumbergh",
          "body": "Yeah. The last 10-15 years have really taught me to  get the physical copy.",
          "score": 7,
          "created_utc": 1745540939.0,
          "replies": []
        },
        {
          "id": "movlsor",
          "author": "Turtle-Fox",
          "body": "Physical purchases that are just keys have existed since the Switch 1 (and probably the Wii U), these are more consumer friendly. You can actually sell these or lend them, where the ones that are just keys before (no cartridge) couldn't be sold or lent. These are a big win, since the digital only games were going to exist either way, but now they can be sold/lent. \n\nThe alternative was always going to just be games that were digital only anyways. Publishers don't want to pay for the larger cartridge sizes.",
          "score": 2,
          "created_utc": 1745536854.0,
          "replies": [
            {
              "id": "mowrzer",
              "author": "Lorde555",
              "body": "A major downside, however, is you are now at the whim of nintendos online servers in order to play the game into the future. It’s a big nono for game preservation, not even considering the “people with no internet” aspect of the argument.",
              "score": 1,
              "created_utc": 1745551362.0,
              "replies": [
                {
                  "id": "mowt4l0",
                  "author": "Turtle-Fox",
                  "body": "Like I said, these games were going to be digital only either way. It was either this, or empty boxes with codes like they were in the past. Publishers don't want to pay for cartridges big enough to hold the game.",
                  "score": 4,
                  "created_utc": 1745551807.0,
                  "replies": []
                },
                {
                  "id": "moxdf4a",
                  "author": "pornographic_realism",
                  "body": "Emulation will still be possible. Games will still be preserved you just, quite rightly, have to give Nintendo two middle fingers to achieve it.",
                  "score": 1,
                  "created_utc": 1745561389.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mox8uch",
          "author": "Onebadmuthajama",
          "body": "I wonder how easy it would be to hack it a little bit, and allow custom cartridges?  Then we can install any game on any cartridge, as long as the cartridge has the game key too.\n\nI can see some cool technical potential if Nintendo could just let it happen.",
          "score": 1,
          "created_utc": 1745558915.0,
          "replies": []
        },
        {
          "id": "moyjvd6",
          "author": "Dayv1d",
          "body": "The main advantage of physical cartidges is, that you can sell them. Every AAA title that you DONT want to keep should be bought physical.",
          "score": 1,
          "created_utc": 1745584367.0,
          "replies": [
            {
              "id": "moyr36t",
              "author": "aircooledJenkins",
              "body": ">The main advantage of physical cartidges is\n\nthat it doesn't rely on the developer maintaining online access in perpetuity.",
              "score": 0,
              "created_utc": 1745586923.0,
              "replies": [
                {
                  "id": "mp087aw",
                  "author": "Dayv1d",
                  "body": "Well i am a gamer, not a collector. I play even great games like zelda botw 2 or 3 times max in 5 years and thats it. There are dozens new games and i get nothing out of a 4th run. But you do you",
                  "score": 1,
                  "created_utc": 1745602715.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "movitoy",
          "author": "Several_Temporary339",
          "body": "I mean, having digital games is alright. I had a library of like 30 games, sold my switch, and bought a new one years later and just downloaded them all again.",
          "score": 0,
          "created_utc": 1745535870.0,
          "replies": []
        },
        {
          "id": "movbxfu",
          "author": "lilboytuner919",
          "body": "Honest question and seriously not trying to be a dick: why does this matter?\n\nEdit: thank you to the dozen of you who all replied with the exact same answer",
          "score": -11,
          "created_utc": 1745533569.0,
          "replies": [
            {
              "id": "movc59c",
              "author": "tothemax44",
              "body": "Physical copy = ownership. Non physical = concord.",
              "score": 104,
              "created_utc": 1745533640.0,
              "replies": [
                {
                  "id": "movhlzj",
                  "author": "None",
                  "body": "I dunno, I don't think that's been true for about a decade. I can't think of any physical games that you can install offline... Even Nintendo games...",
                  "score": 5,
                  "created_utc": 1745535464.0,
                  "replies": [
                    {
                      "id": "movjy03",
                      "author": "AdamTheTall",
                      "body": "There are exceptions, but nearly every switch game can be ran off the cartridge without downloading anything.\n\nMany games have day one updates that improve various things, but they aren't typically required for operation.",
                      "score": 20,
                      "created_utc": 1745536241.0,
                      "replies": []
                    },
                    {
                      "id": "mow58bg",
                      "author": "-DementedAvenger-",
                      "body": "Doesitplay.org\n\nRoughly 90% of PS4 and PS5 games are on the physical disc without the need for downloads.\n\n~92% of Switch games.",
                      "score": 3,
                      "created_utc": 1745543438.0,
                      "replies": []
                    },
                    {
                      "id": "mow7cn6",
                      "author": "No-Bother6856",
                      "body": "I have literally never connected my switch oled to the internet and I have never had an issue. The games play off the cartridges.",
                      "score": 2,
                      "created_utc": 1745544159.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "movedsc",
                  "author": "scribblemacher",
                  "body": "What about when you put the game in and it need multiple patches over it's life time? Kirby Star Allies (as an extreme example) on the cart vs the updates make it basically a different game. It might as well be a code only cart at that point.",
                  "score": 3,
                  "created_utc": 1745534391.0,
                  "replies": [
                    {
                      "id": "moveye7",
                      "author": "GoodGame2EZ",
                      "body": "Better to at least have the base game than nothing, when working offline for example, which is essentially the argument here.",
                      "score": 24,
                      "created_utc": 1745534580.0,
                      "replies": [
                        {
                          "id": "movfyt5",
                          "author": "_JohnWisdom",
                          "body": "you don’t need internet to play the games. Only to download them, just as you would do with patches…",
                          "score": -11,
                          "created_utc": 1745534916.0,
                          "replies": [
                            {
                              "id": "movgd91",
                              "author": "GoodGame2EZ",
                              "body": "Right. So if you just got the physical game and have no internet you can't play it. If you got the game and Nintendo servers went offline before you could download it you can't play it.",
                              "score": 8,
                              "created_utc": 1745535048.0,
                              "replies": [
                                {
                                  "id": "movm1i1",
                                  "author": "bartang",
                                  "body": "And eventually Nintendo will stop supporting the online store for the console. It's now impossible to legitimately download some digital only Nintendo 3ds games as the 3ds online store is defunct. \n\nSo when that happens for the switch 2, these cartridges will just be unplayable pieces of plastic.",
                                  "score": 4,
                                  "created_utc": 1745536934.0,
                                  "replies": []
                                },
                                {
                                  "id": "movtwf6",
                                  "author": "AtomicSymphonic_2nd",
                                  "body": "TBFH, if Nintendo has decided that the Switch 2’s “Game Key Card” scheme can work in developing regions of the world like Southeast Asia, South America, or Mideast/Africa, then I guess this may not be as big a concern as it used to be a decade ago.\n\nCOVID forced just about every country on the planet to invest in internet or cellular infrastructure to varying degrees.\n\nWhile certainly there are places (mountains without a satellite connection) and situations (like in military service and you’re in a submarine at-depth or are deployed in a combat zone) where internet access is physically impossible to receive, perhaps even Nintendo feels that just about everyone that will buy a Switch 2… will also have internet access and just enough bandwidth to download full games.\n\nHowever, it does suck for those of us that have a strong interest in archiving games for historical purposes… or like to bend the rules a bit and have a physical copy to rip from multiple times (after reverse engineering the DRM) and play on multiple Switch 2 systems (or equivalent PC handhelds) that we personally own\n\nWith the stipulation that you only do that with your own copy of the game that you bought legitimately, of course.",
                                  "score": 2,
                                  "created_utc": 1745539570.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "movkjiq",
                      "author": "not_a_moogle",
                      "body": "I want my copy of tears of the kingdom to be 1.0 for the drop glitch.",
                      "score": 4,
                      "created_utc": 1745536438.0,
                      "replies": []
                    },
                    {
                      "id": "movf6tr",
                      "author": "BRAND-X12",
                      "body": "This is my thing. Unless game companies are updating the physical copy, which I’d be super down for, I’m not buying them. Digital is way too convenient, and as long as I don’t delete the game from my hard drive its DRM key is just as effective as a physical copy anyway.",
                      "score": -6,
                      "created_utc": 1745534657.0,
                      "replies": [
                        {
                          "id": "movgbwa",
                          "author": "destinynftbro",
                          "body": "Until they delete your account for any reason whatsoever and now you’ve lost your library. Sure, it probably won’t happen, but do you want to take that risk for your favorite games/franchises? Physical games are cheap insurance.",
                          "score": 9,
                          "created_utc": 1745535036.0,
                          "replies": [
                            {
                              "id": "movitwq",
                              "author": "BRAND-X12",
                              "body": "Downloaded games don’t require account access. You could access those game from any profile.",
                              "score": -2,
                              "created_utc": 1745535872.0,
                              "replies": [
                                {
                                  "id": "moxdgfd",
                                  "author": "kchristy7911",
                                  "body": "Digital games require that you either are using the account that purchased the game, or that the Switch's primary account is the account that owns the game. If the account that owns the game is banned or deleted, access to those games go with it.",
                                  "score": 0,
                                  "created_utc": 1745561410.0,
                                  "replies": [
                                    {
                                      "id": "moxf37k",
                                      "author": "BRAND-X12",
                                      "body": "There’s no such thing as banned it deleted on a system that isn’t connected to the internet. \n\nI’m never worried about bans, don’t get banned. Deletes are more likely in the distant future, but by that point the system will be long permanently local. In that scenario my games are perfectly safe.",
                                      "score": 2,
                                      "created_utc": 1745562341.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "movkhya",
                  "author": "Docphilsman",
                  "body": "Literally every single console connects to the internet and most games require a network connection. Pretty much every game can be bricked remotely whether you own a physical copy or not. Physical media for downloads means nothing anymore, at this point it's just more plastic waste",
                  "score": -3,
                  "created_utc": 1745536424.0,
                  "replies": [
                    {
                      "id": "mow5sib",
                      "author": "-DementedAvenger-",
                      "body": "Doesitplay.org\n\n97% of Switch games have offline play. ~92% can be installed without downloading anything.",
                      "score": 1,
                      "created_utc": 1745543627.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "movcu0n",
              "author": "KrookedDoesStuff",
              "body": "If you don’t own a physical copy of a game, with that game on it, then at any point in time the company that makes the game can declare that you no longer have access to it and that game is just gone. You can’t re-download it, you can’t access already downloaded copies, it disappears.\n\nUnless my Super Nintendo breaks, or it’s cartridge breaks, I can play any SNES game I own at any time, even though they haven’t been sold in nearly 30 years.\n\nLook at Ubisoft with The Crew. If you owned it digitally, that game no longer works, at all.\n\nIt’d be the same scenario as you buy a Gucci shirt, and Gucci decides you aren’t allowed to own that shirt anymore, so it just unravels itself. Sure you have the thread, but the shirt is gone.",
              "score": 29,
              "created_utc": 1745533871.0,
              "replies": [
                {
                  "id": "movltwj",
                  "author": "sagevallant",
                  "body": "Still mad at Sony for taking away my digital copies of anime I bought through Funimation. They poofed away when Funi and Crunchyroll merged. Even though half the shit is available to stream on Crunchy still.\n\nThe upside? I still have the discs.",
                  "score": 5,
                  "created_utc": 1745536865.0,
                  "replies": [
                    {
                      "id": "movu5o1",
                      "author": "KrookedDoesStuff",
                      "body": "Yeah, I owned Hackers through Sony’s movie service they used to have (hack the planet!) and when they axed that I lost it.\n\nSo I went and downloaded a copy and shrugged it off, but it made me decide not to buy more movies digitally.",
                      "score": 2,
                      "created_utc": 1745539658.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "movez9w",
              "author": "silver0199",
              "body": "You don't own the game, you own key that can be revoked.\n\nWhat's more the game can be taken down and made unavailable to download.\n\nNintendo themselves have already shown that they are willing to take down entire online stores for their older platforms - they are not trustworthy in that regard.",
              "score": 5,
              "created_utc": 1745534588.0,
              "replies": []
            },
            {
              "id": "movd1cp",
              "author": "aircooledJenkins",
              "body": "I expect my gadgets to last a long long time. I do not want there to be a day when I go to play [new Legend of Zelda game] and I'm hit with \"we're sorry, the game servers supporting this game are no longer online, please check the number and dial again or ask the operator for assistance.\"\n\nI also want to be able to share games with my kid and be able to just play the game off the cart without having to download it to the console. Imagine we're on a road trip and he wants to play one of my games he hasn't played yet. If it's one of these key cards he can't until we either set up a hot-spot or get to somewhere with wifi then deal with getting the console online and waiting to download the game. Hopefully there's enough free space on the hard drive.\n\nSo, longevity of the poduct, and avoiding tech related headaches.",
              "score": 9,
              "created_utc": 1745533940.0,
              "replies": [
                {
                  "id": "movf5ho",
                  "author": "HereForTheTanks",
                  "body": "Played my original Ocarina of Time for N64 cartidge with my kid last year. Had to pop open the cart and put a new battery in, as they only last 20 years, but we will have that game for the rest of HER life I do t care how many button batteries I need to solder into place",
                  "score": 9,
                  "created_utc": 1745534645.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "movkp5a",
              "author": "ErGo404",
              "body": "Because in 25 years people who will get they switch 2 out to play out of nostalgia won't be able because Nintendo will have shut their servers down.",
              "score": 3,
              "created_utc": 1745536489.0,
              "replies": []
            },
            {
              "id": "movdbjp",
              "author": "ObviousPseudonym7115",
              "body": "You don't notice it matter for a few years because of the convenience of digital distribution.\n\nBut then the distribution servive shuts down. Or your account gets closed. Or the license distrubtion service has *their* license to distribute the content expire. etc\n\nSome of the concerns don't apply to first-party media delivered through first-party distribution services, but that same relationship gives the first-party more freedom to say \"okay, this system is done now. You can (maybe, eventually) buy it again over here.\"\n\nIf you get attached to your media or frame your spending as purchases, physical media (with no online requirements) is how you can make sure you keep what you pay for. \n\nDigitally distributed versions are essentially just an expensive way of renting access for a little while.",
              "score": 7,
              "created_utc": 1745534036.0,
              "replies": []
            },
            {
              "id": "movdaz7",
              "author": "CandyCrisis",
              "body": "The Wii Shop was shut down after 13 years. \n\nIt would be sad if all your games stopped working after 13 years, don't you think?",
              "score": 13,
              "created_utc": 1745534031.0,
              "replies": [
                {
                  "id": "movgq1e",
                  "author": "Ekyou",
                  "body": "The Wii shop’s *payment system* was shut down after 13 years. Even now you can still download games you purchased.\n\nAnd yes, one day that will change, but as of now, I don’t think there is a digital-era console that has turned off downloading games you’ve purchased. (PS Vita maybe? DSiware?)",
                  "score": 10,
                  "created_utc": 1745535167.0,
                  "replies": [
                    {
                      "id": "movnqbo",
                      "author": "CandyCrisis",
                      "body": "Does Stadia count? They did refunds. \n\nOuya should probably count.",
                      "score": 1,
                      "created_utc": 1745537499.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "movfq62",
              "author": "Quest-guy",
              "body": "People collect games, like to keep them as an archive/library. Digital games can straight up disappear from existence and can’t be sold/traded without buying a whole console if servers stop",
              "score": 2,
              "created_utc": 1745534836.0,
              "replies": []
            },
            {
              "id": "movjkv4",
              "author": "SpeechEuphoric269",
              "body": "You can re-sell a 20 year old Nintendo game for a signifigant amount of its original value, most Nintendo games/products retain value well.\n\nYou cant if its a digital game, because you dont “own” it",
              "score": 2,
              "created_utc": 1745536120.0,
              "replies": []
            },
            {
              "id": "movg9f7",
              "author": "Killahdanks1",
              "body": "Yeah, imagine 20 years from now you can play it. Digital titles won’t be supported at that time. I own all retro consoles back to the NES and while I don’t use them all the time, I don’t have to worry about someone maintaining a digital library to play games I want to. I wouldn’t be playing any of these if I was reliant on that.",
              "score": 1,
              "created_utc": 1745535013.0,
              "replies": []
            },
            {
              "id": "movc82x",
              "author": "ann0yed",
              "body": "I'll be a dick, I highly doubt this will stop them from buying games.",
              "score": -6,
              "created_utc": 1745533667.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mov8v2u",
          "author": "ShepardCommander001",
          "body": "AAA titties",
          "score": -9,
          "created_utc": 1745532550.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mov2o09",
      "author": "josephfry4",
      "body": "I can't wait to not buy a single one of these Game-Key Cards.",
      "score": 757,
      "created_utc": 1745530566.0,
      "replies": [
        {
          "id": "movwxuh",
          "author": "None",
          "body": "[removed]",
          "score": 398,
          "created_utc": 1745540601.0,
          "replies": [
            {
              "id": "movyurk",
              "author": "josephfry4",
              "body": "I prefer gamers having a choice between digital and physical, not digital and digital. And you are completely right. This is a HUGE waste of plastic-- and it's going to rear it's ugly head big time when the servers go offline. These can be sold secondhand for now, but will ineviteably be garbage in 20 years or less.",
              "score": 216,
              "created_utc": 1745541255.0,
              "replies": [
                {
                  "id": "moxoec8",
                  "author": "green_dragon527",
                  "body": "I agree, but they're not the first. My sis LOVES Dragon Age, so I had bought her Inquisition Special Edition online, thinking she would enjoy the goodies that used to come in special editions. I am also not in the US so I had to pay import fees on it. \n\nImagine our disappointment to find we paid extra to clear what was essentially an empty game box with a piece of paper inside, printed with a code.....she had to go download the game on EA Origins anyway.",
                  "score": 35,
                  "created_utc": 1745567970.0,
                  "replies": [
                    {
                      "id": "mozloe9",
                      "author": "hugg3rs",
                      "body": "Happened to me when I bought GoW Rangnarok. I hate this development.",
                      "score": 2,
                      "created_utc": 1745596209.0,
                      "replies": []
                    },
                    {
                      "id": "moxqfsx",
                      "author": "afrogrimey",
                      "body": "You expected a physical PC game?",
                      "score": -17,
                      "created_utc": 1745569259.0,
                      "replies": [
                        {
                          "id": "moyaa0f",
                          "author": "green_dragon527",
                          "body": "Yea, I expected a physical disc inside the box and some artwork, as she is such a big fan I thought it would make a nice birthday gift.",
                          "score": 15,
                          "created_utc": 1745580460.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "moxfzt7",
                  "author": "polopolo05",
                  "body": "lol wii u lasted 12 years... switch launched 8 years ago. wii lasted only 7 years.",
                  "score": 6,
                  "created_utc": 1745562871.0,
                  "replies": [
                    {
                      "id": "moykymq",
                      "author": "Vegaprime",
                      "body": "Well now I feel old.",
                      "score": 3,
                      "created_utc": 1745584772.0,
                      "replies": [
                        {
                          "id": "mozi12d",
                          "author": "polopolo05",
                          "body": "Well this is why no full physical  games  should be a huge issue... you can play them till the server goes away. No more smash. No more zelda. no more mario whatever.",
                          "score": 1,
                          "created_utc": 1745595152.0,
                          "replies": [
                            {
                              "id": "mozidei",
                              "author": "Vegaprime",
                              "body": "No wall of games in 20 years. You think people might hack and release by then?",
                              "score": 1,
                              "created_utc": 1745595251.0,
                              "replies": [
                                {
                                  "id": "mozivkw",
                                  "author": "polopolo05",
                                  "body": "hopefully but I am not going to hold my breathe.",
                                  "score": 1,
                                  "created_utc": 1745595398.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mowdsgo",
              "author": "jacob6875",
              "body": "The last physical game I bought on Xbox was a 2gb install from the disc and then a 60gb download. \n\nSo it downloaded the entire game anyway and now I have to find and insert the disc if I ever want to play it.",
              "score": 22,
              "created_utc": 1745546336.0,
              "replies": [
                {
                  "id": "mowo92q",
                  "author": "Nexus6-Replicant",
                  "body": "A lot of the time, the full game is on the disc, but the data for the update replaces what would be on the disc. \n\nGames like THPS6(? I think it was 6) are the exception, not the rule. \n\nFor example, the day 1 update does something to file asdf.123. Instead of copying it from the disc and then downloading the updated one from the internet, it just opts to download asdf.123 1.1 from the internet without bothering to copy it from the disc.\n\nDon't believe me? Disconnect your Xbox from the internet and reinstall the game.",
                  "score": 11,
                  "created_utc": 1745549981.0,
                  "replies": [
                    {
                      "id": "moxnnb7",
                      "author": "JC-Dude",
                      "body": "This is correct. Gran Turismo 7 has like a 100GB install and 100GB update if you start from scratch. It doesn't end up with a 200GB total size once done though - it's like 110-120GB in the end, because most of the updates just replace stuff.",
                      "score": 2,
                      "created_utc": 1745567507.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mowbbqp",
              "author": "faanawrt",
              "body": "Game-key cards aren't a download code. It's a cartridge that let's you download and play the game without locking it down to one system or account. Download codes in a plastic box have been a thing for years on Switch and game-key cards are a clear improvement over that.",
              "score": 25,
              "created_utc": 1745545505.0,
              "replies": []
            },
            {
              "id": "mowbbop",
              "author": "hurrpancakes",
              "body": "Is it a download code? I thought it just acts as a physical license, pop the cart in, download the game.",
              "score": 13,
              "created_utc": 1745545504.0,
              "replies": [
                {
                  "id": "mowfmb7",
                  "author": "fullload93",
                  "body": "Yes that’s exactly how it works but the problem with that is eventually the cartridge is going to be useless plastic because Nintendo will kill the download servers.",
                  "score": 43,
                  "created_utc": 1745546950.0,
                  "replies": [
                    {
                      "id": "mowlxjl",
                      "author": "niveksng",
                      "body": "I wish the EU pushes for something like \"If you have a digital only console, you must be able to download everything in perpetuity.\" to force companies to keep digital downloads open forever.",
                      "score": 29,
                      "created_utc": 1745549155.0,
                      "replies": [
                        {
                          "id": "mp3qlsn",
                          "author": "KingKookus",
                          "body": "Not possible. Any company that goes bankrupt would lose their content.",
                          "score": 1,
                          "created_utc": 1745647231.0,
                          "replies": [
                            {
                              "id": "mp8umka",
                              "author": "niveksng",
                              "body": "I'm OK with bankruptcy ending it, compared to planned shutdown",
                              "score": 1,
                              "created_utc": 1745718409.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mpdkrib",
                          "author": "rnnd",
                          "body": "All Nintendo download servers are still up even the Wii's. I don't see Nintendo permanently shutting down download servers unless the company goes out of business.",
                          "score": 1,
                          "created_utc": 1745787840.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "moxnhkp",
                      "author": "JC-Dude",
                      "body": "It still has most of the benefits of physical media, like the ease of selling the game once you're done with it.",
                      "score": 4,
                      "created_utc": 1745567408.0,
                      "replies": []
                    },
                    {
                      "id": "mox1g8n",
                      "author": "ofcpudding",
                      "body": "With the caveat that I **very much doubt this will happen:** In theory, game key cards could allow people to legally distribute (locked) game files even without Nintendo’s involvement. Again, I don’t see them actually condoning this, but it’s an interesting possibility.",
                      "score": 1,
                      "created_utc": 1745555300.0,
                      "replies": [
                        {
                          "id": "moysjxk",
                          "author": "fullload93",
                          "body": "Well yeah that’s not going to happen. So once Nintendo kills the servers in the future… better not uninstall that game or else it’s gone. And at that point resale of those cartridges will be pointless. \n\nNintendo has killed the Wii, Wii U, and 3DS eshops already. I’m sure Switch eshop will be on the chopping block in 5 years once everyone has moved on to Switch 2.",
                          "score": 2,
                          "created_utc": 1745587419.0,
                          "replies": [
                            {
                              "id": "moz1p8w",
                              "author": "Phoenix__Light",
                              "body": "Just pointing out that you can still get games you already own from the Wii store in 2025. For most people who have the games and resell them for the life of the console, this is fear mongering over a non issue unless the company itself goes under.",
                              "score": 1,
                              "created_utc": 1745590367.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mox4p8p",
                      "author": "peabody",
                      "body": "It's my understanding the NAND flash in the switch 1 carts degrades to unusable in 20-25 years, so those become worthless plastic as well.\n\nI'm sympathetic to people who want these physical games to be \"forever\", but even the consoles tend not to last that long before something goes wrong.\n\nI think the game key cards end up being a reasonable compromise which allows physical transferability while allowing for games to grow in size as graphics and content improve. It's my understanding switch carts cap out at a maximum capacity of 64gig and the reality is some games are already bigger than that, even for switch 2. Lots of games will need the ability to download their resources as a result.",
                      "score": -3,
                      "created_utc": 1745556816.0,
                      "replies": []
                    },
                    {
                      "id": "moy1w44",
                      "author": "None",
                      "body": "[removed]",
                      "score": -3,
                      "created_utc": 1745576282.0,
                      "replies": [
                        {
                          "id": "moykpv1",
                          "author": "fullload93",
                          "body": "What? Is this a joke comment? You’re aware that Wii, Wii U, and 3DS eshop stores shut down a long time ago right?",
                          "score": 6,
                          "created_utc": 1745584681.0,
                          "replies": [
                            {
                              "id": "mpslco4",
                              "author": "roial_with_cheeze",
                              "body": "You can still download digital Wii games you bought 20 years ago.",
                              "score": 1,
                              "created_utc": 1745991221.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "movzuuv",
              "author": "Accendor",
              "body": "Digital-only will be fine once I'm able to resell it.",
              "score": 11,
              "created_utc": 1745541596.0,
              "replies": [
                {
                  "id": "mow66eo",
                  "author": "-DementedAvenger-",
                  "body": "If the cartridge has a key on it that allows play, but without permanently adding it to your account, then (in theory) it could be resold.",
                  "score": 14,
                  "created_utc": 1745543761.0,
                  "replies": [
                    {
                      "id": "mow8sxy",
                      "author": "TheGameboy",
                      "body": "Until the servers go offline, and you can’t download the game files anymore.",
                      "score": 16,
                      "created_utc": 1745544655.0,
                      "replies": [
                        {
                          "id": "mow9ruy",
                          "author": "-DementedAvenger-",
                          "body": "Yep. That’s why I prefer games to be on-disc/cart",
                          "score": 7,
                          "created_utc": 1745544987.0,
                          "replies": []
                        },
                        {
                          "id": "moz245x",
                          "author": "Phoenix__Light",
                          "body": "This hasn’t even happened to the Wii yet from 2005. It’s safe to assume they’d be able to sell their games for the next 20 years at a minimum.",
                          "score": 3,
                          "created_utc": 1745590494.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mowvgsp",
                      "author": "MoltenTesseract",
                      "body": "That's exactly how the game key cards work as far as I am aware",
                      "score": 1,
                      "created_utc": 1745552733.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mown8ou",
              "author": "adrian783",
              "body": "the value is in being able to resell them.",
              "score": 2,
              "created_utc": 1745549620.0,
              "replies": [
                {
                  "id": "mowxkkv",
                  "author": "WeekendHistorical476",
                  "body": "Or lend them to friends and family.",
                  "score": 1,
                  "created_utc": 1745553610.0,
                  "replies": []
                },
                {
                  "id": "moxdlon",
                  "author": "pornographic_realism",
                  "body": "Which you won't be able to do if Nintendo shut down the servers for these. If the switch 2 isn't a major success we could see a new platform for their next console, with maybe some token DLC offered to people migrating accounts.",
                  "score": 0,
                  "created_utc": 1745561491.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mownqtq",
              "author": "TracyF2",
              "body": "Digital only is not fine because you don’t own any of the games you paid full price for. You are given a copy of the key to allow you to play the game but that’s it. If their servers go down then your digital only games you paid $60 easy for goes down with it.",
              "score": 1,
              "created_utc": 1745549800.0,
              "replies": []
            },
            {
              "id": "mowoq63",
              "author": "jonfitt",
              "body": "But as I understand it you can loan a game card or sell it. Download codes are locked to your device and not transferable.",
              "score": 1,
              "created_utc": 1745550149.0,
              "replies": []
            },
            {
              "id": "mowxkr4",
              "author": "pixel_of_moral_decay",
              "body": "Digital only isn’t fine either unless I can back it up and perpetually play it without internet access.\n\nTo many games can be revoked or become unplayable if the company decides to no longer support it.\n\nA lot of gamer culture will be lost to history due to unplayable old games.\n\nMeanwhile the classics of the 80’s and 90’s will forever be free to enjoy.",
              "score": 1,
              "created_utc": 1745553612.0,
              "replies": []
            },
            {
              "id": "mox2rzd",
              "author": "Schwertkeks",
              "body": "They are still a fully transferable license unlike a digital purchase",
              "score": 1,
              "created_utc": 1745555906.0,
              "replies": []
            },
            {
              "id": "moxmmrs",
              "author": "DommeUG",
              "body": "Digital only is not fine and we should fight back against this bullshit.",
              "score": 1,
              "created_utc": 1745566879.0,
              "replies": []
            },
            {
              "id": "mp0ynda",
              "author": "LodossDX",
              "body": "Eh, I don’t like them, but they aren’t like download codes. You can resell keycards just like standard game cards. My guess is a lot of third parties don’t want to eat the cost of game cards anymore. This was probably the middle ground.",
              "score": 1,
              "created_utc": 1745610566.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mowfrr6",
          "author": "Dhegxkeicfns",
          "body": "Guess what option you'll have for a lot of the games ...",
          "score": 3,
          "created_utc": 1745547003.0,
          "replies": [
            {
              "id": "mowgg7s",
              "author": "josephfry4",
              "body": "I've been picky the last 2 generations and I will continue to be. I'm used to it. Luckily, Nintendo seems to be pretty good about this sort of thing with their first party games.",
              "score": 1,
              "created_utc": 1745547238.0,
              "replies": [
                {
                  "id": "moxp6ot",
                  "author": "Grouchy_Egg_4202",
                  "body": "Retro only dad mode activate!\n\nBeen there for a minute myself with a lot of stuff.",
                  "score": 1,
                  "created_utc": 1745568462.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mox1n0a",
          "author": "mgd09292007",
          "body": "Want them to stop doing this then people need to not buy them in mass",
          "score": 1,
          "created_utc": 1745555385.0,
          "replies": []
        },
        {
          "id": "moxjdnv",
          "author": "Buuhhu",
          "body": "I really don't get their purpose outside of allowing publishers to say \"see we have physical copy available as well so stop complaining\"... For the consumer there's 0 reason to buy one of these over just buying it digitally.",
          "score": 1,
          "created_utc": 1745564864.0,
          "replies": []
        },
        {
          "id": "moxpwjb",
          "author": "--Arete",
          "body": "I think this is exactly what they want. Ease the transition to digital only and make you think it was your own choice.",
          "score": 1,
          "created_utc": 1745568912.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mov5hq7",
      "author": "djshadesuk",
      "body": "So game keys have the downside of physical media,  you have to get up to change the game, but not the upside, a physical copy that they cannot deny you access to.\n\nBrilliant /s",
      "score": 493,
      "created_utc": 1745531455.0,
      "replies": [
        {
          "id": "movc1r2",
          "author": "AlannaAbhorsen",
          "body": "Yup, downsides of both, upsides of neither.",
          "score": 84,
          "created_utc": 1745533608.0,
          "replies": []
        },
        {
          "id": "move2sn",
          "author": "WhisperingWind5",
          "body": "It's for the ability to sell the game key card if you wish. It's the same concept as PS4/PS5 discs, but smaller.\n\nModern games get constant updates, often on day 1 even, so anything on these cards without a patch update would be outdated anyway.",
          "score": 74,
          "created_utc": 1745534289.0,
          "replies": [
            {
              "id": "mow30rg",
              "author": "pandaSmore",
              "body": "https://www.doesitplay.org/ tells you if a game is playable without an update. I don't care if a game is \"outdated \" just ship the game in a playable state.  All the developers used to do this.",
              "score": 56,
              "created_utc": 1745542683.0,
              "replies": [
                {
                  "id": "mow6gnx",
                  "author": "-DementedAvenger-",
                  "body": "Yeah people have a huge misconception about games being on the disc, and I’ve been sharing that website for a while whenever it comes up. \n\nAbout 90% of PS4/5 games are on-disc.",
                  "score": 26,
                  "created_utc": 1745543856.0,
                  "replies": []
                },
                {
                  "id": "mowpw2u",
                  "author": "Eurynom0s",
                  "body": "Sure, it's become common in general. But the reason this is news is that Nintendo, until now, has always sold physical media that contained a full playable copy of the game.",
                  "score": 4,
                  "created_utc": 1745550572.0,
                  "replies": [
                    {
                      "id": "mpslki2",
                      "author": "roial_with_cheeze",
                      "body": "The still do. All of the games doing this are from third-party publishers.",
                      "score": 1,
                      "created_utc": 1745991336.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mowohla",
                  "author": "Dhiox",
                  "body": ">All the developers used to do this.\n\nI mean, games have changed. Imagine games like fortnite, it would be impossible to ship the game in a playable state like that.",
                  "score": -5,
                  "created_utc": 1745550063.0,
                  "replies": [
                    {
                      "id": "mowq4xp",
                      "author": "Eurynom0s",
                      "body": "Fortnite also requires servers to be online by the nature of it being an online game. Not a particularly good comparison to single player games.",
                      "score": 9,
                      "created_utc": 1745550663.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "movuf6v",
              "author": "L4t3xs",
              "body": "Only reason they are bringing up resale is to justify the price increase as well.",
              "score": 20,
              "created_utc": 1745539746.0,
              "replies": []
            },
            {
              "id": "mowpk63",
              "author": "Eurynom0s",
              "body": "A cartridge still represents a playable copy of the game that doesn't require the company's servers to still be online.",
              "score": 6,
              "created_utc": 1745550452.0,
              "replies": []
            },
            {
              "id": "moz26dm",
              "author": "pm_social_cues",
              "body": "It’s not GOOD that disc based systems do this either.\n\nIf I put a PS5 disc into a PS5 console, I should get two choices. Play game from disc exactly as it is made with absolutely no internet required, or check for latest version and download. It hasn’t been that way since the PS3 as far as I remember. Xbox is the same so it’s not a complaint about Sony specifically.",
              "score": 2,
              "created_utc": 1745590513.0,
              "replies": []
            },
            {
              "id": "mow2k5p",
              "author": "Effective-Ad-789",
              "body": "That’s somewhat true but there’s been plenty of games you can still play even without updates. So even in a serverless world, you’d still get a lot of *game*.. ",
              "score": 2,
              "created_utc": 1745542525.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp075ac",
          "author": "DragonSlayerC",
          "body": "It has the upside that you can sell it or give it to someone else.",
          "score": 1,
          "created_utc": 1745602415.0,
          "replies": [
            {
              "id": "mp0twdd",
              "author": "AlannaAbhorsen",
              "body": "We don’t know that yet. Download codes are generally one and done.\n\nIt was also a big deal a few years back when Nintendo started selling ‘physicals’ in Japan that were a box with a single use download code.\n\nI wouldn’t put similar shenanigans past them this time.",
              "score": 1,
              "created_utc": 1745609112.0,
              "replies": [
                {
                  "id": "mp0z5p3",
                  "author": "DragonSlayerC",
                  "body": "I'm assuming that it works like basically all modern games in other consoles, where the disc contains the license, so if you have the disc you can play the game. It would be insane to tie a physical cartridge to an account. They definitely are actual cartridges and not just a code on paper.",
                  "score": 1,
                  "created_utc": 1745610720.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mp40gj6",
          "author": "Genericuser2016",
          "body": "It retains the upside of being tradable/ sellable at least.  It's not a good development, but it's not actually different from what some publishers were doing with switch games already.  A few larger games already didn't have the game, or at least the whole game on the card. These look like they will incentivize almost everyone to go that route though.  They must cost less, so why wouldn't you (the publisher)?",
          "score": 1,
          "created_utc": 1745652823.0,
          "replies": []
        },
        {
          "id": "moyk1h6",
          "author": "Dayv1d",
          "body": "Yes it is. It is physical media that is also cheap to produce :-)",
          "score": 0,
          "created_utc": 1745584431.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mov48wh",
      "author": "Exerionx",
      "body": "Will actively avoid these, what a joke.",
      "score": 226,
      "created_utc": 1745531060.0,
      "replies": [
        {
          "id": "mowm3be",
          "author": "MovieGuyMike",
          "body": "That’s what they want, sadly.",
          "score": 14,
          "created_utc": 1745549210.0,
          "replies": []
        },
        {
          "id": "mowo1rf",
          "author": "TracyF2",
          "body": "I’m content with my switch. That thing will probably work for years and years until Nintendo can become a more fair company.",
          "score": -1,
          "created_utc": 1745549911.0,
          "replies": [
            {
              "id": "mowv3xb",
              "author": "Gheezer1234",
              "body": "Are you high?",
              "score": 4,
              "created_utc": 1745552590.0,
              "replies": [
                {
                  "id": "moy8pos",
                  "author": "SmokelessSubpoena",
                  "body": "I think they meant their switch 1, which is how i would agree. I'm just going to buy more PHYSICAL Switch 1 games, and probably never purchase a Switch2.\n\n\n\n\n\nMy next gen, if ever buying a console again, will be Xbox or Playstation now.\n\n\n\n\n\nOh, and let's not even discuss the disgusting \"pre-order\" aka _give it to the robotic scalpers_ process. \n\n\n\n\n\nNintendo died to me a few nights ago.",
                  "score": 2,
                  "created_utc": 1745579743.0,
                  "replies": [
                    {
                      "id": "mp2sth9",
                      "author": "TracyF2",
                      "body": "Yes, I will hold onto my switch 1 for as long as I can. Whenever I buy an older nintendo game it’s used because I don’t justify making people pay brand new prices for an older game. If it’s brand, like when Mario Party Jamboree first came out, I don’t mind paying a brand new price for a brand new game. \n\nThere’s scalpers everywhere so I say don’t hate Nintendo for the scalpers. On the other hand, they should’ve had a better fool proof ordering process with how long we’ve been dealing with scalpers. As other commenters have said, they’ve walked into their respective game stores and was still able to get a switch 2 with no preorder involved.",
                      "score": 1,
                      "created_utc": 1745632641.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mowynso",
                  "author": "TracyF2",
                  "body": "Charging brand new prices for a decade old game is fair to you? Or fans trying to show fan support of your creations but you sue the ever living hell out of them? You don’t see Microsoft doing that with Skyblivion, a project that has been publicly known for years, and it might even be better than the official remaster. You don’t see Sony being stingy with their exclusives on steam yet Nintendo doesn’t have a single exclusive to any other hardware or software but their own.\n\nI’m sorry, I didn’t answer your question. I smoke weed daily because I prefer that over narcotics. My tolerance is way too high so I don’t get the mental high anymore, I just get the body calming effect. Either way, for being a stoner, I believe I spoke clearly. So yes, I am “high”. Every. Single. Day. Probably for the rest of my life.",
                  "score": 1,
                  "created_utc": 1745554081.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mouzp0s",
      "author": "prinnydewd6",
      "body": "Maybe it’s being born in 94. And having such a giant library of games growing up and a backlog I’ll never see the end of… but I could be done with new games from here on. I’ll just stick to the greats. Where it was physically in my possession",
      "score": 288,
      "created_utc": 1745529633.0,
      "replies": [
        {
          "id": "mov2pee",
          "author": "LarryLobster69",
          "body": "Bring back consoles that didnt require any sort of internet connection to have fun!",
          "score": 116,
          "created_utc": 1745530578.0,
          "replies": [
            {
              "id": "mov5oe3",
              "author": "FindtheFunBrother",
              "body": "That’s when they lost this old guy. My first system was a Magnivox Odyssey Color way back in the early 80s, the an Atari 5600, then loads of games in my Apple IIe, nes, snes, ps1, ps2, ps3, and Xbox360. \n\nThere’s more than enough to keep me occupied for the rest of my life just playing games made for those systems. Currently about 1/3 of the way through Chrono Trigger for the first time. \n\nAnd now that I have an anbernic handheld gaming device I can carry around with me games from most of the systems.",
              "score": 32,
              "created_utc": 1745531514.0,
              "replies": [
                {
                  "id": "mowo672",
                  "author": "Crimson_Rhallic",
                  "body": "Join us over in the r/chronotrigger sub, we love to live vicariously through other people's play throughs, even if it's your 95th NG+.",
                  "score": 1,
                  "created_utc": 1745549954.0,
                  "replies": [
                    {
                      "id": "mowv8g2",
                      "author": "FindtheFunBrother",
                      "body": "Already there, friend.",
                      "score": 1,
                      "created_utc": 1745552640.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mow2was",
              "author": "Neo_Techni",
              "body": "see: Evercade",
              "score": 1,
              "created_utc": 1745542642.0,
              "replies": []
            },
            {
              "id": "mov8eyh",
              "author": "Capgunkid",
              "body": "Pretty much the Switch. I have to turn on my Hotspot so my kids games will open.",
              "score": 0,
              "created_utc": 1745532402.0,
              "replies": []
            },
            {
              "id": "movsxzf",
              "author": "ILikeMyGrassBlue",
              "body": "Okay, then say goodbye to patches and hello to unfixable game breaking bugs!",
              "score": -9,
              "created_utc": 1745539241.0,
              "replies": [
                {
                  "id": "movujas",
                  "author": "TheSwimMeet",
                  "body": "Maybe they shouldnt rush games out to avoid these game breaking bugs",
                  "score": 9,
                  "created_utc": 1745539785.0,
                  "replies": []
                },
                {
                  "id": "movwacz",
                  "author": "Jet_Jirohai",
                  "body": "Yes because that was so common back when devs had to make sure things worked before they released games",
                  "score": 4,
                  "created_utc": 1745540382.0,
                  "replies": []
                },
                {
                  "id": "mow8nwc",
                  "author": "No-Bother6856",
                  "body": "That wasn't a big issue in the pre-internet era of consoles. \n\nI do have one single GBA game thats actually impossible to complete because of a bug, but even back then, the publisher would replace it with a patched version for free if you asked.",
                  "score": 0,
                  "created_utc": 1745544608.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mov4fnf",
          "author": "Kortar",
          "body": "I feel the same. My backlog is so fucking massive at this point.",
          "score": 9,
          "created_utc": 1745531119.0,
          "replies": []
        },
        {
          "id": "movk7jp",
          "author": "Mr_Piddles",
          "body": "Honestly, I’m at the point in my life where I don’t often replay games. I just don’t have the time, and only play 3-4 games a year. Nonownership sucks, but it’s also unlikely to affect me.",
          "score": 4,
          "created_utc": 1745536328.0,
          "replies": []
        },
        {
          "id": "movevyp",
          "author": "The-Dudemeister",
          "body": "I was born in 86 and dont want all this junk laying around and having swap stuff. I’ll buy everything from the estore from the console.",
          "score": 6,
          "created_utc": 1745534558.0,
          "replies": []
        },
        {
          "id": "mov9ntz",
          "author": "derintrel",
          "body": "Age has nothing to do with it. I'm 2 years older than you and new game releases are just as exciting as ever. The feeling of Breath of the Wild, Elden Ring, Blue Prince!\n\nDon't let go of this amazing hobby, just don't be afraid to take a break and relax.",
          "score": 3,
          "created_utc": 1745532816.0,
          "replies": []
        },
        {
          "id": "moxhmxz",
          "author": "Space_Lux",
          "body": "As a PC gamer, that ship has looooong sailed anyway. The only real option is GOG.",
          "score": 1,
          "created_utc": 1745563828.0,
          "replies": []
        },
        {
          "id": "moxpp4n",
          "author": "Nattekat",
          "body": "I'm from 96 and really feel old when I see people talking about dlc and all that. \n\n\nI just want a game that's finished from release, I'm not really interested in more content. Plug and play is the way to go. ",
          "score": 1,
          "created_utc": 1745568782.0,
          "replies": []
        },
        {
          "id": "mov99go",
          "author": "PointOfTheJoke",
          "body": "I've been working my way through the SNES catalog since like 2020 and I'm nowhere near close.",
          "score": 1,
          "created_utc": 1745532683.0,
          "replies": []
        },
        {
          "id": "movvdrk",
          "author": "Spiritofhonour",
          "body": "I already have seen some of the issues related to the backlog issue. I bought the Resident Evil Triple Pack collection. It is supposed to be RE 4/5/6. Well it really is 4 on a cartridge and a download code for 5/6 which no longer work after a date which had already passed by the time I opened it.",
          "score": 1,
          "created_utc": 1745540078.0,
          "replies": [
            {
              "id": "movxucs",
              "author": "None",
              "body": "This is not the same as download codes. These carts act as license keys, they can’t expire until the servers get completely shut down.",
              "score": 0,
              "created_utc": 1745540910.0,
              "replies": [
                {
                  "id": "movzaw8",
                  "author": "Spiritofhonour",
                  "body": "I know; but the other person was mentioning they have a backlog. I've waited for a while to open some new physical games. Some games I've collected have already had servers shut down (eg. 3DS). I have a copy of 3DS Pokemon Red release in physical format that cannot be downloaded even if it was a similar implementation of physical cart potentially.",
                  "score": 1,
                  "created_utc": 1745541408.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "movr67f",
      "author": "eulynn34",
      "body": "Thanks for the heads up. This is a dealbreaker for me. The best thing about switch is most of the games are actual games that can be played right off the card.",
      "score": 31,
      "created_utc": 1745538646.0,
      "replies": [
        {
          "id": "mowp7tt",
          "author": "Dhiox",
          "body": "FYI, only third party devs are doing this, Nintendo isn't. And I'd get used to this to be honest, the days of physical releases are clearly numbered. Not sure why folks are so worked up, PCs haven't gotten physical releases since I was a kid, and no one acts like that's the end of the world.",
          "score": 2,
          "created_utc": 1745550327.0,
          "replies": [
            {
              "id": "moz2zfd",
              "author": "pm_social_cues",
              "body": "What do you mean? Lots of people understand that having the only available digitally is bad. Anybody who ever listened to streaming music and had some music removed due to licensing issues between the artist/record label and the streaming service can predict that the exact thing will eventually happen with games. You won’t get your money back if a game you buy gets removed from the digital store (and your own computer).",
              "score": 8,
              "created_utc": 1745590757.0,
              "replies": [
                {
                  "id": "mp5em5h",
                  "author": "IIlIIlIIIIlllIlIlII",
                  "body": "Usually, you keep downloaded games that get removed from the store.",
                  "score": 1,
                  "created_utc": 1745677223.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "moxfcrt",
              "author": "None",
              "body": "[deleted]",
              "score": 7,
              "created_utc": 1745562496.0,
              "replies": [
                {
                  "id": "moyq3uu",
                  "author": "Dhiox",
                  "body": ">no vendor in the PC space has just decided to close down their shop on old hardware and told people to get fucked.\n\nThere's a ton of old pc games that are basically unplayable on new operating systems",
                  "score": 3,
                  "created_utc": 1745586586.0,
                  "replies": [
                    {
                      "id": "mp03fmc",
                      "author": "Bluemikami",
                      "body": "That’s why vms exist at least.",
                      "score": 1,
                      "created_utc": 1745601360.0,
                      "replies": []
                    },
                    {
                      "id": "mp12hp8",
                      "author": "Nemace",
                      "body": "Not sure what this has to do with what I said.",
                      "score": 1,
                      "created_utc": 1745611747.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "moxeqjg",
          "author": "TheEdes",
          "body": "I mean kinda barely, some games (pokemon brilliant diamond comes to mind) are incomplete and need a download anyway, might as well have them load the data from the fast SSD instead of the cheap flash.",
          "score": 1,
          "created_utc": 1745562139.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mov0e5y",
      "author": "None",
      "body": "Damn they know their shit is going to get jailbroken and quick too",
      "score": 48,
      "created_utc": 1745529849.0,
      "replies": [
        {
          "id": "mow418z",
          "author": "_RADIANTSUN_",
          "body": "It won't be cuz of the keycards tho cuz this will probably be just like what they did with some of the 3DS and Switch online games (I think Sun and Moon did this) which have some embedded certificate per copy, if someone copies a game and 2 ever show up at the same time and flagged, it gets banned immediately, nobody had any good way around this, it's just banned from online.\n\nThey are just moving that system to a more aggressive position, essentially the whole game acquisition process will be \"online\".",
          "score": 3,
          "created_utc": 1745543027.0,
          "replies": []
        },
        {
          "id": "moxfsrj",
          "author": "right_there",
          "body": "I bought the original Switch and it sat unopened in the closet for 9 months until it could be hacked. Never bought a game or any accessories for it. Still played every game I ever wanted to play. I wasn't ever going to pay for Nintendo's exploitative and exorbitantly priced shit internet service anyway, so there was no downside to never being able to go online. Still got updates and DLCs for free.\n\nThe Switch 2 is so expensive and so disgustingly scummy to the consumer that I may straight-up pass on it entirely, so Nintendo won't even get the money for the console that they got out of me for the Switch.\n\nI have hacked basically every Nintendo console I own and their hackability is the only reason I own any of their products in the first place. With the way I play games, there's a 0% chance that I'm paying even $50 for a title. $70 and $80 is completely out of the question. I tend to get really into a single game every 4-6 months, play it nonstop for like three days, and then never touch it again.\n\nThe shit they've got going on is not worth it, and they've even managed to ruin the only series that DOES usually get me to play for longer (Pokemon) to the point where I drop the new ones in less than a day and just go back to the GBA and DS games, or other games in Nintendo's back catalogue that, over the past two decades, they've been trying to trick me into buying multiple times when I already own them. I scrounged up my birthday money as a kid to buy the old game at a huge price (adjusted for inflation) when it launched, I'm not going to be nickeled and dimed every console generation buying a poorly-emulated version of it over and over again.",
          "score": 4,
          "created_utc": 1745562757.0,
          "replies": [
            {
              "id": "moxoybm",
              "author": "Dracogame",
              "body": "Honestly I wouldn't mind paying for the convenience, but nowdays they make you feel stupid. It's not even about the money, I just feel ripped off. Pay more, worst service, increasingly lazy releases. Like, what?",
              "score": 5,
              "created_utc": 1745568315.0,
              "replies": []
            },
            {
              "id": "moxn5i6",
              "author": "None",
              "body": "Couldn’t have said it better myself I’m holding off on this switch entirely as well",
              "score": 3,
              "created_utc": 1745567201.0,
              "replies": []
            },
            {
              "id": "moxh1ya",
              "author": "BennieOkill360",
              "body": "Amen",
              "score": 4,
              "created_utc": 1745563487.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp07n42",
          "author": "DragonSlayerC",
          "body": "How is that related to game key cards?",
          "score": 1,
          "created_utc": 1745602555.0,
          "replies": []
        }
      ]
    },
    {
      "id": "movpvny",
      "author": "Cakalacky",
      "body": "Remember everyone you effectively own nothing",
      "score": 11,
      "created_utc": 1745538217.0,
      "replies": []
    },
    {
      "id": "mouzqhy",
      "author": "Feraligreater328",
      "body": "Very nice of Nintendo to talk me out of buying non-Nintendo exclusives on their shit. Good guy Nintendo saving me $80 a pop.",
      "score": 120,
      "created_utc": 1745529645.0,
      "replies": [
        {
          "id": "movav45",
          "author": "DontForgorTheMilk",
          "body": "Not trying to necessarily defend Nintendo, but it's literally the choice of the 3rd-party ~~devs~~ publishers to do the game-key cards. Nintendo's not forcing any of them to do it.",
          "score": 45,
          "created_utc": 1745533214.0,
          "replies": [
            {
              "id": "movc7u4",
              "author": "Feraligreater328",
              "body": "Allow me to correct myself. Very nice of the third party companies to encourage me to wait for the Steam sale to buy their stuff. Good guy third-party developers saving me $80.",
              "score": 48,
              "created_utc": 1745533664.0,
              "replies": [
                {
                  "id": "movdh6m",
                  "author": "Rfl0",
                  "body": "Just how the ecosystem works, the carts are expensive to produce so the game keys still give the developer the option to still be on store shelves without incurring a huge cost and for most consumers the download doesn’t really matter. If steam and digital is your preferred option then more power to you. These are companies that are still looking to make a profit off of Nintendo only consumers that may not play their games otherwise, not you.",
                  "score": 18,
                  "created_utc": 1745534089.0,
                  "replies": [
                    {
                      "id": "movreue",
                      "author": "PSIwind",
                      "body": "It also helps get these new carts on the store shelves and sell to bring demand up and cost down. The Switch 1 launched with only one game being on a 32 GB Cart and a year or two later, it became more common",
                      "score": 8,
                      "created_utc": 1745538726.0,
                      "replies": []
                    },
                    {
                      "id": "mp2c4d2",
                      "author": "TodaysThrowawayTmrw",
                      "body": "Are you kidding? Memory is so cheap these days and the cartridge is a little inconsequential piece of plastic. But whatever, I'd pay the 10 extra bucks to actually own something not tied to the life of a server if cost is the real issue (which its not)",
                      "score": 2,
                      "created_utc": 1745626676.0,
                      "replies": []
                    },
                    {
                      "id": "mox4mbp",
                      "author": "Mean-Evening-7209",
                      "body": "How much does it cost to manufacturer a cart and a game cartridge?",
                      "score": 1,
                      "created_utc": 1745556777.0,
                      "replies": []
                    },
                    {
                      "id": "mozklvs",
                      "author": "Ventira",
                      "body": "And unlike typical digital keys, these can actually be resold, as they do not bind to the console or your account, per Nintendo's own words.",
                      "score": 1,
                      "created_utc": 1745595898.0,
                      "replies": []
                    },
                    {
                      "id": "movdlig",
                      "author": "Feraligreater328",
                      "body": "Fair point.",
                      "score": -2,
                      "created_utc": 1745534130.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mow8yh9",
                  "author": "No-Bother6856",
                  "body": "Accurate. But also I was never considering buying a game thats available on steam, on switch anyway",
                  "score": 2,
                  "created_utc": 1745544707.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mowg4bw",
              "author": "eestionreddit",
              "body": "Nintendo's only making two sizes of proper game card, 8 GB and 64 GB. Some games simply don't fit on 64 GB cards, but otherwise it seems like publishers just want to save a buck.",
              "score": 1,
              "created_utc": 1745547125.0,
              "replies": []
            }
          ]
        },
        {
          "id": "movvvyg",
          "author": "51010R",
          "body": "It isn’t Nintendo though?\n\nLike this if this is common on Switch, it’ll be common on Sony consoles and Microsoft too.\n\nNintendo only made the change of putting in the box which ones are just a game key, which if you ask me, is a positive change.",
          "score": 9,
          "created_utc": 1745540249.0,
          "replies": [
            {
              "id": "mowgbel",
              "author": "danjospri",
              "body": "I feel crazy reading these comments. Game key cards aren’t a new concept",
              "score": 10,
              "created_utc": 1745547193.0,
              "replies": [
                {
                  "id": "mowhx5d",
                  "author": "twiztedterry",
                  "body": "Fucking same! They've been a thing for YEARS. There is a difference here though - it's an actual fucking cartridge that you have to put in the console to play the game.\n\nBasically it's exactly what they were doing before with cartridges, but instead of putting the game on that cartridge, the put an encrypted key that is only used to verify ownership during play.\n\nI'm in agreeance that this is fucking idiotic.",
                  "score": 9,
                  "created_utc": 1745547756.0,
                  "replies": [
                    {
                      "id": "mowiak1",
                      "author": "danjospri",
                      "body": "Doesn’t it allow you to sell or share them though? Which isn’t what you can typically do with a digital game.",
                      "score": 8,
                      "created_utc": 1745547885.0,
                      "replies": [
                        {
                          "id": "mownxu3",
                          "author": "adrian783",
                          "body": "I think signs points to yes",
                          "score": 3,
                          "created_utc": 1745549871.0,
                          "replies": []
                        },
                        {
                          "id": "mowis3q",
                          "author": "twiztedterry",
                          "body": "You can already share digital games on switch, but you're correct that you can now sell them.",
                          "score": 0,
                          "created_utc": 1745548051.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mp2cec1",
                      "author": "TodaysThrowawayTmrw",
                      "body": "The whole point is that people \\*want\\* the game on the cartridge. I don't want to download shit. I want to be able to plop that thing into any system 20 years from now and to have it work. Which it won't once the server hosting the actual game content goes offline.",
                      "score": 1,
                      "created_utc": 1745626772.0,
                      "replies": [
                        {
                          "id": "mp3i6np",
                          "author": "twiztedterry",
                          "body": ">The whole point is that people *want* the game on the cartridge\n\nExactly. They're learning the wrong lessons, lol.",
                          "score": 1,
                          "created_utc": 1745642808.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "movcp2q",
          "author": "Easylikeyoursister",
          "body": "aware library spoon steep sophisticated groovy ghost entertain license chase\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 6,
          "created_utc": 1745533825.0,
          "replies": [
            {
              "id": "mow42sa",
              "author": "JS-87",
              "body": "No, zero games other than the best selling switch game sequel is $80.",
              "score": 1,
              "created_utc": 1745543041.0,
              "replies": []
            },
            {
              "id": "movcz8b",
              "author": "Feraligreater328",
              "body": "I’m following the assumption that $80 is the base price. If I’m wrong, then fantastic. I’d LOVE for Nintendo to make me look stupid.",
              "score": -11,
              "created_utc": 1745533920.0,
              "replies": [
                {
                  "id": "movdw70",
                  "author": "Lucienofthelight",
                  "body": "You’re wrong. The only game right now that are 80 are Tears of the Kingdom and Mario Kart. The Rest are 70. Now this can change, but that’s the official so far. ToTK was already 70 on switch though, and is 10 for the upgrade if you if you already own it. I believe the switch online expansion pass gives you the upgrade for free as well.\n\nI’m not saying these things are great, but there has definitely been a deliberate attempt to sow negativity with this launch.",
                  "score": 10,
                  "created_utc": 1745534229.0,
                  "replies": [
                    {
                      "id": "movegn1",
                      "author": "Feraligreater328",
                      "body": "Not trying to sow negativity. $80 and $70 are both ridiculous. The gaming industry, in general, is getting greedy as hell. Higher prices for less content these days, with several notable exceptions of course.\n\nTitles that appear to have a lot to do, like Mario Kart World, I’d pay more for. But the general increase in price is frustrating and makes me want to buy games less.",
                      "score": -8,
                      "created_utc": 1745534417.0,
                      "replies": [
                        {
                          "id": "movxaag",
                          "author": "Easylikeyoursister",
                          "body": "boast reply alive depend hospital dog shaggy snow familiar spectacular\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                          "score": 5,
                          "created_utc": 1745540720.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mowfxl7",
          "author": "eestionreddit",
          "body": "There are exceptions. Cyberpunk 2077 is the big one announced right now, coming on a full 64 GB cartridge.",
          "score": 1,
          "created_utc": 1745547059.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mov1jkp",
      "author": "vitullo_31",
      "body": "Not on my shelf they won't be",
      "score": 29,
      "created_utc": 1745530211.0,
      "replies": [
        {
          "id": "movh3vx",
          "author": "wiriux",
          "body": "You mean iShelf",
          "score": 5,
          "created_utc": 1745535297.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mov23sh",
      "author": "Vitss",
      "body": "It's going to be very funny if the most reliable way to have physical media on the console, ended up being a flashcard.",
      "score": 19,
      "created_utc": 1745530389.0,
      "replies": []
    },
    {
      "id": "movj5a6",
      "author": "Demien19",
      "body": "Key Generators incoming",
      "score": 40,
      "created_utc": 1745535976.0,
      "replies": []
    },
    {
      "id": "movp626",
      "author": "Alternative-Juice-15",
      "body": "I won’t buy those titles if I do decide to get the switch 2.  They’ll eventually be useless",
      "score": 8,
      "created_utc": 1745537982.0,
      "replies": []
    },
    {
      "id": "mouxziw",
      "author": "smack54az",
      "body": "There goes game preservation for the Switch 2.  I buy as many of my Switch games as physical media because I don't want to lose access to them.",
      "score": 35,
      "created_utc": 1745529102.0,
      "replies": [
        {
          "id": "mov7cjl",
          "author": "Tokiw4",
          "body": "Im sure there's a subset of high-seas travelers who are quite excited to... Preserve... All of Nintendo's new releases.",
          "score": 15,
          "created_utc": 1745532051.0,
          "replies": []
        },
        {
          "id": "moxfpxr",
          "author": "green_link",
          "body": "im sure there will be a firmware exploit that will allow you to run modded software/firmware to backup any and all downloaded game data, just like on any previous consoles. especially if the switch2 is on the same architecture as the switch1.",
          "score": 1,
          "created_utc": 1745562711.0,
          "replies": []
        },
        {
          "id": "mowph78",
          "author": "Dhiox",
          "body": "It's only third party games.",
          "score": 1,
          "created_utc": 1745550421.0,
          "replies": [
            {
              "id": "moxfkps",
              "author": "green_link",
              "body": "so far",
              "score": 1,
              "created_utc": 1745562625.0,
              "replies": [
                {
                  "id": "moypw6g",
                  "author": "Dhiox",
                  "body": "There's no reason to believe Nintendo will do it.",
                  "score": 1,
                  "created_utc": 1745586512.0,
                  "replies": [
                    {
                      "id": "moyqi03",
                      "author": "green_link",
                      "body": "But there is. The game-key carts are right there they have every incentive to release games on game-key carts. They've released digital only games before.",
                      "score": 1,
                      "created_utc": 1745586722.0,
                      "replies": [
                        {
                          "id": "moyqyc4",
                          "author": "Dhiox",
                          "body": "Nintendo doesn't cheap out on stuff like this. They offered these as an option to third Larry devs because third parties were upset about the high cost of cartridges.",
                          "score": 1,
                          "created_utc": 1745586877.0,
                          "replies": [
                            {
                              "id": "moysqr1",
                              "author": "green_link",
                              "body": "1 it's too early to claim that, 2 it's there why wouldn't Nintendo use it? It allows them to develop a game that exceeds the space limitations of a cart. I bet we will have Nintendo developed games that will come on a game-key cart",
                              "score": 1,
                              "created_utc": 1745587484.0,
                              "replies": [
                                {
                                  "id": "mozlg9p",
                                  "author": "Ventira",
                                  "body": "Because Nintendo are optimization wizards and even their newest games fall well below the 64gb limitation.",
                                  "score": 1,
                                  "created_utc": 1745596143.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "movlhdk",
      "author": "devious_burrito",
      "body": "These kind of remind me of the USB software dongles I had to use back in the day.",
      "score": 6,
      "created_utc": 1745536748.0,
      "replies": []
    },
    {
      "id": "movkxj5",
      "author": "thecraigbert",
      "body": "So you pay extra for the key card to still just download? Why are people excited about this new console?",
      "score": 15,
      "created_utc": 1745536565.0,
      "replies": [
        {
          "id": "mowovf1",
          "author": "Dhiox",
          "body": "It's only third party devs. Plus, how would this kill excitement for the console, most people don't even use physical games anymore.",
          "score": 3,
          "created_utc": 1745550203.0,
          "replies": [
            {
              "id": "mp2ckw4",
              "author": "TodaysThrowawayTmrw",
              "body": "I don't think that's a fair statement. I only buy physical games.",
              "score": 1,
              "created_utc": 1745626837.0,
              "replies": [
                {
                  "id": "mp2cqxs",
                  "author": "Dhiox",
                  "body": "Guess you're lucky you're not a PC gamer, we made this transition years ago.",
                  "score": 1,
                  "created_utc": 1745626896.0,
                  "replies": [
                    {
                      "id": "mp2d6xm",
                      "author": "TodaysThrowawayTmrw",
                      "body": "Except that on a PC I have all the install files. That I can then bring along with me to any computer. Totally different. I have a huge external hard drive with all the install files for every game I've ever owned.",
                      "score": 2,
                      "created_utc": 1745627052.0,
                      "replies": [
                        {
                          "id": "mp344lk",
                          "author": "Dhiox",
                          "body": "Having an exe for the game doesn't mean you can run It without a license",
                          "score": 1,
                          "created_utc": 1745636816.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "moy9atx",
          "author": "Snipedzoi",
          "body": "The vast majority dgaf",
          "score": 1,
          "created_utc": 1745580018.0,
          "replies": []
        },
        {
          "id": "movq8l9",
          "author": "Strict_Donut6228",
          "body": "New Nintendo games????",
          "score": -1,
          "created_utc": 1745538336.0,
          "replies": []
        }
      ]
    },
    {
      "id": "movpktm",
      "author": "MrTestiggles",
      "body": "And I’m going to not buy them. My collection of mostly physical 70 switch games will stay all on cart for the next additions",
      "score": 5,
      "created_utc": 1745538116.0,
      "replies": []
    },
    {
      "id": "mp0nrcn",
      "author": "james2432",
      "body": "can wait until they shutdown servers and ppl cry they can't access their games anymore",
      "score": 4,
      "created_utc": 1745607258.0,
      "replies": []
    },
    {
      "id": "mouuvkc",
      "author": "jackmax9999",
      "body": "Fun fact: the Switch 2 *does not* support microSD cards, only the expensive and rare microSD Express cards. They are currently about 2x as expensive as regular microSD and only available in sizes up to 512 GB. So to anyone saying \"it's fine, I'll just get a big SD card\"... sure but you'll have to pay a lot for it.",
      "score": 92,
      "created_utc": 1745528158.0,
      "replies": [
        {
          "id": "mouy1hp",
          "author": "RoflMyPancakes",
          "body": "This standard supports NVME speeds. It's like adding an M2 NVME drive to your system. I actually like this feature.  \n  \n(feature being fast expandable storage, not the game cards nonsense)",
          "score": 83,
          "created_utc": 1745529118.0,
          "replies": [
            {
              "id": "mov50z6",
              "author": "goozy1",
              "body": "One of the biggest hardware limitations to the original Switch was the slow SD card slot so this is a huge upgrade! Original Switch only supports UHS-I which is 60-95 MB/sec (which is slower than mechanical HDDs).",
              "score": 31,
              "created_utc": 1745531306.0,
              "replies": [
                {
                  "id": "mov7h73",
                  "author": "VietOne",
                  "body": "Source? Because even now on the SteamDeck the MicroSD card isn't a limitation.\n\n\nMax throughout is not as important as random seek times. This is why even first generation SSDs were so much faster in real world performance even though their throughput speeds were slower than majority of people who were using RAID anyway.",
                  "score": -13,
                  "created_utc": 1745532094.0,
                  "replies": [
                    {
                      "id": "movg5u9",
                      "author": "Trevski13",
                      "body": "\"isn't a limitation\" is a strong term. I had a much better experience with horizon zero dawn after moving it to the SSD. Did it run on the micro SD, yes, was it a good experience, no.  Specifically there was a lot of asset pop-in everywhere, it was especially distracting during cut scenes where the camera would change positions and things desperately tried to load as fast as they could. It also took forever to fast travel anywhere (but not as bad as Skyrim on the PS3 lol)\n\nTo be clear, many many games are playable without issues, but there are definitely a handful that struggle.",
                      "score": 10,
                      "created_utc": 1745534980.0,
                      "replies": [
                        {
                          "id": "movicem",
                          "author": "VietOne",
                          "body": "Yet on my SteamDeck horizon runs the same regardless on the MicroSD or NVMe. Sounds a lot more like you have a slower Microsd card than what the SteamDeck is known to be able to handle.\n\n\nMine benchmarks at 95-98 MBps which is about as fast as the spec allows. Given the results of majority of users on /r/SteamDeck, lower performing SD cards is the main reason for worse pop in than the interface itself ",
                          "score": -5,
                          "created_utc": 1745535709.0,
                          "replies": [
                            {
                              "id": "moz5gc3",
                              "author": "Phoenix__Light",
                              "body": "Games can be designed around the slow speeds of an HDD like last gen consoles were. However if you’re trying to get current gen ports, SSD speeds are basically mandatory",
                              "score": 1,
                              "created_utc": 1745591490.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "movn4o5",
              "author": "jackmax9999",
              "body": "Not quite, it only has one lane of PCIe 3.0. Even the cheapest NVMe drives I've seen have at least 2 lanes. Should be fast enough for a handheld though (if they remembered to give the card enough cooling).",
              "score": 2,
              "created_utc": 1745537297.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mouwxfw",
          "author": "celestiaequestria",
          "body": "Just wait.\n\nThe only thing vital to preorder is the Switch 2 itself. The worst time to buy an Express card is now. Storage prices will come down.",
          "score": 75,
          "created_utc": 1745528773.0,
          "replies": [
            {
              "id": "mov9kpq",
              "author": "GaijinHenro",
              "body": "Cheaper to just not buy a switch 2 for a few years.",
              "score": 13,
              "created_utc": 1745532788.0,
              "replies": [
                {
                  "id": "mowrb23",
                  "author": "NIN10DOXD",
                  "body": "Unless you live in the US, then God knows.",
                  "score": 1,
                  "created_utc": 1745551105.0,
                  "replies": []
                },
                {
                  "id": "moveb7v",
                  "author": "BMXBikr",
                  "body": "Cheaper to just emulate until Big Greedy Company stops being so fucking greedy and actually makes it worth it to just buy their shit. \n\n>\"Piracy is almost always a service problem and not a pricing problem\"  -Gabe Newell\n\n>\"If buying isn't owning, then pirating isn't stealing.\" -idk",
                  "score": -2,
                  "created_utc": 1745534367.0,
                  "replies": [
                    {
                      "id": "mowpq60",
                      "author": "Dhiox",
                      "body": ">Cheaper to just emulate until Big Greedy Company stops being so fucking greedy\n\nLet's be real, nothing they could do would actually change anything, you just want to steal without feeling guilty.",
                      "score": -3,
                      "created_utc": 1745550511.0,
                      "replies": [
                        {
                          "id": "mowq9xu",
                          "author": "BMXBikr",
                          "body": "I recently bought a bunch of GameCube and GBA games for hundreds of dollars even though I emulate them. Keep bootlicking Nintendo if you want though.",
                          "score": 1,
                          "created_utc": 1745550714.0,
                          "replies": [
                            {
                              "id": "mowv79l",
                              "author": "Dhiox",
                              "body": ">I recently bought a bunch of GameCube and GBA games for hundreds of dollars even though I emulate them.\n\nOkay? That doesn't pay for the games you did steal.",
                              "score": 0,
                              "created_utc": 1745552628.0,
                              "replies": [
                                {
                                  "id": "mowvzvl",
                                  "author": "BMXBikr",
                                  "body": "I didn't steal any",
                                  "score": 1,
                                  "created_utc": 1745552952.0,
                                  "replies": [
                                    {
                                      "id": "moww2g8",
                                      "author": "Dhiox",
                                      "body": "Did you illegally download copied switch roms off the internet?",
                                      "score": 0,
                                      "created_utc": 1745552982.0,
                                      "replies": [
                                        {
                                          "id": "moyafou",
                                          "author": "WaIterHWhite",
                                          "body": "That is called \"illegal filesharing\" which is not theft.\nAlso, if games are merely rentals to said game then how does one \"steal\" something they can never \"own\"?",
                                          "score": 0,
                                          "created_utc": 1745580530.0,
                                          "replies": [
                                            {
                                              "id": "moyole7",
                                              "author": "Dhiox",
                                              "body": "Try stealing a rental car and see if that argument holds up in court",
                                              "score": 1,
                                              "created_utc": 1745586061.0,
                                              "replies": [
                                                {
                                                  "id": "mozoitj",
                                                  "author": "WaIterHWhite",
                                                  "body": "No, because that is the original. It's not a copy.",
                                                  "score": 0,
                                                  "created_utc": 1745597044.0,
                                                  "replies": [
                                                    {
                                                      "id": "mozpd9u",
                                                      "author": "Dhiox",
                                                      "body": "Okay, try maming an unauthorized copy of a car and see if the car manufacturer is okay with it. Just because you buy something doesn't mean it's not very illegal to violate copyright.",
                                                      "score": 1,
                                                      "created_utc": 1745597294.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "movdbh6",
              "author": "KrookedDoesStuff",
              "body": "When the Switch came out I bought a 32gb sd card for $40, and Amazon accidentally sent me 9 of them. I wasn’t gonna complain. Gave them to everyone I knew.\n\nA 32gb sd card today costs $10.99. So, yeah, if people can’t deal with the 256gb onboard storage and *gasp* deleting games to make space, then they can eat that price. Meanwhile, I’ll just delete what I’m not playing.",
              "score": 2,
              "created_utc": 1745534035.0,
              "replies": [
                {
                  "id": "movrgnu",
                  "author": "jewsonparade",
                  "body": "That's something I never really understood. Yeah AAA games are bigger than ever. But I've never had an issue managing a handful of games on my PS5. I'm not going to play all those games in the same timeframe. I can delete the one or 2 I'm not actively playing.",
                  "score": 3,
                  "created_utc": 1745538742.0,
                  "replies": [
                    {
                      "id": "movufit",
                      "author": "KrookedDoesStuff",
                      "body": "I’ve known a number of people who refuse to delete games under any circumstance because “I might wanna play it!”\n\nI play a game, I beat the game, and if I’m going to trophy hunt I’ll keep it installed otherwise, I delete it right then and there.\n\nI can always redownload it (if it doesn’t get removed from the store) or install it again from the disc so it’s no big deal.",
                      "score": 3,
                      "created_utc": 1745539750.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mownr5a",
              "author": "stefanopolis",
              "body": "The best time to buy storage is always in 6 months.",
              "score": 1,
              "created_utc": 1745549804.0,
              "replies": []
            },
            {
              "id": "moxoohf",
              "author": "Dracogame",
              "body": "Buying the Switch 2 is not \"vital\"...",
              "score": 0,
              "created_utc": 1745568144.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mouy8ht",
          "author": "NorysStorys",
          "body": "I mean microSD Express is just the new version that’s eventually going to fully replace microSD, it’s not a crazy conspiracy.",
          "score": 40,
          "created_utc": 1745529177.0,
          "replies": [
            {
              "id": "movkks5",
              "author": "jackmax9999",
              "body": "Not a conspiracy, just another cost to keep in mind. If I was the designer of the console I probably would have made the same decision - I don't see any standard on the market that makes sense for this use case.",
              "score": 3,
              "created_utc": 1745536449.0,
              "replies": []
            },
            {
              "id": "mouykhu",
              "author": "None",
              "body": "[deleted]",
              "score": -3,
              "created_utc": 1745529281.0,
              "replies": [
                {
                  "id": "mov04y6",
                  "author": "rocketman19",
                  "body": "For now",
                  "score": 0,
                  "created_utc": 1745529770.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mouv3qj",
          "author": "treehumper83",
          "body": "1TB*",
          "score": 16,
          "created_utc": 1745528225.0,
          "replies": [
            {
              "id": "mouvbck",
              "author": "jackmax9999",
              "body": "I can't find any for sale, only announcements by Lexar from start of April.",
              "score": 6,
              "created_utc": 1745528287.0,
              "replies": [
                {
                  "id": "mouw87p",
                  "author": "diuturnal",
                  "body": "Lexar dropped them with the announcement. It's out of stock for obvious reasons, but it is available.",
                  "score": 16,
                  "created_utc": 1745528560.0,
                  "replies": [
                    {
                      "id": "mouy53k",
                      "author": "Gram64",
                      "body": "They're also $200, so almost half the price of the console itself",
                      "score": 3,
                      "created_utc": 1745529148.0,
                      "replies": [
                        {
                          "id": "movlzy8",
                          "author": "Dt2_0",
                          "body": "Yea, its a brand new SD spec. Wanna know how expensive the first 1tb SD card were when they hit the market?\n\nPrice on flash memory always comes down over time.",
                          "score": 5,
                          "created_utc": 1745536919.0,
                          "replies": [
                            {
                              "id": "movxr8p",
                              "author": "shifty_coder",
                              "body": "Probably way more expensive than the first SanDisk 1GB card I bought in 2002 for $90",
                              "score": 1,
                              "created_utc": 1745540880.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mov0obc",
                          "author": "Pika256",
                          "body": "Or the cost of two games and some gum.",
                          "score": 7,
                          "created_utc": 1745529938.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mouw77s",
                  "author": "Kientha",
                  "body": "Lexar have them on their Ali Express store but they're currently sold out. They were in stock earlier in the month though",
                  "score": 1,
                  "created_utc": 1745528552.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mouxb61",
          "author": "Chrisnness",
          "body": "It’s so games can run from the cards",
          "score": 15,
          "created_utc": 1745528891.0,
          "replies": [
            {
              "id": "mov5rqr",
              "author": "zeelbeno",
              "body": "Can't they just use the floppy disks I already have stored from 2000?",
              "score": 1,
              "created_utc": 1745531543.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mouxigw",
          "author": "bd_one",
          "body": "Does microSD Express have a much bigger read/write rate or something else weird?",
          "score": 7,
          "created_utc": 1745528953.0,
          "replies": [
            {
              "id": "mov1vzr",
              "author": "Microtic",
              "body": "Almost 900MB/s read rate.",
              "score": 21,
              "created_utc": 1745530321.0,
              "replies": [
                {
                  "id": "mov3k4i",
                  "author": "Sir_Bax",
                  "body": "To compare, original Switch supported read speeds up to 100 mb/s",
                  "score": 9,
                  "created_utc": 1745530845.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mouxtve",
              "author": "RatchetRussian",
              "body": "Much faster",
              "score": 13,
              "created_utc": 1745529053.0,
              "replies": []
            },
            {
              "id": "mow4x7h",
              "author": "JS-87",
              "body": "Nah, they just had a hard time marketing the mircoSD Molasses",
              "score": 1,
              "created_utc": 1745543333.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mov5oyb",
          "author": "prodigalAvian",
          "body": "Just like PS5 using NVMe, within 3 years it's awesome to have as an option as prices fall",
          "score": 5,
          "created_utc": 1745531519.0,
          "replies": []
        },
        {
          "id": "mov8lt6",
          "author": "CarlosFer2201",
          "body": "Did you also complain that Blu-ray was more expensive than DVD? Those new Micro SD cards are way faster. They are needed because the games will be much bigger and will need to read lots of data",
          "score": 8,
          "created_utc": 1745532464.0,
          "replies": [
            {
              "id": "movyj4e",
              "author": "shifty_coder",
              "body": "Which is also the reason for the “game keycards”. The current gen cartridges have a max capacity of 64 GB, so any games over that have to use a game keycard  if they want a physical retail release.",
              "score": -1,
              "created_utc": 1745541143.0,
              "replies": [
                {
                  "id": "movzdam",
                  "author": "CarlosFer2201",
                  "body": "It will also be good for indy games that can't afford the pricey cards, and need much less storage than the smallest cartridge available",
                  "score": 1,
                  "created_utc": 1745541430.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mouy75u",
          "author": "_EleGiggle_",
          "body": "Is that a new thing? I remember micro SD cards having tons of standards and classes regarding speeds, speeds of random reads/writes, etc.\n\nWhat’s the difference between a regular one, and an express card? Do they have to meet certain standards? If so, I’m for it. These days people buy cheap micro SD cards, and install apps on them. Then they wonder why their flagship phone is suddenly running slowly because they installed all their apps on a 10 € micro SD card.\n\nThat’s part of the reason why new flagship phones have no more micro SD card slots. People just feed them cheap cards, and it’s hard to find a good one that’s as fast as the integrated memory. Usually they are much slower.\n\nAlthough I’d prefer a number versioning scheme, like micro SD 2.0, so we know if a card is a clear improvement over another one, and we have a clear upgrade path after “express” (3.0).",
          "score": 5,
          "created_utc": 1745529166.0,
          "replies": [
            {
              "id": "mov4veh",
              "author": "Sir_Bax",
              "body": "It uses PCIe 3.1 interface (one used by NVMe SSDs). It's major step forward allowing for read/write speeds very close to SSD drives.\n\nIt theoretically supports speeds up to almost 4000 mb/s, currently achievable only with full size SD cards, tho. Micro SD cards available in this standard which are currently available can read at 900 mb/s but as technology progresses there's space for micro SD cards to get faster as well.",
              "score": 4,
              "created_utc": 1745531256.0,
              "replies": [
                {
                  "id": "movhx1p",
                  "author": "SpeedflyChris",
                  "body": "I'm mostly pretty psyched about the idea of consumer grade microSD cards being suitable for high end cameras.",
                  "score": 5,
                  "created_utc": 1745535566.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mov3me0",
              "author": "error521",
              "body": "It's a new standard (literally the Switch 2 is the first consumer device to properly support them) that has extra pins to support much faster, SSD-ish storage speeds.",
              "score": 5,
              "created_utc": 1745530864.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mov7iig",
          "author": "adamantunicorn",
          "body": "Actually lexar recently released the 1tb. Theres also a Gamestop branded 1tb express card as well.",
          "score": 2,
          "created_utc": 1745532106.0,
          "replies": []
        },
        {
          "id": "mov0rdg",
          "author": "skyheadcaptain",
          "body": "Express will become the norm for sure now.",
          "score": 2,
          "created_utc": 1745529964.0,
          "replies": []
        },
        {
          "id": "mov2607",
          "author": "mymartyrcomplex",
          "body": "They’ll be more common with the release of the switch 2, idk how thats your argument. A lot of it sucks, but thats hardly gonna be an issue in a year or two",
          "score": 3,
          "created_utc": 1745530409.0,
          "replies": []
        },
        {
          "id": "mov66gh",
          "author": "BillyBruiser",
          "body": "I understand SD cards being too slow now.  I don't understand not supporting external HDD or SSD, other than the greed part.",
          "score": 1,
          "created_utc": 1745531672.0,
          "replies": [
            {
              "id": "mowrj0p",
              "author": "Dhiox",
              "body": "How on earth do you expect a handheld game system to support external drives?",
              "score": 2,
              "created_utc": 1745551189.0,
              "replies": [
                {
                  "id": "mowtzub",
                  "author": "BillyBruiser",
                  "body": "Oh, they won't ship the new one with a dock?  I can plug a external drive into my Xbox, Steam Deck, and others and the games on it run when it's plugged in and aren't available when it's not.",
                  "score": 1,
                  "created_utc": 1745552146.0,
                  "replies": [
                    {
                      "id": "mowv356",
                      "author": "Dhiox",
                      "body": "Why would someone selling a hybrid device go to the trouble of supporting storage media that's only usable in one mode? Especially when they already have perfectly usable method of storage expansion.",
                      "score": 2,
                      "created_utc": 1745552581.0,
                      "replies": [
                        {
                          "id": "mowz1z2",
                          "author": "BillyBruiser",
                          "body": "Because it's cheaper, widely available, and consumer friendly.  Some games are not well suited to handheld/portable play.  Those could be on the drive.",
                          "score": 1,
                          "created_utc": 1745554252.0,
                          "replies": [
                            {
                              "id": "mowzc0y",
                              "author": "Dhiox",
                              "body": "The whole point of the switch is making it hot swappable with TV and handheld mode, external drives would defeat that purpose. I understand you might be fine with that for your uses, but surely you can see why Nintendo didn't go for that surely?",
                              "score": 2,
                              "created_utc": 1745554374.0,
                              "replies": [
                                {
                                  "id": "mowzxxx",
                                  "author": "BillyBruiser",
                                  "body": "I don't think that makes sense.  You don't disconnect the dock from the tv every time you pick up the Switch do you?\n\nYou are probably right that one of their primary goals is to make it idiot proof, as shown in their extensive in-game tutorializing.  I don't believe people that couldn't figure it out would be plugging in external drives to begin with, however.",
                                  "score": 0,
                                  "created_utc": 1745554641.0,
                                  "replies": [
                                    {
                                      "id": "mox0o90",
                                      "author": "Dhiox",
                                      "body": ">You don't disconnect the dock from the tv every time you pick up the Switch do you?\n\nNo, but removing the switch from the dock does disconnect it from any peripherals or hardware connected via the dock. \n\nLook, I get why you like the idea, it just doesn't make much sense considering the scope of the switch. A micro sd does everything you want, without compromising on the features of the switch.",
                                      "score": 2,
                                      "created_utc": 1745554960.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mov9fng",
          "author": "Klaphood",
          "body": "Some argue that this might have been one of, if not the top reason the PS Vita flopped.\n\nIt was a bit more extreme it its case, since you could only use official Sony SD cards (or faked ones, but they weren't always reliable). But I definitely don't think they're totally wrong about that take. \n\nIt was an extreme bummer, and unnecessarily stupid expensive.",
          "score": 1,
          "created_utc": 1745532739.0,
          "replies": [
            {
              "id": "mowrcfp",
              "author": "Dhiox",
              "body": "Micro SD express is the new standard. It's liem complaining about using USB c just as it became a thing,",
              "score": 3,
              "created_utc": 1745551119.0,
              "replies": []
            }
          ]
        },
        {
          "id": "moux2mr",
          "author": "None",
          "body": "[deleted]",
          "score": -7,
          "created_utc": 1745528817.0,
          "replies": [
            {
              "id": "mouxjct",
              "author": "error521",
              "body": "I imagine basically every third-party developer was yelling at them to increase the storage speeds on it.",
              "score": 13,
              "created_utc": 1745528960.0,
              "replies": []
            },
            {
              "id": "mov2axd",
              "author": "MultiMarcus",
              "body": "If you want to play any games from the PS5 generation, you are going to need faster storage. They could totally create a convoluted system where you were allowed to plug in a conventional SD card but not allowed to download games that required that speed onto them but I can understand wanting a consistent speed.",
              "score": 5,
              "created_utc": 1745530452.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mouw9sa",
          "author": "augustocdias",
          "body": "But does the game download gets stored in this gameless key card? I thought it was just to hold the key and the game was stored in the internal storage.",
          "score": -1,
          "created_utc": 1745528573.0,
          "replies": [
            {
              "id": "mouyzfz",
              "author": "Mega_Pleb",
              "body": "No, the point of the game-key cards is to be very cheap by having only a tiny bit of read-only storage, just enough to hold the game-key.",
              "score": 6,
              "created_utc": 1745529411.0,
              "replies": [
                {
                  "id": "mov6ig1",
                  "author": "Sir_Bax",
                  "body": "I think the point is to have a token you can sell. 3rd party publishers already used digital code in \"physical\" editions which was one time use and locked to your account after use. This is honestly a way better option. Especially when Nintendo wants to stick with their expensive to produce cartridges (anything above ~~64~~ 32 GB gets pretty costly, and even ~~64~~ 32 GB cost them that much that they priced TotK which use it 10€ higher). That's unfortunately too small for modern AAA games. So between going full digital with code only and this I'll pick this. Of course, full physical would be better.",
                  "score": 3,
                  "created_utc": 1745531781.0,
                  "replies": [
                    {
                      "id": "movs1lf",
                      "author": "Chubby_Bub",
                      "body": "TotK is nowhere near 64 GB, it's like 16. They priced it higher because it's Zelda and people would still buy it.  (And they did, the game still sold 10M copies in three days. So $100M more just from that…)",
                      "score": 2,
                      "created_utc": 1745538937.0,
                      "replies": [
                        {
                          "id": "moxi6a0",
                          "author": "Sir_Bax",
                          "body": "You are right, I remember it incorrectly. 16 GB is still relatively cheap and price hike starts at 32 GB which is what TOTK uses. 64 GB is even more expensive and therefore not used at all yet now that I checked it again. Even more crazy as it's very hard to imagine many Switch 2 AAAs fitting into 16 GB.\n\nThanks for the correction.",
                          "score": 2,
                          "created_utc": 1745564142.0,
                          "replies": [
                            {
                              "id": "moy3umd",
                              "author": "Chubby_Bub",
                              "body": "Yeah TotK is *just* over 16 GB, but I think that’s after optimization because I remember they originally listed it as 18 and suddenly changed it. So they probably had to use the 32 GB cartridges either way.",
                              "score": 2,
                              "created_utc": 1745577355.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "movzvfv",
                  "author": "shifty_coder",
                  "body": "No, the point of the gamekey cards is to allow retail store sale of games that are larger than the storage capacity of the current game cards (64GB). Yes, you have to download the digital version of the game, but you can go to Walmart and buy the game with cash, download it, play it to your hearts content, and then *re-sell it*.\n\nMuch better than the digital redemption codes you can get for current systems imo.",
                  "score": 1,
                  "created_utc": 1745541601.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "movonga",
      "author": "FdPros",
      "body": "bruh",
      "score": 5,
      "created_utc": 1745537811.0,
      "replies": []
    },
    {
      "id": "mov8vp4",
      "author": "Yayoistrong",
      "body": "I hate this.  And since people are buying it, it'll likely become more common.",
      "score": 7,
      "created_utc": 1745532555.0,
      "replies": []
    },
    {
      "id": "movmxt9",
      "author": "brownc6830",
      "body": "Nintendon't",
      "score": 6,
      "created_utc": 1745537235.0,
      "replies": []
    },
    {
      "id": "movp5o1",
      "author": "comicrun96",
      "body": "I’ve been really trying to go physical for a lot because of the fear of the game being “taken” or unsupported and therefore unplayable in 10 years. My biggest concern for this will be Pokemon. If Pokemon doesn’t get a physical, it is possible in 10 years the games can’t be played. I have also never understood of how we improved so drastically in everywhere for consoles but games stayed to a disc for most consoles but Nintendo still allowed for physical to be fully on the cart. This change is the bigger issue. We need to go back to physical carts and less downloads. Along with a slew of other issues like bringing back couch coop.",
      "score": 3,
      "created_utc": 1745537978.0,
      "replies": [
        {
          "id": "muigxg1",
          "author": "DangTobascoSauce",
          "body": "I agree. I doubt gamefreak and nintendo will allow pokemon to be keys rather than real carts. They are collectable and I think even the execs know people want to collect the physical copies. I don't own a switch, and my plan was to get the legends ZA version of the switch 2 later this year, but if the game is digital only, I'll just get a switch oled, buy the switch games, and emulate the switch 2 games. If I cant own the game, then I'm not paying to use it temporarily.",
          "score": 1,
          "created_utc": 1748352635.0,
          "replies": []
        }
      ]
    },
    {
      "id": "movrdho",
      "author": "taypig",
      "body": "This is wack.",
      "score": 3,
      "created_utc": 1745538713.0,
      "replies": []
    },
    {
      "id": "moxqu0i",
      "author": "Skwidmandoon",
      "body": "Nintendo knows they have a choke hold on the resale market. The only way to make any money back from selling video games is buying these fake ass cartridges. I know most people just download, but you get no value retention in the product you are buying when you only download them. So yeah, maybe Redditors won’t buy these, but people who believe in keeping some of the value they invested in will. Selling a switch with no physical games and no games on it (because you wiped it) is not going to get as much money as a switch with even just 1 physical game. So people are definitely going to buy these fake carts. I only bought physical games with my first switch, and that’s because if I got bored with them, I could make almost all my money back selling them on Facebook or online.",
      "score": 3,
      "created_utc": 1745569512.0,
      "replies": []
    },
    {
      "id": "moy5ktg",
      "author": "AR-06",
      "body": "I'm 100% sure they're doing this to disincentivize people from buying physical media, so in the future they will be able to charge outrageous prices for games you already own but this time on newer platforms.",
      "score": 3,
      "created_utc": 1745578243.0,
      "replies": []
    },
    {
      "id": "moye392",
      "author": "lordraz0r",
      "body": "People not owning the Switch 2 is going to be very common.",
      "score": 3,
      "created_utc": 1745582089.0,
      "replies": []
    },
    {
      "id": "moz2vf6",
      "author": "thehouse1751",
      "body": "This should be illegal",
      "score": 3,
      "created_utc": 1745590723.0,
      "replies": []
    },
    {
      "id": "mozdquu",
      "author": "None",
      "body": "[deleted]",
      "score": 3,
      "created_utc": 1745593918.0,
      "replies": [
        {
          "id": "mqknvo3",
          "author": "gman5852",
          "body": "The original Wii servers are still up and I'm still able to download my games from them. You could've real quickly googled that and found out. Probably in less time than it'd have taken to write your post.\n\nThe real reason is third party devs don't want to purchase 64 GB cartridges for games no where near that size. You could attempt to do research next time. Picking the cynical conspiracy theory when it's easily debunked and we know the real reason already doesn't make you look smart.",
          "score": 1,
          "created_utc": 1746381913.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp07ehe",
      "author": "Mode6Island",
      "body": "Welp back in the boat and hoist the jolly Roger boys if I can't own it I ain't paying",
      "score": 3,
      "created_utc": 1745602487.0,
      "replies": []
    },
    {
      "id": "mov3e8b",
      "author": "wolfman3412",
      "body": "I only buy physical games. Everything i heard about Switch2 makes me less interested in it. I’m not buying it",
      "score": 7,
      "created_utc": 1745530793.0,
      "replies": [
        {
          "id": "mowsgn9",
          "author": "Dhiox",
          "body": "You do realize it's only a matter of time before all games are digital right? The share of games sold digitally increases every generation. Eventually the share will be small enough that it makes no sense to keep forcing everyone else to buy more expensive hardware just so a small subset of gamers have a box to put on a shelf.",
          "score": 1,
          "created_utc": 1745551545.0,
          "replies": [
            {
              "id": "moxgame",
              "author": "wolfman3412",
              "body": "That might be true if people allow it. They’re already trying to explain how we don’t actually own the game when we buy it any more. I’m happy with more retro system. When’s the servers are down, i can still play my games.",
              "score": 3,
              "created_utc": 1745563045.0,
              "replies": []
            },
            {
              "id": "moyay0p",
              "author": "FeastForCows",
              "body": ">You do realize it's only a matter of time before all games are digital right?\n\n...and? Should I stop going to the cinema already because it's only a matter of time until all movies are streamed at home?",
              "score": 1,
              "created_utc": 1745580755.0,
              "replies": []
            }
          ]
        },
        {
          "id": "moxgw0p",
          "author": "polopolo05",
          "body": "only place I buy digtal is steam because they seem stable",
          "score": 1,
          "created_utc": 1745563390.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mow02hn",
      "author": "actuallywaffles",
      "body": "With how many Nintendo store exclusive games basically no longer exist, I don't like an option where at any time Nintendo can just remove the files from a server, and your game is useless.",
      "score": 5,
      "created_utc": 1745541670.0,
      "replies": []
    },
    {
      "id": "movf9gr",
      "author": "aZombieDictator",
      "body": "It's fucking insane Nintendo is the one to make this commonplace.",
      "score": 6,
      "created_utc": 1745534681.0,
      "replies": [
        {
          "id": "mowpd1c",
          "author": "Dhiox",
          "body": "Other companies did this too, just with codes instead. And Nintendo isn't releasing empty cartridges, only third party releases are doing this.",
          "score": 5,
          "created_utc": 1745550379.0,
          "replies": []
        },
        {
          "id": "mowxehr",
          "author": "Tiny_Cheetah_4231",
          "body": "https://www.doesitplay.org/list?downloadRequired=Yes&page=1",
          "score": 1,
          "created_utc": 1745553538.0,
          "replies": []
        },
        {
          "id": "mp3mplh",
          "author": "Glazu",
          "body": "Switch has been doing it for years too, I actively avoid games like GTA Trilogy when it says it on the box.\n\nDoom did it right, only the multiplayer part is download only. Campaigns on the card.",
          "score": 1,
          "created_utc": 1745645104.0,
          "replies": []
        },
        {
          "id": "mowwv4t",
          "author": "Zireall",
          "body": "It really isn’t, Nintendo is the most anti consumer out of the big 3",
          "score": -1,
          "created_utc": 1745553309.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mov8e1d",
      "author": "None",
      "body": "Switch 2? More like switch to a pc.",
      "score": 8,
      "created_utc": 1745532394.0,
      "replies": [
        {
          "id": "movbmzi",
          "author": "DontForgorTheMilk",
          "body": "Yeah, where all your games are digital through shops like steam that depend entirely on an internet connection to download and are at the whim of the servers for future download availability. \n\n\nLook dude I don't like this game card key bullshit either, and I'm not trying to defend any devs who decide to do this, but acting like this is worse than modern PC gaming is extremely asinine, lol. Y'all just like hating on Nintendo. And that's fine but there are more valid reasons to do so.",
          "score": 0,
          "created_utc": 1745533473.0,
          "replies": [
            {
              "id": "movnasc",
              "author": "sali_nyoro-n",
              "body": "The odds of Steam going away in the next 40 years at this point are pretty slim. But the odds aren't _great_ that 40 years from now downloading Switch 2 games will still work.",
              "score": 5,
              "created_utc": 1745537354.0,
              "replies": [
                {
                  "id": "movp0cm",
                  "author": "DontForgorTheMilk",
                  "body": "100% agree considering what happened with Wii U and 3DS. Even though we can still technically redownload pre-purchased games there no telling how much longer that will be the case. And yeah Steam will most likely be around a lot longer than access to Nintendo's back catalogue. \n\n\nThen there's also just individual game companies that remove their games from Steam anyways regardless of server availability though. So even if Steam still stuck around devs can still pull stuff off. Not making a defence for Nintendo, moreso pointing out that it's more than just a Nintendo issue.\n\n\n*Unless* Nintendo continues on this trend of allowing the previous generation games to still be playable and downloaded on future generation consoles. Effectively just selling a \"Nintendo computer\". They've never done that before but up until now that's not really been a possibility. But this is Nintendo, if they can figure out a way to make us pay another ~~$40~~ ~~$60~~ $80 on a game we already bought then they'll most likely try to do it.",
                  "score": 1,
                  "created_utc": 1745537930.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "movn9cq",
          "author": "Inevitable_Judge5231",
          "body": "GPU prices say hi",
          "score": 0,
          "created_utc": 1745537340.0,
          "replies": []
        }
      ]
    },
    {
      "id": "movb88s",
      "author": "hustladafox",
      "body": "Great so as they become more common, my shelves are safe. I guess I won’t be buying many games for my switch 2. First party and the ones that can hold the full game only for me.",
      "score": 2,
      "created_utc": 1745533336.0,
      "replies": []
    },
    {
      "id": "movsqxd",
      "author": "BigCommieMachine",
      "body": "RIP to swinging by the local GameStop on the way to airport for a couple used games or picking up an  import game in another country with shoddy Wi-Fi.",
      "score": 2,
      "created_utc": 1745539175.0,
      "replies": []
    },
    {
      "id": "movyfkr",
      "author": "mysecondaccountanon",
      "body": "I **want** a physical game.",
      "score": 2,
      "created_utc": 1745541109.0,
      "replies": []
    },
    {
      "id": "mowm6rf",
      "author": "senortipton",
      "body": "Putting aside providing us licenses to play their games as opposed to owning it, I still feel like this is a bad move. The Switch 2 has 256 GB of internal storage, probably less, and the average game file size for Switch 2 is around 25 GB from what I’ve seen, but that value is weighed down by Switch games that are being moved to Switch 2. Once Switch 2 only games start coming out I am willing to bet that the average increases. If that ends up being true then 256 GB isn’t going to last long even if the average file size only increases to 30 GB (space for about 8 games after space for OS is reserved). If games end up tending towards 50 GB then you’re easily looking at 4 games and some DLC.",
      "score": 2,
      "created_utc": 1745549243.0,
      "replies": [
        {
          "id": "moy8isu",
          "author": "precastzero180",
          "body": "This is for games that were never going to get a physical release. Isn’t *Split Fiction* a 70GB game? That isn’t going on a game card. These games were already digital-only or a code-in-a-box on store shelves. So it’s not like anyone is losing out with these new game keys. It’s just a better version of what was already the case.",
          "score": 0,
          "created_utc": 1745579655.0,
          "replies": [
            {
              "id": "moyigao",
              "author": "senortipton",
              "body": "Maybe, but since developers can choose between the two they’re more likely to choose the digital game card. They don’t have to pay for the physical game card and they can really limit the ability to play the game, share, or resell it by doing so. This may be a consumer friendly move given the circumstances, but really it is a half-step towards a digital only future.",
              "score": 1,
              "created_utc": 1745583822.0,
              "replies": [
                {
                  "id": "moyjnt4",
                  "author": "precastzero180",
                  "body": ">Maybe, but since developers can choose between the two they’re more likely to choose the digital game card. \n\nMore likely than they already were to chose digital-only or code-in-a-box? Maybe digital games become even more common in the future, but not because of these new keys. This whole brouhaha seems like the biggest nontroversy to me. It doesn’t actually change anything wrt to the concerns people are raising. ",
                  "score": 0,
                  "created_utc": 1745584287.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mownrrd",
      "author": "D-inventa",
      "body": "So stupid",
      "score": 2,
      "created_utc": 1745549810.0,
      "replies": []
    },
    {
      "id": "mowuksk",
      "author": "_gina_marie_",
      "body": "Common? Sure. Will I buy them? No.",
      "score": 2,
      "created_utc": 1745552378.0,
      "replies": []
    },
    {
      "id": "mox06am",
      "author": "goldaxis",
      "body": "Oh, but everyone on r/nintendo was absolutely certain that would only be for rare exceptions like street fighter lmao.\n\nHow can you be a nintendo fan and not know how nintendo works?",
      "score": 2,
      "created_utc": 1745554744.0,
      "replies": []
    },
    {
      "id": "mox4d3t",
      "author": "ThatDudeJuicebox",
      "body": "Yeah I’m good.",
      "score": 2,
      "created_utc": 1745556654.0,
      "replies": []
    },
    {
      "id": "moxartw",
      "author": "nicman24",
      "body": "and then the clown will tell us 70 euros due to the cartridge costs",
      "score": 2,
      "created_utc": 1745559939.0,
      "replies": []
    },
    {
      "id": "moxf92q",
      "author": "ResponsibleFun8720",
      "body": "Good thing I’m poor and can’t afford the Switch 2",
      "score": 2,
      "created_utc": 1745562439.0,
      "replies": []
    },
    {
      "id": "moxrj1j",
      "author": "far_in_ha",
      "body": "Nintendo please stop trying to convince me not to get a switch 2",
      "score": 2,
      "created_utc": 1745569965.0,
      "replies": []
    },
    {
      "id": "moy64c5",
      "author": "Yokai_Mob",
      "body": "Will not be buying a Switch 2 bc of this",
      "score": 2,
      "created_utc": 1745578506.0,
      "replies": []
    },
    {
      "id": "moydtyo",
      "author": "Delta8ttt8",
      "body": "Oh we all know that sooo many will scoop these up to “have a full set/collection” regardless of the content. That’s the sad part.  Even moreso will be the graded game code cases.",
      "score": 2,
      "created_utc": 1745581984.0,
      "replies": []
    },
    {
      "id": "moyilqi",
      "author": "jonermon",
      "body": "What is the point of this. People will eventually figure out how to dump unencrypted roms, this just buys them like a bit of time for that to be figured out, and is a disaster for game preservation. Nintendo keeps getting worse.",
      "score": 2,
      "created_utc": 1745583881.0,
      "replies": []
    },
    {
      "id": "moyn2fb",
      "author": "XxPyRoxXMaNiAcxX",
      "body": "I prefer this over the old way in which this was handled with the Switch 1, buying a physical game that lacked all the files necessary to play the game without an update/download. Very easily discernible now and people can easily choose not to buy the game keys without any research needed. Obviously I wish this wasn’t a problem to begin with but a nice step towards transparency to the consumer.",
      "score": 2,
      "created_utc": 1745585530.0,
      "replies": []
    },
    {
      "id": "mp1n142",
      "author": "DrNicket",
      "body": "That's a solid dealbreaker for me. Count me out.",
      "score": 2,
      "created_utc": 1745618117.0,
      "replies": []
    },
    {
      "id": "mp1r97i",
      "author": "Brycethebrave",
      "body": "We are losing the gaming industry. Physical copies are a collectors dream. Unique box arts, manuals, cool discs with the GAME ON IT. Devastating",
      "score": 2,
      "created_utc": 1745619531.0,
      "replies": []
    },
    {
      "id": "movxvjx",
      "author": "Skill_Academic",
      "body": "lol, article is talking like $80 is a reasonable price for a game. Gtfo",
      "score": 5,
      "created_utc": 1745540921.0,
      "replies": []
    },
    {
      "id": "movtajk",
      "author": "None",
      "body": "[deleted]",
      "score": 6,
      "created_utc": 1745539361.0,
      "replies": [
        {
          "id": "mow1d2v",
          "author": "EZPZLemonWheezy",
          "body": "Because they cost more to make. If you have a key card that needs barely any space it’s probably fractions of a cent for the base storage card versus bigger ones that would cost more to produce as you’d need more storage on them.",
          "score": 3,
          "created_utc": 1745542118.0,
          "replies": [
            {
              "id": "moy5iae",
              "author": "FeastForCows",
              "body": "Nintendo dictates the price of their cartridges to the publishers, because they manufacture their own. If cost was really a factor, they could adjust their prices accordingly. I think it's an issue of wanting to control the product and preventing a second-hand market; same for Sony.",
              "score": -1,
              "created_utc": 1745578208.0,
              "replies": [
                {
                  "id": "moy9drc",
                  "author": "Snipedzoi",
                  "body": "Nintendo doesn't dictate prices to themselvez",
                  "score": 1,
                  "created_utc": 1745580056.0,
                  "replies": [
                    {
                      "id": "moyawh3",
                      "author": "FeastForCows",
                      "body": "Good thing that I didn't say that then.",
                      "score": 0,
                      "created_utc": 1745580736.0,
                      "replies": [
                        {
                          "id": "moydrdr",
                          "author": "Snipedzoi",
                          "body": "That's how you ignore a key part. It costs Nintendo money to make carts.",
                          "score": 1,
                          "created_utc": 1745581955.0,
                          "replies": [
                            {
                              "id": "moyfbml",
                              "author": "FeastForCows",
                              "body": "Yes, but they sell the cartridges to publishers and decide how much they charge for them.",
                              "score": 0,
                              "created_utc": 1745582591.0,
                              "replies": [
                                {
                                  "id": "moyna35",
                                  "author": "Snipedzoi",
                                  "body": "That amount is based on how much it costs Nintendo to make carts.",
                                  "score": 1,
                                  "created_utc": 1745585604.0,
                                  "replies": [
                                    {
                                      "id": "moyu95u",
                                      "author": "FeastForCows",
                                      "body": "Are you saying they sell at cost? Because there's no way for you to know that. We have no reliable source on how much the cartridges really cost to manufacture.",
                                      "score": 0,
                                      "created_utc": 1745587994.0,
                                      "replies": [
                                        {
                                          "id": "mozzvjm",
                                          "author": "Snipedzoi",
                                          "body": "Then why are you complaining",
                                          "score": 1,
                                          "created_utc": 1745600342.0,
                                          "replies": [
                                            {
                                              "id": "mp0278o",
                                              "author": "FeastForCows",
                                              "body": "Times I corrected you: several.\n\nTimes I complained: zero.",
                                              "score": 0,
                                              "created_utc": 1745601008.0,
                                              "replies": [
                                                {
                                                  "id": "mp0b74e",
                                                  "author": "Snipedzoi",
                                                  "body": "Corrected me? Lmfao. You're complaining that Nintendo won't lower the game cart price.",
                                                  "score": 1,
                                                  "created_utc": 1745603564.0,
                                                  "replies": [
                                                    {
                                                      "id": "mp3axbl",
                                                      "author": "FeastForCows",
                                                      "body": "Never even said that. \n\n  \nTimes I corrected you: one more now.",
                                                      "score": 1,
                                                      "created_utc": 1745639581.0,
                                                      "replies": [
                                                        {
                                                          "id": "mp5b61g",
                                                          "author": "Snipedzoi",
                                                          "body": "Love arguing with liars. Unfortunately they don't allow screenshots here.",
                                                          "score": 1,
                                                          "created_utc": 1745676058.0,
                                                          "replies": [
                                                            {
                                                              "id": "mp5c17m",
                                                              "author": "FeastForCows",
                                                              "body": "You can link to an image upload provider if it's that important to you.",
                                                              "score": 1,
                                                              "created_utc": 1745676355.0,
                                                              "replies": [
                                                                {
                                                                  "id": "mp5cnx2",
                                                                  "author": "Snipedzoi",
                                                                  "body": "Eh just look at the first comment you made in this thread",
                                                                  "score": 1,
                                                                  "created_utc": 1745676571.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "mp5hjge",
                                                                      "author": "FeastForCows",
                                                                      "body": "I know what I wrote dude, I was not complaining about Nintendo not lowering their cartridge prices. Let's end this tiring conversation here, because it's not going anywhere anytime soon.",
                                                                      "score": 1,
                                                                      "created_utc": 1745678182.0,
                                                                      "replies": []
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mowruty",
          "author": "Dhiox",
          "body": "Nintendo doesn't, they are still very supportive. It's third party devs who dislike them as they cut into profits.",
          "score": 1,
          "created_utc": 1745551314.0,
          "replies": []
        }
      ]
    },
    {
      "id": "movyg07",
      "author": "rayshmayshmay",
      "body": "Nintendo ***REALLY*** doesnt want me to get a switch 2",
      "score": 4,
      "created_utc": 1745541113.0,
      "replies": [
        {
          "id": "mows9af",
          "author": "Dhiox",
          "body": "Nintendo isn't doing this, third party devs are.",
          "score": 0,
          "created_utc": 1745551466.0,
          "replies": [
            {
              "id": "mp3cyca",
              "author": "rayshmayshmay",
              "body": "On nintendo’s platform",
              "score": 1,
              "created_utc": 1745640455.0,
              "replies": [
                {
                  "id": "mp3efwr",
                  "author": "Dhiox",
                  "body": "And? They're still not the ones who decide whether they spring fir the more expensive cards.",
                  "score": 0,
                  "created_utc": 1745641113.0,
                  "replies": [
                    {
                      "id": "mp3lhet",
                      "author": "rayshmayshmay",
                      "body": "Only bc Nintendo gives them the option to do so, which is my point. Do you really think devs can do whatever they want on the switch without Nintendo’s approval?",
                      "score": 1,
                      "created_utc": 1745644457.0,
                      "replies": [
                        {
                          "id": "mp3ln1t",
                          "author": "Dhiox",
                          "body": "It's obvious devs were upset about the cartridge cost, so Nintendo gave them options. Shkuld Nintendo have been more restrictive and reduced the amount of physical releases due to devs not wanting to pay for expensive cartridges?",
                          "score": 0,
                          "created_utc": 1745644537.0,
                          "replies": [
                            {
                              "id": "mp44j9y",
                              "author": "rayshmayshmay",
                              "body": "Yes they must answer to my needs and my needs alone. And only then will I ***maybe*** get one on a xmas holiday sale or second hand\n\nEdit: And the only game I will play is the e-shop version of breath of the wild",
                              "score": 1,
                              "created_utc": 1745655252.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mov5128",
      "author": "InjamoonToo",
      "body": "It sucks.  Hopefully Nintendo releases their games on the real carts, as that’s all I think I’ll be playing on the Switch 2 anyhow, unless there are good third party exclusives.\n\nIt looks like the third parties are likely going to opt for the key carts, which means I will opt to play those games elsewhere, or maybe not at all.",
      "score": 3,
      "created_utc": 1745531307.0,
      "replies": []
    },
    {
      "id": "movqkt7",
      "author": "soniko_",
      "body": "You know what they should have? Local cache servers in stores.\n\nExample: you buy yout keycard in gamestop.\n\nCool, connect to nintendo fast as fuck wifi, insert the keycard, and boom, rattle that shit into the sd card as hard and as fast as possible",
      "score": 1,
      "created_utc": 1745538449.0,
      "replies": [
        {
          "id": "mowrmmk",
          "author": "Dhiox",
          "body": "No retailer wants to deal with that hassle",
          "score": 2,
          "created_utc": 1745551227.0,
          "replies": [
            {
              "id": "mowumat",
              "author": "soniko_",
              "body": "No, but it’d be a great “we care about gamers” bonus points",
              "score": 0,
              "created_utc": 1745552394.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mowcy5f",
      "author": "dyrwlvs",
      "body": "Wasn't this one of the major complaints about the Xbone when it was originally announced?",
      "score": 2,
      "created_utc": 1745546055.0,
      "replies": [
        {
          "id": "mowfym7",
          "author": "fullload93",
          "body": "No, that was an always online requirement or like having to be able to be online once during a 24 hour period for a “check in”. Different concept.",
          "score": -1,
          "created_utc": 1745547069.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mowmtvh",
      "author": "djpuggy",
      "body": "Lmao so y’all gon pay $80 for box art 😂😂😂😂\n\nGlad I’m skipping this console cycle with Nintendo",
      "score": 4,
      "created_utc": 1745549474.0,
      "replies": []
    },
    {
      "id": "movf7bw",
      "author": "16bitClaire",
      "body": "Check your watches, because as soon as you buy one of these $80 gameless game cartridges it’s just a long rental, because Nintendo loves shutting down their eshops with no thought to all the loyal supporters, as they say “you’ll own nothing and like it”",
      "score": 6,
      "created_utc": 1745534662.0,
      "replies": [
        {
          "id": "movqmlu",
          "author": "Strict_Donut6228",
          "body": "Except you can still download Wii, 3DS and Wii U games to their respective systems despite the store being shut down you just can’t purchase anything so what are you even saying here. Especially doesn’t matter if they plan on continuing the switch line next gen as well with BC",
          "score": 1,
          "created_utc": 1745538465.0,
          "replies": []
        }
      ]
    },
    {
      "id": "move5zp",
      "author": "DontForgorTheMilk",
      "body": "I'm probably going to be called a Nintendo bootlicker, but y'all realize it's not Nintendo forcing ~~devs~~ publishers to do this, right? It's completely on them to decide to use the key cards. I think Nintendo is at fault for even making this an option to begin with, but they're not forcing devs to use them. \n\n\nAlso I get people having a problem because this is a terrible option for those that want physical media (like myself sometimes) but you can't turn around and act like the state of game ownership on PC is any better lmfao. When's the last time anyone's owned a physical copy of a PC game? \n\n\nEDIT: I know services like GOG exist that offer DRM-free local ownership. I'll concede that's different and a good way to preserve games. That's not what I'm talking about though considering the majority of PC gaming happens through store services like ORIGIN and Steam.\n\n\nI like to shit on Nintendo just as much as the next, but this ain't it, lol.",
      "score": 2,
      "created_utc": 1745534319.0,
      "replies": [
        {
          "id": "movy4b7",
          "author": "WeeWooPeePoo69420",
          "body": "I also thought the primary point of this was to allow developers to sell physical copies of games that are too big to fit on the cartridge. In that case it seems like it makes sense?",
          "score": 3,
          "created_utc": 1745541004.0,
          "replies": [
            {
              "id": "movz21i",
              "author": "DontForgorTheMilk",
              "body": "Someone else mentioned this could be a really good way for more indie devs to get their games on physical shelves. I really hope it works out that way.",
              "score": 3,
              "created_utc": 1745541324.0,
              "replies": []
            },
            {
              "id": "mows8zh",
              "author": "NIN10DOXD",
              "body": "Yeah, third parties are already abusing it, but that was the intent.",
              "score": 1,
              "created_utc": 1745551462.0,
              "replies": []
            }
          ]
        },
        {
          "id": "movhhru",
          "author": "jlitz_727",
          "body": "You can't really compare what Nintendo is doing here with the PC platform as a whole. With PC you have the ability to preserve a copy of a game through DRM free options like GOG. It would be more accurate to compare what Nintendo is doing with Steam or Epic storefronts.",
          "score": 2,
          "created_utc": 1745535425.0,
          "replies": [
            {
              "id": "mowt5re",
              "author": "Dhiox",
              "body": ">With PC you have the ability to preserve a copy of a game through DRM free options like GOG\n\nI don't blame Nintendo one but for not wanting to deal with GOG, the amount of fraud and stolen keys facilitated through GOG is enough to make anyone want nothing to do with it.",
              "score": 1,
              "created_utc": 1745551820.0,
              "replies": [
                {
                  "id": "mowuczs",
                  "author": "jlitz_727",
                  "body": "Are you sure you don't mean G2A and other resellers? GOG is legit. It's owned by CD Projekt Reds parent company.",
                  "score": 1,
                  "created_utc": 1745552293.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "movhmrh",
              "author": "DontForgorTheMilk",
              "body": "100% agree. I posted my EDIT most likely while you were typing your response.",
              "score": 1,
              "created_utc": 1745535471.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "movh3ce",
      "author": "Competition-Dapper",
      "body": "At this point just make a Nintendo app FFS",
      "score": 2,
      "created_utc": 1745535292.0,
      "replies": []
    },
    {
      "id": "movm54y",
      "author": "Optimus_Prime_Day",
      "body": "One thing that's interesting is as updates to games release, you'll never be able to play unpatched versions, as the cartridge will always download the latest patched version.",
      "score": 2,
      "created_utc": 1745536968.0,
      "replies": []
    },
    {
      "id": "mowm75j",
      "author": "BackupTrailer",
      "body": "Anti-consumer",
      "score": 2,
      "created_utc": 1745549247.0,
      "replies": []
    },
    {
      "id": "mowin9r",
      "author": "HG21Reaper",
      "body": "Every day I read more info about the Switch 2 and it’s convincing me that the console is not for me.",
      "score": 1,
      "created_utc": 1745548004.0,
      "replies": []
    },
    {
      "id": "mowq3ep",
      "author": "rollingcann",
      "body": "yall be complaining but most people are gonna be okay with this hahahah",
      "score": 1,
      "created_utc": 1745550648.0,
      "replies": [
        {
          "id": "mowq6o5",
          "author": "rollingcann",
          "body": "just remember that reddit is a stupid ass echo chamber filled with 14 year olds",
          "score": 0,
          "created_utc": 1745550681.0,
          "replies": []
        }
      ]
    },
    {
      "id": "movhyui",
      "author": "DollarsAtStarNumber",
      "body": "Reddit: I can’t believe I can’t own physical games\n\nAlso Reddit: God I love Steam.",
      "score": 2,
      "created_utc": 1745535582.0,
      "replies": [
        {
          "id": "movwta9",
          "author": "Neo_Techni",
          "body": "Steam is the exact opposite though\n\nI bought Portal 2 for PS3 and it came with a free Steam key   \nI imported the DVD version of Dead Rising 3 for PC, and it also came with a Steam key, and I beat the game on my Steam Deck",
          "score": 5,
          "created_utc": 1745540558.0,
          "replies": [
            {
              "id": "moze9lr",
              "author": "DollarsAtStarNumber",
              "body": "[Cause Gabe knew the PS3 was a piece of shit and wasn’t going to have backwards compatibility next gen.](https://arstechnica.com/gaming/2007/01/6649/)\n\nThat’s Capcom’s decision. Not Valve.\n\nIronic you mention the PS3, because even physical games from that system aren’t even playable.",
              "score": 1,
              "created_utc": 1745594069.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mowgxxj",
          "author": "fullload93",
          "body": "Gabe Newell has confirmed multiple times in the past that Valve’s contingency plans should they ever face bankruptcy and closure is to make all games on your account that are downloaded permanently unlocked/DRM free. That’s why everyone is okay with digital PC games.",
          "score": -1,
          "created_utc": 1745547409.0,
          "replies": [
            {
              "id": "mowtqqq",
              "author": "Dhiox",
              "body": "Gave Newell isn't immortal. Eventually he's gonna pass away and it's gonna get made public and that kind of stuff is gonna go out the window.",
              "score": 6,
              "created_utc": 1745552047.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "movi6c6",
      "author": "internetlad",
      "body": "$80 for a key to a lock you don't own huh? Nah, money well spent. ",
      "score": 2,
      "created_utc": 1745535652.0,
      "replies": [
        {
          "id": "mowtgyp",
          "author": "Dhiox",
          "body": "Do you have the same objection to steam games?",
          "score": 1,
          "created_utc": 1745551940.0,
          "replies": [
            {
              "id": "mp0mhe1",
              "author": "strra",
              "body": "I know you're not asking me but yes. I do. I have a Steam Deck and a Switch and I will buy a game on Switch 100% of the time if there's a physical version. If the game is digital only, I will buy it on Steam because I don't see Steam going away but the Switch E-Shop inevitably will and sooner than we'd like.",
              "score": 1,
              "created_utc": 1745606878.0,
              "replies": []
            },
            {
              "id": "moyb22f",
              "author": "WaIterHWhite",
              "body": "Steam games go on sale.\nSteam games aren't $80 base price.\nSteam allows you to share your games with other family members.\nSteam allows you to return games after 14 days with less than 2 hours play time.\nNintendo does not.\nYou are being daft for the sake of defending Nintendo.",
              "score": 0,
              "created_utc": 1745580805.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "movpa78",
      "author": "hamrspace",
      "body": "Honestly I refuse to buy the Switch 2 _because_ I’m a Nintendo fan. There’s a lot of people buying but they’re just permitting the worst of the gaming industry to see what they can get away with.",
      "score": 2,
      "created_utc": 1745538020.0,
      "replies": [
        {
          "id": "mow5f6i",
          "author": "JS-87",
          "body": "We're just repeating history. \"What do you mean we need to buy a Super Nintendo to buy the newest games? I'm just not gonna buy it.\"",
          "score": 1,
          "created_utc": 1745543504.0,
          "replies": [
            {
              "id": "mowaimk",
              "author": "hamrspace",
              "body": "Not even the same by a long shot. The big three problems I have with Switch 2 are:\n\n-$70 as the standard game price with $80 for their big releases\n-Key cards with no actual game data on them\n-Charging more $$$ for games that are 10+ years old\n\nUntil those things change, I ain’t buying",
              "score": -1,
              "created_utc": 1745545232.0,
              "replies": [
                {
                  "id": "mowtatz",
                  "author": "Dhiox",
                  "body": ">-Key cards with no actual game data on them\n\nNintendo isn't even doing that.",
                  "score": 2,
                  "created_utc": 1745551873.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mowop68",
      "author": "Fredifrum",
      "body": "ITT: People who don’t understand the purpose of these and how they actually exist in order to allow customers to buy sell and trade digital games ",
      "score": 1,
      "created_utc": 1745550139.0,
      "replies": [
        {
          "id": "moxqvhr",
          "author": "Skwidmandoon",
          "body": "I wrote a huge paragraph saying the same. But you summed it up best",
          "score": 1,
          "created_utc": 1745569538.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mov8ib6",
      "author": "MattofCatbell",
      "body": "I feel like this will depend on the developer the biggest culprits we know so far are Square, Sega and Capcom who even back on the original Switch where know for releasing half a game on the cartridge with the rest being a download code or worse in Square’s case cloud versions of games",
      "score": 1,
      "created_utc": 1745532433.0,
      "replies": []
    },
    {
      "id": "movqvk2",
      "author": "OgthaChristie",
      "body": "Reminds me of the little PlayStation 1 save cards, but with the Code Shark tech to fit the system.",
      "score": 1,
      "created_utc": 1745538547.0,
      "replies": []
    },
    {
      "id": "mow4mmw",
      "author": "CornholioRex",
      "body": "So does the owner of the card own the game or the first person to download it?",
      "score": 1,
      "created_utc": 1745543230.0,
      "replies": [
        {
          "id": "mow6j6d",
          "author": "carenard",
          "body": "based off what I understand is the card holds the game license, so you can't play it even if its still downloaded without the card.",
          "score": 1,
          "created_utc": 1745543880.0,
          "replies": [
            {
              "id": "mow9y90",
              "author": "CornholioRex",
              "body": "Gotcha, was having flashbacks to CD keys",
              "score": 2,
              "created_utc": 1745545044.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mowyb9s",
      "author": "DixeeNormouss",
      "body": "I'm assuming the pro here is that you can still trade in physical games and get money back, let people borrow them, and buy used at a cheaper price than $80/$90.",
      "score": 1,
      "created_utc": 1745553928.0,
      "replies": []
    },
    {
      "id": "mox09pb",
      "author": "gamerjerome",
      "body": "So Nintendo will allow you create a backup so you don't have to rely on their servers next time you need to install it right? Right?\n\nNope. Having to rely on them is not going to go well. Just going to make piracy worse for them. I'm not paying for something that can just be taken away.",
      "score": 1,
      "created_utc": 1745554785.0,
      "replies": []
    },
    {
      "id": "mox9fvv",
      "author": "StrawHat89",
      "body": "I can't say I'm surprised that 3rd party publishers are overwhelmingly opting for Game Key Cards, but I still don't have to like it. They really do not want people to permanently own a game anymore (they've been doing this on PlayStation and Xbox for a while with only partial data being on discs).",
      "score": 1,
      "created_utc": 1745559235.0,
      "replies": []
    },
    {
      "id": "moxfih8",
      "author": "green_link",
      "body": "i haven't seen anyone mention this, so i will. i think the point of these game-key cards is to try to block or prevent ripping/dumping the game data ROM from the cart itself. for the longest time to pirate a game you just ripped the data off the cart or disc, and that has been true for every nintendo console up to this point. since the switch2 carts are basically the same as switch1 i could see the migdumper being updated to support switch2 carts. so physically not having the game data on the cart is the best way to prevent people from ripping/dumping the cart. and game developers are of course going to flock to this as they want to protect their games. \n\nand yes i know if you modify your console you can just use it to rip/dump the games or even just copy the downloaded games to a USB drive, but right now there is no software or hardware mod or exploit for the switch2 (so far).\n\ni'm also not saying i like it or agree with them, i'm just trying to understand where nintendo and developers are coming from",
      "score": 1,
      "created_utc": 1745562589.0,
      "replies": []
    },
    {
      "id": "moxgliw",
      "author": "mrgodfro",
      "body": "I'm a bit tired but man reading through most of that article this all just seems so needlessly fucking complicated. Game keys, paid upgrades, upgrade path, switch 1 and 2 versions. Like get such wii u vibes from this.",
      "score": 1,
      "created_utc": 1745563220.0,
      "replies": []
    },
    {
      "id": "moxlg9v",
      "author": "GrimmTrixX",
      "body": "As expected. Cheaper for companies and people wil buy them so they can still trade and sell them when they're done. It's annoying and I won't be bothering with any. Switch 2 is just gonna get Exclusives from me. Any other games that are on PS5/XBSX I'll just get there.",
      "score": 1,
      "created_utc": 1745566135.0,
      "replies": []
    },
    {
      "id": "moxpirr",
      "author": "creepilincolnbot",
      "body": "It’s like cold storage keys",
      "score": 1,
      "created_utc": 1745568672.0,
      "replies": []
    },
    {
      "id": "moxyyap",
      "author": "Thenderick",
      "body": "Great... Sadly this is already common for pc gaming, but I hate to see physical games disappearing from consoles... I love the small collection of physical cases I have. Sadly Nintendo has already been neglecting them with big empty cases and a single small cartridge. No booklet, no extra, nothing. Just an empty case... At least make them smaller just like the DS ones...",
      "score": 1,
      "created_utc": 1745574594.0,
      "replies": []
    },
    {
      "id": "moxz803",
      "author": "DaylitSoul",
      "body": "Isn’t this just functionally the download required games for the switch 1?",
      "score": 1,
      "created_utc": 1745574752.0,
      "replies": []
    },
    {
      "id": "moxzz11",
      "author": "Organicmint",
      "body": "Bullshit. Plain and simple. Was really excited for switch 2 but maybe i‘ll just stay with my switch and get a steamdeck (or similar)…",
      "score": 1,
      "created_utc": 1745575187.0,
      "replies": []
    },
    {
      "id": "moy3to2",
      "author": "Medium_Purple_7722",
      "body": "They already have been",
      "score": 1,
      "created_utc": 1745577341.0,
      "replies": []
    },
    {
      "id": "moy6ghz",
      "author": "MeatHamster",
      "body": "Does it show on the case? I hope show.",
      "score": 1,
      "created_utc": 1745578669.0,
      "replies": []
    },
    {
      "id": "moye3l4",
      "author": "redconvict",
      "body": "What are the chances this will prevent an emulator from being made?",
      "score": 1,
      "created_utc": 1745582092.0,
      "replies": [
        {
          "id": "moyeyjy",
          "author": "Mugen4552",
          "body": "Where there’s a will there is a way",
          "score": 2,
          "created_utc": 1745582442.0,
          "replies": []
        }
      ]
    },
    {
      "id": "moyp9wy",
      "author": "lilinette12",
      "body": "Wait what? What is this?\nSo i download a game and cant access it without a key which is the game cartridge? The cartridge only holds the key to the game but does not hold the game itself?\n\nOh hell no, i was already waiting years for the switch 2 now nope from me i can live without a game and console They can go fuck a cactus if they think this is smart.",
      "score": 1,
      "created_utc": 1745586298.0,
      "replies": []
    },
    {
      "id": "moyvvhe",
      "author": "CyberWeaponX",
      "body": "The Switch 2 becomes less and less appealing for me. No point to buy the cartridges if I can just buy the games off Steam for a potentially much cheaper price. Or go straight to the dark path 🏴‍☠️",
      "score": 1,
      "created_utc": 1745588529.0,
      "replies": []
    },
    {
      "id": "moyzc1m",
      "author": "Rojo176",
      "body": "Yeah I probably won’t care tbf, I only really buy Nintendo first party games physical anyways, but it’s not very friendly for the average Switch user base. PC people are used to being all digital and investing in larger storage, I don’t think a more casual audience will like it when their big new games quickly fill up the internal storage. The key card is better than a download code at least, but hopefully 3rd party devs will see enough success on the platform to invest in optimizing down to a real card like CD Projekt RED has managed with Cyberpunk.",
      "score": 1,
      "created_utc": 1745589630.0,
      "replies": []
    },
    {
      "id": "mozg84c",
      "author": "StanLay281",
      "body": "I just bought the new Indiana Jones game on disc bc of all this nonsense. I regret buying a lot of games digitally up until this point",
      "score": 1,
      "created_utc": 1745594633.0,
      "replies": []
    },
    {
      "id": "mozqx8l",
      "author": "action_turtle",
      "body": "So it’s basically just a method of selling digital games in physical format. Half step I guess",
      "score": 1,
      "created_utc": 1745597752.0,
      "replies": []
    },
    {
      "id": "mp0naoe",
      "author": "Honest-Ad1675",
      "body": "Uuuuuuh huh. Well, well, well, what do we have here?\n\n“oNlY SoMe oF tHe GaMes WiLl bE kEYs”\n\n![gif](giphy|SUnnfaSxhfLvf8H7XB|downsized)",
      "score": 1,
      "created_utc": 1745607121.0,
      "replies": [
        {
          "id": "mqkmxg1",
          "author": "gman5852",
          "body": "Are you 12? What grown adult uses sponge mock memes for edrama lmao.",
          "score": 1,
          "created_utc": 1746381622.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mp0sfwo",
      "author": "Samson_J_Rivers",
      "body": "Yep. Definitely not buying that.",
      "score": 1,
      "created_utc": 1745608670.0,
      "replies": []
    },
    {
      "id": "mp0x2eg",
      "author": "snowdn",
      "body": "This is a big no. #nintendofail",
      "score": 1,
      "created_utc": 1745610083.0,
      "replies": []
    },
    {
      "id": "mp13rh5",
      "author": "kuebel33",
      "body": "Leave it to Nintendo to make one of the most baffeling decisions after coming off such a critical success.",
      "score": 1,
      "created_utc": 1745612138.0,
      "replies": []
    },
    {
      "id": "mp17osk",
      "author": "alozta",
      "body": "Oh no they are locking us into PC… Anyways",
      "score": 1,
      "created_utc": 1745613325.0,
      "replies": []
    },
    {
      "id": "mp1h6bk",
      "author": "KevinFunky",
      "body": "Not sure how I feel about these at all.  Like obviously would prefer the full physical game.  But we saw a lot of games being sold with just a download code inside last generation, with these at least you can sell/pass it on.  But the physical collector within me can’t see these as true physical media at all.",
      "score": 1,
      "created_utc": 1745616237.0,
      "replies": []
    },
    {
      "id": "mp1z81g",
      "author": "psykoX88",
      "body": "Didn't PC games do this in the past",
      "score": 1,
      "created_utc": 1745622280.0,
      "replies": []
    },
    {
      "id": "mp2bqiv",
      "author": "TodaysThrowawayTmrw",
      "body": "What's even the point then? if this just points to a download anyways. I hate the lack of ownership model that everyone has been pushed to. And like a bunch of suckers people have just eaten it up under the guise of convenience or something.",
      "score": 1,
      "created_utc": 1745626542.0,
      "replies": []
    },
    {
      "id": "mp4lise",
      "author": "tadaloveisreal",
      "body": "Clean w alcohol qtips",
      "score": 1,
      "created_utc": 1745665481.0,
      "replies": []
    },
    {
      "id": "mp4ydod",
      "author": "thedude213",
      "body": "And I won't be buying them.",
      "score": 1,
      "created_utc": 1745671302.0,
      "replies": []
    },
    {
      "id": "mp69xxm",
      "author": "Cultural_Prize8396",
      "body": "Yeahhhhh. No. Not happy about that. I very rarely get games digitally. Usually only if that is the only option available for a particular game. I wanted to get Shadow Generations, but didnt want it digitally. But they didnt make an accessible physical copy for the PS4. So my option was wait it out or get it on Switch where it would run like Crap. So I waited, got excited when I heard Switch 2 would be as powerful as a PS4 and heard it was going to be on Switch 2, now I see it will not be physical and am back to being stuck. At this point, I should say F Switch 2 and just buy a PS5 instead. ",
      "score": 1,
      "created_utc": 1745687120.0,
      "replies": []
    },
    {
      "id": "mp6d14j",
      "author": "DependentAnywhere135",
      "body": "Hopefully people don’t buy these and they discontinue it. If you’re going to sell a digital game in store just give a code. No one needs this plastic waste and if it’s digital just sell it as such instead of trying to sneakily pretend it’s physical.",
      "score": 1,
      "created_utc": 1745688057.0,
      "replies": []
    },
    {
      "id": "mp6whw0",
      "author": "DrunkenSquirrel82",
      "body": "Not in my house, they won't be. I'm not buying any game key cards. Greedy ass publishers can keep that shit.",
      "score": 1,
      "created_utc": 1745694045.0,
      "replies": []
    },
    {
      "id": "mpgs0h4",
      "author": "rjksn",
      "body": "Nope. Sorry Nintendo I’m 100% not joining you on this adventure. ",
      "score": 1,
      "created_utc": 1745839701.0,
      "replies": []
    },
    {
      "id": "mptm9bt",
      "author": "VeryGayLopunny",
      "body": "From the article:\n\n> When preorders opened in Japan yesterday, all physical releases of third-party games had Nintendo's Game-Key card disclaimer printed on them. And it looks like a whole lot of physical third-party Switch 2 game releases in the US will also be Game-Key cards, based on the box art accompanying the listings.\n\nIn other words: games larger than a standard cart or games where the devs don't want to pay extra for a cart much larger than their game.",
      "score": 1,
      "created_utc": 1746012681.0,
      "replies": []
    },
    {
      "id": "mqkoa9b",
      "author": "gman5852",
      "body": "Annoying but Nintendos games are still all physical and digital only games have sadly become the norm industry wide.\n\nBest to ignore the ewaste option and just buy digital in those cases.",
      "score": 1,
      "created_utc": 1746382036.0,
      "replies": []
    },
    {
      "id": "mx72caf",
      "author": "EroGG",
      "body": "Still better than code in a box. Also let's not forget lots of companies already used undersized cartridges on NS1 that required a download anyway.",
      "score": 1,
      "created_utc": 1749648178.0,
      "replies": []
    },
    {
      "id": "movj23e",
      "author": "happy-cig",
      "body": "Couldn't even get a switch yesterday so looks like this means i will skip this Gen. ",
      "score": 1,
      "created_utc": 1745535947.0,
      "replies": [
        {
          "id": "mowrzve",
          "author": "Dhiox",
          "body": "You wont play an entire gen because you couldn't get into the absolute first wave of purchases? Do you think it's gonna be sold out forever?",
          "score": 2,
          "created_utc": 1745551367.0,
          "replies": [
            {
              "id": "moxgna0",
              "author": "happy-cig",
              "body": "Depends on how soon they catch up with demand.\n\nI know people who skipped PS5 bc it took forever to meet demand and they just got sick and tired of fighting bots and waiting.\n\nYou gotta know that companies are taking customers for granted and pulling off bullshit wherever they can.  There are so many companies competing for our money, don't need them to pull off this anti consumer bs.",
              "score": 1,
              "created_utc": 1745563248.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mow3ubj",
      "author": "pandaSmore",
      "body": "Nobody should be buying this for the price they're charging.",
      "score": 1,
      "created_utc": 1745542961.0,
      "replies": []
    },
    {
      "id": "mowiu03",
      "author": "BeRandom1456",
      "body": "So in 20 years you won’t be able to even play the games you paid for? if the e shop is down and you don’t have a way to download it with the key, that is nuts. I wish people would boycott this but everyone is gonna buy one anyway. FOMO is real",
      "score": 1,
      "created_utc": 1745548069.0,
      "replies": [
        {
          "id": "mowss6e",
          "author": "Dhiox",
          "body": "I mean, in a few generations physical releases will be gone altogether, I'm not really sure what has people worked up. PC stopped doing physical releases over a decade ago.",
          "score": 2,
          "created_utc": 1745551670.0,
          "replies": [
            {
              "id": "mowwbz1",
              "author": "BeRandom1456",
              "body": "owning your games used to mean something. doesn’t mean it is okay to do.",
              "score": 0,
              "created_utc": 1745553091.0,
              "replies": [
                {
                  "id": "mowwgay",
                  "author": "Dhiox",
                  "body": "Technology changes. You either adapt or get left behind.",
                  "score": 2,
                  "created_utc": 1745553141.0,
                  "replies": [
                    {
                      "id": "moyua6h",
                      "author": "BeRandom1456",
                      "body": "Um. This is about consumer protections. Not how I used to write letters and not it’s texts and email. lol.  I give a shit about consumers.",
                      "score": -1,
                      "created_utc": 1745588003.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "movdius",
      "author": "BMXBikr",
      "body": "Even if they make them cheaper, the increased price for an actual physical copy will be worth it.",
      "score": 1,
      "created_utc": 1745534105.0,
      "replies": []
    },
    {
      "id": "move4vh",
      "author": "Retroid69",
      "body": "wasn’t this debunked nearly immediately after the Switch 2 Direct? i read/heard somewhere that this would be an option for third party devs and that Nintendo/first party would still be putting the games on their carts.",
      "score": 1,
      "created_utc": 1745534308.0,
      "replies": [
        {
          "id": "movxdio",
          "author": "Neo_Techni",
          "body": "No. The option exists, but the point is that a lot of publishers aren't taking it",
          "score": 1,
          "created_utc": 1745540750.0,
          "replies": []
        }
      ]
    },
    {
      "id": "movtthh",
      "author": "Boomkowski",
      "body": "Apologies for my ignorance, but could someone break this down so an idiot could understand?\n\nPlease and thank you.",
      "score": 1,
      "created_utc": 1745539541.0,
      "replies": [
        {
          "id": "movuu4p",
          "author": "coldfusion718",
          "body": "The key card only contains the key, no game data. You must download the game data from the internet. The key card will authenticate your game each time you load it to play. \n\nThat means in the future when they shut off the servers, your key card would be useless if you cannot download the game data from an alternative source or have it archived somewhere.",
          "score": 5,
          "created_utc": 1745539890.0,
          "replies": [
            {
              "id": "movwm2p",
              "author": "Boomkowski",
              "body": "Understood. Thank you kindly for the explanation.",
              "score": 5,
              "created_utc": 1745540491.0,
              "replies": [
                {
                  "id": "mow3exy",
                  "author": "coldfusion718",
                  "body": "No worries",
                  "score": 2,
                  "created_utc": 1745542816.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "movuk31",
      "author": "crashbandyh",
      "body": "Every announcement about the switch 2 does a bad job at justifying the price lol",
      "score": 1,
      "created_utc": 1745539793.0,
      "replies": []
    },
    {
      "id": "mowjnnj",
      "author": "None",
      "body": "Even as a digital-only guy, this pisses me off. I like digital for its conveniences, but I **choose** to do that. This just removes choice and fucks over consumers.\n\nAlthough there were many games that were just download codes, most weren’t. Now this Game Key thing guarantees most will do it.",
      "score": 1,
      "created_utc": 1745548354.0,
      "replies": []
    },
    {
      "id": "mox3ed6",
      "author": "VanceXentan",
      "body": "As I kid I marveled and wondered about how amazing future games would be but now I'm disgusted",
      "score": 1,
      "created_utc": 1745556197.0,
      "replies": []
    },
    {
      "id": "moyapo2",
      "author": "SmokelessSubpoena",
      "body": "For whomever needs to read it. \n\n\n\n_**You can fit multiple terabytes of data in a space the size of your pinky nail.**_ The \"cartridges\", or more realistically plastic holders of access keys, are to gatekeep game ownership and to remove private consumer ownership of IP. This has been an ongoing trend since the 360 era and the birth of digital downloads. Manufacturers, not the developer, want to cut COST, hence the complete dissolution of physical games. It also gets games to market faster (yay unfinished games!) which is a partial upside I suppose.\n\n\n\nNintendo is fairly dead to me now, but WE as consumers vote with our wallets. My vote for this direction is a big ol F$&K NO, so I'll build my PHYSICAL Switch 1 Library, and enjoy owning my property, not having it leased to me over the internet with a god dang gamekey.",
      "score": 1,
      "created_utc": 1745580653.0,
      "replies": []
    },
    {
      "id": "moztc8x",
      "author": "MidnightWorried6992",
      "body": "Going full digital for switch 2.",
      "score": 1,
      "created_utc": 1745598465.0,
      "replies": []
    },
    {
      "id": "mov499d",
      "author": "Juventino1804",
      "body": "Na booboo we'll pass over here with our hard earned money but if it's for YOU guys go for it .",
      "score": 0,
      "created_utc": 1745531063.0,
      "replies": []
    },
    {
      "id": "movt8gd",
      "author": "nekosama15",
      "body": "honestly i collected maybe 10k worth of physical games as a game collector. even games i dont play. this will save me a lot of money. no reason to buy those \"game keys\" and put them on a shelf XD",
      "score": 0,
      "created_utc": 1745539340.0,
      "replies": [
        {
          "id": "mow1knv",
          "author": "EZPZLemonWheezy",
          "body": "Kinda wonder if this is their answer to piracy in a way. Admin “who cares where you downloaded the game as long as you have a valid key” at least until someone breaks the keys.",
          "score": 1,
          "created_utc": 1745542188.0,
          "replies": [
            {
              "id": "mowh0xv",
              "author": "nekosama15",
              "body": "Am computer engineer.\n\nI dont know yet the inner workings of the switch. But i can tell u from history methods like this are ripe for abuse.\n\nFor example, there is no reason to break the keys. We can just trick the console to believe the key was correct. \n\nThis “key” method is a “Trojan horse” for pirates to run any game they want for free… Believe it or not nintendo shot themselves in the foot with this one.",
              "score": -1,
              "created_utc": 1745547440.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mow8pcq",
      "author": "Maggothair",
      "body": "This is another attempt to stop sharing games with other people. \nThey are going to tie cd keys with console serial number. \nNot now. Later. Guarantee it.",
      "score": 0,
      "created_utc": 1745544622.0,
      "replies": [
        {
          "id": "mowu1iw",
          "author": "Dhiox",
          "body": "If they wanted to do that, they'd just sell a game key like some games have in the past. Nintendo literally just gave people a way to share digital games",
          "score": 1,
          "created_utc": 1745552165.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mov4pfi",
      "author": "Knottian",
      "body": "But all the fanboys bootlicking Nintendo swore that was going to be a rarity, because… reasons. The entire initial reveal was so full of caveats and stipulations, it completely deflated the excitement, those of us with a brain, had.",
      "score": -3,
      "created_utc": 1745531204.0,
      "replies": [
        {
          "id": "mowtkqe",
          "author": "Dhiox",
          "body": ">But all the fanboys bootlicking Nintendo swore that was going to be a rarity,\n\nIt is a rarity, literally none of Nintendos games use it.",
          "score": 0,
          "created_utc": 1745551980.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mov173u",
      "author": "Groundbreaking-Pea92",
      "body": "Big N strategy to kill physical media. change more for these fake \"cartridges' and then use it as an excuse to go all online when people dont bu them",
      "score": -5,
      "created_utc": 1745530102.0,
      "replies": [
        {
          "id": "mov928v",
          "author": "Weir99",
          "body": "I don't really see why this is on Nintendo? If publishers wanted to publish games without a physical cartridge, they already had a perfectly good way to do that.\n\nThe key cartridges are just a different way for publishers to do what they were already doing",
          "score": 6,
          "created_utc": 1745532616.0,
          "replies": [
            {
              "id": "movn6bw",
              "author": "Groundbreaking-Pea92",
              "body": "bc they created the system and the publishers have to d what n says if they want to publish on the console.",
              "score": 1,
              "created_utc": 1745537312.0,
              "replies": [
                {
                  "id": "mowud5u",
                  "author": "Dhiox",
                  "body": ">the publishers have to d what n says if they want to publish on the console.\n\nNintendo isn't making them do this, plenty of third party devs are willing to pay to put them on more expensive cartridges. Thse devs are doing this because unlike Nintendo, they'd rather spend less on physical releases so they can make more money.",
                  "score": 3,
                  "created_utc": 1745552295.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "movc0o3",
              "author": "DontForgorTheMilk",
              "body": "It's cuz it's not. It's the ~~developers~~ publishers' decision to use the key cards. One could argue Nintendo shouldn't have even given the option to begin with ,and that's valid, but they're not the ones deciding which games are keys and which aren't.",
              "score": 1,
              "created_utc": 1745533598.0,
              "replies": [
                {
                  "id": "movz9lx",
                  "author": "Neo_Techni",
                  "body": "> It's the developers decision to use the key cards\n\n*Publishers",
                  "score": 0,
                  "created_utc": 1745541396.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mowu5xw",
          "author": "Dhiox",
          "body": "Nintendo isn't selling these, third parties are. All Nintendo games are fully on the vartridge",
          "score": 2,
          "created_utc": 1745552214.0,
          "replies": []
        },
        {
          "id": "movmwd8",
          "author": "Groundbreaking-Pea92",
          "body": "yes, yes you all worship nintendo.  nintendo is your brother, nintendo is your best friend",
          "score": 2,
          "created_utc": 1745537222.0,
          "replies": []
        }
      ]
    },
    {
      "id": "movgnhz",
      "author": "Aaron_Olive",
      "body": "Fuck Nintendo!\n\n90$ games and Xbox One DRM.\n\nWTF",
      "score": -2,
      "created_utc": 1745535143.0,
      "replies": [
        {
          "id": "mowtvuh",
          "author": "Dhiox",
          "body": ">Fuck Nintendo!\n\nThey're not the ones doing this, only third parties are. It would be make accurate to insult companies like SEGA",
          "score": 3,
          "created_utc": 1745552102.0,
          "replies": [
            {
              "id": "mox0j3g",
              "author": "Aaron_Olive",
              "body": "Oh but Nintendo are, $90 for physical games and $80 for digital. Nintendo is more greedy of the 3 also let me me not forget that they rarely have their games on sale on their store. This [video](https://m.youtube.com/watch?v=iIYvvSLblHg&pp=ygUSZG9uJ3QgYnV5IHN3aXRjaCAy) is a very good explanation why!",
              "score": 0,
              "created_utc": 1745554896.0,
              "replies": [
                {
                  "id": "mox0ysj",
                  "author": "Dhiox",
                  "body": ">Oh but Nintendo are, $90 for physical games and $80 for digital\n\nThis is why you actually research things instead of joining the ragebait bandwagon. They aren't doing this. It was completely made up by rage baiters. The game costs the same digital or physical. Nowhere is it 90 USD.",
                  "score": 3,
                  "created_utc": 1745555088.0,
                  "replies": [
                    {
                      "id": "mox4u6p",
                      "author": "Aaron_Olive",
                      "body": "So Mario Kart world is $80 per Nintendo’s official [website](https://www.nintendo.com/us/whatsnew/nintendo-maintains-nintendo-switch-2-pricing-retail-pre-orders-to-begin-april-24-in-u-s/?srsltid=AfmBOooPsawYcj5fneExC6X07Z4MrMDBC4_bfFLpzb3NgiMv2rtWOcZ4) thank you for correcting me but still software is getting too expensive.",
                      "score": 0,
                      "created_utc": 1745556882.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mow0oqs",
      "author": "Beefygaybro",
      "body": "Idk man. I keep seeing all these Nintendo posts but none of my gamer buddies are serious about getting a switch 2. Not even the casual let’s all get together and play Mario kart buddies. I got suspiciously downvoted for just calling out how Nintendo has had flops in the past before. Still think very few ppl are gonna buy this. We’re already in a recession.",
      "score": -1,
      "created_utc": 1745541886.0,
      "replies": [
        {
          "id": "mows1ho",
          "author": "NIN10DOXD",
          "body": "People were lined up like crazy at stores and the online stock sold out fast. Nintendo got 2 million lottery entries for their online store in Japan. Bloomberg is predicting that the Switch 2 is on pace to have the biggest launch ever. I think your experience might just be the exception.",
          "score": 3,
          "created_utc": 1745551384.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mowds3n",
      "author": "Syrairc",
      "body": "Can't wait to totally not sail the high seas with the switch 2 just as much as I did with the original",
      "score": -1,
      "created_utc": 1745546332.0,
      "replies": []
    },
    {
      "id": "mp1gd3m",
      "author": "Rumbananas",
      "body": "As much as it sucks, it’s also shitty that piracy is so common. Downvotes cometh but this strikes me as a reaction.",
      "score": -1,
      "created_utc": 1745615975.0,
      "replies": [
        {
          "id": "mqkmpz4",
          "author": "gman5852",
          "body": "They're comething because what you described makes absolutely zero sense.\n\nThere's zero connection between game key cards and piracy, nothing about piracy is solved by key cards and nothing about key cards is actually unique from an online license check in terms of security. You're also ignoring that physical games still exist on switch 2 and digital game sales, so clearly devs aren't concerned about using this as a security measure.\n\nYou just made up a connection from two unrelated topics and combined them while ignoring the real reason (Nintendo only providing 64 GB cartridges and devs not wanting to pay that cost). Of course you're going to get down voted.",
          "score": 1,
          "created_utc": 1746381560.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mow23m0",
      "author": "pandaSmore",
      "body": "![gif](giphy|hpAMh2sBYpsmFhSRPI)",
      "score": 0,
      "created_utc": 1745542366.0,
      "replies": []
    },
    {
      "id": "mowcn88",
      "author": "tisseng",
      "body": "So resellers going to buy it all somehow and inflate prices",
      "score": 0,
      "created_utc": 1745545951.0,
      "replies": []
    },
    {
      "id": "mowlgj6",
      "author": "None",
      "body": "[deleted]",
      "score": 0,
      "created_utc": 1745548989.0,
      "replies": [
        {
          "id": "mowundg",
          "author": "Dhiox",
          "body": "The whole point of this is that you can sell the cartridge, unlike game keys which are only usable once.",
          "score": 2,
          "created_utc": 1745552406.0,
          "replies": [
            {
              "id": "mowuzn7",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1745552541.0,
              "replies": [
                {
                  "id": "mowvn4f",
                  "author": "Dhiox",
                  "body": "Yes, you can. There is nothing stopping you from selling these",
                  "score": 1,
                  "created_utc": 1745552805.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mowo6xi",
      "author": "Dhiox",
      "body": "Seems to be entirely third party doing it, so you can't really blame Nintendo for it.",
      "score": 0,
      "created_utc": 1745549961.0,
      "replies": []
    },
    {
      "id": "mowtd92",
      "author": "Filmmagician",
      "body": "Na. They aren’t.  We’ll Send that message with our wallets.",
      "score": 0,
      "created_utc": 1745551900.0,
      "replies": []
    },
    {
      "id": "mov83c4",
      "author": "Chrono978",
      "body": "Nintendo flopping every other console is still going strong.",
      "score": -5,
      "created_utc": 1745532295.0,
      "replies": []
    },
    {
      "id": "movbm1u",
      "author": "Jamie00003",
      "body": "Why would anyone would buy physical games in 2025, most require updates before they work. Completely pointless and a waste of plastic",
      "score": -8,
      "created_utc": 1745533464.0,
      "replies": [
        {
          "id": "movo1az",
          "author": "sali_nyoro-n",
          "body": "Plenty of games didn't on Switch, most even. Also, being able to resell on the used market, or buy used for a lower price.",
          "score": 5,
          "created_utc": 1745537602.0,
          "replies": []
        }
      ]
    },
    {
      "id": "movgb0i",
      "author": "dannyb_prodigy",
      "body": "Let’s be perfectly clear here, no one has played a game directly off physical media in well over 10 years. Ever since patches and dlc became a thing for console releases, people have been playing off of the most recent version that’s been downloaded to their device.\n\nIt’s not even that notable that the physical media requires a download before letting you play. Certain games (usually ones with some form of online functionality because interoperability concerns) have had lockouts on the version on cart that require the most recent patch to be downloaded before use (Super Smash Bros 3DS for example).\n\nBasically, the fact that there is no game data on game carts now is a distinction without a difference from the way you’ve been playing games for a good while now.",
      "score": -8,
      "created_utc": 1745535027.0,
      "replies": [
        {
          "id": "movj3s2",
          "author": "EvilTaffyapple",
          "body": "This is just utter nonsense.\n\n93% of all gaming media is playable from the cartridge / cd directly. It’s literally being tracked on gaming sites.",
          "score": 6,
          "created_utc": 1745535963.0,
          "replies": [
            {
              "id": "movndbr",
              "author": "dannyb_prodigy",
              "body": "Read what I wrote. Even though it has been “possible” to play a game off the cartridge directly, very few people do play off the cartridge directly. How many people actually hit that “No thank you” button when they are told an update is available for whatever game they are booting up.\n\nMaybe me saying “no one” plays games off physical media is hyperbolic, but it’s patently absurd to think the majority of people playing video games nowadays are running unpatched versions of their games as they existed on the cart on day 0.",
              "score": -8,
              "created_utc": 1745537378.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mp1qv81",
          "author": "Neo_Techni",
          "body": "> no one has played a game directly off physical media in well over 10 years\n\nI own an Evercade.",
          "score": 1,
          "created_utc": 1745619399.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mov4tzn",
      "author": "beardlessw0nder",
      "body": "I don’t remember the last time I was able to insert a game into a console and go straight to playing without downloading the game online first. (Except for Nintendo of course)",
      "score": -4,
      "created_utc": 1745531244.0,
      "replies": []
    },
    {
      "id": "movqhkm",
      "author": "DaFilthPope",
      "body": "You know.  I’m totally fine with the conversion to digital only…  why waste time, money, and the destruction of the environment on this bullshit?",
      "score": -3,
      "created_utc": 1745538420.0,
      "replies": []
    }
  ]
}