{
  "post": {
    "title": "Maingear’s Retro95 combines ’90s-era PC design with modern specs | A prebuilt sleeper PC for those who miss CRTs and swapping out disks in the middle of games.",
    "author": "chrisdh79",
    "id": "1m78bh6",
    "score": 122,
    "created_utc": 1753274822.0,
    "selftext": "",
    "num_comments": 17,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1m78bh6/maingears_retro95_combines_90sera_pc_design_with/"
  },
  "comments": [
    {
      "id": "n4pceoi",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1753274822.0,
      "replies": []
    },
    {
      "id": "n4pg2z3",
      "author": "JohnJohn173",
      "body": "It does not come with a crt",
      "score": 41,
      "created_utc": 1753276039.0,
      "replies": [
        {
          "id": "n4pu8ls",
          "author": "Frequent_Ad_7874",
          "body": "And does not have a floppy drive.",
          "score": 16,
          "created_utc": 1753280424.0,
          "replies": [
            {
              "id": "n4q2hi9",
              "author": "JohnJohn173",
              "body": "At least thats expected, when the article about it, and the pictures showing it off include \"crt\" I would assume others like me assume it has some kind of crt that you could buy with it, or at least the connections for it. But neither of those are mentioned. I just want a new crt.",
              "score": 5,
              "created_utc": 1753282756.0,
              "replies": [
                {
                  "id": "n4sl1td",
                  "author": "weeklygamingrecap",
                  "body": "This has been my problem for a long time. Usually a few people get close using iPad screens and such to make a newer CRT like aesthetic but I don't think I've seen anyone actually just put one out on thingverse or where ever with a full parts list.\n\nClosest is / was [https://checkmate1500plus.com/](https://checkmate1500plus.com/)",
                  "score": 3,
                  "created_utc": 1753308072.0,
                  "replies": [
                    {
                      "id": "n4t1a9f",
                      "author": "JohnJohn173",
                      "body": "I really love the checkmate, just checked it out. I think thats great if you're going for pixel perfect led displays, it looks great, I'm sure would put out a fine signal considering how many ports it has from the beginning, but yeah its not a crt replacement if you have a crt. I am lucky enough to have kept an older tv from my parents house. A newer sony, cant remember the model but it has scart, s-video, component and coax so I can hook moat things up to it natively. So its not like I'm dying for a crt over here, they're also cheap if you know where to look. I would love even something as small as 12in thats done without being terrible and bad for the enviornment I'd easily pay $300 for it if not more depending on form factor, weight, and inputs. Bonus points for usb and digital inputs as well, but obviously harder to get digital to analog without issues.",
                      "score": 2,
                      "created_utc": 1753313275.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n4q2a1e",
              "author": "PARANOIAH",
              "body": "Load it up with content to make it a hard drive.",
              "score": 1,
              "created_utc": 1753282698.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n4ug3au",
          "author": "YellowThirteen_",
          "body": "It would’ve been cool if it had a crt display case with a curved lcd/oled on the front that hinged open to reveal a storage nook.",
          "score": 3,
          "created_utc": 1753332158.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4skbz1",
      "author": "weeklygamingrecap",
      "body": "Why do they call these sleeper pc's? lol You're not out here rolling up on someone with a RGB fishtank PC and drag racing FPS for pink slips to your rig.",
      "score": 6,
      "created_utc": 1753307849.0,
      "replies": []
    },
    {
      "id": "n4q0j0g",
      "author": "MidnightChannel91",
      "body": "[https://www.silverstonetek.com/en/product/info/computer-chassis/flp01/](https://www.silverstonetek.com/en/product/info/computer-chassis/flp01/) here's the case",
      "score": 7,
      "created_utc": 1753282217.0,
      "replies": []
    },
    {
      "id": "n4pxegt",
      "author": "Volhn",
      "body": "That’s cool. I think it’s the Silverstone case badged up and pre-built. \n\nI think the real difficulty is that all of these are previewed with a CRT which isn’t what people have. With some tweaking and a pair of case feet, I’d bet Silverstone could have a 90 rotation where the case can either be a mid-tower or desktop.\n\nOr pair it with some crazy all in one with an LCD built out like a chunky CRT and has all sorts of extras to fill out the case volune.",
      "score": 5,
      "created_utc": 1753281335.0,
      "replies": []
    },
    {
      "id": "n4t5qsg",
      "author": "PigSlam",
      "body": "They couldn’t even put a turbo button on it.",
      "score": 3,
      "created_utc": 1753314751.0,
      "replies": []
    },
    {
      "id": "n4q0b4p",
      "author": "dandylover1",
      "body": "It's ridiculous.  If they want to design such a machine, they should put real floppy, parallel, serial, etc. in it.  Yes, keep the modern options, but also give the buyer a choice, especially at that price!  And who really needs an 8tb hard drive, anyway?",
      "score": 2,
      "created_utc": 1753282157.0,
      "replies": [
        {
          "id": "n50dpop",
          "author": "Middcore",
          "body": "More people than need floppy, parallel, and serial.",
          "score": 3,
          "created_utc": 1753407356.0,
          "replies": []
        },
        {
          "id": "n4rqpd8",
          "author": "UnsorryCanadian",
          "body": "Data hoarders, I suppose",
          "score": 2,
          "created_utc": 1753299352.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4q1z60",
      "author": "el_esteban",
      "body": "It might be retro-inspired, but it hardly looks like a 90s machine. The fake floppy drives look, well, fake, and the giant air intakes are a dead giveaway that this is a modern machine.",
      "score": 2,
      "created_utc": 1753282615.0,
      "replies": []
    }
  ]
}