{
  "post": {
    "title": "Why the ThinkPad 701 became a cult legend in computer history",
    "author": "diacewrb",
    "id": "1m74gkd",
    "score": 333,
    "created_utc": 1753262159.0,
    "selftext": "",
    "num_comments": 50,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1m74gkd/why_the_thinkpad_701_became_a_cult_legend_in/"
  },
  "comments": [
    {
      "id": "n4ok781",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1753262160.0,
      "replies": []
    },
    {
      "id": "n4ollnj",
      "author": "FlattenInnerTube",
      "body": "I'm old enough, and was fortunate enough, to have had, and traveled globally with, a 701. Super solid and built like an IBM. I'd get to India with it - the unfolding keyboard was a showstopper whether at a customer or when going thru Customs. And one of my favorite features was no power brick - the power supply was internal and all I carried was the power cord.",
      "score": 136,
      "created_utc": 1753262966.0,
      "replies": [
        {
          "id": "n4ouca0",
          "author": "mattmog12",
          "body": "That internal power supply was genius. Can't believe modern laptops still make us lug around bricks after all these years. The butterfly keyboard was peak engineering,  nothing today has that same \"wow factor\" when you open it. Companies don't take those kinds of design risks anymore.",
          "score": 67,
          "created_utc": 1753267594.0,
          "replies": [
            {
              "id": "n4ox91x",
              "author": "SillyGoatGruff",
              "body": "Wouldn't the brick add a bunch of extra heat and weight and take up space for other components?",
              "score": 57,
              "created_utc": 1753268932.0,
              "replies": [
                {
                  "id": "n4oyvwb",
                  "author": "StraY_WolF",
                  "body": "Yup, unfortunately space in laptop is already super limited and thin laptop is selling waaay better than fat ones.",
                  "score": 40,
                  "created_utc": 1753269654.0,
                  "replies": [
                    {
                      "id": "n4pnbid",
                      "author": "Sup909",
                      "body": "Unless you are carrying around a gaming laptop, most “everyday” laptops like the MB Air or Surface have small bricks that are mostly the size of a phone charger brick these days.",
                      "score": 10,
                      "created_utc": 1753278340.0,
                      "replies": [
                        {
                          "id": "n4puho0",
                          "author": "ctrl-all-alts",
                          "body": "Yup. The bog standard power bricks are cheap and heavy and a robust (and inefficient) because of their simplicity. \n\nBut anything with a usb-C charging port can be powered from a third party tiny GaN wall charger. Even 100W ones aren’t huge and will cover your phone and tablet. If you’re moving around, that should be your plan. \n\nIf not, your cheap heavy brick doesn’t really matter.",
                          "score": 11,
                          "created_utc": 1753280497.0,
                          "replies": []
                        },
                        {
                          "id": "n4q0xw7",
                          "author": "Andovars_Ghost",
                          "body": "Exactly.  My new Thinkpad X1 Carbon Gen 13 (which I had to get since it will be the last with the ‘nub’), has a very small ‘brick’.",
                          "score": 3,
                          "created_utc": 1753282331.0,
                          "replies": [
                            {
                              "id": "n4qjkcu",
                              "author": "DogmaticLaw",
                              "body": "Oh no! How did I not know they were getting rid of the nub?! Now I guess I need to eye the X1 Carbon even more than I have...",
                              "score": 6,
                              "created_utc": 1753287485.0,
                              "replies": [
                                {
                                  "id": "n4qlqfa",
                                  "author": "Andovars_Ghost",
                                  "body": "Lenovo announced that in January and said that the X1 Carbon Gen 13 would be their last laptop with it.  Said it was time to 'move on', but I disagree.  That being said, I find that I don't use it as much as I used to since the trackpads are much better than back in the day, and now I also use a mouse a lot more.  Still, I'm glad I have it on my ThinkPad.\n\nEdit: BTW, I friggin LOVE this laptop.  Easily my favorite laptop ever.  And I've owned/reviewed A LOT.",
                                  "score": 3,
                                  "created_utc": 1753288090.0,
                                  "replies": [
                                    {
                                      "id": "n4qnuwy",
                                      "author": "DogmaticLaw",
                                      "body": "I've read nothing but positive things about the Gen 13, which is part of why I've been eyeing it to replace my aging T14 (gen 2? It's not the freshest...) I still love Thinkpads as a concept and still use the nub pretty constantly. It's so convenient if you just need a quick little movement of the mouse, or even more convenient for the middle button + scroll while working in web apps.\n\nThe price of that X1 Carbon though... woof!",
                                      "score": 2,
                                      "created_utc": 1753288687.0,
                                      "replies": [
                                        {
                                          "id": "n4qzy74",
                                          "author": "Andovars_Ghost",
                                          "body": "Yeeaahhh, the price does suck but it is such a nice computer I've been OK with it.  I actually found a really good deal on it through CDW.  It was several hundred off of the list price for a brand new one.",
                                          "score": 3,
                                          "created_utc": 1753291920.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "n5ayk4d",
                                      "author": "Crowlands",
                                      "body": "Shame that they are doing that, even if it gets used less than it did, that red dot in the middle of the ThinkPad keyboard is an iconic part of them.",
                                      "score": 2,
                                      "created_utc": 1753553894.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n4ptdy5",
                      "author": "VirtuousVice",
                      "body": "No, there was a time when laptops were insanely bulky and making them more convenient was a huge priority. Now we’re making them as this as possible at the sacrifice of functionality and it’s positively stupid that the average consumer has blindly accepted this while paying more.",
                      "score": 4,
                      "created_utc": 1753280177.0,
                      "replies": []
                    },
                    {
                      "id": "n4pjlyk",
                      "author": "horsewarming",
                      "body": "It would make taking your laptop to the bathroom a lot more inconvenient.",
                      "score": 1,
                      "created_utc": 1753277164.0,
                      "replies": [
                        {
                          "id": "n4q4s6s",
                          "author": "Tarogato",
                          "body": "Why are you using your laptop in the bathroom? If you're spending that much time on the can then you need to evaluate your diet.",
                          "score": 0,
                          "created_utc": 1753283403.0,
                          "replies": [
                            {
                              "id": "n4rmbmi",
                              "author": "horsewarming",
                              "body": "I thought that's what shitposting means, idk.",
                              "score": 1,
                              "created_utc": 1753298100.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n4q1vrn",
                      "author": "quick_justice",
                      "body": "Modern thin laptops run 8+ hours of battery life on office tasks and charge in a couple of hours. People carry around power adapters very rarely.",
                      "score": 0,
                      "created_utc": 1753282589.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n4pniqi",
          "author": "Tinmania",
          "body": "I had one too, and traveled with it extensively. It’s probably my favorite laptop, taking into consideration the time period. I was also on team TrackPoint. Once you got used to using it it really was amazing, compared to the trackpads, roller ball things, and whatever else they tried back then. \n\nHonorable mention goes to the Toshiba Libretto that I had in 1997. Fully functionable, and usable, windows “laptop” the size of a VHS cassette tape. Talk about being able to travel light. When traveling, I think more people were impressed by it than by my IBM 701.",
          "score": 11,
          "created_utc": 1753278402.0,
          "replies": []
        },
        {
          "id": "n4px8jb",
          "author": "Unaccepatabletrollop",
          "body": "I just can’t get with the outside finish though. My stack of thinkpads are all slowly disintegrating, the finish is like greasy crumbly dust",
          "score": 4,
          "created_utc": 1753281287.0,
          "replies": []
        },
        {
          "id": "n4pmrr5",
          "author": "saml01",
          "body": "I was fortunate enough to have been able to play with the butterfly when it was new. My dad had one.  Of all the laptops i have had i remember the one that wasn’t even mine. It was a masterpiece. ",
          "score": 3,
          "created_utc": 1753278169.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4oktcu",
      "author": "got-trunks",
      "body": "What would be legendary is a motherboard swap vendor for all these sweet old thinkpads they refuse to make anymore. \n\nI'd rather pay $1k ish for a new mobo and battery etc and keep an old chassis for another decade or so.",
      "score": 58,
      "created_utc": 1753262515.0,
      "replies": [
        {
          "id": "n4ollpr",
          "author": "FujiClimber2017",
          "body": "I sure hope you enjoy viewing shitty late 90s TN LCD panels 🤢",
          "score": 15,
          "created_utc": 1753262967.0,
          "replies": [
            {
              "id": "n4olu98",
              "author": "got-trunks",
              "body": "Those are easily upgradable as well, but nothing to be done about the aspect ratio depending on how old and what model lol.",
              "score": 7,
              "created_utc": 1753263102.0,
              "replies": [
                {
                  "id": "n4om4ji",
                  "author": "FujiClimber2017",
                  "body": "I have recently seen an adapter board available that converts an iPad Panel to VGA/HDMI, that would probably work.",
                  "score": 2,
                  "created_utc": 1753263264.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n4omh3o",
          "author": "talex365",
          "body": "Mod a raspberry pi into the chassis and rock some Linux?",
          "score": 8,
          "created_utc": 1753263460.0,
          "replies": [
            {
              "id": "n4omt49",
              "author": "got-trunks",
              "body": "I was thinking something like ITX llama but with a decent enough modern arm or x86. Like notebook arm but yeah that'd be an interesting project haha. Be a lot more powerful than pentium generations for sure but there are some core2duo ones that were built decently as well.",
              "score": 3,
              "created_utc": 1753263645.0,
              "replies": [
                {
                  "id": "n4on0dv",
                  "author": "talex365",
                  "body": "You’re going to run into heat discharge issues on anything more powerful than a SoC board most likely, you might be able to use a Framework 13 laptop board too but I’m not sure it’d fit.",
                  "score": 3,
                  "created_utc": 1753263758.0,
                  "replies": [
                    {
                      "id": "n4qrvnk",
                      "author": "Party_Cold_4159",
                      "body": "It’s already being done by a modder with a 701c.",
                      "score": 2,
                      "created_utc": 1753289777.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n4okd72",
      "author": "nnngggh",
      "body": "Summary: the butterfly keyboard. But we all knew that already.",
      "score": 15,
      "created_utc": 1753262255.0,
      "replies": []
    },
    {
      "id": "n4op7ch",
      "author": "DaThug",
      "body": "Somewhere in this house I still have one of those :)",
      "score": 6,
      "created_utc": 1753264946.0,
      "replies": []
    },
    {
      "id": "n4p67xa",
      "author": "crappydeli",
      "body": "I still have mine (or one close to it with the extendable keyboard). Runs a 486DX2",
      "score": 3,
      "created_utc": 1753272607.0,
      "replies": []
    },
    {
      "id": "n4q0oa8",
      "author": "InadequateAvacado",
      "body": "I worked in the Thinkpad support call center in 1999-2000. This and the modular models were so cool at the time. Fun fact: We drank the koolaid hard and still used token ring network and BNC in our office. Everything would slow to a crawl when everyone logged on in the morning. WebExplorer, Lotus Notes, etc. Oh the nostalgia!",
      "score": 3,
      "created_utc": 1753282258.0,
      "replies": [
        {
          "id": "n4sbo35",
          "author": "BigLan2",
          "body": "Lotus Notes PTSD crew checking in. The day we got Outlook was the best day ever.",
          "score": 3,
          "created_utc": 1753305258.0,
          "replies": [
            {
              "id": "n4vz3nt",
              "author": "BarbequedYeti",
              "body": "You think notes was bad.... You should have tried supporting domino on the backend. What a complete POS. ",
              "score": 2,
              "created_utc": 1753359841.0,
              "replies": []
            },
            {
              "id": "n4sh4rk",
              "author": "InadequateAvacado",
              "body": "Haha no doubt",
              "score": 1,
              "created_utc": 1753306871.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5e6ytx",
          "author": "jfdirfn",
          "body": "I remember having the ethernet vs token ring argument with an IBMer back in those days. It was impossible to shift their view that 4mbps through those clunky hermaphrodite plugs was going to dominate networking.",
          "score": 1,
          "created_utc": 1753599203.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4q2291",
      "author": "Rabbit-Hole-Quest",
      "body": "IBM laptops used to be so amazing.\n\nThe Lenovo takeover the business just made it into a generic laptop maker. They just aren’t as reliable as they used to be.",
      "score": 3,
      "created_utc": 1753282639.0,
      "replies": [
        {
          "id": "n4q74y9",
          "author": "diacewrb",
          "body": "I wouldn't say that is 100% true, Lenovo did release a couple of weird and wonderful options every now and again like:\n\nW700ds - Had a second screen that popped out at the side\n\nX1 Fold - Foldable OLED screen\n\nPlus Gen 6 Rollable - Rollable screen\n\nYoga Book 9i Gen 8 - Dual and touch screen\n\nYoga Tablet 3 Pro - Had a built in projector",
          "score": 3,
          "created_utc": 1753284049.0,
          "replies": [
            {
              "id": "n4qwq4d",
              "author": "Party_Cold_4159",
              "body": "They’ve stayed somewhat close to the original thinkpad brand and more so than any other laptop manufacturer. They have been straying with the ultra lights but at least they offer many more options compared to others.",
              "score": 4,
              "created_utc": 1753291071.0,
              "replies": [
                {
                  "id": "n4snz7v",
                  "author": "irrelevantusername24",
                  "body": "The tech industry needs to go back to taking the lessons from the early auto industry where everything was interoperable and mass manufactured and stop taking lessons from some fast food chains where for the most part most things are the same no matter where you go but also there is zero guarantee that the owner of one store isn't making random changes to the menu.\n\nWhich to be fair is sometimes a good thing, but at the point that single store owner should be able to sell their idea to the main branch because that's kinda the entire point of \"franchising\".\n\nAnyway, as I recently was [reminded](https://www.reddit.com/r/Windows11/comments/1m4xha6/comment/n49k04q/?context=3&utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) of this song,\n\n>There's a right way, and there's a wrong way, lets do it our way\n\nWhich is all well and good but if your way is the wrong way you should go out of business at best and at worst end up in prison. Not continue doing business as if the level of quality has remained the same. Especially not if the businesses \"outsourced\" are doing everything, and doing their best to keep the quality consistent, whilst being consistently undermined by the necessity to subsidize the now effectively superfluous business.\n\nAnd to be clear I do have some in mind when I say this but it is probably not who you think because it is complicated.\n\n\\---\n\nMore succinctly there are only so many OS' and many more manufacturers and those manufacturers make small parts that go in to the final devices, and that is like the early auto industry, but when the OS' are actually the same and are only being differentiated by legalese (or \"code\" which is exactly as superfluous as legalese) and effectively what is happening is, in addition to the quality going down, that quality is going down because quite literally what is happening is they are selling bits and pieces of what should be a whole, and charging a premium for that. Selling less for more and selling pieces that are [indivisible](https://music.youtube.com/watch?v=r1gKk072c2Q&feature=shared).\n\nTech got too good too fast and the \"first sin\" was probably between Nintendo and Sony (and Sharp, etc)\\*. But their [same logic](https://open.spotify.com/playlist/0tZQelavEklUqEarDo1phN) has been applied to the entire tech industry from beginning to \"the last mile\" and has from there infected the rest of society and well \\*gestures broadly\\*\n\n\\---\n\n^(Art makes the invisible visible.)\n\n^(Words and numbers are one thing, but art beats both.)\n\n^(Language and math can both be art but not all language or math is art.)\n\n\\---\n\nedit:\n\n^(\\*It goes back further than the modern tech industry, but it is complicated.)   \n  \n^(And even in that specific case attributing blame to certain companies does not explain) [^(the truth)](https://www.reddit.com/r/technews/comments/1m76fvc/comment/n4sv2q6/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)^(.)\n\n^(Because) [^(the problem is the same as it always is)](https://archive.org/stream/sinandsocietyan00rossgoog/sinandsocietyan00rossgoog_djvu.txt#:~:text=PREFACE,%20133)^(.)",
                  "score": 1,
                  "created_utc": 1753308986.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n4q41bo",
      "author": "Friedguywubawuba",
      "body": "The only computer with a clit",
      "score": 2,
      "created_utc": 1753283196.0,
      "replies": [
        {
          "id": "n4r4c13",
          "author": "bayoublue",
          "body": "Back in the 90s and into the early 2000s, clits were a lot more common.",
          "score": 1,
          "created_utc": 1753293096.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4rb0ds",
      "author": "notjordansime",
      "body": "I had one like 5 years ago. The hinge/butterfly mechanism was broken and my mother threw it away :(",
      "score": 2,
      "created_utc": 1753294943.0,
      "replies": []
    },
    {
      "id": "n4q31s6",
      "author": "Zealousideal_Pay7176",
      "body": "The ThinkPad 701's expandable keyboard was pure genius, no wonder it became a legend!",
      "score": 1,
      "created_utc": 1753282915.0,
      "replies": []
    },
    {
      "id": "n4qu40t",
      "author": "Party_Cold_4159",
      "body": "Just restored a 701CS. The display is absolute garbage but I love the thing to death. Wish I had my old 701C but it fell a foot off a coffee table and shattered like glass.",
      "score": 1,
      "created_utc": 1753290376.0,
      "replies": []
    },
    {
      "id": "n4x52qh",
      "author": "PetieG26",
      "body": "Was so pleasantly surprised to learn how rock solid the keyboard mechanism was...",
      "score": 1,
      "created_utc": 1753372432.0,
      "replies": []
    },
    {
      "id": "n5byxe0",
      "author": "Tomtomatreddit",
      "body": "https://www.701c.org/\nFound this.",
      "score": 1,
      "created_utc": 1753565809.0,
      "replies": []
    }
  ]
}