{
  "post": {
    "title": "Apple could launch a smart security camera in 2026",
    "author": "a_Ninja_b0y",
    "id": "1gpq0fz",
    "score": 4,
    "created_utc": 1731432149.0,
    "selftext": "",
    "num_comments": 25,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gpq0fz/apple_could_launch_a_smart_security_camera_in_2026/"
  },
  "comments": [
    {
      "id": "lws0uhi",
      "author": "Heisenberg_235",
      "body": "Great. \n\nI too plan on doing something in over 12 months time.\n\nMight be good, who knows.",
      "score": 26,
      "created_utc": 1731432500.0,
      "replies": [
        {
          "id": "lws7c77",
          "author": "adel_b",
          "body": "I want to build security camera, wanna partner? we 11 or 13 months deadline",
          "score": 4,
          "created_utc": 1731434476.0,
          "replies": []
        },
        {
          "id": "lws5od2",
          "author": "Zomunieo",
          "body": "You should put out a press release. \n\nUsing lots of broken. Apple-style sentence fragments.",
          "score": 2,
          "created_utc": 1731433975.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lws5kod",
      "author": "randomDudebsjsue",
      "body": "How much it would cost?\n 🍎: $2000 a cam",
      "score": 6,
      "created_utc": 1731433943.0,
      "replies": [
        {
          "id": "lws9j35",
          "author": "arwinda",
          "body": "*a scam /s",
          "score": 4,
          "created_utc": 1731435149.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwsd8ss",
      "author": "Pilfercate",
      "body": "All we need is more trash securiry cameras with an unusable web interface that requires a monthly subscription. I miss when Wyze was an ethical company. There are no more heroes in web based security cameras, only villains.",
      "score": 3,
      "created_utc": 1731436280.0,
      "replies": []
    },
    {
      "id": "lws1yho",
      "author": "DrBhu",
      "body": "**Subtitle of the Article:**\n\n*\"An Apple Home camera would fit neatly into Apple’s smart home ecosystem and could leverage Apple Intelligence, says analyst.\"*\n\nBuying a (most likely) very much overprized security camera which would \"*improve*\" Apple AI with the collected data from your home sounds a bit dystopian.\n\nAnd I am pretty sure they would get some serious problems if they use data which was collected in customers homes to train their AI model.\n\nThey just completely overslept the whole AI thing. Their actual strategy to compete seems to be to get as much training-data as possible to catch up with the big boys. (In this particular area.)",
      "score": 3,
      "created_utc": 1731432839.0,
      "replies": [
        {
          "id": "lws4mka",
          "author": "reddit455",
          "body": "> Apple AI with the collected data from your home sounds a bit dystopian.\n\n...your speakers say \"it's really hot in here\".\n\n  \n**HomePod Saves Family's Life After Dog Starts Kitchen Fire**\n\n[https://www.macrumors.com/2024/07/08/homepod-fire-alert/](https://www.macrumors.com/2024/07/08/homepod-fire-alert/)\n\nThe Colorado Springs Fire Department claims the homeowners received **a \"high heat\" notification from the ‌HomePod‌,** which alerted them to the fire, but the ‌HomePod‌ doesn't have a feature for sending alerts about high temperatures.\n\n\n\n>Buying a (most likely) very much overprized security camera \n\n$99 speaker.\n\n  \ndid a window just break? did the carbon monoxide alarm go off in the basement?\n\nshould I call the police?\n\n\n\n[https://support.apple.com/guide/homepod/alerts-smoke-carbon-monoxide-detectors-apd1f1921722/homepod](https://support.apple.com/guide/homepod/alerts-smoke-carbon-monoxide-detectors-apd1f1921722/homepod)\n\nGet alerts for smoke and carbon monoxide detectors\n\nWith Sound Recognition, HomePod can detect the sound of a smoke or carbon monoxide alarm in your home, and alerts you by sending a notification to your iPhone, iPad, or Apple Watch. Tap the notification to check in and make sure everything is all right.\n\n  \n\n\n\"i've fallen and I can't get up\"\n\n\n\n**Use HomePod for phone calls**\n\n[https://support.apple.com/guide/homepod/use-for-phone-calls-apdeaa15a6c3/homepod](https://support.apple.com/guide/homepod/use-for-phone-calls-apdeaa15a6c3/homepod)",
          "score": -1,
          "created_utc": 1731433654.0,
          "replies": [
            {
              "id": "lws53w5",
              "author": "DrBhu",
              "body": "Privacy is a great good and should not be sacrificed on the altar of convenience.",
              "score": 1,
              "created_utc": 1731433803.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwsh660",
      "author": "AmaGh05T",
      "body": "The all new iSee. Let us iSee you always.",
      "score": 1,
      "created_utc": 1731437471.0,
      "replies": []
    },
    {
      "id": "lxkxln3",
      "author": "None",
      "body": "\"Apple could...\"\n\nOh wow, the height of journalism.",
      "score": 1,
      "created_utc": 1731844543.0,
      "replies": []
    },
    {
      "id": "ly3sg4v",
      "author": "JFKeNn3dy",
      "body": "That is the last thing anyone needs is another apple product spying on you.",
      "score": 1,
      "created_utc": 1732113796.0,
      "replies": []
    },
    {
      "id": "lz1q972",
      "author": "themightyknight02",
      "body": "No thanx",
      "score": 1,
      "created_utc": 1732610678.0,
      "replies": []
    },
    {
      "id": "lws0x9s",
      "author": "P_Ston",
      "body": "They want to be Google so bad in the smart home space",
      "score": -1,
      "created_utc": 1731432524.0,
      "replies": [
        {
          "id": "lws18l1",
          "author": "SeparateSpend1542",
          "body": "No Amazon. Google’s smart home stuff crashed and burned but Ring is still going strong.",
          "score": 8,
          "created_utc": 1731432619.0,
          "replies": [
            {
              "id": "lws3xd8",
              "author": "BeardyGoku",
              "body": "??? \n\nNest is still going strong",
              "score": -3,
              "created_utc": 1731433442.0,
              "replies": [
                {
                  "id": "lws4kiq",
                  "author": "SeparateSpend1542",
                  "body": "It’s over as of April: https://blog.arlo.com/home-security-tips/google-nest-secure-is-discontinued-heres-your-alternative/#:~:text=As%20of%20April%208%2C%202024,is%20even%20recommending%20recycling%20it.a",
                  "score": 6,
                  "created_utc": 1731433636.0,
                  "replies": [
                    {
                      "id": "lws5352",
                      "author": "SeparateSpend1542",
                      "body": "Here’s an article that describes the experience of Google smart home adopters; of which I was one (want to buy some cameras?):\n\nhttps://www.androidauthority.com/google-smart-home-3319869/",
                      "score": 2,
                      "created_utc": 1731433796.0,
                      "replies": []
                    },
                    {
                      "id": "lws5ixl",
                      "author": "BeardyGoku",
                      "body": "Never heard of that product. Google still sells a lot of other nest products.",
                      "score": -1,
                      "created_utc": 1731433928.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lws5nzx",
                  "author": "IronHeart_777",
                  "body": "For better or worse, I've been a hardcore google fanboy since my first android phone back in the donut/eclair days. I have probably 8 googles homes of varying models (mini, home hub, normal size), multiple google cameras, the nest learning thermostat, the doorbell, etc. While they haven't \"crashed and burned\" the quality of service certainly has. Every Google home I have randomly activates at random times, sometimes in dead silence. My cameras continually have connection issues even though I've spent a fortune on my home network, ensuring there's no dead zones anywhere. I just recently made a post over on r/Hue about how my google homes have all seemingly forgotten how to control my lights correctly. If I weren't so heavily invested, I'd love to switch to a different smart home setup, but I have huge issues with Amazon just enabling their sidewalk function and it being opt out instead of in.\n\nEdit: The crash and burn comment made by separatespend may be in reference to google discontinuing their nest security system but I believe that was done around the time they decided to partner with ADT. I have a ring security system, but haven't used it since offloading all of my ring cameras since it was found out that ring employees were watching camera streams when they shouldn't have been.",
                  "score": 1,
                  "created_utc": 1731433972.0,
                  "replies": [
                    {
                      "id": "lwsit0m",
                      "author": "SeparateSpend1542",
                      "body": "I mean exactly what you describe. They abandoned products and stopped updating the firmware so now the systems don’t work right and Google shows no signs of investing in the ecosystem. It used to be competitive if not superior to most smart home systems on the market but now it’s barely usable since it lacks reliability, which is a key feature for something you give control of your home. \n\nUnfortunately, smart home systems aren’t something you can just replace like a phone. So you get stuck with a bunch of cameras that no longer work that you bought to integrate with your Nest (yes I speak from experience).\n\nMy advice to anyone thinking about setting up a smart home: don’t use Google. They don’t support their products and you’ll be stuck with thousands of dollars of junk.",
                      "score": 2,
                      "created_utc": 1731437970.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lws77ej",
      "author": "Thesorus",
      "body": "Did they finally bought the \"iWatch\" trademark ?",
      "score": 0,
      "created_utc": 1731434436.0,
      "replies": []
    },
    {
      "id": "lws3t8e",
      "author": "sleepcurse",
      "body": "I wish they would. Most options I have tried suck and I always end up back with my old school nest cameras.",
      "score": 0,
      "created_utc": 1731433407.0,
      "replies": [
        {
          "id": "lwsla0u",
          "author": "Bigbadbo75",
          "body": "I moved to UniFi and with the homebridge add in. I’ve never had a problem",
          "score": 1,
          "created_utc": 1731438738.0,
          "replies": [
            {
              "id": "lwsztmh",
              "author": "sleepcurse",
              "body": "I’m looking at unifi for the next house. \n\nMy use case really needs to be able to scrub video on playback and most cameras don’t offer it. Unifi apparently does and obviously my nest cams do.",
              "score": 1,
              "created_utc": 1731443194.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}