{
  "post": {
    "title": "Sam Altman's World brings biometric eyeball scans to US",
    "author": "One-End1795",
    "id": "1kekflt",
    "score": 12,
    "created_utc": 1746367105.0,
    "selftext": "",
    "num_comments": 33,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kekflt/sam_altmans_world_brings_biometric_eyeball_scans/"
  },
  "comments": [
    {
      "id": "mqjd0eu",
      "author": "technanonymous",
      "body": "I am reminded of minority report where your eyes are scanned constantly and people are harassed constantly by advertisers.  No thanks.",
      "score": 55,
      "created_utc": 1746367419.0,
      "replies": [
        {
          "id": "mr6wduf",
          "author": "hereforstories8",
          "body": "“No honey I have no clue why they keep bombarding me with Asian porn ads. I think your kid is looking up some stuff on the internet.”",
          "score": 2,
          "created_utc": 1746677651.0,
          "replies": []
        },
        {
          "id": "mqjghhi",
          "author": "nicuramar",
          "body": "This sub is as cynical and technodepressive as /r/technology these days. “Everything sucks”. “I’ve seen a fictional movie where this is bad”.",
          "score": -52,
          "created_utc": 1746368570.0,
          "replies": [
            {
              "id": "mqjlecy",
              "author": "5553331117",
              "body": "Enshittification isn’t a word people made up for fun. It’s the modern reality of basically everything in tech.",
              "score": 36,
              "created_utc": 1746370146.0,
              "replies": []
            },
            {
              "id": "mqjj2ya",
              "author": "AutistcCuttlefish",
              "body": "Probably being optimistic and tech positive about  has been proven to be pure naivety at this point.\n\nEvery positive way tech can be used will be gatekept and priced out of reach of the average person. Every dystopian use will be pushed upon us by corporations and governments whether we like it or not. \n\nThere's nothing to get excited about anymore. Star Trek is nothing more than a pipedream. Reality is much more reflective of a hodgepodge of every cyberpunk and dystopian novel people have read than anything even close to resembling a hopeful future.",
              "score": 38,
              "created_utc": 1746369406.0,
              "replies": []
            },
            {
              "id": "mqjpxng",
              "author": "annoyed__renter",
              "body": "Science fiction is about exploring the pros and cons of human interactions with technology to pose interesting moral, ethical, and philosophical questions. Given the exponential rate of advancement, it's inevitable that humanity will rapidly begin to achieve what was merely science fiction in past. So we see increasing numbers of \"this looks like that horrifying concept from PKD or Black Mirror\" a lot.",
              "score": 8,
              "created_utc": 1746371571.0,
              "replies": []
            },
            {
              "id": "mqjorv0",
              "author": "gargravarr2112",
              "body": "Because most of those fictional movies have sprung into reality. Technology has not been used for the benefit of the common person, it's used to profile us and either sell us stuff we don't need or rank us on the likelihood of breaking some law. Facial recognition is bad enough - police are deploying that without oversight and just dragnet-scanning public places. The right to anonymity in public is being eroded - if you walk down the street minding your own business and don't meet anybody you know, you should be forgotten, not have your exact movements logged in a database for years and brought up by a random warrantless search. Because this is what actually happens. Even my local store has implemented facial scanning on entry - which makes me feel like a criminal every time I walk in there, because they're automatically suspecting me as a shoplifter.\n\nTechnology is not our saviour, it has become our oppressor.",
              "score": 9,
              "created_utc": 1746371207.0,
              "replies": [
                {
                  "id": "mqm6dd8",
                  "author": "lkn240",
                  "body": "The idea that technology has not be used to benefit the common person is completely fucking insane.  You must be very young.  I grew up before the Internet and smart phones and I can assure you that technology has brought countless benefits during my lifetime.\n\nIt's certainly true that there have been negatives also... but it's much, much more nuanced than you imply.",
                  "score": 0,
                  "created_utc": 1746399400.0,
                  "replies": [
                    {
                      "id": "mr456yh",
                      "author": "cubert73",
                      "body": "You must not have actually worked in technology. My first software development job was in 1993, the same year the World Wide Web was launched. The benefits you see are for two reasons only: to fuel capitalism, and to protect the people in power. As such tech impacts have been incredibly uneven as the digital divide erupted into existence, then expanded quickly. Today the surveillance state has grown to such a degree that, as the previous commenter said, you are tracked almost everywhere and the footage is stored and can be processed years later.\n\nAs one example, I just spent six months doing digital verification on a case for someone who has been wrongly jailed for two years so far. I went through hours of footage and an exhaustive amount of work to prove the video did not show what the prosecution claimed it did. A motion has been filed to submit this new evidence, but there is no guarantee a judge will review it. A man who is absolutely not guilty is sitting in jail for an unknown length of time because of the false belief that the camera doesn't lie, ignoring the fact that people do.\n\nThe surveillance state is not in the public's best interest.",
                      "score": 6,
                      "created_utc": 1746644420.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr4k0qk",
              "author": "kmatyler",
              "body": "Maybe if tech companies would stop making the bad things from sci-fi movies  that wouldn’t happen so much",
              "score": 3,
              "created_utc": 1746648754.0,
              "replies": []
            },
            {
              "id": "mqo3ss2",
              "author": "christoskal",
              "body": "Is there any subreddit that is not about hating technology and gadgets?\n\nI am looking for one where people are happy and share what they enjoy about gadgets and this one is only about fear, hate and tariffs",
              "score": 2,
              "created_utc": 1746428928.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mqk2m6i",
      "author": "DramaticBush",
      "body": "I'm good thanks",
      "score": 11,
      "created_utc": 1746375519.0,
      "replies": []
    },
    {
      "id": "mqk85m9",
      "author": "sockydraws",
      "body": "Biometric info like this is not a password. It’s a username. \n\nIf someone gets your password you can change it. Can you change your eyeball if it gets duplicated?  Can you choose to withhold your eyeball scan? You can choose not to disclose your normal passwords. ",
      "score": 8,
      "created_utc": 1746377227.0,
      "replies": []
    },
    {
      "id": "mqjdquf",
      "author": "UniqueSteve",
      "body": "And when they get hacked, which they will, I assume I get new eyes for free, right?",
      "score": 13,
      "created_utc": 1746367665.0,
      "replies": [
        {
          "id": "mqjgk8i",
          "author": "CondescendingShitbag",
          "body": "Installed by none other than Peter Stormare himself.",
          "score": 6,
          "created_utc": 1746368595.0,
          "replies": []
        },
        {
          "id": "mqjolbu",
          "author": "UPVOTE_IF_POOPING",
          "body": "It uses the blockchain and multiple (like 10+) corpos would need to be infiltrated at once in order to obtain the full set of information. Don’t get me wrong, I ain’t doing the eyeball scan. But it does seem to have some basic security behind it.",
          "score": 2,
          "created_utc": 1746371150.0,
          "replies": [
            {
              "id": "mr8cl61",
              "author": "Sweet_Concept2211",
              "body": "Their security sounds impressive until you realize it is a series of tall poles with no fence between them.\n\nAll I need is a decent resolution digital pic of your eyes - with that I can create a color/texture map for a 3D model. If I can get that verified with Altman's startup before you, then your \"Altman ID\" is mine.\n\nThis hack could really fuck with some tech illiterate politicians, executives, and influencers.",
              "score": 1,
              "created_utc": 1746706188.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr624jx",
          "author": "Aidan_Welch",
          "body": "So an unironic answer: any sane developer would hash the data rather than store it raw",
          "score": 1,
          "created_utc": 1746666200.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr2tuk2",
      "author": "the_jungle_awaits",
      "body": "Sam Altman is a smug turd.",
      "score": 12,
      "created_utc": 1746630846.0,
      "replies": [
        {
          "id": "mr50mxd",
          "author": "OldBanjoFrog",
          "body": "Don’t insult turds like that ",
          "score": 3,
          "created_utc": 1746653501.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqk5mqn",
      "author": "toshgiles",
      "body": "Did anyone on the comment actually read the article?",
      "score": 4,
      "created_utc": 1746376455.0,
      "replies": [
        {
          "id": "mr4669a",
          "author": "cubert73",
          "body": "Yes. And? Nothing in the article makes this sound like a good idea to me.",
          "score": 7,
          "created_utc": 1746644707.0,
          "replies": []
        },
        {
          "id": "mqk6dcq",
          "author": "crecentfresh",
          "body": "Look where you are and the answer will reveal itself to you",
          "score": 4,
          "created_utc": 1746376684.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqjf7gi",
      "author": "kjbaran",
      "body": "Eye tracking ads on our TV’s you say?",
      "score": 5,
      "created_utc": 1746368150.0,
      "replies": [
        {
          "id": "mqjl12t",
          "author": "Inquisitive_Banana",
          "body": "Mcdonald's!",
          "score": 6,
          "created_utc": 1746370030.0,
          "replies": [
            {
              "id": "mr4vv9t",
              "author": "ThinkExtension2328",
              "body": "That’s so meta",
              "score": 1,
              "created_utc": 1746652077.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mqm4pyk",
      "author": "sucobe",
      "body": "> Specifically, that biometric scan is encrypted and sent directly to your phone to be converted into that unique identity token, after which the info is deleted on the Orb itself, **the project says**. As an incentive, the World app is credited with Worldcoins worth a little over $16 in real-world money. That token is then used later on when logging into things to prove you are a unique, genuinely real human.\n\nEmphasis mine. It’s not deleted. Don’t kid yourself. Look at 23 and me. I get the idea of what they are going for on paper, but execution is Minority Report in disguise.  \n\n> Despite all the scrutiny, the startup claims to have 26 million people using its app around the world, with 12 million people having added their biometric data.\n\nAbsolutely insane, I wonder why\n\n> During our store visit, an assistant said the amount of traffic for the Orbs had been very high, but we observed only a handful of people giving it a try in the 15 minutes in the shop. One man, a visitor to the RSA Conference happening just down the road, said he'd heard about it at the show and \"free money is free money.\" We hope he's right.\n\nAh there it is.",
      "score": 2,
      "created_utc": 1746398818.0,
      "replies": [
        {
          "id": "mr62fu8",
          "author": "Aidan_Welch",
          "body": ">Specifically, that biometric scan is encrypted and sent directly to your phone to be converted into that unique identity token,\n\nWhat a weird way to just say that it's hashed",
          "score": 0,
          "created_utc": 1746666310.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqtizcr",
      "author": "None",
      "body": "This is awful.",
      "score": 1,
      "created_utc": 1746498669.0,
      "replies": []
    },
    {
      "id": "mr4442s",
      "author": "LookAlderaanPlaces",
      "body": "https://www.reddit.com/r/aiArt/s/Jw2xaStewY",
      "score": 1,
      "created_utc": 1746644112.0,
      "replies": []
    },
    {
      "id": "mrccaje",
      "author": "Kiflaam",
      "body": ">World announced two high-profile partnerships with Visa and Match Group, the online dating giant.  \n\"Here’s how it works: You go up to an Orb, a spherical biometric device, and it spends about 30 seconds scanning your face and iris, then creates and stores a unique “IrisCode” for you verifying that you’re a human and that you’ve never signed up before. Then you get some of the project’s cryptocurrency, WLD, for free, and you can use your World ID as a sign-in with integrated platforms, which currently include an open API integration with Minecraft, Reddit, Telegram, Shopify and Discord.\"\n\nI couldn't imagine a less appealing sounding thing. I mean, yeah it's probably all voluntary but man it's basically just key words of things I don't want. Scans my eyes. Makes an ID of me. Is connected to Visa, a dating site, minecraft, fucking reddit UGH, discord, and a few adwares, then when it's done fucking me it pulls out to shoot a thick load of its crypto shitcoin on my face and then act like it did me a favor",
      "score": 1,
      "created_utc": 1746751528.0,
      "replies": []
    }
  ]
}