{
  "post": {
    "title": "The Bambu H2D isn’t just a bigger 3D printer — it’s a laser cutter, pen plotter, and Cricut competitor too | ﻿What if your 3D printer, Cricut, GlowForge, and iDraw were all the same machine?",
    "author": "chrisdh79",
    "id": "1jka3pc",
    "score": 746,
    "created_utc": 1742990556.0,
    "selftext": "",
    "num_comments": 144,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jka3pc/the_bambu_h2d_isnt_just_a_bigger_3d_printer_its_a/"
  },
  "comments": [
    {
      "id": "mjtq821",
      "author": "CruisinJo214",
      "body": "All in one machines sound amazing… but usually they do all the tasks decently enough, but not as well as a dedicated machine…. Has Bambu managed to overcome that? No idea, it’s probably out of my price range",
      "score": 223,
      "created_utc": 1742993697.0,
      "replies": [
        {
          "id": "mjus1s5",
          "author": "BizzyM",
          "body": "FTFA:\n\n>Bambu actually sent me a whole new printer after the first one failed tests that cheaper 3D printers easily passed; my second printer is doing far better, but I’m still getting better quality out of my old P1P. Plus, the H2D’s dual-nozzle feature isn’t working reliably for me. I did finish Bambu’s bicycle helmet after a nearly three-day print, but I won’t be able to wear it, given all the unsightly bits of carbon-fiber laced PETG sticking out and the conspicuous gaps in its TPU padding.",
          "score": 76,
          "created_utc": 1743005600.0,
          "replies": []
        },
        {
          "id": "mjufycp",
          "author": "SHADOWSTRIKE1",
          "body": "Yeah that’s exactly my thought.  This probably does each thing “ok”, and at a price point where you could get one machine that does a certain one of those things much better.\n\nWhile I understand there is some shared technology regarding axial positioning of printing and laser heads… these tasks sound like they’d be best served by specialty devices.  \n\nA Dremel doesn’t cover the workload of a drill press, despite both being based on a circular rotating motor.",
          "score": 39,
          "created_utc": 1743002009.0,
          "replies": []
        },
        {
          "id": "mjv8xr6",
          "author": "techieman33",
          "body": "The consensus seems to be that the cutter and pen could be nice additions for occasional use. But the laser should be avoided unless space is the absolute priority. Lasers are messy and they stink. It will quickly make the inside of the printer filthy which will have to be cleaned to keep the 3D printing part of it working like it should. And it looks like it’s a fairly extensive process. Most people will be much better off buying a separate laser unit from a place like Xtool for similar money as Bambu’s add on.",
          "score": 24,
          "created_utc": 1743010429.0,
          "replies": []
        },
        {
          "id": "mjuzs3o",
          "author": "Jeff_72",
          "body": "I just told my boss, I would wait for non-shill reviews before purchasing one.",
          "score": 7,
          "created_utc": 1743007846.0,
          "replies": []
        },
        {
          "id": "mjuqa38",
          "author": "VitaminPb",
          "body": "I skimmed most of the review. The laser cutting is an additional attachment you have to add AND CALIBRATE when you want to use it. It isn’t an all-in-on. It’s a reconfiguration of the machine, not an integrated part.",
          "score": 10,
          "created_utc": 1743005077.0,
          "replies": []
        },
        {
          "id": "mjwm8l3",
          "author": "Shoelebubba",
          "body": "The laser part makes no sense to me.   \nTypically you don’t want the inside of an enclosed 3D printer to get dusty from anything and some filament types will accumulate dust over time.   \n    \nBut laser cutters are basically dust makers alongside making everything smell like a laser cut them.    \n    \nEven in their wiki, there’s a picture of a used H2D that’s already laced with dust from the laser cutting process.    \n    \nThe cutter and marker seem neat, like you could find a use case for it since it only takes an extra attachment and an extra plate.",
          "score": 4,
          "created_utc": 1743024441.0,
          "replies": []
        },
        {
          "id": "mjuo6hz",
          "author": "None",
          "body": "[deleted]",
          "score": 11,
          "created_utc": 1743004466.0,
          "replies": [
            {
              "id": "mjv3385",
              "author": "Sangui",
              "body": "Yeah but if it doesn't do any of them well enough for your purposes, it's just a waste of space and money.",
              "score": 14,
              "created_utc": 1743008781.0,
              "replies": [
                {
                  "id": "mjwqer6",
                  "author": "ElectronicMoo",
                  "body": "Nobody's saying it doesn't do it well, though.  For this one guys helmet problem, I've seen a handful of \"omg it's great, just works\" videos on YT too, one from a guy who compared it to the xl across the board.\n\nI'm not gonna be one of the fomo firsters, but I'm pretty sure if everytjing still tracks as promised, I'll go the 40w unit within a year - fits my bill quite nicely. As long as it doesn't turn out to be a giant lemon.\n\nThe engraving alone - is an archaic prehistoric process for anything except the absurdly expensive tool (focus, framing, aligning) - and that convenience alone at a comparable price than xtool - count me in.\n\nIt's all gcode.  It's not like taking a bread maker and combining it with a drill press.  They're all mechanically similar enough where one xyz machine can do it all very well - and Bambi has a good track record in _that_ regard.\n\nWait and see I guess. That's what I'll do.",
                  "score": 3,
                  "created_utc": 1743025727.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mjw5jgy",
          "author": "Presently_Absent",
          "body": "\"Alright, my 18hour print is running! Guess I can't use my machine for anything else right now...\"",
          "score": 3,
          "created_utc": 1743019892.0,
          "replies": []
        },
        {
          "id": "mjwkrji",
          "author": "opeth10657",
          "body": "It's a 3D printer first, the other stuff is just an attachment.\n\nIt'll probably printer better than nearly any other printer on the market, but won't be a better laser cutter than a dedicated machine.",
          "score": 1,
          "created_utc": 1743024001.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjtrkki",
      "author": "None",
      "body": "So I need to tear down my k40 several times a year to clean the bullshit off the rails and rollers, and wipe the mirrors weekly, and replace the lens every few months, but I'll still be able to print fine with this after a laser operation? Press X to doubt.",
      "score": 81,
      "created_utc": 1742994187.0,
      "replies": [
        {
          "id": "mjw8peo",
          "author": "bentika",
          "body": "Yeah I also have a k40 and ender 3, no way I would want to be kicking up smoke inside a 3d printer enclosure lol",
          "score": 9,
          "created_utc": 1743020734.0,
          "replies": [
            {
              "id": "mjwidtt",
              "author": "tastyratz",
              "body": "Hope the electronics have absolutely NO air from the enclosure leaking in because I'm imagining smoke and soot all over the PCB's over time...",
              "score": 6,
              "created_utc": 1743023366.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mjtmrk4",
      "author": "bryansj",
      "body": "Is the Bambu boycott over now?  That was fast.",
      "score": 90,
      "created_utc": 1742992396.0,
      "replies": [
        {
          "id": "mju8vl7",
          "author": "oni-no-kage",
          "body": "Why was there a boycott?",
          "score": 21,
          "created_utc": 1742999888.0,
          "replies": [
            {
              "id": "mjui5i0",
              "author": "C6500",
              "body": "Their current printers (and all(?) other consumer 3D printers) allow you a free choice of software and protocols such as better Slicers. The whole 3d printing ecosystem is very open source focused and driven.  \n\nBambu decided to lock down access to their printers with a firmware update and force the use of a shitty middleware to send gcode etc. to the printer. That's the very short version.  \n\nTheir hardware is good, but noone in their right mind should ever buy one again.",
              "score": 60,
              "created_utc": 1743002676.0,
              "replies": [
                {
                  "id": "mjuk3td",
                  "author": "oni-no-kage",
                  "body": "Thank you. I'm currently researching to buy my son one and these where coming up as good models.",
                  "score": 18,
                  "created_utc": 1743003266.0,
                  "replies": [
                    {
                      "id": "mjuow6f",
                      "author": "ghrayfahx",
                      "body": "Creality makes good printers. They have put out a couple of new ones lately that are quite nice. And they run on open source firmware. Bambu has proprietary firmware and you can’t upgrade anything other than the parts that they provide.",
                      "score": 2,
                      "created_utc": 1743004673.0,
                      "replies": [
                        {
                          "id": "mjvlnf2",
                          "author": "thatguy2137",
                          "body": "Creatily is using Klipper, but afaik their build isn’t open source. It’s definitely a step up from where Bambulab sits, but it’s not exactly open source.",
                          "score": 3,
                          "created_utc": 1743014071.0,
                          "replies": [
                            {
                              "id": "mjvujcf",
                              "author": "ghrayfahx",
                              "body": "True. But you can GENERALLY upgrade them to full Klipper. Bambu is very much the Apple of 3D printing, but in this case not in a good way.",
                              "score": 5,
                              "created_utc": 1743016676.0,
                              "replies": [
                                {
                                  "id": "mjymg47",
                                  "author": "alidan",
                                  "body": "effectively the exact same as apple, both for good reasons and bad.",
                                  "score": 1,
                                  "created_utc": 1743049946.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mjyoooo",
                              "author": "a_cute_epic_axis",
                              "body": "Just use actual Klipper then if you want.",
                              "score": 1,
                              "created_utc": 1743051070.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mjv3h61",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -5,
                      "created_utc": 1743008889.0,
                      "replies": [
                        {
                          "id": "mjvopx5",
                          "author": "Cadet_BNSF",
                          "body": "There are definitely companies that have similar levels of it just works. Prusa, Anycubic, Elegoo, and Creality are all producing fantastic machines at similar price points.",
                          "score": -2,
                          "created_utc": 1743014970.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mjvoqy1",
                      "author": "mumpped",
                      "body": "Honestly, buy him a cheap Bambu printer. It just works, and quality is great. Easy to use. I don't care if the software is open source or not, if it one day stops working because of that it's not a big issue because it only costs 200 bucks anyway",
                      "score": -5,
                      "created_utc": 1743014978.0,
                      "replies": [
                        {
                          "id": "mjvwldg",
                          "author": "PotusThePlant",
                          "body": "Pretty bad take. Buy a Prusa instead. Don't support crappy business practices.",
                          "score": 5,
                          "created_utc": 1743017290.0,
                          "replies": [
                            {
                              "id": "mjwagpu",
                              "author": "None",
                              "body": "That’s a terrible take when it’s for a child. The kid ain’t going to have the know how to figure out the settings to get a decent print like a Bambu will do out of the box. He isn’t going to need the gcode and he doesn’t care what apps he has to use to print with the printer. \n\nNot everyone needs a prusa",
                              "score": 0,
                              "created_utc": 1743021232.0,
                              "replies": [
                                {
                                  "id": "mjwi387",
                                  "author": "tastyratz",
                                  "body": "You are gonna get GREAT prints out of the box from a Creality K1/K2 or a Qidi plus4/max3 at a fraction of the cost and will have multi material printing out of both this year.\n\nAn A1 mini is a great intro to 3d printing with a small printer, I'd agree with that. Bambu isn't the only reliable printer anymore, however.",
                                  "score": 1,
                                  "created_utc": 1743023286.0,
                                  "replies": [
                                    {
                                      "id": "mjwstx3",
                                      "author": "None",
                                      "body": "That’s literally my point. He can just buy him an A1 mini for a fraction of the price of any of the printers you mentioned. And the A1 outlines anything in a comparable price point out of the box? \n\nNot to mention I said prusa is not great for kids compared to an A1.",
                                      "score": 0,
                                      "created_utc": 1743026470.0,
                                      "replies": [
                                        {
                                          "id": "mjy4o8b",
                                          "author": "tastyratz",
                                          "body": "A1 is a great starter printer but Bambu's current practices mean it may not remain a great printer. What you get with an A1 is disposable pricing - if it no longer works for you or you decide the hobby isn't for you at least you weren't that invested.\n\nIt really depends on the kid on what makes sense for them but it's natural for people to be hesitant about buying a bambu still.",
                                          "score": 2,
                                          "created_utc": 1743042502.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mk3anbi",
                                  "author": "PotusThePlant",
                                  "body": "If the kid can work with 3d models then they know how to use a screwdriver. With a Prusa they'd actually learn stuff. They'd be getting an actual tool instead of a locked down toy.",
                                  "score": 0,
                                  "created_utc": 1743116517.0,
                                  "replies": [
                                    {
                                      "id": "mk3ocv2",
                                      "author": "None",
                                      "body": "Any child younger than 13 who isn’t an avid lover of tech and ain’t just looking to print nick nacks would not be able to handle any of what you just said. \n\nBe realistic bro, I get that you love being a. Techie and you think everyone wants to be like you but they don’t. Most people just want a printer to work and in that regard prusas are absolute dog shit.",
                                      "score": 3,
                                      "created_utc": 1743120870.0,
                                      "replies": [
                                        {
                                          "id": "mk63b21",
                                          "author": "PotusThePlant",
                                          "body": "A child younger than 13 should probably not even get a 3d printer for themselves so yeah, I am being realistic \"bro\".\n\n>Most people just want a printer to work and in that regard prusas are absolute dog shit.\n\nDo you have any kind of example or source to claim that current gen prusas don't \"just work\"?",
                                          "score": 1,
                                          "created_utc": 1743162523.0,
                                          "replies": [
                                            {
                                              "id": "mk65tt1",
                                              "author": "None",
                                              "body": "It’s isn’t for themselves it’s the dad buying it for their kid! You are so dead set on now admitting that bunny labs is just better for the average user you refuse to accept it Jesus you’re dense.\n\nAnd yes! If you go to the Bambu labs subreddit you’ll find that a lot of people went from prusa to Bambu and they all say the same thing. IT JUST WORKS. Prusa is dogggg shit",
                                              "score": 0,
                                              "created_utc": 1743163597.0,
                                              "replies": [
                                                {
                                                  "id": "mk673vf",
                                                  "author": "PotusThePlant",
                                                  "body": "Ok so no source or reading comprehension then? Gotcha. Have a good one.",
                                                  "score": 1,
                                                  "created_utc": 1743164129.0,
                                                  "replies": [
                                                    {
                                                      "id": "mk6787r",
                                                      "author": "None",
                                                      "body": "[removed]",
                                                      "score": 1,
                                                      "created_utc": 1743164178.0,
                                                      "replies": [
                                                        {
                                                          "id": "mk67lu7",
                                                          "author": "PotusThePlant",
                                                          "body": "Hipocrisy is funny.\n\nAlso, *you're.",
                                                          "score": 1,
                                                          "created_utc": 1743164332.0,
                                                          "replies": [
                                                            {
                                                              "id": "mk687cm",
                                                              "author": "None",
                                                              "body": "No you’re just being dense for no reason.you couldn’t win the argument so you devolved into insulting me and it’s frustrating because this ain’t about what the person needs which is a printer that works, it’s about your own potential beside that if you can’t learn how to perfectly tune a half built printer then you don’t deserve to have one, even kids. \n\nIt’s literally ridiculous and then you have to go so low as to say because I’d don’t provide a source I’m wrong. Like dude just accept that people prefer Bambu labs because it works out of the box over sitting there with a prusa for months figuring out how to make everything perfect and get off your high tower. It’s ok to admit you’re wrong, wtf is so hard about that? \n\nI’m not being hypocritical, I know when someone is being an ashore for the sake of being an asshole and your have a good day is shaded so go ahead and have a terrible one. I don’t need to veil my displeasure in a half hearted attempt to look like a bigger person because I don’t care but I will make my point clear cause I ain’t a pussy.",
                                                              "score": 1,
                                                              "created_utc": 1743164571.0,
                                                              "replies": [
                                                                {
                                                                  "id": "mk6j4cz",
                                                                  "author": "PotusThePlant",
                                                                  "body": "Not reading all that. Thanks for the effort though, I guess.",
                                                                  "score": 1,
                                                                  "created_utc": 1743168566.0,
                                                                  "replies": []
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mjyma99",
                  "author": "alidan",
                  "body": "there any other good printers that can easily swap hardened .4mm and normal .2mm nozzles? \n\nim looking to replace an old printer with something that's far FAR less of a pain in the ass to print on, and bamboo lab a1 seemed to be what I was going for, hell still may",
                  "score": 1,
                  "created_utc": 1743049866.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mjtyrmy",
          "author": "nagi603",
          "body": "Sell-outs gonna sell out, other news at 11.",
          "score": 16,
          "created_utc": 1742996705.0,
          "replies": []
        },
        {
          "id": "mju8efb",
          "author": "HengaHox",
          "body": "They changed their policy back no? Why continue boycott if it did its job",
          "score": 5,
          "created_utc": 1742999742.0,
          "replies": [
            {
              "id": "mjucstt",
              "author": "tastyratz",
              "body": "https://bambulab.com/en-us/h2d\n> Due to safety protocol, Developer mode cannot be enabled when using Laser and Cutting functions.\n\nDid they? Because they are finding excuses to lock down all new functionality for safety that is not closed and locked on the alternative lasers and cutters on the market",
              "score": 26,
              "created_utc": 1743001062.0,
              "replies": [
                {
                  "id": "mjzbzvq",
                  "author": "Bendingunit123",
                  "body": "It makes sense why they wouldn’t want to do that. They don’t want someone to develop a software to operate the laser remotely and get sued when someone burns down their house.",
                  "score": 1,
                  "created_utc": 1743065597.0,
                  "replies": [
                    {
                      "id": "mk02bna",
                      "author": "tastyratz",
                      "body": "Everything you do with this device can burn down your house. We quickly forget how many 3d printers have had thermal runaway fires because modern ones have some newer safeguards to prevent damage to your home and the equipment. \n\nThe competing small laser engraver devices they are trying to roll into their device do not have those same limitations. Lightburn and LaserGRBL are the standards.",
                      "score": 2,
                      "created_utc": 1743079054.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mjufkwg",
                  "author": "tribalien93",
                  "body": "Well that relates to this piece of equipment but not all of them correct??\n\nEdit:\nI assumed judging by u/HengaHox's comment the must have reversed course.",
                  "score": -2,
                  "created_utc": 1743001897.0,
                  "replies": [
                    {
                      "id": "mjukrmd",
                      "author": "tastyratz",
                      "body": "How so?\n\nThey said if you don't want the changes, don't update your firmware on existing printers. They are also saying if you want to use the new ams2pro with your existing printer you have to update your firmware.\n\nIf you want to use any new upgrades or hardware you have to get into the new firmware that includes the new bambu suite locking you down.\n\nI also wonder what firmware ships with new equipment sales at this point as well. Chances are it's coming with the changes.\n\nFor existing printers with the existing capacity the answer was \"we won't make you install the update if you don't want it\" effectively freezing you where you're at.\n\nThat means if you don't want to be further locked in you effectively lose all new feature updates.",
                      "score": 10,
                      "created_utc": 1743003467.0,
                      "replies": [
                        {
                          "id": "mk6mq32",
                          "author": "tribalien93",
                          "body": "I didn't know they didn't reverse course and was basing my comment on u/HengaHox's comment.",
                          "score": 1,
                          "created_utc": 1743169785.0,
                          "replies": [
                            {
                              "id": "mk6sisi",
                              "author": "HengaHox",
                              "body": "Did see a post about it",
                              "score": 1,
                              "created_utc": 1743171611.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mkfoggc",
                          "author": "drpeppershaker",
                          "body": "Developer mode exists",
                          "score": 0,
                          "created_utc": 1743290790.0,
                          "replies": [
                            {
                              "id": "mkj5vp9",
                              "author": "tastyratz",
                              "body": "Developer mode exists for printing, for now, and is disabled for new cutting and laser operations.",
                              "score": 0,
                              "created_utc": 1743348930.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mjudv9m",
              "author": "bryansj",
              "body": "I've been boycotting so well that I stopped following their news.  I'm still boycotting Sony for their audio CD DRM and then again for removing Linux from the PS3...",
              "score": 7,
              "created_utc": 1743001381.0,
              "replies": [
                {
                  "id": "mjuq9x3",
                  "author": "HengaHox",
                  "body": "I saw it on the side somewhere. I don’t have one either",
                  "score": 1,
                  "created_utc": 1743005076.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mjw7n89",
              "author": "IMissNarwhalBacon",
              "body": "For one, companies just try again and again.  Once a company tries to go closed source, they will keep trying until they succeed.  Bambu should be brought to a point of bankruptcy regardless of their policy changes.  They should be regarded as an example ofa bad company that was destroyed. \n\nBut people like you say, \"they learned their lesson\" and allow them to regroup and fuck over another batch of consumers.",
              "score": 1,
              "created_utc": 1743020470.0,
              "replies": [
                {
                  "id": "mk00fyo",
                  "author": "HengaHox",
                  "body": "I mean if they fixed the product, I don’t see a reason to avoid it. The fixed firmware is out there so it can’t be re-broken. \n\nOf course don’t be a blind consumer but if the product is exactly what you need, at the right price, I don’t see what the point is of depriving yourself of exactly what you need. \n\nIf it’s literally the right thing for you then get it.",
                  "score": 1,
                  "created_utc": 1743078309.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mjv8tf0",
          "author": "ribbit43",
          "body": "Nope, never buying one.",
          "score": 4,
          "created_utc": 1743010395.0,
          "replies": []
        },
        {
          "id": "mjwkz9v",
          "author": "opeth10657",
          "body": "There wasn't never really a boycott.  A few people complained on the internet, then turned around and bought an A1.",
          "score": -1,
          "created_utc": 1743024059.0,
          "replies": []
        },
        {
          "id": "mjtpohh",
          "author": "None",
          "body": "[deleted]",
          "score": -44,
          "created_utc": 1742993501.0,
          "replies": [
            {
              "id": "mjtqar9",
              "author": "Ruben_NL",
              "body": "Why do you prefer a closed ecosystem?\n\nBamboo making something great can be combined with not being so closed. Proof: they also made great stuff a month ago.",
              "score": 29,
              "created_utc": 1742993724.0,
              "replies": [
                {
                  "id": "mjtqwbt",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -21,
                  "created_utc": 1742993940.0,
                  "replies": [
                    {
                      "id": "mjttv0m",
                      "author": "Warrangota",
                      "body": "It doesn't have to be 100 or 0. It would be enough if the company just was not a dick to people who truly love their hobby. There's no need to support anything. Just don't actively block those who try to find other ways.",
                      "score": 9,
                      "created_utc": 1742995008.0,
                      "replies": []
                    },
                    {
                      "id": "mjtxunx",
                      "author": "Ruben_NL",
                      "body": "But it wasn't as much a closed ecosystem, until about month ago(iirc). Your printer is probably more than a month old. It's a printer you \"never have had any issues\" with.\n\nSo less closed doesn't mean bad.",
                      "score": 3,
                      "created_utc": 1742996396.0,
                      "replies": []
                    },
                    {
                      "id": "mjtufv2",
                      "author": "Hot_Marionberry_4685",
                      "body": "I can understand the sentiment when it’s geared towards more interactive tech like app dev on smartphones but I don’t think there’s really much dev work that would give Bambu the edge here with this move while at the same time giving them the controls to enforce even stricter usage of their proprietary tech solely by end users of the product. For example what if a better slicer comes around but Bambu labs adds code to their printers forcing sliced files to have to come from their own software or if they block use of certain PLA by having printers check rfid tags in spools. This may be the beginning so we haven’t seen anything dramatic yet but this type of stuff happens a lot when companies try operating in their own closed systems",
                      "score": 0,
                      "created_utc": 1742995211.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mjtsuyf",
              "author": "tastyratz",
              "body": "False Dichotomy. They can both make a great printer AND support the open ecosystem. What they lock out and control does not at all negatively influence their ability to offer anything and everything they have been trying to lock out IS the better alternative.\n\nThat's like saying you prefer cars without heat because you only drive in the tropics. You are free to use it as you see fit.\n\n\nJust look at Prusa with the Core ONE printer in comparison. It's a great printer and it's open.\n\nIn fact, Prusaslicer is what Bambuslicer is an active fork of. Not only is it better to support an open ecosystem, Bambuslicer wouldn't exist without one.",
              "score": 12,
              "created_utc": 1742994652.0,
              "replies": []
            },
            {
              "id": "mjts06n",
              "author": "bryansj",
              "body": "We'll have to disagree with the closed preference.  Not saying Bambu is trash or anything, but I'd prefer it to be open.  Especially true later in its lifecycle when features may be purposely held back to push you to buying new instead of upgrading existing.  I am a bit biased after modding my first Ender 3 and then building two Vorons.",
              "score": 4,
              "created_utc": 1742994344.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mjuc1dq",
      "author": "Demigeek",
      "body": "Just about anything that \"does it all\", does it all poorly. If I have a need for them, I will save up for a printer, laser cutter, plotter, and Cricut instead. I'd rather have separate tools that do their one task exceptionally well.",
      "score": 14,
      "created_utc": 1743000838.0,
      "replies": [
        {
          "id": "mjymvuk",
          "author": "alidan",
          "body": "in all honesty, a 3d printer is every one of those tools but with a z access as well, there is no reason it shouldn't be able to do all these tasks just fine, the laser cutter though will cause a mess inside so that is a questionable one, and with the cost of a laser cutter almost entirely being in the laser itself, its probably better just to get one of those separately.",
          "score": 3,
          "created_utc": 1743050165.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjtnf38",
      "author": "None",
      "body": "10 hours of cutting wood is going to have that thing completely gunked up. The cleaning routine for when you are done cutting wood is 140 photos long on the Bambu wiki.",
      "score": 33,
      "created_utc": 1742992653.0,
      "replies": [
        {
          "id": "mjuppty",
          "author": "xondk",
          "body": "How do dedicated machines deal with that? Can they go longer? or is it similar?",
          "score": 2,
          "created_utc": 1743004912.0,
          "replies": [
            {
              "id": "mjuqy4o",
              "author": "None",
              "body": "Dedicated machines do not have to worry about the same level of smoothness required by a 3d printer, especially in the Z direction. Also, the lens used to measure and verify flow are going to have to be thoroughly cleaned constantly. Most 2 axis laser cutters normally need none of that. That's why all in ones typically are not a thing.",
              "score": 9,
              "created_utc": 1743005274.0,
              "replies": [
                {
                  "id": "mjwsae7",
                  "author": "Knut79",
                  "body": "Lol. People still think the lidar on Bambu machines actually do anything but look good on pr materials?\n\nIt's literally impossible for it to do what they claim, it technically can't do it, it's resolution is to low and it's focus distance is far longer.",
                  "score": 2,
                  "created_utc": 1743026301.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mjtx6m3",
          "author": "parisidiot",
          "body": "could you share this? i'm curious. couldn't find any maintenance guides on their support site",
          "score": 1,
          "created_utc": 1742996168.0,
          "replies": [
            {
              "id": "mju5htq",
              "author": "t_kivinen",
              "body": "https://wiki.bambulab.com/en/h2/maintenance/period-maintenance",
              "score": 5,
              "created_utc": 1742998838.0,
              "replies": [
                {
                  "id": "mjw3o2v",
                  "author": "parisidiot",
                  "body": "lol that's insane",
                  "score": 2,
                  "created_utc": 1743019351.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mjvaa1g",
      "author": "HighInChurch",
      "body": "$1899 for a 10w and 40w laser? \n\nAnd it prints slower than the P1S? \n\nPass.",
      "score": 9,
      "created_utc": 1743010811.0,
      "replies": []
    },
    {
      "id": "mjumzoc",
      "author": "ruacanobeef",
      "body": "This is just an ad",
      "score": 16,
      "created_utc": 1743004122.0,
      "replies": [
        {
          "id": "mjxjh6w",
          "author": "AkirIkasu",
          "body": "Your first hint was that it was on The Verge. Calling them journalists is like saying Facebook is a news site.",
          "score": 3,
          "created_utc": 1743035077.0,
          "replies": []
        },
        {
          "id": "mjxrkuz",
          "author": "AnnihilatorOfPeanuts",
          "body": "Welcome to gadget, a good part of it is just that.",
          "score": 3,
          "created_utc": 1743037857.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjtjjt5",
      "author": "Superseaslug",
      "body": "It's a cool machine, and I'm definitely buying one, but there's usually a reason laser cutters aren't included with other devices. The smoke is gonna gunk those things up, but I'm still getting a laser head as I only plan on doing very occasional laser work. If my plans change, I'll go buy an xtool.",
      "score": 44,
      "created_utc": 1742991099.0,
      "replies": [
        {
          "id": "mjtye9p",
          "author": "deadgirlrevvy",
          "body": "Just buy a cheap ass laser engraver.   Way less expensive and it does the same thing.",
          "score": 25,
          "created_utc": 1742996579.0,
          "replies": [
            {
              "id": "mju0rr4",
              "author": "Fuzzclone",
              "body": "And likely will have a much larger working area! And and, won’t be clogging your printer head with soot over time! This all on one only makes sense if you have very limited space.",
              "score": 13,
              "created_utc": 1742997348.0,
              "replies": [
                {
                  "id": "mk8mu6e",
                  "author": "deadgirlrevvy",
                  "body": "Excellent point.  The inside of my CNC enclosure is caked with soot and residue when I use my laser on it.  I hate that I have to swap out my spindle to use the laser and vice versa.  I am going to just make another motion platform and slap the laser head on it so that they are not a two in one device.  I cannot imagine dealing with the nastiness a laser leaves behind in a 3D printer enclosure.  That's the stuff of nightmares, frankly.  No. Way. In. Hell.",
                  "score": 1,
                  "created_utc": 1743191100.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mjwf4fy",
              "author": "Hendlton",
              "body": "Since this is a good place as any to ask, what's actually wrong with super cheap laser engravers? I was looking at buying one and they seem to range from like $200 to $900 and they all appear to have the exact same capabilities other than like WiFi control and stuff like that which I really don't care about. I'm assuming there's a catch, so what is it?\n\nP.S. I really don't need to cut anything, I'm just interested in engraving. No need for engraving metal either, since that seems to be something cheap engravers aren't capable of.",
              "score": 3,
              "created_utc": 1743022502.0,
              "replies": [
                {
                  "id": "mka5rto",
                  "author": "fleemfleemfleemfleem",
                  "body": "The diode lasers tend to be closer to 400nm, and the Co2 lasers tend to be closer to 680. Acyrlic for example will cut well with a CO2 laser, but 400nm will pretty much pass through. \n\nYou also have more high power options is CO2 lasers. K40 lasers are 40watts, but you don't really get cheap engravers much more than 10 or 20. For occasional engraving that's probably fine (just do more passes), but it makes a big difference for cutting.",
                  "score": 1,
                  "created_utc": 1743208805.0,
                  "replies": [
                    {
                      "id": "mkcx6jt",
                      "author": "Hendlton",
                      "body": "Like I said, I don't plan on cutting anything anyway. From what I've seen on YouTube, weaker lasers tend to be better because they have a smaller dot, which allows for more detailed engravings. Do CO2 and fiber lasers have even smaller dots or do they just have the ability to cut more materials at greater speeds?\n\nThis isn't something I'm looking to do commercially, so I'm not going to drop like $5000 on a laser. I have a 3D printer and this is sort of the next step in my CNC adventures. Unfortunately there doesn't seem to be that much info on YouTube, at least nowhere near as much as for 3D printing. Most videos are just \"Here's an engraving on some wood. It did it. Here it is cutting some foam.\" It's very hard to find detailed technical specs and comparisons, and like I said in my comment above, it's really hard to tell what the difference is between cheap and expensive (diode) lasers. They all seem to do the exact same thing whether they're xTool or some random Chinese brand. I guess one big advantage is that when you buy from a reputable company, you can trust that they're not lying about their specs and that a 10W laser *is* actually 10W.",
                      "score": 2,
                      "created_utc": 1743257881.0,
                      "replies": [
                        {
                          "id": "mkeacn7",
                          "author": "fleemfleemfleemfleem",
                          "body": "A lot of it is quality of life/ease of use stuff. \n\nThe expensive ones will have stuff like a camera for positioning, and endstops, honeycomb, air assist etc. \n\nI have the elegoo phecda, and I've upgraded a bit by  adding those features, but it's just another thing to do. \n\nGetting the placement correct on pieces can be really difficult without endstops/camera, for example. The nicest ones have enclosures and fume extraction.\n\nIf you're getting a cheaper machine, expect to pay another $100 for lightburn as well. \n\nIts like-- you can 3d print the same object with an ender3 or a P1S, but the P1S adds enough reliability and quality of life features to be worth the premium you'll pay for it. \n\nSay you wanted to engrave 200 dog tags. On a cheap machine you might have to place them one by one, sometimes get the positioning off, figure out a ventillation situation, get your own honeycomb, and lightburn. The glasses that came with it are cheap so you have top worry about your eyes the whole time.  \n\nThe expensive machine is enclosed, and has fume extraction and a camera that let's you take a picture of the tags, and engrave them wherever they happen to be on the bed and do the whole things in one go. Must faster and easier. Time saved is money.",
                          "score": 1,
                          "created_utc": 1743273888.0,
                          "replies": [
                            {
                              "id": "mkehcs3",
                              "author": "Hendlton",
                              "body": "First, thank you for taking the time to respond. I'm definitely getting lightburn. It seems to be the best software on the market. From what I've seen, ventilation is very important even though I'm definitely not going to be doing this kind of stuff in an enclosed space. Some YT videos say that you can still smell the burnt stuff even with a filtration system. Safety glasses are another important thing. I wouldn't trust a cheap pair of gloves, let alone something that's supposed to stop me from going blind. I was planning on buying a tried and tested pair no matter what comes with the machine. The camera positioning system seems like a big deal, but I don't know if I'm going to engrave 200 things total, let alone 200 of the same thing. Air assist seems essential, so I'm definitely looking at buying a machine that has it so I don't have to improvise something.\n\nI have an Ender 5 so I totally get your analogy. It can be fiddly a lot of the time and it's relatively slow, but I've never come across something I really wanted to print but couldn't. I'm happy with it and if I had to buy my first 3D printer again, I don't think I would go for a more expensive one. The balance of cost vs. practicality vs. ability is just right. I'm looking for that kind of balance in a laser engraver.",
                              "score": 1,
                              "created_utc": 1743276169.0,
                              "replies": [
                                {
                                  "id": "mklr40a",
                                  "author": "fleemfleemfleemfleem",
                                  "body": "FWIW as a hobbyist I've quite liked the 20W phecda so far as my first laser. I used the glowforge at the local makespace a bit as well, and for messing around making boxes, signs and such the phecda works great. Probably no need for more than 10W if you aren't cutting. \n\nMost of the 5W/10W machines seem to have similar construction so I think you'll do pretty well with one of them.",
                                  "score": 2,
                                  "created_utc": 1743378659.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mju4fcv",
          "author": "dkillers303",
          "body": "I always recommend staying away from v1 products. It sucks when you’re the test subject and either live with the pain or upgrade to v2/v3 when the product is finally usable.",
          "score": 4,
          "created_utc": 1742998505.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjtwk52",
      "author": "das_pineapple",
      "body": "Snake with legs",
      "score": 6,
      "created_utc": 1742995950.0,
      "replies": [
        {
          "id": "mjvz1gd",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1743018021.0,
          "replies": [
            {
              "id": "mjwnqkd",
              "author": "PuffPuffFayeFaye",
              "body": "Lizard with hair",
              "score": 1,
              "created_utc": 1743024903.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mjtn2di",
      "author": "jjw14-1420",
      "body": "And it makes julienne fries…",
      "score": 11,
      "created_utc": 1742992516.0,
      "replies": [
        {
          "id": "mjtq7ie",
          "author": "lee160485",
          "body": "*julienne module sold separately, coming april ‘26",
          "score": 3,
          "created_utc": 1742993692.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjtxr0s",
      "author": "tastyratz",
      "body": "As a P1S owner, I'm going to effectively re-post here  with some more comments what I posted in the OpenBambu sub:\n\nHonestly, this thing really tells me how out of touch Bambu is and how much they are not listening to their user base, it feels like a cash scramble as they slowly lose their market positioning.\n\nThe x1c was great at the time but priced at nearly double the P1S it's really only there for legacy farm compatibility. It's no longer a value leader. They should put the board, touchscreen, and chamber sensor on the P1S with native 90w heater and sell it for $899 as a P1S turbo and retire the X1C. With the addition of the chamber heater in the H2D it's really displacing the X1E but those are pretty rare in the wild.\n\nThe H2D feels like they are SKU forcing a step up from the X1C to get that profit spread but it really does not bring enough to the table for the pricing. \n\nNow we have the Prusa one as the premium option and QIDI is really breathing down their door. You expect to pay more for a Bambu, sure, but everyone else is launching their own multimaterial options in the next year and they look pretty good. That means there is going to be a lot of competition.\n\nIt feels like an awkward SKU. The kind of people who are tinkerers who would swap in and out a laser head here are small scale etsy sellers and home users - the kind of people who are not paying nearly 2 grand for a machine like this BASE and $3500 with all the options.\n\nIf they wanted to be a market disruptor they needed to do this for $500 less than the base price, minimum, with the laser head. Bambu is stuck in their own past and it will be the boat anchor that sinks them from relevance.\n\nI can't imagine giving them $3500 for anything as a consumer or any space with the developer mode and firmware stunts this year.\n\nThey also locked this printer down for the new options, laser does not work outside of their closed system, you're locked in.\n\nWhile the machine is pretty cool it's WILDLY out of it's target audience pricing there. People are not spending $3500 for a hobbyist targeted cricut and... pen plotter. \n\nGranted it's a cool machine and has a lot of neat small features, but, why would I pay triple the price of a p1s for this for idex, more watts, and an optional laser head? \nIf I wanted a 10w laser, Creality has one for $338. I could get a P1S, AMS, and a laser for 1/3rd the price. It's convenient and slick as an AIO, but, is it slick enough for an upcharge of thousands over the rapidly evolving competition?",
      "score": 20,
      "created_utc": 1742996362.0,
      "replies": [
        {
          "id": "mju4k1q",
          "author": "Namenloser23",
          "body": "The laser part imo a gimmick, but I don't think this printer is misplaced. To me, this is clearly targeting the prosumer / professional niche of the Prusa XL, and is a vastly superior offering in my opinion.\n\n2 Extruders are enough for most multi-material options (think support filaments or mixing materials), while the MMU can cover multicolor applications. The Heated Chamber + filters also make it much more versatile, and you get all this for €700 (H2D non AMS vs XL 2 Extruder) - €1500 (H2D+AMS vs XL 4 Extruder) less.",
          "score": 9,
          "created_utc": 1742998546.0,
          "replies": [
            {
              "id": "mju9bdp",
              "author": "tastyratz",
              "body": "The 2 idex in the H2D have separate feeds and the new AMS2PRO they developed for this has a single outlet. That means if you want to use an AMS with both nozzles here, you need to have 2 AMS units per printer. They developed the new AMS to go with this and they missed that opportunity completely.\n\nA lot of people are going to be very disappointed that they have to swap around what filament should be on the external spool holder based on what they are printing at the time. It makes this much less convenient to point and click.\n\nIf you want a heated chamber, the QIDI plus4 can do that for you for less than the cost of a P1S and QIDI has their own MMU launching this year. Maybe a Creality K2 is more your speed.\n\nBambu has a lot of things that just work though which are great for professionals and print farm owners - except they threatened the print farm control business recently making them a risky business investment for people who want more than 1 machine and this machine supports their lockout agenda by not allowing you to use your own software integrations for the new functions, like laser cutting. \n\nIt's not just slicers, it's mass monitoring and control for fleet management. They really struck the confidence in the farm market and this printer shows they plan to continue in the same direction.\n\nso how many home users are going to spend THAT much money when they are far more willing to accept some compromises with alternative machines?\n\nWhen the X1C launched printing was absolutely a lot more cumbersome and they brought a lot of simplicity and \"just works\" to a market full of floundering Ender clones.\n\nThat is no longer the case today, however. All these alternatives are JUST as easy to use as a Bambu and work JUST as well in most cases. Bambu had a head start but they are pricing like they are bringing a lot more to the table than their competitors are which simply stopped being the case years ago.",
              "score": 5,
              "created_utc": 1743000021.0,
              "replies": [
                {
                  "id": "mjupieh",
                  "author": "Namenloser23",
                  "body": ">They developed the new AMS to go with this and they missed that opportunity completely.\n\nI don't think this is a big issue for their target audience. Mixing Materials is the main point of having two extruders, and you don't want to feed incompatible materials anyway. If you want to go for the \"zero interaction\" method, most people would probably be fine with having one extruder for their \"base material\" (PLA/ABS/PETG) and using the second one for their modifiers (support filament, high-shore flexibles etc.). If you're going for low shore flexibles, you can't use the AMS anyway.\n\n>so how many home users are going to spend THAT much money when they are far more willing to accept some compromises with alternative machines?\n\nBambu was the brand that got the market moving away from \"alternatives with compromises\"  (i.E. the army of Ender 3 clones trying to undercut each other at the <300USD price point).  \nThere are currently zero printers that don't have \\*some\\* downsides compared to it.\n\n  \nI share concerns about bambus path, and am not in the market for a printer at that price point for the foreseeable future, but I do see a ton of reasons why professionals and hobbyists that are not in the 3d printing space would choose it over its competitors.  \nI am also extremely hyped on the effect this printer could have on the market. Dual-Extruder systems have been in an extreme niche basically since their existence, and bambus entry into the space will almost certainly inspire other manufacturers to compete in that market.",
                  "score": 1,
                  "created_utc": 1743004850.0,
                  "replies": [
                    {
                      "id": "mjuwgvr",
                      "author": "tastyratz",
                      "body": ">I don't think this is a big issue for their target audience.\n\nIt really depends, if you want to just have support material and TPU and call it good, sure. You probably want a drybox to feed from in that case instead of the external spool otherwise you're constantly putting it in the ams2 to dry back out. It's also no good for engineering filaments.\n\nThink about what this means for actually using the idex though. Let's say you want to print a red and black nylon part. You could not have red and black nylon in the AMS for no purge idex print. You would have to remove the second color from the AMS and manually feed it. That means every single 2 or more color print (not just suppport/tpu) requires you go play filament musical chairs. How often are you going to do that when you are doing this professionally to prototype when you can just tell it to use the AMS and disregard the waste so you can print and walk away? I think the idex really loses it's appeal because it's a touch point on every print and people are VERY spoiled by their AMS.\n\n>Bambu was the brand that got the market moving away from \"alternatives with compromises\" (i.E. the army of Ender 3 clones trying to undercut each other at the <300USD price point).\nThere are currently zero printers that don't have *some* downsides compared to it.\n\nI think that's their pedigree but also their heel. They normalized a lot of things that then became baseline which reduced quite a bit  of challenges but that means they were pioneers who led, not are leading pioneers at the front of the quadrant. It's almost like making a new graphics card where there have been so many leap frogs over the years. Bambu raised the bar for everyone, including their competition. They don't have that advantage for this printer.\n\n> I am also extremely hyped on the effect this printer could have on the market. Dual-Extruder systems have been in an extreme niche basically since their existence, and bambus entry into the space will almost certainly inspire other manufacturers to compete in that market.\n\nI'll agree with that. I think Bambu really pioneered and normalized multimaterial with the AMS and inspired all the AMS clones hitting the market today. This machine COULD result in a resurgence in idex options hitting the market. the IDEX however could just be the natural evolution to multi material printing becoming almost standard in the market. It might also just be what would have been borne of it either way.\n\nA lot of exciting printers and printing products are launching this year. I think the H2D is going to age out to low volume rapidly.",
                      "score": 1,
                      "created_utc": 1743006887.0,
                      "replies": [
                        {
                          "id": "mjvc3ao",
                          "author": "Namenloser23",
                          "body": ">How often are you going to do that when you are doing this professionally to prototype when you can just tell it to use the AMS and disregard the waste so you can print and walk away?\n\nThat's pretty much what I expect people will do in that scenario. People probably won't care about filament waste in that environment. The cost is negligible, and the users aren't paying for it anyway. If you simply want multicolor, get a single extruder printer - it's realistically gonna cheaper anyway.\n\n\n\n>Bambu raised the bar for everyone, including their competition. They don't have that advantage for this printer.\n\nThis isn't the absolute leap frog that the X1C was at the time, but it still raises the bar - only that this time, its direct competitors are professional / prosumer printers like the S8 and XL, and it is positioned very competitively here. It was probably always going to be a much more niche product than their existing line-up.\n\n  \nI do agree with one of your earlier points that the X1C is starting to show its age, and suspect bambu might start transitioning its lineup to printers based on the H2Ds tech. If I were them, I'd start by making an \"X2C\" that has all the H2D features minus the Dual Extruder (chamber heating, automatic vents, filtration, nozzle cam, servomotors) and then cut that down into a p2 series.",
                          "score": 1,
                          "created_utc": 1743011317.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mjwlkmf",
                  "author": "opeth10657",
                  "body": "> the QIDI plus4 can do that for you \n\nI have an X1C and a Plus4, and ordered a H2D to replace the Plus4.  The Plus4 is a nice printer, it's just not on Bambu's level, and they still haven't released their AMS equivalent.",
                  "score": 1,
                  "created_utc": 1743024233.0,
                  "replies": [
                    {
                      "id": "mk6siho",
                      "author": "tastyratz",
                      "body": "> and they still haven't released their AMS equivalent.\n\nFYI, if this is to be believed, it's really not that far from H2d...\nhttps://all3dp.com/4/qidi-tech-to-release-an-ams-like-material-changer-early-next-year/",
                      "score": 1,
                      "created_utc": 1743171608.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mjwm74n",
              "author": "opeth10657",
              "body": "> but I don't think this printer is misplaced. \n\nIt sold out almost immediately, then the pre-orders for the next batch also sold out.  People can say whatever they want but it's clearly in demand.",
              "score": 1,
              "created_utc": 1743024429.0,
              "replies": [
                {
                  "id": "mka70eg",
                  "author": "fleemfleemfleemfleem",
                  "body": "I think there's a tendency for people to look at a product, say \"I don't want this,\" and assume the company messed up. There's a reason that Oracle and IBM are still around and huge companies despite not offering consumer oriented stuff.",
                  "score": 1,
                  "created_utc": 1743209238.0,
                  "replies": [
                    {
                      "id": "mkan3u1",
                      "author": "opeth10657",
                      "body": "the H2D is basically what everyone wanted, but people focus on the optional laser and complain.  So weird",
                      "score": 1,
                      "created_utc": 1743215055.0,
                      "replies": [
                        {
                          "id": "mkap5ry",
                          "author": "fleemfleemfleemfleem",
                          "body": "you could say they're \"laser focused\"",
                          "score": 1,
                          "created_utc": 1743215854.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mjtzqhu",
          "author": "nagi603",
          "body": ">  and retire the X1C.\n\nAdded \"advantage\" to retiring X1C is that there is currently zero open firmware alternative to P1 series. Well, advantage for BBL.",
          "score": 4,
          "created_utc": 1742997027.0,
          "replies": []
        },
        {
          "id": "mju1rj2",
          "author": "ProInsureAcademy",
          "body": "I could buy a Chinese 60w laser, cricut, and 3D printer for less than half of that price. I could then have all three going simultaneously. I cannot see the value proposition here",
          "score": 3,
          "created_utc": 1742997666.0,
          "replies": [
            {
              "id": "mju5ufh",
              "author": "tastyratz",
              "body": "Exactly. Bambu is trying to get a premium for their ecosystem as the apple of the printer world. It's worth some markup and they did make a premium product here but it's a $3,500 printer package targeting a $1,750 budget consumer audience. \n\nPeople spending $3,500 are far more serious about making money with it and this is a shopsmith hobby machine in a small business price bracket. If someone wants to spend THAT much money they are getting a dedicated Co2 or going straight to fiber laser.",
              "score": 3,
              "created_utc": 1742998946.0,
              "replies": []
            },
            {
              "id": "mka86s4",
              "author": "fleemfleemfleemfleem",
              "body": "My lab has a p1s, that's been super useful for prototyping. Some lab equipment can be 15,30,$50k. So something that costs $3000 is relatively cheap, especially for something that gets used pretty often, and pushes the work forward.  \n\nIf the P1S died and I needed to replace it, this would be on the list to consider, since it would add a couple of capabilities that I currently have to walk across campus to do. \n\nI definitely wouldn't buy one for my home, but for a general prototyping machine for work with limited space, I can see it being super useful.",
              "score": 1,
              "created_utc": 1743209654.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mjty5id",
      "author": "deadgirlrevvy",
      "body": "I don't want all my machines in one.  That's not good.  You can't print one thing, and engrave another at the same time for instance and if the multi-machine breaks down, all of your toys are broken at once.\n\nRight now I have a CNC machine that I swap out the spindle for a laser.  It's a royal pain in the ass and I hate it.  I either forego CNC work because I don't want to be bothered swapping the heads or I forego laser work for the same reason.  It's not something I enjoy or would wish on my worst enemy.   Nothing but a hassle.  I'm just gonna end up making a second motion platform for the laser instead so I don't have to swap shit around anymore.",
      "score": 6,
      "created_utc": 1742996497.0,
      "replies": []
    },
    {
      "id": "mjupy3x",
      "author": "Drone314",
      "body": "I can't wait till someone cuts some PVC with the laser and turns every metal surface into a rust sculpture.",
      "score": 3,
      "created_utc": 1743004980.0,
      "replies": []
    },
    {
      "id": "mjx8o9g",
      "author": "KrackSmellin",
      "body": "They already showed it’s being gunked up with crap when used as a laser engraver… with a residue and smell that gets in all your subsequent prints.  It’s a bad design…",
      "score": 3,
      "created_utc": 1743031509.0,
      "replies": []
    },
    {
      "id": "mjxtdhz",
      "author": "GoneSuddenly",
      "body": "sound like shitty nightmare",
      "score": 3,
      "created_utc": 1743038492.0,
      "replies": []
    },
    {
      "id": "mjuib9f",
      "author": "Sunstang",
      "body": "What if your article was really just a crummy commercial? #besuretodrinkyourovaltine",
      "score": 2,
      "created_utc": 1743002726.0,
      "replies": []
    },
    {
      "id": "mjvatjf",
      "author": "Zwangsjacke",
      "body": "Still can't print a girlfriend with it.",
      "score": 2,
      "created_utc": 1743010962.0,
      "replies": []
    },
    {
      "id": "mjz3ow2",
      "author": "Jaquemart",
      "body": "\"jack of all trades, master of none\"",
      "score": 2,
      "created_utc": 1743060042.0,
      "replies": [
        {
          "id": "movkfg6",
          "author": "Acadia-Suitable",
          "body": "The saying is Jack of all trades, master of none, but often times better than a master of one.",
          "score": 2,
          "created_utc": 1745536401.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjtylvy",
      "author": "Prima13",
      "body": "Like a singer/actress … can do both but not particularly good at either one. \n\nSingle purpose machines will always outperform.",
      "score": 4,
      "created_utc": 1742996650.0,
      "replies": []
    },
    {
      "id": "mju0m39",
      "author": "Fartblaster5000",
      "body": "I have already been disappointed greatly by the Snapmaker. Do one thing and do it well. All these new elements sound really cool in theory, but it's sort of a mess in practice.",
      "score": 1,
      "created_utc": 1742997297.0,
      "replies": []
    },
    {
      "id": "mjub10m",
      "author": "successful_syndrome",
      "body": "My wife left me for the Bambi H2D. It’s more of a man than I am in ever way.",
      "score": 1,
      "created_utc": 1743000537.0,
      "replies": []
    },
    {
      "id": "mjulpoh",
      "author": "TJPII-2",
      "body": "HP will buy it out, add it to their ink subscription program, and issue security FW to block all the non printing functions if you fail to pay.",
      "score": 1,
      "created_utc": 1743003747.0,
      "replies": []
    },
    {
      "id": "mjumaht",
      "author": "WeirdSysAdmin",
      "body": "I’ll buy the items individually. Cricut/laser cutter can get messy.",
      "score": 1,
      "created_utc": 1743003917.0,
      "replies": []
    },
    {
      "id": "mjux0j0",
      "author": "biznash",
      "body": "in concept it sounds cool if it does all these things. but to do all those tasks is super complex. more operations = more things that could go wrong. i’d be worried buying the first generation of this",
      "score": 1,
      "created_utc": 1743007047.0,
      "replies": []
    },
    {
      "id": "mjvua1f",
      "author": "Trey-Angle",
      "body": "Jack of all trades, master of none?",
      "score": 1,
      "created_utc": 1743016599.0,
      "replies": []
    },
    {
      "id": "mjwkhwy",
      "author": "gw2master",
      "body": "Didn't Jeff Geerling just have a video about not intending to buy another Bambu printer in the future?",
      "score": 1,
      "created_utc": 1743023931.0,
      "replies": []
    },
    {
      "id": "mjwph4j",
      "author": "yulbrynnersmokes",
      "body": "You had me at laser cutter",
      "score": 1,
      "created_utc": 1743025442.0,
      "replies": []
    },
    {
      "id": "mjzsypn",
      "author": "unimprezzed",
      "body": "It sounds like Bambu will find a way to make it suck at all three.",
      "score": 1,
      "created_utc": 1743075120.0,
      "replies": []
    },
    {
      "id": "mk28nxf",
      "author": "ThePr0vider",
      "body": "This shit better have an ethernet port and fully work locally, and it better not get a \"educational edition\" just to sell you the damn port (looking at you X1E)",
      "score": 1,
      "created_utc": 1743103579.0,
      "replies": []
    },
    {
      "id": "mjtlx51",
      "author": "DaveVdE",
      "body": "A 40W blue laser isn’t going to cut through wood very quickly, I’ll tell you that.",
      "score": 1,
      "created_utc": 1742992061.0,
      "replies": []
    },
    {
      "id": "mjuaetd",
      "author": "Luci_the_Goat",
      "body": "cow pie wipe decide coherent fragile price elastic juggle truck\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "score": 1,
      "created_utc": 1743000352.0,
      "replies": []
    },
    {
      "id": "mjyc0a9",
      "author": "Metalmind123",
      "body": "Very cool.\n\nToo bad it's a Bambu.\n\nSo there's no point in buying it.",
      "score": 1,
      "created_utc": 1743045332.0,
      "replies": []
    },
    {
      "id": "mjtnils",
      "author": "sioux612",
      "body": "So it's like half a snap maker?\n\n\nDidn't want one of those, and now I want this half as much \n\n\n\n\n\n\nAlso the buildspace is still too small, and that is the big machine people have been waiting months to years for?\n\n\n\nI expected at least more bed space than a voron 350, and more build volume than a prusa xl would have been preferable\n\n\nEdit: no actual points against my comment, just people down voting, looks like I angered the guy who paid the vote bots for this thread \n\n\n\nTiny hint, it's almost as cheap to just install slightly larger beds and rails in some printers, call it the XL/premium version and the main contra point against this specific printer is gone. It's not like any competent users will actually use the laser for anything beyond some fun stuff once and then forget about it\n\n\nThe only other counter point in regards to this printer is the brand that sells it, but it's not like that can be changed in any way.",
      "score": -3,
      "created_utc": 1742992690.0,
      "replies": [
        {
          "id": "mjtq8qr",
          "author": "Plank_With_A_Nail_In",
          "body": "> I expected at least more bed space than a voron 350\n\nThat's a ridiculous expectation in a consumer machine as only a tiny number of people would have the space for such a large device.",
          "score": 3,
          "created_utc": 1742993704.0,
          "replies": [
            {
              "id": "mjtzhe8",
              "author": "deadgirlrevvy",
              "body": "Well, 350mm is a piss small laser engraving space, so there's that.",
              "score": 4,
              "created_utc": 1742996943.0,
              "replies": []
            },
            {
              "id": "mjw1tol",
              "author": "sioux612",
              "body": "It's one of, if not the, most popular size for vorons printers \n\n\nAnd this thing is aimed at professional users, not consumers.\n\n\nAnd yeah professional users might have some small machines for tiny parts, but most that i deal with won't even touch anything below 300 squared because it limits the use of the machine too much\n\n\nSome guys are currently trialing rat rig 500s and are quite happy so far",
              "score": 0,
              "created_utc": 1743018822.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mka8xbc",
          "author": "fleemfleemfleemfleem",
          "body": "~350 seems to be what's been settled on for larger format printers. Lots of Vorons, XL, Sovol, creality k2... \n\nUnless you want to deal with an orange storm giga which needs its own room, pretty much. \n\nWhat are you printing regularly where you benefit from more than 350^3?",
          "score": 1,
          "created_utc": 1743209917.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjtmwhx",
      "author": "Theringofice",
      "body": "This thing’s crazy—3D printer, laser cutter, and pen plotter all in one? It’s like a dream machine for makers.",
      "score": -8,
      "created_utc": 1742992451.0,
      "replies": [
        {
          "id": "mjtz761",
          "author": "deadgirlrevvy",
          "body": "More like a nightmare.  As someone who has a multi role machine (CNC router with a laser module), I can confidently say that they suck balls.  Swapping parts back and forth is a huge hassle and nowhere near as efficient (or cost effective in the long run) as having separate machines that do a single dedicated task.  I end up not doing laser stuff I want to do when the spindle is installed because I don't want go through all the trouble of swapping the heads, or vice versa.  You have to recalibrate everything, every single time you swap heads.  NO.  Thank you.",
          "score": 3,
          "created_utc": 1742996847.0,
          "replies": []
        }
      ]
    }
  ]
}