{
  "post": {
    "title": "Sony's Triple-Layer Image Sensor Promises Huge Performance Gains",
    "author": "diacewrb",
    "id": "1mestcq",
    "score": 246,
    "created_utc": 1754043828.0,
    "selftext": "",
    "num_comments": 24,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1mestcq/sonys_triplelayer_image_sensor_promises_huge/"
  },
  "comments": [
    {
      "id": "n6bpvxt",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1754043829.0,
      "replies": []
    },
    {
      "id": "n6bs7ae",
      "author": "CalRipkenForCommish",
      "body": "That’s a good read, I am interested in how they’ll address the increased power consumption.  I didn’t see it referenced in the article",
      "score": 35,
      "created_utc": 1754044989.0,
      "replies": [
        {
          "id": "n6c86hr",
          "author": "letsnottry",
          "body": "I don’t think power is too much of an issue with most chips, most Sony chips pull around 7watts, the power draw issues come from accessories. The movie cameras (ARRI Alexa’s)run on 12v batteries where the chips pull around 10 watts but when you start rolling and with a viewfinder on and are outputting video you start to touch around 80watts. So they become pretty power hungry. The Sony movie cameras (the Venice) is considered efficient at around 60watts with a much larger sensor.",
          "score": 11,
          "created_utc": 1754051588.0,
          "replies": [
            {
              "id": "n6cuvbm",
              "author": "guzhogi",
              "body": "There were a few DSLRs (or similar type cameras) that used to have built in GPS to geotag the photos taken, but I hear that many companies dropped GPS due to the power drain. I’ve also seen cameras now that tether to your phone to do the same thing. Not sure how the quality compares, though",
              "score": 7,
              "created_utc": 1754058782.0,
              "replies": []
            },
            {
              "id": "n6cfm9r",
              "author": "CalRipkenForCommish",
              "body": "Good points, and thanks for the feedback.  What’s your take on battery life?  It would seem there’ll be significant power draw, even though the batteries are becoming more efficient.",
              "score": 1,
              "created_utc": 1754054138.0,
              "replies": [
                {
                  "id": "n6cisfz",
                  "author": "letsnottry",
                  "body": "Sorry I replied as a separate comment, I'm old and suck at the internet.",
                  "score": 1,
                  "created_utc": 1754055147.0,
                  "replies": [
                    {
                      "id": "n6ct8mq",
                      "author": "_LyleLanley_",
                      "body": "I relate to this.",
                      "score": 1,
                      "created_utc": 1754058310.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n6bugm1",
          "author": "None",
          "body": "[deleted]",
          "score": 11,
          "created_utc": 1754046062.0,
          "replies": [
            {
              "id": "n6ecuc0",
              "author": "funforgiven",
              "body": "These are not solid state batteries. Therea not any devices with a solid state battery in consumer space.",
              "score": 5,
              "created_utc": 1754074261.0,
              "replies": []
            },
            {
              "id": "n6e36m8",
              "author": "G1ntok1_Sakata",
              "body": "Should use Wh/mWh rather than Ah/mAh for comparing power between batteries with different chemistries. Can have different voltages which vastly changes how much power is in the battery despite potentially having the same amp hour ratings. Tbh, should just always use watt hours over amp hours.",
              "score": 3,
              "created_utc": 1754071438.0,
              "replies": []
            },
            {
              "id": "n6bz9p9",
              "author": "danielv123",
              "body": "Huh, those batteries look cool. Looks like they only ship to China/india so far though, with international versions getting smaller batteries.",
              "score": 3,
              "created_utc": 1754048165.0,
              "replies": [
                {
                  "id": "n6cvf6j",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 3,
                  "created_utc": 1754058941.0,
                  "replies": [
                    {
                      "id": "n6cvt4f",
                      "author": "danielv123",
                      "body": "These are still lithium batteries, but with more silicon in the anode. They will still go up in flames.",
                      "score": 6,
                      "created_utc": 1754059053.0,
                      "replies": [
                        {
                          "id": "n6cwijq",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 2,
                          "created_utc": 1754059259.0,
                          "replies": [
                            {
                              "id": "n6ebi6i",
                              "author": "danielv123",
                              "body": "Did you read your link? It quite clearly says that silicon carbon anodes are traditional designs with liquid electrolyte. Sure, there are tests being done elsewhere, but I can't see anyone claiming that the technology is found in OnePlus tablets or Sony cameras.",
                              "score": 4,
                              "created_utc": 1754073866.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n6c2z5e",
      "author": "jfranci3",
      "body": "F-it, go FIVE LAYERS\n\nhttps://theonion.com/fuck-everything-were-doing-five-blades-1819584036/",
      "score": 19,
      "created_utc": 1754049666.0,
      "replies": []
    },
    {
      "id": "n6bvphw",
      "author": "JamesFrancosButthole",
      "body": "Is this 3DHI? Ties into the DARPA program NGMM",
      "score": 4,
      "created_utc": 1754046628.0,
      "replies": []
    },
    {
      "id": "n6ci08j",
      "author": "letsnottry",
      "body": "There are a bunch of other factors like gain ect ect... we have the back lit sensors the dual gain sensors ect working today, this seems more like more processing power on the chip it's self and not a big advancement in terms of the photodionics but an extra layer of the logic substrate.....far more efficient than a logic board separate of the sensor it's self. I think if this tech ends up in say a consumer camera they will neuter it to keep the power in check for the application and the power draw will increase for professional applications",
      "score": 3,
      "created_utc": 1754054898.0,
      "replies": [
        {
          "id": "n6fgv07",
          "author": "Thanges88",
          "body": "Rather than just additional logic, the article mentions they could also move the pixel transistor to the second layer (leaving the logic in the third layer), enabling larger photodiodes on the first layer. It will be interesting to see what Sony value more, additional logic (very handy for video) or more sensitive pixels.",
          "score": 2,
          "created_utc": 1754086459.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n6d6m3x",
      "author": "Sweet_Ad_153",
      "body": "Does anyone smarter than I know if this is similar to what Blackmagic Design did initially with their 12K sensor?",
      "score": 2,
      "created_utc": 1754062147.0,
      "replies": []
    },
    {
      "id": "n6dkm08",
      "author": "SomethingAboutUpDawg",
      "body": "I’m a Sony shooter and am excited for any new tech in cameras they have.",
      "score": 2,
      "created_utc": 1754066164.0,
      "replies": []
    },
    {
      "id": "n6e9isa",
      "author": "avclubvids",
      "body": "Is this just Foveon again?",
      "score": 2,
      "created_utc": 1754073285.0,
      "replies": [
        {
          "id": "n6okl2p",
          "author": "ValgrimTheWizb",
          "body": "No, Foveon's X3 used stacked photodiodes instead of a Bayer pattern with an antialiasing filter to avoid color artifacts, this caused the image to be really sharp compared to a Bayer sensor of equal resolution, but they suffered from low light sensitivity and bad color accuracy.\n\nThis is just an extra electronic layer stacked beneath the sensor. It's unclear how this improves the image quality but my guess is some sort of extra signal processing before analog-to-digital conversion.",
          "score": 2,
          "created_utc": 1754223040.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n6cwx6f",
      "author": "nanapancakethusiast",
      "body": "And it will still be absolutely obliterated (in terms of image quality) by a 40 year old point and shoot camera loaded with 35mm film",
      "score": -24,
      "created_utc": 1754059376.0,
      "replies": [
        {
          "id": "n6dwplr",
          "author": "Bderken",
          "body": "Oh brother",
          "score": 6,
          "created_utc": 1754069610.0,
          "replies": []
        },
        {
          "id": "n6cyccp",
          "author": "letsnottry",
          "body": "Yup, expect Kodak to start releasing new stocks in the near future. They are releasing a new motion picture stock soon and I suspect a more nuteral photo stock to be scanned and manipulated like digital photos. \n\nThe human eye loves those chemical photo sites.... \n\nLong live film. It's funny to try and talk my clients into shooting film.... they are so worried something might go wrong but forget that this has been the workflow for 100 years.",
          "score": 0,
          "created_utc": 1754059787.0,
          "replies": []
        }
      ]
    }
  ]
}