{
  "post": {
    "title": "Sony stops making 8K TVs, but ultra high-def cameras remain key to future | TV sets designed for 8K content are few and far between now",
    "author": "chrisdh79",
    "id": "1jxdm2z",
    "score": 2436,
    "created_utc": 1744450808.0,
    "selftext": "",
    "num_comments": 496,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jxdm2z/sony_stops_making_8k_tvs_but_ultra_highdef/"
  },
  "comments": [
    {
      "id": "mmpije7",
      "author": "MargielaFella",
      "body": "The industry jumped the gun with 8K. \n\nEven to this day, there’s so few use cases for it on the consumer level. And the cost is too high.",
      "score": 1291,
      "created_utc": 1744451019.0,
      "replies": [
        {
          "id": "mmpjuub",
          "author": "drmirage809",
          "body": "Indeed. 4K is already pretty much perfect, doubly so at the distance most people sit from their TV. There’s no real added value in adding in even more pixels. \n\nI’d rather have TV manufacturers focus on perfecting colour accuracy, HDR viewing experience, minimising OLED burn in. All those things sound a lot more useful in a TV, if somewhat harder to market than “bigger number is more better.”",
          "score": 780,
          "created_utc": 1744451849.0,
          "replies": [
            {
              "id": "mmpkc36",
              "author": "MargielaFella",
              "body": "And let's get to a point where consoles and PCs can even output at 4K natively (without upscaling) before we introduce yet another resolution.",
              "score": 434,
              "created_utc": 1744452149.0,
              "replies": [
                {
                  "id": "mmplfhq",
                  "author": "drmirage809",
                  "body": "I personally doubt that’s going to happen anytime soon. GPU manufactures are all pushing machine learning based upscaling systems pretty hard. And they’ve gotten quite good at it. And when there’s next to no visual difference between 4K and, IDK, 1440p upscaled to 4K then why bother with putting in all that brute force to render native 4K?\n\nBecause that seems to be the line of thinking over at Nvidia and AMD mostly.",
                  "score": 170,
                  "created_utc": 1744452837.0,
                  "replies": [
                    {
                      "id": "mmplw0x",
                      "author": "MargielaFella",
                      "body": "I use DLSS personally, and agree with this philosophy.\n\nBut there will come a time when we can push 4K natively with lower end hardware. Maybe that's when 8K will make sense lol, upscaled from 4K.",
                      "score": 82,
                      "created_utc": 1744453116.0,
                      "replies": [
                        {
                          "id": "mmpsd9h",
                          "author": "drmirage809",
                          "body": "DLSS is utter black magic. It’s incredibly how clear and clean that image is. \n\nI’ve knocked it all the way down to the ultra performance setting in God of War Ragnarok just to see how well it would do in the absolute worst case scenario. And while the image got noticeably softer, it still looked quite good.",
                          "score": 39,
                          "created_utc": 1744456796.0,
                          "replies": [
                            {
                              "id": "mmqjzqp",
                              "author": "OramaBuffin",
                              "body": "Biggest thing to look for for me is distant objects to see the difference. Maybe it's improved since 2.0, but when I have DLSS on (which I do, I love it) one thing that jumps out is trees in the far distance stop shimmering in the wind. The movement is so small and murky between leaves that even quality upscaling just deletes it entirely.",
                              "score": 18,
                              "created_utc": 1744467909.0,
                              "replies": [
                                {
                                  "id": "mmqkh77",
                                  "author": "PuppetPal_Clem",
                                  "body": "3.0 and 4.0 have each been massive generational leaps ahead of the previous versions of DLSS so yes things have improved significantly since 2.0.",
                                  "score": 29,
                                  "created_utc": 1744468073.0,
                                  "replies": []
                                },
                                {
                                  "id": "mmqm72t",
                                  "author": "drmirage809",
                                  "body": "I don't think I've ever played a game that still uses the 2.0 version of the upscaling model as my GPU in those times wasn't able to use it. I have used AMD's FSR tech through the years though and I've seen that have a noticeable amount of shimmering and afterimages. Although how bad it was depended on the game. \n\nI've only recently gotten my hands on a GPU that can do DLSS and have been using the overwrite tool in the Nvidia app to force games to use the more recent versions of the model wherever possible. The newest model (4.0 or preset K) is absolutely incredible at maintaining detail and image stability though. You can use the app to force whatever model you like, so maybe I'll knock it down to preset A just to see how far things have come.",
                                  "score": 8,
                                  "created_utc": 1744468651.0,
                                  "replies": [
                                    {
                                      "id": "mmr6tq8",
                                      "author": "andizzzzi",
                                      "body": "I was updating games’ DLSS files today for a friend and yeh, I havnt seen 2.0 in quite a while 😅 \nI can understand why people were not easily impressed, but the latest plugins are great and have been for a while.",
                                      "score": 2,
                                      "created_utc": 1744475214.0,
                                      "replies": [
                                        {
                                          "id": "mmtcdkp",
                                          "author": "Jiopaba",
                                          "body": "Mechwarrior 5: Mercenaries ships with DLSS 2.0.  Wound up having to use OptiScaler to get FSR 4.0 running with my new AMD card, and it's been a treat.  It's still amazing that we can easily replace these software implementations like that.",
                                          "score": 3,
                                          "created_utc": 1744501245.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "mn211ql",
                                      "author": "Thog78",
                                      "body": "Can we run the latest DLSS on a 3060ti with the trick you're talking about? I never saw this option in the nvidia control panel, is it hard to find?",
                                      "score": 1,
                                      "created_utc": 1744636306.0,
                                      "replies": [
                                        {
                                          "id": "mn26n9f",
                                          "author": "drmirage809",
                                          "body": "Should be possible. It’s just not in the old Nvidia control panel. It’s a feature that’s in the newer Nvidia app. The one that replaced GeForce Experience. \n\nThat app has a list of games and allows you to configure stuff in there, including DLSS when supported.",
                                          "score": 2,
                                          "created_utc": 1744638307.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mmudeg3",
                                  "author": "EggsAndRice7171",
                                  "body": "DLSS is awesome but I absolutely despises Frame Gen. I have yet to find a game it actually improves my experience in.",
                                  "score": 1,
                                  "created_utc": 1744516341.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mmprlgc",
                          "author": "adzy2k6",
                          "body": "The human eye can't really pick up the difference between 8k and 4k unless it sit stupidly close to a very large screen.",
                          "score": 14,
                          "created_utc": 1744456391.0,
                          "replies": [
                            {
                              "id": "mmqydw2",
                              "author": "stellvia2016",
                              "body": "Seeing the 8K demo content at the store, I could definitely see a difference, but is it worth a several thousand dollar price difference? Absolutely not. Especially since that content will be so few and far between.",
                              "score": 9,
                              "created_utc": 1744472578.0,
                              "replies": [
                                {
                                  "id": "mmrsyf9",
                                  "author": "angusalba",
                                  "body": "It’s about angular resolution and a direct relationship between pixel size and distance - 1 arcmin per pixel is 20:20 vision and the reality is most people don’t have that good vision anyway\n\nFor a typical desktop screen size and distance 8K is wasted and the same for many 4k larger TV’s\n\nBetter to concentrate on higher frame rates, global shuttering etc to remove motion artifacts.",
                                  "score": 6,
                                  "created_utc": 1744482012.0,
                                  "replies": [
                                    {
                                      "id": "mmsnyz2",
                                      "author": "flac_rules",
                                      "body": "Even with 1 arcmin it is above 4k at thx recommended viweing angle, and we can se down to about 0.1 with the right material, not even counting moving pictures. That being said I agree that it at the moment perhaps is the least important thing to focus on.",
                                      "score": 1,
                                      "created_utc": 1744492352.0,
                                      "replies": [
                                        {
                                          "id": "mmt4p10",
                                          "author": "angusalba",
                                          "body": "THX’s recommendations are the visual version of audiophile claims - purist nonsense that does not apply to most situations.\n\nThe percentage of screens worldwide mounted at the THX distance is ludicrously small and is closer to what a typical PC screen is at than any realistic TV situation with an attach rate to justify not just the 8K screen tech but all the support environment as well - even 4k is more often than not compression and upscaling to not overburden the backend \n\nThere is a reason VR systems throw foviated rendering and all sorts of things when it comes to high resolution - while power is a huge part of that, driving an 8K screen at the distance they suggest is throwing 90% of the resolution away because you only see the resolution in the center.",
                                          "score": 2,
                                          "created_utc": 1744498381.0,
                                          "replies": [
                                            {
                                              "id": "mmt898x",
                                              "author": "flac_rules",
                                              "body": "40 degrees of viewing angle isn't purist nonsense,it is pretty reasonable.",
                                              "score": 0,
                                              "created_utc": 1744499717.0,
                                              "replies": [
                                                {
                                                  "id": "mmuegou",
                                                  "author": "angusalba",
                                                  "body": "You are missing what I am saying - that might be the purist viewing angle but it’s nothing like what’s really in any standard house and typically only works for a SINGLE PERSON per screen.  There is a reason screens start being curved because if you start really getting into 8K and getting anything like full use  of the resolution, the change in focal length to the edges of the screen at the THX optimal position causes eye strain just by itself and that’s before as I said you are not actually using that resolution.\n\nvery VERY few people are sitting anything like close enough to a standard TV screen in the vast majority of houses to be at eye limit for resolution.\n\nFull disclosure - I have been involved in display tech and AR/VR/MR for the last 2 decades and am very familiar with human factors and vision.",
                                                  "score": 1,
                                                  "created_utc": 1744516832.0,
                                                  "replies": [
                                                    {
                                                      "id": "mmv057z",
                                                      "author": "flac_rules",
                                                      "body": "This isn't some crazy number that nobody has, you can easily get that with a 75 or 85 inch tv at normal distance. And especially with a projector. \n\nIf you are very familiar with human vision you should now that with the right material human vision can see well below 1 arcmin. \n\nI am not saying 8k tvs is a good choice at the moment, just that it is not above the limit of human vision. And frankly people should be a bit careful claiming it, it has been wrongly claimed for decades now. People said it with 1080p with 4k and with above 60hz, it was even claimed with above 24 fps.",
                                                      "score": 1,
                                                      "created_utc": 1744528450.0,
                                                      "replies": [
                                                        {
                                                          "id": "mmwhee6",
                                                          "author": "angusalba",
                                                          "body": "Again you show you don’t know how human vision actually works\n\n8K on any screen does little good if you can not realize the resolution and in the vast majority of devices and how they are used, it is absolutely pointless \n\nIn addition, with current resolutions, higher frame rates and higher brightness with global shutter and other techniques, you would see a far greater impact to image quality delivery along with better rendering technology- all of which vastly increases the power and data processing requirements \n\nIrrespective, 8K out of any context requires 4x the data rate and would “over deliver” resolution.\n\nAnd yes people (some very much not all) can see better that 20/20 which is the 1 arcmin value but for most situations and with some regard for all the content, its data footprint, the ability to send it without compression artifacts, not waste lots of power and lastly be on a screen that someone is actually at the right point to see without the eye strain from shifting focal points from a large screen at an angle not surged and lastly not throw everything currently in place out AGAIN.\n\n\nThere is a lot of the mechanics I really don’t think you get especially after that 60pixel nonsense",
                                                          "score": 1,
                                                          "created_utc": 1744555234.0,
                                                          "replies": [
                                                            {
                                                              "id": "mmwm2te",
                                                              "author": "flac_rules",
                                                              "body": "40 degrees is a recommended viewing angle, it is not crazy unreasonable in any way, and at that viewing angle, depending on material, we can see more than 6k, these are the facts.\n\nNobody claimed other improvements wouldn't matter more, in fact i have stated so myself several times.\n\nYou adding in all sorts of other reasons is telling, i at no point said it was worth it, or anything like that, I just stated, which is a fact, that we can see better resolution than 1 minute of arc with the right material, which is a fact, and even at 1 arcminute 4k isn't enough at 40 degrees viewing angle, which is also a fact.",
                                                              "score": 1,
                                                              "created_utc": 1744556710.0,
                                                              "replies": [
                                                                {
                                                                  "id": "mmwousk",
                                                                  "author": "angusalba",
                                                                  "body": "Again the angle is NOT the driving factor - what is your fascination for the number 40 - where is that coming from?\n\n40 deg for a “6k” screen without describing the pixel size which informs the screen size AND the distance from the screen is meaningless \n\nIt’s about ANGULAR resolution that informs your ability to see and that’s the angle to the PIXEL not the screen",
                                                                  "score": 1,
                                                                  "created_utc": 1744557584.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "mmwpugz",
                                                                      "author": "flac_rules",
                                                                      "body": "There are recommendations of viewing angle, because despite what you are trying to claim, the size of the display in our field of vision matters to people. People don't buy bigger displays just to throw away money. \n\nNo it isn't meaningless, if you actually now anything about this you should now it isn't. Viewing angle number of pixels gives us what we need and gives a more 'general solution'",
                                                                      "score": 1,
                                                                      "created_utc": 1744557901.0,
                                                                      "replies": [
                                                                        {
                                                                          "id": "mmwtpzn",
                                                                          "author": "angusalba",
                                                                          "body": "Again no that is not how it works and I am done trying to help you understand",
                                                                          "score": 1,
                                                                          "created_utc": 1744559125.0,
                                                                          "replies": [
                                                                            {
                                                                              "id": "mmx6std",
                                                                              "author": "flac_rules",
                                                                              "body": "So tell me then, why do you belive people buy larger TVs?",
                                                                              "score": 0,
                                                                              "created_utc": 1744563215.0,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "mmx740w",
                                                                                  "author": "angusalba",
                                                                                  "body": "Ego with no understanding of how resolution works\n\nJust stop",
                                                                                  "score": 1,
                                                                                  "created_utc": 1744563309.0,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "mmx7gb0",
                                                                                      "author": "flac_rules",
                                                                                      "body": "You think people buy bigger TVs because they don't understand how resolution works? They belive a 65 inch 4k TV has a higher resolution than a 55 inch 4K TV, and that is why they buy it?",
                                                                                      "score": 0,
                                                                                      "created_utc": 1744563412.0,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "mmxupwd",
                                                                                          "author": "angusalba",
                                                                                          "body": "You would be surprised how many people do exactly that and it’s all about bigger is better for bragging rights and then sitting too close or too far from that big screen.\n\nYou are doing similar with repeating 40 deg which is 20:10\n\nI am out - you do you",
                                                                                          "score": 1,
                                                                                          "created_utc": 1744570608.0,
                                                                                          "replies": [
                                                                                            {
                                                                                              "id": "mmyif6j",
                                                                                              "author": "flac_rules",
                                                                                              "body": "Sure, you stick with that, people don't buy bigger TVs because they like more of the field of vision to be covered, the buy it because the resolution increases.",
                                                                                              "score": 1,
                                                                                              "created_utc": 1744578245.0,
                                                                                              "replies": []
                                                                                            }
                                                                                          ]
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                },
                                                {
                                                  "id": "mmuj6b8",
                                                  "author": "angusalba",
                                                  "body": "Oh and by the way it’s not 40deg\n\nThe optimal viewing angle is not a fixed number\n\nIt’s primarily driven by the size of the pixels so that the 1 arc min per pixel condition is met.\n\nMore pixels at the same pixel size will mean a larger angle but not a change in optimal distance\n\nThat’s why the optimal distance in the link I provided related to resolution to give the approx distance based on screen size since the primary driver is the pixel.",
                                                  "score": 1,
                                                  "created_utc": 1744519035.0,
                                                  "replies": [
                                                    {
                                                      "id": "mmv0k3k",
                                                      "author": "flac_rules",
                                                      "body": "That is a backwards way of looking at it, especially in the context of resolution needed for a TV. With that logic we wouldn't need any more than 60 pixels, we can just sit at a 1 degree angle. It is obviously better to make the tv fit our needs than to fit ourselves to the TV.",
                                                      "score": 1,
                                                      "created_utc": 1744528705.0,
                                                      "replies": [
                                                        {
                                                          "id": "mmwfm9i",
                                                          "author": "angusalba",
                                                          "body": "And with that flippant comment you clearly do no understand the mechanics behind how vision works.\n\nI am not saying 60 pixels (what on earth are you talking about???) but that it has NOTHING to do with the angle described by the screen without direct reference to both the pixel size AND the distance to the screen",
                                                          "score": 1,
                                                          "created_utc": 1744554649.0,
                                                          "replies": [
                                                            {
                                                              "id": "mmwmf8i",
                                                              "author": "flac_rules",
                                                              "body": "You argue in your comment as if we should choose the viewing angle based in the pixels, it is the other way around, we choose the resolution on what viewing angle fits us the best.",
                                                              "score": 1,
                                                              "created_utc": 1744556819.0,
                                                              "replies": [
                                                                {
                                                                  "id": "mmwo4nm",
                                                                  "author": "angusalba",
                                                                  "body": "No just no - resolution has increased due to technology improvements not because of some arbitrary angle wish - did you bother to look at rhe THX link?\n\nAgain ANGLE is the RESULT of the pixel size and pixel count to inform the distance from the screen to meet 20/20 resolution",
                                                                  "score": 1,
                                                                  "created_utc": 1744557358.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "mmwozpr",
                                                                      "author": "flac_rules",
                                                                      "body": "Do you think we make bigger more high resolution TVs for fun? It is because it moves us towards the viewing angle we prefer, when we reach it increases will taper off, as they have in computer monitor sizes for instance. \n\nYour logic is backwards, we try to make displays to fit us not the other way around. With your logic we are back to the 1 degree viewing angle again.",
                                                                      "score": 1,
                                                                      "created_utc": 1744557628.0,
                                                                      "replies": [
                                                                        {
                                                                          "id": "mmwtk39",
                                                                          "author": "angusalba",
                                                                          "body": "ONE (1) ARC MINUTE PER PIXEL - move too close and you start to see the gaps between the pixels to far and you start to merge pixels \n\nWe are done - you just don’t get this is how your vision ACTUALLY works",
                                                                          "score": 1,
                                                                          "created_utc": 1744559073.0,
                                                                          "replies": [
                                                                            {
                                                                              "id": "mmx6p2j",
                                                                              "author": "flac_rules",
                                                                              "body": "That is not the limit of human vision, and even if it was, it is not enough for a 40 degree viewing angle, the THX recommendation, despite what you are trying to claim, people actually but bigger TVs for a reason.",
                                                                              "score": 1,
                                                                              "created_utc": 1744563185.0,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "mmx6z50",
                                                                                  "author": "angusalba",
                                                                                  "body": "Just stop",
                                                                                  "score": 1,
                                                                                  "created_utc": 1744563268.0,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "mmx74yx",
                                                                                      "author": "flac_rules",
                                                                                      "body": "No, I won't, you are posting misinformation, and people might read it and belive it.",
                                                                                      "score": 1,
                                                                                      "created_utc": 1744563317.0,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "mmxtt5f",
                                                                                          "author": "angusalba",
                                                                                          "body": "Again I ask for your source that “40 degrees” is the “right angle” and you keep not doing so.\n\nMany people buy big screens and don’t sit at the optimal DISTANCE and there is MUCH more to it that some arbitrary number you keep stating with not context.\n\nI don’t know how many more times I can tell you that the optimal viewing position is derived from the size of the pixels (which is what drives the screen size) and which informs an angle at the pixel level - the angle the screen makes is entirely a function of the pixel angle multiplied by the horizontal resolution.\n\n1 arc min per pixel is 60pixels per degree so 20:20 vision is 64 degrees for 3860 pixels - at 40 deg you are pushing 20:10 which is well beyond 20:20 which is the norm for human vision and only 35% of people have without correction and at 40 most people are not seeing the full resolution - they physically can’t \n\nBut yeah I don’t know what I am talking about.\n\nI am starting think you see screen size as some sort of bragging right or to justify how much you spent on the screen.\n\nYour argument is the same as boasting about high frequency audio sound systems that almost anyone older than 30 no longer hears.\n\nI am well and truly over you not understanding this and replying with near ad hominem rather than providing any math or citation to back up your point.",
                                                                                          "score": 1,
                                                                                          "created_utc": 1744570317.0,
                                                                                          "replies": [
                                                                                            {
                                                                                              "id": "mmyjst3",
                                                                                              "author": "flac_rules",
                                                                                              "body": "I have given the source, several times, you even commented it yourself, it is the THX recommended viewing angle.\n\nYou can tell me as many times you want, that is not how people choose a TV size and it is a stupid way to choose it. TV size actually matter to people, despite your claims.\n\nCheck things like vernier acuity and if you want to test yourself, look at this test.\n\nhttps://www.testufo.com/aliasing-visibility#antialiasing=0&thickness=1\n\nYou can easily see aliasing at distance were a pixel is well below 1 minute of arc.",
                                                                                              "score": 1,
                                                                                              "created_utc": 1744578703.0,
                                                                                              "replies": []
                                                                                            }
                                                                                          ]
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mmr9qjh",
                                  "author": "adzy2k6",
                                  "body": "It depends on how close you are to the screen and how large it is. And probably never at the typical distance accross a room.",
                                  "score": 5,
                                  "created_utc": 1744476130.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mmqaexm",
                              "author": "speculatrix",
                              "body": "In most situations people won't be able to even see 4k, perhaps not even 1080p.\n\nIf you look at the data rate for Netflix UHD video, it's obviously inadequate to give a proper UHD experience. When I watch a UHD Blu-ray it's vastly better than any UHD streaming service; a Blu-ray can have a bit rate 6 or more times that provided by Netflix!",
                              "score": 10,
                              "created_utc": 1744464611.0,
                              "replies": [
                                {
                                  "id": "mmqkbw2",
                                  "author": "OramaBuffin",
                                  "body": "On a TV sitting at a large distance maybe, but on a PC monitor the pixels in 1080p are pretty noticeable. Unless the screen is only like 20inches or smaller.",
                                  "score": 19,
                                  "created_utc": 1744468023.0,
                                  "replies": [
                                    {
                                      "id": "mmqkn4r",
                                      "author": "speculatrix",
                                      "body": "Yes, I have a 4k 28\" monitor and I can't see the pixels. I also have a 24\" 1080p one and the pixels are readily visible.",
                                      "score": 8,
                                      "created_utc": 1744468130.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mmsnbcv",
                              "author": "flac_rules",
                              "body": "In general thats is not true, but there are less situations where we se the difference when you start at 4k and it surely is not worth it now",
                              "score": 1,
                              "created_utc": 1744492125.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mmrb5vr",
                          "author": "gramathy",
                          "body": "I like using AI as a replacement for antialiasing since traditional AA tech is relatively \"expensive\" but I don't like actual upscaling as there are some things it isn't great at (though it's gotten better at the worst of it) and I outright refuse to use frame generation",
                          "score": 1,
                          "created_utc": 1744476572.0,
                          "replies": []
                        },
                        {
                          "id": "mmrl4ai",
                          "author": "Alchion",
                          "body": "dumb question but can a new graphics card render at 1080 and upscale to 1440 or is it to 4k only?",
                          "score": 1,
                          "created_utc": 1744479567.0,
                          "replies": []
                        },
                        {
                          "id": "mms3svk",
                          "author": "Emu1981",
                          "body": ">Maybe that's when 8K will make sense lol\n\nThe problem with 8K is that 4K provides enough pixel density to make it so that someone with 20/20 vision cannot make out any pixels at a comfortable viewing distance for a given size of screen.  Hell, I have a 48\" 4K OLED that I sit 2ft from and I have to lean in to distinguish individual pixels in this white text (but my eye sight isn't exactly perfect).",
                          "score": 1,
                          "created_utc": 1744485612.0,
                          "replies": []
                        },
                        {
                          "id": "mmr4rbv",
                          "author": "TaylorMonkey",
                          "body": "But if you can push 4K natively, why not spend it on even more realistic or compelling lighting and effects, as opposed to a tiny bit more sharpness or knowing it’s “native” if you can’t really tell— but you can more easily tell the actual improvements to shading and scene complexity?\n\nBut I know there are people who prefer native sharpness over everything, because they think that’s how video games should look, but then claim they can’t see the difference between better effects and lighting when that’s the most obvious thing in terms of actually different color and light values when you compare images back to back.",
                          "score": 0,
                          "created_utc": 1744474563.0,
                          "replies": [
                            {
                              "id": "mmsb3mh",
                              "author": "MargielaFella",
                              "body": "You’re taking my point too literally. It’s not a matter of if we should, it’s if we can. \n\nI agree with your point, but I was never suggesting otherwise.",
                              "score": 1,
                              "created_utc": 1744488042.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mmrfcxv",
                      "author": "ChrisFromIT",
                      "body": ">1440p upscaled to 4K then why bother with putting in all that brute force to render native 4K?\n\nBecause with that extra brute force with upscaling, you can do more computationally hard rendering techniques. And that was why upscaling was design to do anyways. \n\nUpscaling was done on consoles before DLSS or FSR was around for upscaling. Just those techniques didn't have as good of quality, so the ratio between render resolution to render output wouldn't be as huge as DLSS or FSR's ratios.\n\nFor example, checkerboarding upscaling was used in BF1 on consoles for 4k. I believe the input render resolution was 1900p upscaled to 2160p.",
                      "score": 6,
                      "created_utc": 1744477843.0,
                      "replies": []
                    },
                    {
                      "id": "mmv32ln",
                      "author": "Knut79",
                      "body": "It's the inverse square law that also applies here. The higher the resolution the power requirement for rendering is exponentially higher",
                      "score": 1,
                      "created_utc": 1744530267.0,
                      "replies": []
                    },
                    {
                      "id": "mn7jcjy",
                      "author": "alidan",
                      "body": "they are fucking horrible at it, if you know where the seems are, you can never unsee them.\n\nbut they will push horrific tech and ungodly demanding bullshit on us so we are forced to use shit that makes games look worse than ones released 10 years ago.",
                      "score": 1,
                      "created_utc": 1744711738.0,
                      "replies": []
                    },
                    {
                      "id": "mmpo26w",
                      "author": "ohiocodernumerouno",
                      "body": "Artists can't do 8k animation. And computers can't do 8k animation on any reasonable time scale. 8k will never be feasible in our life time. Maybe once we get a Dyson sphere around the sun.",
                      "score": -28,
                      "created_utc": 1744454434.0,
                      "replies": [
                        {
                          "id": "mmpss7g",
                          "author": "MDCCCLV",
                          "body": "8k screens would already be easy to do and be a big improvement just for text readability and sharpness. Even if everything was just scaled up from 4k it would be an improvement.",
                          "score": 8,
                          "created_utc": 1744457014.0,
                          "replies": [
                            {
                              "id": "mmr0rwv",
                              "author": "RadVarken",
                              "body": "Text makes sense, but no one is buying an 8k TV to read a book.",
                              "score": 1,
                              "created_utc": 1744473314.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mmppavv",
                          "author": "goodvibes94",
                          "body": "I think that's incredibly pessimistic, AI is growing and soon it will be able to create fully fledged 8k plus full feature animated films",
                          "score": -11,
                          "created_utc": 1744455141.0,
                          "replies": [
                            {
                              "id": "mmsm2yu",
                              "author": "SolidOshawott",
                              "body": "Must be nice to have a nuclear reactor dedicated to making slop",
                              "score": 3,
                              "created_utc": 1744491704.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mmpw4a8",
                  "author": "MaroonIsBestColor",
                  "body": "I can’t believe the PS5 had 8K written on the damn box lol",
                  "score": 15,
                  "created_utc": 1744458663.0,
                  "replies": []
                },
                {
                  "id": "mmuc6vc",
                  "author": "Scotthe_ribs",
                  "body": "A 4090 can do 4k with 90-140hz at mostly high settings, no RT ( that will take several more generations before it is dry ). I’m not an eye candy guy and target frames, so I try to balance out performance to graphics. This is just my experience of course.",
                  "score": 3,
                  "created_utc": 1744515795.0,
                  "replies": [
                    {
                      "id": "mmud5a3",
                      "author": "MargielaFella",
                      "body": "I should clarify. I mean standardized. \n\n4090 represents a very small portion of the GPU market. Native 4K is not ubiquitous in PC gaming atm. When low and mid level cards can push it at reasonable frame rates, then it will be.",
                      "score": 1,
                      "created_utc": 1744516223.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mmzmlzf",
                  "author": "Malefectra",
                  "body": "Um, PCs have been doing native 4k for quite a while… I’ve had one capable of it since 2018, and it was running a GTX 1080Ti.",
                  "score": 2,
                  "created_utc": 1744592658.0,
                  "replies": [
                    {
                      "id": "mn0a2st",
                      "author": "MargielaFella",
                      "body": "Lol yeah I don’t mean just push the resolution or render some old/lighter games on. Most GPUs in the market today cannot push native 4K at 60fps without sacrificing too much fidelity.",
                      "score": -1,
                      "created_utc": 1744602357.0,
                      "replies": [
                        {
                          "id": "mn1vg56",
                          "author": "Malefectra",
                          "body": "My builds have consistently done it since 2018, so I don't know what you're on about...  \nJust turn off anti-aliasing it's not necessary when everything else turned up.",
                          "score": 2,
                          "created_utc": 1744634168.0,
                          "replies": [
                            {
                              "id": "mn3wgm8",
                              "author": "MargielaFella",
                              "body": "how common is your build? \n\nit doesn't matter if a handful of people with an expensive rig can do it, i'm talking about mass adoption.\n\nalso curious, what specs did you have in 2018 that were letting you push 4k60 on modern AAA titles?",
                              "score": 1,
                              "created_utc": 1744657016.0,
                              "replies": [
                                {
                                  "id": "mn4b4a7",
                                  "author": "Malefectra",
                                  "body": "I'm going to answer your second question first: \n\n[https://www.3dmark.com/spy/1683109](https://www.3dmark.com/spy/1683109)\n\nTo answer your first question, it's in the top 94% of 3D Mark results... All I did was splurge after a windfall and buy everything top shelf. Was about 4k when everything was all said and done. Won't be spending like that again for at least another 5-6 years. I treat it like buying a used car.  \nMy current build: [https://www.3dmark.com/sw/2027838](https://www.3dmark.com/sw/2027838)\n\nThese parts were all off-the-shelf, and imminently available to anyone willing to buy them. The tech is there, has been there if that's your spending priority. Just because your spending priorities were elsewhere, doesn't mean it's not available at mass market...",
                                  "score": 1,
                                  "created_utc": 1744661461.0,
                                  "replies": [
                                    {
                                      "id": "mn4gts3",
                                      "author": "MargielaFella",
                                      "body": "I didn't say mass market, I said mass adoption. The most common GPU on Steam is the 4060. \n\nIt doesn't matter that enthusiasts have been able to do this for 5 years, or even 10 years. My point is that it isn't ubiquitous.",
                                      "score": 0,
                                      "created_utc": 1744663188.0,
                                      "replies": [
                                        {
                                          "id": "mn4i7kc",
                                          "author": "Malefectra",
                                          "body": "the 4060 does 4k just fine... does every setting get maxed? No. However, that's a card that's more than sufficient for 4k 60, and per the Steam System Survey, it's the most ubiquitous..\n\n![gif](giphy|1267Co3vPNBqQU)",
                                          "score": 1,
                                          "created_utc": 1744663608.0,
                                          "replies": [
                                            {
                                              "id": "mn4ksvo",
                                              "author": "MargielaFella",
                                              "body": "https://m.youtube.com/watch?v=w5O8j9AgHfw&pp=ygUONDA2MCA0ayBuYXRpdmU%3D\n\nHere’s just the first result I found lol. He didn’t even bother testing native because he knew it was not going to hit playable frame rates. \n\nThis is how misinformation spreads. People just say things and no one fact checks them.",
                                              "score": 1,
                                              "created_utc": 1744664398.0,
                                              "replies": [
                                                {
                                                  "id": "mn5gj81",
                                                  "author": "Malefectra",
                                                  "body": "If he doesn't bother to do the tests, then he doesn't have the data.  \nAt that point, it's not fact... it's opinion. You fell for the first opinion piece passing itself off as data....  Gonna have the unmitigated gall to talk about my assertion being misinformation when you're the one peddling that shit yourself...",
                                                  "score": 0,
                                                  "created_utc": 1744675149.0,
                                                  "replies": [
                                                    {
                                                      "id": "mn5kyj7",
                                                      "author": "MargielaFella",
                                                      "body": "🤣",
                                                      "score": 1,
                                                      "created_utc": 1744676724.0,
                                                      "replies": []
                                                    },
                                                    {
                                                      "id": "mn7jx98",
                                                      "author": "alidan",
                                                      "body": "he is barely getting 60fps with dlss pulling from 1080p much less 1440 and you think 4k, when 1440 was pushing into the 30's would be MORE playable?",
                                                      "score": 0,
                                                      "created_utc": 1744712081.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mmqcuha",
                  "author": "soulsoda",
                  "body": "Technically, we're there for a price. You can get 30 fps natively on cyberpunk with full ray tracing @4k with a 5090. \n\nI disagree on the need to forgo upscaling. Its usually a significantly better gaming experience overall especially on the more modern cards as it's been fine tuned. In some cases, dlss quality looks better than native rendering. It'll also continue to get better every generation. \n\n\n\nId rather upscale and game at 4k 240hz with dlss quality and sharpness cranked up (and 0 dsc) than native 4k at 30hz.",
                  "score": 4,
                  "created_utc": 1744465489.0,
                  "replies": []
                },
                {
                  "id": "mmrarst",
                  "author": "gramathy",
                  "body": "A high end PC can do most games in 4k60, except maybe some of the absolute most demanding stuff.",
                  "score": 3,
                  "created_utc": 1744476453.0,
                  "replies": [
                    {
                      "id": "mmsayg1",
                      "author": "MargielaFella",
                      "body": "Hence the “few use cases”",
                      "score": 1,
                      "created_utc": 1744487994.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mms9zyv",
                  "author": "redline83",
                  "body": "PCs have been able to for years.",
                  "score": 3,
                  "created_utc": 1744487675.0,
                  "replies": [
                    {
                      "id": "mmtmspn",
                      "author": "dwiedenau2",
                      "body": "Lmao, no bro, the time of natively rendering at 4k and high details is over and wont return. Especially now that some games force you to use raytracing.",
                      "score": 3,
                      "created_utc": 1744505308.0,
                      "replies": [
                        {
                          "id": "mmzngq1",
                          "author": "Malefectra",
                          "body": "Ray tracing doesn’t have anything to do with internal render resolution. Many PC games usually have a setting for that, and the one you’re erroneously referring to is actually frame generation and frame scaling such as DLSS.",
                          "score": 1,
                          "created_utc": 1744592989.0,
                          "replies": [
                            {
                              "id": "mn0nczm",
                              "author": "dwiedenau2",
                              "body": "Which is my point, you cant run these games at native resolution.",
                              "score": 0,
                              "created_utc": 1744609181.0,
                              "replies": [
                                {
                                  "id": "mn1mask",
                                  "author": "Malefectra",
                                  "body": "No, most can on PC. DLSS is an option you can use, not mandatory. I run plenty of modern release games at native 4k and have since like 2018 with a GTX 1080ti.",
                                  "score": 1,
                                  "created_utc": 1744630198.0,
                                  "replies": [
                                    {
                                      "id": "mn1qr7t",
                                      "author": "dwiedenau2",
                                      "body": "It is mandatory if you are forced to use ray tracing and want to run at 4k. And this will not change again in the future. You are not running 4k raytracing at high fps without dlss. This time is over, no matter how much you spend.",
                                      "score": 0,
                                      "created_utc": 1744632217.0,
                                      "replies": [
                                        {
                                          "id": "mn1sete",
                                          "author": "Malefectra",
                                          "body": "Explain to me how this works, because I have plenty of games from the last 3 years... Not a single one of them requires that DLSS, frame generation, or resolution scaling enabled to enable Raytracing.  What is forcing those things to be in use? Also what about AMD users who's systems don't support DLSS since that's an Nvidia specific framework?",
                                          "score": 1,
                                          "created_utc": 1744632924.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mmq7lbi",
                  "author": "Nickelnuts",
                  "body": "Or how bout supporting ultrawide. I'm sick of looking at Master Chiefs thiccc stretched out ass",
                  "score": 5,
                  "created_utc": 1744463551.0,
                  "replies": []
                },
                {
                  "id": "mmrlgt4",
                  "author": "leastlol",
                  "body": "There's more to PCs than just video games. An 8k display at 40 inches would be ideal for me, I think. That'd be 220 PPI and around 120 PPD at ~28 inches away from the display. For Windows probably a bit overkill since it does scaling more sensibly but for MacOS you'd want to hit that 220ppi to avoid fractional scaling.\n\nFor context, I use a 4k 42 inch OLED TV as a display currently. That's 105PPI and 58PPD at ~28 inches away and I view it from as close as 24 inches. At Native resolution, the UI looks alright, but pixels are very plainly visible. I actually scale it to around 3200x1800 which allows for HiDPI mode to be active on MacOS with BetterDisplay, which renders it at double the resolution and scales down to fit 4k. It's sharper, but not as sharp as it could be if it were a 2x scaling.\n\nOther advantages it has over 6k or 5k displays made for MacOS is that it 4k and 1080p content have integer scaling when viewed at full screen.\n\nI also kind of wonder if an 8k 77 inch display viewed from normal tv viewing distances would make for a good display?\n\nIn any case, 4k is certainly large enough for most content people are consuming like video games and tv shows and the 160ish PPI of some of these 27 inch displays is more than sharp enough with Windows' scaling modes, but that doesn't suit my wants and/or needs.",
                  "score": 2,
                  "created_utc": 1744479673.0,
                  "replies": []
                },
                {
                  "id": "mmsi6yh",
                  "author": "mjtwelve",
                  "body": "They developed 8k displays before they even developed an *interface spec* that would allow us to send that much data to the display in question at speeds higher than a slide show, much less graphics cards that could create those frames.",
                  "score": 1,
                  "created_utc": 1744490406.0,
                  "replies": []
                },
                {
                  "id": "mmta6cz",
                  "author": "eyelidgeckos",
                  "body": "I am playing horizon forbidden west on my Samsung 8k 75“ right now at a distance of 2 meters, you definitely see a difference and it’s awesome but nowhere near anything sensible when it comes to the cost of the entire rig 😅",
                  "score": 1,
                  "created_utc": 1744500422.0,
                  "replies": []
                },
                {
                  "id": "mmsu30r",
                  "author": "SkyyOtter",
                  "body": "Upscaling has made devs too lazy to optimize. We should be able to by now.",
                  "score": -1,
                  "created_utc": 1744494486.0,
                  "replies": [
                    {
                      "id": "mmzo8ii",
                      "author": "Malefectra",
                      "body": "You realize that upscaling has been the norm on console since the sixth generation of consoles in 1999 before basic 720p or 1080p HD was the Over-The-Air TV resolution standard, right? Hell, the Nintendo 64 made extensive use of it because 3D used to be so processing intensive.",
                      "score": 2,
                      "created_utc": 1744593289.0,
                      "replies": [
                        {
                          "id": "mmzug6j",
                          "author": "SkyyOtter",
                          "body": "You realize I'm talking about AI upscaling, such as DLSS and FSR, right? It's not the same.",
                          "score": 0,
                          "created_utc": 1744595734.0,
                          "replies": [
                            {
                              "id": "mn01ots",
                              "author": "Malefectra",
                              "body": "Nah, it’s still largely the same thing. Rendering frames at a much smaller internal resolution than the displayed resolution with an algorithm filling in the details. The only major difference is marketing and tailoring a small portion of the GPU die for that compute load. Systems have never been more common and thus easier to optimize for, but the optimization problem really comes down to “management decisions” AKA executive meddling, not developers themselves.",
                              "score": 1,
                              "created_utc": 1744598655.0,
                              "replies": [
                                {
                                  "id": "mn0340a",
                                  "author": "SkyyOtter",
                                  "body": "Except it isn't the same. It doesn't even work the same at all. Not the slightest.",
                                  "score": 0,
                                  "created_utc": 1744599258.0,
                                  "replies": [
                                    {
                                      "id": "mn1n2qc",
                                      "author": "Malefectra",
                                      "body": "It’s the same supersampling shit we’ve had for ages with a fancier algorithm behind it. You’re buying into the AI/machine learning hype.",
                                      "score": 1,
                                      "created_utc": 1744630564.0,
                                      "replies": [
                                        {
                                          "id": "mn31of8",
                                          "author": "SkyyOtter",
                                          "body": "Not buying into any hype. It's nowhere near the same. It looks bad. Newer games just look like someone smeared Vaseline all over the screen with horrible ghosting when you turn it on. And yet, trogs like you sit here and defend it, when it shouldn't be a requirement in the first place. I'm not entertaining your stupidity any longer. Ignored my entire point so you can puke up whatever garbage nonsense to make you look smart.",
                                          "score": 0,
                                          "created_utc": 1744647924.0,
                                          "replies": [
                                            {
                                              "id": "mn4cph3",
                                              "author": "Malefectra",
                                              "body": "That sounds like you have a shitty display that uses one of the old \"Motion 120\" or equivalent feature and you never bothered to turn it off because that would require picking up a manual, reading a screen, or otherwise learning how to operate your systems and attached devices correctly.",
                                              "score": 1,
                                              "created_utc": 1744661935.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mmpo3tz",
                  "author": "alvenestthol",
                  "body": "4K is mainly for video, which anything with a 4K video-out can natively output, games targeting that resolution with/without upscaling is just a side effect\n\nAnd there will always be games that choose to target more intense graphical effects over maintaining native 4K...",
                  "score": -9,
                  "created_utc": 1744454461.0,
                  "replies": []
                },
                {
                  "id": "mmpnhg5",
                  "author": "newhereok",
                  "body": "4k natively is pretty easy for most pc's though. The tech around it is getting better and heavier which makes it more difficult. But if you want, almost anything can be played at 4k",
                  "score": -17,
                  "created_utc": 1744454091.0,
                  "replies": [
                    {
                      "id": "mmpr367",
                      "author": "Alloy202",
                      "body": "Errrrr, very, very no.  4K native at playable frames and acceptable image quality pushes even the highest spec PC's with modern titles. Will most pcs show 4k as an option? Sure, as long as your monitor also supports it which honestly very few pc enthusiasts would have over 1440p, at least the ones that know what they are doing. But the experience at 4k over 1440p is simply not worth it on 99% of modern gaming PC set ups.",
                      "score": 11,
                      "created_utc": 1744456121.0,
                      "replies": [
                        {
                          "id": "mmps2y5",
                          "author": "drmirage809",
                          "body": "Can confirm, am a PC enthusiast and rock a 1440p ultrawide as my monitor. Got an awesome deal on a Samsung WD-OLED panel and I never want anything else. \n\nIt allows me to comfortably play a lotta games without upscaling or even with DLAA (Nvidia’s upscaling tech, just without actually upscaling). Still find myself mostly turning on DLSS on quality mode though. Looks just as good if not better than native with the game’s TAA to my eyes and it keeps the fans a bit more quiet.",
                          "score": 5,
                          "created_utc": 1744456647.0,
                          "replies": []
                        },
                        {
                          "id": "mmq6vwr",
                          "author": "newhereok",
                          "body": "Acceptable image quality is the difference here. I'm with you 4k is the max needed and 1440P is good for most, but there is a choice not to play shit on 4k, and that choice just changes with the technology that is available. Which is totally understandable, but the notion that 4k isn't possible isn't true",
                          "score": 2,
                          "created_utc": 1744463279.0,
                          "replies": [
                            {
                              "id": "mmq9mx8",
                              "author": "Alloy202",
                              "body": "I'm not saying it's not possible. You just give up too much in performance or image quality to get there when compared to 1440p. It's typically not worth the trade off with modern titles.",
                              "score": 2,
                              "created_utc": 1744464322.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mmpphvo",
                      "author": "MargielaFella",
                      "body": "You really gotta dial your settings down on low or mid end hardware to push native 4K on modern games. \n\nI should clarify, I mean uncompromised 4K.",
                      "score": 4,
                      "created_utc": 1744455250.0,
                      "replies": [
                        {
                          "id": "mmpq3c4",
                          "author": "None",
                          "body": "Only if by 'uncompromised 4k' you mean with ray tracing and 100+ fps. Lots of GPUs can do native 4k at 60+ if you don't include ray tracing.",
                          "score": -5,
                          "created_utc": 1744455583.0,
                          "replies": [
                            {
                              "id": "mmpqvvk",
                              "author": "MargielaFella",
                              "body": "Lots of GPUs aren’t doing native 4K 60 even without Ray tracing tbh. \n\nThe most popular GPU on steam is a 4060. I’ll be shocked if you can find me a modern AAA game that can run on it at native 4K 60, even without RT.",
                              "score": 6,
                              "created_utc": 1744456012.0,
                              "replies": [
                                {
                                  "id": "mmprbzb",
                                  "author": "None",
                                  "body": "The RX 9070 and 9070 xt and anything in and around that power can. Yes, the 4060 might be the most popular GPU but pretty much anything stronger than it can reliably do 4k60.",
                                  "score": -2,
                                  "created_utc": 1744456252.0,
                                  "replies": [
                                    {
                                      "id": "mmpsd74",
                                      "author": "MargielaFella",
                                      "body": "I own a 4070 and can assure you I’m not getting native 4K 60 on any modern AAA game. \n\n9070 and 9070xt are high end cards, far from “lots of GPUs.”",
                                      "score": 5,
                                      "created_utc": 1744456795.0,
                                      "replies": [
                                        {
                                          "id": "mmq80uj",
                                          "author": "newhereok",
                                          "body": "Yes you can, you just turn off a bunch of shit. I know that isn't preferred, but you certainly can.",
                                          "score": -3,
                                          "created_utc": 1744463713.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mmpl3ed",
              "author": "chrisking345",
              "body": "I’d be happier if they began fixing TV UI’s. They are inherently terrible.",
              "score": 38,
              "created_utc": 1744452625.0,
              "replies": [
                {
                  "id": "mmpllit",
                  "author": "drmirage809",
                  "body": "Oh yeah. How can it be that none of them have a UI that doesn’t make me want to immediately hook up a Chromecast or Apple TV box? Like, how hard is it to make things at least feel smooth and snappy?",
                  "score": 20,
                  "created_utc": 1744452940.0,
                  "replies": []
                },
                {
                  "id": "mmqhei7",
                  "author": "Eruannster",
                  "body": "They have always been terrible and will probably continue to be. They are less terrible than they used to be (remember smart TV UIs from the early 2010s? Ooof!) but still not... you know... good.\n\n\nThe issue is that the TV manufacturing industry has no longevity built in to their products. 2025 TVs are out, drop support for the 2024 model! 2026 models are out, drop support for the 2025 model! And so on. \n\n\nI highly recommend getting a separate media player like an Nvidia Shield or Apple TV. They are still getting updates, even for models that came out in like ~2015.",
                  "score": 11,
                  "created_utc": 1744467040.0,
                  "replies": []
                },
                {
                  "id": "mmpqlib",
                  "author": "iCowboy",
                  "body": "Yes - this a thousand times! Every now and then I forget to have my Apple TV powered on when turn on the television and there it is - Sony’s hideous, sluggish, craptacular interface. How this shit gets out of the lab is a genuine mystery.",
                  "score": 7,
                  "created_utc": 1744455858.0,
                  "replies": [
                    {
                      "id": "mmq0rsi",
                      "author": "Darkhoof",
                      "body": "Sony uses Google TV what the hell are you talking about?",
                      "score": 2,
                      "created_utc": 1744460764.0,
                      "replies": [
                        {
                          "id": "mmqd2kp",
                          "author": "A_Rod_H",
                          "body": "They could be referring to the old Bravia interface shared with the PlayStation",
                          "score": 3,
                          "created_utc": 1744465566.0,
                          "replies": [
                            {
                              "id": "mmrea5s",
                              "author": "fullmetaljackass",
                              "body": "Their Google TV performance definitely varies between models. The previous owners of the house I recently moved into left behind a Sony TV, and it's the first TV I actually don't mind using the smart features on. Aside from having to replace the stock launcher with an ad free one and it's been a pretty great experience. Everything is stable, smooth, and responsive. \n\nMy friend was recently gifted a Sony TV of similar vintage. It has the same UI as mine, but it is the usual laggy mess you'd expect from a smart TV.",
                              "score": 1,
                              "created_utc": 1744477517.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mn1le67",
                          "author": "Shadow647",
                          "body": "Are you implying that Google TV provides a good user experience?",
                          "score": 1,
                          "created_utc": 1744629767.0,
                          "replies": []
                        },
                        {
                          "id": "mmsi0l5",
                          "author": "cape2cape",
                          "body": "Google tv is sluggish, hideous, and craptacular.",
                          "score": 0,
                          "created_utc": 1744490348.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mmpohxd",
                  "author": "qtx",
                  "body": "That's why I only buy TVs with GoogleTV as their OS.",
                  "score": -5,
                  "created_utc": 1744454685.0,
                  "replies": [
                    {
                      "id": "mmq11er",
                      "author": "Stingray88",
                      "body": "It’s why I only buy TVs where I never have to see the interface at all and just use an AppleTV instead.",
                      "score": 5,
                      "created_utc": 1744460880.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mmpl97b",
              "author": "sioux612",
              "body": "Or just software that isn't actively making the experience worse \n\n\nThere is a very limited set of functions a TV has to fulfill. I tend to configure my TV in a way that it doesn't have to actually do much (hdmi input, no color change, no upscaling, no motion smoothing, no ai stuff). But somehow my Samsung TV still manages to stutter and sometimes crash during normal operation",
              "score": 31,
              "created_utc": 1744452729.0,
              "replies": [
                {
                  "id": "mmqqnzf",
                  "author": "edcrosay",
                  "body": "Buy commercial grade displays.  Samsung business line doesn’t have a super shit OS and you never need to see it.  They are quite a bit more expensive though.  I use these a lot at work.  No smart apps, just a TV that works.\n\nhttps://www.samsung.com/us/business/displays/4k-uhd/qm-series/qmc-series-65-lh65qmcebgcxgo/",
                  "score": 2,
                  "created_utc": 1744470107.0,
                  "replies": [
                    {
                      "id": "mmri8xu",
                      "author": "notjordansime",
                      "body": "Damn, I really wish I’d seen this ~4 months ago. We got a consumer display and the “smart” stuff drives me absolutely crazy. \n\nI tried looking at commercial displays but I could only find offerings from companies like NEC for like $5,000. \n\n[ just adding this so I can use a tool to search for this comment later.. Samsung Commercial TV Reddit ]",
                      "score": 2,
                      "created_utc": 1744478697.0,
                      "replies": [
                        {
                          "id": "mmry6jd",
                          "author": "TooStrangeForWeird",
                          "body": "https://www.walmart.com/ip/Sceptre-50-Class-4K-UHD-LED-TV-U515CV-U/44829924\n\nI've been thinking about this one. Maybe a size up. Dumb TVs are the way to go! Less points of failure too.\n\nhttps://www.walmart.com/ip/Sceptre-75-Class-4K-UHD-LED-TV-HDR-U750CV-U/55427162\n\nI couldn't hardly fit this in my living room, I'd need a mount with an extended arm. But it would be pretty cool!",
                          "score": 1,
                          "created_utc": 1744483723.0,
                          "replies": []
                        },
                        {
                          "id": "mms1q2i",
                          "author": "tastyratz",
                          "body": "Then... don't use it. If you just plug something into an HDMI port what the tv has natively in it's UI is nearly irrelevant.",
                          "score": 1,
                          "created_utc": 1744484911.0,
                          "replies": [
                            {
                              "id": "mms75fm",
                              "author": "notjordansime",
                              "body": "It auto plays Samsung TV plus garbage whenever the Apple TV times out :(",
                              "score": 1,
                              "created_utc": 1744486732.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mn34iij",
                      "author": "ureil",
                      "body": "holy shit thank you so much i never thought to look for this.  this has been my biggest complaint with tvs for the past 10+ years. like if I already have a HTPC I don't need poorly optimized software competing with it and slowing my tv down",
                      "score": 2,
                      "created_utc": 1744648789.0,
                      "replies": []
                    },
                    {
                      "id": "mmv6tng",
                      "author": "sioux612",
                      "body": "Will check those out, I don't care about price if the improvement is noteable",
                      "score": 1,
                      "created_utc": 1744532621.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mmpozq8",
                  "author": "nicuramar",
                  "body": "> There is a very limited set of functions a TV has to fulfill\n\nFor you. But other people use it for things like Netflix and YouTube as well.\n\nI’m not sure what “no color change” means, as the TV obviously has to do processing to the input signal to match the physics of the display. ",
                  "score": -11,
                  "created_utc": 1744454966.0,
                  "replies": [
                    {
                      "id": "mmpukri",
                      "author": "sioux612",
                      "body": "Yeah, so how is the TV supposed to run an app, decrypt the Netflix drm, and then do the functions it fails at even when it doesn't have the extra load",
                      "score": 6,
                      "created_utc": 1744457921.0,
                      "replies": []
                    },
                    {
                      "id": "mmpsvg4",
                      "author": "MDCCCLV",
                      "body": "They're talking about the settings where you can change the color tone quite a bit.",
                      "score": 1,
                      "created_utc": 1744457059.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mmq3bnb",
              "author": "Killbot_Wants_Hug",
              "body": "I've been chasing resolution ever since I got into computers in the 90's.\n\nWhen the standard was a 13\" to 15\" monitor, I was paying for a 17\". Then when I had a little more money I paid hundreds for a Sony Trinitron that could do 1600x1200 back when 800x600 was the norm. When 1080p was the standard I paid I about $1200 for a Dell UltraSharp U3011 that could do 2560x1600.\n\nWhen I went 4k I did a quadruple setup with three 26\" monitors with g-sync and a 65\" TV, it took a triple Titan X setup and a custom water cooling loop to drive it without sound like a plane was taking off (that system drew enough power that it could trip my circuit breaker).\n\nI'm saying all this to prove I've always chased resolution and I've been willing to spend a ton of money on it.\n\nI've never once put any serious thoughts into an 8k setup. I just see no realistic gains over 4k. Sure if I'm really close to a 65\" 4k TV and I look really close at a still image I can see pixels. But in practice that never matters. I can read small text off 4k monitors and 8k monitors don't really look better to my eye.\n\nThe only practical thing I can see for 8k monitors is if you need to work with a lot of 4k streams all the time. It lets you view multiple on one screen without shrinking them. But aside from that I can hardly think of a use case.",
              "score": 12,
              "created_utc": 1744461853.0,
              "replies": []
            },
            {
              "id": "mmq2str",
              "author": "Last_Replacement_386",
              "body": "Honestly most people are streaming and they're lucky to get 1080p on a good day.",
              "score": 9,
              "created_utc": 1744461635.0,
              "replies": []
            },
            {
              "id": "mmq9zub",
              "author": "hyperforms9988",
              "body": "It depends on the size of the screen.  1080p on a 30 inch TV looks different versus a 60 inch TV.  The limitations of the resolution are more noticeable as the screen size increases.  These things were 75 and 85 inches.  I'm willing to bet 4K still looks really good at that size, but the bigger you make the screens, the more noticeable a bump in resolution like that becomes.  For people with the space and a real desire to have a huge home theater setup... I can see it, but that strikes me as being too niche of a market to get the entire entertainment industry to shift to making content in 8K.  This was pure cart-before-horse.",
              "score": 5,
              "created_utc": 1744464457.0,
              "replies": [
                {
                  "id": "mmqfh0y",
                  "author": "Millennial_Man",
                  "body": "I doubt most people would be able to see a difference between 4K and 8K if they were sitting far enough away to see the whole screen.",
                  "score": 2,
                  "created_utc": 1744466388.0,
                  "replies": [
                    {
                      "id": "mmrr920",
                      "author": "JS-87",
                      "body": "If you talk to any PC gamer on reddit they'll argue til they're blue in the face that 8k is the bare minimum to play any game today.",
                      "score": 0,
                      "created_utc": 1744481465.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mmq6243",
              "author": "stabsomebody",
              "body": "Get led and oled tvs to handle motion like plasmas with no judder and no soap opera motion smoothing and then worry about higher resolution. I still prefer the look of a plasma over any modern TV I’ve seen.",
              "score": 3,
              "created_utc": 1744462953.0,
              "replies": []
            },
            {
              "id": "mmq9flb",
              "author": "koolaidismything",
              "body": "Plus bandwidth.. 8k is just overkill at the moment.",
              "score": 3,
              "created_utc": 1744464246.0,
              "replies": [
                {
                  "id": "mmt1yg1",
                  "author": "SpehlingAirer",
                  "body": "Absolutely. We're just not there yet from a technical standpoint. It's only relatively recently that 4k became a standard in media, and most games can't smoothly run at 4k yet either. Like you said, 8k is just overkill.",
                  "score": 2,
                  "created_utc": 1744497337.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mmqgrb7",
              "author": "UnTides",
              "body": "Viewing angle is important too",
              "score": 3,
              "created_utc": 1744466822.0,
              "replies": []
            },
            {
              "id": "mmpqlod",
              "author": "pieter1234569",
              "body": "They pretty much did that already. There isn’t THAT much to improve anymore. And it’s also something that consumers can’t really understand.\n\nEveryone understands that 8k is bigger than 4K. But when you have to compare the name oped, qled, miniled, etc, which one is better?",
              "score": 2,
              "created_utc": 1744455861.0,
              "replies": []
            },
            {
              "id": "mmrzgrr",
              "author": "XuX24",
              "body": "Also we need a better streaming compression that gives us better picture quality and audio quality. If they manage to get better bitrate in streaming that comes closer to bluray then we are talking. If we are not able to do any of this why even bother with 8k.",
              "score": 2,
              "created_utc": 1744484148.0,
              "replies": []
            },
            {
              "id": "mmpwrqf",
              "author": "bobbster574",
              "body": "I find it completely insane that some people think 8K will offer any actual benefit to them. \n\nEven the largest (digital) IMAX cinema screens are 4K and they look stunning and sharp.",
              "score": 4,
              "created_utc": 1744458964.0,
              "replies": []
            },
            {
              "id": "mmpkzfd",
              "author": "xdert",
              "body": "> Indeed. 4K is already pretty much perfect, doubly so at the distance most people sit from their TV. There’s no real added value in adding in even more pixels.\n\nI mean the benefit is that you can have a bigger screen while maintaining clarity.",
              "score": 4,
              "created_utc": 1744452558.0,
              "replies": [
                {
                  "id": "mmpprbw",
                  "author": "Rage_Like_Nic_Cage",
                  "body": "You have to have a *really* big TV and/or have to be sitting very close to notice an increase in clarity from 4k to 8k. In real-world applications, there just isnn’t many use cases",
                  "score": 13,
                  "created_utc": 1744455397.0,
                  "replies": [
                    {
                      "id": "mmpsxab",
                      "author": "MDCCCLV",
                      "body": "That's really not true.",
                      "score": -7,
                      "created_utc": 1744457087.0,
                      "replies": [
                        {
                          "id": "mmpusag",
                          "author": "Rage_Like_Nic_Cage",
                          "body": "[Its not just me saying it](https://www.techjunkie.com/tv-screen-size-calculator/). And while [different articles](https://www.rgb.com/display-size-resolution-and-ideal-viewing-distance) may have slightly [different viewing distance/size ratios](https://www.mathscinotes.com/2015/01/television-resolution/). They all basically show that unless you’re sitting 5 feet or less in front of a 80” screen, you’re not gonna get the benefits of 8k. \n\nMost people don’t even have the room for an 80” tv, let alone setting their couch 5’ infront of it.",
                          "score": 12,
                          "created_utc": 1744458024.0,
                          "replies": [
                            {
                              "id": "mmpxded",
                              "author": "Small_Editor_3693",
                              "body": "All these articles are just trying to match the pixels per degree for each resolution which is pretty useless. People are using 5 or 6k monitors that are over 100 PPD. If you want that kind of sharpness you have to go 8k",
                              "score": -8,
                              "created_utc": 1744459243.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mmpth2f",
                          "author": "thewavefixation",
                          "body": "Riveting rebuttal - wait- it wasn't.",
                          "score": 5,
                          "created_utc": 1744457366.0,
                          "replies": [
                            {
                              "id": "mmpxg8z",
                              "author": "Small_Editor_3693",
                              "body": "It’s not a rebuttal to say someone is saying something false.",
                              "score": -7,
                              "created_utc": 1744459280.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mmpxmgx",
                      "author": "Small_Editor_3693",
                      "body": "So is an 80 inch screen not real world? A 120 inch projector? Are these just unfathomable to you?",
                      "score": -13,
                      "created_utc": 1744459359.0,
                      "replies": [
                        {
                          "id": "mmpycji",
                          "author": "Rage_Like_Nic_Cage",
                          "body": "you seem to be oddly hostile for me simply stating that most people in the real world aren’t sitting a mere 5’ away from an 80” tv lol",
                          "score": 11,
                          "created_utc": 1744459687.0,
                          "replies": [
                            {
                              "id": "mmq017x",
                              "author": "Small_Editor_3693",
                              "body": "You were extremely hostile calling people’s lived experiences not “real-world”.",
                              "score": -9,
                              "created_utc": 1744460439.0,
                              "replies": [
                                {
                                  "id": "mmq4qav",
                                  "author": "None",
                                  "body": "[removed]",
                                  "score": 9,
                                  "created_utc": 1744462424.0,
                                  "replies": [
                                    {
                                      "id": "mmq7v7t",
                                      "author": "Small_Editor_3693",
                                      "body": "Most people have an 80 inch screen or a 120 inch projector. To say they don’t is simple hate speech.",
                                      "score": -7,
                                      "created_utc": 1744463654.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mmpt616",
              "author": "christoskal",
              "body": "But color accuracy is pretty much perfect now, HDR works amazingly and OLED burn in is a thing of the past for most users. Even brightness levels are ok now and the average sound quality isn't as shit as it used to be. \n\nThat's the issue, they were running out of things to improve so they tried with 8K tvs. \n\nThe only part that still needs improving is audio quality but all TV companies also sell soundbars so I doubt they'll ever start improving that one too much",
              "score": 2,
              "created_utc": 1744457211.0,
              "replies": [
                {
                  "id": "mmqiq8j",
                  "author": "Eruannster",
                  "body": "Weeeeell... color accuracy depends a lot. Some brands (Sony, Panasonic) do extremely well out of the box with minimal tinkering. LG and Samsung are pretty decent, but still like to crank the contrast a bit (though you can get pretty close with Filmmaker modes and a quick trip to the settings menu, but most users will still opt for \"standard\" modes out of the box which are not particularly accurate).",
                  "score": 3,
                  "created_utc": 1744467484.0,
                  "replies": []
                },
                {
                  "id": "mmpz1sg",
                  "author": "CeldonShooper",
                  "body": "They are running out of ways to innovate. Plain and simple.",
                  "score": 1,
                  "created_utc": 1744460000.0,
                  "replies": []
                },
                {
                  "id": "mmsmew9",
                  "author": "TheNorthComesWithMe",
                  "body": "8K actually came up in parallel with HDR and OLED developments. Display manufacturers kept making more pixels just because they could.",
                  "score": 1,
                  "created_utc": 1744491817.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mmr1bi8",
              "author": "Ok-disaster2022",
              "body": "Micro led may be getting some breakthroughs soon.",
              "score": 1,
              "created_utc": 1744473483.0,
              "replies": []
            },
            {
              "id": "mmrxk74",
              "author": "Interesting_Reach_29",
              "body": " Yes! Especially for artists and gamers!",
              "score": 1,
              "created_utc": 1744483518.0,
              "replies": []
            },
            {
              "id": "mmt080n",
              "author": "K_Linkmaster",
              "body": "Isn't a good part of that the bluray reader and what messages it sends? I did some reading on players a while back, but retained little.",
              "score": 1,
              "created_utc": 1744496692.0,
              "replies": []
            },
            {
              "id": "mmt83kt",
              "author": "yepthisismyusername",
              "body": "THANK YOU! That's what I've been feeling ever since 4K came out. For home TV, it is 100% perfect, and even better than real life. There is less than zero need for an 8K TV in the home (except bragging rights).",
              "score": 1,
              "created_utc": 1744499660.0,
              "replies": []
            },
            {
              "id": "mmtdiil",
              "author": "Worst_Username_Evar",
              "body": "That’s what they are doing, and have been doing.",
              "score": 1,
              "created_utc": 1744501678.0,
              "replies": []
            },
            {
              "id": "mmva2sm",
              "author": "Particular_Treat1262",
              "body": "Eh, I could imagine colour accuracy being branded under something like ‘colour tech’ enhanced and people would jump to it like they would 8k \n\nNice, flashy words have been the consumers wet dream for centuries, I see no reason to stop now",
              "score": 1,
              "created_utc": 1744534753.0,
              "replies": []
            },
            {
              "id": "mmwii2q",
              "author": "NecroCannon",
              "body": "I hate that innovation became cramming as much marketing terms into a device as possible rather than just making the best product in its category.\n\nSo many shitty TVs with terrible chips, terrible UIs, iffy quality, and barely lasts. You want to milk data from consumers for more money? Why not make a device that lasts long enough that you don’t have to worry about them going to another competitor in like a year or two at these prices.",
              "score": 1,
              "created_utc": 1744555585.0,
              "replies": []
            },
            {
              "id": "mmz39fs",
              "author": "Oops_I_Cracked",
              "body": "Ya we have definitely passed the point of diminishing returns on pixel density for TVs. Until there is another major shift in the size of TV people buy (like the CRT to plasma/lcd shift), R&D dollars are way better spent on improving color accuracy, black levels, making things like OLED and high quality QLED more affordable, etc.",
              "score": 1,
              "created_utc": 1744585381.0,
              "replies": []
            },
            {
              "id": "mn1ag8t",
              "author": "CoastingUphill",
              "body": "Most of my content is still in 1080p. Most streamed content is still 1080p. I have a 1080p tv and a 4K tv and that content looks the same on them.",
              "score": 1,
              "created_utc": 1744623707.0,
              "replies": []
            },
            {
              "id": "mmqrilx",
              "author": "Vietzomb",
              "body": "> 4K is already pretty much perfect, doubly so at the distance most people sit from their TV.\n\nThough it’s *definitely* more true for 4K, it’s funny because people used to say this about 1080p when those TV’s were still costing an average $2800+ for 42inches.\n\nI remember the phrasing “your eyes can’t even process any higher resolution” or some variation, I can’t remember the justification for that statement in detail.",
              "score": 1,
              "created_utc": 1744470381.0,
              "replies": []
            },
            {
              "id": "mmqw6bn",
              "author": "_off_piste_",
              "body": "I disagree. I’ve seen 8k content on many occasions and it’s always noticeably better than 4K to my eyes (people like my father can’t seem to tell). Is 4k great and the best option right now? Absolutely, due to cost, transmission bandwidth, and extremely limited content (and cost has been coming down). The other things you talk about are constantly being worked on anyway and are not mutually exclusive issues. Contrast ratio is the main non-resolution advancement I look for improvement.",
              "score": 1,
              "created_utc": 1744471886.0,
              "replies": []
            },
            {
              "id": "mmr5ixw",
              "author": "Rebuttlah",
              "body": "1440p for gaming monitors, 4k for big screen tv's or projectors, but only if you're actually far enough away.\n\nThe human eye literally can not tell the difference up close.",
              "score": 0,
              "created_utc": 1744474806.0,
              "replies": []
            },
            {
              "id": "mmrhfzk",
              "author": "notjordansime",
              "body": "I switched my Netflix to 1080p and I’ll be honest, I didn’t notice a difference. I didn’t tell anyone else in my family about the switch for about 2 weeks, and my folks were surprised that they couldn’t tell the difference either. \n\nWhen we bought our new TV at the beginning of the year, I told the sales rep we were 100% fine with 1080p. He was adamant that it would look terrible, and told us they straight up didn’t make TVs at 1080p in large sizes like 75 inches. I was quite disappointed to find out he was right. I’m not sitting 5 feet away from a display that large. Our couch and recliners are ~10 feet back. Even 4K doesn’t make sense to me.\n\nThe only instances where 4K makes a noticeable difference to me are laptop displays, computer monitors, and tablets. You know.. stuff at arm’s length.",
              "score": 0,
              "created_utc": 1744478457.0,
              "replies": [
                {
                  "id": "mmruqlc",
                  "author": "3-DMan",
                  "body": "HDR I think makes a bigger difference, especially DolbyVision.",
                  "score": 2,
                  "created_utc": 1744482595.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mmrqhvu",
              "author": "Jakoneitor",
              "body": "Honest question: \n\nPeople used to say the same thing when we jumped from 1080p to 4k. Why would it be different now?",
              "score": 0,
              "created_utc": 1744481223.0,
              "replies": []
            },
            {
              "id": "mmprdan",
              "author": "Fredasa",
              "body": "I find it a shame, personally.  I use a 4K TV as my monitor and people like me are steadily increasing in number.  I'd like to have seen a 6K standard to fill the gap.  I can live without it but there's certainly no getting around the fact that 4K as 55 inches from 2.5 feet is not \"retina.\"\n\nAnother thing is that with 8K off the plate, there's even less incentive for anyone making GPUs or console hardware to get their act together and push rasterization to a point where it can meaningfully support >4K resolutions.  This means that good VR is also on hold.",
              "score": -3,
              "created_utc": 1744456271.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmpn64w",
          "author": "BigCommieMachine",
          "body": "The issue is a pretty sure the size of TV’s have pretty much maxed that will fit in most homes. Most people seem to be pretty content in the 55-65” sweet spot with 42” being good for a smaller place/2nd TV and more serious entertainment setup settling in the 77-83” range. Which is we’ve seen the push for OLED,MiniLED, 120Hz, VRR…etc. People are FINALLY happy with the size of TVs, so we’ve turn to looking at image quality.\n\n4K was pretty much a response to not so much a need for more visual fidelity as it was when prices on bigger panels fell, 1080p doesn’t look so hot on an 80” TV. I mean NFL games are often in 720p and they just look AWFUL on a big 4K display.\n\nSo the use cases for 8K displays really only fall into 2 buckets IMO: Either you are going for a HUGE display, in which case, you are going to use a projector or multi-panel setup. Or you do professional film work and you’ll still be able to buy a bespoke professional monitor for some ungodly amount to pixel peep.",
          "score": 30,
          "created_utc": 1744453900.0,
          "replies": [
            {
              "id": "mmppyho",
              "author": "elton_john_lennon",
              "body": "> Either you are going for a HUGE display,\n\nThat right there sums it up. \n\nFor 8K to make sense in a regular home, it would have to be twice as big as 4K was, given the same viewing distance. So if you had 60\" that means 120\" now, with 80\" ..well get your wallet ready for that 160\" that nobody is selling right now ;D \n\nTrying to sell 8K in previous 4K sizes of about 50-60\", means I would have to use that TV like a desk monitor, which completely defeats the purpose.",
              "score": 14,
              "created_utc": 1744455507.0,
              "replies": [
                {
                  "id": "mmq03jb",
                  "author": "xXNorthXx",
                  "body": "I’d like to see them get the price down on the multi-panel units or start looking at rolling units to handle the 100”+ sizes.\n\n100” 120hz oled 4k still looks great. \n\nBut what they really are running up against is diminishing returns. there was a glut of people buying tvs for the last 20 years between going to flat panels, atsc rollout, and significant improvements as resolution went from 720p to 1080p to larger tvs being cheap to buy.\n\nwhat’s left for new markets? The 100-150” when sets are available is slim pickings in residential but there will be some sales in commercial as they replace projectors for them. Sales volumes will be orders of magnitude lower so prices will be higher for them along with logistical issues….two guys trying to wall mount a 150” tv not really practical. The Wall works here but it’s cost prohibitive currently.",
                  "score": 3,
                  "created_utc": 1744460467.0,
                  "replies": []
                },
                {
                  "id": "mmpxx7m",
                  "author": "Small_Editor_3693",
                  "body": "A current 80 inch 4k is not sharp at all. Really getting to the fringe of 4k. Same as a 40 inch 1080p screen which look horrible",
                  "score": -8,
                  "created_utc": 1744459495.0,
                  "replies": [
                    {
                      "id": "mmpyl07",
                      "author": "elton_john_lennon",
                      "body": "> A current 80 inch 4k is not sharp at all.\n\nI don't think you understand what I'm saying. Resolution and screen size are only part of the equation. For it to make sense, you have to talk about it in context of viewing distance. 1080p might not be sharp even on 15\" if you are looking at it from a certain distance.",
                      "score": 8,
                      "created_utc": 1744459792.0,
                      "replies": [
                        {
                          "id": "mmpzrnx",
                          "author": "Small_Editor_3693",
                          "body": "Right and an 80 inch 4k screen doesn’t get sharp until 10+ feet away",
                          "score": -5,
                          "created_utc": 1744460322.0,
                          "replies": [
                            {
                              "id": "mmq21wc",
                              "author": "elton_john_lennon",
                              "body": "Yeah, and people aren't really buying 80\" to sit right in front of them, I don't think sitting closer than 10 feet from 80\" would even be comfortable to me. \n\nTo flats, apartments, and smaller rooms people mostly get around 60\", for which 4K is good enough. When I look at retail shops, 50-60\" category has most models available, so this is the most common screen size people buy, at lest in EU that is.",
                              "score": 6,
                              "created_utc": 1744461319.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mmrw1qm",
              "author": "CardboardJ",
              "body": "I think it's the content thing you mentioned. NFL is still mostly 720@60 because frame rates make it better than 1080@30. Get sports to start pushing 4k@60 and you might have a case for 8k some day, but today there's almost nothing to watch that even really makes 4k necessary.",
              "score": 3,
              "created_utc": 1744483022.0,
              "replies": [
                {
                  "id": "mmt1lwd",
                  "author": "BigCommieMachine",
                  "body": "Actually the NFL is a good case for 8K because I believe they are specifically using 8K Sony camera as part of the Hawkeye system to replace the chain gang.",
                  "score": 2,
                  "created_utc": 1744497207.0,
                  "replies": []
                },
                {
                  "id": "mmvzgh1",
                  "author": "_RADIANTSUN_",
                  "body": "Yea but the picture quality still looks like ass cuz of the bad resolution, that's the point, not that smoother motion isnt better, which ofc it is.",
                  "score": 1,
                  "created_utc": 1744548790.0,
                  "replies": [
                    {
                      "id": "mmwv0ti",
                      "author": "CardboardJ",
                      "body": "Ok but I'm going to argue that I have to stand like 2' from my 77\" 4k TV and squint to see pixels in 4k on a still image. If it's moving at 60 or 120 fps I'm just not going to be able to process that much with my brain meats. 8k will be cool someday for >100\" displays and slower content but I think we're bumping up against human limitations here.",
                      "score": 1,
                      "created_utc": 1744559523.0,
                      "replies": [
                        {
                          "id": "mmxybch",
                          "author": "_RADIANTSUN_",
                          "body": "Do you mean that on a 720p video source? Cuz these are just 2 completely separate aspects of video quality. \n\nI can absolutely see how dogshit 720p60 content looks on a big screen (85 inch MiniLED and 75 inch OLED) at the same time as seeing the motion is excellently smooth. \n\nYou're not going to \"see pixels\" because obviously practical scaling algorithms are much better than that. It's more about graininess/blurryness/noisiness/artifacting in the image. Like the 60fps is obviously good but it does nothing for the actual frame quality, it's still horrible on 720p scaled. Only thing that makes it bearable to me is that I still use the Nvidia Shield TV Pro 4K with its AI scaler.",
                          "score": 1,
                          "created_utc": 1744571764.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mn1h288",
              "author": "LooneyWabbit1",
              "body": "There's just not even any 8k content to watch, is there? No video game device outputs it, no media service streams it, I can't even find pirated 8k content on torrents. What the hell is there to even watch in 8k?",
              "score": 1,
              "created_utc": 1744627576.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmqdo9o",
          "author": "DazMR2",
          "body": "They would be great for passive 3D. The last time the TV industry tried 3D it was with 1080p and a choice of active or passive glasses. Active glasses are expensive and gave a lot of people headaches. Passive effectively reduces resolution by 50%.\n\n8K 3D would be cheap to implement with a high resolution image.",
          "score": 13,
          "created_utc": 1744465773.0,
          "replies": []
        },
        {
          "id": "mmplrkp",
          "author": "ComCypher",
          "body": "The main problem is that the pixel density is way overkill for any TV that will fit in a typical living room. You practically need a literal movie theater to benefit from that resolution.",
          "score": 21,
          "created_utc": 1744453042.0,
          "replies": [
            {
              "id": "mmr8bui",
              "author": "pagerussell",
              "body": "Even 4k is often irrelevant. I know the cutoff for 720 is about 40 inches, and for standard it's about 50 inches.\n\nBut 8k requires *a 90 inch TV to be noticeably different than 4k*.\n\nI know nobody who has a 90 inch TV. Not even sure I know many people with a reasonable place to mount a 90 inch TV",
              "score": 6,
              "created_utc": 1744475690.0,
              "replies": [
                {
                  "id": "mmxxap5",
                  "author": "moch1",
                  "body": "The size of the TV has nothing to do with discernible resolution. What matters is the Anglican reduction which is a function of seating distance and size. You’re not going to sit the same distance from a 32” and 90” TV so just using size is silly.\n\nThis chart is what you want:\nhttps://i.rtings.com/images/optimal-viewing-distance-television-graph-size.png",
                  "score": 1,
                  "created_utc": 1744571433.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mmpzptn",
          "author": "accountforfurrystuf",
          "body": "Also, 8k is simply a lot of pixels for a GPU to push. We *just* got comfortable with 4k gaming, with DLSS assisting additional ray tracing. Doubling that load with 8k is just too much.",
          "score": 5,
          "created_utc": 1744460300.0,
          "replies": [
            {
              "id": "mn0c2s8",
              "author": "ComfortableLaw5151",
              "body": "8k isn’t double, it’s quadruple the resolution of 4K",
              "score": 5,
              "created_utc": 1744603293.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmtxbol",
          "author": "PrelateFenix",
          "body": "They did the same shit with 3D tv's too.",
          "score": 4,
          "created_utc": 1744509553.0,
          "replies": [
            {
              "id": "mmtxocw",
              "author": "MargielaFella",
              "body": "I remember we got a 3D TV and I played Black Ops 2 on it in 3D…once. \n\nIdt anyone in my family used that feature for anything ever again.",
              "score": 2,
              "created_utc": 1744509691.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmpuwj7",
          "author": "jc-from-sin",
          "body": "No movie is even mastered in 8k. I don't even know if there's an 8k cinema projector.",
          "score": 9,
          "created_utc": 1744458082.0,
          "replies": [
            {
              "id": "mmto1zf",
              "author": "-I_I",
              "body": "IMAX?",
              "score": 2,
              "created_utc": 1744505813.0,
              "replies": [
                {
                  "id": "mmujamn",
                  "author": "oiwefoiwhef",
                  "body": "Yup!\n\nIMAX 70MM is the equivalent of 18K: https://blog.sciencemuseum.org.uk/a-projectionists-guide-to-oppenheimer/\n\nIt’s truly incredible to watch a movie filmed on 70MM at an IMAX 70MM screen. If you have a theater nearby, I highly recommend it.",
                  "score": 3,
                  "created_utc": 1744519093.0,
                  "replies": [
                    {
                      "id": "mmujslj",
                      "author": "-I_I",
                      "body": "I actually got an 8k Bravia open box for $1k. Sony has an app that claims to stream in imax-like quantities. It’s actually quite disheartening to read nearly every commenter hating on it, or rather pointing out its unwarranted-ness.",
                      "score": 2,
                      "created_utc": 1744519339.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mmul5cy",
                  "author": "jc-from-sin",
                  "body": "Digital imax is also 4k.",
                  "score": 1,
                  "created_utc": 1744520020.0,
                  "replies": []
                },
                {
                  "id": "mmu5y18",
                  "author": "justintweece",
                  "body": "Best I can tell, digital IMAX theater projectors cap out at 4k. And although IMAX film projectors are stated to have a theoretical resolution of 12-16k, very few (if any) films are shot entirely on IMAX cameras, and even fewer IMAX theaters can actually project 70mm film prints",
                  "score": 1,
                  "created_utc": 1744513089.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mmqc1ip",
          "author": "waterloograd",
          "body": "To me, 8K only seems useful on very large TVs, bigger than most people have. At work we have some big TVs, not sure exactly but I think around 100\", and maybe those could benefit from 8K, if they were in a house. I've never seen a TV in a house big enough where I think 8K would be useful at all",
          "score": 3,
          "created_utc": 1744465204.0,
          "replies": []
        },
        {
          "id": "mmpmgiu",
          "author": "BbxTx",
          "body": "The 8K argument as I understand it is that as screens get huge the apparent pixels per area is reduced. So, if you have 100” tv you might be able to see pixelation at 4K still. The first 8K tvs were using “real time upscalers” to achieve 8K from 4K sources to smooth things out. Not really a bad idea…maybe just too expensive still.",
          "score": 5,
          "created_utc": 1744453465.0,
          "replies": [
            {
              "id": "mmqmdls",
              "author": "Kindness_of_cats",
              "body": "Who the hell has space for a 100” TV, though?",
              "score": 1,
              "created_utc": 1744468710.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmqahjv",
          "author": "okram2k",
          "body": "I feel like I've seen this episode before, like when the industry rushed out with 3D TVs",
          "score": 2,
          "created_utc": 1744464639.0,
          "replies": []
        },
        {
          "id": "mmrrw0b",
          "author": "CozySlum",
          "body": "8K is important for VR content as each lens is 4K which is why 8K cameras are useful.",
          "score": 2,
          "created_utc": 1744481669.0,
          "replies": [
            {
              "id": "mn113u6",
              "author": "SliceoflifeVR",
              "body": "Yup. I’m even gonna be moving into 16k with that new BMD camera soon. VR absolutely needs 8k or higher.",
              "score": 2,
              "created_utc": 1744617615.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmtan0j",
          "author": "AliveAndNotForgotten",
          "body": "Maybe if they started making 16k tvs the costs would go down",
          "score": 2,
          "created_utc": 1744500592.0,
          "replies": []
        },
        {
          "id": "mmtfcat",
          "author": "ninjababe23",
          "body": "Butbutbut people need to buy the things",
          "score": 2,
          "created_utc": 1744502371.0,
          "replies": [
            {
              "id": "mmtjzqk",
              "author": "MargielaFella",
              "body": "Dw they’ll come up with some new gimmick soon enough 🤣",
              "score": 1,
              "created_utc": 1744504172.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mn0t2lz",
          "author": "First-Junket124",
          "body": "4k isn't even particularly well adopted in many places yet. 4k right now is the sweet spot for fantastic quality and price, an 8k panel just sky-rocket in price for an overkill panel.\n\n\n\nCool idea, jumped the gun and into the lava pool for now though.",
          "score": 2,
          "created_utc": 1744612537.0,
          "replies": []
        },
        {
          "id": "mn2511t",
          "author": "scrstueb",
          "body": "Was a tv salesman when 4K came out and towards when 8K started and seeing the jump from 1080 to 4K was clear. But as others have said, 8K doesn’t really mean anything as there isn’t a lot that can be improved",
          "score": 2,
          "created_utc": 1744637742.0,
          "replies": []
        },
        {
          "id": "mmq3vxu",
          "author": "kurotech",
          "body": "Hell the only 8k units I've seen in my market at 70+ inch TVs and that just isn't necessary or practical in almost any normal person's home especially with a $5000+ price tag I get it's new tech but the cost of early adoption just isn't worth it",
          "score": 1,
          "created_utc": 1744462083.0,
          "replies": []
        },
        {
          "id": "mmqy8ek",
          "author": "Alienhaslanded",
          "body": "8k is way denser than what people can actually see. Especially when it's a TV where you sit several feet from. VR is the only practical use of 8k display I can think of.",
          "score": 2,
          "created_utc": 1744472530.0,
          "replies": []
        },
        {
          "id": "mmr17f7",
          "author": "Ok-disaster2022",
          "body": "Just the cost and render time for editing 8k has got to be tremendous not to mention transmitting/streaming 8k. It's great that screen technology has gotten that good but literally nothing else is really at a price point to support it. Maybe in a decade sure. But honestly except for the very large format screens there's just diminishing benefit.",
          "score": 1,
          "created_utc": 1744473447.0,
          "replies": []
        },
        {
          "id": "mmr3orr",
          "author": "bokehbaka",
          "body": "I barely have 4k at this point lmao",
          "score": 1,
          "created_utc": 1744474224.0,
          "replies": []
        },
        {
          "id": "mmrgbk1",
          "author": "SsooooOriginal",
          "body": "They jumped with 4k, and 3D.\n\n\nI would love to see the insider data on how many 4k displays use native 4k media vs upscaling lower res media or just running lower res on the 4k display.\n\n\nThe required hardware infrastructure just ain't there for enough people to be streaming or downloading 4k files.\n\n\nWe would be much better off with hi-def media and unbloated websites being the norms until the majority of people get multi TB hard drives and have +gig speed data connections, then 4k should have been discussed.",
          "score": 1,
          "created_utc": 1744478128.0,
          "replies": []
        },
        {
          "id": "mmrvb5c",
          "author": "Audibled",
          "body": "I’ve owned a 8k tv for 4 years. Have never really used the 8k. \n\nGreat TV though.",
          "score": 1,
          "created_utc": 1744482781.0,
          "replies": []
        },
        {
          "id": "mmsbwa3",
          "author": "HelpRespawnedAsDee",
          "body": "Nope, 16k is minimum for immersive and/or VR videos. This is a huge step backwards.",
          "score": 1,
          "created_utc": 1744488308.0,
          "replies": []
        },
        {
          "id": "mn08whh",
          "author": "inssein2",
          "body": "I can't even get most TV channels and sports in 1080p. They definitely jumped the gun here.",
          "score": 1,
          "created_utc": 1744601815.0,
          "replies": []
        },
        {
          "id": "mmpnsyq",
          "author": "Taki_Minase",
          "body": "The only use case is when wall tvs are commonplace as a home upgrade.",
          "score": 1,
          "created_utc": 1744454283.0,
          "replies": []
        },
        {
          "id": "mmq6mya",
          "author": "DocFreudstein",
          "body": "The only practical application for 8k (and it’s a stretch) is for huge 85”+ TVs where you might get some chunkiness at 4K, but that’s a stretch.",
          "score": 1,
          "created_utc": 1744463182.0,
          "replies": []
        },
        {
          "id": "mmqgvit",
          "author": "TheDreamWoken",
          "body": "I don’t even need and actually don’t like 4k\n\nI believe 3k is best",
          "score": 0,
          "created_utc": 1744466861.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmpjfiv",
      "author": "I_R0M_I",
      "body": "Most HD content on cable etc isn't even 4k. Most streaming 4k is compressed to some degree.\n\nMost games are upscaled to 4k, or 4k with dlss etc.\n\nWhen we get 4k media as the mainstream, maybe we might look at 8k. Until then, it's a waste of money for anything outside of cinema / editing etc.",
      "score": 320,
      "created_utc": 1744451586.0,
      "replies": [
        {
          "id": "mmplure",
          "author": "CucumberError",
          "body": "‘Most streaming 4k is compressed to some degree’?!?\n\n4k streaming is compressed to the point it is hardly even 4k anymore. A 4k bluray movie is 50gb, where was on a steaming platform you’re about 10% of that. Bluray is still compressed, steaming 4k uses so little bandwidth even Australian internet can handle it. \n\nWatch a film at some stage on a 4k bluray and compare it to a 4k stream. It’s not the resolution that will blow you away, it’s the smoothness, and HDR suddenly makes sense.",
          "score": 143,
          "created_utc": 1744453095.0,
          "replies": [
            {
              "id": "mmpok1r",
              "author": "LongBeakedSnipe",
              "body": "What I dont understand is the audio.\n\nI don't know how to explain it, but if I put on any film on 4k bluray or bluray, my sound system sounds incredible.\n\nWhen I stream, even with 5.1 activated, it sounds completely flat.\n\nIt's basically the difference between almost cinema quality sound and TV speakers sound.\n\nObviously I do have decent speakers for the comparison, but my point is, why the hell is audio quality so low in streaming. Surely its a fraction of the data.",
              "score": 61,
              "created_utc": 1744454719.0,
              "replies": [
                {
                  "id": "mmqqgtu",
                  "author": "MrPlaysWithSquirrels",
                  "body": "It’s the bitrate. Audio gets dramatically cut for streaming as the thing most people will notice the least. For soundbars, it’s fine. But those of us with home theaters will notice the audio as the biggest quality difference.",
                  "score": 44,
                  "created_utc": 1744470043.0,
                  "replies": [
                    {
                      "id": "mmrcy20",
                      "author": "6StringAddict",
                      "body": "I have a soundbar and I notice it too. Netflix audio is terrible. Even when it says it's dolby atmos, it's still shit.",
                      "score": 18,
                      "created_utc": 1744477116.0,
                      "replies": [
                        {
                          "id": "mmrstd0",
                          "author": "Ivebeenfurthereven",
                          "body": "It's really remarkable more people don't pirate, I can get an excellent BluRay rip just as easily as paying Netflix for an inferior product",
                          "score": 6,
                          "created_utc": 1744481968.0,
                          "replies": [
                            {
                              "id": "mmruo2l",
                              "author": "6StringAddict",
                              "body": "I do. If it were up to me I'd cancel Netflix. But the misses watches too much. Me I just pirate the good stuff.",
                              "score": 2,
                              "created_utc": 1744482572.0,
                              "replies": []
                            },
                            {
                              "id": "mn7kqhd",
                              "author": "alidan",
                              "body": "I dont even go for that, just give me a compressed version form someone who gives a shit about the media and im good, if you run a denoiser on your media player it can look as good or better than uncompressed (I have done tests with raw game capture)",
                              "score": 1,
                              "created_utc": 1744712560.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mmtim5p",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -1,
                      "created_utc": 1744503636.0,
                      "replies": [
                        {
                          "id": "mmtj9pj",
                          "author": "MrPlaysWithSquirrels",
                          "body": "It 100% is lol. My comment wasn’t a theory.",
                          "score": 2,
                          "created_utc": 1744503890.0,
                          "replies": [
                            {
                              "id": "mmtlc07",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 3,
                              "created_utc": 1744504711.0,
                              "replies": [
                                {
                                  "id": "mmtnvaj",
                                  "author": "MrPlaysWithSquirrels",
                                  "body": "Yeah it’s pretty bad out there. But the general public doesn’t notice, so the streamers save some money for nothing.",
                                  "score": 1,
                                  "created_utc": 1744505739.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mmqpdc8",
                  "author": "Just_Another_Scott",
                  "body": ">When I stream, even with 5.1 activated, it sounds completely flat.\n\n\nBecause they're compressing audio too. They do this to save network bandwidth and avoid having to pay more for their packets going over other networks.\n\nStreaming apps on my PS5, especially Netflix, somehow lose the center channel. Makes it hard to hear people talking. So I have to switch to stereo (2channel) instead.",
                  "score": 34,
                  "created_utc": 1744469686.0,
                  "replies": []
                },
                {
                  "id": "mmq7vt8",
                  "author": "djandDK",
                  "body": "Streaming audio usually goes up to 640/768 kbps  5.1 with Atmos.\n\nSony's streaming service goes a bit higher, I think to atleast 1500 kbps.\n\nBut that depends on the streaming site, some don't go above 448/384/256 kbps.",
                  "score": 5,
                  "created_utc": 1744463660.0,
                  "replies": []
                },
                {
                  "id": "mmqbwme",
                  "author": "Sopel97",
                  "body": "different mastering",
                  "score": 2,
                  "created_utc": 1744465155.0,
                  "replies": []
                },
                {
                  "id": "mmpot9k",
                  "author": "CucumberError",
                  "body": "Is it streaming in 2 channel and up mixing?",
                  "score": 1,
                  "created_utc": 1744454866.0,
                  "replies": [
                    {
                      "id": "mmpr8cw",
                      "author": "LongBeakedSnipe",
                      "body": "I suspect they are doing that at their end or something.",
                      "score": 1,
                      "created_utc": 1744456199.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mmqsqg3",
                  "author": "FUTURE10S",
                  "body": "Well the BluRay has a Dolby Atmos master and the streamed content has a... way worse master for some reason.",
                  "score": 1,
                  "created_utc": 1744470775.0,
                  "replies": []
                },
                {
                  "id": "mmsyrh1",
                  "author": "burnSMACKER",
                  "body": "You underestimate the size of high quality audio. \n\nSome forms of TrueHD audio have higher bitrates than the literal Video bitrate of your average Netflix movie.",
                  "score": 1,
                  "created_utc": 1744496157.0,
                  "replies": []
                },
                {
                  "id": "mmzo26a",
                  "author": "astro_plane",
                  "body": "I noticed this too with my surround sound setup. Streaming audio sucks. It’s a big reason why I still collect Blu-ray’s.",
                  "score": 1,
                  "created_utc": 1744593221.0,
                  "replies": []
                },
                {
                  "id": "mnahaab",
                  "author": "nope_nic_tesla",
                  "body": "Are you sure that your streaming device is correctly passing the audio through like your Blu Ray player does? Sometimes you have to configure audio in the specific app too.",
                  "score": 1,
                  "created_utc": 1744747398.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mmqxpsd",
              "author": "1ConsiderateAsshole",
              "body": "I sold TV’s in a high end store. We had the first 8K TV several years ago ($25K) and Sony couldn’t provide us any 8K content. This makes sense.",
              "score": 5,
              "created_utc": 1744472369.0,
              "replies": [
                {
                  "id": "mmsa8qk",
                  "author": "cp5184",
                  "body": "The roll out/push for 8k seemed to have been centered around the 2020 tokyo olympics broadcast in 8k by Japan television nhk.  There was also a handful of movies like I think 2001 that were upscaled to 8k or something iirc.",
                  "score": 5,
                  "created_utc": 1744487756.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mmq85kp",
              "author": "SqueezeAndRun",
              "body": "That's a bit of an exaggeration. 4K blu-rays are usually 66GB-100GB, and the 4K streams of those movies can range from about 15GB-35GB. So I'd say 20-50% is a more accurate estimate rather than 10%.\n\nThat being said, 4K blu-rays do look and sound better, no doubt. I own a decent sized collection myself and think it's worth it. Also many people do not pay extra for 4K streaming and may have bad internet.",
              "score": 7,
              "created_utc": 1744463763.0,
              "replies": [
                {
                  "id": "mmrdhq8",
                  "author": "Accurate_Package",
                  "body": "Netflix states 7GB per hour, so more like 10-20GB",
                  "score": 9,
                  "created_utc": 1744477279.0,
                  "replies": []
                },
                {
                  "id": "mmzo8zu",
                  "author": "astro_plane",
                  "body": "Streamers like to throttle during peak hours so you don’t always get the highest quality.",
                  "score": 3,
                  "created_utc": 1744593294.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mmslyif",
              "author": "WeWantLADDER49sequel",
              "body": "I stand by the opinion that even a 1080p blu ray looks better than 4k streaming because the image is so much more crisp with less noise in it from the compression. You don't even need a top of the line tv to notice it. Most people don't care about that quality difference but it is there.",
              "score": 2,
              "created_utc": 1744491663.0,
              "replies": []
            },
            {
              "id": "mmuaouk",
              "author": "CucumberError",
              "body": "NGL, I haven’t really noticed the audio issues. \n\nIf it’s something I care about, I’m either already watching from UHD Bluray, or it’s been pirated at higher bitrate than streaming anyway. Netflix has more become for just TV shows, and I feel like I watch more 2.0 channel stuff on YouTube these days anyway. \n\nWe have a traditional Home Theatre, 5.1.2 Atmos setup etc (not a sound bar etc).",
              "score": 2,
              "created_utc": 1744515121.0,
              "replies": []
            },
            {
              "id": "mn0ir6n",
              "author": "BelovedCroissant",
              "body": "Ooh, talk to me more about streaming and compression.",
              "score": 2,
              "created_utc": 1744606652.0,
              "replies": []
            },
            {
              "id": "mmpu9dk",
              "author": "I_R0M_I",
              "body": "I was being cautious, as wasn't sure if there were some streams less compressed etc.\n\nI have a UHD player, and will still buy some movies in Uhd, as watching it via stream just ain't the same.\nSame goes for sound, it's never the same on stream as on bluray / uhd.",
              "score": 4,
              "created_utc": 1744457764.0,
              "replies": []
            },
            {
              "id": "mmqry77",
              "author": "cyxrus",
              "body": "Look at call of duty. The files are humongous for audio",
              "score": 1,
              "created_utc": 1744470521.0,
              "replies": []
            },
            {
              "id": "mmsiozx",
              "author": "cape2cape",
              "body": "Storage size is a meaningless metric without codec information.",
              "score": 1,
              "created_utc": 1744490573.0,
              "replies": [
                {
                  "id": "mmsoewo",
                  "author": "CucumberError",
                  "body": "Eh, not really. More data in, more data out. Like technically you’re right, but all modern codex are decent, and really the size makes the biggest difference",
                  "score": 2,
                  "created_utc": 1744492505.0,
                  "replies": [
                    {
                      "id": "mmsvyl7",
                      "author": "cape2cape",
                      "body": "No, modern codecs can have massive differences on output size, especially at higher resolutions.",
                      "score": 2,
                      "created_utc": 1744495146.0,
                      "replies": [
                        {
                          "id": "mmt1y5t",
                          "author": "CucumberError",
                          "body": "Yeah, but unless your codex is a crayon, 50gb files will always going to look better than 10gb.",
                          "score": 2,
                          "created_utc": 1744497334.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mmpp4u4",
          "author": "nicuramar",
          "body": "> Most streaming 4k is compressed to some degree.\n\nAll streaming, and in fact pretty much all video, is compressed to some degree. ",
          "score": 19,
          "created_utc": 1744455045.0,
          "replies": [
            {
              "id": "mmq0jjh",
              "author": "IllllIIIllllIl",
              "body": "Yeah UHD Blu-rays are definitely not lossless, and few consumer machines can probably even playback such a high bitrate as lossless video would be, but as long as the studio doesn’t botch the encoding for the disc transfer the differences are imperceptible in motion.\n\nMatt Reeves released a raw export of a deleted scene from The Batman and it was absolutely colossal for less than 5 minutes of footage. ",
              "score": 9,
              "created_utc": 1744460662.0,
              "replies": [
                {
                  "id": "mmqsy37",
                  "author": "FUTURE10S",
                  "body": "I have a copy of My Little Pony the movie that was leaked from the master they played in theatres, still compressed mind you, and a 1080p movie was 175GB.",
                  "score": 6,
                  "created_utc": 1744470844.0,
                  "replies": []
                },
                {
                  "id": "mmqct1t",
                  "author": "Sopel97",
                  "body": "Apocalypse Now streaming master was leaked and it's 1TB.",
                  "score": 2,
                  "created_utc": 1744465475.0,
                  "replies": [
                    {
                      "id": "mmqyk3j",
                      "author": "japzone",
                      "body": "Talk about a leak the size of a water main break.",
                      "score": 3,
                      "created_utc": 1744472631.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mms18fw",
          "author": "USSJaguar",
          "body": "HD content on cable is still 720p/1080i lol",
          "score": 9,
          "created_utc": 1744484741.0,
          "replies": [
            {
              "id": "mmtgfi3",
              "author": "BurritoLover2016",
              "body": "And it uses 25 year old compression standards. It’s damn near unwatchable on my 83” OLED without some of the LG AI upscaling features turned on.\n\nThank god some of the football games are also being streamed nowadays because broadcast quality is so laughable.",
              "score": 3,
              "created_utc": 1744502788.0,
              "replies": [
                {
                  "id": "mmtgnjg",
                  "author": "USSJaguar",
                  "body": "I was recently gifted a semi older 48 inch sony TV that I gave to my folks to replace their living room TV and man while it can look good at some angles its just a compression nightmare",
                  "score": 2,
                  "created_utc": 1744502874.0,
                  "replies": [
                    {
                      "id": "mmtuhpe",
                      "author": "BurritoLover2016",
                      "body": "Omg the ATSC decoder chips in older HDTVs are seriously craptastic. We’ve come so far.",
                      "score": 2,
                      "created_utc": 1744508421.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mmsmuv0",
          "author": "TheNorthComesWithMe",
          "body": "Most streaming 4k is so compressed that if you could get the 4k bitrate with a 1080p stream it would look massively better",
          "score": 2,
          "created_utc": 1744491968.0,
          "replies": [
            {
              "id": "mmtc43l",
              "author": "blumpkin",
              "body": "People say this, but I just don't see it. Even heavily compressed 4k looks better than 1080 to me.",
              "score": 2,
              "created_utc": 1744501143.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmvd9m6",
          "author": "NoHonorHokaido",
          "body": "You can't really see difference between native 4K and native 8K. The only use case is VR.",
          "score": 1,
          "created_utc": 1744536860.0,
          "replies": []
        },
        {
          "id": "mneubgz",
          "author": "Petraam",
          "body": "Gaming at 8k would just take a ridiculous gpu and then you are going to be playing at like 30fps.  Most gamers want at least 120fps and anything below 60 is in the realm of “excuses console players tell themselves”",
          "score": 1,
          "created_utc": 1744812730.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmpucid",
      "author": "Xendrus",
      "body": "Because 8k is stupid. If you ever get to see one IRL next to a 4k unless you get so close to it that it's absurd you cannot tell the difference. 8k is for VR glasses, not televisions you sit across the room from. Our eyes are not that good.",
      "score": 121,
      "created_utc": 1744457807.0,
      "replies": [
        {
          "id": "mmrefuc",
          "author": "Shehzman",
          "body": "The benefit of 8k is on a computer monitor is that linearly scales with both 1440p and 4k. That means you can have your desktop at 8k then play games at 1440p or 4k without things looking significantly more pixelated than trying to play 1440p on a 4k monitor for example.",
          "score": 6,
          "created_utc": 1744477565.0,
          "replies": [
            {
              "id": "mmrkjgk",
              "author": "Xendrus",
              "body": "I always hear about the 1440p on 4k monitor thing but I have to ask, have you seen that lately? It hasn't been an issue for a while. 1440p content looks crystal clear on my 4k.",
              "score": 6,
              "created_utc": 1744479392.0,
              "replies": []
            },
            {
              "id": "mn3pf7h",
              "author": "Remy0507",
              "body": "I don't think 8k on a monitor is particularly worthwhile outside of maybe certain very specific use-cases. \n\n\nEven 4k on a typical desktop sized monitor is too much. Every see what 4k looks like on a 27\" desktop monitor with the UI scaling set to 100%? Everything is *tiny*. ",
              "score": 2,
              "created_utc": 1744654894.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmq8p67",
          "author": "jral1987",
          "body": "Wait, why do you need 8k for VR? I might be mistaken but I thought you'd only need 8k for really really large screens, larger screens would need more pixels to make it look very good but if on VR wouldn't 4k or even less than 4k be fine?",
          "score": -1,
          "created_utc": 1744463970.0,
          "replies": [
            {
              "id": "mmqbetq",
              "author": "DICK-PARKINSONS",
              "body": "It's fine in that it works and doesn't look bad, but being that close to the screen in VR means it would benefit from an 8k resolution. The size of the screen and your distance from it are both important factors.",
              "score": 36,
              "created_utc": 1744464977.0,
              "replies": [
                {
                  "id": "mmqbxdt",
                  "author": "jral1987",
                  "body": "Thanks! that makes sense.",
                  "score": 7,
                  "created_utc": 1744465163.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mmqbcrx",
              "author": "TSrake",
              "body": "The “bigger” the screen is (to you), the more resolution you need. A VR headset fills your entire view, not only a section like it happens when you look at screens, so more resolution is needed.",
              "score": 14,
              "created_utc": 1744464956.0,
              "replies": []
            },
            {
              "id": "mmqchox",
              "author": "Lower_Fan",
              "body": "For vr your eyes are closer to the screen so it's easier to notice the pixels. Therefore you need a lot more of them. \n\n\nAlso the vr resolution naming scheme is a bit weird they call 2 4k screens, so one per eye  8k. ",
              "score": 3,
              "created_utc": 1744465363.0,
              "replies": []
            },
            {
              "id": "mmqd1i6",
              "author": "Sopel97",
              "body": "the size of the screen is only one variable\n\nAR/VR requires large field of view",
              "score": 2,
              "created_utc": 1744465556.0,
              "replies": []
            },
            {
              "id": "mmr1444",
              "author": "japzone",
              "body": "Think of it in terms of Field of View. An immersive TV experience is around 40° of your full vision, so that's what you're stretching 4K over. \n\nThe Meta Quest 3 VR headset has a Horizontal FoV of 110°. Now you're taking that same 4K display and stretching it over that much wider field. Doing that will obviously decrease the perceived pixel density, leading you to more easily see said pixels, decreasing immersion.",
              "score": 2,
              "created_utc": 1744473419.0,
              "replies": []
            },
            {
              "id": "mmqbcoh",
              "author": "educofu",
              "body": "A lens make the tiny screen fill up to 120º of your vision, that would be close to a 120\" curved screen at 1~2 meter away. The highest resolution VR i know is at 3840x3840 per eye and still not perfect.",
              "score": 2,
              "created_utc": 1744464955.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mmpiq6w",
      "author": "firedrakes",
      "body": "i mean when most content is not made in 4k.... why make 8k tvs?",
      "score": 180,
      "created_utc": 1744451140.0,
      "replies": [
        {
          "id": "mmpproi",
          "author": "ImBoredButAndTired",
          "body": "I think it was Paramount that ran a study and determined there's no way to most people to determine the difference between an 8K movie and a 4K movie in a home setting. \n\n\n\nThe scam is that  TV manufacturers were waiting for streamers to gradually lower the quality of 4K streams to the point where a new \"8K\" tier would actually look noticeably different. It just hasn't happened yet.",
          "score": 74,
          "created_utc": 1744455402.0,
          "replies": [
            {
              "id": "mmqgjxf",
              "author": "Level_Forger",
              "body": "This is petty well known. Even at movie theater screen size almost no one can tell the difference beteeen 3.4K and 4K, let alone 8K from normal viewing distance. Unless you’re sitting with your face against the screen, 8K is not helpful for the average consumer use case. ",
              "score": 29,
              "created_utc": 1744466754.0,
              "replies": [
                {
                  "id": "mmsauv4",
                  "author": "Dt2_0",
                  "body": "Most movie theater projectors use 1440p iirc.",
                  "score": 6,
                  "created_utc": 1744487961.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mmq774n",
              "author": "mdonaberger",
              "body": "I wonder if 8K would make an appreciable difference in the scenario of movie theater projection.",
              "score": 7,
              "created_utc": 1744463401.0,
              "replies": [
                {
                  "id": "mmqz81g",
                  "author": "japzone",
                  "body": "IMAX Laser is 4K, while IMAX 70mm is the equivalent of 12K+(analog being analog). Hence why movie snobs go crazy over 70mm.",
                  "score": 16,
                  "created_utc": 1744472837.0,
                  "replies": [
                    {
                      "id": "mmsni2j",
                      "author": "TheNorthComesWithMe",
                      "body": "Post-production on 70mm isn't being done in 12k so you'll never really get a 12k movie out of that format anyway.",
                      "score": 2,
                      "created_utc": 1744492189.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mmrf7gz",
              "author": "ImBonRurgundy",
              "body": "You don’t need a study to tell that. It’s human biology.",
              "score": 1,
              "created_utc": 1744477797.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmrkylp",
          "author": "LibraryBig3287",
          "body": "You mean the new 8k OLED AI+ power boost isn’t selling well?!",
          "score": 2,
          "created_utc": 1744479518.0,
          "replies": []
        },
        {
          "id": "mmvdm2p",
          "author": "NoHonorHokaido",
          "body": "Why make content in 8k when all TVs are 4k?",
          "score": 2,
          "created_utc": 1744537091.0,
          "replies": []
        },
        {
          "id": "mmplh5g",
          "author": "LiamFenwick",
          "body": "I’m pretty sure most content has been 4k for quite a while now",
          "score": -12,
          "created_utc": 1744452866.0,
          "replies": [
            {
              "id": "mmpo0a9",
              "author": "danielv123",
              "body": "Our national TV provider NRK are still producing all their shows (many of which are great) in 720p :(",
              "score": 13,
              "created_utc": 1744454404.0,
              "replies": [
                {
                  "id": "mmppea8",
                  "author": "qtx",
                  "body": "They shoot in 1080p and 4k but you can only view them via the NRK app or via their website.\n\nThey still only broadcast in 720p on their terrestrial network though.\n\nhttps://www.tu.no/artikler/tv-sendingene-er-i-endring-dette-kan-vi-forvente-fra-nrk-tv2-og-altibox-br/505339",
                  "score": 5,
                  "created_utc": 1744455193.0,
                  "replies": [
                    {
                      "id": "mmpq18a",
                      "author": "danielv123",
                      "body": "I only use their website or downloads. I can see that they say that - but I am yet to find any 1080p+ content. Can you recommend any?",
                      "score": 2,
                      "created_utc": 1744455550.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mmpqon1",
              "author": "elton_john_lennon",
              "body": "> most content\n\nI have no idea where you are getting that. \n\nIn total set of cinematography, most content which means from Lumiere brothers up to Minecraft Movie, was not made in 4K, most of it wasn't even digitised and movies that were scanned from film only in the last decade or so were remastered to 4K quality.",
              "score": 7,
              "created_utc": 1744455905.0,
              "replies": [
                {
                  "id": "mmsj2ng",
                  "author": "dapala1",
                  "body": "He's talking about film.",
                  "score": 1,
                  "created_utc": 1744490700.0,
                  "replies": [
                    {
                      "id": "mmst3ii",
                      "author": "firedrakes",
                      "body": "film/tv shows and animation both none cgi and cgi. is not film in 4k.\n\nits normal 2k and the upscaled to 4k.\n\nthere is no agree standard for 4k in the industry like 2k",
                      "score": 1,
                      "created_utc": 1744494146.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mmpu97z",
      "author": "dustofdeath",
      "body": "Content has not caught up. Most of the streaming is way below true 4k.\n\n\nTV often can't even provide 720p.",
      "score": 30,
      "created_utc": 1744457762.0,
      "replies": [
        {
          "id": "mmr57n9",
          "author": "grygrx",
          "body": "> 720p\n\nThe NBA **finals** last year were only available in 720P",
          "score": 13,
          "created_utc": 1744474708.0,
          "replies": [
            {
              "id": "mmsyyf1",
              "author": "burnSMACKER",
              "body": "Sports in general are typically in 720p because they are broadcast in 60fps.",
              "score": 2,
              "created_utc": 1744496227.0,
              "replies": []
            },
            {
              "id": "mmth4dc",
              "author": "BurritoLover2016",
              "body": "I mean yeah sure, but the NBA is in a weird place generally speaking right now.",
              "score": 1,
              "created_utc": 1744503056.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmzojbi",
          "author": "astro_plane",
          "body": "Tubi and Shudder are 720p and at low bitrates.",
          "score": 1,
          "created_utc": 1744593408.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmq1ndx",
      "author": "Disused_Yeti",
      "body": "Gotta make content for my Sony 3d tv first before they can get to the 8k stuff",
      "score": 17,
      "created_utc": 1744461144.0,
      "replies": [
        {
          "id": "mmqlil5",
          "author": "Prize_Instance_1416",
          "body": "I have that on my XBR and have never wanted to use it.",
          "score": 3,
          "created_utc": 1744468422.0,
          "replies": [
            {
              "id": "mmqpgpa",
              "author": "Disused_Yeti",
              "body": "i've had the tv for 13 years, used it once and thought yeah i'm good with that\n\ndidn't buy it for the 3d at least, it just happened to have it",
              "score": 3,
              "created_utc": 1744469716.0,
              "replies": []
            },
            {
              "id": "mmqsm13",
              "author": "kermityfrog2",
              "body": "Try out the \"simulated 3D\" mode. You can make any content 3D.",
              "score": 2,
              "created_utc": 1744470735.0,
              "replies": [
                {
                  "id": "mmqxfyd",
                  "author": "Transphattybase",
                  "body": "Nobody wanted 3D TV except the folks making 3D TVs. The market verified this. That’s why no more 3D TV.",
                  "score": 0,
                  "created_utc": 1744472285.0,
                  "replies": [
                    {
                      "id": "mmqxs1q",
                      "author": "kermityfrog2",
                      "body": "It's cool to have. Due to simulated 3D, sometimes it's fun to play Playstation or PC games in 3D, just for a change.",
                      "score": 1,
                      "created_utc": 1744472389.0,
                      "replies": [
                        {
                          "id": "mmqytpy",
                          "author": "Transphattybase",
                          "body": "Take good care of it. \n\nFrom a technical standpoint it’s a very interesting idea, I just never thought it was going to catch on. Even at a movie theater I find it to be nothing more than a distraction.",
                          "score": 1,
                          "created_utc": 1744472716.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mmzoucn",
                      "author": "astro_plane",
                      "body": "I liked 3D, it never gave me headaches either. It’s a gimmick, but a fun gimmick if the director knows what they’re doing. Half Life Alyx made good use of depth perception and the orb puzzle using 3D space was clever.",
                      "score": 1,
                      "created_utc": 1744593529.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mmqsi0o",
          "author": "kermityfrog2",
          "body": "Try the \"simulated 3D\" mode on the TV to watch any 2D content.",
          "score": 1,
          "created_utc": 1744470698.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmpncgy",
      "author": "baskura",
      "body": "I’d rather have 4K TV’s and 8K cameras so you can crop in and retain resolution.",
      "score": 16,
      "created_utc": 1744454006.0,
      "replies": [
        {
          "id": "mmpsrbp",
          "author": "mrsebsin",
          "body": "I was thinking the same. Makes video editing much easier!",
          "score": 7,
          "created_utc": 1744457001.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmq4g8c",
      "author": "alphabased",
      "body": "About time. The 8K push was ridiculous when most streaming content is still 1080p, and you can barely tell the difference between 4K and 8K on a normal-sized TV at normal viewing distances.",
      "score": 15,
      "created_utc": 1744462312.0,
      "replies": [
        {
          "id": "mmqksfl",
          "author": "LoveMeSomeSand",
          "body": "I know physical media is slowly dying out, but for gods sake, stores are still selling brand new releases on DVD. The normal consumer doesn’t need an 8K TV",
          "score": 3,
          "created_utc": 1744468179.0,
          "replies": [
            {
              "id": "mmr9qk1",
              "author": "None",
              "body": "[deleted]",
              "score": 2,
              "created_utc": 1744476130.0,
              "replies": [
                {
                  "id": "mmsjkyx",
                  "author": "None",
                  "body": "[removed]",
                  "score": 1,
                  "created_utc": 1744490869.0,
                  "replies": [
                    {
                      "id": "mmsjl36",
                      "author": "AutoModerator",
                      "body": "Hello, /u/KyleMcMahon! Thanks for contributing. However, your comment has been automatically removed. techradar.com is banned from /r/gadgets due to placement of malicious advertising.\n\n\"Malicious advertisments\" include, but are not limited to:\n\n* Unexpected redirection to other sites, or unexpected opening of additional background tabs\n\n* Ads for scams or malware, such as \"you've won the lottery\" or \"virus detected\".\n\n* Advertisements that run malicious script.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
                      "score": 1,
                      "created_utc": 1744490870.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mmppeju",
      "author": "elton_john_lennon",
      "body": "Why have an 8K TV when there is no 8K material to play on it?, and one other thing - if 4K 60\" is somewhat the norm for resolution/screen size for an average home distance from couch to screen, that means 8K TVs would have to be 120\" for them to still make sense in this scenario. \n\nAin't nobody buying 120\" TVs with additional 8K tech price tag on them, and \" brand new tech\" tax",
      "score": 15,
      "created_utc": 1744455197.0,
      "replies": []
    },
    {
      "id": "mmpun3d",
      "author": "QuiGonColdGin",
      "body": "This reminded me of back when 3D TVs were trying to become a thing.",
      "score": 9,
      "created_utc": 1744457954.0,
      "replies": [
        {
          "id": "mmr2shu",
          "author": "None",
          "body": "[deleted]",
          "score": 5,
          "created_utc": 1744473943.0,
          "replies": []
        },
        {
          "id": "mmrgx2u",
          "author": "Cosmicpsych",
          "body": "My first 4k tv was also 3D. Never bought the glasses, never used 3D lol",
          "score": 2,
          "created_utc": 1744478301.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmqlfon",
      "author": "redlemurLA",
      "body": "I work in TV.  I once did an interview with a 91-year old celebrity.  Without telling me, my cameraman shot it in 8K. \n\nWhen I got into editing the detail was so intense you could see every single pixel in his bloodshot eyes. I had to spend extra money to paint out and blur the original image because he looked like Skeletor.  That was the end of 8K for me.",
      "score": 14,
      "created_utc": 1744468396.0,
      "replies": [
        {
          "id": "mmr4loo",
          "author": "RaymondBeaumont",
          "body": "Was the celebrity Frank Langella?",
          "score": 3,
          "created_utc": 1744474514.0,
          "replies": [
            {
              "id": "mmsa8ox",
              "author": "redlemurLA",
              "body": "It was NOT Frank Langella. \n\n1 down, 19 more questions to go.  \n\nYes/No questions or guesses only.",
              "score": 6,
              "created_utc": 1744487756.0,
              "replies": [
                {
                  "id": "mmtj34p",
                  "author": "Jaredlong",
                  "body": "Clint Eastwood?",
                  "score": 3,
                  "created_utc": 1744503820.0,
                  "replies": [
                    {
                      "id": "mmv0qzm",
                      "author": "redlemurLA",
                      "body": "It was NOT Clint Eastwood.\n\n2 down 18 to go.",
                      "score": 3,
                      "created_utc": 1744528822.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mmpkef2",
      "author": "ItsStaaaaaaaaang",
      "body": "No idea why they exist for the consumer market. Well, I know why they tried to make them a thing but yeah, completely unnecessary technology.",
      "score": 6,
      "created_utc": 1744452192.0,
      "replies": [
        {
          "id": "mmroh1v",
          "author": "elton_john_lennon",
          "body": "> No idea why they exist for the consumer market.\n\nThe only reason is for them to have \"a brand new thing\" that clearly differentiates itself from the old one in the mind of the consumer. They don't care if there is any reason or usefulness for it to be there, it just have to be new.\n\nThere is not much in terms of the design that they can work with to make a difference, after all it's just a rectangular box with bezels shrinking each year, so they have to resort to stickers on the box that mention the technology. 8 of them K's is morer than 4, so there you have it :)",
          "score": 1,
          "created_utc": 1744480595.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmpig9d",
      "author": "Jebusfreek666",
      "body": "Good. They are pointless and a huge waste of money/resources.",
      "score": 20,
      "created_utc": 1744450964.0,
      "replies": []
    },
    {
      "id": "mmpkmnu",
      "author": "Xerain0x009999",
      "body": "Any 8k TV doesn't make much sense when  consumers hang it over a fireplace and sit 14 feet away from it.",
      "score": 8,
      "created_utc": 1744452334.0,
      "replies": []
    },
    {
      "id": "mmprtf5",
      "author": "Jacket_screen",
      "body": "Off topic perhaps but I read somewhere that the Japanese Olympics were recorded in 16K for future proofing.",
      "score": 3,
      "created_utc": 1744456507.0,
      "replies": [
        {
          "id": "mmq26r2",
          "author": "Stingray88",
          "body": "A lot of content is recorded in higher resolution than the final planned release to give more flexible in post production. For instance, a lot of movies that will master in 4K are shot in 6K or 8K, it allows you to reframe the shot in post and can make VFX look more crisp as well.\n\nThis is not universal though, generally only done if you really do need it, because it’s significantly more expensive. The amount of big budget VFX heavy movies shot and mastered in 2K* and then unpressed to 4K that still happens today would surprise you.\n\n\\* 2K is 2048x1080, very similar to FHD 1920x1080. Not QHD 1440p, the consumer monitor industry abducting 2K to mean 1440p in the last 10 years is absolute nonsense.",
          "score": 6,
          "created_utc": 1744461377.0,
          "replies": []
        },
        {
          "id": "mmqjzy3",
          "author": "mtodd93",
          "body": "I agree with pretty much everything @stingray88 said. The one thing I’ll add, what you shoot and what you “project” pixel wise mean very different things. One of things about shooting in higher resolution isn’t so much future proofing, but the quality of the image it self. Yes pixels don’t solely determine this and that’s why the leading cinema camera brand (ARRi) still has only made 4.5k cameras at its max. That being said though, 12k is great for VFX and reframing. But it my opinion and why it’s great for the lower end prosumer cameras is that it’s so much “crispers” with less equipment, meaning smaller productions can make them work for them. As well as when you downscale for let’s say social medial the equality still retains it self very well vs I’ve seen some 4k camera get a bit muddy when being down graded especially if not having been lit and color graded correctly.",
          "score": 2,
          "created_utc": 1744467910.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmql8ph",
      "author": "Prize_Instance_1416",
      "body": "Having worked selling tv and video equipment for 12 years in my youth, I can definitely tell you I’m ok with the current state of picture quality. Wasn’t that long ago we watched 4x3 32” tvs barely hitting 300 lines with decent equipment. \n\nProperly adjusted, lighting correct, good source and sound, I really don’t wish for better. It’s fucking great!",
      "score": 4,
      "created_utc": 1744468331.0,
      "replies": []
    },
    {
      "id": "mmpjwgc",
      "author": "MrRoboto12345",
      "body": "If you're watching something, there's no discernible difference between 4k and 8k, even at the native level, native 4k vs native 8k. Why pay ten thousand more?",
      "score": 7,
      "created_utc": 1744451876.0,
      "replies": [
        {
          "id": "mmpo39q",
          "author": "Gavin777",
          "body": "Watching 8k youtube videos on my 4k native 85\" TV there is absolutely a noticeable difference. If you are viewing at the correct distance on a large screen of the same size 8k absolutely looks better than 4k, I can state that objectively.",
          "score": -11,
          "created_utc": 1744454452.0,
          "replies": [
            {
              "id": "mmpotua",
              "author": "Jiopaba",
              "body": "That's because YouTube videos are compressed to death. It has nothing to do with 8K as a tech and everything to do with you getting almost half of a real 4K video when you do that.\n\nIf that's your whole experience with 8K you've never even seen the real thing.",
              "score": 20,
              "created_utc": 1744454874.0,
              "replies": [
                {
                  "id": "mmt5a4q",
                  "author": "BigHandLittleSlap",
                  "body": "Some professional video editors were asked to view a 4K and an 8K TV side-by-side with logos hidden. They preferred the 4K TV because it was OLED and had better contrast.\n\nAlso, you're absolutely spot on with the \"megabits over megapixels\": I've got an 8K camera (Nikon Z8) and I've noticed that either 2K or 4K footage from it looks *absolutely amazing* simply because the bitrate is stupid high, on the order of 800 MB/s. If I compress it down to something that my relatives can stream over their shitty wifi and rural Internet, then the exact same footage starts looking like it was made with a potato.\n\nThat got me thinking, and recently I tried the Blackmagic Camera app with my iPhone 16. It can record with a bit rate over 1 Gbps. The quality difference is incredible, despite being the exact same tiny phone camera as before.\n\nThe lesson is that bitrate and OLED make a far bigger difference than the number of pixels.",
                  "score": 2,
                  "created_utc": 1744498605.0,
                  "replies": [
                    {
                      "id": "mmtburk",
                      "author": "Jiopaba",
                      "body": "Agreed.  At least the OLED and other features could eventually make their way to 8K TVs.  At the moment though, it's just not worth moving on from 4K unless you're chasing a particular aspect ratio or something in my opinion.\n\nWe didn't move to 1080p for future-proofing, we did it because we had content available that needed that quality of display to fully experience.  Until it's entirely reasonable for a person to be pulling down 4K content at a bitrate equal to one full-quality 4K image per frame with only lossless compression used, you're still going to get more out of investing into network architecture and compression than buying a display with four times more pixels than you can drive.\n\nIt's like buying a $100,000 muscle car with 800 HP so that you can drive to work and back at 35 MPH.  Maybe once in a while you take it down to the track and let it loose / cue up some local 8K content to really show it off, but as a daily driver it makes no sense.",
                      "score": 1,
                      "created_utc": 1744501045.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mmpyft4",
                  "author": "mtgguy999",
                  "body": "Maybe if 8k tvs become common we might actually get 4k streams (but marked as 8k)",
                  "score": 2,
                  "created_utc": 1744459727.0,
                  "replies": [
                    {
                      "id": "mmpzytq",
                      "author": "Jiopaba",
                      "body": "Yeah, but I think we're better off hoping storage and streaming technologies improve before we rush into 8K TVs.  In another decade or two we can revisit 8K once we're actually exploring the true limits of 4K.",
                      "score": 2,
                      "created_utc": 1744460410.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mmpphdd",
              "author": "MrRoboto12345",
              "body": ">8k youtube videos on my 4k native 85\" TV\n\n8k worth of pixels on a 4k display is obviously going to make the image look sharper due to 4x the pixel information being merged into 1 pixel's worth of space. That's downsampling at work. The bitrate/encoding (h.264 8bit versus h.265 10bit for example) of the video itself also plays a part in overall quality.\n\n>If you are viewing at the correct distance on a large screen of the same size\n\nThese specific requirements are not a given; they will not always be met.",
              "score": 1,
              "created_utc": 1744455242.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mmqrd9d",
      "author": "RedditAddict6942O",
      "body": "squash bake encourage innocent elderly touch bear tart books mysterious\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "score": 3,
      "created_utc": 1744470334.0,
      "replies": [
        {
          "id": "mn72h3j",
          "author": "Datathrash",
          "body": "> The brightest TV's still only reach 1/10 the brightness of the sky on a sunny day.\n\nI dunno dude, when I pop on my TV at 2:00 in the morning in a dark room it looks like burning magnesium to my eyes lol",
          "score": 1,
          "created_utc": 1744700771.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmplkg2",
      "author": "VRGIMP27",
      "body": "Higher frame rates for lower persistence to get better motion resolution would be better than 8k",
      "score": 6,
      "created_utc": 1744452923.0,
      "replies": [
        {
          "id": "mmprcf1",
          "author": "elton_john_lennon",
          "body": "> lower persistence\n\nProblem is - it doesn't have a sticker, acronym, or something in consumer mind that is simple to explain. People don't even get what HDR is, and you want them to care for lower persistence ;) \n\n> Higher frame rates\n\nOther than for sports I don't think there is much use for higher frame rates in motion pictures.",
          "score": 5,
          "created_utc": 1744456259.0,
          "replies": [
            {
              "id": "mmtr9pv",
              "author": "VRGIMP27",
              "body": "TRU motion\nCrystal motion pro \n\nThey can make up all kinds of BS for something that has a tangible benefit, and for flat panel displays, higher refresh rates have insanely tangible benefits",
              "score": 2,
              "created_utc": 1744507105.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mmpj5xb",
      "author": "TowerofWavelength",
      "body": "I can see 8k being a step up for big screens, but everything else needs to catch up first. Memory, bandwidth for streaming services etc. what’s the point of getting an 8k tv if 90% of the content you’ll be watching will be 4k anyway? You might get a bit of extra information from the upscale, but is it worth it?",
      "score": 9,
      "created_utc": 1744451421.0,
      "replies": [
        {
          "id": "mmpojyp",
          "author": "Smurfsville",
          "body": "10% of the content you watch is 4K. ",
          "score": 4,
          "created_utc": 1744454718.0,
          "replies": [
            {
              "id": "mmsad3n",
              "author": "Greatbigcrabupmyarse",
              "body": "Nearly every channel I watch on youtube is 4k.  I game in 4k.  at least 80% of everything I do is 4k.\n\nMaybe you watch a lot of telly or something",
              "score": 1,
              "created_utc": 1744487797.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mmpxuwz",
      "author": "Mypinksideofthedrain",
      "body": "Bring back passive 3d !",
      "score": 2,
      "created_utc": 1744459466.0,
      "replies": []
    },
    {
      "id": "mmq8a4p",
      "author": "thedeermunk",
      "body": "Shooting HD is more important than viewing HD. Gives you more options to crop and create closeups from medium shots etc. Fucking Zodiac was shot in 1080p for fucks sake and it still looks amazing.",
      "score": 2,
      "created_utc": 1744463811.0,
      "replies": []
    },
    {
      "id": "mmq9x9r",
      "author": "Three_Stacks",
      "body": "My dad had a 3D TV. So dumb",
      "score": 2,
      "created_utc": 1744464429.0,
      "replies": [
        {
          "id": "mmqcvaz",
          "author": "None",
          "body": "I have a 3-D TV. Never used it for 3-D. Didn’t buy it for 3-D. Why is it dumb?",
          "score": 3,
          "created_utc": 1744465497.0,
          "replies": [
            {
              "id": "mmr4sbo",
              "author": "RaymondBeaumont",
              "body": "Same as an 8k TV is dumb if you are never going to use the feature that brought up the price.",
              "score": 1,
              "created_utc": 1744474572.0,
              "replies": [
                {
                  "id": "mmrae2i",
                  "author": "None",
                  "body": "I bought mine as Panasonic exited plasma TVs. I bought it for less than half of original MSRP. But I get what you’re saying.",
                  "score": 1,
                  "created_utc": 1744476336.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mmqo7ml",
      "author": "Orbmetal",
      "body": "8k cameras best use is the ability to re-frame in your edit while keeping the quality high",
      "score": 2,
      "created_utc": 1744469308.0,
      "replies": []
    },
    {
      "id": "mmrhosl",
      "author": "Zaptruder",
      "body": "I'm sitting 2m (6.5') back from my 77\" TV right now. I think I could get some benefit from an 8k display... at the very least I can do resolution scaling at 200% and get really nice crispy text.\n\n... alternatively I could move closer to the TV and get more desktop realestate for my computer.\n\nOutside of that... yeah... not sure where the practical benefits are for 8k.",
      "score": 2,
      "created_utc": 1744478529.0,
      "replies": []
    },
    {
      "id": "mmrozlz",
      "author": "angusalba",
      "body": "Most people will never have a screen big enough or a room the right size to ever make the angular resolution of an 8K screen mean anything\n\nThat that’s before we deal with interconnect and data rates",
      "score": 2,
      "created_utc": 1744480752.0,
      "replies": []
    },
    {
      "id": "mms92sk",
      "author": "jaredearle",
      "body": "8K cameras make sense though. There is a lot of 4K cropping/zooming available in an 8K frame.",
      "score": 2,
      "created_utc": 1744487372.0,
      "replies": []
    },
    {
      "id": "mmszifu",
      "author": "Wazza17",
      "body": "8k TVs joins a long line of dumb decisions made in the industry.",
      "score": 2,
      "created_utc": 1744496430.0,
      "replies": []
    },
    {
      "id": "mmtu81o",
      "author": "NumbN00ts",
      "body": "8k and above would be great in cinema and that’s about it. 4K for TVs are great, and for computers, you’re having to scale things to make them useful.",
      "score": 2,
      "created_utc": 1744508309.0,
      "replies": []
    },
    {
      "id": "mmwss01",
      "author": "ajohns7",
      "body": "Nobody can afford to buy your shit, as well as, buying INTO your shit. \n\n\nNo 8k content. No noticeable difference between 4k and 8k. Prices are outrageous. \n\n\nDid I mention NO 8K CONTENT??",
      "score": 2,
      "created_utc": 1744558830.0,
      "replies": []
    },
    {
      "id": "mmz1v3a",
      "author": "x31b",
      "body": "I don’t blame them. \n\nI can’t get broadcast content in even 4k. Even the Super Bowl was 4k, downscaled to 1080, the upscaled for (limited) 4k distribution. Until we get real 4’ content, there’s no need for 8k displays.",
      "score": 2,
      "created_utc": 1744584885.0,
      "replies": []
    },
    {
      "id": "mmzrhah",
      "author": "dramafan1",
      "body": "Demand is low and price is too high for 8K TVs to become mainstream.\n\nMost people don’t even have OLED TVs yet either.",
      "score": 2,
      "created_utc": 1744594569.0,
      "replies": []
    },
    {
      "id": "mn0agmy",
      "author": "TheNinjaDC",
      "body": "8K cameras have 2 aspects that make it worth shooting over 4k.\n\n1), it it gives you extra info you can manipulate in editing. There is the obvious cropping, but also other things like digital stabilizing software that that takes a shaky 8k video and converts it into a smooth 4k one.\n\n2) Film projectors still definitely benefit from 8K videos.",
      "score": 2,
      "created_utc": 1744602538.0,
      "replies": []
    },
    {
      "id": "mmq85a3",
      "author": "Riversntallbuildings",
      "body": "Apple basically ended the “resolution wars” with “Retina Display” - It’s a great marketing tactic to remind consumers…”yeah you can pay for more resolution, but your eyes won’t notice this difference and you’ll also be lowering your battery life, and needing a ton more storage for higher “quality” files that you really can’t tell the difference” \n\nAt least on a phone.\n\nSeems like Sony is finally understanding this nuance.",
      "score": 2,
      "created_utc": 1744463760.0,
      "replies": []
    },
    {
      "id": "mmr4cvr",
      "author": "Cosmicpsych",
      "body": "But the PS5 supports 8k!!! \n/s",
      "score": 2,
      "created_utc": 1744474435.0,
      "replies": []
    },
    {
      "id": "mmrxrae",
      "author": "Medium_Banana4074",
      "body": "Makes sense. Ignoring the lack of 8k material, the difference between 4k and 8k in daily use is negligible, even with giant screens. The jump from analog to digital media was immense, the jump from SD to FullHD was another level of quality again, but already the jump from FullHD to 4k is - if noticable - no longer life-changing. And I bet many people wouldn't really see a big difference between 4k and 8k. Not big enough to warrant the cost anyway.",
      "score": 2,
      "created_utc": 1744483583.0,
      "replies": []
    },
    {
      "id": "mms2cxj",
      "author": "Durahl",
      "body": "Anything beyond 4K outside of a Cinema Screen ***OR*** in VR Headsets is pure bullshit...\n\nI had a black dead pixel on my back then 4K 75\" TV which I only realized was there when I checked for damage after moving while the screen was set to a monochrome white background ( old and [new TV being used as HTPC / Console Screen](https://i.imgur.com/2tAOQLa.jpeg) ) and said dead Pixel was ***ONLY*** observable at less than half the recommended ( and utilized ) viewing distance ( roughly 3m for a 77\" ).\n\nYou already cannot see the pixels at 4K and at 8K on the same Screen size / viewing distance you can see them even less.\n\nThe ***ONLY*** Desktop related situation where a higher DPI might be of interest would be in the medical field when it comes to studying the likes of ultra high resolution MRI - Anything else again, pure BS.",
      "score": 2,
      "created_utc": 1744485128.0,
      "replies": []
    },
    {
      "id": "mmprzup",
      "author": "None",
      "body": "I just don’t know how many Ks I really need",
      "score": 1,
      "created_utc": 1744456601.0,
      "replies": []
    },
    {
      "id": "mmpsb8b",
      "author": "Basshead404",
      "body": "The only use case I could think of is a multi-input split screen LAN party with 4k screens for everyone to sit oddly close to.",
      "score": 1,
      "created_utc": 1744456767.0,
      "replies": []
    },
    {
      "id": "mmpu35x",
      "author": "Traffodil",
      "body": "TVs went through a huge change at the end of last century. Plasma, widescreen, HD etc. People were updating every 3 years on average, whereas before it was closer to every 15 years. Manufacturers tried to keep these new enhancements coming with curved screens, 3D, 8k etc but consumers aren’t buying it anymore. Plus the content just isn’t there to utilise many of these new technologies.",
      "score": 1,
      "created_utc": 1744457676.0,
      "replies": [
        {
          "id": "mmpzhaf",
          "author": "firedrakes",
          "body": "the average 3 year qoute was due to that how long a tv 50 inches and up last. due to brown out damage.",
          "score": 1,
          "created_utc": 1744460193.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmpya50",
      "author": "Slartytempest",
      "body": "Try finding 3D movies for my Sony 3D tv…",
      "score": 1,
      "created_utc": 1744459657.0,
      "replies": []
    },
    {
      "id": "mmpzjrk",
      "author": "Frosten79",
      "body": "This sounds similar to when they released 3D TVs for the home market.",
      "score": 1,
      "created_utc": 1744460223.0,
      "replies": []
    },
    {
      "id": "mmq5ss9",
      "author": "Warskull",
      "body": "Gaming really helped 4k gain a foothold. Cable was still 1080p and stream services were slowly getting shows in 4k. The PS4 Pro was a huge catalyst to drive it.\n\n8k is out of reach for a 5090 for most games, so the PS6 likely won't be able to do it outside of massive upscaling. There also isn't any 8k streaming content.\n\nThen you have the quality improvement issue. Most people have 55\" or 65\" TVs for a main TV. 4K already hits 100 pixels per degree (ppd) at 6 feet away and 65\" TVs are 100 ppd at 7 feet away. Apple Retina aims for being over 60 ppd to make sure you can't see any pixel artifacts. Vision experts don't 100% agree most of of them say between 60 and 100 pixels per degree you aren't seeing the pixels. The 100 pixel per degree argument is also more of a young person with better than 20/20 vision. So in usage situations a lot of people won't see the content quality difference.",
      "score": 1,
      "created_utc": 1744462853.0,
      "replies": [
        {
          "id": "mmqcsje",
          "author": "DGSmith2",
          "body": "Personally if either the new Xbox or PS try and claim they can run games in 8K I will be avoiding them.",
          "score": 2,
          "created_utc": 1744465470.0,
          "replies": [
            {
              "id": "mmrg8og",
              "author": "Jon_TWR",
              "body": "The *PS5* said it supported 8K on the box at launch. I believe that was removed from newer packaging, though.\n\nIt never meant it supported 8K gaming, just that it could output a signal compatible with 8K TVs (which it can, because it supports HDMI 2.1).\n\nI guess Sony expected 8K TVs to take off the same way 4K TVs did.",
              "score": 1,
              "created_utc": 1744478104.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mmq8ujm",
      "author": "hyperforms9988",
      "body": "I never understood the point of these for home use.  Sure, it's cool in concept, but without the content, what's the point?  The only realistic use case I can think of for these would've been for businesses... to display something in ultra high definition in presentation rooms, maybe in showcase floors, etc, where it's hooked up to a computer or something and you're outputting content that you yourself have put together specifically for that resolution to take advantage of it to sell people on shit.  If you weren't putting the content together yourself, nobody else was going to.\n\nAs a commercial product for people in homes and shit... it didn't make any sense without the content.",
      "score": 1,
      "created_utc": 1744464025.0,
      "replies": []
    },
    {
      "id": "mmqg9tm",
      "author": "Lower_Fan",
      "body": "The worse thing about 8k tvs is that they always use a panel that's 1 or 2 steps below the best one available. If I had money for an 8k TV I also want the latest panel tech. ",
      "score": 1,
      "created_utc": 1744466659.0,
      "replies": []
    },
    {
      "id": "mmqhwj8",
      "author": "mello-t",
      "body": "Even more far and few?   The actual 8k content.",
      "score": 1,
      "created_utc": 1744467208.0,
      "replies": []
    },
    {
      "id": "mmqpr6m",
      "author": "Wassersammler",
      "body": "I have been saying for years that 8k is just not necessary on a consumer level.",
      "score": 1,
      "created_utc": 1744469812.0,
      "replies": []
    },
    {
      "id": "mmqqji8",
      "author": "jtfjtf",
      "body": "Content still needs to catch up to 4k.",
      "score": 1,
      "created_utc": 1744470067.0,
      "replies": []
    },
    {
      "id": "mmqut8p",
      "author": "jert3",
      "body": "Huh. We just gonna stop at 4k?",
      "score": 1,
      "created_utc": 1744471447.0,
      "replies": []
    },
    {
      "id": "mmqvw3z",
      "author": "PJ_charlie",
      "body": "Is it true that our brains/eyes can’t really even process more fidelity than 4k?",
      "score": 1,
      "created_utc": 1744471796.0,
      "replies": [
        {
          "id": "mmqwf87",
          "author": "Chronotaru",
          "body": "This depends how close you are, but the idea that 8k is too high resolution to make any distinguishable difference in regular TV use is correct.",
          "score": 4,
          "created_utc": 1744471966.0,
          "replies": []
        },
        {
          "id": "mn4kfsd",
          "author": "Sirisian",
          "body": "Humans see around ~85 pixels per degree (PPD). While we have hyperacuity it's more for detecting changes in high contrast changes. (Like seeing a blade of grass move far away for hunting). Plug in your TV here and distances to get the PPD:\n\nhttps://phrogz.net/tmp/ScreenDensityCalculator.html\n\nIf you enter your monitor and distance it'll be around 60-85 PPD usually.",
          "score": 1,
          "created_utc": 1744664286.0,
          "replies": []
        },
        {
          "id": "mmr3dly",
          "author": "redbeard0610",
          "body": "That was the rumor between non hd and 1080p as well. Idk about you but I can tell the differences from an old school box TV to 1080p quite easily and 4k is that much better. But offering 8k is a bit extreme, especially with the low numbers of true 4k content we have out. \n\nPersonally I think the higher quality pictures in movies really make the props look faker in many cases, so I prefer 1080 or 1440 if possible.",
          "score": 0,
          "created_utc": 1744474127.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmr1cte",
      "author": "KidRed",
      "body": "Get ready for 4D I guess? They need new marketing gimmicks to sell sets every year.",
      "score": 1,
      "created_utc": 1744473495.0,
      "replies": []
    },
    {
      "id": "mmr1fob",
      "author": "AncientHawaiianTito",
      "body": "I mean, that’s fine. I feel like there’s more pressing issues at the moment",
      "score": 1,
      "created_utc": 1744473519.0,
      "replies": []
    },
    {
      "id": "mmr2vgf",
      "author": "BigBootyKim",
      "body": "There’s zero market for 8K TVs when high quality 4Ks are still unaffordable",
      "score": 1,
      "created_utc": 1744473969.0,
      "replies": []
    },
    {
      "id": "mmr36ed",
      "author": "lastdarknight",
      "body": "worked for bestbuy when 8k first came around, even the Samsung and Sony trainings couldn't come up with a decent selling point for them other than pixel density",
      "score": 1,
      "created_utc": 1744474064.0,
      "replies": []
    },
    {
      "id": "mmr5lef",
      "author": "Ramen536Pie",
      "body": "I don’t even know where you get native 8K content, especially in enough ways to warrant buying a more expensive TV with that capability ",
      "score": 1,
      "created_utc": 1744474828.0,
      "replies": []
    },
    {
      "id": "mmr6k5s",
      "author": "Sjoerd93",
      "body": "Lol, I don’t even have any plans to replace my 1080p TV in the next 5 years or so. Let alone get an 8K one.",
      "score": 1,
      "created_utc": 1744475129.0,
      "replies": []
    },
    {
      "id": "mmrb7jn",
      "author": "AnonBaca21",
      "body": "I still watch most stuff on an HD Panasonic plasma and it looks just as good if not better than the higher res TVs I have and have seen.\n\nIt’s more important that you’re capturing at a higher resolution than viewing at a higher resolution. \n\nMost of the TV tech innovations of the past 10-15 years is useless marketing bullshit.",
      "score": 1,
      "created_utc": 1744476587.0,
      "replies": []
    },
    {
      "id": "mmrd23s",
      "author": "rocketmonkee",
      "body": "Content creators, device manufacturers, and access providers aren't in sync, and they haven't been for some time.\n\nIn an age when some access providers still charge an HD premium, what's the point of an 8K television?  Especially when aot of people are now consuming content on their phones.",
      "score": 1,
      "created_utc": 1744477149.0,
      "replies": []
    },
    {
      "id": "mmrdbi2",
      "author": "CellistOk3894",
      "body": "Just because it exists doesn’t mean that it should be made. The only use for 8k is high end video cameras where the extra resources can be used to reframe but the drawback is massive file sizes so it’s not really practical. ",
      "score": 1,
      "created_utc": 1744477227.0,
      "replies": []
    },
    {
      "id": "mmrdxn4",
      "author": "exomachina",
      "body": "Only reason to shoot in 8k is cropping. Literally nobody is mastering in 8k.",
      "score": 1,
      "created_utc": 1744477412.0,
      "replies": []
    },
    {
      "id": "mmrhczs",
      "author": "generalgriffin90",
      "body": "I work for a company dealing with IPTV for companies (think digital signage but also can do live content that's being filmed at any other connected site.\n\nWe worked hard to be able to do 4k and 8k because people ask for it...until they see what network it would require and the big one is actually having content.\n\nEven when we have sky news on site live filming events its still ends up being passed as HD despite the fact our system can do it \n\nEveryone wants it when taking contracts to tender but not one company has actually gone ahead with it.",
      "score": 1,
      "created_utc": 1744478433.0,
      "replies": []
    },
    {
      "id": "mmrhzrc",
      "author": "tomtomgps",
      "body": "8k makes a lot of sense for theatres since the screen is so big",
      "score": 1,
      "created_utc": 1744478621.0,
      "replies": []
    },
    {
      "id": "mmrktiv",
      "author": "LibraryBig3287",
      "body": "We good.",
      "score": 1,
      "created_utc": 1744479476.0,
      "replies": []
    },
    {
      "id": "mmrnss0",
      "author": "Griffdude13",
      "body": "Good call, 8k won’t be mainstream for a few years. I feel like we’re just getting 4K fully standardized",
      "score": 1,
      "created_utc": 1744480388.0,
      "replies": []
    },
    {
      "id": "mmrrv6o",
      "author": "obi1kenobi1",
      "body": "There is an argument that at smaller sizes 4K TV sets already don’t make sense for the average use case. Admittedly now that 65” has become the de facto standard TV size and larger 70-80” TVs aren’t as unattainable the argument is kind of outdated, but for a TV of like 50-55” at a viewing distance of 10 feet or more it’s not just overkill, the human retina isn’t capable of resolving that much detail.\n\nHonestly I think the only reason 4K became as ubiquitous as it is was because of marketing and buzzwords, along with the fact that at the electronics store you tend to get much closer to the TVs than you would at home, so the difference between the two would have been much more impressive and impactful than it would in a mundane home setting. It’s not like the average person had a *need* for a 4KTV, and in many normal use cases it would be downright impossible for them to really see a difference.\n\n8K therefore only makes sense for supersized TVs or home theater systems. At sizes of like 120” (depending of course on viewing distance) then yes, 8K would be a visible improvement, there is still room to push sharpness further. But how many of us have that setup, or even have room for that kind of setup if the TVs didn’t cost as much as a used car? It’s an extremely niche thing that will likely remain that way for a long time.\n\nThat’s not to say 8K will never see widespread use, for example when it comes to computer monitors since we sit so close to them 8K would be a noticeable improvement over 4K for very large monitors (larger than the average person uses but the size s enthusiasts and professionals often use). And for that reason I don’t really have a problem with 8K *content* existing, though there’s really no market for it yet and it doesn’t make sense to try and rush it. But for normal sized home setups, outside of some niche cases, 8K doesn’t really offer any advantage and the increase in resolution over 4K is largely wasted.",
      "score": 1,
      "created_utc": 1744481662.0,
      "replies": []
    },
    {
      "id": "mmrw5zp",
      "author": "RailGun256",
      "body": "8k wasnt even necessary in the first place. now theyll just use this as an excuse to shovel more usless AI garbage in its place",
      "score": 1,
      "created_utc": 1744483059.0,
      "replies": []
    },
    {
      "id": "mmrz6b3",
      "author": "abatwithitsmouthopen",
      "body": "Give me blu ray level 4k over streaming vs 8k. Streaming still can’t compete with blu ray even with Dolby vision and HDR.",
      "score": 1,
      "created_utc": 1744484052.0,
      "replies": []
    },
    {
      "id": "mms2ctd",
      "author": "cataath",
      "body": "The only place we really need this is in the digital viewfinder on Alpha cameras.",
      "score": 1,
      "created_utc": 1744485127.0,
      "replies": []
    },
    {
      "id": "mmsafim",
      "author": "zethuz",
      "body": "TV technology has more or less stagnated with the improvements being largely incremental",
      "score": 1,
      "created_utc": 1744487819.0,
      "replies": []
    },
    {
      "id": "mmt8w9a",
      "author": "ThatsItImOverThis",
      "body": "8K was the dumbest thing added. People barely know what 4K is and even more can’t tell the difference.",
      "score": 1,
      "created_utc": 1744499949.0,
      "replies": []
    },
    {
      "id": "mmt9fbr",
      "author": "Home_Assistantt",
      "body": "That’s because 8K is a waste of money apart from in some very extreme cases.  \n\nThe level of available true 8K material is minuscule.\n\nPeople would also need to sit even closer to TVs to see the detail. \n\nJust never gonna be worth it",
      "score": 1,
      "created_utc": 1744500144.0,
      "replies": []
    },
    {
      "id": "mmta9uz",
      "author": "Floradora1",
      "body": "For anyone that will bless me with an answer... If i want a 55\" \"dumb-as-possible\" tv for watching pretty much only YouTube on firefox plugged into a pc and that has good dark viewing levels so that you can view scenes at very low brightness levels.. What would i pick?\n\nMore specifically, my husband falls asleep watching YouTube on the tv with headphones because he has tinnitus but he doesn't like having to turn on the very yellowy blue light filter. He'd rather just turn the brightness way down.\n\nHelp on what to look for? Brands? Models?",
      "score": 1,
      "created_utc": 1744500457.0,
      "replies": []
    },
    {
      "id": "mmtcqy4",
      "author": "hindusoul",
      "body": "Keep doing R&D but no real need for consumers to have 8k unless it’s a projector or big enough for a movie theater in house",
      "score": 1,
      "created_utc": 1744501388.0,
      "replies": []
    },
    {
      "id": "mmtippw",
      "author": "Jaredlong",
      "body": "I don't believe people who claim to see a difference between 4k and 8k quality.",
      "score": 1,
      "created_utc": 1744503674.0,
      "replies": []
    },
    {
      "id": "mmtn3v9",
      "author": "Douglas_1987",
      "body": "How close to an 8k 60\" tv would I have to sit to see the difference from the same screen in 4k?",
      "score": 1,
      "created_utc": 1744505432.0,
      "replies": []
    },
    {
      "id": "mmtrn0v",
      "author": "Temporary_Maybe11",
      "body": "Give me 4k or 1080 with high bitrate anyday",
      "score": 1,
      "created_utc": 1744507256.0,
      "replies": []
    },
    {
      "id": "mmtwioj",
      "author": "hirespeed",
      "body": "I’m happy my FOMO will be relieved.",
      "score": 1,
      "created_utc": 1744509239.0,
      "replies": []
    },
    {
      "id": "mmujr47",
      "author": "None",
      "body": "i want higher refresh rate brighter oled tvs. idc about 8k",
      "score": 1,
      "created_utc": 1744519318.0,
      "replies": []
    },
    {
      "id": "mmvprca",
      "author": "Nexusyak",
      "body": "8K adoption is going to be so slow. Most people have just moved up to 4K + for a lot of them. They didn't notice a whole difference over their 1080P. A lot of people don't buy the high-end TVs. 8K is going to be for the enthusiasts for a long time. When everyone has a hundred to 150 in TV in their house and they sell them at $1,000 or less which might not be far off. Then you're going to maybe see some 8K come into the picture. The reason why. Well they'll have nothing else to upgrade. \n\nHowever \n\nTrue 8K probably is really far off because of the compression. Sending that data is not going to be easy and is not going to be cheap and everyone is going to need a really good fiber line. \n\nIn 10 years will probably be talking about it. Maybe 5 years for the hardcore enthusiast, but I don't foresee this becoming the norm anytime soon. 8K has actually been around for a while. They just don't have the infrastructure to support it.",
      "score": 1,
      "created_utc": 1744544315.0,
      "replies": []
    },
    {
      "id": "mmz1tdt",
      "author": "zekeman76",
      "body": "There’s really no need. 4k is awesome and the jump to 8k is really not needed especially at the cost.",
      "score": 1,
      "created_utc": 1744584868.0,
      "replies": [
        {
          "id": "mn1cwil",
          "author": "jasonthebald",
          "body": "We've got some 8k tvs here in Brazil for about the price of an equally-sized oled, but pixels obviously don't equal panel quality.",
          "score": 1,
          "created_utc": 1744625212.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mn02szr",
      "author": "Birddogtx",
      "body": "Call me an old man, but I don’t care for much past 4K. Its just not necessary.",
      "score": 1,
      "created_utc": 1744599128.0,
      "replies": []
    },
    {
      "id": "mn096gd",
      "author": "ArchonTheta",
      "body": "The human eye won’t notice much past 5k. Waste of time and money.",
      "score": 1,
      "created_utc": 1744601942.0,
      "replies": [
        {
          "id": "mn14zyi",
          "author": "BiteMyQuokka",
          "body": "Depends how big the screen is",
          "score": 1,
          "created_utc": 1744620147.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mn4fov9",
      "author": "MercilessOcelot",
      "body": "Good.  Let's focus on something else.\n\n\nTVs were a consistent resolution for most folks for decades in the analog era.  I'd rather that TVs come with better built-in sound.",
      "score": 1,
      "created_utc": 1744662840.0,
      "replies": []
    },
    {
      "id": "mmpmunv",
      "author": "ChrisFhey",
      "body": "Understandable. 8K is absolutely worthless. Even 4K is debatable, since most 4K content (like streaming) is barely better than high quality 1080p.",
      "score": 0,
      "created_utc": 1744453705.0,
      "replies": [
        {
          "id": "mmpoej3",
          "author": "Gavin777",
          "body": "If you are watching on a big screen TV at the optimal viewing distance, 4k is significantly better than 1080p both in streaming, gaming and native non-compressed format. Huge difference..... you really need at least a 75\" screen or bigger to appreciate it.",
          "score": 0,
          "created_utc": 1744454632.0,
          "replies": [
            {
              "id": "mn0xljl",
              "author": "FlashyHeight9323",
              "body": "I think the mention of optimal viewing distance is lost on people. So many of us are sitting way closer than intended",
              "score": 1,
              "created_utc": 1744615340.0,
              "replies": []
            },
            {
              "id": "mmqdpnd",
              "author": "Sopel97",
              "body": "> you really need at least a 75\" screen or bigger to appreciate it\n\nnonsensical statement",
              "score": 1,
              "created_utc": 1744465786.0,
              "replies": [
                {
                  "id": "mmso4sw",
                  "author": "Gavin777",
                  "body": "If you have a decently large room it is a practical size. Nonsensical perception on your behalf buddy...",
                  "score": 0,
                  "created_utc": 1744492407.0,
                  "replies": [
                    {
                      "id": "mmspezg",
                      "author": "Sopel97",
                      "body": "it does not depend on the size of the room, it does not depend on the size of the tv, it depends on the field of view",
                      "score": 1,
                      "created_utc": 1744492855.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mmq0tsq",
              "author": "ChrisFhey",
              "body": "Eh. The bitrate for streamed 4K is barely better than my 1080p blurays if at all and gaming (unless you're on PC) is just upscaled 4K, so nowhere near as good as real 4K. \n\n> you really need at least a 75\" screen or bigger to appreciate it\n\nThat makes it even less worth it. I don't know what the situation is in the US, but almost nobody has a TV that's larger than 65\" here.",
              "score": 0,
              "created_utc": 1744460788.0,
              "replies": [
                {
                  "id": "mmso98b",
                  "author": "Gavin777",
                  "body": "I am from Australia, and large screen 4k TV's are very common here buddy....",
                  "score": 1,
                  "created_utc": 1744492450.0,
                  "replies": [
                    {
                      "id": "mmta0ma",
                      "author": "ChrisFhey",
                      "body": "Yes. And?",
                      "score": 1,
                      "created_utc": 1744500363.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mn13x0d",
                  "author": "Mystockingsareripped",
                  "body": "We like our TVs big in the US 😈",
                  "score": 1,
                  "created_utc": 1744619439.0,
                  "replies": [
                    {
                      "id": "mn144pw",
                      "author": "ChrisFhey",
                      "body": "Don't get me wrong, I think a huge TV is cool, but almost nobody has one around here. I wouldn't even know where to put it either. I simply don't have the space for it. 😅",
                      "score": 1,
                      "created_utc": 1744619580.0,
                      "replies": [
                        {
                          "id": "mn146ac",
                          "author": "Mystockingsareripped",
                          "body": "Come on share your country which are you in?",
                          "score": 1,
                          "created_utc": 1744619608.0,
                          "replies": [
                            {
                              "id": "mn159zj",
                              "author": "ChrisFhey",
                              "body": "I'm from Belgium.",
                              "score": 1,
                              "created_utc": 1744620326.0,
                              "replies": [
                                {
                                  "id": "mn15cbr",
                                  "author": "Mystockingsareripped",
                                  "body": "Dope how’s the chocolate",
                                  "score": 1,
                                  "created_utc": 1744620370.0,
                                  "replies": [
                                    {
                                      "id": "mn16wdz",
                                      "author": "ChrisFhey",
                                      "body": "Quite addicting I have to say. Highly recommend getting some if you're ever in this part of the world. :)",
                                      "score": 2,
                                      "created_utc": 1744621386.0,
                                      "replies": [
                                        {
                                          "id": "mn16yhg",
                                          "author": "Mystockingsareripped",
                                          "body": "Is there a specific bakery or store or brand you recommend?",
                                          "score": 2,
                                          "created_utc": 1744621424.0,
                                          "replies": [
                                            {
                                              "id": "mn1om1j",
                                              "author": "ChrisFhey",
                                              "body": "My favourite is actually Cote d'Or milk chocolate which is available in pretty much every shop. It has a unique flavour profile compared to most other store bought chocolates.\n\nBut if you want something fancy, there's Dominique Persoone in Bruges. He's one of the most famous Belgian chocolatiers and he makes some really nice chocolates.",
                                              "score": 2,
                                              "created_utc": 1744631267.0,
                                              "replies": [
                                                {
                                                  "id": "mn1pw55",
                                                  "author": "Mystockingsareripped",
                                                  "body": "Ugh thank u so so much! I am actually an avid Europe traveler but have never been to Belgium yet!! Now I have the perfect excuse.",
                                                  "score": 2,
                                                  "created_utc": 1744631838.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mmq3b77",
          "author": "Stingray88",
          "body": "The worth of 4K is absolutely not debatable at all.",
          "score": 0,
          "created_utc": 1744461848.0,
          "replies": [
            {
              "id": "mmqf1yv",
              "author": "ChrisFhey",
              "body": "Absolutely is. We're debating it as we speak. I have a 4K tv now and it doesn't feel like much of an upgrade. Might've just as well been 1080p.",
              "score": 1,
              "created_utc": 1744466247.0,
              "replies": [
                {
                  "id": "mmqs8on",
                  "author": "Stingray88",
                  "body": "It’s not. It’s worth it. Full stop. You need to get your eyes checked.",
                  "score": -3,
                  "created_utc": 1744470616.0,
                  "replies": [
                    {
                      "id": "mmroyv3",
                      "author": "ChrisFhey",
                      "body": "Okay. Whatever you say, sweetheart.",
                      "score": 0,
                      "created_utc": 1744480746.0,
                      "replies": [
                        {
                          "id": "mmrsqop",
                          "author": "Stingray88",
                          "body": "It’s not what I say, it’s just a simple fact. Just like WiFi 6GHz has more bandwidth than 5GHz, or an SSD being faster than an HDD, it’s not a matter of opinion.",
                          "score": 0,
                          "created_utc": 1744481943.0,
                          "replies": [
                            {
                              "id": "mmrunez",
                              "author": "Jon_TWR",
                              "body": "“Worth it” is opinion, not fact. You don’t seem to know the difference.\n\n“4K UHD is higher resolution than 1080p” is a fact, not a matter of opinion.\n\n“4K is worth the upgrade from 1080p” is an opinion, not a fact.",
                              "score": 1,
                              "created_utc": 1744482566.0,
                              "replies": [
                                {
                                  "id": "mmrvl3z",
                                  "author": "Stingray88",
                                  "body": ">Understandable. 8K is absolutely worthless. Even 4K is debatable, since most 4K content (like streaming) is barely better than high quality 1080p.\n\nThat’s the original comment I was replying to. They were wholesale labeling 4K as debatably worth it. That is straight up wrong. Not an opinion. It is worth it in loads of scenarios, as a matter of fact. \n\nI understand what worth it means. I understand where subjectivity comes into play. You need to understand context.",
                                  "score": -1,
                                  "created_utc": 1744482871.0,
                                  "replies": [
                                    {
                                      "id": "mmrw8pi",
                                      "author": "Jon_TWR",
                                      "body": "> It is worth it in loads of scenarios\n\nSo not all scenarios, then? It sure sounds like you’re saying it’s debatable.\n\n4K resolution is not *always* worth the upgrade over 1080p. That is why it’s debatable. You are agreeing with this and participating in debating it all while claiming it’s not debatable.\n\nYou are wrong, just admit it and move on.",
                                      "score": 1,
                                      "created_utc": 1744483084.0,
                                      "replies": [
                                        {
                                          "id": "mmrwpaa",
                                          "author": "Stingray88",
                                          "body": ">So not all scenarios, then? \n\nCorrect. \n\n>It sure sounds like you’re saying it’s debatable.\n\nNo. I’m not. Again, we’re talking about *general* worth, in the context of them saying 8K being absolutely worthless (which is also not true, see VR). We’re not talking about situational worth. \n\n>4K resolution is not always worth the upgrade over 1080p. That is why it’s debatable. You are agreeing with this and participating in debating it all while claiming it’s not debatable.\n\nRead. The. Context. Of. The. Comment. You. Replied. To. \n\n>You are wrong, just admit it and move on.\n\nI’m not, and I will not.",
                                          "score": -1,
                                          "created_utc": 1744483236.0,
                                          "replies": [
                                            {
                                              "id": "mmrxi9b",
                                              "author": "Jon_TWR",
                                              "body": "Nah, you’re wrong and it’s not debatable. You’re attempting to move the goalposts. I read the context—I read every comment in the chain, and your attempt to twist the context to make yourself right is laughable. \n\nSince you’re so obviously wrong and unwilling to admit it, it’s no longer worth my time to engage with you. Feel free to reply, but I will no longer be responding to you.",
                                              "score": 1,
                                              "created_utc": 1744483500.0,
                                              "replies": [
                                                {
                                                  "id": "mmrxv1h",
                                                  "author": "Stingray88",
                                                  "body": ">Nah, you’re wrong and \n\nI’m not. \n\n>it’s not debatable.\n\nI agree lol it’s not debatable. \n\n>You’re attempting to move the goalposts. \n\nI’m not. \n\n>I read the context—I read every comment in the chain, and your attempt to twist the context to make yourself right is laughable.\n\nClearly you did not. \n\n>Since you’re so obviously wrong and unwilling to admit it, it’s no longer worth my time to engage with you. Feel free to reply, but I will no longer be responding to you.\n\nGood riddance.",
                                                  "score": 0,
                                                  "created_utc": 1744483617.0,
                                                  "replies": [
                                                    {
                                                      "id": "mmtbmdu",
                                                      "author": "ChrisFhey",
                                                      "body": "> I agree lol it’s not debatable.\n\nThat's funny coming from the person who said context was important, since you pulled that one out of context completely. 🤣",
                                                      "score": 0,
                                                      "created_utc": 1744500958.0,
                                                      "replies": [
                                                        {
                                                          "id": "mmtl4m0",
                                                          "author": "Stingray88",
                                                          "body": "Yeah, that was part of the joke I was making, hence the \"lol\". Funny how that works, right?",
                                                          "score": 0,
                                                          "created_utc": 1744504627.0,
                                                          "replies": [
                                                            {
                                                              "id": "mmtlyhh",
                                                              "author": "ChrisFhey",
                                                              "body": "Joke. Right…",
                                                              "score": 0,
                                                              "created_utc": 1744504968.0,
                                                              "replies": [
                                                                {
                                                                  "id": "mmtmxbl",
                                                                  "author": "Stingray88",
                                                                  "body": "Yes. Again... hence the \"lol\". That is what that implies. Sorry english is so hard for you.",
                                                                  "score": 0,
                                                                  "created_utc": 1744505360.0,
                                                                  "replies": []
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mmtaffs",
                              "author": "ChrisFhey",
                              "body": "Exactly the same as WiFi 6GHz, yes. More bandwith? Absolutely. Worth it? Depends. You're not making the argument you think you are here, buddy. But by all means, keep being angry. :)",
                              "score": 0,
                              "created_utc": 1744500514.0,
                              "replies": [
                                {
                                  "id": "mmtl1jj",
                                  "author": "Stingray88",
                                  "body": "> Exactly the same as WiFi 6GHz, yes. More bandwith? Absolutely. Worth it? Depends.\n\nNo. It doesn't depend. It is generally worth it. Does it depend on the circumstances? Yes. But given any and all circumstances, does it have worth? Yes.\n\n>You're not making the argument you think you are here, buddy.\n\nYes I am. You said the worth of 4K was debatable. It's not. It has worth. Period. By the way, so does 8K in certain applications, like VR.\n\n>But by all means, keep being angry. :)\n\nI'm not angry.",
                                  "score": 0,
                                  "created_utc": 1744504592.0,
                                  "replies": [
                                    {
                                      "id": "mmtlv2q",
                                      "author": "ChrisFhey",
                                      "body": ">\tDoes it depend on the circumstances? Yes.\n\nExactly. Debatable. Thank you for proving my point.",
                                      "score": 0,
                                      "created_utc": 1744504929.0,
                                      "replies": [
                                        {
                                          "id": "mmtmtsr",
                                          "author": "Stingray88",
                                          "body": "Except you know... I didn't. \n\nContext matters. The context of your comment was that you said 8K was absolutely worthless. I guess you need me to explain what the word \"absolutely\" means... but that implies in all circumstances. Given that context, you implied that 4K was debatably worth it in all scenarios. That's clearly fucking wrong.\n\nMaybe try not to word things in absolutes next time if you don't actually mean it? Might work better for you.\n\nEDIT: Yeah. Replied and then blocked me. That sure shows us all you stand up for the crap you're spewing. I'll just respond in edit.\n\n>Again, thank you for proving my point. \n\nExcept you know... I didn't. At all.\n\n>I said 8K is absolutely worthless. The “absolutely” doesn’t extend to the 4K part. \n\nYes. It does. You said 8K is absolutely worthless (which again, is also wrong, see VR), and then said it was debatable for 4K. Given that context, \"absolutely\" does extend to the following sentence. If you didn't mean that, that's your problem, that's what you wrote.\n\n>For someone who shames others about their knowledge of the English language, yours sure isn’t up to standards either…\n\nNah I'm good.\n\n>Anyway, I’m just going to ignore your nonsense now. \n\nGood riddance.\n\n>Enjoy being wrong. :)\n\nI'm not.",
                                          "score": 0,
                                          "created_utc": 1744505320.0,
                                          "replies": [
                                            {
                                              "id": "mmtofun",
                                              "author": "ChrisFhey",
                                              "body": "Again, thank you for proving my point. I said **8K** is absolutely worthless. The “absolutely” doesn’t extend to the 4K part. For someone who shames others about their knowledge of the English language, yours sure isn’t up to standards either…\n\nAnyway, I’m just going to ignore your nonsense now. Enjoy being wrong. :)",
                                              "score": 1,
                                              "created_utc": 1744505966.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mmqabss",
          "author": "None",
          "body": "8k is worthless, but 4k is not debatable. Even with nearly all 4k content being compressed, it is still much better than 1080p.",
          "score": -1,
          "created_utc": 1744464579.0,
          "replies": [
            {
              "id": "mmqf550",
              "author": "ChrisFhey",
              "body": "Much better is a massive overstatement. I have a 4K TV and it isn't a big upgrade over my 1080p TV at all.",
              "score": 3,
              "created_utc": 1744466277.0,
              "replies": [
                {
                  "id": "mmqht20",
                  "author": "None",
                  "body": "Idk, I think its situational and depends on what we are talking about. Specifically for the resolution, it depends on the TV size and the content itself. On a large tv, a 4k tv with 4k content is much better.",
                  "score": 1,
                  "created_utc": 1744467176.0,
                  "replies": [
                    {
                      "id": "mmqjr1w",
                      "author": "ChrisFhey",
                      "body": "Yes, that's absolutely true. For a very large TV 4K likely matters much more, but for my 55\" TV the difference is marginal. \n\nAnd content is also important, yes. I'm comparing streaming 4K to my 1080p blurays and the blurays are honestly better quality than what I'm getting from streaming. I haven't been able to make a comparison between 1080p and 4K bluray since I don't own any, but I imagine the difference would be much larger there.",
                      "score": 3,
                      "created_utc": 1744467828.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mmpu5m9",
      "author": "hardypart",
      "body": "The difference between 1080 and 4K is already miniscule, 8K is completely over the top. I have a very nice 4K OLED TV, but sometimes I'd prefer a 1080 TV so I wouldn't have to spent a boat load of money on a GPU for being able to play games without upscaling from 1080 to 4K.",
      "score": 1,
      "created_utc": 1744457711.0,
      "replies": [
        {
          "id": "mmq3o6y",
          "author": "Stingray88",
          "body": "The difference between 1080p and 4K is absolutely not miniscule. It’s quite large and very noticeable.",
          "score": 6,
          "created_utc": 1744461997.0,
          "replies": [
            {
              "id": "mmql28u",
              "author": "OramaBuffin",
              "body": "I don't even really use 4k for any of my consumer electronics and know you're right. It's a huge difference. I don't need it for gaming, I would prefer 1440p 144fps, but 4k looks *great* at standard viewing distances on TVs and monitors.",
              "score": 1,
              "created_utc": 1744468270.0,
              "replies": []
            },
            {
              "id": "mmrh1do",
              "author": "Jon_TWR",
              "body": "It depends on the content, the screen size, your viewing distance, and your eyesight.",
              "score": 1,
              "created_utc": 1744478336.0,
              "replies": [
                {
                  "id": "mmrsgru",
                  "author": "Stingray88",
                  "body": "Of course, obviously a 32” screen from 20 feet away isn’t going to look any different. But that’s not the point… the point is that the difference is not miniscule *in general*.",
                  "score": 0,
                  "created_utc": 1744481855.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mmqav37",
      "author": "IdontneedtoBonreddit",
      "body": "As long as everyone I know with an expensive TV has all the 'soap opera effect\" / added frames / picture smoothing on AND the contrast turned up so everything looks like a 1980's Kids show...",
      "score": 1,
      "created_utc": 1744464778.0,
      "replies": []
    },
    {
      "id": "mms8gor",
      "author": "xtoc1981",
      "body": "4k is already gimmick.let alone 8k",
      "score": -2,
      "created_utc": 1744487168.0,
      "replies": [
        {
          "id": "mmsh096",
          "author": "XJ--0461",
          "body": "4k isn't a gimmick. People that think that are relying too heavily on their personal and narrow point of view.",
          "score": 5,
          "created_utc": 1744490015.0,
          "replies": [
            {
              "id": "mmul7xb",
              "author": "xtoc1981",
              "body": "https://www.hellotech.com/blog/wp-content/uploads/2019/10/4k-vs-1080p-optimal-viewing-distance-1.jpg\n\nLook for gaming, there are other reasons why you have a benefit having 4k... this has more todo with game compressions and other reasons.\n\nBut for watching movies, it's defently a gimmick.",
              "score": 0,
              "created_utc": 1744520054.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mmpoipi",
      "author": "Mrjlawrence",
      "body": "Probably want to focus on 4K AI /s",
      "score": 0,
      "created_utc": 1744454698.0,
      "replies": []
    },
    {
      "id": "mmre33b",
      "author": "hexagram520",
      "body": "But I was looking forward to watching 1080p content on my 8k tv…I guess now I’ll have to move like one foot away from my old shitty 4k tv to make up the difference…",
      "score": 0,
      "created_utc": 1744477458.0,
      "replies": []
    },
    {
      "id": "mmrxrdc",
      "author": "aggalix",
      "body": "3.6K is roughly the sweet spot for how much the eye can resolve at “normal” viewing distances (the bigger the screen, the further people typically sit from it). So above 4K, most people are unlikely to be able to discern much more detail. The exception is gaming. But even then 8K is overkill for most.",
      "score": 0,
      "created_utc": 1744483583.0,
      "replies": []
    },
    {
      "id": "mmpsvci",
      "author": "Riptide360",
      "body": "China’s new 8k standard is going to end up being the winner. Japan and the US used to set these standards but I guess the torch is passing. End of an era. https://www.pcgamer.com/hardware/one-cable-to-rule-them-all-chinas-8k-ready-hdmi-and-displayport-competitor-supports-up-to-192-gbps-bandwidth-and-480-w-power-delivery-in-a-single-connection/",
      "score": -4,
      "created_utc": 1744457058.0,
      "replies": []
    },
    {
      "id": "mmpnfxv",
      "author": "Netsrak69",
      "body": "Humans don't even see in 4K, 8K is overkill.",
      "score": -7,
      "created_utc": 1744454066.0,
      "replies": [
        {
          "id": "mmpq650",
          "author": "qtx",
          "body": "> Humans don't even see in 4K, 8K is overkill.\n\nThe human eye has about [576 MP resolution](https://9meters.com/technology/highest-resolution-the-eye-can-see).\n\n4k is 8.3MP.",
          "score": 3,
          "created_utc": 1744455626.0,
          "replies": []
        }
      ]
    }
  ]
}