{
  "post": {
    "title": "PCGH demonstrates why 8GB GPUs are simply not good enough for 2025 ",
    "author": "a_Ninja_b0y",
    "id": "1i176s1",
    "score": 368,
    "created_utc": 1736864735.0,
    "selftext": "",
    "num_comments": 121,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i176s1/pcgh_demonstrates_why_8gb_gpus_are_simply_not/"
  },
  "comments": [
    {
      "id": "m73nfcf",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736864736.0,
      "replies": []
    },
    {
      "id": "m73or34",
      "author": "OrganicKeynesianBean",
      "body": "Me, a GTX 970 user: 🫠",
      "score": 182,
      "created_utc": 1736865202.0,
      "replies": [
        {
          "id": "m73pvr9",
          "author": "NuclearReactions",
          "body": "Fun fact, the gtx 970 was responsible for the first vram related scandal i know of",
          "score": 130,
          "created_utc": 1736865594.0,
          "replies": [
            {
              "id": "m73uda1",
              "author": "Cruise_missile_sale",
              "body": "Got 2 free games out of that, witcher and doom. Card ran them fine. Was glad to be scandalized",
              "score": 51,
              "created_utc": 1736867084.0,
              "replies": [
                {
                  "id": "m73wlbj",
                  "author": "TripleSecretSquirrel",
                  "body": "Hang on, what?! I have a 970 and never got free games!",
                  "score": 16,
                  "created_utc": 1736867796.0,
                  "replies": [
                    {
                      "id": "m73ylmv",
                      "author": "Cruise_missile_sale",
                      "body": "Can't even remember who issued it whether it was nvidea or overclockers on their behalf, took a while but both on GoG. ",
                      "score": 13,
                      "created_utc": 1736868430.0,
                      "replies": [
                        {
                          "id": "m73ztjr",
                          "author": "TripleSecretSquirrel",
                          "body": "Damn ha oh well I guess",
                          "score": 5,
                          "created_utc": 1736868811.0,
                          "replies": []
                        },
                        {
                          "id": "m76t9pq",
                          "author": "the_federation",
                          "body": "I bought 2 from Newegg, which had a promo that each card came with a code for Witcher 3. I think I contacted Newegg support about getting two codes and was able to get one for Arkham Knight.",
                          "score": 2,
                          "created_utc": 1736899660.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m74245n",
                  "author": "NuclearReactions",
                  "body": "It was a great card no doubt. Back when the entry level of the high end cards was at around 300$. (The first who parrots nvidia's indirect marketing shills claiming that 70 is mid range gets virtual punched by me, straight to the virtual teeths)",
                  "score": 9,
                  "created_utc": 1736869519.0,
                  "replies": [
                    {
                      "id": "m74ds5v",
                      "author": "Wilson-theVolleyball",
                      "body": "Nowadays the 70 is their mid range though, no? Genuinely asking. \n\n50/60 is entry and 80/90 is high end; the 70 is literally in the middle.\n\nFor a lot of people the 70 is probably more than enough but it is nonetheless the mid range offering of their current lineup.",
                      "score": 19,
                      "created_utc": 1736873024.0,
                      "replies": [
                        {
                          "id": "m74vzkf",
                          "author": "NuclearReactions",
                          "body": "In theory yes but to me it will always be 10,20,30,40 low end, 50-60 mid, 70-80 high end and 90 enthusiast. In my head it just doesn't make sense to sell a gpu for over 500$ and call it mid range",
                          "score": 5,
                          "created_utc": 1736878310.0,
                          "replies": [
                            {
                              "id": "m754wqq",
                              "author": "robbob19",
                              "body": "Yeah, but last generation they moved the numbers round and the 70 was really what would have been called a 60 previous generation. The 70ti is now the bottom of the high end. Since the pandemic Nvidia have behaved like monopoly scum. Their advantage in ray tracing and frame generation has given them too much power.",
                              "score": 8,
                              "created_utc": 1736880876.0,
                              "replies": [
                                {
                                  "id": "m757hh6",
                                  "author": "NuclearReactions",
                                  "body": "And that's why i really don't want to give them more of my money. I hope amd comes through at some point, i want to see them pulling a ryzen (or a x1*** series) on nvidia.",
                                  "score": 3,
                                  "created_utc": 1736881621.0,
                                  "replies": [
                                    {
                                      "id": "m75szd4",
                                      "author": "robbob19",
                                      "body": "Totally agree, one of the first things I turn off are dlss and ray tracing in games, they don't add enough and I go for lower resolution (1440p) with higher FPS anyway. Currently on a RTX 3070, but waiting to see what AMD does and hoping to move over to them with my next card. Nvidia is too greedy and pushing us toward an uncertain AI future.",
                                      "score": 4,
                                      "created_utc": 1736888353.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m74al44",
                  "author": "kurotech",
                  "body": "Same here ended up trading up for a 1080 super and dude was still using it up until a couple years ago",
                  "score": 2,
                  "created_utc": 1736872073.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m74918q",
              "author": "Corvain",
              "body": "Back then there was a Radeon card named \"1650 pro\". It had variataions of 256MB/512MB/1GB with different vram types and speeds like ddr/ddr2/lpddr and also was available for both AGP and PCI-EX slots. That card was around the limit of AGP slot bandwith. Because of all the variations some 256mb cards with fast vrams performed better in most games compared to 1gb but with low speed Vrams. Some AGP cards performed better than PCI-EX but some did not. Some high speed/high vram ones overperformed 1600xt(which was supposed to be the superior card). That was a short but messy period.",
              "score": 11,
              "created_utc": 1736871613.0,
              "replies": [
                {
                  "id": "m74v575",
                  "author": "NuclearReactions",
                  "body": "Man that was a different time for sure, forums were filled with users confused about specs and people who bought cards with the wrong bus occasionally popped up lol i actually almost got a saphire x1650 256mb agp but ended up getting a geforce 7600gs instead.\n\nYou also reminded be about the g80 vs g92 chip deal. The 8800gtx got released with iirc 700 something mb of vram and a 8800gts with 300 something. Cue the 8800gt that got released later with the refreshed g92 chip and 512mb, it cost half of what a gts went for and performed better. It even outperformed the gtx in some occasions.",
                  "score": 4,
                  "created_utc": 1736878065.0,
                  "replies": [
                    {
                      "id": "m754ibd",
                      "author": "uberpolka",
                      "body": "I remember doing a couple EVGA Step-up exchanges in that g80/g92 generation.",
                      "score": 2,
                      "created_utc": 1736880763.0,
                      "replies": []
                    },
                    {
                      "id": "m76fypu",
                      "author": "ExtremeFlourStacking",
                      "body": "8800gts 320mb\n\n8800gts 640mb\n\n8800gt 512mb\n\n8800gtx 768mb\n\nWhat a time it was, but man the 8000 series leap over 7000 series back then was insane. I remember my 8800gts 640mb and cracking 10k 3dmark 06 points.",
                      "score": 2,
                      "created_utc": 1736895263.0,
                      "replies": [
                        {
                          "id": "m78jfx3",
                          "author": "NuclearReactions",
                          "body": "It truly was crazy, felt like pc got to jump from one gen to the next like it was a console lol",
                          "score": 3,
                          "created_utc": 1736924686.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m74msz7",
                  "author": "UhOhOre0",
                  "body": "Damn blast from the past. I got the x700 xt when it came out as one of the first pci express cards. That thing was fucking awesome",
                  "score": 3,
                  "created_utc": 1736875666.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m742wyk",
          "author": "ray525",
          "body": "I just replaced my whole pc last year. My 970 lasted so long 🫡",
          "score": 11,
          "created_utc": 1736869762.0,
          "replies": [
            {
              "id": "m77g5ao",
              "author": "le_gasdaddy",
              "body": "I have my gtx 960 in my 3rd gen i7 3700k with 32gb of ram and two 500 GB ssd's. Since Summer  '21 when I built my ryzen 3700X machine,  It's been my 13yo nephew's acceptable  windows 10 machine (Roblox, Minecraft, BeamNG and Fortnite to name a few). Come December, when when win10 goes toes up at that point and he gets a new machine, it will claim its rightful home as my god-tier windows xp machine. I got that card in 2016 and the rest of the machine was built in 2013, with the ram going from 16 to 32 in 2019. Those parts have served our families well.",
              "score": 3,
              "created_utc": 1736907483.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m76ryqz",
          "author": "pinapple332",
          "body": "Still going. Barely. Maybe this is the year I finally get a 3070. Nah maybe next year.",
          "score": 3,
          "created_utc": 1736899223.0,
          "replies": []
        },
        {
          "id": "m77agj1",
          "author": "Starfox-sf",
          "body": "1050Ti Mobile checking in",
          "score": 2,
          "created_utc": 1736905502.0,
          "replies": []
        },
        {
          "id": "m77atpp",
          "author": "Touchit88",
          "body": "Me as a gtx 760 sli user.  Yep....",
          "score": 2,
          "created_utc": 1736905630.0,
          "replies": []
        },
        {
          "id": "m7f0xdr",
          "author": "Fadelesstriker",
          "body": "same…",
          "score": 2,
          "created_utc": 1737013102.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m73ok5q",
      "author": "touche112",
      "body": "We needed an article to tell us what we already knew?",
      "score": 174,
      "created_utc": 1736865133.0,
      "replies": [
        {
          "id": "m75632s",
          "author": "nohpex",
          "body": "It's one thing to \"know\" something, and another to *prove* it.\n\nThere are many things throughout history that we thought we knew that couldn't stand up to the scientific method of testing it.",
          "score": 22,
          "created_utc": 1736881209.0,
          "replies": []
        },
        {
          "id": "m74jwkf",
          "author": "sCeege",
          "body": "maybe a subtle dig at the statement that AMD made last year?",
          "score": 17,
          "created_utc": 1736874821.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m73od1h",
      "author": "Burntfury",
      "body": "Me with my 2060 in my laptop :(",
      "score": 67,
      "created_utc": 1736865064.0,
      "replies": [
        {
          "id": "m73vm7m",
          "author": "None",
          "body": "[deleted]",
          "score": 20,
          "created_utc": 1736867486.0,
          "replies": [
            {
              "id": "m73zqtz",
              "author": "Burntfury",
              "body": "How are the 4060 laptops? Been considering it for an upgrade as there are some reasonably priced used ones for sale.",
              "score": 3,
              "created_utc": 1736868787.0,
              "replies": [
                {
                  "id": "m74f1hu",
                  "author": "Bloody_Sunday",
                  "body": "I'm in the same position. A 2060 gaming laptop that has served me very well for many years (one of the first that came out), and now considering one with a 4060 or 4070 from the winter sales here in EU. \n\nIf you don't fall victim to the usual \"I MUST play in 4k and I SHOULD get 60fps\", they are perfectly fine for 1080 and 1440p gaming with all the recent titles. Some may need a boost from DLSS if you insist on turning on Ray Tracing, but that's expected. And there's Frame Generation there to help if you really need it in the future as well, or if you want the Ultra settings on in some of the most heavy and unoptimized titles.",
                  "score": 8,
                  "created_utc": 1736873392.0,
                  "replies": [
                    {
                      "id": "m77tt41",
                      "author": "RG_Kid",
                      "body": "I have 4060 laptop that I recently purchased (not one year old yet). I have yet to try recent AAA games (I have backlogs of years, barely even scratch the surface), but from my experience in playing my current online games. It doesn't go nearly as fast as proper desktop gaming, but close enough for my preference.",
                      "score": 2,
                      "created_utc": 1736912448.0,
                      "replies": [
                        {
                          "id": "m785yx3",
                          "author": "Bloody_Sunday",
                          "body": "By default the laptop versions of the same card have limitations to deal with size, power draw, heat dissipation etc. and if I remember correctly they have some limitations in the GPU core numbers as well. That's also to be expected when we're dealing with portable gaming...",
                          "score": 1,
                          "created_utc": 1736917537.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m74nq83",
                  "author": "Doomchick",
                  "body": "I have a surface studio 2 with a 4050 or 60 and it runs games like PoE, WoW just fine. But don't expect high games like bf5 or something. I tried bf1 and it was \"okay\"",
                  "score": 2,
                  "created_utc": 1736875933.0,
                  "replies": []
                },
                {
                  "id": "m7a7wcu",
                  "author": "PopoConsultant",
                  "body": "I have one. Mine is a 140 watt 4060 and I can run 2024 AAA games in  high settings 60 fps 1080p. The first game that my laptop struggled with is Stalker 2 granted that game is unoptimized af.\n\nOverall such a beast laptop but be prepared to play in 720p for games built with unreal engine 5 starting this year and moving forward.",
                  "score": 2,
                  "created_utc": 1736954607.0,
                  "replies": []
                },
                {
                  "id": "m7c1nx5",
                  "author": "akeean",
                  "body": "If you are looking to buy a used laptop and want to get the best bang for buck, don't be overly focused on one GPU model. For example a laptop with a 3080M 8GB will perform pretty much the same ballpark (slightly faster but depending on resolution and specific game and feature, like raytracing -obviously no FLSS FG on 30 series, but Lossless Scaling app covers that for $10) as a 4060M 8GB (depending on what wattage either runs in that specific laptop model - devil is in the detail and with laptops always check for the potential gotchas of a candidate device in reviews, i.e. overheating/throttling or hinge/keyboard/screen quality), so it comes down to price and condition. When I was shopping around last autumn, I got a formerly $2500 MSRP laptop with a 3080 for $800 in *mint* condition and <500 hours (according to the stock SSDs SMART data) usage at $500 less than any of the used 4060 laptops in my region. Going for the older, but higher tier model also got me a much nicer screen and overall build quality.\n\nAlso watch out for used laptops with Intel 13/14th gen CPUs, you never know if they were affected by the Intel voltage flaw and are permanently unstable. It's a fault that won't be immediately obvious (vs broken screen, hinges or otherwise dead laptop) until some serious or application specific usage, so it can also be harder to get a refund for this.",
                  "score": 1,
                  "created_utc": 1736973655.0,
                  "replies": [
                    {
                      "id": "m7cdxlc",
                      "author": "Burntfury",
                      "body": "I'm well aware, sadly here in South Africa. People believe that they need to get close to what they paid for their laptops on the used market 😂 so the 3080, essentially high end laptops are always pricey. And for 1080p performance it's kinda a waste. \n\nBut I was gonna grip a 4090 laptop earlier this year. But decided against it. Cause of car part upgrade reasons 😂",
                      "score": 2,
                      "created_utc": 1736977070.0,
                      "replies": [
                        {
                          "id": "m7cfjgn",
                          "author": "akeean",
                          "body": "Does it *really* need to be a laptop (i.e. can't have a desktop within \\~100km of where you need to travel and remote in at 10ms ping / 30mbit bandwith)? Laptop GPUs are usually the next step down in terms of silicon and on top of that running at lower power than the desktop version. Significantly slower and no upgrade path.",
                          "score": 1,
                          "created_utc": 1736977527.0,
                          "replies": [
                            {
                              "id": "m7ch8tt",
                              "author": "Burntfury",
                              "body": "I knows my man's. But I play most of the time in bed next to my wife. As we watch abit of the tele and chat. So it's more fun this way.",
                              "score": 2,
                              "created_utc": 1736978006.0,
                              "replies": [
                                {
                                  "id": "m7ci3kx",
                                  "author": "akeean",
                                  "body": "So you just need an tablet (i.e. galaxy pad) with a nice screen, parsec app and mouse+kb/ a gamepad (there are some nice mouse+keyboard cradles to keep on your lap, Ithink razer makes a wireless combo)) or a thin & light laptop with no dGPU (but nice screen), with the PC in the next room so no laptop will burn your marbles or make a lot of fan noise and no issue with latency or bandwith since you are on the same LAN provided your Wifi coverage isn't rubbish.",
                                  "score": 1,
                                  "created_utc": 1736978247.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m74w67h",
              "author": "HanzanPheet",
              "body": "I also have a 4060 laptop. Lenovo specifically. Great machine no complaints. Why am I supposed to be mad about VRAM? ",
              "score": 2,
              "created_utc": 1736878364.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m76yl0s",
          "author": "None",
          "body": "So man at my 3060 because I'm seriously VRAM limited because they kneecapped the laptop version compared to desktop. Games don't run slow due to the card not being fast enough but due to VRAM walls because NVIDIA decided screw you. \n\nDoing a desktop this year and the 5070 is dead on arrival to me due to VRAM so probably getting a 9070XT depending where it slots in compared to the 5070ti. 12GB is also a joke for new cards at their prices.",
          "score": 1,
          "created_utc": 1736901425.0,
          "replies": [
            {
              "id": "m77za8e",
              "author": "Burntfury",
              "body": "Yeah, but I game primarily at like 1080p 60fps. Since I play in the bed next to my life. \n\nJust that a 2060 in general is really struggling with that small ask now.",
              "score": 1,
              "created_utc": 1736914639.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m73wsz2",
      "author": "sethyourgoals",
      "body": "I want to upgrade this year but I have to be honest in saying that my EVGA RTX 2070 Super still holds up. Well worth the $500 spent in late 2019. \n\nDLSS has been a lifesaver for older generation hardware in my opinion. Often something that gets left out of these discussions.",
      "score": 33,
      "created_utc": 1736867863.0,
      "replies": [
        {
          "id": "m7458sl",
          "author": "Ipearman96",
          "body": "Honestly the only reason I'm considering upgrading my 3070 is that I'm upgrading my wife's computer this year and she only wants 3070 performance while I wouldn't mind a bump to 5070 or amds GPU.",
          "score": 11,
          "created_utc": 1736870462.0,
          "replies": []
        },
        {
          "id": "m75u8kc",
          "author": "DYMAXIONman",
          "body": "If the 9070xt is actually 4080 super performance and it's under $500 it would be good value.",
          "score": 3,
          "created_utc": 1736888743.0,
          "replies": []
        },
        {
          "id": "m74byxi",
          "author": "secret3332",
          "body": "I also have a 2070 super from late 2019. I'm seeing a lot of performance issues lately. Many games, I struggle to hit 60 fps. Elden Ring already struggled for me years ago.",
          "score": 1,
          "created_utc": 1736872488.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m746lod",
      "author": "uti24",
      "body": "Can't run ultra settings on 8GB?\n\nWell, 4060 class GPU with 16GB still can't.",
      "score": 39,
      "created_utc": 1736870877.0,
      "replies": [
        {
          "id": "m74mhrg",
          "author": "ShrikeGFX",
          "body": "The issue is that if your VRAM runs full, your performance is completely going to shit because it completely bottlenecks the rasterization. So even 7.99 is fine but if you go above 8 you can't play\n\nBut reducing texture settings by one should generally fix the issue, but since thats a 4x reduction, it might be quite noticeable (or not)",
          "score": 12,
          "created_utc": 1736875575.0,
          "replies": [
            {
              "id": "m78n7zc",
              "author": "Pelembem",
              "body": "The point is that whether you're getting 0.1 FPS or 15 FPS is irrelevant, they're both unplayable, and when you reduce the settings to make it playable you no longer need more than 8GB of VRAM, and both the 8GB and 16GB card will run just fine at 60 FPS.",
              "score": 4,
              "created_utc": 1736926991.0,
              "replies": [
                {
                  "id": "m78x8q9",
                  "author": "ShrikeGFX",
                  "body": "that is correct",
                  "score": 1,
                  "created_utc": 1736933544.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m78tp21",
          "author": "everybodyiskungfu",
          "body": "Except often enough it can. Indiana Jones won't even show you advanced ray tracing options on an 8GB card, even though the 4060 could run maybe the lowest setting, or just RT shadows to clean up the ugly shadow cascades.",
          "score": 2,
          "created_utc": 1736931174.0,
          "replies": []
        },
        {
          "id": "m755ejv",
          "author": "Noxious89123",
          "body": "\\*G**B**\n\nGb means giga**bit**, which is 1/8th of a giga**byte**.\n\n8Gb = 1GB\n\n16Gb = 2GB",
          "score": -10,
          "created_utc": 1736881016.0,
          "replies": [
            {
              "id": "m75rs92",
              "author": "ThisFreakinGuyHere",
              "body": "Nobody cares. No one is confused because every non-pedant adult understands context. Nobody talks about gigabits of memory.",
              "score": 17,
              "created_utc": 1736887921.0,
              "replies": [
                {
                  "id": "m7626i3",
                  "author": "Noxious89123",
                  "body": "We literally talk about memory **speeds** in gigabits, and we talk about the capacity of memory ICs in **gigabits**.",
                  "score": -11,
                  "created_utc": 1736891098.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m74d8gj",
      "author": "legleg4",
      "body": "It is good enough. Not everyone needs to play every major release in 4K, Ultra settings at 300 fps.",
      "score": 32,
      "created_utc": 1736872864.0,
      "replies": [
        {
          "id": "m7615k0",
          "author": "ImaRiderButIDC",
          "body": "Like sincerely I have a very mid-line gaming laptop with a 4070 on it and I get 60-150+fps on every game I’ve tried playing at FHD and high graphics, even ones that are notoriously poorly optimized.\n\nI’ve seen 4KHD at 240HZ and it is surely noticeably better, but you’re just a snob if you think that’s the bare minimum a game is playable at lmao.",
          "score": 7,
          "created_utc": 1736890799.0,
          "replies": []
        },
        {
          "id": "m74vhtw",
          "author": "new-username-2017",
          "body": "The on board graphics from my 10 year old motherboard is perfectly fine for me.",
          "score": 3,
          "created_utc": 1736878167.0,
          "replies": [
            {
              "id": "m74x39r",
              "author": "PajamaDuelist",
              "body": "Ahh a Dwarf Fortress fan, I see",
              "score": 8,
              "created_utc": 1736878628.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m78p4ab",
          "author": "everybodyiskungfu",
          "body": "Plenty of newer games crumble at 1080p already and fps has little to do with it. You can reduce settings, but the point is that you wouldn't need to if Nvidia didn't sell you a VRAM starved card.",
          "score": -3,
          "created_utc": 1736928185.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m73rn5l",
      "author": "NurgleTheUnclean",
      "body": "I'm very dubious of these results.  Forza horizon 5  plays great on a Vega 56.  There's some misconfiguration shit going on.  GPU has way more to do performance than vram.",
      "score": 28,
      "created_utc": 1736866189.0,
      "replies": [
        {
          "id": "m75pn0j",
          "author": "None",
          "body": "[deleted]",
          "score": 9,
          "created_utc": 1736886981.0,
          "replies": [
            {
              "id": "m780dob",
              "author": "lorsch525",
              "body": "They mentioned the will do similar tests for Intel and Nvidia cards soon.",
              "score": 2,
              "created_utc": 1736915100.0,
              "replies": [
                {
                  "id": "m783swl",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1736916564.0,
                  "replies": [
                    {
                      "id": "m78v1ls",
                      "author": "lorsch525",
                      "body": "It's in the original article from pcgh (or maybe only the video)",
                      "score": 2,
                      "created_utc": 1736932067.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m78rtva",
              "author": "everybodyiskungfu",
              "body": "You are missing the point/that's not how it works. Yes fast VRAM helps with performance just like fast RAM does, but if it's full it's full and fps will plummet. 8GB isn't magically \"10-11GB\". This is Nvidia fucking you over on VRAM: https://imgur.com/a/Jubj510",
              "score": 0,
              "created_utc": 1736929934.0,
              "replies": [
                {
                  "id": "m79ef5u",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1736943609.0,
                  "replies": [
                    {
                      "id": "m79l4yv",
                      "author": "everybodyiskungfu",
                      "body": "This is so weird, idk what to tell you. You are in a thread about an article proving with various benchmatks that 8GB is not enough for gaming in 2025. And they are right, modern features cost a lot of VRAM, 8GB increasingly doesn't cut it. Indiana Jones won't even show you path tracing options on an 8GB card because the feature requires a lot of VRAM, no matter how fast the card is.\n\nIf your point is that you can always turn settings down to make the game fit your VRAM... well yeah, obviously. It's implied that they are talking about the requirements for max or near max settings. It's advice for buyers too, who wants to spend hundreds on a new card and then immediately turn down textures or whatever.",
                      "score": 2,
                      "created_utc": 1736946568.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m74b2xm",
          "author": "101m4n",
          "body": "I think it's more that if you don't have enough it can fall over completely. It's not so much a performance thing.",
          "score": 9,
          "created_utc": 1736872221.0,
          "replies": [
            {
              "id": "m75s738",
              "author": "ThisFreakinGuyHere",
              "body": "But that's not how this works. Nothing \"falls over completely\" it just runs at a few less frames per second",
              "score": -3,
              "created_utc": 1736888090.0,
              "replies": [
                {
                  "id": "m77eyk4",
                  "author": "101m4n",
                  "body": "No. If you don't have enough graphics memory to store all the assets a game needs to render a frame, it has to swap stuff between system memory and graphics memory. If this happens only a little, it can be okay. But if it happens a lot, the game becomes unplayable and sometimes unstable.\n\nThe GPU buys you the framerate, the vram gets you the ability to reliably run stuff that requires x amount of vram.\n\nIf your GPU has too little compute, you can always lower settings or accept a lower framerate. If you've got too little vram, you're usually stuffed.\n\nThis is why Nvidia is stingy with vram. They know it limits the lifespan of their cards and keeps sales up in the face of diminishing year on year performance improvements.",
                  "score": 4,
                  "created_utc": 1736907069.0,
                  "replies": [
                    {
                      "id": "m78gjyp",
                      "author": "CosmicCreeperz",
                      "body": "If you have too little RAM you just turn down the resolution.\n\nAnd a big reason threy are “stingy” with RAM is because GDDR is expensive.  A major reason the 5090 costs $2000 is all that extra GDDR7.",
                      "score": 1,
                      "created_utc": 1736923020.0,
                      "replies": [
                        {
                          "id": "m79615k",
                          "author": "101m4n",
                          "body": "Resolution will reduce memory used for frame buffers and other intermediate buffers tied to screen size, but won't have any effect on other game assets. Reducing texture resolution can help, but such things will only help you to an extent. Memory usage tends to be much less tunable than compute.\n\nGenerally speaking though, if you have an amount of vram that is still common in the install base at the time a game is released, you can probably expect that game to fit as _one_ of its presets.",
                          "score": 1,
                          "created_utc": 1736939121.0,
                          "replies": [
                            {
                              "id": "m7eawfg",
                              "author": "CosmicCreeperz",
                              "body": "Any effect? Not at all true. Modern game engines have all sorts of features to create appropriate texture caches (possibly with more aggressive texture compression), dynamic MIP map generation and streaming, etc to reduce memory usage at lower quality or resolution settings.\n\nLowering the max texture resolution used or reducing /optimizing MIP maps alone can cut RAM usage by a huge amount.  No need to load a 4k texture if you drop the resolution to 1080p…\n\nAdditionally DLSS etc can take lower res textures and interpolate higher resolution.\n\nSure, I agree there are limits and if you hit them without optimizing perf issues can be dramatic… but there are lots of techniques to reduce memory usage.",
                              "score": 1,
                              "created_utc": 1737000147.0,
                              "replies": [
                                {
                                  "id": "m7fvajp",
                                  "author": "101m4n",
                                  "body": "True enough. I imagine there are a lot of technical solutions for making best use of vram. Caching for one I imagine probably works pretty well when your textures aren't all needed at once and there is some temporal locality to their usage, which is probably a fairly common situation.\n\nBut it doesn't change the fact that, in my experience from tweaking game settings in the real world, vram usage tends to be much less tunable overall. Admittedly though, it has been a while since I have needed to think about such things.",
                                  "score": 1,
                                  "created_utc": 1737030901.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m78spek",
                          "author": "everybodyiskungfu",
                          "body": "Nvidia is stingy because they can get away with it, people don't care or don't know better. How does the same money buy a 12GB Nvidia card but a 20GB AMD card.",
                          "score": 1,
                          "created_utc": 1736930523.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m770o8l",
                  "author": "AtomicSymphonic_2nd",
                  "body": "There’s a point that if a game is unable to have a certain minimum amount of frames processed at its lowest settings/safe mode, it will crash out randomly and won’t run properly.\n\nI don’t quite know what the phenomenon is called, but I’ve seen it happen before with some AAA games on older PCs. The very next thing that happens is gamers with those older GPUs loudly complain online that the devs suck and they need to optimize their game for their 7+ year old GPUs.",
                  "score": 1,
                  "created_utc": 1736902128.0,
                  "replies": []
                },
                {
                  "id": "m78dnhe",
                  "author": "FUTURE10S",
                  "body": "I had this issue with my GTX 970. By a few, it goes from roughly 70 to 19. A very uneven 19.",
                  "score": 1,
                  "created_utc": 1736921417.0,
                  "replies": [
                    {
                      "id": "m7d91ve",
                      "author": "ThisFreakinGuyHere",
                      "body": "We're not talking about five generations ago",
                      "score": 2,
                      "created_utc": 1736986815.0,
                      "replies": [
                        {
                          "id": "m7dkwkd",
                          "author": "FUTURE10S",
                          "body": "Dude, it doesn't matter what generation, if you're out of VRAM and need to move data into DDR RAM, your frames tank.",
                          "score": 1,
                          "created_utc": 1736990823.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m74bjvw",
      "author": "Lied-",
      "body": "Meanwhile me with my GTX 770 😂 perfectly happy",
      "score": 9,
      "created_utc": 1736872364.0,
      "replies": [
        {
          "id": "m74g0ko",
          "author": "host65",
          "body": "I only bought a new card because my 280 broke…. Now have a 6600xt",
          "score": 6,
          "created_utc": 1736873677.0,
          "replies": [
            {
              "id": "m74p7c4",
              "author": "Lied-",
              "body": "I miss those old small cards :(",
              "score": 1,
              "created_utc": 1736876361.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m76zyek",
      "author": "AtomicSymphonic_2nd",
      "body": "I’m guessing PC gamers in developing nations are probably gonna be heartbroken to read this… because their wallets are broken, too.\n\nIt’s no fun being unable to afford upgrades to keep up with recent releases.\n\nBut if more games like Indiana Jones come out where rasterized graphics are not even used, and all GPUs and consoles playing it must have some form of ray-tracing capacity… that’s like the moment some years ago where 32-bit architecture CPUs were being put out to pasture.\n\nThat is total obsolescence. Not even planned… but just purely obsolete for technical reasons.\n\nFor impoverished gamers or near-poverty gamers, it was a good ride while it lasted.\n\nAt least retro games can still be played!",
      "score": 6,
      "created_utc": 1736901887.0,
      "replies": [
        {
          "id": "m780mxl",
          "author": "lorsch525",
          "body": "Settings can always be reduced",
          "score": 0,
          "created_utc": 1736915210.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m74mvth",
      "author": "TendieOverlord",
      "body": "Depends on what resolution you choose. Pushing for these high ass resolutions in every single game is wild when the average consumer is dealing with feeding themselves and keeping up with bills. No one’s concerned with if they have a 4k monitor running the newest game at 144hz.",
      "score": 10,
      "created_utc": 1736875689.0,
      "replies": []
    },
    {
      "id": "m73vuaq",
      "author": "patriotfanatic80",
      "body": "I have a 4060ti and 8gb has been fine for the most part, just can't play all new games on high settings.  At the time I bought the card was i think less than half the price of the next card up with 16gb.  If the plan is to sell a 16gb at the same price point then great.  Otherwise 8gb works just fine if you are on a budget.",
      "score": 10,
      "created_utc": 1736867557.0,
      "replies": []
    },
    {
      "id": "m73r2uh",
      "author": "DontTakeToasterBaths",
      "body": "Ah geez I cant play the most graphics intensive games at max resolution with an 8GB GPU anymore... WHEN DID THIS HAPPEN BRING BACK 2024 I GOT BETTER PERFORMANCE IN 2024.",
      "score": 20,
      "created_utc": 1736866001.0,
      "replies": [
        {
          "id": "m73tr8o",
          "author": "MrT0xic",
          "body": "Are you telling me that my Pentinum II can’t run the newest [Insert Overrated yearly franchise here]?! This is insanity!",
          "score": 6,
          "created_utc": 1736866883.0,
          "replies": [
            {
              "id": "m78nrzs",
              "author": "UrgeToKill",
              "body": "The sticker on the front said it was never obsolete!",
              "score": 1,
              "created_utc": 1736927342.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m748z2f",
          "author": "Mama_Skip",
          "body": "WHY CAN'T EVERYTHING JUST STOP WHEN I BUY SOMETHING???",
          "score": 2,
          "created_utc": 1736871595.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m740f44",
      "author": "Memphisrexjr",
      "body": "If my 1080ti can last in 2025 so can anything else.",
      "score": 16,
      "created_utc": 1736868999.0,
      "replies": [
        {
          "id": "m744a38",
          "author": "LizardFishLZF",
          "body": "The 1080 Ti has 11 GB of vram...",
          "score": 22,
          "created_utc": 1736870172.0,
          "replies": [
            {
              "id": "m745akc",
              "author": "Memphisrexjr",
              "body": "And it shall carry me to the promised land of 2026.",
              "score": 11,
              "created_utc": 1736870476.0,
              "replies": [
                {
                  "id": "m75cs10",
                  "author": "Hans_H0rst",
                  "body": "Similar boat, however i do wonder about the efficiency gains of newer architectures/drivers...\n\nI recently got a new cpu and boy, those efficiency cores and additional \"performance\" cores are a handy thing to have. Didn't expect it.\n\n[Dawid does tech stuff shows](https://youtu.be/GE7LA0JDJ78?si=LugXRggJSM0SUKoU&t=534) his 1080ti getting 2x performance at 4x power draw and being comically larger than the stubby 3050.",
                  "score": 2,
                  "created_utc": 1736883161.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m74czbh",
          "author": "YouveRoonedTheActGOB",
          "body": "I’m still running one as well. I do have a 4080 laptop that wipes the floor with it, but the 1080ti is still a decent card for 1440p mid level gaming.",
          "score": 2,
          "created_utc": 1736872788.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m74a57y",
      "author": "Eokokok",
      "body": "Reddit not being able to use graphics settings is funny, gaming outlets not being able to use them is pathetic.",
      "score": 7,
      "created_utc": 1736871941.0,
      "replies": [
        {
          "id": "m7819ky",
          "author": "lorsch525",
          "body": "They mentioned that that the recommendation to avoid 8GB cards only concerns buying new and that people might not want to reduce settings on a new 300€ card. \n\nWhich is unrealistic, these framerates on the 16GB card were often not very high and most people would change settings / use dlss / fsr.",
          "score": 3,
          "created_utc": 1736915477.0,
          "replies": [
            {
              "id": "m788haw",
              "author": "Eokokok",
              "body": "300 euro card is entry level nowadays, so not really surprising. Even more so given how poorly the average game is optimised.",
              "score": 1,
              "created_utc": 1736918739.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m74aiwa",
      "author": "firedrakes",
      "body": "Who???",
      "score": 4,
      "created_utc": 1736872055.0,
      "replies": []
    },
    {
      "id": "m783sjp",
      "author": "joker_toker28",
      "body": "1660 ti with 6gb crying over here. \n\n\n\nI need a new build lol.",
      "score": 2,
      "created_utc": 1736916560.0,
      "replies": []
    },
    {
      "id": "m741zk9",
      "author": "snajk138",
      "body": "I mean... my \"old\" 3070 has 8 GB and handily beats the RX 7600 XT in most benchmarks, even at 4K.",
      "score": 5,
      "created_utc": 1736869481.0,
      "replies": [
        {
          "id": "m74573a",
          "author": "DarthArtero",
          "body": "Different tiers of cards.",
          "score": 10,
          "created_utc": 1736870447.0,
          "replies": [
            {
              "id": "m78maiv",
              "author": "snajk138",
              "body": "Yes obviously, but it sort of goes against the conclusion in the header. It is not so much about the amount of RAM. For the RX 7600 XT specifically the connection between RAM and GPU is really slow compared to many alternatives, and that really limits its performance in higher resolutions. \n\nI'm sure my 3070 will be a bottleneck soon enough, but I think a 7600 XT would hit that sooner in most cases, even though it has twice as much memory.",
              "score": 2,
              "created_utc": 1736926407.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m74brvd",
      "author": "VanSaxMan",
      "body": "If you can show me a decent AAA title that needs such high graphics demand then, maybe? Otherwise my little old 2070S seems to be doing juuuuuust fine.",
      "score": 2,
      "created_utc": 1736872430.0,
      "replies": [
        {
          "id": "m75h9kc",
          "author": "Forcasualtalking",
          "body": "vanish steep consider follow marvelous station beneficial desert childlike start\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 1,
          "created_utc": 1736884464.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m73otmp",
      "author": "Bloodsucker_",
      "body": "Ok.\n\nIs this going to make Nvidia consumer GPU sales to fall? No? Then, ok.",
      "score": 3,
      "created_utc": 1736865226.0,
      "replies": []
    },
    {
      "id": "m776yao",
      "author": "imaginary_num6er",
      "body": "Yeah but people are gonna still buy them and show up on Steam charts",
      "score": 1,
      "created_utc": 1736904292.0,
      "replies": []
    },
    {
      "id": "m78ehdj",
      "author": "mogul26",
      "body": "Glad the 7900XT has 20gb haha. Seems overkill but should future proof it a bit. Theoretically.",
      "score": 1,
      "created_utc": 1736921872.0,
      "replies": []
    },
    {
      "id": "m79351w",
      "author": "timetobeanon",
      "body": "RIP la. I have the expensivest gpu with 8gb, i think. \n\n3070ti",
      "score": 1,
      "created_utc": 1736937349.0,
      "replies": []
    },
    {
      "id": "m7ashrm",
      "author": "QuantumQuantonium",
      "body": "Not a tldr, just what i think:\n\n8 GB gpus can still run on low end builds without issue, I have a 1050 ti with only 4 GB that still does well in modern multiplayer titles I play.  Mobile VR graphics sucks with lower vram (batman arkam shadows is the best example at an attempt of a high end game on pure mobile VR) but integrated graphics have been gradually improving with slower DDR memory too.\n\nBut thats for low end. The issue with 8 GB comes down exclusively to nvidia keeping 8 GB vram from the 2070 to 3070. From my experience the 2070 is perfectly capable for 1440p or low 4k, except its 8 gb vram hindered its overall performance (creating crashes in UE editor in particular) and prompting me to find a better GPU, then the Rx 6700xt that I still use today. Nvidia learned their lesson with the 40 series after the naming scandal.\n\nOn a technical reason more vram means more quality models and textures with less development work to create lower detail optimized models. This is good for high end visuals but not low end, where actually direct storage tech (where pcie devices like the GPU can query storage directly instead of queuing into the slow CPU) would play a bigger role in allowing rapid streaming of additional info like more polygons as the player moves, bit it seems direct storage isnt at  the effectiveness it should be and its being subsistuted for ai models...",
      "score": 1,
      "created_utc": 1736960741.0,
      "replies": []
    },
    {
      "id": "m7ex850",
      "author": "jtn050",
      "body": "I’m gonna be honest, at 1080p with a 1660ti I feel like a king with 6gb of vram (at least since I upgraded from a 2gb 1050 a couple years ago lmao). I can’t think of a time I’ve ever run out of vram. Ive only had to reduce texture quality from ultra on a couple games, which seems like a pretty minor sacrifice since it definitely still has the horsepower to run any modern game.",
      "score": 1,
      "created_utc": 1737010902.0,
      "replies": []
    },
    {
      "id": "m73pyrb",
      "author": "alexanderpas",
      "body": "Pixels per second (4K@144Hz = 100%):\n\n- 4k@144Hz: 100%\n- 4k@120Hz: 83%\n- WQHD@144Hz: 44%\n- 4k@60Hz: 41%\n- WQHD@120Hz: 37%\n- 1080p@144Hz: 25%\n- 1080p@120Hz: 20%\n- WQHD@60Hz: 18%\n- 1080p@60Hz: 10%\n- 1080p@30Hz: 5%\n\nIf the 16 GB card can do 4k@144Hz, the 8GB card is enough for basically everything.",
      "score": -3,
      "created_utc": 1736865622.0,
      "replies": [
        {
          "id": "m73v7ca",
          "author": "CryptikTwo",
          "body": "How have I never heard the term pixels per second outside of mouse scrolling if it is the be all and end all of computer performance comparisons? Please explain oh wise one, I must obtain your great knowledge.",
          "score": 5,
          "created_utc": 1736867354.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m746rl3",
      "author": "Guinea_pig_joe",
      "body": "And I'm here still rocking a AMD r9 390...still going strong. Think I can prove them wrong on that statement. Lol",
      "score": -1,
      "created_utc": 1736870928.0,
      "replies": [
        {
          "id": "m74ziyb",
          "author": "fatalityfun",
          "body": "brother my r9 390 could barely handle dead by daylight in 2016, treat yourself to an upgrade if you have the income",
          "score": 2,
          "created_utc": 1736879325.0,
          "replies": [
            {
              "id": "m752qrm",
              "author": "Guinea_pig_joe",
              "body": "I'm not playing anything that new. So I'm fine for the one or twice a year I get to play my computer.",
              "score": 2,
              "created_utc": 1736880256.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m73t8ox",
      "author": "ntropy83",
      "body": "On Linux: waiting for the first tool to create vram swap, so even a 2GB GPU becomes good again.",
      "score": -5,
      "created_utc": 1736866714.0,
      "replies": [
        {
          "id": "m747vm1",
          "author": "NancyPelosisRedCoat",
          "body": "The speed and the bandwidth of the RAM on graphics cards are so much better than normal RAM, a swap wouldn’t help at all. Locally run large language models and Stable Diffusion/Flux use the normal RAM when VRAM is full and the performance hit is just incredible to the point that it’s just not worth to use a model you can’t fit on your VRAM. That is why macs which have their RAM soldered to their motherboard are a hit as well since their RAM bandwidth is much higher. The “swap” has to be on the same board to work.",
          "score": 6,
          "created_utc": 1736871265.0,
          "replies": [
            {
              "id": "m74dzdo",
              "author": "ntropy83",
              "body": "With LLMs yes, but games are textures, most games that use a lot of VRAM are just very badly programmed libraries of 4k textures. For a vram swap you'd have to find out if there was a way to preload them before they are displayed in game maybe manage the textures with AI on the host to avoid the double loading of similiar textures. \nI'ld look into it but I am not versed with vram coding.\n\nHere is a project that uses vram as a ramdisk: https://github.com/Overv/vramfs\nCould be a starting point :)",
              "score": 1,
              "created_utc": 1736873083.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}