{
  "post": {
    "title": "Lenovo readies self-charging Bluetooth keyboard with a solar panel that can draw power from solar and ambient light",
    "author": "giuliomagnifico",
    "id": "1hngg4y",
    "score": 230,
    "created_utc": 1735310994.0,
    "selftext": "",
    "num_comments": 41,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hngg4y/lenovo_readies_selfcharging_bluetooth_keyboard/"
  },
  "comments": [
    {
      "id": "m41dwrc",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1735310995.0,
      "replies": []
    },
    {
      "id": "m41f3s0",
      "author": "PAXICHEN",
      "body": "I had one from Logitech 8 years ago.",
      "score": 128,
      "created_utc": 1735311431.0,
      "replies": [
        {
          "id": "m41fmti",
          "author": "buecker02",
          "body": "Same here. Got it replaced under warranty as well. Plus the battery wasn't supposed to be replaceable but it was just a simple coin battery.",
          "score": 42,
          "created_utc": 1735311622.0,
          "replies": [
            {
              "id": "m41v3pr",
              "author": "Youvebeeneloned",
              "body": "most solar powered devices like that typically were rechargeable cell batteries",
              "score": 13,
              "created_utc": 1735316864.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m41ftp1",
          "author": "giuliomagnifico",
          "body": "I remember it, it looked a very “Apple product”: [Logitech Wireless Solar Keyboard K760 review: Logitech Wireless Solar Keyboard K760 - CNET](https://www.cnet.com/reviews/logitech-wireless-solar-keyboard-k760-review/)",
          "score": 9,
          "created_utc": 1735311691.0,
          "replies": [
            {
              "id": "m42l9no",
              "author": "Angry_Villagers",
              "body": "Funny enough, I have a different model solar keyboard from Logitech that also looks very “Apple Product”. It has a full numpad too",
              "score": 4,
              "created_utc": 1735325192.0,
              "replies": [
                {
                  "id": "m43hmw2",
                  "author": "natefrogg1",
                  "body": "One of our accountants has that one, he loves it and will never let it go",
                  "score": 1,
                  "created_utc": 1735335671.0,
                  "replies": [
                    {
                      "id": "m4b8663",
                      "author": "PAXICHEN",
                      "body": "The spacebar went on mine.",
                      "score": 2,
                      "created_utc": 1735449146.0,
                      "replies": [
                        {
                          "id": "m4cm6fu",
                          "author": "Grimnebulin68",
                          "body": "You jump too hard? Me too.",
                          "score": 1,
                          "created_utc": 1735478532.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m42q4h2",
          "author": "chillmanstr8",
          "body": "Yeah same.. I found the model a couple months ago but they seem to have discontinued it. Was a great keyboard",
          "score": 2,
          "created_utc": 1735326741.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m429rqi",
      "author": "AlephInfinite0",
      "body": "Waiting for the keyboard that uses key depression as a means of generating power. The more you type the more the battery charges.",
      "score": 40,
      "created_utc": 1735321563.0,
      "replies": [
        {
          "id": "m42u8pp",
          "author": "-Dixieflatline",
          "body": "I made this comment like a decade ago on a tech blog and someone with way too much time on their hands actually broke down the science in to a mathematical formula that showed it would require sustained high rate typing for lengthy periods of time to \"self charge\" to any real world degree. I still have no idea if they were correct in their math and assumptions, but I didn't feel doing that level of fact checking on a passing thought. \n\nBut that was 10 years ago. Maybe technology has improved to where it is practical today. Or maybe that person was full of shit.",
          "score": 40,
          "created_utc": 1735328054.0,
          "replies": [
            {
              "id": "m43jiri",
              "author": "Thereelgarygary",
              "body": "Idk man id be okay with a keyboard with little springs in the keys that I have to add extra button pushing force to.\n.... I'm picturing a winding sound or like an electric motor sound when you press it.",
              "score": 3,
              "created_utc": 1735336290.0,
              "replies": [
                {
                  "id": "m43kw3u",
                  "author": "-Dixieflatline",
                  "body": "The trouble is that even mechanical keys that have \"long\" travel are still 4mm max. There's not a lot of captured energy per 4mm finger keystroke where button actuation happens somewhere along that path, potentially reducing the amount of kinetic energy applied to electric generation. \n\nThere are walking tiles being tested out in the world now that have only 5-10mm of travel, but they also have the force of a human stepping on them. My assumption is that the mechanical resistance is relative to the typical weight of a person, plus more area (or linear edge) for the generator than a key cap.",
                  "score": 11,
                  "created_utc": 1735336737.0,
                  "replies": [
                    {
                      "id": "m43m94n",
                      "author": "Thereelgarygary",
                      "body": "I'm not talking about using direct force, though, throw it through a multiplyer like a wind-up toy (I said spring earlier) you know those kids toy cars that you push along the floor and it goes farther than you pushed .... that mechanism.",
                      "score": 2,
                      "created_utc": 1735337193.0,
                      "replies": [
                        {
                          "id": "m4cmi7v",
                          "author": "Grimnebulin68",
                          "body": "What about fart power? Mine are preeeety potent.",
                          "score": 1,
                          "created_utc": 1735478690.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m43n1r8",
                      "author": "Thereelgarygary",
                      "body": "Flywheels! That's what I was looking for!!! Combined with magnets, can generate energy it wouldn't feel like a normal key press, though it would take longer to oress the keys as your charging the flywheel.\n..... the amount of energy it would actually generate has to be negligible, but maybee enough to power a keyboard.",
                      "score": 1,
                      "created_utc": 1735337459.0,
                      "replies": [
                        {
                          "id": "m43r4s3",
                          "author": "-Dixieflatline",
                          "body": "That's all well and good until you consider the miniaturization required to either flywheel each key or gear the entire keyboard to operate one larger flywheel. Either miniscule energy or a lot of lost energy, depending on which path. \n\nAnd don't get me wrong. I'm not trying to poo-poo your inspiration. It's the exact same thing I had. But there are, apparently, a lot of real world physics that crushed my dream and I'm just paraphrasing what I remember from 10 years ago.",
                          "score": 6,
                          "created_utc": 1735338850.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m45y5sh",
              "author": "BMLortz",
              "body": "Just make a \"kinetic charging pad\" that you pound on a couple of times, full force.  \n  \nGet that to market and send me my cut.",
              "score": 2,
              "created_utc": 1735372658.0,
              "replies": []
            },
            {
              "id": "m44c2ko",
              "author": "shalol",
              "body": "Nonsense. Other than an idle power draw, said keyboard would’ve consumed and generated a fixed amount of energy. No amount of typing would have it turn from a net loss energy balance to a net gain. It’d just be a fixed loss or gain.\n\nAt which point, it probably is a feasible idea, if not for annoyingly hard to press keys, as self-generating wireless signal doorbell buttons are a thing that works.",
              "score": 2,
              "created_utc": 1735346391.0,
              "replies": []
            },
            {
              "id": "m42yoi5",
              "author": "AlephInfinite0",
              "body": "No idea of the mechanics or physics involved. I nice thought though. \nMaybe an OnoSendai rig would have this.",
              "score": 1,
              "created_utc": 1735329493.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m48ge5i",
          "author": "None",
          "body": "Cherry MX RegenerativeBraking switches, mate youre a genius",
          "score": 4,
          "created_utc": 1735413366.0,
          "replies": []
        },
        {
          "id": "m42ibmp",
          "author": "originalusername__",
          "body": "Infinite energy device!",
          "score": 3,
          "created_utc": 1735324256.0,
          "replies": [
            {
              "id": "m42pwz9",
              "author": "AlephInfinite0",
              "body": "Not quite, users need fuel to press the keys. But I like your thinking!",
              "score": 3,
              "created_utc": 1735326675.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m43jog9",
          "author": "MrHodgeToo",
          "body": "Yeah, came here to say this is what would impress me. \n\nWe had solar powered calculators in the 70s. Only took us 55 years to get to a keyboard? Not impressed.",
          "score": 0,
          "created_utc": 1735336342.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m42zz35",
      "author": "silverbolt2000",
      "body": "Meanwhile, a wired low-profile keyboard with a backlight and a fingerprint sensor remains a pipe dream.",
      "score": 10,
      "created_utc": 1735329912.0,
      "replies": []
    },
    {
      "id": "m475l68",
      "author": "None",
      "body": "Phew I had to change my batteries at least every decade in my old keyboard",
      "score": 3,
      "created_utc": 1735397593.0,
      "replies": []
    },
    {
      "id": "m4a0sq6",
      "author": "istareatscreens",
      "body": "Calculators were doing this in the early 1980s, possibly earlier.  I'm surprised this wasn't the default from day 1 of these things. The lack of wires is nice but having a non-functioning keyboard due to no charge is a deal breaker to me. Having had a bad experience I've always avoided them due to that.",
      "score": 2,
      "created_utc": 1735432392.0,
      "replies": []
    },
    {
      "id": "m43evqa",
      "author": "Q__________________O",
      "body": "Thats not new\n\n.. try solar panels on laptops, see how that works. Go for ultimate efficiency, eink display etc.",
      "score": 3,
      "created_utc": 1735334772.0,
      "replies": [
        {
          "id": "m4ahn7s",
          "author": "raptir1",
          "body": "The problem is that laptops are often put in bags while not in use as opposed to a keyboard that typically sits out. \n\n\nThe best solar panels are around 20w per square foot. A typical 13\" laptop would only be .6-.7 square feet, so let's generously say 15W. And with the angle of the laptop lid you won't be getting good light, plus you're talking indoors. You would be lucky to get 5W off of a laptop sized solar panel on those conditions.\n\n\nThat won't cover even a cellphone processor plus an eink display. ",
          "score": 4,
          "created_utc": 1735438387.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m43iy2h",
      "author": "Zixinus",
      "body": "Before reading the article: I bet that they will advertise this but the keyboard's own battery will be glued in there and not meant to be user-replaceable. I also bet that that there is no option to connect the keyboard via keyboard either.  \n\nAfter reading the article: no mention of the above but damn, the AI set sounds scary. Who wants an AI (that which over they have no real control over other than issuing commands) to monitor them all day?",
      "score": 2,
      "created_utc": 1735336103.0,
      "replies": []
    },
    {
      "id": "m45hnn8",
      "author": "Knocksveal",
      "body": "I have several 40+ year-old calculators that still work fine using ambient light",
      "score": 2,
      "created_utc": 1735363423.0,
      "replies": []
    },
    {
      "id": "m4d5gbo",
      "author": "ochtone",
      "body": "Lenovo incorporating 40 year old calculator technology into their low power products. ",
      "score": 1,
      "created_utc": 1735486376.0,
      "replies": []
    },
    {
      "id": "m4hhsgf",
      "author": "100GbE",
      "body": "[Tehc](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2From4izohez861.png)",
      "score": 1,
      "created_utc": 1735539634.0,
      "replies": []
    },
    {
      "id": "mwme6gv",
      "author": "Mack4285",
      "body": "Supposed to be out in May. Cancelled?",
      "score": 1,
      "created_utc": 1749368306.0,
      "replies": [
        {
          "id": "my56rl7",
          "author": "bkertz",
          "body": "Wondering the same thing. I can't find anything about it.",
          "score": 1,
          "created_utc": 1750105599.0,
          "replies": []
        },
        {
          "id": "n6pm2b6",
          "author": "err99",
          "body": "Theres similar solar wireless keyboard by targus https://us.targus.com/products/sustainable-energy-harvesting-ecosmart-keyboard-akb868us\n\n\nbut it uses a 1600 mAh lithium-polymer battery (the lenovo one uses a \"fast-charging supercapacitor\" in place of a traditional battery) - I'm not really sure what the difference is or how/why a super capacitor might be better than the other type of battery",
          "score": 1,
          "created_utc": 1754235815.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n49khxq",
      "author": "milovancruz",
      "body": "When marketing rebrands \"solar powered\" to \"self-charging\".",
      "score": 1,
      "created_utc": 1753061222.0,
      "replies": []
    },
    {
      "id": "m41uwdx",
      "author": "Youvebeeneloned",
      "body": "i wish they had this as a mechanical. I had the logitech one which was decent but unfortunately just a membrane keyboard",
      "score": 1,
      "created_utc": 1735316798.0,
      "replies": []
    }
  ]
}