{
  "post": {
    "title": "Fujifilm’s X Half camera is so dedicated to the analog vibes, it can’t shoot RAW",
    "author": "adriano26",
    "id": "1ksro8z",
    "score": 976,
    "created_utc": 1747922988.0,
    "selftext": "",
    "num_comments": 169,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ksro8z/fujifilms_x_half_camera_is_so_dedicated_to_the/"
  },
  "comments": [
    {
      "id": "mtnrjix",
      "author": "gdopiv",
      "body": "I don’t think this author understands analog or how film works.",
      "score": 696,
      "created_utc": 1747923714.0,
      "replies": [
        {
          "id": "mtnw2ru",
          "author": "Pocok5",
          "body": "This is a pricy fully digital camera cosplaying as a film camera. It just uses digital filters on the images to simulate the looks of film. Hence why it's absurd that you are not permitted to disable the filters and just save RAW data.",
          "score": 517,
          "created_utc": 1747925061.0,
          "replies": [
            {
              "id": "mto2n4n",
              "author": "gdopiv",
              "body": "Yeah definitely. But film is like your raw image and the print is like the JPEG. It took digital a loooong time to be able to match the dynamic range of film. So to say they’re dedicated to analog vibes but removed raw is a statement that doesn’t make sense to me. If they were dedicated to analog vibes we’d get RAW and a 3 CCD sensor.",
              "score": 133,
              "created_utc": 1747926975.0,
              "replies": [
                {
                  "id": "mtoei01",
                  "author": "Immolation_E",
                  "body": "Not to mention despite certain film stocks having specific characteristics, those can be manipulated during the processing of the film.",
                  "score": 45,
                  "created_utc": 1747930396.0,
                  "replies": [
                    {
                      "id": "mtoj61l",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 41,
                      "created_utc": 1747931770.0,
                      "replies": [
                        {
                          "id": "mtojrfb",
                          "author": "Starfox-sf",
                          "body": "ISO called and wants its shutter speeds back",
                          "score": 21,
                          "created_utc": 1747931946.0,
                          "replies": [
                            {
                              "id": "mtol8ef",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 15,
                              "created_utc": 1747932370.0,
                              "replies": [
                                {
                                  "id": "mtt0xv9",
                                  "author": "pholan",
                                  "body": "Let me understand. They want $850 dollars for a camera with a fairly slow for its focal length prime lens and a LED flash!? I suppose the lens can be excused on the basis that a good prime lens still has less geometric distortion than a zoom lens and they’re compact but at that price I find it hard to understand them skipping a xenon flash. It does look cool but that’s an almighty expensive price for a fairly basic point and shoot with built in filters and a fixed crop.",
                                  "score": 4,
                                  "created_utc": 1747992393.0,
                                  "replies": []
                                },
                                {
                                  "id": "mtxk7hy",
                                  "author": "korewafap",
                                  "body": "Hey! Just to clarify—f/2.8 on a 1\" sensor still lets in the same amount of light per unit area as it would on any other sensor size. The “equivalent to f/8” thing usually comes up when comparing depth of field or total light gathering across formats, especially to full-frame. But for actual exposure, f/2.8 is still f/2.8. I see this new product as kind of a digital Instax—fun, compact, and all about the experience rather than pixel peeping.",
                                  "score": 1,
                                  "created_utc": 1748047018.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mtphzdh",
                          "author": "SpicyChanged",
                          "body": "Used to take action shots of my friends skating and was like open a pack of Pokémon cards. As well as the frustration of fuck blew money on bullshit pictures.",
                          "score": 1,
                          "created_utc": 1747941718.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mtoyhiu",
                      "author": "ToMorrowsEnd",
                      "body": "Which tells me this is not for photographers, but instead hipsters.",
                      "score": 8,
                      "created_utc": 1747936091.0,
                      "replies": [
                        {
                          "id": "mtq6mp9",
                          "author": "Bruno_M3",
                          "body": "Absolutely agree that they are the target audience. That said, a great photographer can take compelling photos with any camera.",
                          "score": 1,
                          "created_utc": 1747948969.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mtpwsxg",
                  "author": "shawnington",
                  "body": "Correction, it took digital a long time to have enough dynamic range to simulate the soft rolloff of overexposure that film does. Film in general only has about 7 stops of EV, some more, some less, where as modern cameras have 14+ stops of ev, but the film when its past its exposure range, has a progressive roll off, not a hard clipping like digital does.",
                  "score": 7,
                  "created_utc": 1747946048.0,
                  "replies": []
                },
                {
                  "id": "mtotmcw",
                  "author": "Known-Exam-9820",
                  "body": "This analogy works for slide film, but negatives are always processed in some way in the printing process.",
                  "score": 5,
                  "created_utc": 1747934734.0,
                  "replies": []
                },
                {
                  "id": "mtqjg8m",
                  "author": "FroydReddit",
                  "body": "I think of jpegs a slide film. You get what you get and you don't get upset... And don't go blowing those highlights!",
                  "score": 2,
                  "created_utc": 1747953163.0,
                  "replies": [
                    {
                      "id": "mtql25x",
                      "author": "gdopiv",
                      "body": "Aerochrome/eir was always the hardest to get right for me 😅",
                      "score": 2,
                      "created_utc": 1747953708.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mtvxga9",
                  "author": "philzuppo",
                  "body": "Well it instantly made sense to me. ",
                  "score": 1,
                  "created_utc": 1748027467.0,
                  "replies": []
                },
                {
                  "id": "mu5vo0z",
                  "author": "fleemfleemfleemfleem",
                  "body": ">  It took digital a loooong time to be able to match the dynamic range of film.\n\nThe first consumer digital camera was 1990. \n\nIf you consider that most c41 film has an effective DR of about 10-12 stops, (and paper only like 7 stops anyway) you're looking at about 15 years until you could buy something like the original 5D with 11 stops of dynamic range. \n\nFairly impressive for what was a new technology.",
                  "score": 1,
                  "created_utc": 1748177074.0,
                  "replies": []
                },
                {
                  "id": "mtrrvsq",
                  "author": "RhetoricalOrator",
                  "body": "Restricting the inclusion of a feature that a device is capable of performing isn't a matter of vibe, it's a financial decision. They do it because it is more financially profitable than sales figures would be influenced by the loss of the feature.",
                  "score": 1,
                  "created_utc": 1747968966.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mtp0oxp",
              "author": "FewHorror1019",
              "body": "For $899. A jpeg machine",
              "score": 7,
              "created_utc": 1747936712.0,
              "replies": []
            },
            {
              "id": "mtod81j",
              "author": "HansBooby",
              "body": "it’s Instagram IRL.  This is for people who think RAW is a wrestling show. Cosplay indeed.",
              "score": 13,
              "created_utc": 1747930019.0,
              "replies": []
            },
            {
              "id": "mtoe8o1",
              "author": "2dudesinapod",
              "body": "It’s not cosplay, Fuji’s film recipes are incredible and this camera just leans into a niche in their market.\n\nA lot of people are Fuji jpeg only shooters these days because of how good their jpegs are.",
              "score": 14,
              "created_utc": 1747930320.0,
              "replies": [
                {
                  "id": "mtppvin",
                  "author": "trowayit",
                  "body": "I can't speak to this camera but my X-E3 is still excellent and I have no desire to upgrade/replace it.",
                  "score": 5,
                  "created_utc": 1747944046.0,
                  "replies": [
                    {
                      "id": "mtr3u09",
                      "author": "darti_me",
                      "body": "Still rocking the XE1. AF & burst are sluggish & but 16MP is more than enough for 99% of travel & hobby photography. The JPG only strat is actually a huge time saver in post and a fun creative challenge.",
                      "score": 2,
                      "created_utc": 1747960226.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mtoqw4e",
                  "author": "MeanAmbrose",
                  "body": "Yeah like end of the day it's not gonna be as good as film (nothing is) but Fuji's film sims are incredible, my X100VI has painted some gorgeous looks shooting on JPEG. It's great for when I want to take quick photos and import them on my phone.",
                  "score": 2,
                  "created_utc": 1747933974.0,
                  "replies": [
                    {
                      "id": "mtoxp79",
                      "author": "TheLegendTwoSeven",
                      "body": "I have the X100 (original) and I still like it a lot, it renders skin tones very well.",
                      "score": 6,
                      "created_utc": 1747935872.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mtqvayh",
                  "author": "suitopseudo",
                  "body": "This is from someone who hates post processing and rarely shoots raw, but I like to have to option if I think it’s the type of photo that warrants shooting raw. Why remove the option? I don’t like not having the option for no reason when it’s just a matter of software and technology that exists.",
                  "score": 1,
                  "created_utc": 1747957184.0,
                  "replies": []
                },
                {
                  "id": "mtpx512",
                  "author": "ThinkExtension2328",
                  "body": "Yea but there is no indication it can use film simulations so it kills off part of that niche.",
                  "score": 0,
                  "created_utc": 1747946146.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mtprvue",
              "author": "RiftHunter4",
              "body": "I'm just wondering who will actually buy this. It's $850 in the US due to tariffs. Thats a lot of money for a toy.",
              "score": 2,
              "created_utc": 1747944632.0,
              "replies": []
            },
            {
              "id": "mtr3gau",
              "author": "None",
              "body": "There’s so many other Fuji cameras that do film simulations, why you would buy this one that has 1/4 of the features blows my mind. But hey capitalism gonna capitalize.",
              "score": 1,
              "created_utc": 1747960086.0,
              "replies": []
            },
            {
              "id": "mubaf9x",
              "author": "bonesnaps",
              "body": "Ew, simulating downgrades of old technology is so dumb.\n\n\nAs someone into electronic music, I already constantly roll my eyes at products designed to achieve the same thing in music like lo-fi tape warbling shit.",
              "score": 1,
              "created_utc": 1748250154.0,
              "replies": []
            }
          ]
        },
        {
          "id": "my8f3ca",
          "author": "clickfinga",
          "body": "It sucks. You pay 800€ to get just alteady compressed JPEGs. ",
          "score": 1,
          "created_utc": 1750151758.0,
          "replies": []
        },
        {
          "id": "mtvqt8s",
          "author": "Chris2112",
          "body": "It's the verge, not knowing that they're talking about is on brand",
          "score": 0,
          "created_utc": 1748025449.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtntbul",
      "author": "None",
      "body": "This sounds like absolute dog shit! Ignoring the slightly clickbait title, 800 dollars for a digital camera with fake analog hardware and built-in film filters is just stupid. Aren’t they 10 years late for that trend?",
      "score": 234,
      "created_utc": 1747924245.0,
      "replies": [
        {
          "id": "mtnwdsh",
          "author": "fkdisshyt",
          "body": "Its a digital yashica 2.0",
          "score": 28,
          "created_utc": 1747925149.0,
          "replies": [
            {
              "id": "mtr7584",
              "author": "kermityfrog2",
              "body": "The light leak and double exposure filters make it more like a Holga or other lo-fi cheap camera such as the [Sardina](https://microsites.lomography.com/la-sardina/).",
              "score": 4,
              "created_utc": 1747961419.0,
              "replies": []
            },
            {
              "id": "mu5x4ey",
              "author": "fleemfleemfleemfleem",
              "body": "At least they don't have those stupid \"digital film\" cartridges to determine the baked in color processing.",
              "score": 1,
              "created_utc": 1748177659.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mtoi3st",
          "author": "VagabondVivant",
          "body": "I'm guessing you've never shot with a Fuji.\n\nThey're known for their excellent color rendition. It's pretty much their thing, next to their love for the analog aesthetic. This camera basically combines the two.\n\nFuji's film simulation is a far cry from the digital \"filters\" you see in camera apps. They're not just a simple overlay that's slapped on a finished image and called a day. They're applied at multiple levels in the process, working with tone curves, color lookup tables, lens profiles, the works. It's an algorithmic process, rather than just an aesthetic one. They're also the result of literal decades of research and development, striving to achieve specific film looks.\n\nA number of Fuji photographers already shoot SOOC JPGs, relying on the innate processing to achieve certain film emulations and save them hours in front of Lightroom — that's how good Fuji's tech is.\n\nI don't know how well this camera will fare. It's a big swing, but that's what Fuji is known for. People laughed at the X100 when it first came out, saying no one would pay $1500 for a fixed-lens camera. Now it's one of their most popular models, with new models being impossible to find for months after their releases.\n\nUltimately we'll have to see if this camera finds a market, but I think it can. Half-frame cameras are few and far-between, so there isn't much competition. And the Pentax 17 has proven there's a market for every niche. Time will tell.",
          "score": 80,
          "created_utc": 1747931454.0,
          "replies": [
            {
              "id": "mtosd61",
              "author": "NavidsonRcrd",
              "body": "Their film sims are great but this just feels a little ridiculous; focusing on analog nostalgia while targeting zoomers who have never used one with a tiny sensor that most likely won’t match 35mm film quality. Would love to see them go the Pentax route and actually make a film cameras/film again, as I feel like Fuji’s one of few brands that could pull it off",
              "score": 25,
              "created_utc": 1747934386.0,
              "replies": [
                {
                  "id": "mtp7696",
                  "author": "VagabondVivant",
                  "body": "I don't think the X Half is meant to compete with other cameras, but with phones. And in that regard it's going to produce push-button results that far outpace anything said Zoomers could get on their latest iPhones and Pixels. All in a retro package that they're gonna lap up.",
                  "score": 9,
                  "created_utc": 1747938576.0,
                  "replies": [
                    {
                      "id": "mtp8b38",
                      "author": "NavidsonRcrd",
                      "body": "I do totally get that - a nice (if pricey) party camera that will take much better photos than an instax or alternative while being much more of an event than just a phone shot. Fuji does a phenomenal job producing SOOC results without need for tweaking.\n\nPersonally, as a biased film shooter it hurts to see Fuji putting their resources into this with all of their analog heritage and the resurgence in film though…",
                      "score": 3,
                      "created_utc": 1747938908.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mtp1kep",
              "author": "Intelligent-Parsley7",
              "body": "Unfortunately, for that price, I’d just get a used X100(whatever). \nSame price effectively, just a heck of a lot more features. \nI have an X100s. \nArguably, can never sell it. Unless I’m gettting a newer one.",
              "score": 6,
              "created_utc": 1747936963.0,
              "replies": [
                {
                  "id": "mtp4znf",
                  "author": "VagabondVivant",
                  "body": "Conversely, one could argue, \"Why would I get an X100* when I can get a used XT-(whatever) and just keep a pancake 28mm on there 90% of the time? That way I'd at least have the option of switching to a different lens if I ever wanted to.\"\n\n(After owning both X100 and XT cameras, that's why I ended up keeping the latter. I _love_ the X100 series, but the XT is more versatile for my needs.)\n\nAt the end of the day, it comes down to the market Fuji is trying to serve. X100s and XTs serve different markets, just as the X Half is going to.",
                  "score": 4,
                  "created_utc": 1747937946.0,
                  "replies": [
                    {
                      "id": "mtthwcb",
                      "author": "Intelligent-Parsley7",
                      "body": "Fair point.",
                      "score": 1,
                      "created_utc": 1748000903.0,
                      "replies": []
                    },
                    {
                      "id": "mtxlfvu",
                      "author": "korewafap",
                      "body": "I actually cross shopped the X-T5 and X100VI too, and in the end I kept my X-T3 and picked up the X100VI. I kept the X100VI mostly for its size and because I prefer the 23mm focal length over the 28mm or 18mm pancakes. I also really like the rangefinder style, not having my face hidden behind the camera when I’m shooting people feels more natural, and it helps avoid constantly smudging the screen with my nose, haha.\n\nAs for this new camera, I’m honestly baffled by the price, it’s such a niche product. That said, if it’s your vibe, you probably already know you want it. I’m definitely intrigued, but there’s no way I’m paying full price. Specs wise, it’s practically toy level, but it’s still a real enough camera that my kids could actually start learning photography with it. I would love to have one to play with.",
                      "score": 1,
                      "created_utc": 1748047487.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mtojy0b",
              "author": "None",
              "body": "Well, I may be more convinced if it produces decent looking film shots. As you mentioned, other filters don’t tend to come close to the real thing. But why not just shoot film at that point? Is it still cheaper? Or is it the digital convenience. I can’t tell who the market is for this",
              "score": 1,
              "created_utc": 1747932000.0,
              "replies": [
                {
                  "id": "mtp6leo",
                  "author": "VagabondVivant",
                  "body": "> But why not just shoot film at that point?\n\nThat's ultimately an argument one could make about _any_ Fuji camera, really. \n\n> I can’t tell who the market is for this\n\nBecause you're not in it.\n\nThere's been a huge clamor among Gen Z for more old school tech. They've been buying up outdated digital cameras to achieve certain \"retro\" aesthetics to them. They're also the folks most using filters and film simulations. The X Half marries all of that into a simple no-muss, no-fuss digital camera.\n\nDon't forget: many digital camera users never shoot RAW because they don't have the wherewithal to spend hours sitting at a computer, editing. They just wanna shoot and post. Which is also why the portrait-oriented sensor is so clutch; it's the perfect Instagram Camera.\n\nSure, they could just \"turn a regular camera on its side\" to achieve the same effect, but they could also just \"turn their phone on its side\" to watch videos in landscape mode, and yet no one does. That's why TikTok is so huge.\n\nThe X Half basically gives Gen Z (who I believe to ultimately be the target market) a camera that produces better images and achieves closer film-like looks than their phone — while still letting them shoot-and-upload (via said phone) without ever having to download to a computer. All in a package small enough to fit in a purse or jacket pocket.\n\nI think it has the potential to be pretty popular. The $800 price tag might hurt it, but we'll ultimately have to see.",
                  "score": 8,
                  "created_utc": 1747938408.0,
                  "replies": [
                    {
                      "id": "mtweeoa",
                      "author": "Kilo147",
                      "body": "I don’t think Gen Z is gonna go for it. Cheap Y2K era digicams are everywhere and do what they want with a specific style of photograph. It’s not about doing film digitally, it’s about ditching the hyper-processed smartphone photos for ones that are more authentic . The Fujifilm X fails the vibe check period. Get a Nikon Coolpix instead.",
                      "score": 3,
                      "created_utc": 1748032615.0,
                      "replies": [
                        {
                          "id": "mtwm36f",
                          "author": "VagabondVivant",
                          "body": "Yeah, I don't know how successful it's gonna be at $800. Maybe they'll find some success in the Insta mom market, but GenZ might be too savvy (or broke) to bother with the X Half, no matter how much Fuji seems to be building it for them.\n\nI think the biggest mistake was removing custom recipes. I can say that as someone who loves travel photography, that's one of my favorite features with Fuji. Not to emulate film styles, but to be able to dial in specific in-camera pp settings in order to spend less time in front of a computer when I'm on the road. Letting X½ users customize their jpg presets would go a long way to helping them \"make it theirs,\" as it were.\n\nTime will tell. Maybe it'll find an audience outside of its intended one.",
                          "score": 1,
                          "created_utc": 1748035001.0,
                          "replies": [
                            {
                              "id": "mtwovwg",
                              "author": "Kilo147",
                              "body": "Never underestimate Gen Z (and Gen Alpha). They delight in sheer simplicity, are creative beyond their means, and love old tech forgotten by the masses. They love their individuality, will make their own style, and are absorbed with expressing themselves in the most unique ways I’ve seen in my 42 years on this rock. They are remarkably intelligent, outshining any generation I’ve encountered and they are more politically aware than any of the proceeding generations going back to the 70s. Flip phones, Y2K digicams, wired headphones, and CDs are all making an unlikely comeback thanks to them. Grunge is back. I mean fuck, Blackberries are back. Go through the Gen Z Reddit. It’s absolutely fascinating.",
                              "score": 3,
                              "created_utc": 1748035909.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mtr5o2r",
                  "author": "darti_me",
                  "body": "Shooting film is can be very expensive. \n\nYour basic film point & shoots can go up to $100 for a good working condition. Your SLRs by the likes of Canon & Nikon can hover in the 3 digit mark for body & lens\n\nBut some premium models (ex. Konicas, Pentax, Fujis, Hasselblads, Leicas) 2 decades out of production can go up to $1000 just for a donor/parts body. A working Body + Frame can easily hit $2000. \n\nThats just your fixed cost. For variable cost you’re looking at ~10$ per 36 exposures plus a development & scanning fee if you don’t have the equipment. Then you may want to do cleaning & calibration every few years which usually costs $50+ for basic SLRs & P&S",
                  "score": 3,
                  "created_utc": 1747960895.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mtsyobs",
              "author": "throwmeeeeee",
              "body": "lol. Check the sample gallery so you can see for yourself this whole thing is pathetic.\n\nhttps://www.dpreview.com/reviews/fujifilm-x-half-retro-compact-camera\n\nThis is possibly the cringiest camera anyone could own",
              "score": 1,
              "created_utc": 1747991000.0,
              "replies": [
                {
                  "id": "mtuwyet",
                  "author": "VagabondVivant",
                  "body": "GenZ kids have been buying 15- to 20-year-old digital cameras **[in droves](https://www.npr.org/2024/12/12/nx-s1-5209770-e1/gen-z-loves-the-digital-compact-cameras-that-millennials-once-coveted)**. For them it's not about image quality, it's about \"vibes.\"\n\nAlso, can we please retire the word \"cringe\"? It's honestly just embarrassing to hear people use it unironically.",
                  "score": -1,
                  "created_utc": 1748016917.0,
                  "replies": [
                    {
                      "id": "mtwcxh3",
                      "author": "Kilo147",
                      "body": "I get Gen Z. I’m using a Cybershot DSC TX30. Y2K era digicams have drip for days, they hit different than modern over processed smartphone cameras, and they’re typically pocketable like no other.  Still use film, but I can do things with the Cybershot that no other camera I own can do.",
                      "score": 1,
                      "created_utc": 1748032163.0,
                      "replies": []
                    },
                    {
                      "id": "mtvfloe",
                      "author": "throwmeeeeee",
                      "body": "The vibe is what is off-putting.",
                      "score": 1,
                      "created_utc": 1748022191.0,
                      "replies": [
                        {
                          "id": "mtw1hb3",
                          "author": "VagabondVivant",
                          "body": "Then you're not the target market.\n\nOne of Fuji's schticks has been making big swing cameras that only appeal to specific niches. The X100 and GFX series have been proof of that, mocked by many when they were initially announced (\"Nobody's gonna pay $1500 for a fixed-lens camera!\", \"Nobody's gonna pay $5000 for a not-really-medium Medium!\") but eventually finding audiences willing to spend the money on them.\n\nThe $800 price tag might be a bit of a tough sell, but there's absolutely a market for a portrait-sensor super-retro no-post-needed camera, especially among the GenZ and Insta crowd.\n\nYou and I might not be _in_ that market, but that doesn't mean the market doesn't exist.",
                          "score": 1,
                          "created_utc": 1748028693.0,
                          "replies": [
                            {
                              "id": "mtwag3p",
                              "author": "throwmeeeeee",
                              "body": "Shill harder. You’re making this camera sounds sooooo cool",
                              "score": 0,
                              "created_utc": 1748031415.0,
                              "replies": [
                                {
                                  "id": "mtwbf3q",
                                  "author": "VagabondVivant",
                                  "body": "That's not even remotely what I'm doing, and I'm sorry I wasted so much time trying to relate to you as an adult. I'm also sorry that not being able to understand things makes you angry and an asshole. Bye.",
                                  "score": 2,
                                  "created_utc": 1748031707.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mtq1o8x",
              "author": "None",
              "body": "[deleted]",
              "score": -3,
              "created_utc": 1747947459.0,
              "replies": [
                {
                  "id": "mtqagoe",
                  "author": "VagabondVivant",
                  "body": "It's not a defense of Fuji cameras, it's an explanation of the difference between \"built-in\" or \"poorly-fitting\" (what does that even mean?) filters, and color rendition and film simulation, because it seemed that Sad hat (and you as well, for that matter) didn't know the difference.\n\n> for 10-20x the cost of just buying the thing you’re trying to imitate\n\nIs there any bigger a \"Get off my lawn!\" gripe than complaining about film simulation in digital photos? Some people like to tone their images to emulate popular film looks. Would you prefer they go out and buy multiple film cameras to house the dozens of different film stocks so that they can swap between them as they shoot? What even is your point, for that matter?\n\n> Never ant mention of software integration or consumer friendliness\n\nThat's because it's not the topic at hand? Sad Hat talked about analog hardware and filters, so those are the points I responded to. Why would I discuss software integration and consumer friendliness when literally nobody was talking about that?\n\nBased on the entirety of your reply, it feels like you're just here to grind an axe and don't actually have anything useful to contribute to the conversation.",
                  "score": 0,
                  "created_utc": 1747950221.0,
                  "replies": [
                    {
                      "id": "mtqcrtz",
                      "author": "I-Drink-Printer-Ink",
                      "body": "So let me get this straight. \n\nYou’re not defending the camera but every comment in this thread is you defending both its price point (which is factually artificially high) and its simulation effects which are verifiably not simulating anything beyond its own aesthetics. \n\nYou’re defending an anti-consumer product by referencing the X100 which is basically a “I have too much money and no skill” camera that fills the very very specific niche of replicating 2012 Instagram filters. \n\nYou think the Sony A6 series is “cheap shit” but basically every A6 outperforms every competitive Fuji in every category except shitty built in filters.\n\nI get it, you want to take nice photos without having an atom of photography skills so you lean on Fujifilm because like all Fuji-stans you think a sepia filter is the peak of photography. \n\nOh and you also have to send aggressively xenophobic DM’s just to secure your own argument? Fuck. Off.",
                      "score": 0,
                      "created_utc": 1747950952.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mtpeic8",
              "author": "eljefino",
              "body": "Fuji might have a \"look\" but they lose control of that look when their output is shown on unbranded, uncalibrated monitors outside of their control.",
              "score": -5,
              "created_utc": 1747940703.0,
              "replies": [
                {
                  "id": "mtphixm",
                  "author": "VagabondVivant",
                  "body": "Fuji doesn't have \"a look,\" it has an industry reputation for incredible color rendition and obsessive attention to film emulation that it has built over years. Monitors have never been standardized, and calibration exists only on the desks of professionals, yet none of that has affected their reputation in the slightest",
                  "score": 9,
                  "created_utc": 1747941584.0,
                  "replies": [
                    {
                      "id": "mtq7769",
                      "author": "eljefino",
                      "body": "So what would you think if I got Fuji C-41 film and printed it on Kodak paper?",
                      "score": 0,
                      "created_utc": 1747949146.0,
                      "replies": [
                        {
                          "id": "mtq8wgb",
                          "author": "VagabondVivant",
                          "body": "I do not understand the point of this question.",
                          "score": 0,
                          "created_utc": 1747949708.0,
                          "replies": [
                            {
                              "id": "mtq9v51",
                              "author": "eljefino",
                              "body": "If Fuji products are used early in the chain of image capturing, but not to display the final result, how much of their look will remain?",
                              "score": 1,
                              "created_utc": 1747950032.0,
                              "replies": [
                                {
                                  "id": "mtqb70k",
                                  "author": "VagabondVivant",
                                  "body": "What do you mean \"not to display the final result\"? Are you still talking about the fact that monitors don't have a universal standard and display images differently? Because, again, that has zero bearing on Fuji's exceptional color rendition.\n\nDifferent people perceive the same sounds differently; that doesn't change the fact that Sennheiser headphones produce exceptional sound quality. Different people perceive the same tastes differently; that doesn't change the fact that Häagen-Dazs makes some of the tastiest ice cream around.\n\nFuji sensors and lenses produce fantastic color. That's just an industry fact. Where they're being displayed doesn't change that.",
                                  "score": 2,
                                  "created_utc": 1747950454.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mtodnx2",
          "author": "toddywithabody",
          "body": "I mean considering they were arguably the ones who started that trend I’d say no?",
          "score": 11,
          "created_utc": 1747930151.0,
          "replies": []
        },
        {
          "id": "mtofc4p",
          "author": "roadmapdevout",
          "body": "They're not just built in filters exactly. The in camera processing on Fuji cameras is fantastic - I say this from their reputation and from experience. I have no doubt the images out of this camera will look great.\n\nWhy they added a film advance lever, I couldn't possibly say. It's a stupid gimmick. The lack of RAW makes no sense other than to simplify the experience for the super casual target demo of the camera. Otherwise it's just a super budget X100 with a lot of corners cut.",
          "score": 4,
          "created_utc": 1747930643.0,
          "replies": []
        },
        {
          "id": "mtnz3tu",
          "author": "SwimmingAbalone9499",
          "body": "fuji’s been doing this for yeaaaaaars. its not new and actually pretty neat since its emulating their old film captures",
          "score": 17,
          "created_utc": 1747925944.0,
          "replies": [
            {
              "id": "mto0o12",
              "author": "LaVernWinston",
              "body": "Yea not understanding this hate at all. For over a decade now Fuji has been touted as having the best jpegs and recipes in the market to the point where SOOC images are the new way that people shoot. This is cool as hell for people like that. They’re not 10 years late to the trend, they created the trend.",
              "score": 20,
              "created_utc": 1747926402.0,
              "replies": [
                {
                  "id": "mto5don",
                  "author": "robalob30",
                  "body": "Fuji is absolutely good with natively processing JPGs, which is so nice when I’m too lazy to work on the RAW files. But the film advance lever seems a bit pretentiously silly, like adding a clutch pedal to a fully automatic car",
                  "score": 12,
                  "created_utc": 1747927763.0,
                  "replies": [
                    {
                      "id": "mto9dmp",
                      "author": "LaVernWinston",
                      "body": "I mean they’re definitely leaning as much as they can into an analog experience though, and tucked that function away into its own mode. I would completely agree if the lever was required at all times.",
                      "score": 3,
                      "created_utc": 1747928900.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mtot2ki",
          "author": "mark5hs",
          "body": "That's the whole appeal of the fuji XT series. People like the film sims and manual controls.",
          "score": 1,
          "created_utc": 1747934582.0,
          "replies": []
        },
        {
          "id": "mu5ww9t",
          "author": "fleemfleemfleemfleem",
          "body": "That stuff is cyclical. Not that long ago I saw an ad for a youtube video about a digital camera that shoots \"infinite film shots\" and it was like a canon g9... A great camera, but just an old digital camera. \n\nNow we're at the point where people who grew up with film but when through the digital transition are in their 40s, going through albums from the 90s and getting nostalgic.",
          "score": 1,
          "created_utc": 1748177571.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtoi6vb",
      "author": "-DementedAvenger-",
      "body": "> The $849.99 camera is…\n\nOk I’m out.",
      "score": 30,
      "created_utc": 1747931479.0,
      "replies": [
        {
          "id": "mtpxnn7",
          "author": "ThinkExtension2328",
          "body": "Just incase you haven’t made it out the door yet it also dosent seem to be able to run film simulations only defaulting to the default ones.",
          "score": 2,
          "created_utc": 1747946294.0,
          "replies": [
            {
              "id": "mtpzaik",
              "author": "-DementedAvenger-",
              "body": "> doesnt seem to be able to run film simulations only defaulting to the default ones.\n\nI don’t know what you mean. It can do film simulations. Velvia, Provia, and other Fuji types. But it is limited to like 8-10 common ones.",
              "score": 3,
              "created_utc": 1747946766.0,
              "replies": [
                {
                  "id": "mtq2m3f",
                  "author": "ThinkExtension2328",
                  "body": "Yea no so with Fuji part of what makes them cool is other then the ones they have in this camera they have slots for 7 user defined “[film simulations](https://fujixweekly.com/recipes/)”. These are called recipes. This camera does not seem to have that ability.",
                  "score": 2,
                  "created_utc": 1747947738.0,
                  "replies": [
                    {
                      "id": "mtq6f7e",
                      "author": "-DementedAvenger-",
                      "body": "Like custom ones? Adjusting colors and whatnot to your taste?",
                      "score": 1,
                      "created_utc": 1747948905.0,
                      "replies": [
                        {
                          "id": "mtqe3k0",
                          "author": "ThinkExtension2328",
                          "body": "Exactly say I wanted my Fuji to poop out jpg’s that look like portra 400 film. On my x-s20 I have this pre programmed and I just go shoot and boom it poops out protra like images. It’s half the reason I love the Fuji systems.",
                          "score": 5,
                          "created_utc": 1747951375.0,
                          "replies": [
                            {
                              "id": "mtqfwfc",
                              "author": "-DementedAvenger-",
                              "body": "Ah yes, OK. That sounds pretty nice. ￼",
                              "score": 1,
                              "created_utc": 1747951968.0,
                              "replies": []
                            },
                            {
                              "id": "mtt6ley",
                              "author": "Goldenfelix3x",
                              "body": "you are not wrong. if this could easily log custom film simulation, even with customizable side screen images... think of the potential. people could log their custom digital personal made film simulations, and run them out for a 36exposure shoot. that would be next level in a way i could definitely see trending throughout the year or years.",
                              "score": 1,
                              "created_utc": 1747995596.0,
                              "replies": [
                                {
                                  "id": "mttsext",
                                  "author": "ThinkExtension2328",
                                  "body": "I mean I already have a xs20 and they would probably get another 899$ out of me if it where the case",
                                  "score": 1,
                                  "created_utc": 1748004821.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mtqbo0y",
                      "author": "VagabondVivant",
                      "body": "Considering that it doesn't let you save the RAWs, it's clearly intended for an audience that has no interest in post-production; I doubt they're gonna be obsessing over film recipes like pros do.\n\nThey might have also removed the feature so that they could sell different film simulations after-the-fact.",
                      "score": 0,
                      "created_utc": 1747950605.0,
                      "replies": [
                        {
                          "id": "mtqdt9z",
                          "author": "ThinkExtension2328",
                          "body": "I don’t think you understand what I’m saying , “film recipes” are not post production.these are user defined filter. \n\nExample - “[Fuji film recipes made me stop shooting RAW](https://youtu.be/t15X8HGt1ms?si=DkyluZPRrCtNLqUm)”",
                          "score": 1,
                          "created_utc": 1747951283.0,
                          "replies": [
                            {
                              "id": "mtqeb97",
                              "author": "VagabondVivant",
                              "body": "I've been a Fuji shooter for twelve years; I understand film recipes. \n\nI'm not saying recipes are post, I'm saying that someone who isn't interested in doing post isn't gonna be interested in scouring forums for recipes or coming up with their own ones.\n\nThe X Half is a point-and-shoot, jazzed up for GenZ and the Insta crowd. Simplicity is the watchword, and it makes sense that they'd remove recipes in order to maintain that simplicity (as well, again, as an excuse to sell simulations to the users later on).",
                              "score": 1,
                              "created_utc": 1747951444.0,
                              "replies": [
                                {
                                  "id": "mtqeov3",
                                  "author": "ThinkExtension2328",
                                  "body": "Ew dear god I hope your wrong, if they start “selling” simulations Fuji is going to loose me as a future customer. \n\nI do know lumix cameras now support using LUTS on camera so that might be my future system if Fuji gets shit.",
                                  "score": 2,
                                  "created_utc": 1747951569.0,
                                  "replies": [
                                    {
                                      "id": "mtqexdn",
                                      "author": "VagabondVivant",
                                      "body": "If they did, I expect they'd only sell them to X Half users. There'd be no point in selling them to anyone with a camera that allows for custom recipes.",
                                      "score": 1,
                                      "created_utc": 1747951645.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mtuj8sm",
                                      "author": "grimoireviper",
                                      "body": ">I do know lumix cameras now support using LUTS on camera so that might be my future system if Fuji gets shit.\n\nYou might also look towards Sony then. They accept LUTs in camera now but there's been some amazing film simulation picture profile adaptions too.",
                                      "score": 1,
                                      "created_utc": 1748013060.0,
                                      "replies": [
                                        {
                                          "id": "mtwd19k",
                                          "author": "ThinkExtension2328",
                                          "body": "Problem iv seen is Sony luts are only for viewing and for applying to video. I’ll very happily be told I’m wrong but that kinda made me sad.",
                                          "score": 1,
                                          "created_utc": 1748032195.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mto4p2l",
      "author": "fuck-nazi",
      "body": "You know what they say… RAW IS WAR. Or something like that",
      "score": 19,
      "created_utc": 1747927568.0,
      "replies": [
        {
          "id": "mtopqdl",
          "author": "BipedalWurm",
          "body": "Only on Monday",
          "score": 3,
          "created_utc": 1747933648.0,
          "replies": []
        },
        {
          "id": "mtp5nei",
          "author": "Naive_Confidence7297",
          "body": "Oh baby I like it raaww, oh baby I like it raaaww",
          "score": 1,
          "created_utc": 1747938136.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtr4uyz",
      "author": "Spagman_Aus",
      "body": "the fake advance lever just feels like a weird and stupid choice. why waste any design or engineering capacity on that?",
      "score": 6,
      "created_utc": 1747960598.0,
      "replies": [
        {
          "id": "mtrlp5g",
          "author": "Interesting_Ghosts",
          "body": "Because it’s fun.",
          "score": 4,
          "created_utc": 1747966665.0,
          "replies": [
            {
              "id": "mtssxzo",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1747987488.0,
              "replies": [
                {
                  "id": "mttwdf9",
                  "author": "LivingNo7641",
                  "body": "What year were you born?",
                  "score": 1,
                  "created_utc": 1748006161.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mtxlwca",
              "author": "korewafap",
              "body": "I agree I really miss that tactile lever, but it doesn't ratchet so kind of a miss there.\n\nI wish film isn't so expensive to shoot.",
              "score": 1,
              "created_utc": 1748047661.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mtrapnu",
      "author": "mnmtai",
      "body": "I get the whole trimming everything down to its most rudimentary state to suit a market segment.\n\nYet, they are charging eight. Hundred. Fitty. American dollars. For something whose outputs are on par with midrange phones *at best*.\n\nIt’s mind bogglingly niche.",
      "score": 7,
      "created_utc": 1747962694.0,
      "replies": [
        {
          "id": "mttwbge",
          "author": "LivingNo7641",
          "body": "I guess I’m niche 🥲",
          "score": 1,
          "created_utc": 1748006143.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtphv4w",
      "author": "Abdullah-Alturki",
      "body": "\"this new iphone is so vintage, it cant make texts or connect to the internet!\" not having raw is not really a selling point",
      "score": 6,
      "created_utc": 1747941683.0,
      "replies": []
    },
    {
      "id": "mtsq1om",
      "author": "pukeblood213",
      "body": "Just shoot film.",
      "score": 4,
      "created_utc": 1747985762.0,
      "replies": []
    },
    {
      "id": "mtoec33",
      "author": "stogie-bear",
      "body": "I don’t mind the no raw thing. But I was expecting “half” to be either half a 35mm film frame, so 18x24mm, or half a Fuji X frame, which would be 12x16mm. They should have just found a better name. ",
      "score": 7,
      "created_utc": 1747930348.0,
      "replies": [
        {
          "id": "mtokn3c",
          "author": "IIALE34II",
          "body": "I was hoping it would be the standard x-trans, just flipped.",
          "score": 3,
          "created_utc": 1747932199.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtopmgp",
      "author": "BipedalWurm",
      "body": "should be a software feature, that's just backwards",
      "score": 3,
      "created_utc": 1747933617.0,
      "replies": []
    },
    {
      "id": "mtru30a",
      "author": "Disgruntl3dP3lican",
      "body": "Half frame with a crop of 3? Half AF performance. Half functionality. Half ergonomics. Fully ridiculous. Twice the price. A nice toy camera brought to you by Fuji, after the supply permits it, in more than 3 years.",
      "score": 3,
      "created_utc": 1747969833.0,
      "replies": []
    },
    {
      "id": "mtqke4y",
      "author": "jaxspider",
      "body": "This is an analog camera for posers and idiots who don't know anything about cameras.",
      "score": 5,
      "created_utc": 1747953481.0,
      "replies": []
    },
    {
      "id": "mtok6b4",
      "author": "Aggressive-Fail4612",
      "body": "For $800 you can buy a nice analog camera with a real lens.",
      "score": 5,
      "created_utc": 1747932066.0,
      "replies": [
        {
          "id": "mtoz71a",
          "author": "ToMorrowsEnd",
          "body": "Got a nice medium format with a very useable 35mm prime for that.",
          "score": 5,
          "created_utc": 1747936292.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtpnvrx",
      "author": "Conflicting-Ideas",
      "body": "I’ll stick with my XT-30. And I don’t even shoot RAW. Fujifilm’s color rendering is beyond beautiful. And the recipes, which you can create and save on your own are amazing.",
      "score": 2,
      "created_utc": 1747943464.0,
      "replies": []
    },
    {
      "id": "mto4v6a",
      "author": "_20110719",
      "body": "Tech journalists ≠ journalists",
      "score": 6,
      "created_utc": 1747927617.0,
      "replies": []
    },
    {
      "id": "mtnunrl",
      "author": "Jollyjacktar",
      "body": "I don’t see any advantage of this camera over the Hipstamatic app on my iPhone, plus it costs $850 and I have to carry it in addition to my phone. If I take a camera out it is because it is either cheap fun or gives me advantages over my phone and I don’t think this does either.",
      "score": 7,
      "created_utc": 1747924643.0,
      "replies": [
        {
          "id": "mto4hns",
          "author": "BinnFalor",
          "body": "Larger glass and a larger sensor allow you to do more vs your phone's tiny glass and tiny sensor. Your phone does a lot of software tricks to push non viable photos so everything kind of looks soft in the dark. The X half defs isn't everyone's cup of tea, but if you have the money and want a very expensive toy, then yeah? \n\nFor reference I own an x100f and I only shoot in jpeg on that thing even though I could be shooting RAW. The option is nice, but the quality is night and day vs my phone.",
          "score": 22,
          "created_utc": 1747927509.0,
          "replies": [
            {
              "id": "mtp07ca",
              "author": "xcassets",
              "body": "I love Fuji and I own an X-T2. That said, this sensor is half the size of their APS-C sensor (which is already smaller than full-frame). It's actually even smaller than M43 sensors (like Olympus and certain Panasonics, etc.).\n\nI want to see the photos this things makes. Whilst the sensor is still bigger than a phone's, and Fuji's jpegs are great, I doubt the software side of things is going to be anywhere near to competing with Google, Apple, etc. I wouldn't be surprised if the gap between this camera and phones is smaller than ever.",
              "score": 8,
              "created_utc": 1747936575.0,
              "replies": [
                {
                  "id": "mtqp224",
                  "author": "BinnFalor",
                  "body": "Yeah, I agree. But it also emulates the film shooting experience. It has a \"film advance\" lever that you have to pull in order to take the next shot. I think for the experience, cost and sensor this is very expensive. It feels like the target is someone who wants to graduate from using their phone and learn how to use a camera. But if that's the case there's so many cheaper options to get normal controls into someone's hand. \n\nIt still feels like a very expensive toy for the experience you're getting.",
                  "score": 3,
                  "created_utc": 1747955058.0,
                  "replies": [
                    {
                      "id": "mtuk9ia",
                      "author": "grimoireviper",
                      "body": ">It has a \"film advance\" lever that you have to pull in order to take the next shot\n\nPretty sure that's only used for diptychs from what I have read? Unless I misunderstood that.",
                      "score": 1,
                      "created_utc": 1748013348.0,
                      "replies": [
                        {
                          "id": "mtukg1c",
                          "author": "BinnFalor",
                          "body": "It's for diptychs in normal mode. And it's used as a frame advance in film roll mode.",
                          "score": 1,
                          "created_utc": 1748013399.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mtx4jf7",
              "author": "mnmtai",
              "body": "Theoretically yes. Practically the samples DPReview posted looked like something out of an iPhone 6.",
              "score": 1,
              "created_utc": 1748041274.0,
              "replies": [
                {
                  "id": "mty6ejm",
                  "author": "BinnFalor",
                  "body": "Last one, I think the people who would be buying these aren't exactly looking at superior image quality.",
                  "score": 1,
                  "created_utc": 1748055542.0,
                  "replies": []
                },
                {
                  "id": "mtxv9xs",
                  "author": "BinnFalor",
                  "body": "That somewhat feels like a reach, I think the reviewer was using it as intended. Definitely not the best glass from Fujifilm. But I think you don't know what an actual iPhone 6 shot like.",
                  "score": 0,
                  "created_utc": 1748051264.0,
                  "replies": [
                    {
                      "id": "mu1rk3x",
                      "author": "mnmtai",
                      "body": "I think I do know, having owned one. But just for the sake of conversation, let’s push the model to something slightly more modern and that most would already have, so say anything beyond the iPhone 11. It’s already 6 years old. My spouse shoots regularly with it. I have a 13.\n\nNone of the X Half samples online justify the price from a technical POV. The difference in sensor size (1” vs 1/2.5” on the 11 and 1/1.9” on the 13) here is marginal at best. It’s not the same as going from that to your x100’s APS or my z6ii’s FF by any means.\n\nBut I agree with you, people targeted don’t really care about the spec sheets. Which means it boils down to user experience, and that will cost them… over a grand after tax.\n\nLike i said elsewhere, the thing is fine. I get the concept. I get many will be attracted. What I don’t get is the price.",
                      "score": 1,
                      "created_utc": 1748111365.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mtojxy7",
          "author": "Eradomsk",
          "body": "While I think this particular camera is dumb as fuck (a half frame digital camera lol), I promise you its photos look infinitely better than your iPhone photos. That tiny sensor and all the computational effects that the phone software does is super ugly.",
          "score": 4,
          "created_utc": 1747931999.0,
          "replies": []
        },
        {
          "id": "mto4j8a",
          "author": "goozy1",
          "body": "You don't understand the target audience for this camera. Film cameras have made a huge resurgence recently. This is aimed at people that want the feel of the shooting in analog but the convenience of digital. I've gone down the rabbit hole of shooting on film recently and between sourcing film and finding somewhere to develop the film, it hasn't been easy. I can't imagine it will get easier as time goes on as film stock will eventually be impossible to find. Using an app doesn't give you that same feeling. This camera is as close as you can get to shooting film but digital",
          "score": 11,
          "created_utc": 1747927521.0,
          "replies": [
            {
              "id": "mtobkwd",
              "author": "Noteagro",
              "body": "This. My hometown of 300k, with a greater area population just shy of 1 million only had 1 store that processed film anymore, and maybe 3 stores that sold film. The 2 that didn’t process film only sold cheap film and not the high quality or more oddly used film.\n\nI just moved to a big city with a metro of over 1.2 million people, and so far I have only found a single shop that processes film. All the other camera stores I have been to are only digital. As much as I would love to get into film, I just know how difficult it will be to continue in 10-20 years. Maybe it will have a resurgence like vinyl has, but I just don’t see it with how much people value convenience over the old school techniques.",
              "score": -2,
              "created_utc": 1747929533.0,
              "replies": [
                {
                  "id": "mtosqdv",
                  "author": "NavidsonRcrd",
                  "body": "There’s a ton of labs that take mail-in film, fyi!",
                  "score": 4,
                  "created_utc": 1747934488.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mtojuuh",
          "author": "monsantobreath",
          "body": "You answered your own question. It's an accessory.\n\nAnd for many people the tool and its use is part of the charm. You're not thinking like the people who'd buy it.\n\nIf you pulled out your phone people would respond one way regardless of the filter or app. Pull out an old school looking camera people will react differently. It'll feel different.\n\nThis is beyond producing a usable image. It's wrapping the experience of using a camera up in the whole product.\n\nBasically you're not the market and you don't think like they do.",
          "score": 2,
          "created_utc": 1747931974.0,
          "replies": []
        },
        {
          "id": "mtq3tqh",
          "author": "the_electric_bicycle",
          "body": "Let me guess, you’re over 35?",
          "score": -1,
          "created_utc": 1747948107.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtnw8ke",
      "author": "merelyok",
      "body": "![gif](giphy|MnpPCugwALAHsTygpd|downsized)",
      "score": 2,
      "created_utc": 1747925107.0,
      "replies": []
    },
    {
      "id": "mtovae9",
      "author": "mtl_jim2",
      "body": "This is a niche product for a niche market. Most people clearly aren’t understanding that. It’s to mimic film as much as possible, so certain things (like raw) are purposefully disabled",
      "score": 3,
      "created_utc": 1747935197.0,
      "replies": [
        {
          "id": "mtuju6b",
          "author": "grimoireviper",
          "body": "Even for a niche the pricing is just terrible. There's other cameras that can be used like this but at least have objectively better IQ for the same price.\n\nFor 800€ I can pick up a new Ricoh GRIII or an XM5 for example.",
          "score": 2,
          "created_utc": 1748013227.0,
          "replies": []
        },
        {
          "id": "mtpy6uv",
          "author": "ThinkExtension2328",
          "body": "Film is raw, you don’t take the film from the camera and put it into your photo album. \n\nYou go get it developed that’s the raw to jpg process.",
          "score": 3,
          "created_utc": 1747946447.0,
          "replies": []
        },
        {
          "id": "mtrllbc",
          "author": "Interesting_Ghosts",
          "body": "It seems less to mimic the film experience and more the film camera experience. Film is more flexible than the limitations built into this device. \n\nThis thing is made for a niche person and it’s supposed to be fun. That’s why Reddit hates it. A big company made an oddball thing that’s supposed to just be quirky and neat and fun. \n\nRedditors hate fun and Reddit photography people hate everything lol.",
          "score": 0,
          "created_utc": 1747966625.0,
          "replies": [
            {
              "id": "mtrwtjc",
              "author": "RobertdBanks",
              "body": "For $800 it’s understandable that people are going to go “why”\n\nAs someone who has shot film on and off for 10-15 years, I don’t know who this is for",
              "score": 5,
              "created_utc": 1747970948.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mtox1ef",
      "author": "Handsome_fart_face",
      "body": "For $850, i rather just get a real 35mm and kit to develop my own film.",
      "score": 1,
      "created_utc": 1747935688.0,
      "replies": [
        {
          "id": "mtpcuin",
          "author": "TheHerbsAndSpices",
          "body": "You could buy several cameras, lenses, and rolls of 35mm film for $850.",
          "score": 2,
          "created_utc": 1747940219.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mto3ti9",
      "author": "WardenEdgewise",
      "body": "My phone also doesn’t shoot RAW.",
      "score": 2,
      "created_utc": 1747927315.0,
      "replies": [
        {
          "id": "mto8lko",
          "author": "JaggedMetalOs",
          "body": "My phone does :)",
          "score": 17,
          "created_utc": 1747928679.0,
          "replies": []
        },
        {
          "id": "mtobj2w",
          "author": "wineheda",
          "body": "Most phones do though, right?",
          "score": 9,
          "created_utc": 1747929518.0,
          "replies": [
            {
              "id": "mtoj8u8",
              "author": "-DementedAvenger-",
              "body": "Depends on the app and settings. \n\nMy native camera app doesn’t, but I have an app that can.",
              "score": 2,
              "created_utc": 1747931793.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mtowy7o",
      "author": "jcliment",
      "body": "It can't or it won't?",
      "score": 1,
      "created_utc": 1747935663.0,
      "replies": [
        {
          "id": "mtpy8mj",
          "author": "ThinkExtension2328",
          "body": "Both.",
          "score": 1,
          "created_utc": 1747946461.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtpjo2g",
      "author": "Infinitehope42",
      "body": "That’s stupid.",
      "score": 1,
      "created_utc": 1747942216.0,
      "replies": []
    },
    {
      "id": "mtq5c6v",
      "author": "Otaraka",
      "body": "People seem to be being awfully literal about what analog means compared to raw. ",
      "score": 1,
      "created_utc": 1747948570.0,
      "replies": []
    },
    {
      "id": "mtq5vlz",
      "author": "Lefia",
      "body": "[https://nikonpc.com/](https://nikonpc.com/) if you want to try the effects, mut better",
      "score": 1,
      "created_utc": 1747948735.0,
      "replies": []
    },
    {
      "id": "mtsrq43",
      "author": "Toloc42",
      "body": "This sounds like a fun lil gimmicky gadget... For maybe 100$ absolute max, with hardware specs to match its gimmick character.\n\nOr like a fun special mode tacked onto a fully functional camera.\n\nLike this it sounds like a set of idiotic product design decisions wasting some nice camera parts.\n\nEven if there's a niche for this feature set as is claimed here, this is a dumb way of filling it.",
      "score": 1,
      "created_utc": 1747986758.0,
      "replies": []
    },
    {
      "id": "mtsud68",
      "author": "Hpfanguy",
      "body": "No RAW you say?\n\nSo Gordon Ramseys favorite camera?",
      "score": 1,
      "created_utc": 1747988357.0,
      "replies": []
    },
    {
      "id": "mtu6ieq",
      "author": "OutsideProof7708",
      "body": "Y’all were wearing condoms when taking photos?!?",
      "score": 1,
      "created_utc": 1748009385.0,
      "replies": []
    },
    {
      "id": "mtus2do",
      "author": "apageofthedarkhold",
      "body": "They've essentially taken a digital camera from 20 years ago, stripped it of any functionality anyone actually wants, and repackaged it with an $800+ price tag.  I own this camera already... It works on two AA batteries and an xd card.",
      "score": 1,
      "created_utc": 1748015524.0,
      "replies": []
    },
    {
      "id": "mtwb3c1",
      "author": "D1138S",
      "body": "This is just stupid enough for electronics consumers to totally eat it up… Even though you can buy a top brand name medium format camera for pennies now.",
      "score": 1,
      "created_utc": 1748031610.0,
      "replies": []
    },
    {
      "id": "mtwfnx8",
      "author": "trn-",
      "body": "Seeing all the hate for this cute camera, I’m 100% sure Fuji wont be able to make enough of it.\n\nIts clearly not made for the RAW folks, but for the young folks who yearn for the film camera experience but dont want to spend $$$$ on rolls of film/developing. It will be sold out _everywhere_.\n\nFor them, they do not a need a 40mp sensor, instagram images are small, so a tiby sensor will be juuuust fine. And it will still beat whatever smartphone with their compronised lenses and microscopic sensors.\n\nFilm sinulations, film effects, will add a quality and feel that smartphones wont be able to match.\n\nAnd its a tiny, stylish camera that fits in your pocket and also works as a fashion accessory.\n\nBelieve me, this will be a HIT.\nAgain, not with regular cameraheads, but with youngsters who want something between a big ass MILC and a smartphone.\n\nIf theres a downside, theres two: No harsh, xenon flash and that the lever is not the classic ratchet style, but that will probably get fixed in the Mk II. release.",
      "score": 1,
      "created_utc": 1748032998.0,
      "replies": []
    },
    {
      "id": "mtwywmf",
      "author": "commsbloke",
      "body": "From what I have seen an interesting camera but a bit of a miss for me.  \nWhy a coldshoe and no hotshoe or at least a sync socket.  \nI believe that the shutter release is threaded but no release mechanism in the thread.  \nNo filter thread. Possibly fixable aftermarket  \nNo frame guides in the viewfinder  \nWhy no raw, this is a software feature.  \nFor the price that they are asking these features should be available  \nWithout these features the price is too high.",
      "score": 1,
      "created_utc": 1748039313.0,
      "replies": []
    },
    {
      "id": "mtxu2wk",
      "author": "Annoying_Anomaly",
      "body": "It's our shtick and we're schticking to it!",
      "score": 1,
      "created_utc": 1748050814.0,
      "replies": []
    },
    {
      "id": "mv2z152",
      "author": "Tomomori79",
      "body": "I just canceled my pre order after finding out it only shoots Jpeg on a 1\" sensor. Like.... are you serious? For this price? If it shot RAF then fine, would be worth it to me but not with just Jpeg on a shit sensor. WTF Fuji... y'all just taking advantage of people with this one.",
      "score": 1,
      "created_utc": 1748618414.0,
      "replies": []
    },
    {
      "id": "mto7o0q",
      "author": "LordSlickRick",
      "body": "Despite all the film talk, and the misleading half size talk, it’s essentially an 800 dollar 1 inch point and shoot, that has Fuji’s built in digital filters. I’m sure someone out there would want this, point and shoots still have a place for people who want dedicated cameras with larger than IPhone sensors. But yeah it’s not groundbreaking. But it is affordable at 800 compared to something like Sonys latest rx100 at 1500 plus, bus slightly more expensive than say some of the Panasonic 1 inch cameras.\n\nIt’s ultimately not very exciting, except it looks nice and seems quite small. If it was closer to 650, I think it would be a much more interesting camera.",
      "score": 1,
      "created_utc": 1747928416.0,
      "replies": [
        {
          "id": "mtulmnl",
          "author": "grimoireviper",
          "body": ">But it is affordable at 800\n\nFor 800€ I bought a brand new Ricoh GRIII, looking at listings of my local stores I can alos get a brand new Fuji XM5 for that price or either a Sony ZV-E10 or ZV-1 II. \n\nSony Picture Profiles can simulate film as well with even more variety. You can also load LUTs onto them.\n\nEither way, all of those offer better image quality and functionality in the same price range, no matter what niche you are part of.",
          "score": 1,
          "created_utc": 1748013730.0,
          "replies": [
            {
              "id": "mtuqyjr",
              "author": "LordSlickRick",
              "body": "800 euro is 900 dollars. I don’t see new Ricoh GRiii at that price, maybe good condition used for a camera that came out in 2019. Yes you can get a new zve10 with the crappy 16-50 then you have to pay more for a new lens. \n\nMany people find fujis presets superior to Sony, I shoot raw so I don’t know but people often cite this.\n\nIt’s definitely slightly on the high end, but it’s not terrible pricing. However with how inflations going these days and tariffs and nonsense I’m not that surprised it’s 100 dollars more than I think it should cost.",
              "score": 1,
              "created_utc": 1748015219.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mtp79tv",
      "author": "Shadow_Relics",
      "body": "That’s weird. I can’t shoot unless it’s raw.",
      "score": 1,
      "created_utc": 1747938605.0,
      "replies": []
    },
    {
      "id": "mtoyw9z",
      "author": "PsychologicalEmu",
      "body": "How much more can you get with RAW on this? It’s a 1” sensor. Jpg is good enough. You know the target audience doesn’t care about that anyway. If you know better, you know the alternatives. GR3, older x100, etc etc. \n\nI’d get it if it was 300-500USD. 800USD is steep but we know the deal. Style, bragging rights, image, kawaii goals… Many will ironically get it for TikTok or IG and post an image of it using a mobile phone, use it for the summer at most, then set on the shelf. No doubt it’s gonna sell like hot cakes. Fujifilm disappoints my principals on this one but is smart on hopping on this backward facing train for the money.",
      "score": 0,
      "created_utc": 1747936208.0,
      "replies": []
    },
    {
      "id": "mtq2mxo",
      "author": "dumbgraphics",
      "body": "Ummm… the price people will pay is now $150-$199. Just trying to help fuj. Smell that coffee.",
      "score": 0,
      "created_utc": 1747947744.0,
      "replies": []
    },
    {
      "id": "mto8fao",
      "author": "pinkynarftroz",
      "body": "The irony is shooting RAW most lets you mimic analog film.\n\nWith RAW you can control exactly how you map the sensor data into an image format. If you set up your pipeline right, you can have the characteristics emulate whatever film stock you want, or even create a hypothetical stock that doesn't exist.",
      "score": -4,
      "created_utc": 1747928629.0,
      "replies": [
        {
          "id": "mtogqm7",
          "author": "roadmapdevout",
          "body": "That's sort of true but when you use Fuji's in camera processing, as when you use film, the image will have a certain look and feel to it - variations in saturation, contrast, sharpness, graininess etc. that are baked in. The Fuji JPEG's genuinely look really good - I keep the RAWs in case I want to get something from the image the in-camera processing didn't do for me, but almost every time I try to tweak it, when I look back at the JPEG I find that I did a worse job than the camera.",
          "score": 2,
          "created_utc": 1747931053.0,
          "replies": [
            {
              "id": "mtpxq8o",
              "author": "pinkynarftroz",
              "body": "Nothing is baked in with raw. It’s simply the raw voltages of the sensor elements. That’s the whole point. All processing is done later in software in the manner you choose.\n\nIf RAW is in fact processed on such a camera (or it forces you to use only one color science), it isn't truly raw. \n\nThe JPEG has been processed with whatever color science and settings that Fuji ships with the camera. But you can do whatever you want if you have the RAW image. You could use Nikon or canon’s color science. Or you could use one you create that emulates a film stock.",
              "score": -2,
              "created_utc": 1747946316.0,
              "replies": [
                {
                  "id": "mtqw9q1",
                  "author": "roadmapdevout",
                  "body": "yeah i know",
                  "score": 2,
                  "created_utc": 1747957518.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mtpyg5i",
          "author": "ThinkExtension2328",
          "body": "Yes but I’d rather eat glass then to be made to buy adobe light room to use my camera.",
          "score": -1,
          "created_utc": 1747946522.0,
          "replies": [
            {
              "id": "mtq0m04",
              "author": "pinkynarftroz",
              "body": "Then don’t? Lightroom is not your only option for raw processing…",
              "score": 3,
              "created_utc": 1747947150.0,
              "replies": [
                {
                  "id": "mtq2afo",
                  "author": "ThinkExtension2328",
                  "body": "What’s my other options? (not being sarcastic) I don’t really want to pay some subscription service to use my dam camera.",
                  "score": 0,
                  "created_utc": 1747947639.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mtnvv78",
      "author": "FoodTiny6350",
      "body": "So we have to put a condom on it too? Damnit libs ruin everything can’t even go in raw with my damn camera",
      "score": -13,
      "created_utc": 1747924998.0,
      "replies": []
    },
    {
      "id": "mto0g7g",
      "author": "depwnz",
      "body": "what's the point of using a specific camera model if you just adjust the raw file in lightroom? love this non-feature",
      "score": -6,
      "created_utc": 1747926337.0,
      "replies": []
    }
  ]
}