{
  "post": {
    "title": "Apple reportedly gives up on its AR video glasses project",
    "author": "BlueLightStruct",
    "id": "1iepikz",
    "score": 3105,
    "created_utc": 1738358036.0,
    "selftext": "",
    "num_comments": 243,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1iepikz/apple_reportedly_gives_up_on_its_ar_video_glasses/"
  },
  "comments": [
    {
      "id": "ma9q0l9",
      "author": "ChafterMies",
      "body": "As a glasses wearer, all I want is a pair of glasses, like I already wear, with information like what the Terminator sees in the 1984 movie “The Terminator”.",
      "score": 1235,
      "created_utc": 1738359828.0,
      "replies": [
        {
          "id": "mab7fdl",
          "author": "wellrat",
          "body": "As a carpenter I dream of some glasses that can accurately and reliably measure distance, area, and volume. If they could project stud/joist layout, even better. Calculating things like fastener quantity or grout usage based on tile size and joint spacing would be amazing too.  \nWhile we're at it I'd also like suspensors I could slap on heavy items and float them to where I need them.",
          "score": 228,
          "created_utc": 1738377103.0,
          "replies": [
            {
              "id": "mabrk0s",
              "author": "parasubvert",
              "body": "A tradesmen on the Vision Pro forum was showing something just like this https://www.reddit.com/r/VisionPro/s/mXUK8ld77I\n\n\nThere’s also a pretty decent measurement app that uses the vision pros LiDAR",
              "score": 71,
              "created_utc": 1738384855.0,
              "replies": [
                {
                  "id": "manptnr",
                  "author": "ITfromZX81",
                  "body": "I feel like Apple is trying to develop a breakthrough but are not quite there yet.  I think it’s coming and I’m glad they tried but I think the cost is too high and they are not quite ready.",
                  "score": 7,
                  "created_utc": 1738545418.0,
                  "replies": [
                    {
                      "id": "maoaxef",
                      "author": "parasubvert",
                      "body": "Gotta start somewhere.  Frankly the accessibility features alone are incredible, like you can control everything including physical buttons with just your eyes etc.",
                      "score": 1,
                      "created_utc": 1738552322.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mao11vl",
                  "author": "froginbog",
                  "body": "HoloLens too",
                  "score": 3,
                  "created_utc": 1738549051.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "macs5o5",
              "author": "Nagemasu",
              "body": "They have something like this in the aero industry for internals on aircraft, but it's just AR. The other stuff like measuring/calculations you're after isn't so difficult, it's more about the demand for it.  \n  \nhttps://www.reddit.com/r/ThatsInsane/comments/xyb6bw/these_goggles_allow_maintenance_staff_to_see/",
              "score": 17,
              "created_utc": 1738404571.0,
              "replies": [
                {
                  "id": "maeb57y",
                  "author": "None",
                  "body": "Once again inhibited by capitalism.",
                  "score": 10,
                  "created_utc": 1738427445.0,
                  "replies": [
                    {
                      "id": "majjvn5",
                      "author": "ScamperAndPlay",
                      "body": "Explain?",
                      "score": 0,
                      "created_utc": 1738498796.0,
                      "replies": [
                        {
                          "id": "majkgsw",
                          "author": "None",
                          "body": "Sure. Going back to early days of america the thought was that innovation was spurred by desperation. Currently innovation is only currated if there is a percievable consumer as the end game. Many thoerize this is why we get cures for cancer ever 5 years but they never cure cancer. Wouldnt be profitable compared to months of chemo. Hope this helps you out!",
                          "score": 7,
                          "created_utc": 1738499093.0,
                          "replies": [
                            {
                              "id": "mana1t2",
                              "author": "alidan",
                              "body": "I somewhat agree but mostly disagree\n\n>innovation was spurred by desperation\n\nyou have to innovate or you die, we have this all around us, but the most ways we see it used are in, lets say iems, where its a race to the bottom. there is an iem called salnotes zero, which sound tone  wise is on par with 150-200$ iems when they cost 20$, my iems at the time were blessing 2's which tone wise were playing with iems that cost 1000$, not quite there but close enough, my current iems dusks (blessing 3 but with 2 planar magnetics instead of 4 ba's) are above the 1000$ price mark in quality for 360, and the old blessing 2's are currently being played with by 80$ truthear hexas, tws you have 20$ space travels, and then they are quality comparable up to the 150$ range, where I have airpods to compare to and the space travels honestly... I say they are better. \n\nalot of innovation is stunted by patents, take a look at uclogic digitizers and wacom for a great example of this, it took a hell of alot of innovation for china to be able to side step wacoms patent's for releasing tablets in the west, the result of that was 60$ tablets that were feature for feature as good as 350$ wacom tablets, and in more recent years penable displays that just kicked wacoms teeth in for form factor (wacom was 3-4 inches thich at a point where monitors were fat at 1 inch, and needed active cooling, china monitors came out in normal monitor form factors) \n\nmost innovation doesn't come from desperation anymore, it comes from a race to the bottom while not sacrificing needed features, and quite alot of our current 'needs' are at the point where hundreds of millions of dollars are needed to improve something where as in the past there was quite alot of low hanging fruit, for an example of this look at american trucks, they aren't huge because we want huge, they are huge because of emission standards, its far FAR easier to make a truck larger to be able to pass emissions than it is to make small truck pass emissions  because the smaller a car is the more strict emissions standards are. \n\nas for a cancer cure, the reason its so hard to get one isn't because there is more money in treatment (though I do know for a fact major investors openly asked a drug research lab why in the fuck are they researching cures instead of treatments) its because cancer specifically is tied to dna, any treatment would need to be made specifically for that person's dna. all we can really do is get better generalized treatments. \n\nas for cancer cures, look into research on them, almost every time the problem is side effects or the treatment does not pan out",
                              "score": 1,
                              "created_utc": 1738540305.0,
                              "replies": [
                                {
                                  "id": "manc7qg",
                                  "author": "None",
                                  "body": "Explain monoprice then.",
                                  "score": 1,
                                  "created_utc": 1738541002.0,
                                  "replies": [
                                    {
                                      "id": "mangy8m",
                                      "author": "alidan",
                                      "body": "in what way?\n\nwhat I remember about monoprice is they effectively act as a distributor for chinese stuff that lets them put their name on it, and at least were trying to get into more custom/higher end markets with audio stuff but I haven't paid attention to them in quite a long time.",
                                      "score": 1,
                                      "created_utc": 1738542535.0,
                                      "replies": [
                                        {
                                          "id": "manj7dt",
                                          "author": "None",
                                          "body": "They make direct copies of clearly patented technology but sell it on the open market and undercut domestic competition.",
                                          "score": 1,
                                          "created_utc": 1738543263.0,
                                          "replies": [
                                            {
                                              "id": "mannxca",
                                              "author": "alidan",
                                              "body": "googling them don't show me what the patents are, just that cases are settled, the only issue one would be in 2013 with a seeming clone of klipsch speakers.\n\nthere are currently around 4 million active patens, who knows how many are valid or even if they are if they are enforceable. at a certain point its better to just put something on the market and find out later through a fine if its legal or not.\n\nas long as they license the patent or get the patent tossed\n\nand honestly, I don't think that there is a domestic market for nearly anything on monoprice.",
                                              "score": 1,
                                              "created_utc": 1738544802.0,
                                              "replies": [
                                                {
                                                  "id": "manrr82",
                                                  "author": "None",
                                                  "body": "You were the one talking about planar magnets. I thought you knew.",
                                                  "score": 1,
                                                  "created_utc": 1738546042.0,
                                                  "replies": [
                                                    {
                                                      "id": "maoajeg",
                                                      "author": "alidan",
                                                      "body": "there are essentially 4 driver types in iems\n\ndynamic drivers, either used for everything or bass only\n\nblanced armitures which can be used at any point by are best in mids and high\n\nplanar magnetic drivers which are capable of everything but currently small ones are being used for highs\n\nand electrostatic which I think are only used for highs\n\nmonoprice did make a planar magnetic headphone at some point, but it was worse than equally priced hifiman, I don't think that was ever a patent problem/knock off though.",
                                                      "score": 1,
                                                      "created_utc": 1738552191.0,
                                                      "replies": [
                                                        {
                                                          "id": "maps4e1",
                                                          "author": "None",
                                                          "body": "You dont know shit. Monoprice was a quarter the price of hifiman. And electrostatic is full range. Wtf are you even spamming this at me for if you dont know shit?",
                                                          "score": 1,
                                                          "created_utc": 1738578634.0,
                                                          "replies": [
                                                            {
                                                              "id": "mau9mju",
                                                              "author": "alidan",
                                                              "body": "do you purposefully miss the part where I am talking about iems, then you go to full headphones, IN IEMS this is how they are used. \n\nnow back to your monoprice planar question, monoprice if I remember back when they first came out were between 300 and 400$ and ended up being worse than dynamic driver options that were cheaper, and within 50$ of hifiman equivalent headphones that were night and day better, im looking at current offerings of monoprice, their cheapest is 200$ closed back, their open back starts at 250, hifiman on sale starts at 100$ (currently they are) and off sale start at 150, their closed back is currently 130$ and are normally 400$.\n\npoint is, monoprice was worse back then than hifiman, I have no idea about todays, but I moved from headphones to iems in the time between them first putting out planars and now so I dont keep up with that segment of audio.",
                                                              "score": 1,
                                                              "created_utc": 1738630261.0,
                                                              "replies": [
                                                                {
                                                                  "id": "mausqik",
                                                                  "author": "None",
                                                                  "body": "Back to the point is that monoprice offers clearly patented technology at discount prices. So esplain that.",
                                                                  "score": 1,
                                                                  "created_utc": 1738636451.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "mavl39t",
                                                                      "author": "alidan",
                                                                      "body": "ok let me copy paste what I said\n\n>googling them don't show me what the patents are, just that cases are settled, the only issue one would be in 2013 with a seeming clone of klipsch speakers.\n\n>there are currently around 4 million active patens, who knows how many are valid or even if they are if they are enforceable. at a certain point its better to just put something on the market and find out later through a fine if its legal or not.\n\nThere are so many patents that its not viable to read through 12+ million pages of documentation (many of the patents I have read are 3~ pages long of text alone, not counting images but text is the part that really makes it hard to parse fast) to see if you are violating a patent.\n\nthen to actually be violating a patent it has to be valid, patents are not checked against each other and get tossed frequently because some other patent form nearly 100 years ago already did that, then you also have prior art patents where the idea was already in the public conscious and you can't patent it all over again. in cases like these you go to court and if it is a violation, you pay damage and most likely a license for the patent. \n\nyou may not understand this but businesses, especially smaller ones, its cheaper to fuck around (violate patents in this case) and find out (pay the fine and license) then it is to hire lawyers to do everything, and yes, monoprice is still on the smaller side for having lawyers look over every single thing they do to make sure its all good. \n\nand just so you know, patent law is a civil case, not criminal, until it hits the point of counterfeiting, you go through civil court. the closest monoprice got to that was 12 years ago with the klipsch energy clones, though I can't find details on that.\n\nbecause you mention planar magnetic, the tech is over 50 years old, patents on many of them are long expired, patents last 20 years, design patents 15 years. once they expire, anyone can use them.",
                                                                      "score": 1,
                                                                      "created_utc": 1738647228.0,
                                                                      "replies": [
                                                                        {
                                                                          "id": "mawjv3f",
                                                                          "author": "None",
                                                                          "body": "Monoprice generates over $200 million in revenue a year. So all of what you just said is highly inaccurate. They are by no means a small company. They are headquartered in cali which is highly populated by cheap lawyers. They know what they do and its the same thing as every other company on amazon. They harvest patents, send slightly reworked designs to china, and we get to buy expensive tech for cheal because really nobody cares. Nobody cares.",
                                                                          "score": 1,
                                                                          "created_utc": 1738667293.0,
                                                                          "replies": [
                                                                            {
                                                                              "id": "mawqgtt",
                                                                              "author": "alidan",
                                                                              "body": "74 million in revenue last year, and that at least to my understanding is gross revenue not net, so what they made is lower than that.\n\na patent lawyer costs 300-600$ per hour. \n\na patent dispute almost always gets settled out of court, either in licensing the patent or removal of product due to going though the legal system being 3-5 years and several million dollars, almost always cost prohibitive for both parties.\n\n>send slightly reworked designs\n\nno, monoprice goes to manufactures, and imports from them with their name on the caseing.\n\nchina effectively has a few tiers for how you do buisness with them\n\n1) manufacturer direct - you make a large volume purchase from a manufacturer and part it out yourself\n\n2) you cant make the big purchase so you go through a middleman who did, this is effectively alibaba.\n\n3) you dont want to buy 100 usb thumbdrives, you only want one, so this is aliexpress tier, \n\n4) then you have the people who import from there to the us and sell it on amazon. \n\nfor a fun visual of how this works, look up lemon cymbals, an electronic drum cymbal, a pack of 3 from 14 to 18 inch costs 130$ on alibaba, express parts them out for 70$ each, and on amazon you are looking at 100$ minimum \n\nmonoprice is effectively amazon sellers but buying things they know will sell so they don't mark them up out the ass like other people do.",
                                                                              "score": 1,
                                                                              "created_utc": 1738670684.0,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "mawrstx",
                                                                                  "author": "None",
                                                                                  "body": "So circling all the way back to my original point, why cancer isnt profitable to cure, you are saying if we want cancer to be cured we need to outsource it to china and damn the existing patents?",
                                                                                  "score": 1,
                                                                                  "created_utc": 1738671303.0,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "mb07c6k",
                                                                                      "author": "alidan",
                                                                                      "body": "cancer won't be cured until a personalized treatments based on dna are viable. \n\nthe main issue is cancer is our dna mutating and no longer self destructing, a treatment would not only need to be able to know what's good, it would need to also know what's bad, till we get that kind of treatment the only thing we can do is general treatments.\n\nbut when we do general treatments individuals will have something that works wonders for some reason or we find a new treatment that only works in a rat, news picks up on it and does what news does, exaggerate till the news is closer to a lie than truth, and there you go, we hear cancer is close to being cured and then it goes away entirely. \n\nif you want to look at something more interesting, look up aids, that one actually is getting close to cured, I believe 2 individuals last I looked at it were now aids free, I don't know the details of it, but because aids is not our dna mutating, it's going to be cured before cancer.",
                                                                                      "score": 1,
                                                                                      "created_utc": 1738708873.0,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "mb0f3qh",
                                                                                          "author": "None",
                                                                                          "body": "Im really more interested in the macroeconomics of it rather than the scientific layers of bullshit. Give me a flintstones vitamin that is grape flavored, if it has to come from overseas... we all understand why.",
                                                                                          "score": 1,
                                                                                          "created_utc": 1738711358.0,
                                                                                          "replies": []
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "maryqbh",
                              "author": "Count_Rousillon",
                              "body": "That's not true for cancer.   During the 70s, there was a push for a \"War on Cancer\" that treated all cancers as the same thing.   But cancer is more like a broad spectrum of diseases rather than a single common illness.   There's been a lot of cures for a specific mutation based cancer, because there's a lot of different ways to get uncontrolled cell growth (Cancer), and they have to be dealt with in different ways.",
                              "score": 1,
                              "created_utc": 1738606474.0,
                              "replies": [
                                {
                                  "id": "mas5a57",
                                  "author": "None",
                                  "body": "Sounds like you missed my point.",
                                  "score": 1,
                                  "created_utc": 1738608291.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "majl0xe",
                              "author": "ScamperAndPlay",
                              "body": "You’re explaining greed.\n\nJust wanted to make sure I didn’t misunderstand you.",
                              "score": -6,
                              "created_utc": 1738499376.0,
                              "replies": [
                                {
                                  "id": "majx2gz",
                                  "author": "mack_ani",
                                  "body": "Capitalism is an economic system fueled by greed, yes.",
                                  "score": 9,
                                  "created_utc": 1738504527.0,
                                  "replies": [
                                    {
                                      "id": "makve2j",
                                      "author": "ScamperAndPlay",
                                      "body": "Oh, there’s a system you know of that tamps down greed?",
                                      "score": -2,
                                      "created_utc": 1738515345.0,
                                      "replies": [
                                        {
                                          "id": "mamrbdl",
                                          "author": "ApprehensiveTry5660",
                                          "body": "If you find it, let us know.",
                                          "score": 2,
                                          "created_utc": 1738534440.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mal2ydj",
                                  "author": "fueled_by_caffeine",
                                  "body": "The only goal of capitalism is maximizing shareholder profit amigo. What is that if not greed?",
                                  "score": 4,
                                  "created_utc": 1738517445.0,
                                  "replies": [
                                    {
                                      "id": "mal54jf",
                                      "author": "ScamperAndPlay",
                                      "body": "Capitalism was created before the stock market - try again.\n\nPlease tell you found a system that stamps out Greed? Literally, that’s my question. I’ve traveled the world, I don’t know if I have ever been to place that has no greed.",
                                      "score": -1,
                                      "created_utc": 1738518046.0,
                                      "replies": [
                                        {
                                          "id": "mal89x4",
                                          "author": "fueled_by_caffeine",
                                          "body": "What are you talking about. You don’t need to have a stock market to have shareholders. What do you think private corporations are.",
                                          "score": 6,
                                          "created_utc": 1738518879.0,
                                          "replies": [
                                            {
                                              "id": "maliapd",
                                              "author": "None",
                                              "body": "Hes just trying to get you to say the word \"socialism\" because it is based off needs rather than wants. He is attempting to bait you into explaining how the star trek economy functions.",
                                              "score": 1,
                                              "created_utc": 1738521563.0,
                                              "replies": [
                                                {
                                                  "id": "maljgm4",
                                                  "author": "fueled_by_caffeine",
                                                  "body": "Oh I know. There’s also an indirect appeal to human nature being made to claim “any system centered around anything but greed cannot possibly work and it’s very sad but that’s just life isn’t it”.",
                                                  "score": 3,
                                                  "created_utc": 1738521878.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "manae4m",
                                          "author": "alidan",
                                          "body": "the stock market demands infinite growth, there is no place for a well oiled machine that prints money but doesn't grow.\n\nyou see companies that are privately owned are more often than publicly own not greedy, they are happy with market share and steady revenue.",
                                          "score": 1,
                                          "created_utc": 1738540414.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "makj61o",
                                  "author": "None",
                                  "body": "Sounds like you kind of get it.\n\n![gif](giphy|31Q36EHJ7C5ZoIMw79)",
                                  "score": 0,
                                  "created_utc": 1738511805.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "maqkt4k",
                      "author": "Comfortable-Run-437",
                      "body": "You could donate your time for free to make it happen if you think capitalism is to blame for this specific feature that is likely more difficult than you think and other people may not have the same desire for. ",
                      "score": 0,
                      "created_utc": 1738591758.0,
                      "replies": [
                        {
                          "id": "maqsswm",
                          "author": "None",
                          "body": "How did you end up here in a 3 day old post in a buried comment I wonder... beep boop beep",
                          "score": 1,
                          "created_utc": 1738594436.0,
                          "replies": [
                            {
                              "id": "mberblb",
                              "author": "Comfortable-Run-437",
                              "body": "Yes , becausa  highly specific response is clearly the sign of a bot and not someone who doesn’t check their Reddit that often, but it’s seems nice to live in a world where anyone who disagrees with my views is a bot, I’ll try it going forward. ",
                              "score": 1,
                              "created_utc": 1738895142.0,
                              "replies": [
                                {
                                  "id": "mbevp74",
                                  "author": "None",
                                  "body": "I wasnt replying to you 5 days ago so you wouldnt have gotten the notification on my buried comment and there is literally no reason a normal person would dig this deep into an old post. So yeah... big suspicious.",
                                  "score": 1,
                                  "created_utc": 1738896642.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mai7onc",
              "author": "ntyperteasy",
              "body": "I want the glasses to be accurate enough and understand the context of building enough to tell me that the next tile has to be trimmed 1/4” and at a 2 degree angle…. Maybe feed that info to the CNC tile saw and then my humanoid robot helper runs it to me.  \n\nOne day…",
              "score": 3,
              "created_utc": 1738472936.0,
              "replies": []
            },
            {
              "id": "mab9ny1",
              "author": "poofyhairguy",
              "body": "First part can be done with a Quest 3 so we are heading that way.",
              "score": 7,
              "created_utc": 1738377898.0,
              "replies": [
                {
                  "id": "madq13f",
                  "author": "thisischemistry",
                  "body": "You can do it with an iPhone too, pretty much.",
                  "score": 3,
                  "created_utc": 1738420658.0,
                  "replies": [
                    {
                      "id": "madrx7b",
                      "author": "myasterism",
                      "body": "Yep! And, for those who are unaware, the app is called “Measure”",
                      "score": 2,
                      "created_utc": 1738421311.0,
                      "replies": [
                        {
                          "id": "madtxoq",
                          "author": "thisischemistry",
                          "body": "Good call, mentioning the app name.\n\n[Apple Support: Use the Measure app on your iPhone, iPad, or iPod touch](https://support.apple.com/en-us/102468)\n\n> The Measure app uses augmented reality (AR) technology to turn your device into a tape measure. You can gauge the size of objects, automatically detect the dimensions of rectangular objects, and save a photo of the measurement.",
                          "score": 5,
                          "created_utc": 1738422003.0,
                          "replies": [
                            {
                              "id": "makaapy",
                              "author": "turdlezzzz",
                              "body": "i work in an industry where we measue size of things down to a 1/16th of an inch. when i first saw this app i thought i would try it out at work to see how accurate it can be. after 30 seconds i realized it was a waste of f¿cking space on my phone",
                              "score": 0,
                              "created_utc": 1738509106.0,
                              "replies": [
                                {
                                  "id": "mamv4zh",
                                  "author": "thisischemistry",
                                  "body": "Only 1/16th? Why so inaccurate? I work in an industry where we measure things down to the nanometer and this app is completely worthless for that! Why would I even bother with it, what a waste of fucking space. /s",
                                  "score": 2,
                                  "created_utc": 1738535601.0,
                                  "replies": [
                                    {
                                      "id": "manaq9g",
                                      "author": "alidan",
                                      "body": "the apps that do measurements like this are inaccurate to the point you still have to measure it traditionally anyway. and if you do measurements often, its better to get a bluetooth laser one that can import measurements and shapes you are measuring.",
                                      "score": 1,
                                      "created_utc": 1738540521.0,
                                      "replies": [
                                        {
                                          "id": "mancsf5",
                                          "author": "thisischemistry",
                                          "body": "If you need 1/16 inch accuracy at 20 feet away then you're not going to get that with most AR systems. It's all in your use-case, with that one you *need* a laser or physical measuring device to get even close to that kind of accuracy. Stuff like AR will give you within an inch or two at 20 foot distances.\n\nUse the proper tool for the job.",
                                          "score": 2,
                                          "created_utc": 1738541188.0,
                                          "replies": [
                                            {
                                              "id": "manhko1",
                                              "author": "alidan",
                                              "body": "last time I used one, it was constantly 2 inches off and trying to just do up close stuff, and trying to do my room it was around 6 inches off. it may have gotten better but if I need to make measurements like that again im going laser with bluetooth and save the headache",
                                              "score": 1,
                                              "created_utc": 1738542737.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mafks99",
                          "author": "ohheckyeah",
                          "body": "It’s not near precise enough for construction/carpentry",
                          "score": 7,
                          "created_utc": 1738441048.0,
                          "replies": [
                            {
                              "id": "majnamn",
                              "author": "myasterism",
                              "body": "You’re totally right! But in a pinch, it’s better than nothing, and a lot of people aren’t even aware the app exists.",
                              "score": 1,
                              "created_utc": 1738500465.0,
                              "replies": []
                            },
                            {
                              "id": "mane0mx",
                              "author": "thisischemistry",
                              "body": "> If they could project stud/joist layout, even better. Calculating things like fastener quantity or grout usage based on tile size and joint spacing would be amazing too.\n\nIt's fine for those use-cases. All you need for those is an estimate of overall size of the project to the inch level. You wouldn't be able to use it to precisely place individual fasteners or anything but you could say that a space so wide and so tall would take this many studs and about this many fasteners.",
                              "score": 1,
                              "created_utc": 1738541585.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mabmels",
                  "author": "l0z",
                  "body": "Any apps you recommend that can do AR measuring?",
                  "score": 2,
                  "created_utc": 1738382694.0,
                  "replies": [
                    {
                      "id": "madu653",
                      "author": "Dorintin",
                      "body": "The Layout app by Meta on the quest store is pretty accurate",
                      "score": 2,
                      "created_utc": 1738422085.0,
                      "replies": []
                    },
                    {
                      "id": "mabnaa7",
                      "author": "poofyhairguy",
                      "body": "Reality Ruler",
                      "score": 1,
                      "created_utc": 1738383053.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "magxa2z",
              "author": "Arthurdubya",
              "body": "Nah, if they got the tech to judge all that accurately with a camera, they're just going to have the robot replace you entirely.",
              "score": 2,
              "created_utc": 1738456483.0,
              "replies": [
                {
                  "id": "mahat5s",
                  "author": "wellrat",
                  "body": "Shhhhhhhhh",
                  "score": 1,
                  "created_utc": 1738460994.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "maf8kru",
              "author": "tankpuss",
              "body": "They should probably also block either your vision with warnings or not allow your table saw to spin up if you're not wearing PPE and appropriate safeguards installed.",
              "score": 2,
              "created_utc": 1738437354.0,
              "replies": []
            },
            {
              "id": "mairfr5",
              "author": "spacekitt3n",
              "body": "I feel like ar will be way more useful like this, and medical applications, niche trades, etc, than in the broader consumer market.  ",
              "score": 1,
              "created_utc": 1738482325.0,
              "replies": []
            },
            {
              "id": "majtk45",
              "author": "nvrrsatisfiedd",
              "body": "At that point you might as well replace yourself with a robot that does it all for you lol.",
              "score": 1,
              "created_utc": 1738503162.0,
              "replies": []
            },
            {
              "id": "makvcjm",
              "author": "BlewByYou",
              "body": "This!!!!!!!",
              "score": 1,
              "created_utc": 1738515334.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ma9tble",
          "author": "azlan194",
          "body": "Well, the prototype from Meta is doing exactly that. Very cool technology wise, but its Meta, sooo...",
          "score": 238,
          "created_utc": 1738360781.0,
          "replies": [
            {
              "id": "ma9yi77",
              "author": "ChafterMies",
              "body": "I know what you mean. I don’t want Facebook in my life much less on my face.",
              "score": 182,
              "created_utc": 1738362312.0,
              "replies": [
                {
                  "id": "maaskgq",
                  "author": "TheHornet78",
                  "body": "Yeah! *hides Quest 2 behind my back*",
                  "score": 58,
                  "created_utc": 1738371944.0,
                  "replies": [
                    {
                      "id": "mab35e7",
                      "author": "Cashforhash",
                      "body": "stuffs quest 3 back in my pants",
                      "score": 40,
                      "created_utc": 1738375599.0,
                      "replies": [
                        {
                          "id": "mabblvb",
                          "author": "TheHornet78",
                          "body": "Say is that a Quest 3 in your pants or y’a just happy to see me? ( ͡° ͜ʖ ͡°)",
                          "score": 27,
                          "created_utc": 1738378594.0,
                          "replies": [
                            {
                              "id": "mabrme4",
                              "author": "CloserToTheStars",
                              "body": "I am sure as hell happy to see through you \\^\\^",
                              "score": 2,
                              "created_utc": 1738384883.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "maav9do",
                  "author": "QXPZ",
                  "body": "EW I GOT META ON MY FACE",
                  "score": 21,
                  "created_utc": 1738372862.0,
                  "replies": []
                },
                {
                  "id": "maco06b",
                  "author": "BlitzSam",
                  "body": "I want Oculus back. I liked Oculus. Go away Zuck!",
                  "score": 10,
                  "created_utc": 1738402074.0,
                  "replies": [
                    {
                      "id": "madi9yj",
                      "author": "phrunk7",
                      "body": "Zuck sucks but Quest 3 is fire.",
                      "score": 1,
                      "created_utc": 1738417835.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mabncsg",
                  "author": "None",
                  "body": "Facefuck",
                  "score": 7,
                  "created_utc": 1738383082.0,
                  "replies": []
                },
                {
                  "id": "madoums",
                  "author": "opeth10657",
                  "body": "At least they have a separate account for the VR stuff now, so you can drop the actual facebook account.",
                  "score": 5,
                  "created_utc": 1738420245.0,
                  "replies": []
                },
                {
                  "id": "mac4k6s",
                  "author": "Moonman08",
                  "body": "💀",
                  "score": 0,
                  "created_utc": 1738391002.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "maau9ow",
              "author": "KingOfTheCouch13",
              "body": "That’s my issue too. I think they can actually be a game changer the same way smart phones were 15 years ago. But I have no desire to have meta that integrated in my life. I hope one of these indie companies can pull it off because apple and google are somehow failing with hundreds billion dollar budgets.",
              "score": 29,
              "created_utc": 1738372521.0,
              "replies": [
                {
                  "id": "macr8s9",
                  "author": "2roK",
                  "body": "If you use WhatsApp or Facebook, Meta already listens to, watches and reads most part of your life.",
                  "score": 1,
                  "created_utc": 1738404021.0,
                  "replies": []
                },
                {
                  "id": "madktoc",
                  "author": "simpliflyed",
                  "body": "If Apple aren’t releasing it, the tech probably isn’t good enough yet.",
                  "score": 0,
                  "created_utc": 1738418791.0,
                  "replies": [
                    {
                      "id": "mahg5pj",
                      "author": "-NotActuallySatan-",
                      "body": "Or rather, it's just not able to be packed in a design that they like, at a price they can afford to sell it at without the financial crutch of personal data collecting that Meta is able to do",
                      "score": 2,
                      "created_utc": 1738462813.0,
                      "replies": [
                        {
                          "id": "mapmaax",
                          "author": "simpliflyed",
                          "body": "So the tech is too big and/or too expensive. \nI’d say that’s the same as not ready.",
                          "score": 1,
                          "created_utc": 1738575030.0,
                          "replies": [
                            {
                              "id": "maxmjey",
                              "author": "-NotActuallySatan-",
                              "body": "The tech is ready tho? Meta, Halliday, other companies are showing that there are multiple designs you can do, but most all of them most likely have some type of data collection keeping the price relatively low under 1k USD. Apple doesn't have that same crutch, and considering that they make devices that are additive to the ecosystem rather than replacements for existing products (they wouldn't want the glasses to replace the Apple watch for example), they would need to find a way to make the device unique from the rest of their product portfolio while still providing a valuable cohesive experience with the rest of their products. And considering how Apple prices things usually, those glasses would cost 1k minimum, which I s way more costly than anything else on the market. Especially with how lackluster the AVP sold, it's likely they're just going to wait until they absolutely have to (ie when the shareholders want them to) to create a pair of smart glasses. The tech is here already, but the market for these glasses is still too niche, it needs to mature a bit more to justify the effort and investment, otherwise they might have another AVP on their hands",
                              "score": 1,
                              "created_utc": 1738682368.0,
                              "replies": [
                                {
                                  "id": "maz8dvi",
                                  "author": "simpliflyed",
                                  "body": "Just because others *can* do it, doesn’t mean they should. \nFirst to market and all that…",
                                  "score": 1,
                                  "created_utc": 1738698669.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "maalfv8",
              "author": "swng",
              "body": "How feasible would it be to jailbreak the hardware and have it send data to... some non facebook server... and somehow still have a useful experience",
              "score": 6,
              "created_utc": 1738369568.0,
              "replies": [
                {
                  "id": "mabrdfl",
                  "author": "Starfox-sf",
                  "body": "You assume it can be jailbroken or rooted.",
                  "score": -2,
                  "created_utc": 1738384776.0,
                  "replies": [
                    {
                      "id": "mad2shf",
                      "author": "swng",
                      "body": "no I was asking how feasible it would be to jailbreak",
                      "score": 10,
                      "created_utc": 1738410820.0,
                      "replies": [
                        {
                          "id": "mah4701",
                          "author": "Starfox-sf",
                          "body": "Because in order to do what you want you would most likely need to find a bootloader exploit or manage to get the vendor-specific Firehose file and get it to boot into EDL (or similar for non-Qualcomm chipset), disable secure boot and AVB, then modify the system partition to “talk” to whatever is needed by reverse-engineering the protocol and then set up a server to respond with same protocol.\n\nAt best it’s going to be a huge headache for something that very few would use, and at worst you got yourself a bricked device.",
                          "score": 7,
                          "created_utc": 1738458741.0,
                          "replies": [
                            {
                              "id": "mahaf5f",
                              "author": "swng",
                              "body": "Thanks for the details",
                              "score": 2,
                              "created_utc": 1738460865.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "madcqe9",
                          "author": "ThrowawayAcc1337",
                          "body": "***no*, repeats the thing**",
                          "score": -8,
                          "created_utc": 1738415598.0,
                          "replies": [
                            {
                              "id": "madeev3",
                              "author": "swng",
                              "body": "I asked how feasible it would be to jailbreak\n\nperson gives a snarky comment saying that im assuming it can be jailbroken\n\nit was a question on whether it was possible not an assertion that it was possible",
                              "score": 6,
                              "created_utc": 1738416303.0,
                              "replies": [
                                {
                                  "id": "madf35n",
                                  "author": "ThrowawayAcc1337",
                                  "body": "it was a pretty obvious statement that it can't be, in case you're having trouble with reading comprehension",
                                  "score": -9,
                                  "created_utc": 1738416579.0,
                                  "replies": [
                                    {
                                      "id": "madffxm",
                                      "author": "swng",
                                      "body": "no it was an assertion that I repeated the thing but it was instead a clarification that it was a question and not an assertion",
                                      "score": 4,
                                      "created_utc": 1738416723.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mae0r1s",
                      "author": "Firewasp987",
                      "body": "I feel like everything can be jailbroken at some point",
                      "score": 2,
                      "created_utc": 1738424243.0,
                      "replies": [
                        {
                          "id": "mak3fad",
                          "author": "Starfox-sf",
                          "body": "It used to be but with stuff like Secure Boot, AVB (Android)/SSV (iOS), unlockable bootloader (VZW I’m looking at you), Certificate Pinning, eFuse (Samsung Knox)…",
                          "score": 1,
                          "created_utc": 1738506819.0,
                          "replies": [
                            {
                              "id": "maljcco",
                              "author": "Firewasp987",
                              "body": "I don’t know about the rest but iOS i think is up to iOS 18.3 that can be jailbroken on some devices.",
                              "score": 1,
                              "created_utc": 1738521846.0,
                              "replies": [
                                {
                                  "id": "maljx6t",
                                  "author": "Starfox-sf",
                                  "body": "16.6.1. There has been no publicly released jailbreak since then. You can run certain 3rd party mod on 17.0+ but it cannot affect Springboard.",
                                  "score": 1,
                                  "created_utc": 1738522001.0,
                                  "replies": [
                                    {
                                      "id": "malndxg",
                                      "author": "Firewasp987",
                                      "body": "Oh you right, it was iPados that was 18 on some devices.",
                                      "score": 1,
                                      "created_utc": 1738522940.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "macry9k",
              "author": "Nagemasu",
              "body": "Honestly if google glass wasn't met with such backlash from the public we might already be at a point where we could have a functionally good pair of glasses available to the public.",
              "score": 6,
              "created_utc": 1738404446.0,
              "replies": [
                {
                  "id": "madcimg",
                  "author": "divDevGuy",
                  "body": "Don't kid yourself. Google would have randomly killed the project with no warning out of the blue just because. [It's the Google way](https://killedbygoogle.com/).\n\nI'm kind of impressed that Chrome, Gmail, and Android have all lasted as long as they have.",
                  "score": 14,
                  "created_utc": 1738415506.0,
                  "replies": [
                    {
                      "id": "mahhm10",
                      "author": "Nagemasu",
                      "body": "Google kills a lot, but they also keep projects that benefit them with data, of which google glasses would. Pixel still exists.   \nEven then, Google killing it voluntarily rather than due to public backlash forcing non-viability would have been better, because other businesses might have seen it as a viable option to pick up.",
                      "score": 2,
                      "created_utc": 1738463309.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mab7v6q",
              "author": "TheDarkRider",
              "body": "Probably will just say Zuckerberg is cool .",
              "score": 3,
              "created_utc": 1738377257.0,
              "replies": []
            },
            {
              "id": "maa8phc",
              "author": "Public-Restaurant968",
              "body": "I think Mark’s recent pivot is going to doom his glasses.",
              "score": 13,
              "created_utc": 1738365441.0,
              "replies": [
                {
                  "id": "maatw8z",
                  "author": "KingNebyula",
                  "body": "Wouldn’t his pivot do the opposite?",
                  "score": -8,
                  "created_utc": 1738372394.0,
                  "replies": [
                    {
                      "id": "maaxft7",
                      "author": "Public-Restaurant968",
                      "body": "The demographic that it was being marketed to (at least from the ads) doesn’t seem like the Joe Rogan or Theo Von James crowd.",
                      "score": 18,
                      "created_utc": 1738373611.0,
                      "replies": [
                        {
                          "id": "mab7gan",
                          "author": "GBJI",
                          "body": "They have a hard time telling the difference between left and wrong. They're not ready for VR.",
                          "score": 2,
                          "created_utc": 1738377112.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "maazxdc",
              "author": "Shapes_in_Clouds",
              "body": "It's certainly cool, but is it actually useful?  The whole demo, while the technology is certainly amazing, mostly made me realize how little value such glasses would provide compared to the smart phones we already have today, but at probably far higher cost.  \n\n70 degree FOV is extremely limiting, the content is transparent, so videos will be see through, and the other apps were an incredibly boring looking pong game, and AI vision to make a smoothie.  Why do I want this over my smartphone which today already offers a beautiful full color high res OLED display and is or will be capable of all the same things?\n\nI still feel like the conceptual ideal of true AR glasses is so far away from technologically possible, and even then it's not obvious why I'd rather wear a HUD than just look at my phone.  \n\nStill feel immersive VR is the better technology as at least its immersive qualities offer truly unique experiences.",
              "score": 3,
              "created_utc": 1738374474.0,
              "replies": [
                {
                  "id": "mabtwk3",
                  "author": "DarthBuzzard",
                  "body": "As much as I appreciate someone understanding the serious limitations of optical AR and how passthrough AR+VR are going to remain far more immersive, at the end of the day it's still a hologram projector. Your phone can't do that, so that will be incredibly useful, though it really will need to scale up from 70 degrees.",
                  "score": 11,
                  "created_utc": 1738385881.0,
                  "replies": []
                },
                {
                  "id": "mac67hj",
                  "author": "azlan194",
                  "body": "Remember that concept video that Google made for their Google Glass (RIP), that would be amazing if, in the future, the AR glass can do things like that.",
                  "score": 4,
                  "created_utc": 1738391873.0,
                  "replies": []
                },
                {
                  "id": "macmc37",
                  "author": "Athen65",
                  "body": "Increibly useful - at least, once the technology is truly there. Anybody who has needed more than a single screen while using a laptop knows this, and that will be the primary use case for that type of device.  The secondary use case will be a mobile 80 inch TV, and the tertiary usecase will be handheld gaming on that same screen that happens to be with you everywhere you go. \n\nVR offers awesome gaming experiences, and I personally believe this market is the most untapped (particularly third-person perspective, seated games), but it is not the future of XR.",
                  "score": 2,
                  "created_utc": 1738401075.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "maav5vg",
              "author": "Wolfram_And_Hart",
              "body": "The problem is that Meta wants to control what you see. How can you trust them with their track record?",
              "score": 2,
              "created_utc": 1738372829.0,
              "replies": [
                {
                  "id": "mab1igj",
                  "author": "YouMeltMyCheeseHeart",
                  "body": "Agree. But people still jumped on Threads like Facebook, and Instagram haven’t both been enshitified.",
                  "score": 4,
                  "created_utc": 1738375024.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mao0z5z",
              "author": "DEATHbyBOOGABOOGA",
              "body": "Fuck Meta",
              "score": 1,
              "created_utc": 1738549027.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mabsk1k",
          "author": "mythrocks",
          "body": "![gif](giphy|z9g6xLr5C0H1m)",
          "score": 13,
          "created_utc": 1738385286.0,
          "replies": [
            {
              "id": "mahpl6f",
              "author": "ToxicBTCMaximalist",
              "body": "#FABULOUS",
              "score": 2,
              "created_utc": 1738466042.0,
              "replies": []
            }
          ]
        },
        {
          "id": "maampgy",
          "author": "VariantComputers",
          "body": "That exists. LTT did a review on some and they are under $700 I think. I'll see if I can find the name of them.\n\nEdit: It's the Even Realities G1. \n\nhttps://youtu.be/bckifBIPlHI",
          "score": 22,
          "created_utc": 1738369984.0,
          "replies": []
        },
        {
          "id": "ma9sakd",
          "author": "Sirisian",
          "body": "Will be waiting for MicroLED to enter mainstream production then which could be quite a ways off. A lot of these MR glasses concepts hinge on either that technology or some other advanced display tech. If you missed this: https://www.uploadvr.com/apple-still-working-on-microled-displays-for-ar-glasses/ It includes some predictions that put this well over 3 years away from commercialization.",
          "score": 11,
          "created_utc": 1738360485.0,
          "replies": []
        },
        {
          "id": "mae0fbk",
          "author": "iamnotcreativeDET",
          "body": "As a glasses wearer. \n\nAll I want to do is NOT wear glasses, I don’t need anything else to attach to my body.",
          "score": 6,
          "created_utc": 1738424139.0,
          "replies": []
        },
        {
          "id": "mabmg5u",
          "author": "maledivianer",
          "body": "Hey this is not an ad and I’m not related to them but maybe you should check out glasses from even realities. It’s still in the beginning but permanently having a kind of head up display inside ur discreet looking glasses is awesome!",
          "score": 4,
          "created_utc": 1738382712.0,
          "replies": []
        },
        {
          "id": "mack3qo",
          "author": "ventodivino",
          "body": "Isn’t this what google glass did? And the world was outraged.",
          "score": 3,
          "created_utc": 1738399751.0,
          "replies": []
        },
        {
          "id": "madddo7",
          "author": "HurricanesFan",
          "body": "I want glasses with subtitles",
          "score": 3,
          "created_utc": 1738415870.0,
          "replies": []
        },
        {
          "id": "mac8nvj",
          "author": "_Lucille_",
          "body": "Having Google map integrated into glasses can be nice so we no longer need to turn our head while driving or hold our phone while walking.\n\nI can even see it as a visual aid for driving at night where the glasses enhance worn out lines on the road.",
          "score": 2,
          "created_utc": 1738393206.0,
          "replies": [
            {
              "id": "mae225f",
              "author": "CarltonSagot",
              "body": "The Speedometer HUDS on car windscreens are absurdly useful. Not having to move your eyes that small amount is weirdly helpful, so I could only imagine how much it would help to be able to see arrows or lines if they could figure that out.",
              "score": 2,
              "created_utc": 1738424654.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mae09n9",
          "author": "Riversntallbuildings",
          "body": "Then keep researching advanced battery technologies, and/or wireless power solutions.\n\nI’m a sci-fi nut, and I love the genre completely. But for both Terminator, and the Sentinels in the X-Men comics, I can’t divorce myself from the portable power issue. \n\nWe are no where near having portable power density for high speed robots, or small lightweight glasses that are comfortable to wear on the bridge of your nose & ears. \n\nSki goggle AR headsets and slow speed robots that recharge every 2-4 hours…sure? But not what SciFi says we should have in 2025.\n\nIf you believe in geopolitical influences, any individual, corporation, or country that is interested in Oil, is not allocating many resources to battery development.\n\nLuckily, economics, and pure supply & demand pressures, are paving the way forward.",
          "score": 2,
          "created_utc": 1738424088.0,
          "replies": [
            {
              "id": "maf4aqn",
              "author": "No-Guess-4644",
              "body": "You can have the processing power in your pocket. Your phone.\n\nLook at project orion.",
              "score": 1,
              "created_utc": 1738436071.0,
              "replies": [
                {
                  "id": "mah1e90",
                  "author": "Riversntallbuildings",
                  "body": "It’s not the CPU that takes all the energy…it’s the display. There is no “low power” display that can give us bright enough pixels in that form factor. Especially during broad daylight. \n\nLook up how much power a “heads up display” draws in a BMW.",
                  "score": 1,
                  "created_utc": 1738457815.0,
                  "replies": [
                    {
                      "id": "mah4m22",
                      "author": "No-Guess-4644",
                      "body": "Waveguide displays.",
                      "score": 1,
                      "created_utc": 1738458884.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mag6hcc",
          "author": "brownsquare",
          "body": "They exist, I have them. Even Realities is the brand. $600",
          "score": 2,
          "created_utc": 1738447832.0,
          "replies": [
            {
              "id": "maglggu",
              "author": "ChafterMies",
              "body": "These are pretty cool, gives me hope for the future.",
              "score": 1,
              "created_utc": 1738452646.0,
              "replies": []
            }
          ]
        },
        {
          "id": "majw0af",
          "author": "None",
          "body": "i just want a pair of glasses that can see thru clothing… it’s such simple request.",
          "score": 2,
          "created_utc": 1738504122.0,
          "replies": [
            {
              "id": "mak010h",
              "author": "ChafterMies",
              "body": "Be careful what you wish for.",
              "score": 2,
              "created_utc": 1738505627.0,
              "replies": []
            }
          ]
        },
        {
          "id": "maaa5rj",
          "author": "voodoolintman",
          "body": "The words printing out in his eyes always cracks me up. Second only to those giant Radio Shack buttons on Darth Vader's chest for absurd sci-fi hilarity.",
          "score": 3,
          "created_utc": 1738365902.0,
          "replies": []
        },
        {
          "id": "maakdo4",
          "author": "McGlockenshire",
          "body": "Can't wait to write 6502 assembly in AR",
          "score": 1,
          "created_utc": 1738369222.0,
          "replies": []
        },
        {
          "id": "mabhy1t",
          "author": "leftiesrepresent",
          "body": "Too bad they wanna sell you stuff you get served ads and like it",
          "score": 1,
          "created_utc": 1738380944.0,
          "replies": []
        },
        {
          "id": "mabiqei",
          "author": "Seagoingnote",
          "body": "I’m getting lasik in about a week but I’d probably still wear a pair of glasses if they made them do that",
          "score": 1,
          "created_utc": 1738381244.0,
          "replies": []
        },
        {
          "id": "mac76h7",
          "author": "speculatrix",
          "body": "Intel had such a system.  They closed the project and sold off the patents \n\nhttps://www.theverge.com/2018/2/5/16966530/intel-vaunt-smart-glasses-announced-ar-video\n\nhttps://mixed-news.com/en/project-vaunt-intel-manager-explains-data-glasses-exit/",
          "score": 1,
          "created_utc": 1738392395.0,
          "replies": []
        },
        {
          "id": "madhsas",
          "author": "mycall",
          "body": "> Target 50 feet 30 deg left.  \n> Ammo 9mm 1000 rounds remaining.\n\n> Target accquired, weapons ready.",
          "score": 1,
          "created_utc": 1738417643.0,
          "replies": []
        },
        {
          "id": "maerood",
          "author": "chronocapybara",
          "body": "Everybody wanted that, and expected that in Google Glass fifteen years ago. All we got was a Google search box on our face. True AR is really hard to do, since anything printed/projectes on the glasses should be blurry to your vision.",
          "score": 1,
          "created_utc": 1738432350.0,
          "replies": []
        },
        {
          "id": "mafc0nl",
          "author": "bts",
          "body": "And the best part for Apple is that was done with a 1980s Mac and ResEdit. ",
          "score": 1,
          "created_utc": 1738438388.0,
          "replies": []
        },
        {
          "id": "mafwme1",
          "author": "MangaInBed",
          "body": "How about Simon Nelson Cooke from Ned’s declassified?",
          "score": 1,
          "created_utc": 1738444747.0,
          "replies": [
            {
              "id": "mafxmpi",
              "author": "ChafterMies",
              "body": "If I knew what that was.",
              "score": 1,
              "created_utc": 1738445063.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mag3rnw",
          "author": "fmaz008",
          "body": "Just to be clear, was it what the Terminator sees in the 1984 movie \"The Terminator\" from the Terminator franchise?",
          "score": 1,
          "created_utc": 1738446977.0,
          "replies": [
            {
              "id": "magllav",
              "author": "ChafterMies",
              "body": "yup",
              "score": 1,
              "created_utc": 1738452690.0,
              "replies": []
            }
          ]
        },
        {
          "id": "magsngv",
          "author": "asicarii",
          "body": "“Assessment: Waste of your time”\n\n“Assessment: Too far on the crazy/hot scale, run away”\n\n“Assessment: pregnant; abort mission”\n\nThat would be incredibly helpful.",
          "score": 1,
          "created_utc": 1738455009.0,
          "replies": []
        },
        {
          "id": "maiav2a",
          "author": "TheGottVater",
          "body": "That run on sentence sure took a term",
          "score": 1,
          "created_utc": 1738474281.0,
          "replies": []
        },
        {
          "id": "majrfj5",
          "author": "None",
          "body": "As a person who should wear glasses but doesn’t half of the time, I just wish for glasses that could filter out the frame of the glasses.",
          "score": 1,
          "created_utc": 1738502281.0,
          "replies": [
            {
              "id": "majzxh8",
              "author": "ChafterMies",
              "body": "You want rimless glasses. They are much less distracting.",
              "score": 1,
              "created_utc": 1738505592.0,
              "replies": []
            }
          ]
        },
        {
          "id": "majwwhq",
          "author": "otra_persona",
          "body": "Sarah Connor detector?",
          "score": 1,
          "created_utc": 1738504464.0,
          "replies": []
        },
        {
          "id": "mamtqj0",
          "author": "crazyloomis",
          "body": "Yes, do this",
          "score": 1,
          "created_utc": 1738535172.0,
          "replies": []
        },
        {
          "id": "maou1e2",
          "author": "zander512",
          "body": "Pog",
          "score": 1,
          "created_utc": 1738559484.0,
          "replies": []
        },
        {
          "id": "maauvnt",
          "author": "internalogic",
          "body": "Check out activelook.net",
          "score": 0,
          "created_utc": 1738372731.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma9knoh",
      "author": "piscian19",
      "body": "I keep rereading the article, but I can't find what was lost.",
      "score": 263,
      "created_utc": 1738358301.0,
      "replies": [
        {
          "id": "ma9p74s",
          "author": "scarabflyflyfly",
          "body": "This has nothing to do with the Vision Pro—it’s about an idea for a product that would’ve connected to a Mac, but Apple decided not to explore any further. \n\nIt’s a clickbait article about a concept for a product which now won’t be made. Saved you a click.",
          "score": 303,
          "created_utc": 1738359594.0,
          "replies": [
            {
              "id": "ma9qw12",
              "author": "PeaceBull",
              "body": "Even sillier is articles came out a year ago saying it was cancelled, then recently they wrote it actually wasn't cancelled, and now they're getting to write that it was cancelled again. \n\nSo if my math checks out a product, that never existed, got 3 cycles of press...",
              "score": 45,
              "created_utc": 1738360079.0,
              "replies": [
                {
                  "id": "ma9zhay",
                  "author": "VitaminPb",
                  "body": "Can you say Project Titan, boys and girls?",
                  "score": -1,
                  "created_utc": 1738362604.0,
                  "replies": [
                    {
                      "id": "mabdtza",
                      "author": "rtb001",
                      "body": "Project Titan definitely existed and supposedly cost Apple 10 Billion USD over the decade or so they spent working on it. It's on a whole other level to whatever dinky rink little project this glasses thing was.",
                      "score": 3,
                      "created_utc": 1738379404.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "madi2m7",
              "author": "mycall",
              "body": "> Apple decided not to explore any further.\n\nUnlikely due to Apple running out of money.",
              "score": 2,
              "created_utc": 1738417755.0,
              "replies": []
            },
            {
              "id": "maf8fll",
              "author": "Immediate_Twist_3088",
              "body": "Love when redditors do this, thank you!",
              "score": 2,
              "created_utc": 1738437311.0,
              "replies": []
            },
            {
              "id": "ma9ylr6",
              "author": "andynator1000",
              "body": "What exactly is clickbait about the article?",
              "score": 1,
              "created_utc": 1738362342.0,
              "replies": [
                {
                  "id": "maa8yd1",
                  "author": "scarabflyflyfly",
                  "body": "Start with the headline: “Apple reportedly gives up on its AR video glasses project”—which virtually anyone would think meant the Vision Pro. I follow Apple news,and that is the only AR video glasses project I’ve ever heard about.\n\nPersonally, I think it would’ve been much more intriguing if the headline had been “Apple reportedly gives up on previously unannounced AR glasses project”— or, even better, “Apple cancels mystery AR glasses”. This could’ve led them to speculate on what Apple might’ve done with a product like that.\n\nInstead, the whole article is about how Apple’s AR glasses product is dead. Besides mentioning it would depend on a Mac, it makes no attempt to distinguish between the subject of the article and the Vision Pro – it doesn’t even mention Apple’s Vision Pro, at least not at the time I’d read it.\n\nThere are a ton of clicks to be captured from the Vision Pro haters, who would delight for days over the news and forward it to their friends. Given not just the low context in the article but the deliberate lack of any reference to its most obvious and only comparison, this is a clickbait article deliberately designed to confuse readers generally and to satiate Vision Pro haters specifically.",
                  "score": 6,
                  "created_utc": 1738365519.0,
                  "replies": [
                    {
                      "id": "mab4936",
                      "author": "andynator1000",
                      "body": "If it meant Apple Vision Pro it would have said Apple Vision Pro. The glasses are a separate product they have been working on for the better part of a decade.\n\nI like how you were ignorant of the Apple glasses project and decided to double down by blaming the author.",
                      "score": 2,
                      "created_utc": 1738375983.0,
                      "replies": [
                        {
                          "id": "mac6vwj",
                          "author": "scarabflyflyfly",
                          "body": "The closest thing to decent AR glasses came from Meta, and they cost $10K each simply to make prototypes; not for sale. We’re at least 3 years from the glasses that will sit on a museum exhibit in 2050 as the first good product of its kind.\n\nTo say an unsubstantiated rumor about a product no one in the general public was expecting “casts doubt over Apple’s future AR plans” is absurdly clickbait. \n\nAll the more embarrassing for the writer to have offered no context for the average reader.",
                          "score": 2,
                          "created_utc": 1738392236.0,
                          "replies": [
                            {
                              "id": "maen888",
                              "author": "aquasemite",
                              "body": "Exactly this. AR glasses are one of the most difficult things to create. Take all the processing of a phone, add two one-million nit projectors, get it all down to 50 grams. We’re not there yet.",
                              "score": 3,
                              "created_utc": 1738431027.0,
                              "replies": [
                                {
                                  "id": "maf6ryx",
                                  "author": "scarabflyflyfly",
                                  "body": "Adding to that: the most expensive component of the Meta prototype are the lenses themselves. This aligns with industry reports of the first factory to be able to produce such materials at scale is still three years from production.\n\nWhich of course also means that any distinction between goggles versus glasses versus headset is absurd in the meantime. Call them what you will, they will be opaque screens over your eyes for the time being. Making it a Mac accessory will only get the price down so much, and likely only serve to confuse the market. \n\nAdd in that the number of those they could sell would be a rounding error relative to Apple’s other product categories, and that an always-tethered headset would actually reduce the perception of the product at large, and it’s way better for Apple to spend its calories on the product they’ll ship in 2-3 years.",
                                  "score": 2,
                                  "created_utc": 1738436818.0,
                                  "replies": [
                                    {
                                      "id": "magh5p0",
                                      "author": "aquasemite",
                                      "body": "Correct.  Technically the silicon-carbide \"waveguides\" are the expensive part.",
                                      "score": 2,
                                      "created_utc": 1738451245.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mabfuzi",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 3,
                          "created_utc": 1738380160.0,
                          "replies": [
                            {
                              "id": "mac8hhv",
                              "author": "scarabflyflyfly",
                              "body": "The average reader will see an article about Apple killing an AR glasses project and assume it refers to some follow up to the Vision Pro, criticized for being unmarketably clunky. And what was the article’s subhead?\n\n“The latest cancellation casts doubt over Apple’s future AR plans.”\n\nKind of ties a big bow around everything spatial and headset and virtual and AR. Could hardly be more well designed to discourage developers from making the investment in their time with Apple’s spatial stuff.",
                              "score": 4,
                              "created_utc": 1738393108.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "maa0mjb",
          "author": "RemarkableLook5485",
          "body": "you need the glasses to see\nthat detail but firmware is being held back by department funding",
          "score": 2,
          "created_utc": 1738362948.0,
          "replies": []
        },
        {
          "id": "madq6c8",
          "author": "thisischemistry",
          "body": "> Bloomberg reporter Mark Gurman says\n\nSo, this is just rumor and speculation to generate views. Call me when actual news happens.",
          "score": 2,
          "created_utc": 1738420708.0,
          "replies": []
        },
        {
          "id": "mafxhvs",
          "author": "umbananas",
          "body": "It’s rumored that Apple was working on an AR glasses. Rumored Apple projects get cancelled all the time.",
          "score": 1,
          "created_utc": 1738445020.0,
          "replies": []
        },
        {
          "id": "maajavq",
          "author": "Castle-dev",
          "body": "Nothing of value",
          "score": 0,
          "created_utc": 1738368868.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma9siw9",
      "author": "CauliflowerMinimum44",
      "body": "As a tech company who invests tens of billions of dollars annually in R&D, I imagine there’s many products Apple develops and abandons without public knowledge. \n\nI also bet there’s valuable lessons gained in the abandoned projects. ",
      "score": 132,
      "created_utc": 1738360552.0,
      "replies": [
        {
          "id": "mab4mxe",
          "author": "JamesHeckfield",
          "body": "Like: making cars is not fucking worth the hassle and risk. ",
          "score": 33,
          "created_utc": 1738376120.0,
          "replies": [
            {
              "id": "mabe84q",
              "author": "rtb001",
              "body": "Tell that to Xiaomi, who build an EV in just 3 years and at a tenth of the cost Apple plowed into its Project Titan, and is now selling like hotcakes as the hottest car launch of 2024.",
              "score": 22,
              "created_utc": 1738379550.0,
              "replies": [
                {
                  "id": "mabw0h3",
                  "author": "NextWhiteDeath",
                  "body": "Chinese companies live in a very diffrent system compared to Western competitors. Some of the M&A and R&D seen in China would never happen in US/EU. Especially as the conglomerate idea has fallen heavily out of fashion.",
                  "score": 12,
                  "created_utc": 1738386833.0,
                  "replies": [
                    {
                      "id": "maclse5",
                      "author": "rtb001",
                      "body": "While that might be true for some of the EV big boys in China like BYD and Geely, and conglomerates trying to get into the field like Xiaomi and Huawei (also very successful in their EV endeavors), the underlying reason between why Xiaomi could build an EV so quickly and Apple could not lies in the fact that China as a nation, had spent at least 15 years investing tremendous resources in building up their entire EV value chain industry, resulting in a critical mass of technology, supply chain, and manufacturing knowhow which will allow for anyone to more easily get into the EV game.\n\nMight be easier for big companies like Xiaomi and Huawei, but there are some very successful EV startups in China which basically started from nothing. Li Auto and Nio were founded by guys who started out running auto enthusiast websites. He Xiaopeng, who founded Xpeng, started out by creating a mobile internet browser before selling it to Alibaba and taking his money to found an EV company. The founder of Leapmotor first founded another company called Dahua, a video surveillance/security camera company.\n\nDid these people have the expertise of someone like Lucid founder Peter Rawlinson, who was literally the chief engineer behind the Tesla Model S before forming his own EV company? Of course not, yet all their startups rapidly scaled production past the US EV startups because unlike Rivian and Lucid, all those Chinese startups had access to that critical mass of EV supply chain and expertise which only exists in China, so they could get their companies off the ground far quicker.\n\nThen later one when the big boys like Huawei and Xiaomi came along and also wanted to enter the game, well they've got even deeper pockets and could scale even faster than those earlier startups, with Xiaomi being the fastest of them all.",
                      "score": 10,
                      "created_utc": 1738400748.0,
                      "replies": [
                        {
                          "id": "mamyrm4",
                          "author": "thinvanilla",
                          "body": "Why are you writing this as if you're arguing against both the commenters even though you clearly agree with that they're saying?",
                          "score": 1,
                          "created_utc": 1738536701.0,
                          "replies": [
                            {
                              "id": "maoqafr",
                              "author": "rtb001",
                              "body": "I don't think I am. The comment I replied to argued that Chinese advances in EVs is a result of big conglomerates getting into the game. \n\nMy argument is that it was Chinese government support over many years to build out the most advanced and comprehensive EV value chain that is most responsible for how they got ahead on EVs. Because that value chain allows anyone to potentially quickly build an EV startup. Yes it is easier for a conglomerate like Xiaomi, but pure startups like Li Auto or Xpeng have also succeeded. \n\nThe corollary to my argument is also that it isn't a single company that can allow the west to catch back up to the Chinese in the EV sector,  because that is not the main reason they are ahead. To catch up,  you'd have recreate a comparable EV value chain outside of China, one which China had spent the better part of 2 decades building up,  which is nigh impossible at this point.",
                              "score": 1,
                              "created_utc": 1738557955.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mao1ibm",
                      "author": "BasicFootwear",
                      "body": "Dude China is the place to be if you want electric, they have some of the coolest and straight up best EVs for a fraction of what you’d pay for them over in the west. They are so expensive and still a pipe dream for so many",
                      "score": 1,
                      "created_utc": 1738549202.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mac2onf",
                  "author": "JamesHeckfield",
                  "body": "The devil is in the details. \n\nYou’re talking about a goddamn Chinese company. \n\nChina is a totalitarian state.  \n\nThings are different there. \n\nApple is not a stupid company. If they decide not to make cars, it’s for a good damn reason. They don’t care what xiaomi is doing.\n\nThey are too busy making money hand over fist.",
                  "score": -10,
                  "created_utc": 1738390044.0,
                  "replies": [
                    {
                      "id": "macjmqu",
                      "author": "rtb001",
                      "body": "I don't know what China being a totalitarian state have to do with building EVs, but you are correct that things are different there. The difference is that the center of EV technology, manufacturing, and adoption lies squarely in China, which is why Tesla aside (and Tesla really only hit their stride after opening up their massive Chinese factory which builds almost half of all EVs they make), American EV startups are either struggling while burning cash (Rivian, Lucid) or are just DOA (Canoo, Aptera, Nicola etc).\n\nApple is too busy making money hand over fist so they don't have to worry about what their competitors are doing? I seem to remember a little company called Intel that DOMINATED its field for DECADES making money hand over fist, safe in the knowledge that upstarts like nVidia, TSMC, or even AMD would never catch up. And look at them now.\n\nBut I will agree that Apple is not a stupid company, and there is a good damn reason they gave up on their EV project, even if the TEN BILLION bucks they put into it represented a tremendous \"sunk  cost\". The reason itself is quite simple, really. Apple eventually realized that they simply do not have access to the designers, supply chain, and manufacturing expertise to build something as complicated as a car (even if EVs are relatively simpler to produce than ICE cars) in any sort of volume that will allow them to make a profit. Because they are in Cupertino, and thousands of miles away from the expertise needed to build electric cars. They the billions of Saudi cash Lucid has been burning for 15 years trying to keep their car business afloat in the US, and realized the odds are against them.\n\nXiaomi, on the other hand, is located in Beijing, and could just walk out their front door, put up an ad, and instantly be able to hire whoever they wanted to design their car, source parts and batteries for their car, build and manage a new factory to manufacture that car, and then just throw some of their own software engineers on the project to put their HyperOS software on it, and bam there's a car they can instantly scale into mass production.\n\nThe gulf between how quickly (and how costly) you can get an EV company off the ground in the US versus China is ridiculously wide. Rivian was founded in 2009, and Lucid even earlier in 2007, and now in 2025, I'm not certain that both of these companies COMBINED have managed to produce 200,000 cars in all these year so of operation. \n\nXiaomi started their car project in 2021, reputedly spent 3 years and 1 billion USD on it, launched their first car the SU7 in March 2024, and as of January 2025 have already built and sold 150,000 cars. [Goldman Sachs](https://cnevpost.com/2025/01/15/goldman-sachs-sales-forecast-xiaomi-ev/) is projecting that Xiaomi will raise their production to 350,000 in 2025, and as many as 650,000 in 2026, allowing Xiaomi's EV unit to possibly turn a profit by 2026.\n\nRivian and Lucid cannot hope to compete with that, and neither could Apple. And since cars are not Apple's core business anyway, they got the hell out there despite dropping 10 billion on the project. Apple understood that more likely than not, the EV race has already been won by the Chinese.",
                      "score": 5,
                      "created_utc": 1738399471.0,
                      "replies": [
                        {
                          "id": "madtut0",
                          "author": "GhostofStalingrad",
                          "body": ">I don't know what China being a totalitarian state have to do with building EVs\n\n\nDude seriously? ",
                          "score": 0,
                          "created_utc": 1738421975.0,
                          "replies": []
                        },
                        {
                          "id": "madouhv",
                          "author": "JamesHeckfield",
                          "body": "Hey I just wanted to say I’m not reading any of that. \n\nIf you can’t figure out why circumstances are significantly different in America and china, that’s on you. \n\nThe Chinese, as a country, have no scruples. ",
                          "score": -2,
                          "created_utc": 1738420244.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mabr3hj",
          "author": "OmgitsNatalie",
          "body": "Companies come up with ridiculous ideas then patent them to save them for a rainy day in case the actual technology catches up. So yes, they make plenty of them and never go through with most of it. It’s like when I hoarded obscure Yugioh cards thinking they were going to be valuable one day.",
          "score": 3,
          "created_utc": 1738384656.0,
          "replies": []
        },
        {
          "id": "mac6uvn",
          "author": "Shadowhawk109",
          "body": "Microsoft has a huge R&D department that never sees the light of day.\n\nThey work with major universities a *lot* with that stuff. Some of it lead to the Kinect and skeleton-tracking at home.",
          "score": 2,
          "created_utc": 1738392220.0,
          "replies": []
        },
        {
          "id": "mag1578",
          "author": "ygg_studios",
          "body": "yeah but apple spent billions marketing a product nobody wants, which is a catastrophe for them",
          "score": 1,
          "created_utc": 1738446160.0,
          "replies": []
        },
        {
          "id": "mahpgwp",
          "author": "YJeezy",
          "body": "That they can't innovate without tech Jesus Steve Jobs",
          "score": 1,
          "created_utc": 1738465999.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mabcgz5",
      "author": "weaselmaster",
      "body": "“Reportedly”— meaning they have no idea, other than an article posted by a financial firm trying to ‘move the market’ with their ‘reporting’.",
      "score": 10,
      "created_utc": 1738378906.0,
      "replies": []
    },
    {
      "id": "mahi0to",
      "author": "Potential_Ad_420_",
      "body": "Another bot account who could’ve guessed",
      "score": 8,
      "created_utc": 1738463450.0,
      "replies": [
        {
          "id": "maksl64",
          "author": "gnew18",
          "body": "If you are a bot you have to tell me…",
          "score": 1,
          "created_utc": 1738514541.0,
          "replies": [
            {
              "id": "mallfry",
              "author": "Potential_Ad_420_",
              "body": "Exactly what a bot would say.",
              "score": 1,
              "created_utc": 1738522412.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mabsu3q",
      "author": "RapBastardz",
      "body": "Sorry guys, no one wants a giant pair of goggles strapped to their face for the low low price of $5000.",
      "score": 17,
      "created_utc": 1738385408.0,
      "replies": [
        {
          "id": "makd9qa",
          "author": "evoactivity",
          "body": "That’s not what this was.",
          "score": 2,
          "created_utc": 1738510038.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma9lnpy",
      "author": "Suspicious_Buffalo38",
      "body": "Noone is going to be able to afford any apple products soon.",
      "score": 18,
      "created_utc": 1738358585.0,
      "replies": [
        {
          "id": "mabbkbg",
          "author": "Knot_In_My_Butt",
          "body": "That’s why they also partnered with Schwab to offer a credit card with payment options and cash back incentives!",
          "score": 6,
          "created_utc": 1738378579.0,
          "replies": []
        }
      ]
    },
    {
      "id": "maac4gc",
      "author": "LovableSidekick",
      "body": "The focus group must have balked at the $45,000 price tag.",
      "score": 7,
      "created_utc": 1738366535.0,
      "replies": []
    },
    {
      "id": "maatoba",
      "author": "WardenEdgewise",
      "body": "Oh well. I’m waiting for 3D television to become a reality. One day they will have 3D glasses for the TV in your home, and it will look just like Avatar, but at home. Just wait, I bet you it will really take off!  MMW!",
      "score": 8,
      "created_utc": 1738372319.0,
      "replies": []
    },
    {
      "id": "mad4xe2",
      "author": "Jaszuni",
      "body": "Yeah, the solution has to be lightweight. I'm not sure why they feel they had to start with vision.\n\nLocation data, small cameras, a body sensor, and an earpiece and AI can tell someone a lot about their environment.\n\n“Tell me about this [object] I’m looking at”  \n“Find all the information you can about this [noun] and compile a report and send it to my phone”  \n“Listen and observe my conversation and give insight into their body language”",
      "score": 2,
      "created_utc": 1738411967.0,
      "replies": []
    },
    {
      "id": "makstzw",
      "author": "gnew18",
      "body": "All you need is a porn application and it will be developed \n-",
      "score": 2,
      "created_utc": 1738514612.0,
      "replies": []
    },
    {
      "id": "mabms8r",
      "author": "RefrigeratorWrong390",
      "body": "Apple will wait out until Meta has proven the category then try to jump back in",
      "score": 2,
      "created_utc": 1738382848.0,
      "replies": []
    },
    {
      "id": "mac5afn",
      "author": "glizard-wizard",
      "body": "apple will saw its arm off before letting its hardware use any software developed outside their extremely restrictive walled garden",
      "score": 2,
      "created_utc": 1738391384.0,
      "replies": []
    },
    {
      "id": "maaln5n",
      "author": "None",
      "body": "Here’s the thing, just make it simple like a case heads display.",
      "score": 1,
      "created_utc": 1738369634.0,
      "replies": []
    },
    {
      "id": "maat1dk",
      "author": "newellz",
      "body": "Build the tech into lenses I can put into any frames. Let’s go. We all know that that’s how this works so fucking do it.",
      "score": 1,
      "created_utc": 1738372103.0,
      "replies": []
    },
    {
      "id": "macapjh",
      "author": "WorriedCaterpillar43",
      "body": "I’d just like glasses with FindMy ….",
      "score": 1,
      "created_utc": 1738394326.0,
      "replies": []
    },
    {
      "id": "madrcrr",
      "author": "Typical80sKid",
      "body": "How about they focus on some sunglasses that have AirTags capabilities that are still sleek. I CAN’T EVER FUCKING FIND MINE!!!",
      "score": 1,
      "created_utc": 1738421119.0,
      "replies": []
    },
    {
      "id": "mae0rcs",
      "author": "Fractal_HQ",
      "body": "Pussies",
      "score": 1,
      "created_utc": 1738424246.0,
      "replies": []
    },
    {
      "id": "maet3mr",
      "author": "FlyingBishop",
      "body": "> With features that sound similar to devices like the Xreal One AR glasses, the glasses could’ve delivered on the Vision Pro feature that’s closest to being any kind of a killer app (popping up a huge virtual monitor anywhere) without the $3,499 price and heavy design that required a head strap.\n\nWe are at least 5, probably 10 or 20 years away from something like that in a glasses form factor. Apple knew this when they started designing the Vision Pro (which was basically a prototype to imagine what things will be like when they can actually build the glasses.)",
      "score": 1,
      "created_utc": 1738432775.0,
      "replies": []
    },
    {
      "id": "maf6u1o",
      "author": "Dude-e",
      "body": "For any project to work, even Apple’s, it needs to be practical AND accessible to the masses. The iPhone (especially at first) is expensive, but still affordable to a large number of people and it is a phone with solid functions. MacBook? Expensive, but the Air and Mac mini are relatively affordable and do their jobs damn well. iPad, product line is a mess, but the cheapest one is affordable and is arguably a very good tablet option for those who need one.  \n\nVision Pro? DAMN expensive. So expensive in fact that most people can’t afford it. Especially considering that it doesn’t solve any new problem that hasn’t been solved by another device. Nobody bought it because the only thing it has going for it is the novelty and the damn price. \n\nThe canceled ‘unannounced AR project’ sounded like they were focusing on fancy features and forgot affordability again. Glad they stopped working on it. Waste of resources.",
      "score": 1,
      "created_utc": 1738436834.0,
      "replies": []
    },
    {
      "id": "mafg8iw",
      "author": "pagerussell",
      "body": "Cart is in front of the horse here.\n\nThey want the glasses to happen so they make a ton of money, instead of focusing on a killer *use case*.\n\nIts been this way for....ever. VR has no wide scale killer use case. Even for gaming its a niche.",
      "score": 1,
      "created_utc": 1738439651.0,
      "replies": [
        {
          "id": "mahppe4",
          "author": "SaintBrutus",
          "body": "Vision Pro didn’t have any video games. All of the other successful VR glasses in that price range are for video games.\n\nVision Pro was for watching movies. That’s basically all it did. There was no incentive to buy it whatsoever.",
          "score": 1,
          "created_utc": 1738466084.0,
          "replies": []
        }
      ]
    },
    {
      "id": "magdicd",
      "author": "None",
      "body": "Cowards.  You  fail once and you give  up?",
      "score": 1,
      "created_utc": 1738450068.0,
      "replies": []
    },
    {
      "id": "mah14vy",
      "author": "randomlyme",
      "body": "Switching to contacts is my guess",
      "score": 1,
      "created_utc": 1738457730.0,
      "replies": []
    },
    {
      "id": "majhz09",
      "author": "Home_Assistantt",
      "body": "I’m sure smart glass will come eventually. Apple have started the ball rolling but even they can’t make it work in a sensibly priced product yet. \n\nI bet they had more returns than actual purchases",
      "score": 1,
      "created_utc": 1738497797.0,
      "replies": []
    },
    {
      "id": "majzbn0",
      "author": "UrDoinGood2",
      "body": "D.o.a like Apple vision",
      "score": 1,
      "created_utc": 1738505369.0,
      "replies": []
    },
    {
      "id": "malfoc1",
      "author": "BrooklynRobot",
      "body": "Now? when I wish my reality was augmented more than ever?",
      "score": 1,
      "created_utc": 1738520857.0,
      "replies": []
    },
    {
      "id": "maw4nuw",
      "author": "BleednHeartCapitlist",
      "body": "![gif](giphy|u5JuZlTewK5FIo47X6)\n\nEvery time I use Siri",
      "score": 1,
      "created_utc": 1738657939.0,
      "replies": []
    },
    {
      "id": "maacfxp",
      "author": "ManInTheBarrell",
      "body": "I don't see what the big deal is. I see arkansas everyday, and I don't even need video glasses. There's no reason.",
      "score": 1,
      "created_utc": 1738366638.0,
      "replies": []
    },
    {
      "id": "mace31y",
      "author": "spinosaurs70",
      "body": "Cost to much and had even less clear purpose than Meta’s products. \n\nAlso it’s an inherently small market, lots of people simply don’t want screens on there face.",
      "score": 1,
      "created_utc": 1738396245.0,
      "replies": []
    },
    {
      "id": "maiktxy",
      "author": "BugmoonGhost",
      "body": "What this is telling you is not “that apple can’t innovate”, it’s that the compromises are compromises too great.   This has a knock on to all products.   Apple needs to keep developing the Vision Pro as a pro product. Just make it the best, stop trying to make it a mass produced product.",
      "score": 1,
      "created_utc": 1738478818.0,
      "replies": []
    },
    {
      "id": "maabpey",
      "author": "JumpinJahosafax",
      "body": "This shit was never going to work. We just aren’t there yet",
      "score": 0,
      "created_utc": 1738366401.0,
      "replies": []
    },
    {
      "id": "maaymhq",
      "author": "Additional_Class5081",
      "body": "Apple - small iPhones - big iPhones - even bigger iPhones - even smaller iPhones .  This is their business strategy for all of their products !!",
      "score": 0,
      "created_utc": 1738374022.0,
      "replies": []
    },
    {
      "id": "ma9omt6",
      "author": "ImpactNext1283",
      "body": "Jobs would be ashamed, these would have been cool. Better comes up with 5 more subscriptions to sell! Not gonna be any innovation out of Apple coming soon",
      "score": -4,
      "created_utc": 1738359432.0,
      "replies": []
    },
    {
      "id": "ma9v1kd",
      "author": "None",
      "body": "Because nobody needs that shit!",
      "score": -1,
      "created_utc": 1738361285.0,
      "replies": []
    },
    {
      "id": "mablx4d",
      "author": "DefinitelyTheApple",
      "body": "Cool. Now can I change my damn iOS font?",
      "score": 0,
      "created_utc": 1738382496.0,
      "replies": [
        {
          "id": "mac6w3s",
          "author": "Shadowhawk109",
          "body": "Maybe if you jailbreak and sideload something.",
          "score": 1,
          "created_utc": 1738392239.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mac6mh7",
      "author": "Shadowhawk109",
      "body": "Thanks, beta testers who bought in at $3k.\n\nJesus Christ when will we learn a lesson.",
      "score": 0,
      "created_utc": 1738392096.0,
      "replies": []
    },
    {
      "id": "macm65o",
      "author": "WeatherSorry",
      "body": "Shocker",
      "score": -1,
      "created_utc": 1738400976.0,
      "replies": []
    },
    {
      "id": "mad5ib6",
      "author": "noxel",
      "body": "Because the headset is an overpriced garbage product",
      "score": -2,
      "created_utc": 1738412260.0,
      "replies": []
    },
    {
      "id": "madbqmf",
      "author": "Maunfactured_dissent",
      "body": "Koolaid drink tech bros on Reddit talked so much shit to me called me a Luddite (only stupid people use that as a pejorative) for talking shit about how this was a total flop and home VR was stupid this tech is years away from being any good. \n\n\n\nFucking dumbass tech bros.",
      "score": -2,
      "created_utc": 1738415175.0,
      "replies": [
        {
          "id": "madhkfa",
          "author": "DarthBuzzard",
          "body": "Uhh, wrong product my guy. The Vision headset line is still ongoing development.\n\nThis article is about an AR glasses prototype in their labs and even then they are still doing AR glasses development, this just happens to be one prototype that was canned.",
          "score": 3,
          "created_utc": 1738417561.0,
          "replies": [
            {
              "id": "maelbkq",
              "author": "ineververify",
              "body": "Comments in this sub are insane.  Literally a sub to discuss tech and they despise it.",
              "score": 1,
              "created_utc": 1738430457.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "maloish",
      "author": "born_zynner",
      "body": "I still can't believe how they released a worse version of the Oculus Quest for like 3x the price",
      "score": -2,
      "created_utc": 1738523253.0,
      "replies": []
    }
  ]
}