{
  "post": {
    "title": "This hardware mod crams an iPhone SE 3 into a classic Windows Phone | Inside iPhone, outside Lumia",
    "author": "chrisdh79",
    "id": "1iro3at",
    "score": 803,
    "created_utc": 1739810345.0,
    "selftext": "",
    "num_comments": 61,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1iro3at/this_hardware_mod_crams_an_iphone_se_3_into_a/"
  },
  "comments": [
    {
      "id": "mdbaobr",
      "author": "RayeFaye",
      "body": "I miss my windows phone… I really liked the layout but it not being able to run half the apps due to them just not being on the store or incompatible is what killed it for me. Had that thing for like 4 years after I got a new phone and just used it as an mp3 player/picture storage until it died (I dropped it in the toilet lmfao)",
      "score": 87,
      "created_utc": 1739825591.0,
      "replies": [
        {
          "id": "mdfbj3g",
          "author": "Plank_With_A_Nail_In",
          "body": "> not being able to run half the apps due to them just not being on the store or incompatible\n\nThis still happens on cheap android phones.",
          "score": 9,
          "created_utc": 1739885142.0,
          "replies": []
        },
        {
          "id": "mdc4un7",
          "author": "None",
          "body": "[deleted]",
          "score": 8,
          "created_utc": 1739834395.0,
          "replies": [
            {
              "id": "mdc6a9i",
              "author": "RayeFaye",
              "body": "I only ever broke 2 phones and it was the lumia and a galaxy s6… the glue that holds the screen to the body came undone and my damn screen fell off 😭",
              "score": 3,
              "created_utc": 1739834863.0,
              "replies": []
            },
            {
              "id": "mdciusj",
              "author": "BrunoEye",
              "body": "I also really liked the lumias as a kid, I got one but returned it the next day when I realised I couldn't play some game I really liked at the time.",
              "score": 1,
              "created_utc": 1739839005.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdiddv5",
          "author": "-Dixieflatline",
          "body": "It was shocking to me that MS couldn't get their app store off the ground to make their OS a relevant competitor back then. And the few top tier third party apps they did have were seemingly several revisions behind Apple and Android or just glorified browser skins when they first launched Windows Phone. That lack of app support would end up being the OS killer. Killed Windows Phone. Also killed WebOS, which was another promising OS (although, still alive on some TV's).",
          "score": 2,
          "created_utc": 1739917080.0,
          "replies": []
        },
        {
          "id": "mdfhj79",
          "author": "dankHippieDude",
          "body": "oh, me too. \n\nexcept the toilet part.",
          "score": 1,
          "created_utc": 1739887321.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mda7kzw",
      "author": "everydave42",
      "body": "“Your scientists were so preoccupied with whether or not they could…”",
      "score": 243,
      "created_utc": 1739814826.0,
      "replies": []
    },
    {
      "id": "mdabie4",
      "author": "None",
      "body": "I preferred the Windows phone UI. If Google hadn’t blocked YouTube it might have had a chance.",
      "score": 168,
      "created_utc": 1739815899.0,
      "replies": [
        {
          "id": "mdb99of",
          "author": "resil_update_bad",
          "body": "Every once in a while I revisit my old lumias... I wish they were functional, because the UI is slick as hell (Except the WP10 music player, that fucking sucked)",
          "score": 52,
          "created_utc": 1739825205.0,
          "replies": [
            {
              "id": "mdbv15v",
              "author": "xantec15",
              "body": "Funny/odd that the media player would be bad because the Zune was pretty good I thought.",
              "score": 24,
              "created_utc": 1739831376.0,
              "replies": [
                {
                  "id": "mdbwltl",
                  "author": "resil_update_bad",
                  "body": "The previous music player from wp8 was pretty good, but they really dropped the ball with groove music",
                  "score": 7,
                  "created_utc": 1739831847.0,
                  "replies": []
                },
                {
                  "id": "mdcje6k",
                  "author": "fairportmtg1",
                  "body": "Zuje was great but the age of the MP3 player was super short. Really only about a decade. Now smart phones and music streaming just don't better.",
                  "score": 3,
                  "created_utc": 1739839182.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mdctx1m",
              "author": "SupremeDictatorPaul",
              "body": "Yeah, the UI was better in pretty much every way to me than even current phone UIs. It was most of the flexibility of Android, while enforcing consistency like Apple. (Although it was really more consistent than Apple in a lot of ways.) And it ran smoother on half the hardware.",
              "score": 3,
              "created_utc": 1739842684.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdamwme",
          "author": "OperatorJo_",
          "body": "Metro UI wasn't for everyone. I liked it but I knew people that hated it. That and lack of app support are what ultimately killed it. Battery life wasn't stellar on the 8-series either. \n\nHonestly though? Smoothest-working phones I ever had.",
          "score": 45,
          "created_utc": 1739818978.0,
          "replies": [
            {
              "id": "mdaw4ie",
              "author": "BrewKazma",
              "body": "Def lack of app support. Loved my Lumia so much, but there were almost zero apps for it. I’d def consider switching back from apple if they relaunched it.",
              "score": 29,
              "created_utc": 1739821514.0,
              "replies": [
                {
                  "id": "mdd4q12",
                  "author": "None",
                  "body": "I've never understood why they don't just make a custom Android variant with their customizations on top, the software base has already been built for them. It's never been easier for them to launch a phone. They basically just need a custom skin and to build their own features on top. They've already added Android support to Windows, it's such a gimme I just cannot wrap my head around it.",
                  "score": 5,
                  "created_utc": 1739846421.0,
                  "replies": [
                    {
                      "id": "mddp9zp",
                      "author": "amaj230201",
                      "body": "They kinda did with the nokia XL.......it crashed and burned after the windows phone experience was already condemned by the time it came out.",
                      "score": 3,
                      "created_utc": 1739854365.0,
                      "replies": []
                    },
                    {
                      "id": "mde5ewv",
                      "author": "Loeffellux",
                      "body": "Pretty sure you can do it yourself with the right launcher",
                      "score": 1,
                      "created_utc": 1739862390.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mdb4u03",
              "author": "Frenzie24",
              "body": "I was lucky enough to be an early windows phone dev. The hardware and OS were amazing and it's a shame they bowed out.",
              "score": 19,
              "created_utc": 1739823954.0,
              "replies": [
                {
                  "id": "mdbjam5",
                  "author": "MexicanJello",
                  "body": "It's Microsoft's favorite thing to do. Launch hardware, poorly advertise it, restrict it to the US. Claim it's a failure and cancel it. Zune was a perfect example of this. Superior device to iPod, no one knew about it until it became a meme years later.",
                  "score": 21,
                  "created_utc": 1739827997.0,
                  "replies": [
                    {
                      "id": "mdfy7nf",
                      "author": "Dantaro",
                      "body": "The original Zune had a huge marketing push from Microsoft, it even managed a 9% market share of sold music players in the first weekend, but it never got enough market share to be relevant. Consumers clearly didn't think the Zune did enough to make it worth getting instead of the ipod. Maybe if they had released it closer to the original ipod it might have been a competitor, but they were too little too late.\n\nBeyond that, Windows Phone had a huge market share in India, and relevant market share in other regions. They didn't make the choice to restrict it to the US markets until the  950 series with windows 10 mobile.\n\nNone of this is to say that the Zune wasn't a good device, or that windows phone wasn't. I was a diehard windows phone user until it was sunset, and I would absolutely use it again if it came back, but you can't just hand wave away the issues, blaming it on MS's marketing. Consumers didn't like the products, and MS wasn't ever able to shake it up enough to change that",
                      "score": 1,
                      "created_utc": 1739892745.0,
                      "replies": [
                        {
                          "id": "mdjpke6",
                          "author": "MexicanJello",
                          "body": "My sentiments come as a Canadian, but a day 1 Zune and Windows Phone owner and a tech writer at the time. Zune was not possible to get here, Microsoft all but gave up by the time they released the Zune HD, which I found to be the perfect device. It was very disappointing, especially after my window got smashed and mine was stolen the day after I got it.\n\nAll we got was the Samsung Windows Phone, I'm blanking the official name of it. All ad spending I seen was on ineffective showings in many TV shows, although, as you said, the ultimate killer was it's lack of apps and many not liking the metro UI.",
                          "score": 1,
                          "created_utc": 1739932593.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mdbz9zy",
                  "author": "rpkarma",
                  "body": "I miss Windows Mobile 6.5 haha",
                  "score": 3,
                  "created_utc": 1739832649.0,
                  "replies": [
                    {
                      "id": "mdcsegz",
                      "author": "BasilBest",
                      "body": "The PocketPC or Smartphone variant?\n\nI have fond memories writing software with the .Net Compact Framework and thunking to the win32 api.\n\nThere were some cool phones, but this is all before iPhone. I felt like the shit pulling out TomTom and the Mr. T voice",
                      "score": 1,
                      "created_utc": 1739842174.0,
                      "replies": [
                        {
                          "id": "mdctfij",
                          "author": "rpkarma",
                          "body": "Smartphone. I was big on them back in the day, the one I had custom ROMs with the 6.5 interface was the Samsung Omnia i900, and prior to that I adored my LG KS20!",
                          "score": 1,
                          "created_utc": 1739842521.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mdc4ftn",
              "author": "notagoodscientist",
              "body": "Still have a lumia on w10m, biggest buggiest POS ever used. Hate the damn thing. Only have it because of the SIM card size it takes. Even the hardware is garbage, power the battery up full, turn it off and leave it ONE week and the battery is dead, and I mean literally dead, then you have to try and charge it which fails because the phone detects power, powers on then tries to draw too much power than it flips off, this literally goes on and on until you unplug it at which point you need to remove the battery, put wires into the terminals and charge it with a lithium battery charger for a bit, then can put it back and there’s enough power for the phone to power on and start charging. What’s good about this phone? Literally nothing, I can’t name one feature about it I like or that was actually implemented right and isn’t broken or buggy",
              "score": -3,
              "created_utc": 1739834264.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdccvjh",
          "author": "_kusa",
          "body": "It had way more issues than just google blocking youtube.\n\nMicrosofts open hostility towards app developers by creating gated communities on the app store killed any chanceof developers who wanted to build apps for it.",
          "score": -1,
          "created_utc": 1739837039.0,
          "replies": []
        },
        {
          "id": "mdalrhe",
          "author": "_RADIANTSUN_",
          "body": "Google didn't block YouTube, MS kept trying to make an app that didn't follow their terms of use (with adblockers etc) .",
          "score": -7,
          "created_utc": 1739818668.0,
          "replies": [
            {
              "id": "mdbzhzg",
              "author": "rpkarma",
              "body": "That’s because Google wouldn’t let Microsoft integrate ad display properly. MS asked, Google refused.",
              "score": 9,
              "created_utc": 1739832717.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mda3pgx",
      "author": "None",
      "body": "Is that …good?",
      "score": 35,
      "created_utc": 1739813767.0,
      "replies": [
        {
          "id": "mdaajrv",
          "author": "atomsmasher66",
          "body": "Crams = good",
          "score": 21,
          "created_utc": 1739815637.0,
          "replies": []
        },
        {
          "id": "mdd6hu5",
          "author": "Wiggles69",
          "body": "It looks like obsolete microsoft hardware, but it performs like obsolete Apple software!\n\n...So no, i don't think so.",
          "score": 5,
          "created_utc": 1739847057.0,
          "replies": []
        },
        {
          "id": "mdbjhdn",
          "author": "iampuh",
          "body": "For someone like me, who liked Lumia phones, yes. Sounds like a fun project too.",
          "score": 1,
          "created_utc": 1739828049.0,
          "replies": []
        },
        {
          "id": "mdb82yf",
          "author": "None",
          "body": "[deleted]",
          "score": 0,
          "created_utc": 1739824874.0,
          "replies": [
            {
              "id": "mdb9q3y",
              "author": "rafark",
              "body": "The se 3 was release in 2022. 2 years and 11 months ago. That’s like the opposite of almost 10 years old",
              "score": 2,
              "created_utc": 1739825330.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mdavyc2",
      "author": "BrewKazma",
      "body": "Sploosh. I loved my Lumia. Had some heft to it. Last phone I had before switching to Iphone.",
      "score": 9,
      "created_utc": 1739821466.0,
      "replies": []
    },
    {
      "id": "mdb8w0y",
      "author": "resil_update_bad",
      "body": "It looks so fucking good, it makes me so sad that Lumias died",
      "score": 8,
      "created_utc": 1739825100.0,
      "replies": []
    },
    {
      "id": "mda7qxj",
      "author": "BenjiSBRK",
      "body": "ButWhy.gif",
      "score": 7,
      "created_utc": 1739814871.0,
      "replies": []
    },
    {
      "id": "mdbrjdw",
      "author": "The16BitGamer",
      "body": "Original Post: https://www.reddit.com/r/hackintosh/comments/1ime6y2/hackintosh_but_on_a_phone_lumiphone_1020_se/#lightbox",
      "score": 7,
      "created_utc": 1739830348.0,
      "replies": [
        {
          "id": "mdd7y9m",
          "author": "Rahyan30200",
          "body": "Thanks. I'm fed up with websites making articles out of Reddit posts...\n\nThe latter is more useful, has more information, and isn't just repeating useless information to make revenue...\n\nEdit: I've done a quick read at the post. The website only rephrased what OC wrote, lol...",
          "score": 3,
          "created_utc": 1739847580.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdc9d3i",
      "author": "rektaur",
      "body": "RIP Windows Phone, smooth as butter and the best homescreen known to mankind",
      "score": 6,
      "created_utc": 1739835879.0,
      "replies": []
    },
    {
      "id": "mdcj5a0",
      "author": "CallMeDrLuv",
      "body": "They need to do it the other way.\n\nWindows phone on modern hardware would kick ass.",
      "score": 5,
      "created_utc": 1739839101.0,
      "replies": []
    },
    {
      "id": "mdbz36h",
      "author": "rpkarma",
      "body": "> the creator instead rewired it to serve as an additional volume-down button.\n\nThey say “the shutter button doesn’t work” but doing this lets it work *as* a shutter button in the Camera app anyway!",
      "score": 4,
      "created_utc": 1739832591.0,
      "replies": []
    },
    {
      "id": "mdadhni",
      "author": "Gorn_with_the_wind",
      "body": "Lucia’s were such nice phones",
      "score": 7,
      "created_utc": 1739816434.0,
      "replies": []
    },
    {
      "id": "mdbqc3z",
      "author": "fraghead5",
      "body": "I had the one Nokia with the 42 megapixel camera for a summer along with my iPhone and the hardware felt so high end. I wish the software kept up",
      "score": 3,
      "created_utc": 1739829997.0,
      "replies": [
        {
          "id": "mdf64el",
          "author": "sfcfrankcastle",
          "body": "I had the same one by far the best feeling phone I ever owned. If that phone released today with Android I’d be all over it.",
          "score": 1,
          "created_utc": 1739883001.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mddebii",
      "author": "gorcorps",
      "body": "Ah, the worst of both worlds... Perfect",
      "score": 2,
      "created_utc": 1739849900.0,
      "replies": []
    },
    {
      "id": "mdaqyq3",
      "author": "None",
      "body": "![gif](giphy|s239QJIh56sRW|downsized)",
      "score": 2,
      "created_utc": 1739820090.0,
      "replies": [
        {
          "id": "mdcpzg1",
          "author": "ineververify",
          "body": "Reddit gadgets doesn’t understand gadgets",
          "score": 1,
          "created_utc": 1739841368.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdaay9p",
      "author": "Melodic-Comb9076",
      "body": "DI Why?\n\nlots of time and resources on hands?",
      "score": 2,
      "created_utc": 1739815747.0,
      "replies": [
        {
          "id": "mdb8888",
          "author": "SQL617",
          "body": "Fun project, the Lumia has a cult like following. I’ve seen worse hobbies.",
          "score": 3,
          "created_utc": 1739824915.0,
          "replies": [
            {
              "id": "mdczjsn",
              "author": "nero40",
              "body": "I recently bought a broken PSP during Christmas and fixed it. This is the first PSP I ever owned. Learned a lot of things in such a short time lol. It’s not fully working, some buttons are still crap, but it works now and I’m playing SotN on it now (which is also the first time I ever played SotN). \n\nThese gadgets projects are really fun, especially if the gadget is old. Don’t worry if you think you’re going to broke it even more, just think if you have the time for it.",
              "score": 1,
              "created_utc": 1739844595.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mdcqjs1",
      "author": "chum_slice",
      "body": "The body of an Nokia N9 was beautiful. Then MS bought Nokia and put Windows on it. Meego OS was ahead of its time with swipes and no home button",
      "score": 2,
      "created_utc": 1739841559.0,
      "replies": [
        {
          "id": "mdcts4c",
          "author": "SooThatGuy",
          "body": "If you really want to bake your noodle, look at the Diamond Mako/Psion Revo. I’d buy that today if it had a reasonable browser and email app",
          "score": 2,
          "created_utc": 1739842638.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdenbs7",
      "author": "dernailer",
      "body": "from 41 to 12 is cleary not an improvement...",
      "score": 1,
      "created_utc": 1739873195.0,
      "replies": []
    },
    {
      "id": "mdfg570",
      "author": "None",
      "body": "You somehow made the SE 3 worse by putting it inside a lumia. I’m impressed",
      "score": 1,
      "created_utc": 1739886830.0,
      "replies": []
    },
    {
      "id": "mdfir98",
      "author": "zvekl",
      "body": "I had WM2003 and it was OK but man it sucked that they had the lead in the phone realm and just didn't innovate",
      "score": 1,
      "created_utc": 1739887755.0,
      "replies": []
    },
    {
      "id": "mdkoh3a",
      "author": "None",
      "body": "Unpopular opinion: hated some elements of windows phone. All the black empty space in the app drawer, the lack of a wallpaper on the main screen. The widgets were boring as hell. It looked like gui from 90s with better fonts and resolution",
      "score": 1,
      "created_utc": 1739947013.0,
      "replies": []
    },
    {
      "id": "md9w315",
      "author": "luis-mercado",
      "body": "Nice mod.",
      "score": 1,
      "created_utc": 1739811607.0,
      "replies": []
    },
    {
      "id": "mdfn3m1",
      "author": "mr_sakitumi",
      "body": "Not as good as a windows phone.",
      "score": 0,
      "created_utc": 1739889237.0,
      "replies": []
    }
  ]
}