{
  "post": {
    "title": "Up close with the Nvidia GeForce RTX 5090 FE, an incredibly compact flagship video card | Nvidia’s version is the only one that can comfortably fit in small form factor cases.",
    "author": "chrisdh79",
    "id": "1hxcbmj",
    "score": 742,
    "created_utc": 1736427802.0,
    "selftext": "",
    "num_comments": 122,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hxcbmj/up_close_with_the_nvidia_geforce_rtx_5090_fe_an/"
  },
  "comments": [
    {
      "id": "m67v0jz",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736427803.0,
      "replies": []
    },
    {
      "id": "m6904y4",
      "author": "Racxie",
      "body": "Just a shame they decided to screw over their third party vendors over a while back because I miss EVGA and would have loved to see what they could have done with this and future cards.",
      "score": 302,
      "created_utc": 1736441427.0,
      "replies": [
        {
          "id": "m697ymn",
          "author": "elmaxel",
          "body": "shits still happening. evga propably wont be the last one",
          "score": 113,
          "created_utc": 1736443706.0,
          "replies": [
            {
              "id": "m698h7u",
              "author": "Racxie",
              "body": "Probably. Tbh I’m surprised some of the others didn’t drop out around the same time, so I’m wondering if Nvidia had something against them particularly (probably because they were highly regarded as the best).",
              "score": 36,
              "created_utc": 1736443855.0,
              "replies": [
                {
                  "id": "m6n4gbi",
                  "author": "Affectionate-Memory4",
                  "body": "In my experience and opinion, they were the last ones to routinely outperform the FE cooler design. My 3080ti runs dead silent and isn't terribly large compared to some of the others out there. No coil whine. Hotspot is well under control.\n\nEvery other card in that generation is either louder at the same size, or larger for similar performance. The FE card is smaller, but it's also far from silent.",
                  "score": 4,
                  "created_utc": 1736631892.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m69cbfn",
              "author": "mattumbo",
              "body": "Nividia is definitely moving toward just selling FE cards and cutting out board partners, I think we’ll see a gradual transition to that as partners exit the business due to the forced low margins and undercutting as Nividia increases FE supply. Might see some board partners stick around to sell the high end specialty cards, but Nividia clearly wants to own the base spec market with how much effort they’re putting into FE card design.",
              "score": 32,
              "created_utc": 1736444957.0,
              "replies": [
                {
                  "id": "m69ks0l",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 14,
                  "created_utc": 1736447396.0,
                  "replies": [
                    {
                      "id": "m69mfbq",
                      "author": "None",
                      "body": "[removed]",
                      "score": 13,
                      "created_utc": 1736447871.0,
                      "replies": [
                        {
                          "id": "m69onju",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 16,
                          "created_utc": 1736448511.0,
                          "replies": [
                            {
                              "id": "m6aeoui",
                              "author": "RikiWardOG",
                              "body": "Ya didn't they have that crazy cable issue too? where it was difficult to fully plug in and it was melting?",
                              "score": 3,
                              "created_utc": 1736456081.0,
                              "replies": [
                                {
                                  "id": "m6n4vpw",
                                  "author": "Affectionate-Memory4",
                                  "body": "That was across all models as it was the connector design itself causing the problems. It's been mitigated in the new 2x6 version, but I'm still very weary of the 5090's 575W power limit on a 600W connector.",
                                  "score": 1,
                                  "created_utc": 1736632026.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m6a0dya",
                          "author": "Tyetsa",
                          "body": "My 1070 FE would hit thermal max as soon as it had any 3D load on it, and would start throttling to the extreme. I put an NZXT Kraken mount on it and an AIO to fix it.",
                          "score": 4,
                          "created_utc": 1736451896.0,
                          "replies": [
                            {
                              "id": "m6a9ufq",
                              "author": "fairportmtg1",
                              "body": "The new FE cards are way better than the dogshit blower cards Nvidia used to shit out. That being said wish EVGA was still around. Unbeatable warranty, good quality, and good coolers",
                              "score": 13,
                              "created_utc": 1736454665.0,
                              "replies": [
                                {
                                  "id": "m6ablnl",
                                  "author": "Tyetsa",
                                  "body": "Ah, that sounds good. I haven't been able to afford a new GPU since covid, lol.",
                                  "score": 2,
                                  "created_utc": 1736455182.0,
                                  "replies": [
                                    {
                                      "id": "m6cawsl",
                                      "author": "DeceiverX",
                                      "body": "I was buying exclusively EVGA cards since the early 2000s.  Absolutely THE best GPU board partner.  By far and away the best chips, the best designs, lowest bloat, among the best prices, and warranties that no other electronics company has ever touched.  And it was all domestic in the US.  Their shit was built to last and they fucking stood by it.\n\nI regrettably purchased a 4070 super recently at a deep discount from MSI because AMD isn't currently very competitive in that price range.  I do not want to support Nvidia after how they treated such a fantastic company otherwise.",
                                      "score": 1,
                                      "created_utc": 1736478196.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m69u21x",
                  "author": "imaginary_num6er",
                  "body": "As they should. None of these AIB cards are worth a damn anyway with their shitty RMA practices",
                  "score": 6,
                  "created_utc": 1736450063.0,
                  "replies": [
                    {
                      "id": "m6a9jgu",
                      "author": "elmaxel",
                      "body": "zotac is pretty fair! even 5 years warranty after registering. and monopolies are never a good thing for us consumers",
                      "score": 10,
                      "created_utc": 1736454575.0,
                      "replies": []
                    },
                    {
                      "id": "m6a74co",
                      "author": "DerangedGinger",
                      "body": "I quit buying ASUS after I had to RMA my 980 and a motherboard and both were painful processes with a company that couldn't care less about me and only wants my wallet.",
                      "score": 5,
                      "created_utc": 1736453869.0,
                      "replies": [
                        {
                          "id": "m6asbhq",
                          "author": "ehxy",
                          "body": "honestly having been asus for at least 3 generations now I have not have a problem with them, but then again I never had to RMA.  cross fingers.  but yeah I might just go FE this round",
                          "score": 0,
                          "created_utc": 1736460088.0,
                          "replies": [
                            {
                              "id": "m6bkfla",
                              "author": "Taoistandroid",
                              "body": "EVGA was the only company to give me a better experience than Nintendo.\n\nEVGA did cross shipping, which few companies will do, they sent me a new card and I returned my defective one.\n\nPower color, by comparison, my 5800 xt reference black had a defect, they couldn't provide me a replacement and instead offered me an inferior 5800 xt that didn't even my itx case. I argued with them and their stance was to take it or leave it. They had a card that had an MSRP only $30 higher that would have fit, but they wouldn't budge.",
                              "score": 4,
                              "created_utc": 1736469238.0,
                              "replies": []
                            },
                            {
                              "id": "m6cbt8k",
                              "author": "DeceiverX",
                              "body": "Every single board I have purchased or worked on for friends from ASUS in the last fifteen years has either been DOA or died within three months.  Literally ZERO successful builds.  RMA processes took a upwards of four months sometimes.\n\nI no longer buy anything from them at all and will pay the premium for other brands happily.",
                              "score": 3,
                              "created_utc": 1736478519.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m6uz0b7",
                      "author": "UltraAC5",
                      "body": "I miss EVGA so much",
                      "score": 2,
                      "created_utc": 1736737017.0,
                      "replies": []
                    },
                    {
                      "id": "m6b7ff4",
                      "author": "ilyich_commies",
                      "body": "Imagine if Honda sold car chassis fitted with an engine to other vendors who slapped on a third party shell and electronics",
                      "score": 2,
                      "created_utc": 1736464874.0,
                      "replies": [
                        {
                          "id": "m6bcup4",
                          "author": "revolvingpresoak9640",
                          "body": "That kind of happens already, where a platform is shared and sold as different cars.",
                          "score": 4,
                          "created_utc": 1736466703.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m6ane5g",
                  "author": "Coldcutsmcgee",
                  "body": "I’m gonna get some hate for saying this… but would it really that bad if only FEs were available? I always waterblock my card and do my own OC. If there was just one PCB there would be an even bigger selection of blocks because the process would be streamlined. I find the AIBs just so gaudy and way overpriced for an OC you can accomplish yourself.",
                  "score": 2,
                  "created_utc": 1736458632.0,
                  "replies": [
                    {
                      "id": "m6oz68t",
                      "author": "sabby1225",
                      "body": "Somewhat related, I find the FEs to be the most aesthetically appealing.",
                      "score": 1,
                      "created_utc": 1736654738.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m6d00u6",
                  "author": "markdepace",
                  "body": "does no one remember 3DFX doing this? they lost their entire market share and went bankrupt...",
                  "score": 1,
                  "created_utc": 1736488451.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m6aaifu",
              "author": "x925",
              "body": "Nvidia probably wants it that way.",
              "score": 1,
              "created_utc": 1736454863.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m6945d7",
          "author": "fiftyshadesofseth",
          "body": "screwed over? ive been out of the loop, what did Nvidia do?",
          "score": 16,
          "created_utc": 1736442594.0,
          "replies": [
            {
              "id": "m6954hq",
              "author": "Racxie",
              "body": "This happened [a couple of years ago](https://www.theverge.com/2022/9/16/23357031/evga-nvidia-graphics-cards-stops-making), but essentially the main two reasons were that Nvidia was really bad at communication (in ways that came across as intentional) and undercut them on the higher end cards to the point where EVGA lost money on those cards.",
              "score": 40,
              "created_utc": 1736442879.0,
              "replies": []
            },
            {
              "id": "m69cia6",
              "author": "gg06civicsi",
              "body": "They don’t communicate or work well with their partners. Apparently their board partners find out the same time we do what the FE prices will be and if it’s too low it may screw their own projections.",
              "score": 14,
              "created_utc": 1736445011.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m683rvx",
      "author": "CarltonSagot",
      "body": "Yeah.... gonna need the thermal performance....\n\nIts 575 watts......",
      "score": 217,
      "created_utc": 1736431193.0,
      "replies": [
        {
          "id": "m68ilzv",
          "author": "acyclovir31",
          "body": "![gif](giphy|TKoW5RKoWJn1curl65)",
          "score": 49,
          "created_utc": 1736436196.0,
          "replies": []
        },
        {
          "id": "m687883",
          "author": "Snowmobile2004",
          "body": "It’s also got 2x pass-through fans and a new vapour chamber. Nvidia has been very good with cooling the past few generations so I’m not too worried.",
          "score": 85,
          "created_utc": 1736432430.0,
          "replies": [
            {
              "id": "m687tc2",
              "author": "drmirage809",
              "body": "Oh yeah. The founder’s edition cards are not the old blower cooler reference cards of yesteryear. These things actually have decent cooling on them. \n\nThey’re also almost impossible to get in Europe for some reason. Don’t think I’ve ever seen anyone have them in stock.",
              "score": 59,
              "created_utc": 1736432635.0,
              "replies": [
                {
                  "id": "m698qlx",
                  "author": "nalc",
                  "body": "> not the old blower cooler reference cards of yesteryear\n\nOof, feeling my age today. The Internet was shocked, amazed, and also a little outraged when the first [GeForce FX](https://upload.wikimedia.org/wikipedia/commons/d/da/NVIDIA_GeForce_FX_5800_Ultra_ES.jpg) launched with a squirrel cage blower that exhausted air outside of the case and wasted an entire second expansion card slot. That was 22 years ago and prior to that, it was just a fan in the center of a radial fin heatsink that blew outward like [this](https://upload.wikimedia.org/wikipedia/commons/7/7c/NVIDIA_GeForce4_Ti_4600_Mac.jpg)",
                  "score": 25,
                  "created_utc": 1736443933.0,
                  "replies": [
                    {
                      "id": "m69pujh",
                      "author": "drmirage809",
                      "body": "Damn. That's even worse than the blower. For all of its faults, it at least kicked heat out of the case. They were noisy buggers though.",
                      "score": 4,
                      "created_utc": 1736448852.0,
                      "replies": []
                    },
                    {
                      "id": "m6a9kze",
                      "author": "TheBeatGoesAnanas",
                      "body": "I remember the FX and the community complaints about taking a second slot, lol. Meanwhile I don't think the GeForce 2 I convinced my dad to spec in the family Dell even had a fan.",
                      "score": 2,
                      "created_utc": 1736454588.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m6a8h96",
                  "author": "sh1boleth",
                  "body": "My 3090FE has never gone above 70C, stock fan curve - no under/over volting.",
                  "score": 5,
                  "created_utc": 1736454265.0,
                  "replies": []
                },
                {
                  "id": "m6arjpp",
                  "author": "friskerson",
                  "body": "I’ve not personally seen them in the US in retail stores like BestBuy, even online, they’re usually the ones that sell out in 10 min last 2 generations.",
                  "score": 1,
                  "created_utc": 1736459857.0,
                  "replies": []
                },
                {
                  "id": "m68mepd",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -20,
                  "created_utc": 1736437362.0,
                  "replies": [
                    {
                      "id": "m68w6ps",
                      "author": "NewAccountToAvoidDox",
                      "body": "He meant previous gen",
                      "score": 17,
                      "created_utc": 1736440278.0,
                      "replies": [
                        {
                          "id": "m69plai",
                          "author": "drmirage809",
                          "body": "I do indeed mean 40 series cards. Never seen FE cards in stock for those.",
                          "score": 6,
                          "created_utc": 1736448779.0,
                          "replies": []
                        },
                        {
                          "id": "m6955u5",
                          "author": "None",
                          "body": "[deleted]",
                          "score": -23,
                          "created_utc": 1736442890.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m6aew7h",
          "author": "RikiWardOG",
          "body": "jfc is it really? that's nuts. they've stopped being able to figure out how to make gains by better engineering/architecture and resorted to just throwing more power at it",
          "score": 3,
          "created_utc": 1736456141.0,
          "replies": []
        },
        {
          "id": "m69k5y2",
          "author": "nuenoxnyx",
          "body": "Wtf that's higher than the power consumption wattage of entire PCs. Can't imagine the electricity bill.\n\n5060 and 5070 will have plenty of performance for way better power efficiency.",
          "score": 6,
          "created_utc": 1736447219.0,
          "replies": [
            {
              "id": "m69pj5b",
              "author": "soulsoda",
              "body": "It's not as bad as you think. Cards don't operate at their TDP 100% of the time unless your pushing their limits. you're unlikely to push the 5090 over 500 watts (sustained not peak) unless you're doing like 8k, modeling, or benchmarking. \n\nAlso People would power limit their 4080s/4090s taking like 100watts to 50% TDP and would still get better performance. Infact a 4090 running at 50% TDP still had about 77% of it's base performance based on testing done by Toms hardware. A 4090 was 197% faster than a 4070, so 77% x 197% is still 151% better performance over a 4070.",
              "score": 17,
              "created_utc": 1736448761.0,
              "replies": [
                {
                  "id": "m6bq0ri",
                  "author": "HeckXX",
                  "body": "> A 4090 was 197% faster than a 4070,\n\nSource for this? I assume you also mean 97% faster, but most benchmarks I find puts the 4090 around 30-40% faster than the 4070.",
                  "score": 5,
                  "created_utc": 1736471081.0,
                  "replies": [
                    {
                      "id": "m6bvami",
                      "author": "soulsoda",
                      "body": "Your statement is correct, I meant it as a benchmark %s not \"speed\", my bad. I'm also assuming stock performance.\n\nThe 4070 is still the more efficient card regardless especially since you can also under clock that card. Personally the sweet spot for good performance is 70-80% TDP for either card and you only lose 5% performance in fps.",
                      "score": 3,
                      "created_utc": 1736472851.0,
                      "replies": []
                    },
                    {
                      "id": "m6mbw20",
                      "author": "nuenoxnyx",
                      "body": "Toms's hierarchy puts the 4070 Super at 33% less 1440p performance, 4070 at 49% less. But they're all 97+ fps.",
                      "score": 1,
                      "created_utc": 1736622751.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m69vi9y",
          "author": "lxs0713",
          "body": "Yeah, I have a feeling it's going to be one loud card. I guess most PC gamers just use headphones all the time so they don't care, but I hate loud PCs. \n\nThose overbuilt coolers may be overkill, and any performance gains you get from them will be negligible, but at least they're able to run full tilt with really low fan speeds. I don't have a tiny SFF case, so I'll take better noise and thermals over a small card anyway",
          "score": 6,
          "created_utc": 1736450485.0,
          "replies": []
        },
        {
          "id": "m6aaq4p",
          "author": "tooldvn",
          "body": "There's a video that was poster earlier today that PC world did with the Nvidia product manager. What they did to achieve cooling in such a small package was to break up the normally 1 long pcb into 3 pcbs. This allows airflow to pass through without hitting the wall of the long card.\n\nWhats cool is that potentially you could take it apart and with some custom connectors mount the GPU pcb somewhere else.  If you damage the pcie connector you could theoretically just replace that board saving money and the card overall.\n\nhttps://youtu.be/4WMwRlTdaZw?si=D3rMtLR8sQO6fHWr",
          "score": 1,
          "created_utc": 1736454926.0,
          "replies": []
        },
        {
          "id": "m6a2t7z",
          "author": "buggsbunnysgarage",
          "body": "damn thats about half of the watts my radiator has in my living room",
          "score": 1,
          "created_utc": 1736452603.0,
          "replies": [
            {
              "id": "m6a4ln8",
              "author": "yeableskive",
              "body": "You can heat your house with these too!",
              "score": 4,
              "created_utc": 1736453126.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m68fwlm",
      "author": "saposapot",
      "body": "Are these cooling improvements also applied to the lower tier cards? It would be cool to be back to smaller cards all together. I haven’t found anything about the other models",
      "score": 37,
      "created_utc": 1736435345.0,
      "replies": [
        {
          "id": "m6a465x",
          "author": "gameguy600",
          "body": "RTX 5090, 5080, and 5070 will have founders edition models with this style of cooler. 5080 and 5090 at least will have the same dual slot cooler if Techpowerup is to be believed. 5070 will also be dual slot but the dimensions don't seem to be available.\n\n5070 TI on the other hand will be AIB partner only so it won't have this cooler style. Size will vary between retailers and their models.",
          "score": 8,
          "created_utc": 1736452999.0,
          "replies": [
            {
              "id": "m6ax3xz",
              "author": "H3nryb14",
              "body": "Only 5080 and 5090 will have this style cooler, 5070 will have same style cooler as the 40 series.",
              "score": 3,
              "created_utc": 1736461559.0,
              "replies": [
                {
                  "id": "m6c6lqz",
                  "author": "saposapot",
                  "body": "Disappointing but if they also “shrink down” the PCB for the 5070 it could still be good news and an open door to even smaller cards",
                  "score": 1,
                  "created_utc": 1736476698.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m688wx7",
      "author": "fiftyshadesofseth",
      "body": "i love the aesthetics of founders edition cards, the design is a subtle reminder that it is cutting edge technology. aftermarket cards just look to gamerfied to me.",
      "score": 99,
      "created_utc": 1736433017.0,
      "replies": [
        {
          "id": "m691yw6",
          "author": "fatojisan",
          "body": "They look good yeah, but do they cool as efficiently as the ones you get from third-party vendors?",
          "score": 16,
          "created_utc": 1736441955.0,
          "replies": [
            {
              "id": "m693pt6",
              "author": "fiftyshadesofseth",
              "body": "its probably a marginal difference tbh",
              "score": 18,
              "created_utc": 1736442468.0,
              "replies": []
            },
            {
              "id": "m69if3u",
              "author": "ScarletNerd",
              "body": "Just an anecdote, but my previous EVGA 1080ti and 2080ti ran hot and loud maxed out. Usually around 70-75c with all fans screaming.\n\nMy 4080S FE runs around 60c maxed out and is whisper silent. Huge difference. Granted I don't have a non-FE card to compare against, but this FE cooling seems to be better than any I ever had aftermarket. Looks way nicer too. I plan on always trying to snag FE cards in the future after this experience.",
              "score": 11,
              "created_utc": 1736446717.0,
              "replies": []
            },
            {
              "id": "m6ad44j",
              "author": "NinjaLion",
              "body": "40 and 50 series yes, before that, definitely not",
              "score": 4,
              "created_utc": 1736455624.0,
              "replies": []
            },
            {
              "id": "m69ltba",
              "author": "snicker422",
              "body": "The 5090 FE cooler is probably very efficient compared to 3rd party designs, considering its size (and assuming that Nvidia has reasonable thermal targets). However, that doesn’t mean it will have the absolute best cooling performance.",
              "score": 3,
              "created_utc": 1736447696.0,
              "replies": []
            },
            {
              "id": "m6adwy0",
              "author": "tooldvn",
              "body": "Check this out for how they got the cooling done in the 5090.  They split the big pcb into 3, allowing more pass through airflow.\n\nhttps://youtu.be/4WMwRlTdaZw?si=D3rMtLR8sQO6fHWr",
              "score": 1,
              "created_utc": 1736455856.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m697yb6",
          "author": "nope_nic_tesla",
          "body": "Yeah, but how will people know I'm an xX-EliteGamer-Xx if my video card doesn't look like it's throwing a rave?",
          "score": 8,
          "created_utc": 1736443703.0,
          "replies": []
        },
        {
          "id": "m699jdy",
          "author": "ToMorrowsEnd",
          "body": "This.  I am so done with the rainbow LED puke on everything.",
          "score": 7,
          "created_utc": 1736444162.0,
          "replies": []
        },
        {
          "id": "m69qbg0",
          "author": "Shapes_in_Clouds",
          "body": "Except for Asus Pro Art.  My 4080S Pro Art is the most beautiful GPU design out there IMO.\n\nThat's still a 2.5 slot card though.  Absolutely crazy this 5090 is just 2 slots.",
          "score": 4,
          "created_utc": 1736448985.0,
          "replies": []
        },
        {
          "id": "m69gakh",
          "author": "youpeoplesucc",
          "body": "There are some relatively subtle ones. My xfx 7900xtx doesn't look quite as nice as an nvidia FE card but it's close imo.",
          "score": 2,
          "created_utc": 1736446103.0,
          "replies": []
        },
        {
          "id": "m69uurl",
          "author": "ClumsyRainbow",
          "body": "I quite like the “Limited Edition” Intel Arc cards for the same reason.",
          "score": 2,
          "created_utc": 1736450298.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m692t8z",
      "author": "rellsell",
      "body": "Only things standing between me and that card is $2,000 and my wife.",
      "score": 38,
      "created_utc": 1736442203.0,
      "replies": [
        {
          "id": "m69t1sg",
          "author": "SilverBuggie",
          "body": "You can clear those two hurdles simultaneously by asking your wife for $2000.",
          "score": 13,
          "created_utc": 1736449774.0,
          "replies": [
            {
              "id": "m6a89c2",
              "author": "rellsell",
              "body": "lol… would you ask her for me?",
              "score": 5,
              "created_utc": 1736454201.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m696neb",
          "author": "grilled_cheese_gang",
          "body": "Disposables, you say?",
          "score": 2,
          "created_utc": 1736443325.0,
          "replies": [
            {
              "id": "m6ajr7a",
              "author": "thesplatlingamet",
              "body": "To shreds you say?",
              "score": 2,
              "created_utc": 1736457564.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m6dos3p",
          "author": "Harambesic",
          "body": "I chortled and almost woke up my wife.",
          "score": 1,
          "created_utc": 1736503239.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m687dhm",
      "author": "pragmatick",
      "body": "Why is the 5090 smaller than the ~~4080~~ 5080?",
      "score": 18,
      "created_utc": 1736432481.0,
      "replies": [
        {
          "id": "m68abql",
          "author": "Vresa",
          "body": "Most of the size of a graphics card is actually the cooler assembly. The board itself is surprisingly small.\n\n\nA lot of it comes down the altering the PCB’s dimensions to allow better airflow around the board, which lets the cooling be more effiecent so they can shrink the size of the heat sink needed.\n\nI would assume Nvidia took the R&D time to ensure their new custom PCB design and cooler assembly can keep the GPU from overheating on their founder edition cards. Though weirder mistakes have happened. We’ll have to see how it handles when the performance embargo is lifted and content creators can compare Nvidia’s Founder’s Edition spec with their board partners like ASUS",
          "score": 43,
          "created_utc": 1736433506.0,
          "replies": [
            {
              "id": "m68iovk",
              "author": "danielv123",
              "body": "Also, the coolers for the 40 series were massively oversized. There is speculation that they thought they could/would have to give them more power to hit performance targets.",
              "score": 12,
              "created_utc": 1736436221.0,
              "replies": []
            },
            {
              "id": "m69001h",
              "author": "pragmatick",
              "body": "Thanks for the response. But I wanted to write why is the 5090 smaller than the ~~5090~~ 5080 which the article implies.",
              "score": 1,
              "created_utc": 1736441388.0,
              "replies": [
                {
                  "id": "m69wb3g",
                  "author": "Vresa",
                  "body": "I’m assuming you mean the 5080 vs 5090 here. \n\nIt’s almost certainly cost cutting and/or a manufacturing throughput limit. The custom PCB for the 5090 is likely pretty expensive to manufacture compared to the standard nvidia board since it would require new tooling. It could also be the case that they simply cannot make this PCB form factor at the scale to meet the demand for the 5080. \n\nSince the 5090 is a lower selling card at a higher price point, it’s easier for them to offset a higher cost of component production without hurting their profit margin. This likely isn’t the case for the 5080’s lower cost and higher production targets.",
                  "score": 4,
                  "created_utc": 1736450716.0,
                  "replies": [
                    {
                      "id": "m69wx0x",
                      "author": "pragmatick",
                      "body": "Jesus, I think I may be physically unable to write the correct sentence. Yes that's what I meant.",
                      "score": 5,
                      "created_utc": 1736450890.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m6896um",
          "author": "fiftyshadesofseth",
          "body": "sometimes less is more, technology advances and the room necessary for these cards to function decreases until the next wave comes and requires more space and more power.",
          "score": 15,
          "created_utc": 1736433113.0,
          "replies": []
        },
        {
          "id": "m69620b",
          "author": "randomIndividual21",
          "body": "It's because 5090 use ultra dense pcb. It's actually pcb size is like half of 4090 and 4080 etc",
          "score": 1,
          "created_utc": 1736443153.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m69hlf4",
      "author": "epidemica",
      "body": "Just something else I won't ever be able to buy despite having the money for it.\n\nI don't want a ZOTAC 3 or 4 slot card with a $500 \"RGB\" premium added onto it, or an FE card that costs $4k on eBay.",
      "score": 4,
      "created_utc": 1736446480.0,
      "replies": []
    },
    {
      "id": "m69jhqi",
      "author": "Freya_gleamingstar",
      "body": "Butt will it have RGB?!?",
      "score": 5,
      "created_utc": 1736447025.0,
      "replies": []
    },
    {
      "id": "m67xebp",
      "author": "lyllopip",
      "body": "Meanwhile Asus with its 4 fans 3.8 slots ROG Astral card\n https://rog.asus.com/graphics-cards/graphics-cards/rog-astral/rog-astral-rtx5090-o32g-gaming/",
      "score": 19,
      "created_utc": 1736428773.0,
      "replies": [
        {
          "id": "m68h4k9",
          "author": "SolidOutcome",
          "body": "More cooling is always good. Thermals limit performance.",
          "score": 10,
          "created_utc": 1736435731.0,
          "replies": [
            {
              "id": "m69wulp",
              "author": "Vresa",
              "body": "There’s a major diminishing returns though. If a card is operating within the correct temperature zone, adding more cooling is only increasing power usage, noise, and more points of failure.",
              "score": 7,
              "created_utc": 1736450872.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m67yxih",
          "author": "w1n5t0nM1k3y",
          "body": "Don't see why we can't have both. Most cases are pretty large and almost nobody uses the PCIe slots for anything except a GPU.\n\nCompared to the actual full tower cases of 30 years ago, most modern machines are small.",
          "score": 15,
          "created_utc": 1736429372.0,
          "replies": [
            {
              "id": "m68ifp7",
              "author": "danielv123",
              "body": "As someone who uses PCIe slots for other stuff than a GPU and might even want to fit more than one, I cry every time I look at new cooler designs.",
              "score": 5,
              "created_utc": 1736436142.0,
              "replies": [
                {
                  "id": "m69bpde",
                  "author": "Dracekidjr",
                  "body": "Can't have a modern gpu and any extra ssd's anymore.",
                  "score": 1,
                  "created_utc": 1736444783.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m69vtso",
      "author": "Underwater_Karma",
      "body": "I guess we'll agree to disagree as to what \"incredibly compact\" means, or \"comfortably fit\"",
      "score": 3,
      "created_utc": 1736450577.0,
      "replies": []
    },
    {
      "id": "m69datv",
      "author": "EVMad",
      "body": "You'd have to redefine small form factor for this thing to fit, I've got an SFF PC (ex-office desktop DELL box) and the biggest GPU I could fit in there was a half height RX6400. Works well as a PC for my son. I can see this card fitting in a mini tower but that's not SFF.",
      "score": 7,
      "created_utc": 1736445236.0,
      "replies": [
        {
          "id": "m69gqj3",
          "author": "TrptJim",
          "body": "It has been redefined, in a way, with where the market is going. SFFPC in this context is for upper-range gaming machines and not for the typical small office box. \n\nCheck out /r/sffpc for where things are at today. There are a lot of options out there for compact cases that can fit huge graphics cards.",
          "score": 9,
          "created_utc": 1736446231.0,
          "replies": [
            {
              "id": "m69hp4u",
              "author": "EVMad",
              "body": "Thanks, I've seen cases where they origami a bunch of components into a tiny space including large GPUs. It's impressive for sure.",
              "score": 1,
              "created_utc": 1736446509.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m67z2tz",
      "author": "SuppleDude",
      "body": "Rubs his 4090 FE.",
      "score": 8,
      "created_utc": 1736429430.0,
      "replies": [
        {
          "id": "m6a6xof",
          "author": "CreaminFreeman",
          "body": "Rubs his EVGA 3080.",
          "score": 2,
          "created_utc": 1736453815.0,
          "replies": [
            {
              "id": "m6ag9bd",
              "author": "SuppleDude",
              "body": "Sold his 3080 to help pay for his 4090 FE 😎",
              "score": 1,
              "created_utc": 1736456536.0,
              "replies": [
                {
                  "id": "m6awo3c",
                  "author": "CreaminFreeman",
                  "body": "Respects that.",
                  "score": 2,
                  "created_utc": 1736461423.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m6a0wb8",
      "author": "fusionsofwonder",
      "body": "I love how that two-slot lunchbox is now considered \"compact\".",
      "score": 2,
      "created_utc": 1736452046.0,
      "replies": []
    },
    {
      "id": "m694eox",
      "author": "DYMAXIONman",
      "body": "Board partners need to get better about this. People don't want massive graphics cards.",
      "score": 4,
      "created_utc": 1736442670.0,
      "replies": [
        {
          "id": "m6a5wsh",
          "author": "korewednesday",
          "body": "Truth.  I wanted a 4090 REAL bad, but none of them would fit in my case (which in turn fits in my desk) so after years of just kicking the can down the road, I sighed and grabbed a 4080.\n\n\n… last… week… -_________-",
          "score": 1,
          "created_utc": 1736453516.0,
          "replies": [
            {
              "id": "m6uzih3",
              "author": "UltraAC5",
              "body": "why though",
              "score": 1,
              "created_utc": 1736737198.0,
              "replies": [
                {
                  "id": "m6vi3qm",
                  "author": "korewednesday",
                  "body": "Because something was going on this week I needed my desktop to participate in",
                  "score": 1,
                  "created_utc": 1736744502.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m6n47u3",
              "author": "_Life_Is_War_",
              "body": "Either you live under a rock or you didn't really care for the 50 series if you bought a 4080 last week",
              "score": 0,
              "created_utc": 1736631818.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m67yl1y",
      "author": "None",
      "body": "[deleted]",
      "score": 3,
      "created_utc": 1736429239.0,
      "replies": [
        {
          "id": "m680hoa",
          "author": "dark_sable_dev",
          "body": "It fits in a Dr.Zaber sentry, at least lengthwise. I think it's the extra inch of height above the PCIe bracket that dooms it for that case.\n\n\nIt should fit into an Ncase M2.",
          "score": 4,
          "created_utc": 1736429973.0,
          "replies": []
        },
        {
          "id": "m681yyo",
          "author": "dragongalas",
          "body": "I have 4090 ventus which is 322mm which barely fits in Dan a4-H2O. So having even smaller 5090 is a blessing.",
          "score": 1,
          "created_utc": 1736430531.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m6959pm",
      "author": "Magnemmike",
      "body": "ahhh the 5k series, I can finally dump my 2060super.",
      "score": 3,
      "created_utc": 1736442921.0,
      "replies": []
    },
    {
      "id": "m68xnmw",
      "author": "RCBing",
      "body": "But we haven't seen partners cards yet, that's a broad assumption \"is the only one that can comfortably fit in small form factor cases\".",
      "score": 2,
      "created_utc": 1736440710.0,
      "replies": [
        {
          "id": "m69sfyw",
          "author": "emorcen",
          "body": "Videos of partner cards are all over YouTube. -_-",
          "score": 2,
          "created_utc": 1736449598.0,
          "replies": []
        },
        {
          "id": "m6ficun",
          "author": "Liberator1177",
          "body": "A lot of companies have the cards on their websites. I was just browsing through MSI, Zotac, and Asus's 50 series cards yesterday. They are all posted.",
          "score": 2,
          "created_utc": 1736528837.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m682m3x",
      "author": "xGHOSTRAGEx",
      "body": "Meanwhile an actual public customer's PC case: \"hellfire\"",
      "score": 1,
      "created_utc": 1736430768.0,
      "replies": []
    },
    {
      "id": "m6a02fk",
      "author": "dernailer",
      "body": "\"Compact\" how do you put it on an Asus ROG? those portables are getting thicker?",
      "score": 1,
      "created_utc": 1736451804.0,
      "replies": []
    },
    {
      "id": "m6agcmm",
      "author": "mikebanetbc",
      "body": "Can’t wait for Ali Sayed from Optimumtech to jam it *into the [smallest case](https://youtu.be/C1rHpHN_3L0?si=ToQfL4S-N8iOflh2) he can find…*",
      "score": 1,
      "created_utc": 1736456562.0,
      "replies": [
        {
          "id": "m6uzmf8",
          "author": "UltraAC5",
          "body": "just wait until someone starts making waterblocks for the 5090 FE board(s)",
          "score": 2,
          "created_utc": 1736737237.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m6alp3o",
      "author": "karatekid430",
      "body": "Compact is the R9 Nano. Jeez Nvidia has gone off the rails. We don't want 600W GPUs.",
      "score": 1,
      "created_utc": 1736458131.0,
      "replies": []
    },
    {
      "id": "m6bmv21",
      "author": "Upper_Decision_5959",
      "body": "Is Nvidia the only one using liquid metal? Seems like the other venders aren't using liquid metal and just beefing up the cooling.",
      "score": 1,
      "created_utc": 1736470026.0,
      "replies": []
    },
    {
      "id": "m6cyteo",
      "author": "Leprichaun17",
      "body": "Amazing for those of us who don't ever get offered an FE option.",
      "score": 1,
      "created_utc": 1736487849.0,
      "replies": []
    },
    {
      "id": "m69ppuk",
      "author": "id_mew",
      "body": "The 4090 FE was the best looking IMO between all the models and run super cool and quiet.\nI'm hopeful that the 5090 FE follows the same route.",
      "score": 1,
      "created_utc": 1736448814.0,
      "replies": [
        {
          "id": "m6apogf",
          "author": "Candle1ight",
          "body": "I would sure hope so at a 2k price point.",
          "score": 1,
          "created_utc": 1736459305.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m6clj5y",
      "author": "dargonmike1",
      "body": "I’ll take their entire 5090 product lineup and sell it for 4k each easy profit",
      "score": -1,
      "created_utc": 1736482070.0,
      "replies": []
    },
    {
      "id": "m6999ga",
      "author": "ToMorrowsEnd",
      "body": "prefer if it was shorter to fit in 3U rackmount cases. all these things try to use the maximum height possible  lol@ the poors that dont rackmount their gaming pc.",
      "score": -2,
      "created_utc": 1736444083.0,
      "replies": []
    },
    {
      "id": "m69ia2o",
      "author": "Charliebrau",
      "body": "Where can I buy these?",
      "score": -2,
      "created_utc": 1736446677.0,
      "replies": []
    },
    {
      "id": "m699vqf",
      "author": "PrestigiousOnion3693",
      "body": "Just installed an RTX 5000 into a Dell 89whatever form factor. Moved the HDD. Installed extras for cooling, extra fans. Machine runs whisper quiet.",
      "score": -6,
      "created_utc": 1736444261.0,
      "replies": []
    }
  ]
}