{
  "post": {
    "title": "Garmin Owners Now Have To Pay To Unlock Features Thanks To Connect+",
    "author": "diacewrb",
    "id": "1jn9pqk",
    "score": 4022,
    "created_utc": 1743331111.0,
    "selftext": "",
    "num_comments": 632,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jn9pqk/garmin_owners_now_have_to_pay_to_unlock_features/"
  },
  "comments": [
    {
      "id": "mkiciun",
      "author": "TremendouslyRegarded",
      "body": "This model of business needs to die.   Only way to kill it is to stop buying it, which is why they resort to these scumbag tactics of selling it without these paywalls and introduce them later \n\nThe other alternative is to jailbreak these devices, if such an exploit even exists",
      "score": 1178,
      "created_utc": 1743338364.0,
      "replies": [
        {
          "id": "mklhrk0",
          "author": "Notgreygoddess",
          "body": "Coming from the generation that went from vinyl to 8-track, to cassette, to CD’s to streaming music; it’s nice having physical discs that corporations can’t delete or alter. We embraced many new technologies, but also had the bitter experience of giving up tv antennas for cable; promising it would be commercial free. It was a good lesson in there is no such thing as a free lunch.",
          "score": 156,
          "created_utc": 1743375394.0,
          "replies": [
            {
              "id": "mklnynt",
              "author": "hihcadore",
              "body": "Add in streaming services too",
              "score": 30,
              "created_utc": 1743377545.0,
              "replies": [
                {
                  "id": "mknrn0x",
                  "author": "BluejayCivil",
                  "body": "Ah you mean cable television with extra steps\n\n![gif](giphy|l1J9zYIsjPAyojfri|downsized)",
                  "score": 23,
                  "created_utc": 1743414490.0,
                  "replies": [
                    {
                      "id": "mks7rrz",
                      "author": "Dull-Lead-7782",
                      "body": "Cable bundled channels and services together under contracts. You’re free to leave streaming at anytime",
                      "score": 1,
                      "created_utc": 1743469193.0,
                      "replies": []
                    },
                    {
                      "id": "mky6gcj",
                      "author": "passwordstolen",
                      "body": "Hmmm, it’s called LIVE tv now. Dumbest name change ever.",
                      "score": 1,
                      "created_utc": 1743554474.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mknema6",
              "author": "Bdr1983",
              "body": "It's why I still buy physical media for the things I really care about. Certain artists, certain movies or TV-shows, I want to own the disc, just in case some corporate swine decides to delete everything",
              "score": 13,
              "created_utc": 1743405848.0,
              "replies": [
                {
                  "id": "mkobldt",
                  "author": "Notgreygoddess",
                  "body": "Not just corporations. Governments have been known to ban books, music, arts of all kinds.",
                  "score": 5,
                  "created_utc": 1743424465.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm05nb0",
              "author": "Panic-Fabulous",
              "body": "Free lunch if you become a pirate :)",
              "score": 1,
              "created_utc": 1744101975.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkmacuk",
          "author": "soonerfreak",
          "body": "Every industry where this exists there are options without it. I consider that when making choices.",
          "score": 11,
          "created_utc": 1743385910.0,
          "replies": [
            {
              "id": "mkoxkzf",
              "author": "FlankingCanadas",
              "body": "Part of why people are so mad at Garmin about this is that up until now they were that choice that existed without a subscription. That was part of the reason to buy a Garmin over other brands.",
              "score": 8,
              "created_utc": 1743432061.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkl89lm",
          "author": "darthcaedusiiii",
          "body": "People in large groups are really dumb.",
          "score": 34,
          "created_utc": 1743372043.0,
          "replies": [
            {
              "id": "mklni9i",
              "author": "Wakkit1988",
              "body": "A person might be smart, but people are dumb.",
              "score": 15,
              "created_utc": 1743377385.0,
              "replies": [
                {
                  "id": "mkn1p6j",
                  "author": "ErichPryde",
                  "body": "-Agent K",
                  "score": 2,
                  "created_utc": 1743398111.0,
                  "replies": []
                },
                {
                  "id": "mknpu6u",
                  "author": "MagicalTrevor42021",
                  "body": ">Kay: A person is smart. People are dumb, panicky, dangerous animals...",
                  "score": 2,
                  "created_utc": 1743413348.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mkmb3im",
          "author": "Chimbo84",
          "body": "This is why open source is so important. There’s a big blowup in 3D printing with Bambu Labs pulling the same shit and locking down functionality albeit not behind a paywall.",
          "score": 5,
          "created_utc": 1743386193.0,
          "replies": [
            {
              "id": "mkoqt5g",
              "author": "zAbso",
              "body": "That big blow up is because people spread misinformation and speculation. There is nothing they're locking down in regards to functionality. They want to introduce safety features by limiting direct access to the printer from non-signed applications. In doing that though, they provided a middle man application so that users can continue using other slicers to prep their files, they just won't be able to talk directly to the printer anymore. At least that was the case before they backpedaled a little and added Developer mode options, but made it clear that it's on the user if something goes wrong.\n\nIn other words, they don't want potential malicious actors to have unrestricted access to someones printer anymore. If you think people can govern themselves accordingly, watch this [video](https://www.youtube.com/watch?v=Kr6SHYour3E) of a guy downloading Orca slicer from a non-affiliated site and connect it directly to his printer, thinking he was doing things correctly. The whole point of his video was to act in defiance to the coming, optional, firmware update. Even trying to show others how to do it. All the while he acted as the perfect example as to why they'd want to do these changes to begin with. The average person does not know how to protect themselves or their tech.\n\nThere's more to it with a change in their TOS verbiage, but it's literally them saying they'll be doing what most other hardware companies do when installing firmware updates. We see it all the time, but people suddenly forgot how their other tech works. People that don't understand, or simply want to hate on the company, tried to spin it into something that it never was.\n\nIf you want an example of what could go wrong, here's a post of someone that recently [lost their home](https://www.reddit.com/r/3Dprinting/comments/1jnuju1/rqiditech3d_permanently_banned_me_for_warning/) due to faulty components.",
              "score": -1,
              "created_utc": 1743429931.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkl741e",
          "author": "thisischemistry",
          "body": "> The other alternative is to jailbreak these devices\n\nOr just never update them.",
          "score": 10,
          "created_utc": 1743371652.0,
          "replies": [
            {
              "id": "mklf3hl",
              "author": "shotdeadm",
              "body": "Mine updated overnight or when charging. A POS. I will change to something else non American soon anyway.",
              "score": 21,
              "created_utc": 1743374455.0,
              "replies": []
            },
            {
              "id": "mkl9n5k",
              "author": "OpenSourcePenguin",
              "body": "No the other way is better",
              "score": 5,
              "created_utc": 1743372517.0,
              "replies": [
                {
                  "id": "mkla8kt",
                  "author": "thisischemistry",
                  "body": "Generally, I'm not paying for a device that I have to update or hack to make it work properly. It either works well from the start or I return it. We need to demand more from the people who make our devices.",
                  "score": 1,
                  "created_utc": 1743372726.0,
                  "replies": [
                    {
                      "id": "mklb1ec",
                      "author": "OpenSourcePenguin",
                      "body": "See you are considering updating as just bug fixes\n\nSometimes updates add features too (unannounced, unpromised) . It has become rare but that is a possibility.",
                      "score": 2,
                      "created_utc": 1743373007.0,
                      "replies": [
                        {
                          "id": "mklp412",
                          "author": "thisischemistry",
                          "body": "Yes, that's always a possibility. You have to judge it on a case-by-case basis but lately companies seem to add complexity and annoyances rather than improve their products. Generally, I'll turn off updates and keep an eye on new ones that are announced. If they look good then I'll consider updating.",
                          "score": 2,
                          "created_utc": 1743377950.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mknchy9",
                      "author": "ElfjeTinkerBell",
                      "body": "What about security updates? New risks pop up every day",
                      "score": 1,
                      "created_utc": 1743404472.0,
                      "replies": [
                        {
                          "id": "mkohtc3",
                          "author": "thisischemistry",
                          "body": "There's hardly any risk if you don't connect the device directly to the internet, at that point you're looking at local risks and they are very unlikely on a device like this. \n\nThe article shows a watch and I believe these don't have a cellular modem in them so they work through your phone. Your phone OS should certainly be updated to the latest security updates and it should serve as the watch's gateway to the internet. Any app that connects from your phone to the watch should be properly sandboxed to protect it from exploits.\n\nSecurity updates on a watch connected like this are not likely to be necessary in any major way. I'm sure they can serve as vectors for attacks but they are likely to be minor concerns compared to the bigger targets such as phones and computers.\n\nAs usual, you have to evaluate each device and judge the risks accordingly. It's like traveling, each mode of transportation has its risks and benefits. Do you use a roll cage, three point harness, helmet, protective gear, and such when you're driving your car to work? Sure, it's safer but it's overkill. On the other hand, if you work as a Formula 1 driver then it makes total sense.",
                          "score": 0,
                          "created_utc": 1743426842.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mklmpr8",
          "author": "YourLocalTechPriest",
          "body": "shy quicksand plants ten shocking consider wrench sand quickest literate\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 1,
          "created_utc": 1743377103.0,
          "replies": []
        },
        {
          "id": "mkn81f6",
          "author": "Nasa_OK",
          "body": "I remember back when apple charged for major iOS updates. My iPod touch gen 2 had Bluetooth but in order to use it I needed to pay ~$16 to update to iOS 3 or 4",
          "score": 1,
          "created_utc": 1743401731.0,
          "replies": []
        },
        {
          "id": "mknvobg",
          "author": "worotan",
          "body": "The only effective way to protest in our society is to stop buying things.\n\nIt’s crazy that people refuse to believe that.\n\nEspecially when it is the only way to tackle climate change - as asserted by every serious climate scientist.",
          "score": 1,
          "created_utc": 1743416879.0,
          "replies": []
        },
        {
          "id": "mkrgrcq",
          "author": "Away_Media",
          "body": "Funny because Wearables are kind of dying. It may be the reason they are doing this.",
          "score": 1,
          "created_utc": 1743459653.0,
          "replies": []
        },
        {
          "id": "mkszaj6",
          "author": "Dhegxkeicfns",
          "body": "Too bad. Garmin was an interesting player in the dive computer industry, but that ends very abruptly with a single move like this.",
          "score": 1,
          "created_utc": 1743480112.0,
          "replies": []
        },
        {
          "id": "mkiyiil",
          "author": "LetsJerkCircular",
          "body": "I’m conflicted. The article explains that the plus plan offers stuff in addition to what’s already free. As in, it would not exist without the added cost.\n\nIf the services included with the cost of the device remain decent, and the services included with the premium subscription satisfy demands of users, then there’s nothing to fault.\n\nIf—like people are expressing worries about—Garmin starts moving formerly-included features to the other side of the pay-wall, then they should absolutely suffer out of principle.\n\nExcessive greed should die, and I’m right there with anyone else who’s trying to suffocate it.",
          "score": -60,
          "created_utc": 1743346573.0,
          "replies": [
            {
              "id": "mkjn0f8",
              "author": "Oops_I_Cracked",
              "body": "I think the part of the response you’re ignoring is that there were already *plenty* of fitness tracking devices available with subscriptions and Garmin devices tend to be a bit more expensive relative to devices with identical hardware, but they did not have a subscription. So people sort of thought that was what they weee buying into. Paying a bit more upfront with the knowledge there is no subscription to access features their device supports, even if that was never explicitly stated. \n\nPeople are upset because Garmin was basically the last “buy once” option left in the fitness tracking space. Pretty much everyone else already required a sub to unlock all the features. Garmin grew themselves an anti-subscription fan base and then introduced a subscription.",
              "score": 58,
              "created_utc": 1743354268.0,
              "replies": [
                {
                  "id": "mkjrmc3",
                  "author": "LetsJerkCircular",
                  "body": "That makes sense. I was pretty unfamiliar with Garmin’s included features. The article made the subscription seem reasonable, and added caution for the future but no alarm yet.\n\nIf a company makes a product that is good quality and lasts a long time, it makes sense that they’d look for some recurring revenue to pay for the services they offer. Otherwise, they would rely on device sales to pay for everything.\n\nI’ve had an Apple Watch for seven years, and don’t pay for Fitness Plus. The free features work for me. But, most Garmin Watch users I’ve spoken with did tout it as a superior product for people who are into fitness, outdoors, etc.\n\nPlease accept my adjacent, dispassionate take, everyone in the thread.",
                  "score": 5,
                  "created_utc": 1743355666.0,
                  "replies": [
                    {
                      "id": "mkk38x1",
                      "author": "OriginalUseristaken",
                      "body": "The thing is, you don't need any server or other stuff Garmin has to pay for. The app is on my mobile device, it connects to the watch, that's it.",
                      "score": 4,
                      "created_utc": 1743359161.0,
                      "replies": []
                    },
                    {
                      "id": "mkkj5e3",
                      "author": "Oops_I_Cracked",
                      "body": "Apple is a bit different because part of the Apple Watch is supporting their whole ecosystem. If the *best* wearable exclusively works with their own phones, you’re more likely to get an iPhone if you want a smart watch. If you get an iPhone they get any ad and/or purchase revenue you generate in apps on your phone. So Apple does not care if you get Fitness+ as much as say Samsung or now Garmin care if you get their subs. \n\nAnd I can tell you firsthand this works. After trying many different wearables on android I ended up switching to the iPhone so I could have an Apple Watch because I was very interested in trying what was generally regarded as the best wearable.  And I am now relatively locked into their ecosystem.",
                      "score": 2,
                      "created_utc": 1743364052.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mkjzkio",
                  "author": "ZiKyooc",
                  "body": "From the article description, the paid service is on top of what they were already offering and it doesn't seem that the basic functions will be phased out. I have a Fenix 6 and I have no interest in the paid functionalities.",
                  "score": 4,
                  "created_utc": 1743358032.0,
                  "replies": [
                    {
                      "id": "mkki0x6",
                      "author": "Oops_I_Cracked",
                      "body": "On existing hardware yes. But Pandora’s box is now open.",
                      "score": 9,
                      "created_utc": 1743363702.0,
                      "replies": [
                        {
                          "id": "mkkmhhk",
                          "author": "juniorone",
                          "body": "This is the flaw with people. They get smacked all the time but believe that the other one is unique and won’t follow the same trajectory. \n\nThe reality is that the pandora box is open. From all  the history of capitalism, you can already expect that they will eventually follow what others are doing. Why? Because it’s profitable. \n\nIt’s like when the ex president wanted to raise the minimum federal wage. Tons of states came out with the propaganda that it will lead to higher prices of goods. So it got dropped. What happened? Price of goods doubled while the minimum wage stayed the same. This problem repeats so much that I don’t understand why people fall for that shit.",
                          "score": 4,
                          "created_utc": 1743365080.0,
                          "replies": [
                            {
                              "id": "mkl4lg9",
                              "author": "alxrenaud",
                              "body": "In a way, you are saying they were right.\n\nCompanies got away with increasing prices without increasing wages. They got some flack and blamed the cost of material, international supply chain issues, the pandemic, etc (which is not all wrong by the way, let's be realistic). Now they would increase it again and blame the wages.\n\nEveryone against capitalism always say it \"the revenues need to grow each year\". Pretty easy, either you cut costs or you increase the price.\n\nEarly on, subscriptions were even fine. Nobody could afford Photoshop before, so wither you stole it or you made without. Subs helped a lot of people to amortize the cost.\n\nStreaming services make sense, even if they increase the price all the time, they are still 20-30% of the price of cable (where I live, for the full 4k no ads). \n\nFor Garmin... eh. I really cannot think of what more I could need that they could hide behind a paywall... unless they want to compete against Strava or something (which I would also never pay for).\n\nI'll.give the the benefit of the doubt for now (already have a watch, not much I can do). As long as they keep the paywall for useless AI features and badges, good for them and whoever thinks it's worth it. If they release a new flagship watch and you have to pay for anything that is currently free, I will not buy it, simple as that.",
                              "score": 1,
                              "created_utc": 1743370812.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mkmy01o",
                          "author": "ZiKyooc",
                          "body": "I had a Fitbit some time ago which has subscription options for years and it was entirely possible to use it without the subscription",
                          "score": 1,
                          "created_utc": 1743396173.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mklko3r",
                      "author": "devolute",
                      "body": "Enjoy the features you already have but with slowly increasing nagging to upgrade.",
                      "score": 1,
                      "created_utc": 1743376393.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mkjpsah",
              "author": "StarGazer_SpaceLove",
              "body": "Ancestry is a great example of this exactly. You signed up for free to access a plethora of data and tree building, and you purchased extras like DNA testing or world records. Then, they locked all records, making the hints useless unless you subscribe. Then, they started locking bits and pieces of the DNA tools. Now, it's basically entirely useless unless you have a subscription. Half the links then also require you to have, at minimum, an account or another subscription to access the actual data linked. You can see your DNA matches, your trees, and a few comp tools still, but for record searching, you gotta sub an arm and a leg across 2000 accounts to do anything worthwhile anymore",
              "score": 6,
              "created_utc": 1743355105.0,
              "replies": []
            },
            {
              "id": "mkiyu6m",
              "author": "Lyelinn",
              "body": "Yeah yeah. Next they’ll start locking basic features because “haha need more money”, then what? They are already a pricy product.",
              "score": 28,
              "created_utc": 1743346681.0,
              "replies": [
                {
                  "id": "mkizcwp",
                  "author": "LetsJerkCircular",
                  "body": "It’s right there in the third section of my comment. Please read stuff, instead of lashing back so quickly. I do not support Garmin one way or the other, and I don’t subscribe to very many services. But, I do pay for some stuff that has value to me.",
                  "score": -3,
                  "created_utc": 1743346849.0,
                  "replies": [
                    {
                      "id": "mkjnb65",
                      "author": "Newspeak_Linguist",
                      "body": ">Please read stuff, instead of lashing back so quickly.\n\nIt's because you're bloviating about simple concepts everyone understands.   We all know what Garmin says they're going to do, and we all know what we expect them to do.  So people are complaining about it. \n\nThe article says there will be special badges on the paid plan.  Fucking badges.  Clip art.  There aren't added costs for making new badges, its a money grab.  If this subscription plan doesn't fail spectacularly there will be currently free features moved to the paid plan within 1 - 2 years.",
                      "score": 10,
                      "created_utc": 1743354360.0,
                      "replies": []
                    },
                    {
                      "id": "mkjysk7",
                      "author": "vadapaav",
                      "body": "This is a very standard model of industry where the existing (\"free\") version continuously keeps getting badly managed, lacks feature updates and regular maintenance with users eventually passively motivated to buy a \"maintained\" software",
                      "score": 2,
                      "created_utc": 1743357797.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mkjhz3e",
              "author": "TremendouslyRegarded",
              "body": "That’s a rational take, I guess Reddit disagrees… I mostly take issue with the pay per month model in general though.. sell me a gadget for one up front cost, features should never be a subscription imo, with rare exceptions for things like cell data or something outside of simple software features",
              "score": 9,
              "created_utc": 1743352715.0,
              "replies": [
                {
                  "id": "mkjyejq",
                  "author": "vadapaav",
                  "body": ">sell me a gadget for one up front cost, features should never be a subscription imo, with rare exceptions for things like cell data or something outside of simple software features\n\nWhich is exactly what Garmin does, their top of the line watches are very expensive and absolutely rock solid packed with everything I need. \n\nI already paid the high price upfront, if not I would have settled for an apple watch",
                  "score": 2,
                  "created_utc": 1743357682.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mkjtl4y",
          "author": "None",
          "body": "This is literally just for an AI service on the device hahahah. People are so reactionary.",
          "score": -14,
          "created_utc": 1743356255.0,
          "replies": [
            {
              "id": "mkjxdym",
              "author": "fuzzybunnies1",
              "body": "So I'd have to pay extra to activate the feature I don't want to begin with? That sounds reasonable. My current Garmins were expensive enough I'm still waiting another gen before they get replaced if even then.",
              "score": 5,
              "created_utc": 1743357380.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mkhznt2",
      "author": "computerman10367",
      "body": "Nice! A new company to add to the don't give them money list!",
      "score": 1576,
      "created_utc": 1743331679.0,
      "replies": [
        {
          "id": "mki5wbz",
          "author": "None",
          "body": "I have a feeling that a lot of great (previously included) features are going to get slowly tucked behind this paywall. Garmin's whole upside was the fact that you bought the device and you owned it fully. Truly unfortunate.",
          "score": 734,
          "created_utc": 1743335156.0,
          "replies": [
            {
              "id": "mkibog1",
              "author": "crosswatt",
              "body": "You know, I used to laugh at old people who refused to adapt new technology, or who stuck with the entertainment of their youth instead of experiencing new and innovative music and movie and TV offerings, but at this stage of my life I'm actually starting to understand it.",
              "score": 382,
              "created_utc": 1743337982.0,
              "replies": [
                {
                  "id": "mkid49c",
                  "author": "lemonade_eyescream",
                  "body": "**We** have reasons - good ones - for avoiding CERTAIN types of tech, shit that's consumer hostile. Those luddites simply knee jerked anti any progress because they simply didn't want to adapt. Not the same at all.",
                  "score": 157,
                  "created_utc": 1743338630.0,
                  "replies": [
                    {
                      "id": "mkieepg",
                      "author": "ReaditTrashPanda",
                      "body": "I dunno. Let’s look at music players. Every subsequent generation made the current one less usable. Same thing. Records to tapes to cds. Wasted all your money… only for someone to come along and say you need to repurchase everything for the new system. \n\nThis subscription model for everything is disgusting though. Literally becoming slaves who own nothing and work 80% of your life to survive. Just because we aren’t building pyramids people seem ok with it",
                      "score": 129,
                      "created_utc": 1743339187.0,
                      "replies": [
                        {
                          "id": "mkinjb0",
                          "author": "Shadowlance23",
                          "body": "About 5 years ago (when Netflix actually had good movies and Disney+ was cheap enough you were fine to add it as an extra) I looked at my DVD/Blu-Ray collection and was sad it wasn't getting used.\n\nNow, I'm considering making a new cabinet because my current ones are full and I need more storage. It's so nice having a desire to watch a film and not having to Google what service I need to subscribe to in order to watch it.",
                          "score": 59,
                          "created_utc": 1743342812.0,
                          "replies": [
                            {
                              "id": "mkirjfp",
                              "author": "A911owner",
                              "body": "This is what I liked about the DVD by mail service. They had virtually any movie I ever wanted to watch available in one place. I saw over 1,000 movies when I had that service.",
                              "score": 27,
                              "created_utc": 1743344221.0,
                              "replies": [
                                {
                                  "id": "mkjzdea",
                                  "author": "caller-number-four",
                                  "body": "> This is what I liked about the DVD by mail service.\n\nRestart it!\n\nhttps://www.dvdinbox.com\n\nThey're not as deep as Netflix was.  But they do have a lot, especially older stuff and wait times aren't terrible (a lot slower than Netflix was, but not by much).",
                                  "score": 9,
                                  "created_utc": 1743357972.0,
                                  "replies": [
                                    {
                                      "id": "mkn61y4",
                                      "author": "KingOfNohr",
                                      "body": ">a lot slower than Netflix was, but not by much\n\nA lot slower, but not much slower? 🤔",
                                      "score": 7,
                                      "created_utc": 1743400560.0,
                                      "replies": [
                                        {
                                          "id": "mkni9m8",
                                          "author": "Dipsey_Jipsey",
                                          "body": "In tree years.",
                                          "score": 1,
                                          "created_utc": 1743408277.0,
                                          "replies": [
                                            {
                                              "id": "mknk02x",
                                              "author": "Zeromius",
                                              "body": "Tree fiddy?",
                                              "score": 1,
                                              "created_utc": 1743409458.0,
                                              "replies": []
                                            }
                                          ]
                                        },
                                        {
                                          "id": "ml0ho7l",
                                          "author": "caller-number-four",
                                          "body": "Netflix would move your shipping center around to different areas depending on the movies you ordered.\n\nAnd then, as they collapsed shipping centers shipping became longer and longer and longer.",
                                          "score": 1,
                                          "created_utc": 1743597134.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mkisubh",
                                  "author": "porkchop_d_clown",
                                  "body": "It really hurt when I realized Netflix was letting the DVD delivery business fade away. The final few years, Netflix wasn’t even bothering to replace worn DVDs. Most of the DVDs I got were so scratched I’d end up trying to polish them myself just to make them watchable.",
                                  "score": 16,
                                  "created_utc": 1743344665.0,
                                  "replies": [
                                    {
                                      "id": "mkitabc",
                                      "author": "A911owner",
                                      "body": "I noticed that as well; towards the end if I got a damaged DVD, they would just send me the next one on my list. Or it would come from a distribution center 1,000 miles away.",
                                      "score": 12,
                                      "created_utc": 1743344819.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mkjiaq7",
                              "author": "widowhanzo",
                              "body": "> It's so nice having a desire to watch a film and not having to Google what service I need to subscribe to in order to watch it. \n\n\nYou get the same experience with piracy.",
                              "score": 15,
                              "created_utc": 1743352817.0,
                              "replies": [
                                {
                                  "id": "mkjw3ag",
                                  "author": "TooStrangeForWeird",
                                  "body": "I hooked the neighbor kid up with access to my Jellyfin server. If he wants me to add something he just texts me and asks. I search the torrent, grab the magnet link, and send it to a Tixati instance. One is for movies and one is for TV shows. When it's done it just shows up on the Jellyfin site under \"recently added\". It takes me maybe two minutes and it just does the rest by itself.",
                                  "score": 11,
                                  "created_utc": 1743357002.0,
                                  "replies": [
                                    {
                                      "id": "mkkbn9t",
                                      "author": "Prenutbutter",
                                      "body": "Usenet is the way to go. Set up the arr suite and use a front end like overseerr and then he can sign in using jellyfish/plex creds and request it himself. It takes care of the rest for you.",
                                      "score": 2,
                                      "created_utc": 1743361716.0,
                                      "replies": [
                                        {
                                          "id": "mkkmpdw",
                                          "author": "TooStrangeForWeird",
                                          "body": "I was looking into these, but I don't trust him not to grab some Blu-ray 4k rips or some shit lol. I could fit like 20 movies into the space those take!",
                                          "score": 6,
                                          "created_utc": 1743365147.0,
                                          "replies": [
                                            {
                                              "id": "mkkrqkg",
                                              "author": "Prenutbutter",
                                              "body": "You can set the quality of the requests. It’ll only download what you set it to.",
                                              "score": 2,
                                              "created_utc": 1743366681.0,
                                              "replies": [
                                                {
                                                  "id": "mklc7cw",
                                                  "author": "TooStrangeForWeird",
                                                  "body": "Didn't know that, interesting.",
                                                  "score": 2,
                                                  "created_utc": 1743373419.0,
                                                  "replies": [
                                                    {
                                                      "id": "mkmjym2",
                                                      "author": "massive_cock",
                                                      "body": "This or a couple other ways to accomplish the same thing. My tech illiterate mom can just punch in a title, pick it from the results list, and that's it, with all her downloads limited to 720p because she only watches old sitcoms from the 80s and similar. If it's the rare occasion she does want a new movie or something else in higher quality there's a button to request that and I'll manually approve it.",
                                                      "score": 1,
                                                      "created_utc": 1743389700.0,
                                                      "replies": [
                                                        {
                                                          "id": "mkqe6ds",
                                                          "author": "TooStrangeForWeird",
                                                          "body": "I mean for new stuff I could always hook him up on popcorn time, the app works great actually.",
                                                          "score": 1,
                                                          "created_utc": 1743447782.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mklmiwo",
                                  "author": "yarash",
                                  "body": "There was a brief time there where I didnt have to pirate things. Ah well, its literally their loss. \n\nI have a dollar amount in mind, once it gets exceeded, I'm not going to pay.",
                                  "score": 3,
                                  "created_utc": 1743377036.0,
                                  "replies": []
                                },
                                {
                                  "id": "mkjuw5j",
                                  "author": "trainbrain27",
                                  "body": "And if you download a file, you can keep it forever, and VLC will probably play it forever.",
                                  "score": 4,
                                  "created_utc": 1743356647.0,
                                  "replies": [
                                    {
                                      "id": "mkk3wml",
                                      "author": "widowhanzo",
                                      "body": "And no buffering!\n\n\nOnce I downloaded Grand Tour even though I had a Prime subscription, because the Prime app interface was awful and it kept buffering the video every few minutes, it was really affecting the experience. 15 minutes later and we were enjoying a lag-free experience straight from my NAS.",
                                      "score": 3,
                                      "created_utc": 1743359364.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mkkbu80",
                          "author": "TheLuminary",
                          "body": "Going to hard disagree with you.\n\n\\- Records -> Tapes was a huge usability upgrade. (I don't know anyone who had a record player in their car)  \n\\- Tapes -> CDs was a huge music quality, density and durability upgrade. Especially once we got anti-skip features figured out.  \n\\- CDs -> MP3s was the best upgrade and IMO when the music playing capped out. Having a 20 GB hard drive in your trunk and having access to thousands of songs was amazing.\n\nEverything after that, has been pretty bad, but mostly optional. You don't have to use subscription music if you don't want to.",
                          "score": 11,
                          "created_utc": 1743361774.0,
                          "replies": [
                            {
                              "id": "mko42if",
                              "author": "tooclosetocall82",
                              "body": "You don’t know anyone with a record player in their car because it never really made it out of the R&D stage because of the downsides. However missing from this conversation are formats like 8-tracks. There were definitely some misfires that wasted the money of those who bought into them. We just mostly remember the successful ones.",
                              "score": 2,
                              "created_utc": 1743421223.0,
                              "replies": []
                            },
                            {
                              "id": "mkoctci",
                              "author": "Notgreygoddess",
                              "body": "What sucked when vinyl went to CDs was original artists “remastering” classic songs. So many lost the raw excitement of the original, as artists fifty year old selves “fixed” what their 20 old selves had produced.",
                              "score": 1,
                              "created_utc": 1743424949.0,
                              "replies": [
                                {
                                  "id": "mkpfr7e",
                                  "author": "TheLuminary",
                                  "body": "I agree with this, but this is not inherit in improving the music playing generation.\n\nIt is just artists taking advantage to gut their legacy.",
                                  "score": 1,
                                  "created_utc": 1743437536.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mkiv5b3",
                          "author": "goodnames679",
                          "body": "Tbf there were legitimate improvements with each step, though. Records were very non-portable and couldn't be played in cars, so tapes made sense. Tapes weren't very dense, so CDs as an upgrade made sense (and you didn't really have to replace your tape player immediately, since tape players remained in cars till like the mid '00s). MP3 players were *absurdly* more dense and could hold your whole library in one device, plus you could add your music from your tapes/CDs to them pretty easily. Streaming services reduced the hassle of transferring/downloading songs and organizing your library, plus the upfront cost was gone. If you add at least 1/2 a CD's worth of music to your library per month, you come out ahead by using a music streaming service.\n\nWhat we're seeing currently with much of the tech world is a complete *worsening* of their product with practically no upside. It's a hell of a lot worse.",
                          "score": 33,
                          "created_utc": 1743345447.0,
                          "replies": [
                            {
                              "id": "mkkznxv",
                              "author": "artgriego",
                              "body": "That's the only thing left to do - worsen the product, raise prices, or some combination. Durability, portability, bandwidth, and fidelity are as good as they'll get; how will companies keep revenues going? Enshitification.",
                              "score": 3,
                              "created_utc": 1743369187.0,
                              "replies": []
                            },
                            {
                              "id": "mkivzui",
                              "author": "ReaditTrashPanda",
                              "body": "Depends. Garmin gives you a Lot of data that watches historically never did. It’s becoming the “norm” but not a requirement. Some would argue this is improvement over basic watches that don’t show heart rate or other exercise metrics… so devils advocate says it’s justified they charge regularly for features above and beyond the standard basic watches",
                              "score": 0,
                              "created_utc": 1743345735.0,
                              "replies": [
                                {
                                  "id": "mkiykku",
                                  "author": "goodnames679",
                                  "body": "Sure, there are still cases where you're getting more for the subscription fees. I'm more specifically talking about the widespread pandemic of companies taking existing features/products and locking them behind subscriptions, though. \n\nAnd honestly, in this specific instance... nothing they listed sounds like it's actually worth the subscription fee. For now you don't *have* to have the subscription, but often in situations like this they're testing the waters before they introduce future products that do require the sub just to function.",
                                  "score": 11,
                                  "created_utc": 1743346593.0,
                                  "replies": [
                                    {
                                      "id": "mkj0nr6",
                                      "author": "ReaditTrashPanda",
                                      "body": "It’s required now* it sounds like. It’s locked away behind the Connect+ option. \n\nWild honestly. I was thinking of switching away from Apple and garmin battery life is stellar. But this totally ruins that. Infinite payments for a watch that goes bad in 2-3 years from battery degradation is not worth it",
                                      "score": 4,
                                      "created_utc": 1743347271.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mkikw3r",
                          "author": "seamonkey420",
                          "body": "unless you were old school and stayed with MP3/FLAC and never went streaming. i have a huge NAS, i am my own streaming services ;)",
                          "score": 15,
                          "created_utc": 1743341823.0,
                          "replies": [
                            {
                              "id": "mkj50e1",
                              "author": "computerman10367",
                              "body": "I still use my zune... I replaced the hdd in it a few months ago.",
                              "score": 5,
                              "created_utc": 1743348658.0,
                              "replies": [
                                {
                                  "id": "mkjefqg",
                                  "author": "seamonkey420",
                                  "body": "nice!! i had a zune back the in day and it was solid. i have an sony walkman mp3 player i somehow won new a few years ago from sony's twitter account and have it loaded up with 500GB of flac and high bitrate mp3 goodness!! :)",
                                  "score": 2,
                                  "created_utc": 1743351599.0,
                                  "replies": [
                                    {
                                      "id": "mkk5hjw",
                                      "author": "OttawaTGirl",
                                      "body": "I knew a guy who was a VP at a big tech company who got lots of freebies. He had a stack of RCA HD mp3 (the tech that jobs leased for the first ipods) players that had his library. He refused to buy mp3s he simply digitized his own CDs. \n\nHis attitude was he bought the files on CD. He didn't need to pay for anything as he already had it.",
                                      "score": 3,
                                      "created_utc": 1743359847.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mkjaprg",
                          "author": "ababcock1",
                          "body": "\\>Records to tapes to cds\n\nHave you ever tried to play a record in a car? Or while walking? It's truly bizarre to say that a CD is \"less useable\" than a vinyl record.",
                          "score": 5,
                          "created_utc": 1743350434.0,
                          "replies": [
                            {
                              "id": "mkqeiq2",
                              "author": "EvaCassidy",
                              "body": "They did have car record players I think in the 60s.  But it didn't last long.",
                              "score": 1,
                              "created_utc": 1743447886.0,
                              "replies": [
                                {
                                  "id": "mkrko0e",
                                  "author": "ababcock1",
                                  "body": "Admittedly I was asking a leading question. They didn't last long because they sucked horribly. They skipped constantly and potholes would result in the needle slamming down into the record.",
                                  "score": 1,
                                  "created_utc": 1743461007.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mkjb965",
                              "author": "ReaditTrashPanda",
                              "body": "No, a record is less usable than a cd. Just like a cd is less usable than an mp3 by storage limitations. And mp3 is less usable than streaming with access to tens of millions of albums. It’s the same progression in the same direction I think",
                              "score": -1,
                              "created_utc": 1743350604.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mkky97v",
                          "author": "artgriego",
                          "body": "There's a joke in Men in Black when K reveals a new alien technology that's about to replace CDs, and laments \"guess I'll have to buy The White Album again...\"\n\n  \nAs a kid I didn't understand that he must have bought the record, the tape, the CD...now I get it.\n\nAt least with digital technology, we have ways to flawlessly preserve the content.",
                          "score": 4,
                          "created_utc": 1743368730.0,
                          "replies": []
                        },
                        {
                          "id": "mklup4g",
                          "author": "mug3n",
                          "body": "Yeah the collective has largely decided that the convenience outweighs ownership of digital media.  So that's where we are.\n\nBut personally I've decided to hold a cache of movies/TV shows/audiobooks/ebooks that is out of the reach of the walled gardens of the big media companies so I am not beholden to their whims whenever they decide they can stop access to content I paid for.",
                          "score": 1,
                          "created_utc": 1743379969.0,
                          "replies": []
                        },
                        {
                          "id": "mkikl9z",
                          "author": "thegreatgazoo",
                          "body": "The subscription model for music seems better.  Have use of all the music for $72/year or to have 4 to 6 albums for that same amount seems like a better deal, especially with all of the format changes (8 tracks) over the years. \n\nBut for things like car features that don't have an external cost like heated seats vs internet access, that doesn't make sense.",
                          "score": -1,
                          "created_utc": 1743341706.0,
                          "replies": [
                            {
                              "id": "mkimzmn",
                              "author": "cosmos7",
                              "body": "> The subscription model for music ... seems like a better deal\n\nUntil that subscription decides not renew licensing for the artists you like, artist gets pulled into a different subscription tier or production company entirely, or they intentionally blacklist for some reason.\n\nThat's happening with increasing frequency for TV...",
                              "score": 17,
                              "created_utc": 1743342614.0,
                              "replies": [
                                {
                                  "id": "mkirh9w",
                                  "author": "zkyevolved",
                                  "body": "Not to mention different music companies could get different versions of the album you like or exclusive songs / versions. Or songs get removed permanently for weird reasons.",
                                  "score": 3,
                                  "created_utc": 1743344200.0,
                                  "replies": [
                                    {
                                      "id": "mkkys9m",
                                      "author": "artgriego",
                                      "body": "Bingo, I've seen sneaky little edits on YouTube movies to cut out just a little bit of gore or sex that someone decided went a little too far. Fuck all that.",
                                      "score": 3,
                                      "created_utc": 1743368900.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mko4pr0",
                                      "author": "tooclosetocall82",
                                      "body": "That happened with physical media too. There would be tracks exclusive to stores so it’d be impossible to buy the entire album. Then some store * cough * Walmart * cough * would edit all their music so you weren’t buying the actual album at all.",
                                      "score": 2,
                                      "created_utc": 1743421518.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mkio6bj",
                              "author": "idiot-prodigy",
                              "body": "> The subscription model for music seems better. Have use of all the music for $72/year \n\nExcept when companies lose the license to the music and your library gets nuked.  \n\nThis has already happened to people who collected digital libraries of films by purchasing licenses.  The company inevitably folds, and the access to your library is gone.  \n\nHard copies, or locally stored digital copies are the only insurance against this.",
                              "score": 10,
                              "created_utc": 1743343041.0,
                              "replies": [
                                {
                                  "id": "mkiqs7d",
                                  "author": "thegreatgazoo",
                                  "body": "Generally that's when people \"buy\" digital copies on top their subscription. For instance, \"buying\" a movie or book on Amazon Prime.  Those are at risk of disappearing.  But physical media fails as well. A record or CD can get scratched.  A tape can stretch. The devices that can play them can be discontinued.",
                                  "score": 7,
                                  "created_utc": 1743343961.0,
                                  "replies": [
                                    {
                                      "id": "mkiwb1e",
                                      "author": "RevaFloyd",
                                      "body": "Yeah, but you're not actively destroying your owned physical medias compared to owned digital medias that depends on the providers that actively looking for more money.",
                                      "score": 4,
                                      "created_utc": 1743345840.0,
                                      "replies": [
                                        {
                                          "id": "mkjkbyg",
                                          "author": "thegreatgazoo",
                                          "body": "Sure. But compared to say the Blockbuster model of charging about 1/3rd of retail to rent a movie and screwing you over if you kept it too long, digital is a bargain. \n\nTo me, I'd rather rent movies and music because for movies I generally don't watch them more than once, and I get bored of albums pretty quickly. Plus the media takes a lot of space and generally has a lousy resale value. \n\nThat said, if I was a collector, I'd absolutely want physical copies. In particular your can hand them down to descendants when you pass. Though personally my parents' CD collection went in the trash she passed.",
                                          "score": 1,
                                          "created_utc": 1743353449.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mkipvdy",
                              "author": "scottygras",
                              "body": "Are you able to buy to unlock car features permanently? My cars are 7+ years old so it’s a little fuzzy for me without direct experience. \n\nIf I’m a car manufacturer then I’d be producing the fully loaded version of each vehicle only to simplify production, but then give the option to activate the features for a cost, or pay a cheaper subscription price. \n\nBut the evil part is on resale they can do it again!",
                              "score": 1,
                              "created_utc": 1743343640.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mkijmct",
                          "author": "None",
                          "body": "[removed]",
                          "score": -18,
                          "created_utc": 1743341328.0,
                          "replies": [
                            {
                              "id": "mkios11",
                              "author": "idiot-prodigy",
                              "body": "Slaves historically were fed and housed by their master.  A human being paid minimum wage in USA can not afford housing or food on \"slave wages\".  \n\nWhat good is freedom if you can't afford basic necessities for honest work?",
                              "score": 7,
                              "created_utc": 1743343256.0,
                              "replies": []
                            },
                            {
                              "id": "mkim1y8",
                              "author": "oooshi",
                              "body": "Being unable to leave a position due to health insurance or hard to avoid debts like medical bills or student loans … costs of living skyrocketing and wages not keeping up with costs of housing and groceries payments that all seem to be going to the oligarchs that own our banks and grocery monopolies, people don’t really get to use their “wages” for much else. \n\nLot of freedom here",
                              "score": 3,
                              "created_utc": 1743342267.0,
                              "replies": []
                            },
                            {
                              "id": "mkillw0",
                              "author": "ReaditTrashPanda",
                              "body": "A suppose a bit hyperbolic. I feel pretty trapped though. Not a lot of economic choice. I don’t own a lot of stuff and what I do isn’t worth squat. So, maybe indirect servitude instead",
                              "score": 0,
                              "created_utc": 1743342099.0,
                              "replies": [
                                {
                                  "id": "mkioq2d",
                                  "author": "scottygras",
                                  "body": "Indentured servants are SO in right now /s",
                                  "score": 2,
                                  "created_utc": 1743343236.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mkiv1rv",
                      "author": "MAID_in_the_Shade",
                      "body": "> **We** have reasons - good ones -\n\nI recommend you learn who the Luddites were before using them as an insult. They *certainly* had good reasons for their beliefs.",
                      "score": 15,
                      "created_utc": 1743345414.0,
                      "replies": [
                        {
                          "id": "mkixi3r",
                          "author": "reverend_bones",
                          "body": ">[Four-hundred years ago on the planet Earth, workers who felt their livelihood threatened by automation flung their wooden shoes called 'sabot' into the machines to stop them. Hence the word 'sabotage' \n](https://www.youtube.com/watch?v=cKLIivrA3g0)\n\n^Sadly, ^Valeris ^was ^lying. ^But ^I ^always ^thought ^it ^made ^a ^good ^story.",
                          "score": 1,
                          "created_utc": 1743346239.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mkin0z1",
                      "author": "idiot-prodigy",
                      "body": "> We have reasons - good ones - for avoiding CERTAIN types of tech, shit that's consumer hostile. Those luddites simply knee jerked anti any progress because they simply didn't want to adapt. Not the same at all.\n\nNot true.  \n\nWhy would you rebuy all of your music on CDs or Apple Music if you already have a perfectly good HiFi system and a catalogue of LPs?  \n\nYes there is a difference between 240p VHS tapes and 4k streaming, but there isn't as drastic a difference between 1080p and 4k for most people.  \n\nI can see myself simply not caring about an 8k television.  \n\n[This is one of my favorite examples of diminishing returns.](https://external-preview.redd.it/gfdrB6eqKbOwJp4DTyNMvuIe_2yCjYl2OS1BlWxlHrY.png?auto=webp&s=29fb7189b4441061a5134c2ae48e51f43d05df98)   That is to say, the human eye has an upper limit, it won't be able to discern the difference between an 8k television and a 16k television.",
                      "score": 6,
                      "created_utc": 1743342628.0,
                      "replies": [
                        {
                          "id": "mkiqbsi",
                          "author": "scottygras",
                          "body": "Yeah, we don’t even fully utilize 4K yet (xfinity basically drug their feet on this purposely so anybody buying 8k stuff is in a niche market on content.",
                          "score": 3,
                          "created_utc": 1743343800.0,
                          "replies": []
                        },
                        {
                          "id": "mkl7r4u",
                          "author": "celticchrys",
                          "body": "...and a lot of my favorite content has never been released as 1080 in a purchasable way, let alone 4K.",
                          "score": 2,
                          "created_utc": 1743371869.0,
                          "replies": []
                        },
                        {
                          "id": "mkjwsub",
                          "author": "TooStrangeForWeird",
                          "body": "I still regularly choose 720p when I'm downloading movies and shows for Jellyfin. They take a lot less space, and I've built my system entirely from scavenged parts. It's only a few TB (and included video games) but I still have a ton of content. Most of the time I don't really notice it's 720p.",
                          "score": 1,
                          "created_utc": 1743357207.0,
                          "replies": [
                            {
                              "id": "mkk4l6x",
                              "author": "idiot-prodigy",
                              "body": "That is more common than most people realize.  \n\nThere absolutely is an argument for faster and less HDD space than higher resolution that the human eye can not really notice.",
                              "score": 1,
                              "created_utc": 1743359572.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mkl7e6p",
                      "author": "celticchrys",
                      "body": "This is exactly what the next generation will say about you luddites.",
                      "score": 1,
                      "created_utc": 1743371747.0,
                      "replies": []
                    },
                    {
                      "id": "mkieiew",
                      "author": "crosswatt",
                      "body": "This is either sarcasm or coming in hot off the top rope with some serious main character energy.",
                      "score": -5,
                      "created_utc": 1743339232.0,
                      "replies": []
                    },
                    {
                      "id": "mkje77g",
                      "author": "infallables",
                      "body": "They had reasons, too. Look up DivX. \n\nTo their credit, the market would work when they didn’t buy something. The technology would just die (betamax). There wasn’t this multi-billion dollar centralized power shit where something is forced on people and they have to like it because there is no real competitor or they both (Apple, Google) engage in a behavior and how do you call a monopoly on behavior?\n\nThe mistake we made in this country was letting education get as poor as it is, not teaching civics, and making everyone so comfortable that they’re not going to feel the loss of their rights until it’s too late.",
                      "score": 0,
                      "created_utc": 1743351524.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mkiobkx",
                  "author": "Warlord68",
                  "body": "You are ready.",
                  "score": 2,
                  "created_utc": 1743343094.0,
                  "replies": []
                },
                {
                  "id": "mkjjjbo",
                  "author": "android24601",
                  "body": "The jump from the older generation that went from analog to digital was huge, and it was understandable because of the learning curve. However, this \"jump\" is moreso making people pay for shit that used to be included with the initial purchase of the product. Advertisements have parasitically been attached to damn near everything from corporations trying to squeeze even more revenue out of consumers. Crazy how we've gotten to a point where you have to pay a premium to avoid advertisements",
                  "score": 2,
                  "created_utc": 1743353204.0,
                  "replies": []
                },
                {
                  "id": "mkjusam",
                  "author": "tropicsun",
                  "body": "I’m curious about the age of the decision makers at the company. If they are millennials, they should know better.",
                  "score": 2,
                  "created_utc": 1743356616.0,
                  "replies": []
                },
                {
                  "id": "mkli13r",
                  "author": "sir_racho",
                  "body": "ive been using my old macbook for 14 years. mac os stopped supporting it last decade. Hardware is still good tho... And i run linux mint on it and it can handle running two of the latest browsers at the same time, while running multiple instances of a modern terminal based editior (helix) in literally 6-7 tabs over multiple workspaces. So i understand not wanting to adapt very well - Im gonna use this mac until linux no longer works on it or it finally blows up",
                  "score": 2,
                  "created_utc": 1743375486.0,
                  "replies": []
                },
                {
                  "id": "mklueus",
                  "author": "mug3n",
                  "body": "Having a flatscreen TV pre all the stupid \"smart\" shit and always connected to internet crap was great times.",
                  "score": 2,
                  "created_utc": 1743379865.0,
                  "replies": []
                },
                {
                  "id": "mkj9lsu",
                  "author": "CraigLake",
                  "body": "I’ll never understand the music thing. I go to my buddy’s house and he’s blasting the same ac/dc record every time. How does your brain not melt listening to the same music day after day, year after year.",
                  "score": 0,
                  "created_utc": 1743350088.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mkij3oq",
              "author": "afurtivesquirrel",
              "body": "Yup. That's the entire reason I bought Garmin over Fitbit, Google, etc.\n\nFFS.",
              "score": 54,
              "created_utc": 1743341124.0,
              "replies": [
                {
                  "id": "mkiripp",
                  "author": "ElectronRotoscope",
                  "body": "Honestly my abandoning everything post-pebble seems more and more logical as time goes on (though if I'm honest I didn't predict any of this, I just found it too exhausting to keep up with)",
                  "score": 9,
                  "created_utc": 1743344214.0,
                  "replies": [
                    {
                      "id": "mklbz8d",
                      "author": "UnusualSwordfish9224",
                      "body": "They are working on making them again. https://repebble.com/",
                      "score": 3,
                      "created_utc": 1743373339.0,
                      "replies": []
                    },
                    {
                      "id": "mkjuyy7",
                      "author": "SupaaMann",
                      "body": "If it's any consolation at least we have proper Pebble successors now in the Core devices",
                      "score": 2,
                      "created_utc": 1743356670.0,
                      "replies": [
                        {
                          "id": "mkkivem",
                          "author": "TragasaurusRex",
                          "body": "Thanks I loved my pebble, still my favorite watch now i know what to get when Garmin tells me I need to spend money to use my own watch.",
                          "score": 1,
                          "created_utc": 1743363967.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mkjjg40",
                  "author": "AnRealDinosaur",
                  "body": "SAME! UGH. I am so irritated to read this. I gave up my fitbit when Google bought them and I've been rocking a garmin every day since. I LOVE this thing the way it is. Ive been evangelizing their watches i love it so much. I am so sick of everything trying to get me to pay monthly for a service I already purchased. If this thing loses functionality I'll be devastated but I'll trash it before i pay for another subscription service.",
                  "score": 1,
                  "created_utc": 1743353175.0,
                  "replies": []
                },
                {
                  "id": "mklcd8g",
                  "author": "intenseaudio",
                  "body": "Nothing we currently have gets locked behind the paywall though - and I'm personally not heartbroken about missing out on \"seemingly personalized AI driven conversational\" aspects of garmin connect",
                  "score": 1,
                  "created_utc": 1743373478.0,
                  "replies": []
                },
                {
                  "id": "mkik666",
                  "author": "SpicyNuggs4Lyfe",
                  "body": "You realize Fitbit has a subscription service too? 😂\n\nGarmin was just about the last holdout to not have one. And as of now it doesn't really bring anything essential to the table for most people.",
                  "score": -20,
                  "created_utc": 1743341544.0,
                  "replies": [
                    {
                      "id": "mkilmyk",
                      "author": "afurtivesquirrel",
                      "body": "Yes that's my point. Google and Fitbit had subscription bullshit. Garmin didn't, so I got a Garmin.\n\nIt doesn't yet. But give it time, and it'll be the same bs as the rest.",
                      "score": 10,
                      "created_utc": 1743342110.0,
                      "replies": []
                    },
                    {
                      "id": "mkimifc",
                      "author": "chochazel",
                      "body": "> You realize Fitbit has a subscription service too? 😂\n\nWhat did you think they were saying?!",
                      "score": 12,
                      "created_utc": 1743342438.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mkitcv3",
              "author": "solidtangent",
              "body": "There was an old hack when I worked there called jetmouse. It would unlock all the maps without having to buy each one.  Maybe jetmouse will come back and save the company.",
              "score": 7,
              "created_utc": 1743344843.0,
              "replies": []
            },
            {
              "id": "mkkdp98",
              "author": "TheWonderfulSlinky",
              "body": "But line have to go up!! What if line go down or stay same?? Line must go up!!",
              "score": 2,
              "created_utc": 1743362346.0,
              "replies": []
            },
            {
              "id": "mkivns8",
              "author": "Firecracker048",
              "body": "I was just eyeing one of their smartwatch especially too",
              "score": 1,
              "created_utc": 1743345621.0,
              "replies": []
            },
            {
              "id": "mkjarj2",
              "author": "ReefJR65",
              "body": "Anything for those profits",
              "score": 1,
              "created_utc": 1743350450.0,
              "replies": []
            },
            {
              "id": "mkk8eyz",
              "author": "FlyingBishop",
              "body": "You do actually own it fully though. You can download the fit files and do all this analysis yourself (or pull them into Strava or whatever system.)\n\nGarmin is the only watch maker I trust not to be using the data to sell ads or something, a paid analysis service seems fine, seriously.",
              "score": 1,
              "created_utc": 1743360732.0,
              "replies": []
            },
            {
              "id": "mklftgx",
              "author": "devopsslave",
              "body": ">Garmin's whole upside was the fact that you bought the device and you owned it fully.\n\nThat's *never* really been the way they've operated, though.\n\nThey sell hardware, yes, but more importantly, they sell various software and subscriptions *on top* of that hardware. You only get the \"features\" you pay to unlock. Pilots (air, land, and sea) have been dealing with this for a couple of decades or so.",
              "score": 1,
              "created_utc": 1743374712.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mki708u",
          "author": "jampola",
          "body": "Eh, connect has always been poo poo and the only purpose it has served me is syncing my workouts to Strava. Great hardware, crap software.",
          "score": 50,
          "created_utc": 1743335722.0,
          "replies": [
            {
              "id": "mkjiq4g",
              "author": "GayreTranquillo",
              "body": "Yeah, but then Strava decided to go the subscription route, and I didn't mind the bad UI for Connect bc it was a) still free and b) still functional once you got used to it.",
              "score": 5,
              "created_utc": 1743352951.0,
              "replies": [
                {
                  "id": "mkjnclx",
                  "author": "Merisuola",
                  "body": "ad hoc square subsequent towering zesty reminiscent boast hat soft distinct\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                  "score": 4,
                  "created_utc": 1743354372.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mki20r1",
          "author": "fng185",
          "body": "Surprised people didn’t ditch them en masse after the hack a few years ago exposed how shitty they are.",
          "score": 43,
          "created_utc": 1743333064.0,
          "replies": [
            {
              "id": "mkiby5z",
              "author": "lart2150",
              "body": "This?  https://www.cshub.com/attacks/articles/incident-of-the-week-garmin-pays-10-million-to-ransomware-hackers-who-rendered-systems-useless",
              "score": 20,
              "created_utc": 1743338104.0,
              "replies": []
            },
            {
              "id": "mki68uq",
              "author": "unripenedfruit",
              "body": "What happened?",
              "score": 10,
              "created_utc": 1743335335.0,
              "replies": []
            },
            {
              "id": "mki7imj",
              "author": "No_Necessary7154",
              "body": "What happened?",
              "score": -1,
              "created_utc": 1743335982.0,
              "replies": []
            },
            {
              "id": "mki96l0",
              "author": "autoerratica",
              "body": "What… happened?",
              "score": -4,
              "created_utc": 1743336803.0,
              "replies": []
            },
            {
              "id": "mki9k07",
              "author": "TamashiiNu",
              "body": "What happened??",
              "score": -5,
              "created_utc": 1743336983.0,
              "replies": []
            },
            {
              "id": "mkiaeuq",
              "author": "anyavailablebane",
              "body": "What happened?",
              "score": -4,
              "created_utc": 1743337392.0,
              "replies": []
            },
            {
              "id": "mkk8t5o",
              "author": "FlyingBishop",
              "body": "It was just ransomware. They didn't do anything wrong. I mean, yeah, they maybe could've been better about network security, but that's a universal.",
              "score": 0,
              "created_utc": 1743360850.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkmj83o",
          "author": "Krimreaper1",
          "body": "I stopped buying from them when my device with free lifetime maps stopped getting map updates and said I’d have to buy a new one to get new ones.",
          "score": 5,
          "created_utc": 1743389400.0,
          "replies": [
            {
              "id": "ml09xg4",
              "author": "pppjurac",
              "body": "You can upgrade maps regardless of type as long as internal storage is visible via computer.\n\nI use https://garmin.opentopomap.org/ .\n\nAnd there are many others based on OSM / opentopo",
              "score": 2,
              "created_utc": 1743593715.0,
              "replies": []
            },
            {
              "id": "mkmjw52",
              "author": "computerman10367",
              "body": "I don't like modern Garmin, but they are the only one to actually provide lifetime map updates. I'm guessing yours doesn't have an SD card slot? Modern maps are so full of data it fills up the internal memory completely. I had to put a SD card into my Nuvi 52 to continue to get updates. It's from 2015, and I'm updating it as I type this lol.",
              "score": 1,
              "created_utc": 1743389671.0,
              "replies": [
                {
                  "id": "mkmk2t4",
                  "author": "Krimreaper1",
                  "body": "They said it was no longer supported and wouldn’t get any more updates. Doesn’t sound like lifetime to me.",
                  "score": 2,
                  "created_utc": 1743389749.0,
                  "replies": [
                    {
                      "id": "mknche3",
                      "author": "Vabla",
                      "body": "\"lifetime of the device\" is always somewhere in the smallest print their lawyers let them use. Usually the only way to find out what the lifetime of it is, is to purchase, and wait until they pull support.",
                      "score": 2,
                      "created_utc": 1743404463.0,
                      "replies": []
                    },
                    {
                      "id": "mkmkqs6",
                      "author": "computerman10367",
                      "body": "What's the model number? If you can remember.",
                      "score": 1,
                      "created_utc": 1743390030.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mknfa3n",
              "author": "Bdr1983",
              "body": "Oh the good old 'lifetime' guarantee. They just don't tell you which lifetime, but it's always the devices lifetime. Which is going to be short.",
              "score": 1,
              "created_utc": 1743406288.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mki272e",
          "author": "AreYouFilmingNow",
          "body": "They're already on it because of being an American company.\n\n\nGood alternatives are Polar and Suunto.",
          "score": 10,
          "created_utc": 1743333165.0,
          "replies": [
            {
              "id": "mkiabzs",
              "author": "Barqueefa",
              "body": "Been on Suunto forever, they've come a long way. Great app and the race series are phenomenal sport watches",
              "score": 3,
              "created_utc": 1743337355.0,
              "replies": []
            },
            {
              "id": "mki3sfp",
              "author": "SwindlerSam",
              "body": "Reddit is ok though? Lol",
              "score": 7,
              "created_utc": 1743334060.0,
              "replies": [
                {
                  "id": "mki4p82",
                  "author": "elliethestaffy",
                  "body": "Yes, because if you are unable to avoid everything from the US, you shouldn’t avoid anything….",
                  "score": -9,
                  "created_utc": 1743334561.0,
                  "replies": [
                    {
                      "id": "mki5cw3",
                      "author": "SwindlerSam",
                      "body": "You can’t avoid Reddit?",
                      "score": 19,
                      "created_utc": 1743334876.0,
                      "replies": [
                        {
                          "id": "mki6zyz",
                          "author": "AFCSentinel",
                          "body": "Reddit is literally as necessary as air to breathe.\nThen again people were talking biggly about boycotting X and propping up Bluesky but Bluesky activity numbers have never managed to reach the peaks of early November and that’s despite Musk doing or saying something regarded every other day or so. \n\nThere’s a huge gap between having principles and virtue signaling when it doesn’t really affect you day to day. Like, for example, I am currently boycotting all American car makers. Look at me! Also, I don’t have a drivers’ license and don’t drive a car, but it’s the thought that counts, right?",
                          "score": -24,
                          "created_utc": 1743335719.0,
                          "replies": [
                            {
                              "id": "mki79zd",
                              "author": "johnyeros",
                              "body": "I can use Reddit everyday or don’t use it for 2 week. Its ain’t a necessity. Go talk to your friend. Neighbor. Family. Touch grass and trash.",
                              "score": 18,
                              "created_utc": 1743335860.0,
                              "replies": [
                                {
                                  "id": "mkj03ju",
                                  "author": "MAID_in_the_Shade",
                                  "body": "It's hard to overstate how obvious their sarcasm is, or at least should be.",
                                  "score": 6,
                                  "created_utc": 1743347089.0,
                                  "replies": [
                                    {
                                      "id": "mkj5b8s",
                                      "author": "johnyeros",
                                      "body": "No. I don’t agree. People act like Reddit is god. It is also Chinese own btw. 🤣",
                                      "score": -6,
                                      "created_utc": 1743348752.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mki83u6",
                              "author": "Expensive_Prior_5962",
                              "body": "Shitter is dead and dying and bluesky is just getting started.\n\nThese things take time.",
                              "score": 7,
                              "created_utc": 1743336272.0,
                              "replies": []
                            },
                            {
                              "id": "mkibgsn",
                              "author": "None",
                              "body": "[removed]",
                              "score": -7,
                              "created_utc": 1743337884.0,
                              "replies": [
                                {
                                  "id": "mkivs3q",
                                  "author": "MAID_in_the_Shade",
                                  "body": "> I ain’t reading all that. \n\n103 words. The American education system, everyone.",
                                  "score": 1,
                                  "created_utc": 1743345661.0,
                                  "replies": [
                                    {
                                      "id": "mkjdyh7",
                                      "author": "mpdity",
                                      "body": "Nah. Just don’t like to pay attention to yappers.\n\nPeople like you just want discourse. And come after people’s intelligence without an ounce of forethought for some reason. \n\nLike, do you want my MENSA card for proof of my intelligence or something? Cause if you wanna call a 148 IQ (as if it even fuckin matters) “the US EDUCATE ION system everyone” then be my guest. \n\n“Reddit is literally as necessary as air to breathe”. \n\nI’m not gonna be reading anything after THAT dumb as shit statement gets made. It’s that easy lmfao!",
                                      "score": -5,
                                      "created_utc": 1743351449.0,
                                      "replies": [
                                        {
                                          "id": "mkjinio",
                                          "author": "MAID_in_the_Shade",
                                          "body": "I ain’t reading all that. \nHappy for you tho!\nOr sorry it happened…",
                                          "score": 2,
                                          "created_utc": 1743352928.0,
                                          "replies": [
                                            {
                                              "id": "mkjorv4",
                                              "author": "mpdity",
                                              "body": "You do you pookie… just wipe up after yourself when you’re done, I guess.",
                                              "score": 0,
                                              "created_utc": 1743354800.0,
                                              "replies": []
                                            }
                                          ]
                                        },
                                        {
                                          "id": "mkmnwfj",
                                          "author": "sadlygokarts",
                                          "body": ">don’t like to pay attention to yappers\n\n>yaps even harder",
                                          "score": 1,
                                          "created_utc": 1743391398.0,
                                          "replies": [
                                            {
                                              "id": "mkmvcrp",
                                              "author": "mpdity",
                                              "body": "Saying I’m not gonna go on and on in a stupid mega thread with a stupid is yapping? \n\nLul K",
                                              "score": 1,
                                              "created_utc": 1743394840.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mkkhx8e",
          "author": "Nose_Disclose",
          "body": "Life gets a little simpler 😊",
          "score": 1,
          "created_utc": 1743363670.0,
          "replies": []
        },
        {
          "id": "mkkutkx",
          "author": "VulcanHullo",
          "body": "I had been thinking if I got a Smartwatch it'd be a Garmin.\n\nNow I don't think I even want a smartwatch.",
          "score": 1,
          "created_utc": 1743367635.0,
          "replies": [
            {
              "id": "mklleaj",
              "author": "computerman10367",
              "body": "Get a new pebble watch. They are back in business. I've been using them since the beginning of the company.",
              "score": 1,
              "created_utc": 1743376643.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkl0ntu",
          "author": "Organicmint",
          "body": "100%",
          "score": 1,
          "created_utc": 1743369506.0,
          "replies": []
        },
        {
          "id": "mkldh1v",
          "author": "mehdotdotdotdot",
          "body": "Yea, just use the 99.9% of features for free, and don’t part for the ai junk. Easy as",
          "score": 1,
          "created_utc": 1743373869.0,
          "replies": []
        },
        {
          "id": "mki7yew",
          "author": "Expensive_Prior_5962",
          "body": "Care to share your list?",
          "score": 0,
          "created_utc": 1743336198.0,
          "replies": [
            {
              "id": "mkibst9",
              "author": "computerman10367",
              "body": "Amazon, apple, any restaurant that replaced employees with dumb ai, any company that requires a subscription to use the product you buy. I'm sure there are a few more. It's a mental list.",
              "score": 9,
              "created_utc": 1743338037.0,
              "replies": [
                {
                  "id": "mkihyr9",
                  "author": "MobileVortex",
                  "body": "You have a good list? Pretty sure the thing's you said apply to more places than not.",
                  "score": 1,
                  "created_utc": 1743340667.0,
                  "replies": [
                    {
                      "id": "mkijdco",
                      "author": "computerman10367",
                      "body": "I don't buy alot of new things. I prefer shopping used for almost everything. The older products tend to last longer also",
                      "score": 2,
                      "created_utc": 1743341229.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mkjjsgb",
                  "author": "Expensive_Prior_5962",
                  "body": "Oh well I hate apple and havent used Amazon for over a decade so I'm doing well lol",
                  "score": 1,
                  "created_utc": 1743353283.0,
                  "replies": []
                },
                {
                  "id": "mkixotp",
                  "author": "Roboculon",
                  "body": "> any company that requires a subscription to use a product you buy\n\nHere’s a dilemma for you. Tesla is the only car company to give away free traffic-aware nav routing and free cellular-based smartphone controls (phone-based keyless entry, etc). If you go with a competitor like Kia or BMW those things are $20+/month, forever. \n\nBut 13% of Tesla is owned by a literal Nazi. So which do you hate more, paying a needless subscription to use your own car? Or paying  13% of the profit from the purchase price to a Nazi?",
                  "score": -2,
                  "created_utc": 1743346302.0,
                  "replies": [
                    {
                      "id": "mkiy2nc",
                      "author": "computerman10367",
                      "body": "I hate them both, I only buy 90s-80s cars. If you think I'm bullshitting look at my profile history over the last 7 years. I'll never buy a car made after 1999...",
                      "score": 4,
                      "created_utc": 1743346428.0,
                      "replies": [
                        {
                          "id": "mkiyxnz",
                          "author": "Roboculon",
                          "body": "Surprised to hear that from someone posting about tech gadgets on the internet. \n\nFor me, phone key is a basic feature now and I don’t ever want to go back. I literally don’t carry keys. My home and car are both openable by my phone (automatically, no need to even take it out of my pocket). I can’t imagine ever carrying one of those big bulky key fobs with the buttons on it again. \n\nBut I also don’t want to start paying a monthly lifetime fee for something I get for free right now. But nazis.",
                          "score": 0,
                          "created_utc": 1743346713.0,
                          "replies": [
                            {
                              "id": "mkja35p",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 3,
                              "created_utc": 1743350237.0,
                              "replies": [
                                {
                                  "id": "mkjivqc",
                                  "author": "Roboculon",
                                  "body": "Sure, I agree. But on the topic of this thread, forced subscriptions we shouldn’t have to pay for, it just sucks that no car company is willing to offer use of what I think should be basic features unless you subscribe —and the sole exception is a Nazi. So it sucks either way.",
                                  "score": 1,
                                  "created_utc": 1743353000.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mkizlgw",
                              "author": "computerman10367",
                              "body": "I don't really buy new tech either. I don't buy the newest anything. I only replace my phone when my old one is completely broken beyond repair. Even then I don't buy a new one. I prefer putting money into my community and buying off of marketplace, or pawnshops, etc.",
                              "score": 2,
                              "created_utc": 1743346926.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mkj1v54",
          "author": "Sithlordandsavior",
          "body": "Eventually we'll have like 3 things someone can actually *own* and the rest are on subscription models.",
          "score": 0,
          "created_utc": 1743347655.0,
          "replies": []
        },
        {
          "id": "mkjaxk3",
          "author": "Kalabula",
          "body": "Yep.That’s the nice thing about capitalism.",
          "score": 0,
          "created_utc": 1743350503.0,
          "replies": []
        },
        {
          "id": "mkjdw4k",
          "author": "topboyinn1t",
          "body": "Coros ftw, at least for now",
          "score": 0,
          "created_utc": 1743351429.0,
          "replies": []
        },
        {
          "id": "mkjem22",
          "author": "Mattyou1966",
          "body": "Gamin shoulda went out of business when my phone became my navigation",
          "score": -1,
          "created_utc": 1743351655.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkicewi",
      "author": "kenjiro_uchiha",
      "body": "Dunno why some smartwatches lock some features like fitness tracking behind a subscription. You’re a watch, not a gym membership.",
      "score": 297,
      "created_utc": 1743338314.0,
      "replies": [
        {
          "id": "mkiq8bh",
          "author": "SarcasticOptimist",
          "body": "Greed I suppose. Bummer as I like my Garmin Instinct solar. The ski GPS tracking has been really fun and informative. Plus it ties with my company's virgin pulse/personify account.",
          "score": 89,
          "created_utc": 1743343766.0,
          "replies": [
            {
              "id": "mkjccgz",
              "author": "redcurtainrod",
              "body": "I still like my garmin and those are all features I don’t need. AI encouragement? More badges? Posting to social media? \n\nIt’s just a weird way to force AI in. \n\nI’ll stick with the free features and stay happy.",
              "score": 38,
              "created_utc": 1743350946.0,
              "replies": [
                {
                  "id": "mkjx7q5",
                  "author": "SarcasticOptimist",
                  "body": "Yeah. I'm hopeful they don't roll back any features and keep the AI junk paywalled.",
                  "score": 5,
                  "created_utc": 1743357329.0,
                  "replies": [
                    {
                      "id": "ml0ag2o",
                      "author": "pppjurac",
                      "body": "Mind they probably 'train' their AI on all users data anyways since years.",
                      "score": 2,
                      "created_utc": 1743593958.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mklo0o5",
                  "author": "cinderubella",
                  "body": "> free features\n\n\nDid you find your Garmin on the ground or something? You paid for those features chief. Don't forget it and don't forget to be enraged when they start moving \"free\" stuff inside a new paywall. ",
                  "score": 8,
                  "created_utc": 1743377565.0,
                  "replies": []
                },
                {
                  "id": "mkqqihw",
                  "author": "Call_Me_Squishmale",
                  "body": "Thanks for pointing that out, the paywalled stuff is indeed useless bullshit. Saves me figuring out how to disable it, nice!",
                  "score": 1,
                  "created_utc": 1743451456.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mknr0ra",
              "author": "Wonderful-Mousse-335",
              "body": "AI at it's finest form, probably : useless, subscription based, ruins everything it touches",
              "score": 3,
              "created_utc": 1743414107.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkkfr12",
          "author": "NextWhiteDeath",
          "body": "They do it because people want update for years after purchase or don't want to pay the true economic cost of the product up front.",
          "score": 7,
          "created_utc": 1743362986.0,
          "replies": [
            {
              "id": "mkqb06y",
              "author": "britzsquad",
              "body": "The development of cloud software is not a one-off investment. It is a continuous effort.",
              "score": 1,
              "created_utc": 1743446840.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkj94b5",
          "author": "Wooden_College2793",
          "body": "Yeah. Not the case here, but point stands.",
          "score": 6,
          "created_utc": 1743349937.0,
          "replies": []
        },
        {
          "id": "mklb701",
          "author": "justsyr",
          "body": "So I have Gear smart watch. Working flawlessly. I had to change my phone because the screen broke and getting it fixed would cost me about the same as a new phone. \n\nNow the watch can't sync with phone because they ended support for phones manufactured in 2024... \n\nIf I connect it to any old phone it works perfectly... There's a bunch of things you can do to make it sync again, uninstalling this or that, getting the date before 2024, and so on, once all done it works again meaning the watch works fine on a new phone, they just want you to get a new smart watch... \n\nI know it's just me and probably a few hundred more but they are not getting any more money from me.",
          "score": 2,
          "created_utc": 1743373061.0,
          "replies": []
        },
        {
          "id": "mkl9y9e",
          "author": "OpenSourcePenguin",
          "body": "Not just watches.\n\nIf a product or service doesn't have a recurring cost, I refuse to pay subscription fees.\n\nIt's fucking bullshit.",
          "score": 1,
          "created_utc": 1743372624.0,
          "replies": []
        },
        {
          "id": "mkldqw9",
          "author": "Kevmandigo",
          "body": "Not to mention the biometric data included.",
          "score": 1,
          "created_utc": 1743373967.0,
          "replies": []
        },
        {
          "id": "ml0acba",
          "author": "pppjurac",
          "body": "depends really. Garmin makes much better sport watches, while apple makes better smart watches.\n\nYou can (for most advanced watches) pair them via basic provider to free or paid Strava too.\n\nOr... just leave it and use what is on watch. Once you boil down to necessary features... they are present since purchase.",
          "score": 1,
          "created_utc": 1743593910.0,
          "replies": []
        },
        {
          "id": "mkket5i",
          "author": "100Onions",
          "body": "> Dunno why\n\nBecause they want people to pay more because it costs them money to pay people to improve their software.\n\nIt isn't fucking rocket science.  A standard watch has no ongoing costs because it can't be remotely improved.  a digital watch can be.   They would have to charge more for watches or stop doing updates.  Plain and simple.  Or make less money.",
          "score": 0,
          "created_utc": 1743362691.0,
          "replies": []
        },
        {
          "id": "mkit5pm",
          "author": "Anstigmat",
          "body": "Well I pay for apple fitness plus which kind of literally is a gym membership.  100% worth it though.",
          "score": -14,
          "created_utc": 1743344774.0,
          "replies": [
            {
              "id": "mkkr0zn",
              "author": "OlinKirkland",
              "body": "Does your fitness plus subscription come with access to fitness equipment?",
              "score": 2,
              "created_utc": 1743366462.0,
              "replies": [
                {
                  "id": "mklse9e",
                  "author": "Anstigmat",
                  "body": "There is a pretty big mix of stuff you can do, some of it requires equipment, but lots of it you can do with just a yoga mat.  I started with a trainer for my actual road bike, but eventually I got a used 'spin class' type bike for $250 which is a bit better (quieter and doesn't put wear on my road bike).  Then I picked up two adjustable dumbells and that's all I use.  But just as often I do the pilates classes and they're only mat based.  At first you had to have an apple watch but they changed it, so now my wife uses my account with her phone and does classes too.",
                  "score": 1,
                  "created_utc": 1743379121.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mkj4pjz",
      "author": "Mean_Peen",
      "body": "Gotta be honest, subscriptions are killing my love for gadgets",
      "score": 114,
      "created_utc": 1743348563.0,
      "replies": [
        {
          "id": "mkmbiv8",
          "author": "treehugger100",
          "body": "I feel this so much. I love tech and gadgets but the lack of privacy, ads, and subscriptions are just making me despise them. I’m just having to reorient my gadget interest to older tech.",
          "score": 7,
          "created_utc": 1743386355.0,
          "replies": [
            {
              "id": "mknctqq",
              "author": "PendingInsomnia",
              "body": "I’ve been dealing with this by learning woodworking, CNC and 3D printing to make my own (albeit lower tech) gadgets",
              "score": 4,
              "created_utc": 1743404683.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkn55mh",
          "author": "kierumcak",
          "body": "They need us wayyyyyy more than we need them.",
          "score": 1,
          "created_utc": 1743400036.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mki78rq",
      "author": "StyrofoamTerrorist",
      "body": "I was considering getting a Garmin, not anymore.",
      "score": 324,
      "created_utc": 1743335843.0,
      "replies": [
        {
          "id": "mkj57aj",
          "author": "theGIRTHQUAKE",
          "body": "My wife and I have Apple Watches, but she’s a hardcore fitness person, coach, runner, gymrat, etc. and wanted something more capable for elevating her performance even further. \n\nShe agonized for literal months over which Garmin to buy, tons of research almost every night, several trips to stores to try and figure out if she could tolerate the larger more feature-rich ones on her small wrists, or if she just wanted to pony up €1k+ on the Fenix 8.\n\nShe finally just pulled the trigger on the latter. She had it all of two full days, happy as hell with it, and then Garmin announced this shit. She was pretty gutted. \n\nI told her that, on the flip side, she might have just gotten the best fitness watch on the market right before features start slipping behind paywalls in the next models. It could be the one everyone ends up wanting on the used market down the road, who knows. Hollow words, ultimately, because the hope was that, though paying a high premium and forgoing the seamless integration of Apple devices, she was buying into an ecosystem that she could be happy with now and in the future.  \n\nReally hate what the world is becoming.",
          "score": 97,
          "created_utc": 1743348717.0,
          "replies": [
            {
              "id": "mkkvs8b",
              "author": "twigboy",
              "body": "Only 2 days, not too late for a refund (if applicable in your country)",
              "score": 36,
              "created_utc": 1743367935.0,
              "replies": []
            },
            {
              "id": "mkn0p0x",
              "author": "Darkhoof",
              "body": "She can still return it.",
              "score": 5,
              "created_utc": 1743397570.0,
              "replies": []
            },
            {
              "id": "mkm0c2d",
              "author": "None",
              "body": "[deleted]",
              "score": -1,
              "created_utc": 1743382090.0,
              "replies": [
                {
                  "id": "mkmuu5p",
                  "author": "JakeEngelbrecht",
                  "body": "It helps get get metrics on effort and keep track of if you’re improving or not.",
                  "score": 2,
                  "created_utc": 1743394588.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mkklhqq",
              "author": "Zeraw420",
              "body": "Didn't she have to pay for a Fitbit subscription with the apple watch?",
              "score": -14,
              "created_utc": 1743364776.0,
              "replies": [
                {
                  "id": "mkkvnud",
                  "author": "franklybeingchildish",
                  "body": "Fitbit has nothing to do with Apple Watch, what do you mean?",
                  "score": 13,
                  "created_utc": 1743367897.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mkjsv6v",
          "author": "l0keycom",
          "body": "The \"features\"that are behind the paywall in no way stop the usage for tracking and  later reviewing at the current level of stats provided, they just paywalled BS ai and enhanced stats that to 90% of it's user base aren't interested in.\n\nI certainly won't be buying it, but I til they start syphoning off core features that are currently free behind the paywall I see no reason to stop using it as is.",
          "score": 35,
          "created_utc": 1743356039.0,
          "replies": [
            {
              "id": "mkjxorq",
              "author": "ExdigguserPies",
              "body": "The problem is the uncertainty. Now they've started down this path there's no way of knowing where they will stop. You only have to look at strava where core features like personal bests were put behind a paywall.",
              "score": 32,
              "created_utc": 1743357469.0,
              "replies": [
                {
                  "id": "mkk98cw",
                  "author": "FlyingBishop",
                  "body": "There's no way of being sure of anything. I'm happy with the services Garmin provides, and the AI garbage they're selling here doesn't sound appealing - but if I need a new watch it will definitely be Garmin. I can always export the fit files and run my own analysis if I'm unhappy with Garmin's free offering.",
                  "score": 2,
                  "created_utc": 1743360979.0,
                  "replies": [
                    {
                      "id": "mklq5n6",
                      "author": "r0botdevil",
                      "body": ">I can always export the fit files and run my own analysis\n\nNot if they paywall that feature as well...",
                      "score": 2,
                      "created_utc": 1743378318.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mkkvgws",
              "author": "skalpelis",
              "body": "> Garmin claims all features Connect users can currently access for free will remain free\n\nTranslated from corpospeak: get rekt, freeloaders, no new shit for you, ever",
              "score": 4,
              "created_utc": 1743367836.0,
              "replies": [
                {
                  "id": "mkorxef",
                  "author": "Teadrunkest",
                  "body": "I mean, I have a Garmin and I’m not really sure what new features I would even want. It already does more than I really need it to.",
                  "score": 1,
                  "created_utc": 1743430291.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mknobh1",
              "author": "calgarywalker",
              "body": "I bought into a fitness tracking app early in the electronification of fitness.   Runtastic.  Did what I wanted, tracked my runs even with gps maps.  Pretty cool even by today standards.  Bought the lifetime package.  Then the company sold to Nike who paywalled my data.   MY DATA that I already paid to store on MY device!   Had a lot of cool data on that including the only half marathon I ever ran.",
              "score": 3,
              "created_utc": 1743412347.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkk3qah",
          "author": "blacksoxing",
          "body": "From reading the actual article…I’m not throwing mine out. Most of what’s offered is irrelevant from what the watch offers itself.",
          "score": 19,
          "created_utc": 1743359309.0,
          "replies": [
            {
              "id": "mkkephh",
              "author": "brucebrowde",
              "body": "What's relevant is that this is the direction things are going in. They will continue pushing towards this. Sooner and later, you'll need a feature that's not available without additional payments.",
              "score": 19,
              "created_utc": 1743362659.0,
              "replies": [
                {
                  "id": "mkm52e0",
                  "author": "Ghost4000",
                  "body": "Maybe, but I'm with /u/blacksoxing\n\nI already own a Garmin and it is really good, this announcement doesn't affect me at all and at least for the foreseeable future I don't see when it'll start affecting me. Maybe they'll eventually have a killer feature that I feel like I just must have, but as long as they aren't taking away the features that exist already I'm fine with it.",
                  "score": 1,
                  "created_utc": 1743383884.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mknlagd",
              "author": "IT_techsupport",
              "body": "Reminds me of how DLC/cosmetics started in gaming, look were we are now.",
              "score": 3,
              "created_utc": 1743410336.0,
              "replies": [
                {
                  "id": "mkozvrg",
                  "author": "blacksoxing",
                  "body": "I see this as Garmin leaning on A.I to spit out graphs and \"goals\" to those who crave it. Who though IS that person as right now their watches provide a lot of data already. \n\nA less clickbait headline would have been simply \" Garmin now offers paid A.I features through Connect+\" which is the truth. They're not bricking our watches and for those who paid $1k for one ain't nothing changing....unless they had a hankering for some ultra-personalized data provided to them. If that's the case then oh yes, they gotta pay for that.",
                  "score": 1,
                  "created_utc": 1743432762.0,
                  "replies": []
                },
                {
                  "id": "mkph14x",
                  "author": "balllzak",
                  "body": "Where we are now is the new maps that we used to have to pay for are free and the useless cosmetics cost money.",
                  "score": 1,
                  "created_utc": 1743437914.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mkioldx",
          "author": "vanguarde",
          "body": "Same and I was strongly considering a $1k plus watch too. I wonder how many others decided not to get garmins solely because of this. ",
          "score": 13,
          "created_utc": 1743343191.0,
          "replies": [
            {
              "id": "mkj9wse",
              "author": "westbee",
              "body": "I have a garmin and am getting close to needing an update. I probably won't now.",
              "score": 3,
              "created_utc": 1743350183.0,
              "replies": []
            },
            {
              "id": "mlp2vdh",
              "author": "EdLover9",
              "body": "Leave Garmin feedback in their site, I did. If they degrade the experience and start charging subscription, I simply will drop them.",
              "score": 2,
              "created_utc": 1743946220.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkk64xu",
          "author": "Hoothootzap",
          "body": "I need a new smartwatch as the battery in my venu 2 is dying. This doesn't inspire me to stay with Garmin.",
          "score": 2,
          "created_utc": 1743360043.0,
          "replies": []
        },
        {
          "id": "mkkctl1",
          "author": "vdreamin",
          "body": "I switched from withings to Garmin (full ecosystem not just the watch) and regret it. \n\nGarmin has the best GPS features, and they have nice rugged designs, that's about it.\n\nTheir software is bad. Not just the phone app but the actual integrated software in their scales, BP monitors for example, is half baked and trash. \n\nThey also STILL haven't decided to sync with Health Connect. They feel like they want to keep this locked in ecosystem because of brand loyalty like Apple does, but they just piss off their customers. \n\nOpened July 2023: https://github.com/garmin/connectiq-apps/issues/55",
          "score": 2,
          "created_utc": 1743362075.0,
          "replies": []
        },
        {
          "id": "mkmtge6",
          "author": "JasiNtech",
          "body": "Same, cycling would have meant buying a bunch of their products. I'll buy wahoo instead",
          "score": 2,
          "created_utc": 1743393925.0,
          "replies": []
        },
        {
          "id": "mkkdq2m",
          "author": "Sorcatarius",
          "body": "Right? I was eyeing up a new Garmin smartwatch, but it was a bit out of my price range at the time. Was debating just using what I had for a while and socking money away, but then I found a deal on new phone, cheaper service plan, and they'd throw in a new Samsung watch 7.\n\n\"Well fuck, my phone was beat to shit and I could use a new one, guess Ill go for that and look at the Garmin next time\" was my thought at the time. Glad it worked out this way now.",
          "score": 1,
          "created_utc": 1743362353.0,
          "replies": []
        },
        {
          "id": "mklu88l",
          "author": "Dultimateaccount000",
          "body": "Same, sadly.",
          "score": 1,
          "created_utc": 1743379797.0,
          "replies": []
        },
        {
          "id": "mkkvh61",
          "author": "NouvelErmitage",
          "body": "Did you even read the article? They're paywalling a NEW feature, lol",
          "score": 1,
          "created_utc": 1743367838.0,
          "replies": [
            {
              "id": "mkkygmy",
              "author": "Bludypoo",
              "body": "I have a coros vertix 1. had it for 3 years or so and they've been adding new features quite regularly. They even added a feature to mine after the newer version of my watch released with, so i didn't feel like i needed to upgrade.",
              "score": 1,
              "created_utc": 1743368797.0,
              "replies": []
            },
            {
              "id": "mkn4r8b",
              "author": "raskim7",
              "body": "For now. SportsTracker started putting their existing features behind subscriptions like many others. Why would Garmin be any different now that they have mechanism for it? I bet that at least training programs are going to be moved behind subscriptions with excuse of ”being enchanced with AI”, and I wouldn’t be surprised if planning exercices and routes would be too.",
              "score": 1,
              "created_utc": 1743399808.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkjx925",
          "author": "Jubilee021",
          "body": "Dude no kidding. I finally saved up enough to buy a garmin and this is the first thing I read today? No thanks.\n\nUgh I’ve been wanting one for years too",
          "score": 0,
          "created_utc": 1743357340.0,
          "replies": []
        },
        {
          "id": "mkixg4z",
          "author": "TheBigBangClock",
          "body": "I bought a Garmin Forerunner 245  last year and it's not very good.  Roughly half the time it will take 10+ minutes to get an adequate GPS signal and after only using it for about 15 months, the buttons are starting to stick.",
          "score": -2,
          "created_utc": 1743346221.0,
          "replies": [
            {
              "id": "mkjg97d",
              "author": "Thaitanium101",
              "body": "It sounds like it isn't syncing with your app properly, allow the app to autostart and run in the background. Your watch picks up the satellite location files from the app, without them it has to download satellite locations over GPS which takes ages. I had a 235 for years and it always acquired GPS lock with no issues",
              "score": 6,
              "created_utc": 1743352170.0,
              "replies": [
                {
                  "id": "mkjzuu9",
                  "author": "TheBigBangClock",
                  "body": "Thanks for the tip, I didn't know it had to be synced with the phone to do that since my old Garmin watch never had the issue and lasted 7 years (it was from before the days they even had an app).  Love that I'm getting down-voted for sharing my experience with the 245.  God forbid I have a bad experience with it.  That's reddit for you.",
                  "score": 2,
                  "created_utc": 1743358119.0,
                  "replies": [
                    {
                      "id": "mkk3blf",
                      "author": "Thaitanium101",
                      "body": "Haha yes, classic Reddit! Might also be worth checking your satellite settings are on GPS only rather than any other combination of satellites. Hope it helps anyway!",
                      "score": 3,
                      "created_utc": 1743359184.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mki11jv",
      "author": "NarlyConditions",
      "body": "You never own anything anymore everything is a subscription so they can make you dry.",
      "score": 209,
      "created_utc": 1743332496.0,
      "replies": [
        {
          "id": "mkitrcr",
          "author": "1sttimeverbaldiarrhe",
          "body": "One day it'll escalate to Life As A Service.",
          "score": 22,
          "created_utc": 1743344979.0,
          "replies": [
            {
              "id": "mkj1tce",
              "author": "whiskeysixkilo",
              "body": "You mean like health care premiums?",
              "score": 30,
              "created_utc": 1743347639.0,
              "replies": []
            },
            {
              "id": "mkiw0yp",
              "author": "1022whore",
              "body": "I mean you kind of have a subscription to food",
              "score": 4,
              "created_utc": 1743345746.0,
              "replies": []
            },
            {
              "id": "mkjduis",
              "author": "yentity",
              "body": "It already is",
              "score": 3,
              "created_utc": 1743351415.0,
              "replies": []
            },
            {
              "id": "mkkcul2",
              "author": "Sorcatarius",
              "body": "You pay for shelter, food, and water.\n\nIt already exists.",
              "score": 1,
              "created_utc": 1743362083.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mki9wcu",
          "author": "Screamline",
          "body": "*Cough* Pebble/Core *cough*\nAlthough i guess there is the sub to rebble for weather and voice diction",
          "score": 5,
          "created_utc": 1743337149.0,
          "replies": []
        },
        {
          "id": "mkjelnm",
          "author": "itchylol742",
          "body": "Do what you want cause a pirate is free, you are a pirate!",
          "score": 1,
          "created_utc": 1743351651.0,
          "replies": []
        },
        {
          "id": "mkjnx57",
          "author": "Newspeak_Linguist",
          "body": "Someone is going to trademark all the complaints about subscription models so we have to pay to say them.  Or maybe just a monthly subscription plan that gives you access to groups of certain phrases, in some sort of tiered pricing model.",
          "score": 1,
          "created_utc": 1743354545.0,
          "replies": []
        },
        {
          "id": "mkl2pyg",
          "author": "bigbadchief",
          "body": "Did anyone in this thread actually read the article? It's an optional subscription for new, additional features. All the currently free functionality remains free.",
          "score": 1,
          "created_utc": 1743370186.0,
          "replies": []
        },
        {
          "id": "mklgxzv",
          "author": "Major_T_Pain",
          "body": "The phrase is \"milk you dry\", not make.",
          "score": 1,
          "created_utc": 1743375108.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkilqud",
      "author": "Doomsday_Holiday",
      "body": "If you are checking out alternatives without this payment model have a look at COROS, POLAR and SUUNTO these offer something for you.",
      "score": 21,
      "created_utc": 1743342151.0,
      "replies": [
        {
          "id": "mkkr1hm",
          "author": "hotSoup9",
          "body": "Thank you!",
          "score": 2,
          "created_utc": 1743366466.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mki1504",
      "author": "voodoovan",
      "body": "Goodbye Garmin, hello Coros.",
      "score": 132,
      "created_utc": 1743332552.0,
      "replies": [
        {
          "id": "mki5xt9",
          "author": "angedelamort",
          "body": "I wanted to buy a new Garmin, and just had a look at the coros watch. Looks nice. Thanks for the tip",
          "score": 23,
          "created_utc": 1743335177.0,
          "replies": []
        },
        {
          "id": "mkirlip",
          "author": "SarcasticOptimist",
          "body": "Or Suuntos. Their watches are competitive even though they are less expensive. They're well known for their scuba computers. \n\nhttps://www.outsideonline.com/outdoor-gear/tools/garmin-versus-suunto-watch/",
          "score": 12,
          "created_utc": 1743344241.0,
          "replies": []
        },
        {
          "id": "mkie6ol",
          "author": "BrewtusMaximus1",
          "body": "I wish Coros still made helmets.",
          "score": 4,
          "created_utc": 1743339091.0,
          "replies": [
            {
              "id": "mklih1s",
              "author": "jmelliere",
              "body": "Do they not anymore? I have a Coros boke helmet with Bluetooth headphones and a light built in. Bought it 5-6 years ago and works great, just wish it were MIPS",
              "score": 1,
              "created_utc": 1743375637.0,
              "replies": [
                {
                  "id": "mkljpt2",
                  "author": "BrewtusMaximus1",
                  "body": "They haven’t for 5-6 years. I left mine in a hot car and that fried the head phones.\n\nEvery other smart helmet with speakers I’ve found has features I don’t want - like turn signals.",
                  "score": 1,
                  "created_utc": 1743376064.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mkil5rz",
          "author": "infernoShield",
          "body": "I just got a Forerunner 55 on sale and they did this...... I'm still sticking with my new watch but ~~if~~ once they make me pay for core features I'll make the switch.",
          "score": 5,
          "created_utc": 1743341928.0,
          "replies": [
            {
              "id": "mkj9aua",
              "author": "Wooden_College2793",
              "body": "You don't have to pay for core features FYI. The article title makes it sound that way, but it is not.",
              "score": 6,
              "created_utc": 1743349993.0,
              "replies": [
                {
                  "id": "mkk1dok",
                  "author": "Azazir",
                  "body": "That's the thing, Garmin was always about buy it once and have it all, no need extra shit. Now they're adding subscriptions, later when the benefits of it aren't worth it, they will lock default features behind it and start increasing its price. Its disgusting practice.",
                  "score": 0,
                  "created_utc": 1743358584.0,
                  "replies": [
                    {
                      "id": "mkk47kp",
                      "author": "Wooden_College2793",
                      "body": "Maybe. Maybe not. For now, it looks like they are implementing some expensive to operate features (AI models) and charging a subscription to support it.",
                      "score": 3,
                      "created_utc": 1743359456.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mkipns6",
          "author": "Peg-5",
          "body": "After the hack, I started tracking shoes on Strava and putting all my comments and pictures, etc. there instead of Garmin to prepare for this. When my 955 dies I will be able to evaluate all options.",
          "score": 1,
          "created_utc": 1743343565.0,
          "replies": []
        },
        {
          "id": "mkispl8",
          "author": "Acceptable-Pipe-8735",
          "body": "They put a flashlight on their watch like my enduro 2 has I will definitely make the switch.",
          "score": 1,
          "created_utc": 1743344620.0,
          "replies": []
        },
        {
          "id": "mkmyoue",
          "author": "AnonymousGlowie",
          "body": "How does the battery life compare? That was garmins big advantage I thought",
          "score": 1,
          "created_utc": 1743396526.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkijjtm",
      "author": "SpicyNuggs4Lyfe",
      "body": "Not purchasing it myself, but just to be clear, there are no previously free features that are now paid. These are extra features on top of what's already there. \n\nUnfortunately only a matter of time. Every company feels the need to milk their customers for every cent with subscriptions.",
      "score": 92,
      "created_utc": 1743341300.0,
      "replies": [
        {
          "id": "mkjt74o",
          "author": "mrslother",
          "body": "To be clear, there are no _free_ features. We paid for them with the purchase of the watch. If they start moving those features behind a paywall, then they are effectively increasing the price of the watch (same cost but fewer features), expecting you to pay yet more for the subscription.\n\nI like my Garmin watch, but not that much. It's almost like they want us to tip them or something.",
          "score": 26,
          "created_utc": 1743356138.0,
          "replies": [
            {
              "id": "mkk9k8f",
              "author": "FlyingBishop",
              "body": "> If they start moving those features behind a paywall, then they are effectively increasing the price of the watch\n\nExpecting them to offer free services forever because you bought a watch is not reasonable. The services cost money, the watch has a fixed margin, that margin can't give indefinite support.",
              "score": -5,
              "created_utc": 1743361078.0,
              "replies": [
                {
                  "id": "mkl0727",
                  "author": "mrslother",
                  "body": "I don't expect them to offer free services. Rather, I expect them to honor the services they sold us as part of the cost of the watch.\n\nIt _is_ reasonable to expect this, at least until they end-of-life the product.\nReasonable because when the biz guys calculate their costs & profits based on the bill of materials, the development/test costs, distribution of update costs, etc they would be including ongoing costs of backend services & stuff.\n\nIf you are saying that it is _un_reasonable, then you are saying that they failed to calculate those sevice costs in. \n\nGosh, I hope they calculated in the costs of their warranties, otherwise they may move that behind a paywall. /s",
                  "score": 8,
                  "created_utc": 1743369357.0,
                  "replies": [
                    {
                      "id": "mkl6lb9",
                      "author": "FlyingBishop",
                      "body": "The warranties are only a year, and the watches are much more durable than that. I'd like to see way better warranty support, but Garmin sets the standard in terms of making devices that work just fine without their connected services. The services are a nice add-on, but the watches are totally fit for purpose without them.\n\n(actually, I say sets the standard, but this is unfair, Apple and Google set the standard which is devices that are bricks without connected services.)",
                      "score": 0,
                      "created_utc": 1743371477.0,
                      "replies": [
                        {
                          "id": "mklofdg",
                          "author": "cinderubella",
                          "body": "> Garmin sets the standard in terms of making devices that work just fine without their connected services.\n\n\nUhhhh what? This thing on my wrist would be a fugly bracelet without Garmin Connect. ",
                          "score": 2,
                          "created_utc": 1743377708.0,
                          "replies": [
                            {
                              "id": "mkm065l",
                              "author": "FlyingBishop",
                              "body": "I use Connect because it's more convenient but I can easily export all the data and generate reports, in fact I have done it to generate reports that aren't included with Connect.",
                              "score": 1,
                              "created_utc": 1743382029.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mklouqr",
                  "author": "cinderubella",
                  "body": "Do you know anything about what you're pretending to know everything about? ",
                  "score": 2,
                  "created_utc": 1743377860.0,
                  "replies": [
                    {
                      "id": "mklzuxq",
                      "author": "FlyingBishop",
                      "body": "I've owned a Garmin for years and am familiar with how my watch works. Do you know anything about how it works?",
                      "score": 1,
                      "created_utc": 1743381912.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mkn843o",
                  "author": "_Dreamer_Deceiver_",
                  "body": "Which services cost money? Did I not pay for my watch? When I bought my watch did I not pay the amount advertised for the features they listed? \n\nI didn't ask for AI features, I didn't buy the watch for AI features. So as long as the AI features are locked behind the paywall then that fine otherwise I expect every feature it had to continue to work for at least 5 years",
                  "score": 2,
                  "created_utc": 1743401776.0,
                  "replies": [
                    {
                      "id": "mkpg7sj",
                      "author": "FlyingBishop",
                      "body": "My Garmin has full-featured offline access to most of these features. It's easy to download all the fit files off the device and load them into various apps to display the data.\n\nGarmin's services which automatically receive and store the fit files and store them on a server, these make sense as paid apps. Really having a paid tier is way better than the competition who are likely doing really sketchy privacy-violating things.",
                      "score": 1,
                      "created_utc": 1743437671.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mklw2jh",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 0,
                  "created_utc": 1743380480.0,
                  "replies": [
                    {
                      "id": "mklzmz8",
                      "author": "FlyingBishop",
                      "body": "That's not the case. The data is open and easily exported from the watch. If they rolled out an update that disabled fit file export I would be bringing out the pitchforks, this doesn't lock any data collected. In fact you can trivially export all your data from Connect.",
                      "score": 3,
                      "created_utc": 1743381828.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mknrmw6",
          "author": "Wonderful-Mousse-335",
          "body": "yes, because i can use this watch for 10+ years and they want to earn more on cheap watches, right?  \n\nFFS, NO! i already paid a lot for a watch that will die in a few years and i need to pay a subscription if i want to have more feature? hell, no",
          "score": 1,
          "created_utc": 1743414487.0,
          "replies": []
        },
        {
          "id": "mkj6an0",
          "author": "MichaelR23",
          "body": "So I do own a Garmin and I won’t be paying for Connect+. Garmin will be incurring costs associated with their analytics platform, is the argument that one you buy a Garmin watch, they should be effectively paying you to use it on a monthly basis?",
          "score": 1,
          "created_utc": 1743349061.0,
          "replies": [
            {
              "id": "mkjyx6q",
              "author": "Todtgelichter",
              "body": "The watch is more expensive than competitors. That was the deal before: pay more for the watch, free software. Or at least that was it when I last researched and bought my forerunner 255 and vivosmart 5 before that.",
              "score": 8,
              "created_utc": 1743357835.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkkctju",
          "author": "sokratesz",
          "body": "> there are no previously free features that are now paid\n\n\nNot _yet_. Don't be stupid.",
          "score": -1,
          "created_utc": 1743362074.0,
          "replies": []
        },
        {
          "id": "mkja2td",
          "author": "westbee",
          "body": "It's the Adobe model.",
          "score": -1,
          "created_utc": 1743350234.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkirc4a",
      "author": "abarrelofmankeys",
      "body": "I was worried but I actually don’t care about any of those new features. If they start putting normal stuff behind a paywall I’d be concerned, and this does create worry regarding that.",
      "score": 10,
      "created_utc": 1743344151.0,
      "replies": []
    },
    {
      "id": "mki809p",
      "author": "No_Truth4137",
      "body": "God damnit.  I love garmin and was going to buy the venu 2.  Later G!",
      "score": 9,
      "created_utc": 1743336223.0,
      "replies": []
    },
    {
      "id": "mkhza65",
      "author": "2muchmojo",
      "body": "Capitalism is an addiction. The idea that in this moment in history, they’d roll this out, it seems like stupidity at a stunning level but we know they’re not stupid right? Fuck em. Straight in the garbage.",
      "score": 93,
      "created_utc": 1743331456.0,
      "replies": [
        {
          "id": "mkidekx",
          "author": "splinter6",
          "body": "Haven’t you noticed? Everyone else is doing it so they thought they could too. Grift era",
          "score": 18,
          "created_utc": 1743338754.0,
          "replies": [
            {
              "id": "mkneynh",
              "author": "Vabla",
              "body": "\"Everyone else is doing it\" such a dumb reason, yet it keeps happening. It's like companies have lost any sense of identity and just follow their dumb friends to jump into the swamp.",
              "score": 1,
              "created_utc": 1743406075.0,
              "replies": []
            },
            {
              "id": "mkj0mqu",
              "author": "2muchmojo",
              "body": "I’ve def noticed! 😂 For my whole life.",
              "score": 0,
              "created_utc": 1743347262.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkigsz0",
          "author": "DevoidHT",
          "body": "Its not stupid if everyone is doing it. Thats the problem with capitalism. Everyone is racing to the bottom and there is no end goal. The end goal is more money but there will never be enough “more money”.",
          "score": 28,
          "created_utc": 1743340191.0,
          "replies": [
            {
              "id": "mkj0ijj",
              "author": "2muchmojo",
              "body": "Totally! But It’s been that way all along. As a recovering drug addict, I started with a beer and a joint. It was a wild ride where I ended up living in my car and then losing that too and finally surrendered. Capitalism is just a system some old white guys brewed up and continue to attempt to control, we’re humans who are scared and mixed up and gravitate to the *feeling* of answers that end up not working.\n\nIt’s addiction, we just don’t have the language for it yet.",
              "score": 4,
              "created_utc": 1743347224.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkiitt2",
          "author": "clay_perview",
          "body": "Because every company in this country decided in the 80’s that the only people who are qualified to run them are these “money guys”. Originally meant a profit focused individual able to see were money is being wasted has now shifted into sociopathic rich kids who think that their farts could rival the musical talents of Beethoven. They will find the greediest ways to nickel and dime their customers, then earnings come they gloat the 10% revenue increase, but ignore the 25% decrease in customer base. So in 5 years the company will go belly up and the CEO will blame unforeseen market instability, get a 100 million dollar parachute, and then is rehired by another company",
          "score": 12,
          "created_utc": 1743341015.0,
          "replies": [
            {
              "id": "mkizybd",
              "author": "2muchmojo",
              "body": "This final cycle of American delusion as it concerns economics, definitely started around Reagan and was furthered by neoliberalism at every stop. It’s become a sorta all encompassing corporatism. Has very little to do with Trump or Obama and everything to do with American emotional illiteracy.",
              "score": 2,
              "created_utc": 1743347042.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkilmej",
          "author": "gurganator",
          "body": "Nope, not stupidity on their part. It’s a cost-benefit game. Lose some customers but gain profit and then  lure more customers when the outage dies down. Works every time.",
          "score": 6,
          "created_utc": 1743342104.0,
          "replies": [
            {
              "id": "mkiyoze",
              "author": "2muchmojo",
              "body": "Exactly. Same as using some Oxys in high school and getting caught. But then growing up and starting to hit some Xanax and next thing you know, wallah, you’re smoking fent. \n\nGarmin (and others addicted to money) do this. But I don’t really give a shit about my watch so, I’m gettin off the ride.",
              "score": 1,
              "created_utc": 1743346633.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkil15p",
          "author": "RapNVideoGames",
          "body": "I believe capitalism is a symptom of a bigger ideology. Mechanism and the scientific revolution in Europe lead to the idea of input=output and nothing other than that matters (I simplified a lot of this). If the input is too complicated or tedious you scale to fit. This is how we have these giant concepts (like capitalism) turn parasitic. Eventually output just means growth and profit which is where you see the lack of sympathy or “doing right” because it doesn’t help the output. This creates a machine built on systems of inputs that eventually become self fulfilling. It’s how we got the Industrial Revolution and later capitalism. Also explains why everything feels like a business now from healthcare, politics, to entertainment. The business machine model created the best “output” at the cost of our humanity.",
          "score": 0,
          "created_utc": 1743341878.0,
          "replies": [
            {
              "id": "mkizkga",
              "author": "2muchmojo",
              "body": "There are so many different true parts of so many different false parts. And reality itself, as I understand it, is a weather-like set of conditions that we are good at turning into little stories, but we seemingly don’t have the ability to integrate the meaning after we get the sensation (two things which, like everything else, are part of each other) so Western thought, individualism and separation, the desire to control, our sloppy use of language and the sensations it creates. \n\nIt’s like as a cultural/societal/psyche we are scared of mystery, can’t admit it, so we chase it around and call it materialistic and technology 😂 \n\nWe’re a mess.",
              "score": 2,
              "created_utc": 1743346917.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mki98es",
      "author": "Potter3117",
      "body": "Jeez. I was planning on selling my Apple Watch and getting a 965. Nvm.",
      "score": 7,
      "created_utc": 1743336827.0,
      "replies": [
        {
          "id": "mkj5scc",
          "author": "void_const",
          "body": "AW is superior in every way except battery life",
          "score": -9,
          "created_utc": 1743348901.0,
          "replies": [
            {
              "id": "mkjo6c3",
              "author": "Potter3117",
              "body": "I have the ultra 2, and the battery is good enough for me. I think if you are staying inside Apple you’re probably correct, but I do jump around occasionally which is why I was thinking of Garmin. Not sure why you are getting downvoted. 🤷🏻‍♂️",
              "score": 2,
              "created_utc": 1743354622.0,
              "replies": [
                {
                  "id": "mkjoz0l",
                  "author": "void_const",
                  "body": "Garmin marketing department is doing damage control",
                  "score": -2,
                  "created_utc": 1743354860.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mkluse1",
      "author": "Yaarmehearty",
      "body": "You mean I get to not pay for AI that I don’t want? And I can just keep using the features I already use while not wanting AI?\n\nSounds like a sweet deal to me.",
      "score": 5,
      "created_utc": 1743380003.0,
      "replies": [
        {
          "id": "mkmfd49",
          "author": "Herkfixer",
          "body": "Yeah, all these commenters going off the headline OP title and not reading the article. Nothing on the watch that you pay for is being restricted. Some AI summary stuff in the app and extra fitness videos and social stuff in the app are going to be a paid tier. The OP's title is completely made up to ragebait.",
          "score": 3,
          "created_utc": 1743387847.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mki8d8k",
      "author": "tallsails",
      "body": "My garmin needs replacing \nI was \nWas\nLooking at a new one \n\nNope",
      "score": 18,
      "created_utc": 1743336403.0,
      "replies": [
        {
          "id": "mkj1jg9",
          "author": "None",
          "body": "[deleted]",
          "score": 3,
          "created_utc": 1743347552.0,
          "replies": [
            {
              "id": "mkjqcs5",
              "author": "Rahyan30200",
              "body": "Garmin isn't in the same league as Apple/Samsung/Fitbit. At all.\n\nA better alternative would be Coros.",
              "score": -2,
              "created_utc": 1743355280.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkjdexl",
          "author": "Amari__Cooper",
          "body": "Same. Still running a 5x. Won't be replacing it with another Garmin that's for sure.",
          "score": 1,
          "created_utc": 1743351280.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkjtuxa",
      "author": "buffer2722",
      "body": "So... They won't shove the unnecessary AI commentary at me unless I pay for it. Oh the shame!",
      "score": 5,
      "created_utc": 1743356338.0,
      "replies": []
    },
    {
      "id": "mkje8ca",
      "author": "TsumeOkami",
      "body": "Just to be clear - there are no new working features behind this paywall.\n\nThe AI is completely useless\nThe badges are laughable\nThe phone live sync thing is pointless\n\nEveryone's on the free plan right now, but can't imagine anyone continuing to pay for this absolute trash",
      "score": 10,
      "created_utc": 1743351533.0,
      "replies": [
        {
          "id": "mkm1nez",
          "author": "PhilConnersWPBH-TV",
          "body": "You're right, the pay stuff is garbage. Which is why they'll eventually start putting the free stuff behind the paywall.",
          "score": 3,
          "created_utc": 1743382585.0,
          "replies": [
            {
              "id": "mkmrqeo",
              "author": "ElJamoquio",
              "body": "They'll make the free options less and less usable",
              "score": 2,
              "created_utc": 1743393122.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkmzl1g",
          "author": "AnonymousGlowie",
          "body": "I work in tech, everything is turning to annual recurring revenue model. It's a matter of time, look at what Bambu 3D printers did or tried to do, they are all going to do it.",
          "score": 1,
          "created_utc": 1743396987.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkiasr1",
      "author": "crm115",
      "body": "I was already firmly in the Garmin ecosystem. That's why I bought another Edge headset instead of trying something from Wahoo. I got to test drive a Whoop band for work. I ditched it because I didn't want to be in the subscription model. I'm just one person but I'm probably fairly representative of their \"weekend athlete\" demographic. If they truly move to a subscription model, it's going to completely break the grip they have had on me for the past two decades for biannual upgrades to my Forerunner/Fenix watches and Edge headsets. It's a shame because I've been a strong supporter of them since I had my first Forerunner 205.",
      "score": 4,
      "created_utc": 1743337576.0,
      "replies": [
        {
          "id": "mkjwig7",
          "author": "chris556452",
          "body": "This right here! My wife and I get $700+ watches every couple years, our teenager has venu and our 3rd grader wears a bounce. We have garmin dash cams, bathroom scale, etc.\nWe're firmly in the garmin ecosystem specifically because of the no subscription model. I don't know for how much longer though.",
          "score": 1,
          "created_utc": 1743357125.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mki3v5j",
      "author": "Waterfish3333",
      "body": "So they’re adding an AI backdrop to the watch for a paid fee but, per the article “currently free services will remain free.”\n\nSo it’s a super click bait headline and there’s absolutely 0 reason to complain at this time given the additional services would cost the company money in an ongoing sense. \n\nAnd yet Reddit complains.",
      "score": 113,
      "created_utc": 1743334100.0,
      "replies": [
        {
          "id": "mki8g7c",
          "author": "Protean_Protein",
          "body": "The subscription locks more than just shitty AI summaries behind the paywall. And the concern among users is that there was an accepted premium on these devices because it was assumed to be subsidizing the software.",
          "score": 63,
          "created_utc": 1743336443.0,
          "replies": [
            {
              "id": "mkicu0r",
              "author": "MapleSyrup_N_Hockey",
              "body": "I also suspect this means Garmin will focus on shipping new features to the paid subscription tier rather than releasing anything new to free users.",
              "score": 49,
              "created_utc": 1743338504.0,
              "replies": []
            },
            {
              "id": "mkic0o7",
              "author": "cookerz30",
              "body": "My Garmin Fenix 5 tracks my workouts, changes music, and shows me notifications. Whatever \"premium\" features I'm missing out on, I don't care for.",
              "score": 15,
              "created_utc": 1743338135.0,
              "replies": [
                {
                  "id": "mkiendg",
                  "author": "Protean_Protein",
                  "body": "The other concern is that we have evidence that when companies move to a subscription model they don’t leave everything as it was. It’s the first step in locking more and more behind the paywall.\n\nNow, you might think there’s no evidence for that yet. And sure, maybe that’s true. But it’s a fair concern given the way other actors in this space and related ones have gone (e.g., Strava, and some of the streaming services).",
                  "score": 25,
                  "created_utc": 1743339291.0,
                  "replies": [
                    {
                      "id": "mkkh55g",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1743363423.0,
                      "replies": [
                        {
                          "id": "mkkhjlx",
                          "author": "Protean_Protein",
                          "body": "You’d have to look at the EULA for Garmin Connect. It’s worth pointing out that the watch can still display what it displays even if you lose access to Garmin Connect altogether.",
                          "score": 1,
                          "created_utc": 1743363551.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mkivnpt",
                  "author": "AssDimple",
                  "body": "if that's all you're concerned about, you got ripped off buying a Garmin.  You'd be better suited for one of those entry-level fitbits.",
                  "score": -6,
                  "created_utc": 1743345620.0,
                  "replies": [
                    {
                      "id": "mkj5w2b",
                      "author": "schu2470",
                      "body": "Not even close. The Fenix 5 is a flagship watch from its time (newest one is the Fenix 8 released last year) that can act independently from your phone for navigation, routing, and a bunch of other stuff. It can act as a bike computer and pair to your power meter and heart rate strap, it’ll not just track your runs and rides but allows you to make and navigate routes on the watch itself, the gps tracking is second to none for accuracy, and the battery (when new) lasts weeks rather than days. Way more going on with the Fenix series than almost anything else on the market.\n\nI have a Fenix 6 pro and use all of these features weekly if not daily. The paid subscription is a bunch of AI nonsense leaving all of the core and advertised features free as always. DC Rainmaker has a video on the new service. He’s used more of these devices and knows more about them than probably anyone else and is the go-to resource for researching new fitness watches and bike computers and associated accessories.",
                      "score": 5,
                      "created_utc": 1743348933.0,
                      "replies": [
                        {
                          "id": "mkj67xd",
                          "author": "AssDimple",
                          "body": "Im aware of the variousg garmin watches and their features.  None of this is applicable to what the OP that i was responding to described.",
                          "score": -4,
                          "created_utc": 1743349037.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mkj8474",
                      "author": "TheStealthyPotato",
                      "body": "The ones that break every 1-2 years?",
                      "score": 1,
                      "created_utc": 1743349626.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mkifhvk",
          "author": "Derp_a_deep",
          "body": "I mostly agree, as the watch and the app will still have all the same functionality it had when I bought it. Otherwise it'd be pitchfork time. But any new development will almost certainly come on the premium subscription platform going forward. And since I'm about due for a new watch anyway, this has a significant influence on if my next one will be a Garmin. One of the main reasons to stay is I'm already integrated with the app and all my historical data is there. If their plan is to let the free version of the app stagnate or enshittify it to push their subscription model, then that may push me to a different brand.",
          "score": 9,
          "created_utc": 1743339646.0,
          "replies": []
        },
        {
          "id": "mkiknvi",
          "author": "sixfourtykilo",
          "body": "I think people here have legitimate concerns and I was considering upgrading to a Fenix 8 pro solar.  If I suddenly learn I can't use all of the features of a $1000 watch I'm going to be super upset.",
          "score": 7,
          "created_utc": 1743341734.0,
          "replies": []
        },
        {
          "id": "mkilu15",
          "author": "None",
          "body": "[deleted]",
          "score": 3,
          "created_utc": 1743342184.0,
          "replies": [
            {
              "id": "mkk1v3g",
              "author": "probablywontrespond2",
              "body": "You have to be incredibly naive to think they will stop there.",
              "score": 1,
              "created_utc": 1743358733.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkn8ji5",
          "author": "_Dreamer_Deceiver_",
          "body": "Because they'll put other stuff behind the paywall at some point",
          "score": 1,
          "created_utc": 1743402032.0,
          "replies": []
        },
        {
          "id": "mkiwbxp",
          "author": "vogueboy",
          "body": "Every company says the same. \nWait 1 year and it's very likely they'll be moving some free features to the premium tier. Or even creating a middle tier without ai but moving some free features to it.",
          "score": 1,
          "created_utc": 1743345848.0,
          "replies": [
            {
              "id": "mkj8ola",
              "author": "TheStealthyPotato",
              "body": "What are the best examples of some companies that moved free features to a paid tier?",
              "score": 1,
              "created_utc": 1743349801.0,
              "replies": [
                {
                  "id": "mkjdc4s",
                  "author": "Complex_Win_5408",
                  "body": "Strava for sure",
                  "score": 1,
                  "created_utc": 1743351256.0,
                  "replies": []
                },
                {
                  "id": "mkjtypo",
                  "author": "mrslother",
                  "body": "Heated car seats & Remote car start.",
                  "score": 1,
                  "created_utc": 1743356369.0,
                  "replies": [
                    {
                      "id": "mkmdorq",
                      "author": "TheStealthyPotato",
                      "body": "I've seen companies have them as paid features from the start, but do you have a specific company that *took away the feature* after it had been free at the beginning?",
                      "score": 1,
                      "created_utc": 1743387192.0,
                      "replies": [
                        {
                          "id": "mkmdz30",
                          "author": "mrslother",
                          "body": "Toyota",
                          "score": 1,
                          "created_utc": 1743387303.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mkppsfv",
                  "author": "vogueboy",
                  "body": "Oh a lot, like Google photos removing unlimited storage, Flickr reducing free plan from 1 tb to 1000 photos, Evernote's free plan is a joke compared to how it was years ago. Reddit had free access to its API. Started charging and basically killed most alternative apps.\n\nTwitter moved tweetdeck to the paid tier. Paid users also get priority in replies so the replies sick now because it's a bunch of paid user blabbering before the real good ( which wee the most liked) replies \n\n\nStrava is the closest example to Garnin, this is deepseek generated:\n\n- **2017:** Introduced **\"Summit\"** (now **Strava Premium**), locking features like **route planning, advanced analytics, and leaderboard filtering**.  \n- **2020:** Removed **free access to segment leaderboards** (previously a core feature for competitive cyclists/runners).  \n- **2023:** Restricted **real-time effort comparisons** (how you rank mid-activity) to paid users.",
                  "score": 1,
                  "created_utc": 1743440562.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mkjtoch",
          "author": "mrslother",
          "body": "Not free ... we paid for them when we purchased the watch. You don't say car seats or the speedometer is free.",
          "score": -1,
          "created_utc": 1743356282.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkjaq50",
      "author": "RandulfHarlow",
      "body": "The annoying part about this is yeah they state “all free features available TODAY will remain free.”\n\nGuess where they will put all useful features moving forward? Behind their shitty paywall they just added to alienate users until they relent and just pay the stupid subscription.\n\nI’m tired of companies bullying their end users into submission like this.",
      "score": 7,
      "created_utc": 1743350438.0,
      "replies": []
    },
    {
      "id": "mki2ndx",
      "author": "stopeer",
      "body": "Or better yet - buy Polar.",
      "score": 11,
      "created_utc": 1743333424.0,
      "replies": []
    },
    {
      "id": "mkiv1eh",
      "author": "lilelliot",
      "body": "I don't fault them for doing this because there has always been ample room for newcomers to take activity data and provide more useful analytics around it.  You've seen this with Strava, too, who has had a sub model for forever and dealt with the \"problem\" by restricting their API last year.  This effected everything from intervals.icu to Runalyze to Sauce for Strava to Elevate for Strava, and many more.\n\nIt's natural that Garmin -- as the *source* of the majority of this data -- would want to be in the game themselves.  I would have hoped, as long time Garmin customer (I believe my second watch was a Forerunner 620, and I no longer remember what it replaced), that they'd just invest in improvements to Connect, but although they *did* complete their wholesale Connect revamping last year, they didn't actually make *any* improvements on the data analysis front.  That was a huge miss.  Athletes care far less about UI/UX (see Golden Cheetah or WKO for example!) than about insights, and by locking future functionality behind a paywall, Garmin is going to miss out on more than they gain.\n\nI'll continue to use Garmin for activity recording and health metrics, Strava for social activity tracking + segment performance, and Intervals.icu for the actually important performance metrics.",
      "score": 3,
      "created_utc": 1743345411.0,
      "replies": []
    },
    {
      "id": "mkjvnld",
      "author": "Cody-Fakename",
      "body": "Perfect article to scroll by as I looked to upgrade my current Garmin watch.\n\n\nBye bye Garmin.",
      "score": 3,
      "created_utc": 1743356872.0,
      "replies": []
    },
    {
      "id": "mkjwmxd",
      "author": "None",
      "body": "I have been a Garmin customer for a long time. Their apps are crap, even for free. I can't imagine paying for them.",
      "score": 3,
      "created_utc": 1743357161.0,
      "replies": [
        {
          "id": "mkka6hb",
          "author": "Tek_Freek",
          "body": "I have an old old Garmin (circa 1995 iirc). Works flawlessly.\n\nA relatively new one (2015) Gets lost and goes the wrong way.\n\nA newer one (2018). Came with our car and as soon as I have to pay for an upgrade I'll switch to Android Auto and a map app.",
          "score": 2,
          "created_utc": 1743361266.0,
          "replies": [
            {
              "id": "mkkbuns",
              "author": "None",
              "body": "I have a Tundra with built in Nav. I think it is Garmin but I'm not sure because I've never used it. Only use Google Maps or an alternative.\n\nBut I do use a Garmin dog tracker. I live on a farm and let my dog roam free but I want to know where he is in case he gets too close to the road (about 250M from the house in the closest direction). This means I use a collar, an Alpha 10, an app, and my watch. The Alpha 10 does not allow me to set a geofence (as near as I can tell) but constantly warns me he has exited the geofence. Even though it is set to keep only the last few minutes of tracking, the app will frequently (every few minutes) explode with all tracking information since I last installed it a few weeks ago. Because of spurious \"warnings\" I cannot disable (dog has treed quarry, etc), the watch will alert constantly and drain the battery in about a day unless I disable all the alerts.\n\nGarmin support is useless as well.",
              "score": 1,
              "created_utc": 1743361778.0,
              "replies": [
                {
                  "id": "mkkd8pj",
                  "author": "Tek_Freek",
                  "body": "Their support lost me when I had the device from 2015. \n\nThey kept telling me BS about why the device was doing stupid things and that they were not a problem.\n\nThey spent more time blowing smoke up my ass then trying to resolve anything.",
                  "score": 2,
                  "created_utc": 1743362203.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mkk1aw5",
      "author": "rusmo",
      "body": "Garmin owner for 3 watches over 8 years. I’m not subscribing to shit.  These watches are expensive enough as-is.",
      "score": 3,
      "created_utc": 1743358560.0,
      "replies": []
    },
    {
      "id": "mkk2utl",
      "author": "ThunderChild247",
      "body": "Any time a company does this, I make a mental note to never ever buy anything from them in future. Even different hardware that doesn’t have locked features, because they may do later. \n\nI don’t mind too much when products launch with these restrictions (and are up front about what you get with/without a subscription so I can make an informed choice), but as soon as you introduce a paid subscription or lock things I used to get for free behind a paywall, I’m done with that brand entirely.",
      "score": 3,
      "created_utc": 1743359040.0,
      "replies": []
    },
    {
      "id": "mkklsh0",
      "author": "Duplonator",
      "body": "I was actually thinking of getting one. Guess not",
      "score": 3,
      "created_utc": 1743364867.0,
      "replies": []
    },
    {
      "id": "mklsbwe",
      "author": "EffectiveEconomics",
      "body": "What features are unlocked when you pay for the service that we don’t already see on the watch or out of the box on the garmin connect site? I don’t see anything in there that I don’t already use on my watch. \n\nTempest in a teacup?",
      "score": 3,
      "created_utc": 1743379097.0,
      "replies": [
        {
          "id": "mkmfiei",
          "author": "Herkfixer",
          "body": "Gotta get clicks and rage bait. They know there isn't anything different that any other manufacturer, but that isn't going to get people clicking.",
          "score": 3,
          "created_utc": 1743387905.0,
          "replies": [
            {
              "id": "mkmn3lt",
              "author": "EffectiveEconomics",
              "body": "Seems like it! The ai driven features are computationally expensive so it makes sense to charge a fee for them.",
              "score": 2,
              "created_utc": 1743391048.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mkmogkz",
      "author": "Igoos99",
      "body": "Reading the article, I don’t see anything that I want in the new features. Except maybe a better display of charts and graphs. Their recent update to tiles made it harder to see your data. Maybe that was deliberate. \n\nOverall, this kinda seems like a nothing burger. 🤷🏻‍♀️",
      "score": 3,
      "created_utc": 1743391646.0,
      "replies": []
    },
    {
      "id": "mki2e42",
      "author": "LiamBox",
      "body": "Another dictator for his collection.\n\n\nhttps://wiki.rossmanngroup.com/wiki/Main_Page",
      "score": 8,
      "created_utc": 1743333277.0,
      "replies": []
    },
    {
      "id": "mki00ln",
      "author": "spunkdrop",
      "body": "Maybe I’m taking crazy pills but they’re not putting current features behind a paywall. Just stuff I can’t see many people being interested in anyways.",
      "score": 36,
      "created_utc": 1743331889.0,
      "replies": [
        {
          "id": "mki74km",
          "author": "TheBadGuyBelow",
          "body": "Not putting current features behind a paywall YET. This is them testing the waters so that later on they can bilk enough people to stave off the investors and shareholders for another quarter.\n\nInfinite growth and infinite profits at the expense of all else IS the American way, after all.",
          "score": 38,
          "created_utc": 1743335783.0,
          "replies": []
        },
        {
          "id": "mki21x7",
          "author": "deliosenvy",
          "body": ".",
          "score": 4,
          "created_utc": 1743333082.0,
          "replies": [
            {
              "id": "mki2mcv",
              "author": "brafwursigehaeck",
              "body": "thumb fact fuzzy pet plants detail price literate scale summer\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": -7,
              "created_utc": 1743333407.0,
              "replies": [
                {
                  "id": "mki2y87",
                  "author": "speculatrix",
                  "body": "Exactly. What Garmin are doing is pre-emptive market segmentation, they're going to nibble away at what you get included so as to gradually force you into a subscription.",
                  "score": 12,
                  "created_utc": 1743333592.0,
                  "replies": [
                    {
                      "id": "mki57ks",
                      "author": "enlouzalou",
                      "body": "Yep. I remember when the very first micro transactions for gaming (console, pc not mobile)  came out. People had this same logic. Well I don’t have to buy it. It’s for people that want to support the devs more (lmao). \nNow look where we are. It would be one thing if it was like expansions of old. Bringing more quality to games. Went from that to disc locked content to nickle and diming. Literal gambling casinos in video games that you can spin unlimited times through digital means.",
                      "score": 18,
                      "created_utc": 1743334800.0,
                      "replies": [
                        {
                          "id": "mkj8g0v",
                          "author": "KnightsLetter",
                          "body": "I hate subscription models for most services but there’s still hundreds of AA and AAA games you can pay once for and get all the meaningful content out of",
                          "score": 0,
                          "created_utc": 1743349727.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mkia56b",
                      "author": "maryanneleanor",
                      "body": "All of these corporations are slowly making everything a subscription, so that consumers never actually own anything. It’s a slow process to chip away at the norms.",
                      "score": 7,
                      "created_utc": 1743337266.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mkihqwh",
                  "author": "Knut79",
                  "body": "It doesn't affect anyone since nonenof these features existed and you can replace basically all of them with other and better apps and probably already have.",
                  "score": 0,
                  "created_utc": 1743340578.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mki378f",
              "author": "None",
              "body": "[deleted]",
              "score": 0,
              "created_utc": 1743333733.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mkigjxc",
      "author": "MxOffcrRtrd",
      "body": "Oo sorry, I dont but subscription platforms. \n\nNew car? Not subscribing to shit",
      "score": 3,
      "created_utc": 1743340087.0,
      "replies": []
    },
    {
      "id": "mkiolz2",
      "author": "hipnotyq",
      "body": "All these companies seriously need to take a good hard look in the mirror and realize they are not fucking World of Warcraft.\n\nThey don't have night elves, they don't have orcs. They need to leave the subscription pay models to the professionals and go back to selling us a singular product with everything included.\n\nSTOP. TRYING. TO. BE. WORLD. OF. WARCRAFT.",
      "score": 4,
      "created_utc": 1743343197.0,
      "replies": []
    },
    {
      "id": "mkj0jt8",
      "author": "WacksWizard",
      "body": "Title is a little misleading, everything that you can do on the watches right now will stay free, this is only for a digitized AI coach. It will not be successful since all they’re doing is riding the AI wave by stapling AI to their product. It’ll be a sunk cost.",
      "score": 3,
      "created_utc": 1743347235.0,
      "replies": [
        {
          "id": "mkjs6s2",
          "author": "themightychris",
          "body": "Yeah I feel like everyone is overreacting. I love my Garmin watch I've had it for like 5 years now. The Connect platform definitely needs some love \n\nI understand that it's not viable to expect my one time purchase of hardware to indefinitely fund updatable software features. Yeah if they started moving features that already came with my watch and its platform behind a paywall that would be shitty, but at this point everyone is just speculating that this is where that's going \n\nIf creating a premium software revenue stream I can opt into enables them to put more resources into adding new capabilities to the hardware I already own, I'm all for it",
          "score": 2,
          "created_utc": 1743355837.0,
          "replies": []
        },
        {
          "id": "mkjsrti",
          "author": "Proof_Bit_8746",
          "body": "But only if people could read",
          "score": 2,
          "created_utc": 1743356011.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkjaexj",
      "author": "Relevant-Doctor187",
      "body": "Need better second hand movement than 5 second increments?   Just buy the second subscription!",
      "score": 5,
      "created_utc": 1743350339.0,
      "replies": []
    },
    {
      "id": "mki8rke",
      "author": "AidanGG",
      "body": "They already lost me after they donated to trump’s campaign. Final nail in the coffin.",
      "score": 7,
      "created_utc": 1743336598.0,
      "replies": [
        {
          "id": "mkj67oy",
          "author": "schu2470",
          "body": "Got a source on that one?",
          "score": 2,
          "created_utc": 1743349035.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkicame",
      "author": "1-800-WhoDey",
      "body": "Welp, have had my garmin for about eight years and havd been considering upgrading..nevermind.",
      "score": 2,
      "created_utc": 1743338260.0,
      "replies": []
    },
    {
      "id": "mkie9fj",
      "author": "jotamon-xiii",
      "body": "I look at the new pebble watches with more interest.",
      "score": 2,
      "created_utc": 1743339123.0,
      "replies": []
    },
    {
      "id": "mkie9sg",
      "author": "snk0752",
      "body": "Time to move to suunto?",
      "score": 2,
      "created_utc": 1743339127.0,
      "replies": []
    },
    {
      "id": "mkiz07i",
      "author": "Pontus_Pilates",
      "body": "> Garmin has introduced a paid tier to its Connect platform, one that offers “Active Intelligence” insights provided by AI, and more.\n\nI presume they'd make more money if opting out of AI slop was the paid tier.",
      "score": 2,
      "created_utc": 1743346736.0,
      "replies": []
    },
    {
      "id": "mkj9wbw",
      "author": "xBeerBaronx",
      "body": "That sucks. I've been a Fit it user for years but their quality went downhill (most recent one stopped holding a charge after like 6 months despite being extra careful with it) and I gave up late last year. My wife got me a Garmin for Christmas and I love it so far. Sad to see they're moving this BS direction.",
      "score": 2,
      "created_utc": 1743350179.0,
      "replies": [
        {
          "id": "mkkypmq",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1743368877.0,
          "replies": [
            {
              "id": "mkl1zg5",
              "author": "xBeerBaronx",
              "body": "Hopefully I won't need one for a while then. Wouldn't surprise me, based on other companies, if they drop support for older devices a little sooner to try to force people onto these ones, though.",
              "score": 1,
              "created_utc": 1743369944.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mkjbunk",
      "author": "Illustrious_You_4223",
      "body": "Forbes are charging same way!? Wft!?",
      "score": 2,
      "created_utc": 1743350791.0,
      "replies": []
    },
    {
      "id": "mkjgjmj",
      "author": "quajeraz-got-banned",
      "body": "Wow, fuck that. And I was just thinking about getting one, too.",
      "score": 2,
      "created_utc": 1743352264.0,
      "replies": []
    },
    {
      "id": "mkjhd0a",
      "author": "RipMcStudly",
      "body": "Damnit. I got my Garmin last year after Strava pulled the same bullshit, and I can’t afford to replace a year old watch",
      "score": 2,
      "created_utc": 1743352523.0,
      "replies": [
        {
          "id": "mkju5du",
          "author": "buffer2722",
          "body": "If you could what would you replace it with? After looking at the list of features they are paywalling my first impression is that I don't really want any of them anyways.",
          "score": 1,
          "created_utc": 1743356425.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkjijk6",
      "author": "2plankerr",
      "body": "Un fucking real",
      "score": 2,
      "created_utc": 1743352894.0,
      "replies": []
    },
    {
      "id": "mkjillk",
      "author": "LasVegasBoy",
      "body": "That's why I buy Shearwater dive computers, not Garmin. Shearwater is more reliable anyways. I will never purchase a Garmin product.",
      "score": 2,
      "created_utc": 1743352912.0,
      "replies": []
    },
    {
      "id": "mkjqcii",
      "author": "-Cephiroth",
      "body": "I can pay $30/yr for every single feature Garmin Connect AND Connect+ provide if I support a smaller dev like u/MyndArc and get the best of Apple Watch AND Garmin metrics. This is really a shame for Garmin, but greed’s gonna greed.",
      "score": 2,
      "created_utc": 1743355278.0,
      "replies": []
    },
    {
      "id": "mkjrp4a",
      "author": "AlaskanSamsquanch",
      "body": "Damn that’s a shame. They were one of the better not Apple Watch options.",
      "score": 2,
      "created_utc": 1743355689.0,
      "replies": []
    },
    {
      "id": "mkjvbav",
      "author": "TheDutch1K",
      "body": "First I bought a Bambu 3d printer, then I got a Garmin running watch. What would you guys like to ruin next, I'm buying.",
      "score": 2,
      "created_utc": 1743356771.0,
      "replies": []
    },
    {
      "id": "mkkkmbd",
      "author": "kalirion",
      "body": "> Garmin claims all features Connect users can currently access for free will remain free, but this marks a major — if predictable — change in the company’s strategy going forwards.\n\nI honestly don't see the problem, as they're not removing any features that you bought the watch for.",
      "score": 2,
      "created_utc": 1743364505.0,
      "replies": []
    },
    {
      "id": "mkkuv1v",
      "author": "keith2600",
      "body": "Garmin? What year is it??? Haven't heard that brand in decades. It's like blackberry releasing a new phone\n\nThough I guess they did miss the smart watch craze by like 10 years. Apple watch only does so well because people would buy a flaccid silicon penis forehead accessory that helicoptered every time you got a text as long as it had an apple logo on it",
      "score": 2,
      "created_utc": 1743367648.0,
      "replies": []
    },
    {
      "id": "mkl2q84",
      "author": "4RCH43ON",
      "body": "The enshitification of all things continues.",
      "score": 2,
      "created_utc": 1743370188.0,
      "replies": []
    },
    {
      "id": "mkl77kl",
      "author": "chicknfly",
      "body": "> “Exclusive badges and challenges”\n\nThis is dumb and clearly the work of an MBA grad who thinks people want to pay for even niche rewards to be included in something gamified. It works in some cases, but come on!",
      "score": 2,
      "created_utc": 1743371685.0,
      "replies": []
    },
    {
      "id": "mklduqp",
      "author": "ThanklessTask",
      "body": "At this rate, it's just going to be me and my pet rock given my hate of paying subscription services for something I've already bought.",
      "score": 2,
      "created_utc": 1743374006.0,
      "replies": []
    },
    {
      "id": "mkm8hmh",
      "author": "Jimmytootwo",
      "body": "They are the DoDo bird",
      "score": 2,
      "created_utc": 1743385200.0,
      "replies": []
    },
    {
      "id": "mkmfmss",
      "author": "Herkfixer",
      "body": "Nothing on the watch is locked behind Connect+. Quit making stuff up for ragebaiting.",
      "score": 2,
      "created_utc": 1743387953.0,
      "replies": []
    },
    {
      "id": "mknzl73",
      "author": "Swurgin",
      "body": "If I've learned one thing fron this whole thing, it's that people don't read.",
      "score": 2,
      "created_utc": 1743418997.0,
      "replies": []
    },
    {
      "id": "mkomko2",
      "author": "turtlebear787",
      "body": "Sounds like they still offer the same free features. This is just extra analytics and more personalized tools. I don't see a problem as long as they keep the base features the same.",
      "score": 2,
      "created_utc": 1743428536.0,
      "replies": []
    },
    {
      "id": "mkorisc",
      "author": "FlyinB",
      "body": "This is for new AI features, not current features.",
      "score": 2,
      "created_utc": 1743430161.0,
      "replies": []
    },
    {
      "id": "mkini6z",
      "author": "romerogj",
      "body": "It looks like everything available is still free. They just want you to pay for AI to tell you your workout wasnt hard enough. Or you can have it share your workout to social media more easily... Frankly. It feels like they are charging you more if you're an insufferable asshole.",
      "score": 3,
      "created_utc": 1743342800.0,
      "replies": []
    },
    {
      "id": "mkjpvmj",
      "author": "None",
      "body": "Garmin just went from A tier to F tier.",
      "score": 3,
      "created_utc": 1743355134.0,
      "replies": []
    },
    {
      "id": "mknnods",
      "author": "nothingexceptfor",
      "body": "The amount of butt hurt comments here.\n\nGarmin is still giving you the same things they have always given you for free, that’s not changing.\n\nWhat they are now charging for is completely new extra features, why do you think you’re entitled to new features for free for ever is beyond me.\n\nRegardless, this is just the AI stuff, which is funny because if Garmin was giving this service for free people will be screaming “WhY are you shoving this AI crap down our throats !” like they do with every company who offers it for free",
      "score": 4,
      "created_utc": 1743411918.0,
      "replies": []
    },
    {
      "id": "mki8qmm",
      "author": "traydragen",
      "body": "Dang it. Time to sell my Fenix 😢",
      "score": 2,
      "created_utc": 1743336586.0,
      "replies": []
    },
    {
      "id": "mkibg9z",
      "author": "enlightenedllamas",
      "body": "Their devices are great but already really expensive and this was the one thing that kept me from picking Apple Watch over them. Boo garmen!",
      "score": 2,
      "created_utc": 1743337878.0,
      "replies": []
    },
    {
      "id": "mkiry4l",
      "author": "thoughtbludgeon",
      "body": "Never buy a garmin, got it.",
      "score": 2,
      "created_utc": 1743344359.0,
      "replies": []
    },
    {
      "id": "mkisp9s",
      "author": "None",
      "body": "Subscriptions for static products should be illegal",
      "score": 2,
      "created_utc": 1743344617.0,
      "replies": []
    },
    {
      "id": "mkjfccw",
      "author": "baoo",
      "body": "I was going to get a watch to monitor my workouts in a few months. Garmin was my top pick because my wife had a great experience with her Garmin. But if Garmin requires a subscription, I will avoid them. If there is nothing available without subscription fees, I will just admit to myself that watches are non essential. I need to work out, but I don't *need* to know my heart rate.",
      "score": 2,
      "created_utc": 1743351883.0,
      "replies": [
        {
          "id": "mklpbgk",
          "author": "cinderubella",
          "body": "You're catastrophizing. You don't need a subscription to see your heart rate. There's nothing of value behind the paywall right now and for the foreseeable. ",
          "score": 1,
          "created_utc": 1743378025.0,
          "replies": [
            {
              "id": "mklv51z",
              "author": "baoo",
              "body": "Thanks",
              "score": 1,
              "created_utc": 1743380135.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mkjms4p",
      "author": "HotHardandSingle",
      "body": "Boycott Garmin!",
      "score": 2,
      "created_utc": 1743354199.0,
      "replies": []
    },
    {
      "id": "mkjorfs",
      "author": "scrandis",
      "body": "Glad I didn't buy one. I was very close to buying one until I heard about this a week ago.",
      "score": 2,
      "created_utc": 1743354796.0,
      "replies": []
    },
    {
      "id": "mkjovjr",
      "author": "HappilyDepressed01",
      "body": "Nice. I've been pretty close to buying a Garmin fitness watch for a while and now I'm absolutely certain that I'm not going to.",
      "score": 2,
      "created_utc": 1743354830.0,
      "replies": []
    },
    {
      "id": "mkl2x4r",
      "author": "bigbadchief",
      "body": "This thread is full of people who didn't bother to read past the headline",
      "score": 2,
      "created_utc": 1743370252.0,
      "replies": [
        {
          "id": "mkl2yms",
          "author": "SokkaHaikuBot",
          "body": "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^bigbadchief:\n\n*This thread is full of*\n\n*People who didn't bother*\n\n*To read past the headline*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
          "score": 1,
          "created_utc": 1743370266.0,
          "replies": []
        },
        {
          "id": "mklhbi1",
          "author": "lovatone",
          "body": "See what lovely misleading messages come from the media?",
          "score": 1,
          "created_utc": 1743375239.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkl3c52",
      "author": "Mustangnut001",
      "body": "I’m in the market for a fitness watch. I’ve started the research, Garmin WAS in the mix of watches I was looking at. Not any more.\n\nI’m glad this came out before I purchased.",
      "score": 2,
      "created_utc": 1743370390.0,
      "replies": []
    },
    {
      "id": "mkmwsxh",
      "author": "MechCADdie",
      "body": "If only there was a government agency that would look out for the consumer in bait and switch tactics....oh wait, *we are actively trying to dismantle them*",
      "score": 2,
      "created_utc": 1743395565.0,
      "replies": [
        {
          "id": "mkn47lm",
          "author": "ocean_lei",
          "body": "And in fact Consumer Financial Protection Bureau was one of the first targeted (also perhaps associated with Musks plans:  https://democrats-judiciary.house.gov/uploadedfiles/2025.02.13_fact_sheet_re_musk_investigations.pdf",
          "score": 1,
          "created_utc": 1743399499.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkih7fq",
      "author": "Knut79",
      "body": "Nothing in cinnect+ is necessary at all. And all functionality remains without paying.",
      "score": 2,
      "created_utc": 1743340357.0,
      "replies": [
        {
          "id": "mkiix4a",
          "author": "jcliment",
          "body": "For now?",
          "score": 3,
          "created_utc": 1743341052.0,
          "replies": [
            {
              "id": "mkik32j",
              "author": "Knut79",
              "body": "Why assume they're going to make regular features paid?",
              "score": -3,
              "created_utc": 1743341510.0,
              "replies": [
                {
                  "id": "mkine1i",
                  "author": "jcliment",
                  "body": "That's why I added a question mark. Many many companies are doing it, and even a term exists for that process: enshitification.",
                  "score": 2,
                  "created_utc": 1743342759.0,
                  "replies": [
                    {
                      "id": "mkj77d2",
                      "author": "Knut79",
                      "body": "Actually most companies adding paid tiers have added new features to it and not moved free features into the paid unless it was done initially.",
                      "score": -4,
                      "created_utc": 1743349343.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mki32af",
      "author": "airbagfailure",
      "body": " I switched to Garmin cause Fitbit got bought my Google. Should have just gotten an Apple Watch . Dammit.",
      "score": 1,
      "created_utc": 1743333656.0,
      "replies": [
        {
          "id": "mki8655",
          "author": "Mrjlawrence",
          "body": "How is apple different?",
          "score": 7,
          "created_utc": 1743336305.0,
          "replies": [
            {
              "id": "mki8v0h",
              "author": "airbagfailure",
              "body": "They already have all my stuff. So does Google, I just don’t like Google. 🤷🏽‍♀️\n\nAt least I don’t have to subscribe if I don’t want to.",
              "score": -4,
              "created_utc": 1743336646.0,
              "replies": [
                {
                  "id": "mki97hv",
                  "author": "Mrjlawrence",
                  "body": "I understand if you already have your stuff but regarding Garmin you don’t have to subscribe to the new connect+",
                  "score": 2,
                  "created_utc": 1743336815.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mki89pl",
          "author": "bluemuffin10",
          "body": "The Apple Watch has horrendous battery life if all you want is a clock and fitness tracker.",
          "score": 7,
          "created_utc": 1743336355.0,
          "replies": [
            {
              "id": "mkicrks",
              "author": "sgrams04",
              "body": "I’ve had mine for two years. While I love it, it can no longer make it through an entire day. I’ve turned off always-on screen and the like and it’s no longer a viable wear for me. ",
              "score": 3,
              "created_utc": 1743338474.0,
              "replies": [
                {
                  "id": "mkiedtj",
                  "author": "bluemuffin10",
                  "body": "Yep. A lot of people get smart watches to motivate them into being more active. If they are already using Apple devices then an Apple Watch seems like the natural choice. Only it's really one of the worst choices you could make for that use case. Not only can other watches integrate with Apple Health (if you want to stay in the Apple ecosystem), but they'll keep their charge for 1 week+ compared to 1 day for Apple.",
                  "score": 1,
                  "created_utc": 1743339176.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mki8qf2",
              "author": "airbagfailure",
              "body": "Good to know. Thanks!",
              "score": 2,
              "created_utc": 1743336583.0,
              "replies": []
            },
            {
              "id": "mkimdfu",
              "author": "None",
              "body": "AW Ultra solves the battery dilemma for the most part",
              "score": 1,
              "created_utc": 1743342387.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mki8w8f",
          "author": "zkareface",
          "body": "Look at Polar instead, apple is the worst of the worst when it come to these things.",
          "score": 0,
          "created_utc": 1743336663.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkilf1m",
      "author": "TheJasonaut",
      "body": "Just to be clear, they are ADDING features, seemingly revolving around Ai insights/coaching, that users can get access to with Connect+. \n\nI’m not saying this is great, but the title might make it seem like they are TAKING AWAY access to features and putting them in a payed tier.",
      "score": 3,
      "created_utc": 1743342027.0,
      "replies": []
    },
    {
      "id": "mki5lk1",
      "author": "MaximumUpstairs2333",
      "body": "Fuck",
      "score": 1,
      "created_utc": 1743335002.0,
      "replies": []
    },
    {
      "id": "mkih7v4",
      "author": "Wisdomlost",
      "body": "This explains why I've been getting emails about my old golf watch I dont use anymore.",
      "score": 1,
      "created_utc": 1743340361.0,
      "replies": []
    },
    {
      "id": "mkipjhm",
      "author": "SpeakerCareless",
      "body": "Ughh I hate this. I’ve been a Garmin user since about 2017. I got tired of shitty fitbits that lasted a year, and I was furious when Runkeeper, which was originally a pay once app in the early days of smart phones, became a subscription model and I promptly stopped using it for run tracking. \n\nGarmins have a great battery life, are easy to read in daylight, waterproof long before other smart watches, and most of all- I had data ownership. Plus actual GPS and not just phone triangulation. \n\nNow I’m gonna have to figure out how to download 8 years of data from them in case they decide to paywall it.",
      "score": 1,
      "created_utc": 1743343524.0,
      "replies": []
    },
    {
      "id": "mkipy9m",
      "author": "stprnn",
      "body": "Never invest in hardware that only runs proprietary software.",
      "score": 1,
      "created_utc": 1743343668.0,
      "replies": [
        {
          "id": "mkjucp0",
          "author": "ElectricHowler",
          "body": "What kind of car do you drive? Do you own a TV made in the last decade? How about a stand alone digital camera? Everything has software nowadays, other than computer, networking & personal devices you're not replacing the software. I guess I'm not opposed to living in a cabin in the woods though.",
          "score": 1,
          "created_utc": 1743356487.0,
          "replies": [
            {
              "id": "mkjxv6e",
              "author": "stprnn",
              "body": "\"oh my foot got wet, I might as well drown\"\n\n\nPathetic attitude.",
              "score": 1,
              "created_utc": 1743357521.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkkbsha",
          "author": "Tek_Freek",
          "body": "Never buy any electronic devices.\n\nI guess the poster who gave a smart-assed reply went home.",
          "score": 1,
          "created_utc": 1743361760.0,
          "replies": [
            {
              "id": "mkki89a",
              "author": "stprnn",
              "body": "Plenty of devices run free software. If you are ignorant that's your problem don't make it ours.",
              "score": 1,
              "created_utc": 1743363766.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mkiqk0w",
      "author": "Longhag",
      "body": "Guess I won't be replacing my Fenix 3 with another Garmin device.  Back to the trusty Citizen divers watch!",
      "score": 1,
      "created_utc": 1743343880.0,
      "replies": []
    },
    {
      "id": "mkiqtdd",
      "author": "GoChaca",
      "body": "After a couple of weeks of casual research, I decided I was going to get my first garment. I was going to buy it today but after seeing articles about this all weekend, they just lost my $500.",
      "score": 1,
      "created_utc": 1743343971.0,
      "replies": [
        {
          "id": "mkirof5",
          "author": "ProtomanBn",
          "body": "None of what you've been reading is true, all the useful Garmin features are still free and nothing gas been locked behind a paywall except a AI run down combining info from the graphs and they added a bunch of new graphs that compile all the graphs into one. \n\nIf you're into fitness and plan on using it for fitness then it still got all its features and is amazing",
          "score": 2,
          "created_utc": 1743344268.0,
          "replies": [
            {
              "id": "mkiu6z3",
              "author": "GoChaca",
              "body": "I also read that but it’s a slippery slope. I would expect them to slowly, but surely start taking away free features and adding them to their paid content. It’s how the business model works. I don’t want to invest into that.",
              "score": 2,
              "created_utc": 1743345126.0,
              "replies": [
                {
                  "id": "mkjoc24",
                  "author": "AnRealDinosaur",
                  "body": "Same here. I have a garmin that I absolutely love. Even if things stay as they are and they don't lock any more features behind a paywall, my next watch will not be another garmin because I am sick to death of subscription models and Ai and I won't financially support a brand that pushes them. I'm genuinely bummed by this news.",
                  "score": 1,
                  "created_utc": 1743354670.0,
                  "replies": []
                },
                {
                  "id": "mkiv391",
                  "author": "ProtomanBn",
                  "body": "You're talking about an undetermined future as if it's absolute.\n\nWhat fitness smartwatch are you going to switch to?",
                  "score": 1,
                  "created_utc": 1743345428.0,
                  "replies": [
                    {
                      "id": "mkiwatk",
                      "author": "GoChaca",
                      "body": "None. I’ll simply exercise and listen to my body.",
                      "score": 1,
                      "created_utc": 1743345838.0,
                      "replies": [
                        {
                          "id": "mkkblth",
                          "author": "Tek_Freek",
                          "body": "It's like everyone forgot that they used to track all this without a $500 watch. smh",
                          "score": 1,
                          "created_utc": 1743361704.0,
                          "replies": []
                        },
                        {
                          "id": "mkixa6v",
                          "author": "ProtomanBn",
                          "body": "Ok lol",
                          "score": 0,
                          "created_utc": 1743346166.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mkiuul8",
      "author": "cyclingkingsley",
      "body": "The only thing that pulls me towards Garmin is how good their customer support and flexible their gadget replacement even outside of warranty.....I hope those don't get impacted in the future. \n\n\nBut I'm also looking at Suunto Racer S so hopefully that becomes my next watch :D",
      "score": 1,
      "created_utc": 1743345347.0,
      "replies": []
    },
    {
      "id": "mkiwrjx",
      "author": "Pergaminopoo",
      "body": "Pathetic",
      "score": 1,
      "created_utc": 1743345994.0,
      "replies": []
    },
    {
      "id": "mkiy53c",
      "author": "Lackluster_Compote",
      "body": "Can we just avoid updated the app?",
      "score": 1,
      "created_utc": 1743346451.0,
      "replies": []
    },
    {
      "id": "mkiyb4g",
      "author": "Panda-Maximus",
      "body": "\"Why is everyone using maps on phones?...\"",
      "score": 1,
      "created_utc": 1743346506.0,
      "replies": []
    },
    {
      "id": "mkiycqx",
      "author": "Bobudisconlated",
      "body": "Will it allow you to export gpx files in batch? Or still only one at a time? \n\n*Check notes*\n\nNope. In fact, none of those additions are worth a subscription fee.",
      "score": 1,
      "created_utc": 1743346521.0,
      "replies": []
    },
    {
      "id": "mkj12om",
      "author": "YnotBbrave",
      "body": "It’s legal and their right but makes me not want to give them my money",
      "score": 1,
      "created_utc": 1743347404.0,
      "replies": []
    },
    {
      "id": "mkj1vh4",
      "author": "internetlad",
      "body": "This sucks  I've loved my Garmin so far and it's not like the watches are cheap.",
      "score": 1,
      "created_utc": 1743347658.0,
      "replies": []
    },
    {
      "id": "mkj3l2v",
      "author": "DawnPatrol99",
      "body": "I just got this fucking watch.....",
      "score": 1,
      "created_utc": 1743348206.0,
      "replies": []
    },
    {
      "id": "mkj5q89",
      "author": "sbkg0002",
      "body": "Ok bye",
      "score": 1,
      "created_utc": 1743348883.0,
      "replies": []
    },
    {
      "id": "mkj8dxs",
      "author": "cloudxnine",
      "body": "Can these be jailbroken to unlock all features?",
      "score": 1,
      "created_utc": 1743349709.0,
      "replies": [
        {
          "id": "mkjii67",
          "author": "runsonpedals",
          "body": "Give it a few weeks and someone will post it",
          "score": 1,
          "created_utc": 1743352882.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkjibxd",
      "author": "vogueboy",
      "body": "I'll probably replace my Garmin Venue 2s in 1 year or so\n\nIf by then they move free features to some new basic paid tier I'm getting a Coroa or Samsung",
      "score": 1,
      "created_utc": 1743352828.0,
      "replies": []
    },
    {
      "id": "mkjveii",
      "author": "Fertuft",
      "body": "Capitalism does foster innovation, but its innovation in extracting more money from customers for the same thing then extracting same money for worse thing, then repeating",
      "score": 1,
      "created_utc": 1743356798.0,
      "replies": []
    },
    {
      "id": "mkjy0co",
      "author": "Poetryisalive",
      "body": "I’ll just go back to the versa 4",
      "score": 1,
      "created_utc": 1743357564.0,
      "replies": []
    },
    {
      "id": "mkk19rz",
      "author": "i-amnot-a-robot-",
      "body": "Garmins whole point of their smartwatch line was to introduce people into the ecosystem so they’d buy their products for boats, airplanes, etc. all this does is piss off anyone who has a watch. \n\nClassic example of fucking your future for short term profit",
      "score": 1,
      "created_utc": 1743358550.0,
      "replies": []
    },
    {
      "id": "mkk1oze",
      "author": "TwilightGraphite",
      "body": "Seems like they’re trying to make it more like Strava, which people seem to like. Don’t really see what the big fuss is since the paid features are new, not existing.",
      "score": 1,
      "created_utc": 1743358681.0,
      "replies": []
    },
    {
      "id": "mkkamju",
      "author": "ideliver12345",
      "body": "Look up coros watches. Pretty similar to garmin but cheaper and almost as feature rich. Maybe not as “smart” but services are free. Best battery life for the price.",
      "score": 1,
      "created_utc": 1743361403.0,
      "replies": []
    },
    {
      "id": "mkkc7li",
      "author": "vdreamin",
      "body": "Does it still not link with Health Connect??",
      "score": 1,
      "created_utc": 1743361888.0,
      "replies": []
    },
    {
      "id": "mkkchj5",
      "author": "RiddlingJoker76",
      "body": "That’s it.",
      "score": 1,
      "created_utc": 1743361972.0,
      "replies": []
    },
    {
      "id": "mkkcvx2",
      "author": "Bruggenmeister",
      "body": "My own bank app only allows applepay or garmin… fuck me",
      "score": 1,
      "created_utc": 1743362094.0,
      "replies": []
    },
    {
      "id": "mkkd0js",
      "author": "ThePublikon",
      "body": "Oh.\n\nI was about to buy one of their premium watches too. Oh well.",
      "score": 1,
      "created_utc": 1743362132.0,
      "replies": []
    },
    {
      "id": "mkkg6yq",
      "author": "rellett",
      "body": "bosch is doing this crap to dishwashers need a app to rinse etc its free now but it will change need to stop buying this crap",
      "score": 1,
      "created_utc": 1743363125.0,
      "replies": []
    },
    {
      "id": "mkkjal2",
      "author": "Spectre1-4",
      "body": "I had a Venus 2S and shit was busted like 2 months after I bought it. Good thing I didn’t get another one.",
      "score": 1,
      "created_utc": 1743364097.0,
      "replies": []
    },
    {
      "id": "mkkjdfd",
      "author": "Mabon_Bran",
      "body": "Bruh, I bought garmin few months ago. I was pretty happy with it....",
      "score": 1,
      "created_utc": 1743364121.0,
      "replies": []
    },
    {
      "id": "mkklsvf",
      "author": "downtimeredditor",
      "body": "If they do I'll probably just not use it. \n\nAs long as I get my date/time, steps,  HR I'm good \n\nThe body battery for me is a bit inaccurate cause I'd have numerous days where it says my body battery is around 15-20 and I do a bunch of shit with no issues that day. \n\nHRV for the longest time kept saying it was poor and it finally got back to normal after I stopped exercising.\n\nActually funny enough one of the days my body battery went up to close 60 I went drinking with my friends the night prior and passed out drunk. \n\nSo yeah I don't really need that other shit. \n\nIf anything i may abandon fitness watches entirely and just go about eating healthy and exercising and shit",
      "score": 1,
      "created_utc": 1743364870.0,
      "replies": []
    },
    {
      "id": "mkkooo9",
      "author": "Ikavor",
      "body": "Ah.. I've wanted to buy a Garmin for a while now. I just changed my mind",
      "score": 1,
      "created_utc": 1743365748.0,
      "replies": []
    },
    {
      "id": "mkkp3wd",
      "author": "No-Courage-2053",
      "body": "Returned to my good old casio a long time ago. Syncs time with radio, and battery self charges with light. Took me way too long (2 years) to realise that having to charge a watch is DUMB. I'm glad I'm out before the \"paying to get all the features the watch offers\".",
      "score": 1,
      "created_utc": 1743365877.0,
      "replies": []
    },
    {
      "id": "mkkr17l",
      "author": "Daddywitchking",
      "body": "Cool, I just got a garmin for Christmas, just in time!!!",
      "score": 1,
      "created_utc": 1743366463.0,
      "replies": []
    },
    {
      "id": "mkkvfaq",
      "author": "NouvelErmitage",
      "body": "I mean, it's not all bad, given that Garmin won't continue this trend and start paywalling existing features. I've no problem having to pay for AI (I won't, but it doesn't matter to me). The new feature is AI insights. Big deal. Whoever wants to pay will pay.",
      "score": 1,
      "created_utc": 1743367822.0,
      "replies": []
    },
    {
      "id": "mkkwbf7",
      "author": "Thoresus",
      "body": "How disappointing. I've had Garmin watches for close to 20 years and now it'll be time to change brands. \n\nAnd my last was the the Fenix 8",
      "score": 1,
      "created_utc": 1743368102.0,
      "replies": []
    },
    {
      "id": "mkkz9ia",
      "author": "StoxAway",
      "body": "If the active intelligence thing is anything like Stravas then it will literally just explain the data that you already have in a conversational paragraph. It's not worth it at all.",
      "score": 1,
      "created_utc": 1743369056.0,
      "replies": []
    },
    {
      "id": "mkkzeyj",
      "author": "standardtissue",
      "body": "The features sound horrible.  Are you sure they aren't charing to NOT impose those features on you ? \n\n  \nYour Connect dashboard will now be peppered with AI-generated commentary on your activities, making the experience appear more personalized and conversational. ",
      "score": 1,
      "created_utc": 1743369105.0,
      "replies": []
    },
    {
      "id": "mkkzmin",
      "author": "M4NOOB",
      "body": "I guess the Garmin on my wrist is the last Garmin I bought then around 3 years ago. Annoying as I wanted to replace it maybe next year or a bit later",
      "score": 1,
      "created_utc": 1743369174.0,
      "replies": []
    },
    {
      "id": "mkkzyyv",
      "author": "9Tecpatl",
      "body": "So glad I opted for the Coros.",
      "score": 1,
      "created_utc": 1743369286.0,
      "replies": []
    },
    {
      "id": "mkl12t9",
      "author": "Familiar_Resident_69",
      "body": "Sorry it’s because I just bought one.",
      "score": 1,
      "created_utc": 1743369645.0,
      "replies": []
    },
    {
      "id": "mkl7pem",
      "author": "tworaspberries",
      "body": "I bought a Garmin, super excited about the map feature cause, you know, it's a Garmin. And I still have never used it for that feature cause the good app cost money.  ",
      "score": 1,
      "created_utc": 1743371853.0,
      "replies": []
    },
    {
      "id": "mkl8bar",
      "author": "celticchrys",
      "body": "Who else makes something as small as a Garmin Lily?",
      "score": 1,
      "created_utc": 1743372059.0,
      "replies": []
    },
    {
      "id": "mklbzqd",
      "author": "sryidc",
      "body": "Guess it’s back to the pebble for me.",
      "score": 1,
      "created_utc": 1743373344.0,
      "replies": []
    },
    {
      "id": "mklim8j",
      "author": "raptir1",
      "body": "I like that Forbes popped up with a request to subscribe as I was reading this article. ",
      "score": 1,
      "created_utc": 1743375687.0,
      "replies": []
    },
    {
      "id": "mkltxbx",
      "author": "johyongil",
      "body": "Lol.",
      "score": 1,
      "created_utc": 1743379684.0,
      "replies": []
    },
    {
      "id": "mklu6d1",
      "author": "The-Gargoyle",
      "body": "Garmin is still around..?\n\nHuh.\n\n(Stop buying products that do this shit, people.)",
      "score": 1,
      "created_utc": 1743379777.0,
      "replies": []
    },
    {
      "id": "mklv4ij",
      "author": "ridemooses",
      "body": "This is a one-way ticket to buy a different brand.",
      "score": 1,
      "created_utc": 1743380130.0,
      "replies": []
    },
    {
      "id": "mklvb0g",
      "author": "twitch-switch",
      "body": "Whenever I buy anything now I ask the store person \"Only show me things that don't need a subscription\" ironically this is how I got my Garmin watch years ago it was a old model that didn't need subscriptions getting phased out.",
      "score": 1,
      "created_utc": 1743380197.0,
      "replies": []
    },
    {
      "id": "mklychh",
      "author": "RubiconAlpha",
      "body": "Another happy reason for leaving my Fenix 7x for an Apple Watch 10",
      "score": 1,
      "created_utc": 1743381338.0,
      "replies": []
    },
    {
      "id": "mklzka3",
      "author": "ChillAMinute",
      "body": "I had a snarky response written but what’s the point. If companies somehow think slapping an “AI” label on a sub-par feature set is going to get them another revenue stream after charging $750+ for the device you can forget it.",
      "score": 1,
      "created_utc": 1743381800.0,
      "replies": []
    },
    {
      "id": "mkm02lv",
      "author": "BitemarksLeft",
      "body": "I was thinking about moving across as I de-apple my life. What a shame. Anyone know of a good alternative that isn’t android, apple or Garmin? I refuse to pay subscriptions or extra’s on hardware I own.",
      "score": 1,
      "created_utc": 1743381992.0,
      "replies": []
    },
    {
      "id": "mkm8bwd",
      "author": "roryseiter",
      "body": "My day to day experience hasn’t changed with my instinct.",
      "score": 1,
      "created_utc": 1743385139.0,
      "replies": []
    },
    {
      "id": "mkmgji7",
      "author": "Rockhardsimian",
      "body": "Just bought a new one last month",
      "score": 1,
      "created_utc": 1743388314.0,
      "replies": []
    },
    {
      "id": "mkmj5b7",
      "author": "Ok-Interaction-8917",
      "body": "I have used Garmin to track thousands of miles I have run with connect to record them and honestly I am not sure why so many want the extra features or would pay for what used to be free. I just care about the map, how fast, the elevation, the duration, how far I went and the heart rate. The heart rate has been a game changer. It alerted me to COVID twice. But you can track this info on almost any fitness smartwatch whether it be an Apple Watch or Amazon.  Garmin connect seems to be hacked by ransomware once a year.  If they charge for the basic features I described, there is no shortage of alternatives out there.",
      "score": 1,
      "created_utc": 1743389368.0,
      "replies": []
    },
    {
      "id": "mkmmsfn",
      "author": "hotcoolhot",
      "body": "Only software features mostly AI related. Makes sense.",
      "score": 1,
      "created_utc": 1743390912.0,
      "replies": []
    },
    {
      "id": "mkmps6m",
      "author": "bsmp1971",
      "body": "Buy a COROS watch. Problem solved",
      "score": 1,
      "created_utc": 1743392237.0,
      "replies": []
    },
    {
      "id": "mkmtcw8",
      "author": "JasiNtech",
      "body": "Buy wahoo? Got it",
      "score": 1,
      "created_utc": 1743393879.0,
      "replies": []
    },
    {
      "id": "mkn3f00",
      "author": "None",
      "body": "I have Casio F108WH. Gives me accurate time, takes alot of beating, and don't have to pay a monthly fee to unlock its features. ...oh the battery lasts forever too.",
      "score": 1,
      "created_utc": 1743399053.0,
      "replies": []
    },
    {
      "id": "mknel5n",
      "author": "iwouldntknowthough",
      "body": "lol stick with Apple Watch",
      "score": 1,
      "created_utc": 1743405829.0,
      "replies": [
        {
          "id": "mknn7e5",
          "author": "nothingexceptfor",
          "body": "Yes because Apple doesn’t charge for extra features and services",
          "score": 0,
          "created_utc": 1743411603.0,
          "replies": [
            {
              "id": "mknonz1",
              "author": "iwouldntknowthough",
              "body": "No, the Trainings app is for free and there are no extra features you can unlock for money.",
              "score": 0,
              "created_utc": 1743412578.0,
              "replies": [
                {
                  "id": "mkpcnsy",
                  "author": "nothingexceptfor",
                  "body": "The training features and all of the other features you have enjoyed so far for free will remain free in Garmin, it is only the new AI stuff they’re charging for",
                  "score": 2,
                  "created_utc": 1743436619.0,
                  "replies": [
                    {
                      "id": "mkpmn60",
                      "author": "iwouldntknowthough",
                      "body": "I have never enjoyed them. I don’t even own a Garmin.",
                      "score": -1,
                      "created_utc": 1743439616.0,
                      "replies": [
                        {
                          "id": "mkpvu3q",
                          "author": "nothingexceptfor",
                          "body": "Then what the F are you doing commenting on this ? Trolling ?",
                          "score": 1,
                          "created_utc": 1743442338.0,
                          "replies": [
                            {
                              "id": "mkq8c46",
                              "author": "iwouldntknowthough",
                              "body": "I’m talking about the training app on the Apple Watch my dude",
                              "score": 0,
                              "created_utc": 1743446034.0,
                              "replies": [
                                {
                                  "id": "mkqj0sf",
                                  "author": "nothingexceptfor",
                                  "body": "in a post about Garmin",
                                  "score": 1,
                                  "created_utc": 1743449235.0,
                                  "replies": [
                                    {
                                      "id": "mkqkwnd",
                                      "author": "iwouldntknowthough",
                                      "body": "Yes but this thread is about the Apple Watch",
                                      "score": 0,
                                      "created_utc": 1743449808.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mknhn05",
      "author": "Voice_Still",
      "body": "Guess I’m not buying one then.",
      "score": 1,
      "created_utc": 1743407851.0,
      "replies": []
    },
    {
      "id": "mknksxr",
      "author": "guybrushthriftweed",
      "body": "I hate everything about this. \n\nI was always okay with paying a premium for a Garmin device because the software was \"free\". I mean they did soft-lock new features by not giving them to older devices that were perfectly capable of utilizing them and we lived with it. \n\nIf they decide to stick with this model it will be the last Garmin device for me and I'll look to Coros or Suunto.",
      "score": 1,
      "created_utc": 1743410008.0,
      "replies": [
        {
          "id": "mknnag4",
          "author": "nothingexceptfor",
          "body": "They too will adopt this model, anyways you will still get the same services you have been getting so far for free, it is extra stuff that cost, why would extra stuff be for free?",
          "score": 1,
          "created_utc": 1743411659.0,
          "replies": [
            {
              "id": "mknpbb5",
              "author": "ruappana",
              "body": "If you get people to pay for the ”premium” what are the next steps? First you cut down update frequency for current connect features and after that reducing what you get when buying a device. It is exactly the same trend that is adopted for example by the BMW.",
              "score": 0,
              "created_utc": 1743413005.0,
              "replies": [
                {
                  "id": "mkpjm29",
                  "author": "nothingexceptfor",
                  "body": "Update frequency will get cut down regardless, it is the regular cycle of every service and software, as software gets older it gets less frequent updates until it gets none",
                  "score": 1,
                  "created_utc": 1743438694.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mknr8bo",
      "author": "Wizard-of-pause",
      "body": "7 bucks is getting me access to vast library of media to consume for hours, pushing gigabytes of data to my device. Garmin wants that much for AI to sometimes take a 1 second look at my running stats. What a fucking joke.",
      "score": 1,
      "created_utc": 1743414240.0,
      "replies": []
    },
    {
      "id": "mkpuosi",
      "author": "Motorista_de_uber",
      "body": "Are they trying to monetize features? That looks like a bad move.  \nIf they see themselves as a platform, they should monetize through apps. They already have an app store, but it has very few apps, most of which are useless.  \nIf they focus purely on hardware, they have plenty of models, where the more expensive ones are the most feature-rich.  \nHowever, if they're planning to sell specialized services that require a backend server with cloud storage, then maybe it makes sense, since people are used to paying extra for services like Strava",
      "score": 1,
      "created_utc": 1743442006.0,
      "replies": []
    },
    {
      "id": "mkqfpaf",
      "author": "ImNasty720",
      "body": "Was looking to replace my Apple Watch with a Garmin, guess that's not happening!",
      "score": 1,
      "created_utc": 1743448240.0,
      "replies": []
    },
    {
      "id": "mkqfxqc",
      "author": "kurisu7885",
      "body": "Well then those people aren't owners.",
      "score": 1,
      "created_utc": 1743448309.0,
      "replies": []
    },
    {
      "id": "mkqqzin",
      "author": "SquidDaddy81",
      "body": "Lower the cost of each device by 50%. Then, maybe.",
      "score": 1,
      "created_utc": 1743451596.0,
      "replies": []
    },
    {
      "id": "mkrb1vq",
      "author": "slickrasta",
      "body": "Enshittification",
      "score": 1,
      "created_utc": 1743457755.0,
      "replies": []
    },
    {
      "id": "mkuwkru",
      "author": "shugo7",
      "body": "Looks like I ain't buying Garmin Garbage then",
      "score": 1,
      "created_utc": 1743516640.0,
      "replies": []
    },
    {
      "id": "ml1meyu",
      "author": "Ch33kyMnk3y",
      "body": "Going to play devils advocate here just a tiny bit... I HATE subscription models as much as the next guy, however the article specifically states all existing features remain available with the purchase of the watch. If the subscription based features being discussed are utilizing AI, I can kind of understand why they want to charge for it, due to the infrastructure required behind the scenes to make LLMs function. That said, it's a slippery slope as others have mentioned. Investors salivate at the mouth at this kind of stuff. If they see people are willing to pay for this, no telling what else they will also just migrate to this model.",
      "score": 1,
      "created_utc": 1743610519.0,
      "replies": []
    },
    {
      "id": "mlb6kod",
      "author": "HairyPalmieri",
      "body": "This can’t possibly mean - though I hope it does - that the physical devices will see a decrease in price right? And then Garmin shifts their revenue to the longer tail subscriptions? If a forerunner costs 500 bucks still - I’m out",
      "score": 1,
      "created_utc": 1743733891.0,
      "replies": []
    },
    {
      "id": "mki22lf",
      "author": "Beginning-City-7085",
      "body": "Just when I started to look at Garmin watches. Well that settles it 😄",
      "score": 1,
      "created_utc": 1743333093.0,
      "replies": []
    },
    {
      "id": "mki8j0m",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1743336482.0,
      "replies": [
        {
          "id": "mkj5of6",
          "author": "void_const",
          "body": "How do you pirate a cloud service?",
          "score": 2,
          "created_utc": 1743348867.0,
          "replies": []
        },
        {
          "id": "mkjsf4y",
          "author": "ElectricHowler",
          "body": "Maybe read the article?",
          "score": 1,
          "created_utc": 1743355906.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mki61ex",
      "author": "TheBatmanIRL",
      "body": "None of these trackers are worth paying for anyways....the base Garmin Connect features are plenty.",
      "score": 0,
      "created_utc": 1743335230.0,
      "replies": [
        {
          "id": "mki8w0d",
          "author": "darkknight302",
          "body": "For now, sooner or later they’re gonna strip it down so bad you’re gonna be forced to subscribe.",
          "score": 1,
          "created_utc": 1743336660.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkicke8",
      "author": "Dopapotomous",
      "body": "I’ll just keep my nearly indestructible Apple Watch Ultra. That thing goes through hell and back and not one scratch on the screen, swam in the ocean, dropped on concrete, banged around bricks, plaster and mortar, swimming pools, smacked on nails, crawled under houses with shells, brick and glass, this thing just keeps going. The fabric wristband is slightly frayed in 1 1cm spot maybe? lol.",
      "score": 1,
      "created_utc": 1743338383.0,
      "replies": []
    },
    {
      "id": "mkid434",
      "author": "splinter6",
      "body": "Step 1. Lock all features behind paywall. \nStep 2. End support for the device",
      "score": 1,
      "created_utc": 1743338628.0,
      "replies": []
    },
    {
      "id": "mkifnch",
      "author": "w35t3r0s",
      "body": "Back to my Casio….",
      "score": 1,
      "created_utc": 1743339710.0,
      "replies": []
    },
    {
      "id": "mkijimb",
      "author": "DaveVdE",
      "body": "Nothing changes to the features that you already have. Only the AI features require a paid subscription. Nothing to see here.",
      "score": 1,
      "created_utc": 1743341287.0,
      "replies": []
    },
    {
      "id": "mkinkmi",
      "author": "blueblurspeedspin",
      "body": "capitalism eating itself in real time. love to see it",
      "score": 1,
      "created_utc": 1743342824.0,
      "replies": []
    },
    {
      "id": "mkj2150",
      "author": "Weaubleau",
      "body": "Fuck subscriptions.",
      "score": 1,
      "created_utc": 1743347709.0,
      "replies": []
    },
    {
      "id": "mkj90cg",
      "author": "jaywalkintotheocean",
      "body": "the two garmin watches i've owned have been garbage anyway. the connect app is borderline unusable, the watch doesn't sync and load data ever when you need it to, there's endless weird notifications that I never wanted in the first place that magically turn themselves back on with every \"update\". I could go on and on. fuck that company and their half broken expensive shit.",
      "score": 1,
      "created_utc": 1743349901.0,
      "replies": [
        {
          "id": "mkj98lx",
          "author": "Kick_Kick_Punch",
          "body": "Could you specify which models?",
          "score": 1,
          "created_utc": 1743349973.0,
          "replies": [
            {
              "id": "mkjaoye",
              "author": "jaywalkintotheocean",
              "body": "the first was a first gen Venu, the second was a forerunner, can't remember the model but one of the mid-tier ones from a few years ago. Both were unreliable, had endless GPS issues (isn't that Garmin's whole thing?) and the app/sync is just as skittish and finicky. I gave away the forerunner and e-wasted the venu. it was only appropriate place for that thing. \n\nI'll never buy a Garmin product again. I don't have an alternative, i gave up on this crap and went back to mechanical watches and using my phone for everything outdoor/hiking related.",
              "score": 1,
              "created_utc": 1743350427.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mkj91n4",
      "author": "Armand74",
      "body": "toy touch squalid full pocket crush vanish desert somber uppity\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "score": 1,
      "created_utc": 1743349913.0,
      "replies": []
    },
    {
      "id": "mkjl367",
      "author": "ryantttt8",
      "body": "This was one of the main reasons I bought a garmin over a fitbit or Samsung watch because nothing required a fucking subscription",
      "score": 1,
      "created_utc": 1743353681.0,
      "replies": []
    },
    {
      "id": "mkjnfg4",
      "author": "DelightfulPornOnly",
      "body": "capitalism leads to the shit-ification of everything it touches \n\n..\neverything",
      "score": 1,
      "created_utc": 1743354396.0,
      "replies": []
    },
    {
      "id": "mkjqcf4",
      "author": "EverythingBOffensive",
      "body": "Reminder not to buy.",
      "score": 1,
      "created_utc": 1743355277.0,
      "replies": []
    },
    {
      "id": "mkjrkqt",
      "author": "CoolerCatThanYou",
      "body": "Bro, I JUST bought a watch. Are you kidding me?",
      "score": 1,
      "created_utc": 1743355652.0,
      "replies": []
    },
    {
      "id": "mkjsequ",
      "author": "Mettlesome_Inari",
      "body": "Very disappointing. Time for me to switch to a new device. Way to wreck your brand.",
      "score": 1,
      "created_utc": 1743355903.0,
      "replies": []
    },
    {
      "id": "mkk0pxi",
      "author": "scottanon",
      "body": "We are no longer customers. We are things to be milked and mined for every penny they can bleed from us",
      "score": 1,
      "created_utc": 1743358381.0,
      "replies": []
    },
    {
      "id": "mkk25cm",
      "author": "Shamus-McNasty",
      "body": "Looks like my days of not buying Garmin watches have come to a middle.",
      "score": 1,
      "created_utc": 1743358821.0,
      "replies": []
    },
    {
      "id": "mkk7mp5",
      "author": "AndThereWasNothing",
      "body": "I had a garmin watch but lost it about 6 months ago. I was just thinking about buying a new one. Glad to see this so I can start looking at other brands.",
      "score": 1,
      "created_utc": 1743360494.0,
      "replies": []
    },
    {
      "id": "mkka29d",
      "author": "bigmacman40879",
      "body": "Ooof. I love my solar instinct.\n\nGuess it will be the last Garmin I own",
      "score": 1,
      "created_utc": 1743361231.0,
      "replies": []
    },
    {
      "id": "mkkaj7h",
      "author": "seabreaze68",
      "body": "I’ve been happy with my Garmin watches to date but this dick move means I will never buy another one",
      "score": 1,
      "created_utc": 1743361375.0,
      "replies": []
    },
    {
      "id": "mkm0ioc",
      "author": "Osiris_Raphious",
      "body": "Corporate technofuedAL lords of Davos: \"You will own nothing and you will be happy\".... now subscribe to use the features you already own",
      "score": 1,
      "created_utc": 1743382159.0,
      "replies": []
    },
    {
      "id": "mkmtbuq",
      "author": "sarevok9",
      "body": "I've been thinking of buying a new smartwatch and I have such decision paralysis about it.  I'm glad Garmin has removed themselves from being considered now or in the future.",
      "score": 1,
      "created_utc": 1743393866.0,
      "replies": []
    },
    {
      "id": "mkn61xq",
      "author": "bpmdrummerbpm",
      "body": "Garmin, more like Garmout.",
      "score": 1,
      "created_utc": 1743400560.0,
      "replies": []
    },
    {
      "id": "mkp5kv1",
      "author": "DavidinCT",
      "body": "Was a Pebble guy, then moved to Garmin because of long battery life. If I have to start paying to use some features on my watch, it will be the last Garmin I buy....",
      "score": 1,
      "created_utc": 1743434489.0,
      "replies": []
    },
    {
      "id": "mkhzdmb",
      "author": "Winter_Whole2080",
      "body": "Glad I got an Apple Watch instead",
      "score": -8,
      "created_utc": 1743331513.0,
      "replies": [
        {
          "id": "mki2wv8",
          "author": "brafwursigehaeck",
          "body": "serious toothbrush person ancient dog fly fanatical cake start bake\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 8,
          "created_utc": 1743333571.0,
          "replies": [
            {
              "id": "mki40gr",
              "author": "Winter_Whole2080",
              "body": "I wanted a GPS enabled watch to run hiking apps for day or overnight hikes.  I believe the Garmin has a longer lasting battery but Apple watch runs WorkOutDoors with downloadable maps just fine.  \n\nOh it also helps me find my iphone..",
              "score": -3,
              "created_utc": 1743334184.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mki51j9",
          "author": "skinte1",
          "body": "Why? They do the exact same thing by forcing you to pay for apps. As an example the Oceanic+ subscription for being able to use the Ultra as a dive computer (something Apple advertised when releasing the Ultra)  is $10/month.  Maybe you don't need that but same likely goes for some of the functions Garmin is \"locking\".",
          "score": 7,
          "created_utc": 1743334714.0,
          "replies": []
        },
        {
          "id": "mki0550",
          "author": "Lint_baby_uvulla",
          "body": "Same. And I’ll switch again if needed.",
          "score": -4,
          "created_utc": 1743331964.0,
          "replies": []
        },
        {
          "id": "mki1lx1",
          "author": "snafu-germany",
          "body": "plus 1",
          "score": -3,
          "created_utc": 1743332826.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkhz1cg",
      "author": "None",
      "body": "[deleted]",
      "score": -8,
      "created_utc": 1743331309.0,
      "replies": [
        {
          "id": "mki68lp",
          "author": "slurplepurplenurple",
          "body": "…does G shock even make a GPS running/biking/etc watch though? I don’t think they were even close to being on my radar when I was last looking at a new GPS tracking watch years ago. They might both look like sporty watches but I don’t think they’re really true competitors.",
          "score": 12,
          "created_utc": 1743335332.0,
          "replies": [
            {
              "id": "mkia3of",
              "author": "Barqueefa",
              "body": "No, this dude is talking out their ass",
              "score": 5,
              "created_utc": 1743337246.0,
              "replies": [
                {
                  "id": "mkj0v6q",
                  "author": "slurplepurplenurple",
                  "body": "Yeah the post had like 6 upvotes at the time which confused me a lot.",
                  "score": 3,
                  "created_utc": 1743347337.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mkhzu93",
      "author": "RadVarken",
      "body": "It's not so bad. You have to pay extra for stuff you don't currently have or want.",
      "score": -13,
      "created_utc": 1743331785.0,
      "replies": [
        {
          "id": "mki33w2",
          "author": "speculatrix",
          "body": "No, because they'll move the boundary slowly until things you need will require a subs.",
          "score": 8,
          "created_utc": 1743333682.0,
          "replies": [
            {
              "id": "mki5ycw",
              "author": "None",
              "body": "[deleted]",
              "score": -3,
              "created_utc": 1743335186.0,
              "replies": [
                {
                  "id": "mko65pj",
                  "author": "speculatrix",
                  "body": "enshittification is happening everywhere. so you'd rather wait until they break your devices and then try and complain while they hold you to ransom, or, premptively tell them not to even think about fucking you over?",
                  "score": 1,
                  "created_utc": 1743422162.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mki4l4k",
              "author": "darksiderevan",
              "body": "Complaining about things that have not happened.",
              "score": -8,
              "created_utc": 1743334498.0,
              "replies": [
                {
                  "id": "mkrmg3d",
                  "author": "speculatrix",
                  "body": "Complaining because history has shown it's inevitable",
                  "score": 1,
                  "created_utc": 1743461610.0,
                  "replies": [
                    {
                      "id": "mkrn9v8",
                      "author": "darksiderevan",
                      "body": "What history?",
                      "score": 0,
                      "created_utc": 1743461891.0,
                      "replies": [
                        {
                          "id": "mktgx32",
                          "author": "speculatrix",
                          "body": "You're trolling with your pretence of naiveté",
                          "score": 1,
                          "created_utc": 1743489840.0,
                          "replies": [
                            {
                              "id": "mkthzxx",
                              "author": "darksiderevan",
                              "body": "You can't even give a single example of your \"inevitable history\".",
                              "score": 0,
                              "created_utc": 1743490545.0,
                              "replies": [
                                {
                                  "id": "mkxt31g",
                                  "author": "None",
                                  "body": "[removed]",
                                  "score": 1,
                                  "created_utc": 1743549576.0,
                                  "replies": [
                                    {
                                      "id": "mkxt34q",
                                      "author": "AutoModerator",
                                      "body": "Hello, /u/speculatrix! Thanks for contributing. However, your comment has been automatically removed. techradar.com is banned from /r/gadgets due to placement of malicious advertising.\n\n\"Malicious advertisments\" include, but are not limited to:\n\n* Unexpected redirection to other sites, or unexpected opening of additional background tabs\n\n* Ads for scams or malware, such as \"you've won the lottery\" or \"virus detected\".\n\n* Advertisements that run malicious script.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
                                      "score": 1,
                                      "created_utc": 1743549577.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mki2rg1",
          "author": "brafwursigehaeck",
          "body": "languid nail tidy dazzling sugar fearless deserve rhythm quack cause\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 1,
          "created_utc": 1743333487.0,
          "replies": []
        },
        {
          "id": "mki35k7",
          "author": "jamesbecker211",
          "body": "\"First they came for...\"",
          "score": -4,
          "created_utc": 1743333707.0,
          "replies": [
            {
              "id": "mki8472",
              "author": "Vergilx217",
              "body": "You're not seriously comparing SaaS monetization models on health tracking apps to *the Holocaust*, are you?\n\nThis site is so juvenile sometimes",
              "score": 11,
              "created_utc": 1743336278.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mki7tvi",
      "author": "jabolcnik",
      "body": "Well, my 965 and 1050 are going to sale.",
      "score": 0,
      "created_utc": 1743336137.0,
      "replies": []
    },
    {
      "id": "mkigkqy",
      "author": "Elensea",
      "body": "This title is a bit misleading. It’s an optional subscription for future features. IE same as Apple with iCloud+. Also states all existing features will remain free.",
      "score": 0,
      "created_utc": 1743340096.0,
      "replies": []
    },
    {
      "id": "mki3u7s",
      "author": "deejeycris",
      "body": "Not really interesting features anyway.",
      "score": -6,
      "created_utc": 1743334087.0,
      "replies": []
    },
    {
      "id": "mkinwlk",
      "author": "under_an_overpass",
      "body": "If I go to use my cycling computer and features that I was using are now locked behind a paywall I’m gonna be pissed.",
      "score": 0,
      "created_utc": 1743342944.0,
      "replies": [
        {
          "id": "mkis0s5",
          "author": "ProtomanBn",
          "body": "Nothing is getting locked behind a paywall, there are some new features that are subscription only but its just a AI briefing and graphs that compile all the other graphs you still have access to into one graph",
          "score": 4,
          "created_utc": 1743344384.0,
          "replies": [
            {
              "id": "mkismwv",
              "author": "under_an_overpass",
              "body": "Thanks, appreciate the reply! Good to know.",
              "score": 4,
              "created_utc": 1743344594.0,
              "replies": [
                {
                  "id": "mkiuapx",
                  "author": "ProtomanBn",
                  "body": "No problem, the Garmin sub has been in chaos this weekend over it so i looked into it myself and it's not a big deal. If this is the way its staying i will be buying Garmin watches for years to come.",
                  "score": 5,
                  "created_utc": 1743345161.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mkjajqp",
      "author": "None",
      "body": "It looks like they're not changing anything people are using currently but they're adding some AI features. Running AI on servers costs money, so that makes sense. I can see many people not even wanting AI features to be enabled anyway, so at present it doesn't seem a loss.",
      "score": 0,
      "created_utc": 1743350382.0,
      "replies": [
        {
          "id": "mkk1bwh",
          "author": "i-amnot-a-robot-",
          "body": "Yet",
          "score": 0,
          "created_utc": 1743358568.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkl6yiu",
      "author": "cjrung07",
      "body": "So much for getting the Tactix 8.",
      "score": 0,
      "created_utc": 1743371601.0,
      "replies": []
    },
    {
      "id": "mkl9337",
      "author": "None",
      "body": "I have a 4-year-old garment watch I'm not upgrading shit get fucked Carmen If anything I'll go back to Pebble",
      "score": 0,
      "created_utc": 1743372324.0,
      "replies": []
    },
    {
      "id": "mklvgbp",
      "author": "RepostStat",
      "body": "why are most smartwatches awful",
      "score": 0,
      "created_utc": 1743380252.0,
      "replies": []
    },
    {
      "id": "mklwwso",
      "author": "ironfunk67",
      "body": "Garmin is such a shit company.",
      "score": 0,
      "created_utc": 1743380795.0,
      "replies": []
    },
    {
      "id": "mklwy98",
      "author": "Hellyessum",
      "body": "The features aren’t even worth free",
      "score": 0,
      "created_utc": 1743380810.0,
      "replies": []
    },
    {
      "id": "mkmaewq",
      "author": "flufernuter",
      "body": "I was just getting ready to buy a new watch and Garmin was at the top of the list.  NEVERMIND!",
      "score": 0,
      "created_utc": 1743385932.0,
      "replies": []
    },
    {
      "id": "mkmahn7",
      "author": "lld2girl",
      "body": "Bye Garmin",
      "score": 0,
      "created_utc": 1743385960.0,
      "replies": []
    },
    {
      "id": "mkmz6sp",
      "author": "maliflow",
      "body": "I have a couple of the Tactix models issued as pro gear. I enjoy my fitness tracking. I’d fucking never pay for those features though.",
      "score": 0,
      "created_utc": 1743396782.0,
      "replies": []
    },
    {
      "id": "mkn73e1",
      "author": "Opposite-Mulberry761",
      "body": "I agree you know got a smart scale 4 months later all my info is being held hostage. Oh you forgot we charge $30 a month for you to use our app. I’m really because I can get a scale at Walmart and keep my own records. The scale quit even measuring all the BMI and what ever crap. I took it out in the front yard and smashed it into pieces with a sledge hammer and mailed it back to them. That’s is Shame that what I thought was reputable company chose this deceiving business practice. Loran gives you free internet updates for as long as you have there equipment.",
      "score": 0,
      "created_utc": 1743401168.0,
      "replies": []
    },
    {
      "id": "mkncxyj",
      "author": "Majesty-Difficulty",
      "body": "I guess I can forget about buying that replacement charger and just add the watch to my junk electronics pile.",
      "score": 0,
      "created_utc": 1743404758.0,
      "replies": []
    },
    {
      "id": "mko3fn5",
      "author": "hawksdiesel",
      "body": "Whelp, not buying Garmin products then",
      "score": 0,
      "created_utc": 1743420918.0,
      "replies": []
    },
    {
      "id": "mkokjpf",
      "author": "fistingcouches",
      "body": "Seriously?? Got my first and evidently last garmin watch last year",
      "score": 0,
      "created_utc": 1743427823.0,
      "replies": []
    },
    {
      "id": "mkrtvnz",
      "author": "trapercreek",
      "body": "Live track? Badges & Challenges? Private Coaching? I’ve never used any of those when free & certainly wouldn’t pay. \n\nAre they trying to copy Apple?",
      "score": 0,
      "created_utc": 1743464160.0,
      "replies": []
    },
    {
      "id": "mkint5w",
      "author": "IngeniousGent",
      "body": "As a software developer, I don’t see anything wrong with this. If the free experience becomes sidelined, then I’d be upset. But this subscription service is adding a new feature that will compete against the likes of Strava’s paid feature. AI is not cheap. This is not a feature everyone would want, but providing this feature will cost Garmin more money. The people that want this feature should have to pay the cost.",
      "score": -1,
      "created_utc": 1743342909.0,
      "replies": []
    },
    {
      "id": "mki4m81",
      "author": "Elvis_Precisely",
      "body": "All of the features you currently have, you will still have, so what are you whining about? \n\nIf you want you can pay more to get more, or pay the same to get the same. Seems kinda ok doesn’t it?",
      "score": -9,
      "created_utc": 1743334515.0,
      "replies": [
        {
          "id": "mkikbf7",
          "author": "afurtivesquirrel",
          "body": "The problem is the direction of the brand.\n\nMy watch still gets updates with new features every now and then. It's one of the great things I love about it and one of the reasons I bought it. \n\nChances are, any new updates will be paid only. \n\nAlso, the app UX will 100% change. It will pivot to pushing these features down your throat and trying to entice you to subscribe instead of just showing you your stats. That'll be shit. \n\nAnd I'm on Garmin #3. Every one is rock solid, buy once, enjoy til it dies, buy a new Garmin. Yes, you're right - the feature set of my current Garmin will probably* remain. But there won't be a new Garmin for me. And that sucks, because for more than a decade they've been rock solid with a user friendly business model. \n\nSure, there is no reason to be *entitled* to a new feature that's released. Your base set of features is all you're *entitled* to. But a company that previously went above and beyond deciding to scale that back and do the bare minimum is still reason to be sad, especially when you're deep in their ecosystem.\n\n*^(Companies that do this also have a real history of saying that everything you currently have is staying, but somehow you find yourself three years later and that's not quite true and you're not quite sure how you got there)",
          "score": 3,
          "created_utc": 1743341600.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkj639i",
      "author": "free_3_PO",
      "body": "Best smart device on the market by miles. This is what consumers get for buying iOS and Android shit",
      "score": -1,
      "created_utc": 1743348996.0,
      "replies": []
    },
    {
      "id": "mki6ebc",
      "author": "None",
      "body": "[deleted]",
      "score": -2,
      "created_utc": 1743335413.0,
      "replies": [
        {
          "id": "mkkb6lv",
          "author": "ideliver12345",
          "body": "Coros, Suunto",
          "score": 1,
          "created_utc": 1743361574.0,
          "replies": []
        }
      ]
    }
  ]
}