{
  "post": {
    "title": "Sony's PlayStation 6 handheld edition may be less powerful than the PS5 | Featuring a 3nm SoC that draws 15W",
    "author": "chrisdh79",
    "id": "1jzrrw5",
    "score": 674,
    "created_utc": 1744723386.0,
    "selftext": "",
    "num_comments": 148,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jzrrw5/sonys_playstation_6_handheld_edition_may_be_less/"
  },
  "comments": [
    {
      "id": "mn98h7v",
      "author": "graison",
      "body": "Handheld playstation 6? How long have I been asleep?",
      "score": 587,
      "created_utc": 1744734116.0,
      "replies": [
        {
          "id": "mnbam4d",
          "author": "GrumpyPan",
          "body": "So they’re not gonna call it a psp awww.",
          "score": 127,
          "created_utc": 1744756571.0,
          "replies": [
            {
              "id": "mnbwkb8",
              "author": "nikolapc",
              "body": "They gonna call it PSPSPS",
              "score": 61,
              "created_utc": 1744764115.0,
              "replies": [
                {
                  "id": "mnc0ri5",
                  "author": "hheecckk526",
                  "body": "Really super Saiyan God super Saiyan energy",
                  "score": 15,
                  "created_utc": 1744765610.0,
                  "replies": []
                },
                {
                  "id": "mne982g",
                  "author": "XsteveJ",
                  "body": "Sounds like my cat is gonna love it",
                  "score": 14,
                  "created_utc": 1744805402.0,
                  "replies": [
                    {
                      "id": "mneavft",
                      "author": "nikolapc",
                      "body": "We don't use that in my country and I never seen a cat respond to any call lol, except to non verbal cues like come and snuggle. We do have a word we use a lot and it sounds like PISS just with one S and it literally means piss off to the cat. They understand that one and bolt lol. They like and abuse my outdoor furniture too much.\n\nThey're not my cats btw, they may be street may be neighbours(we let cats roam, they're native here for 1000s yrs so no invasive species). Haven't had a cat in years and those were rescues like they lost their mom and were wailing babies, but they mysteriously \"ran away\" once I was gone for studies in an another country. \n\nI may keep the next rescue though but I hope it's not a cable eater like one I had. \n\nOther then that I tolerate them and tell them to piss off, they still like my yard and god forbid if there's a box. My sister once made a mistake of feeding them, they knew exactly when lunchtime is and stood with sad eyes and that baby cry they do, little grifters all of them.",
                      "score": 2,
                      "created_utc": 1744806061.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mnijk6d",
                  "author": "Alaeriia",
                  "body": "Dangit, you summoned all the cats.",
                  "score": 3,
                  "created_utc": 1744854678.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mnbl1d9",
              "author": "dat_w",
              "body": "PSP best handheld to date, well maybe minus Steam Duck",
              "score": 33,
              "created_utc": 1744760098.0,
              "replies": [
                {
                  "id": "mnbpsfa",
                  "author": "hmnissbspcmn",
                  "body": "Man I remember being like 12 and first booting the PSP for Christmas. It felt like the future.\n\nFor fucks sake, take me back!",
                  "score": 30,
                  "created_utc": 1744761742.0,
                  "replies": [
                    {
                      "id": "mncihxb",
                      "author": "NecroCannon",
                      "body": "I loved watching movies on it. Unfortunately I,robot is a significant part of my childhood because of it, and the Garfield movie",
                      "score": 8,
                      "created_utc": 1744772120.0,
                      "replies": [
                        {
                          "id": "mndfkrs",
                          "author": "RizlaSmyzla",
                          "body": "Hitchhikers guide to the galaxy for me. \n\nAnd 250 classic goals from the Premier League 😂. \n\nMust have watched both hundreds of times",
                          "score": 3,
                          "created_utc": 1744788860.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mnc40a8",
                  "author": "RedMiah",
                  "body": "Steam Duck sounds like Valve’s new mascot, maybe with a Steam exclusive mascot platformer?!\n\nI’d buy that for a dollar",
                  "score": 9,
                  "created_utc": 1744766787.0,
                  "replies": []
                },
                {
                  "id": "mnjgfl3",
                  "author": "Chrononi",
                  "body": "Quack",
                  "score": 2,
                  "created_utc": 1744869106.0,
                  "replies": []
                },
                {
                  "id": "mnbxieg",
                  "author": "nikolapc",
                  "body": "No, VITA is the best, the GOAT, Gameboy is the OG, and presently it's the Ally.\n\nSteamdeck gets credit for reopening the market for PC handhelds, but it is ugly, unwieldy and underpowered.\n\nI am very excited for the next Xbox handheld, like the one in 2027, it may be ARM based, but it will be 100% PC.\n\nPS will do their own thing, probably use a better version of PSSR for some games, but I doubt everything the PS6 runs can run on that, as I doubt everything next gen can run on the handheld Xbox. You will have streaming for that, and hopefully households get equipped with great lines for streaming.\n\nI've already been living the Ally+GFN life and I love it. I can play in 4k120 on my TV, I can play in 120 on my bed, or I can play indie games(and everything older from PC) locally on the go.",
                  "score": 1,
                  "created_utc": 1744764444.0,
                  "replies": [
                    {
                      "id": "mne6qko",
                      "author": "Harley2280",
                      "body": ">No, VITA is the best, the GOAT\n\nAll 11 of us that bought one agree. The Vita was a great system and it's such a shame that it never got the support it deserved.",
                      "score": 8,
                      "created_utc": 1744804375.0,
                      "replies": [
                        {
                          "id": "mne8t1l",
                          "author": "nikolapc",
                          "body": "I got a white japanese vita it's still the pride and joy of my life, the favourite child, I look at the ally and scold it(why don't you fit snugly in a hoodie like your brother)",
                          "score": 3,
                          "created_utc": 1744805232.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mnbz6o9",
                  "author": "dougms",
                  "body": "I do love some steamed duck. With a nice hoisin sauce.",
                  "score": 14,
                  "created_utc": 1744765041.0,
                  "replies": []
                },
                {
                  "id": "mnd3o8u",
                  "author": "psychocopter",
                  "body": "Id rank the ds lite above the psp in terms of form factor(the right size with the fold to fit perfectly in the pocket without anything exposed to snag on). Everything else other than the mem stick was amazing. I really dont even consider the deck or the switch in the same category as they arent pocketable.",
                  "score": 2,
                  "created_utc": 1744781737.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mnccnuh",
              "author": "labria86",
              "body": "Lastest rumor is it will be made in a Feline Cat Kingdom to avoid the tarrifs. Word on the street is it will be called the \"Psssspsssspsp\"",
              "score": 2,
              "created_utc": 1744769932.0,
              "replies": []
            },
            {
              "id": "mncgr0h",
              "author": "Tupperwarfare",
              "body": "psp psp psp Feline Edition",
              "score": 1,
              "created_utc": 1744771457.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mn9bppy",
          "author": "Immediate_Theory4738",
          "body": "Thought the same thing lol.",
          "score": 16,
          "created_utc": 1744735069.0,
          "replies": []
        },
        {
          "id": "mnfuzdb",
          "author": "FoolOnDaHill365",
          "body": "A while. Trump’s 4th term is his best so far!",
          "score": 5,
          "created_utc": 1744823586.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mn8c6et",
      "author": "RB30DETT",
      "body": "> with the PS6 following in 2027 or 2028. \n\nGiven the price increase just announced for the PS5 which is what, almost 5 years old, I'm not overly optimistic about the pricetag for even a base model 6.",
      "score": 402,
      "created_utc": 1744724188.0,
      "replies": [
        {
          "id": "mnaxbmd",
          "author": "Kiwithegaylord",
          "body": "It’s 5?!? I still think of it as “next gen”",
          "score": 11,
          "created_utc": 1744752213.0,
          "replies": [
            {
              "id": "mnlnaer",
              "author": "Momentarmknm",
              "body": "I got it launch day and it still feels pretty new to me, but I'm also old so",
              "score": 2,
              "created_utc": 1744904101.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mn8eo7x",
          "author": "VagueSomething",
          "body": "You mean you don't want to take out a mortgage to play Concord 2 and Marathon Remastered?",
          "score": 148,
          "created_utc": 1744725019.0,
          "replies": [
            {
              "id": "mn8z4sa",
              "author": "ChucklesInDarwinism",
              "body": "You mean Skyrim and tlou galactic edition, don’t you?",
              "score": 55,
              "created_utc": 1744731302.0,
              "replies": [
                {
                  "id": "mn90obq",
                  "author": "busy-warlock",
                  "body": "Don’t forget gta 5 forever edition",
                  "score": 37,
                  "created_utc": 1744731760.0,
                  "replies": [
                    {
                      "id": "mn91gtm",
                      "author": "ChucklesInDarwinism",
                      "body": "I didn’t mention it because GTA VI is in the works already but there’s no new TES sadly",
                      "score": 3,
                      "created_utc": 1744731995.0,
                      "replies": [
                        {
                          "id": "mn9394o",
                          "author": "busy-warlock",
                          "body": "Well there is oblivion 2.0 soon so we got that going for us, which is nice",
                          "score": 8,
                          "created_utc": 1744732518.0,
                          "replies": [
                            {
                              "id": "mn96npx",
                              "author": "ChucklesInDarwinism",
                              "body": "Yeah, true that",
                              "score": 0,
                              "created_utc": 1744733564.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mnb2ik4",
              "author": "llliilliliillliillil",
              "body": "Don’t forget the inevitable second and third remake of the last of us",
              "score": 5,
              "created_utc": 1744753863.0,
              "replies": []
            },
            {
              "id": "mnaup26",
              "author": "SoigneBest",
              "body": "I lol’d at Concord 2 and Marathon Remastered. Well played my friend.",
              "score": 1,
              "created_utc": 1744751394.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnci7hl",
          "author": "ThePooksters",
          "body": "Hopefully the United States isn’t still in a trade war with the entire world by then, so I could buy one if I wanted to",
          "score": 7,
          "created_utc": 1744772009.0,
          "replies": []
        },
        {
          "id": "mn8y7o9",
          "author": "abarrelofmankeys",
          "body": "Yeah I’m done buying anything new after switch two, and I’m on the fence there. This past generation for sony and Microsoft has basically been a waste.",
          "score": 7,
          "created_utc": 1744731027.0,
          "replies": []
        },
        {
          "id": "mnb02es",
          "author": "RockMeIshmael",
          "body": "Especially when developers will still be making games compatible with the PS4.",
          "score": 1,
          "created_utc": 1744753084.0,
          "replies": []
        },
        {
          "id": "mn8i31i",
          "author": "EViLTeW",
          "body": "If it helps any, all of the people saying Nintendo went too far and lost them as customers will 100% defend whatever the pricetag is.  \n\n//And the people defending Nintendo's pricetag will say that Sony went too far and lost them as customers.",
          "score": -12,
          "created_utc": 1744726128.0,
          "replies": [
            {
              "id": "mn8pto5",
              "author": "Obyson",
              "body": "Atleast Sony discounts there games all the time you can get any game you want for 20 to 30 bucks if you can wait a couple years, you won't see a 10 year old playstation game for $70 like Nintendo.",
              "score": 20,
              "created_utc": 1744728507.0,
              "replies": [
                {
                  "id": "mn8vtcc",
                  "author": "SkotchKrispie",
                  "body": "I’m not sure Sony discounts their games, Sony simply decides to produce so many discs that the used market at GameStop becomes large and thus the prices drop. Nintendo doesn’t mass produce cartridges so as to keep the price higher.",
                  "score": -25,
                  "created_utc": 1744730308.0,
                  "replies": [
                    {
                      "id": "mn8zc0m",
                      "author": "nick182002",
                      "body": "God of War Ragnarök has gone on sale for $20 multiple times on the PlayStation Store. Super Mario Odyssey came out 5 years earlier and hasn't gone below $40 on the eShop.",
                      "score": 15,
                      "created_utc": 1744731361.0,
                      "replies": [
                        {
                          "id": "mn90vi2",
                          "author": "busy-warlock",
                          "body": "Also tag ragnarok went free for a month",
                          "score": 5,
                          "created_utc": 1744731820.0,
                          "replies": []
                        },
                        {
                          "id": "mn90q7v",
                          "author": "SkotchKrispie",
                          "body": "I bought GoW much cheaper than that even. I love it. Nintendo chooses to keep number of games shipped low in order to keep prices high which is their choice. \n\nSony has a broader business in all of electronics and is a larger company. They make TVs, speakers, headphones and more in addition to video games.",
                          "score": -6,
                          "created_utc": 1744731777.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mn9n8gu",
                      "author": "Obyson",
                      "body": "I don't remember the last time I bought a physical copy of a game, I only use the playstation store for downloads which always has heavy discounts, so your crazy theory makes no sense.",
                      "score": 4,
                      "created_utc": 1744738405.0,
                      "replies": []
                    },
                    {
                      "id": "mnalnbn",
                      "author": "Squirrel_Apocalypse2",
                      "body": "It's not 2005. Disc production has nothing to do with when Sony or Nintendo discount games from their online store. Lol",
                      "score": 2,
                      "created_utc": 1744748695.0,
                      "replies": [
                        {
                          "id": "mnasxog",
                          "author": "SkotchKrispie",
                          "body": "I have never bought digital games. Physical games are far cheaper on Sony because discs are far cheaper to produce than cartridges and because Sony produces far more discs than Nintendo and ships them. \n\nI’m not too sure what doesn’t get through you thick skulls about the fact that a far larger supply of used PlayStation discs at GameStop causes GameStop to drop the price of the disc and therefore game. A quite simple intellectual deduction. LOLOLOL",
                          "score": -3,
                          "created_utc": 1744750852.0,
                          "replies": [
                            {
                              "id": "mnb2o3c",
                              "author": "Squirrel_Apocalypse2",
                              "body": "You're talking about GameStop, a 3rd party. They have absolutely nothing to do with how much Sony and Nintendo are charging for brand new games. Most games are purchased digitally now, your anecdotal self evidence means nothing. The irony of you calling people dense here and talking about intellectual deduction while having zero intellectual deduction. Lol",
                              "score": 2,
                              "created_utc": 1744753914.0,
                              "replies": [
                                {
                                  "id": "mnb4owm",
                                  "author": "SkotchKrispie",
                                  "body": "I have plenty of intellectual deduction. I test at an extremely high IQ, but thanks. Plenty of people buy games physically. I’m one of them. There are GameStop stores everywhere which proves my experience isn’t simply anecdotal. \n\nIt doesn’t matter to me where the game is cheapest. Plenty of the time it’s cheapest physically. Therefore I didn’t differentiate between Sony and Nintendo discounting the game vs if the game is simply discounted because I don’t care the difference and plenty of people at the physical store don’t either. \n\nI bought Mario Galaxy for under $12 and Skyward Sword for under $20. \n\nAlso, the OP wasn’t talking about “brand new” games. He was talking about discounts after years.",
                                  "score": -1,
                                  "created_utc": 1744754571.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mn90stm",
                  "author": "EViLTeW",
                  "body": "Depends on the game.\n\nDirect from Sony, Witcher 3: Wild Hunt is still $50.  \n\nNintendo doesn't currently sell any 10 year old games because the Switch is only 8 years old and they don't sell WiiU games anymore.",
                  "score": -22,
                  "created_utc": 1744731798.0,
                  "replies": [
                    {
                      "id": "mn92dge",
                      "author": "_cuhree0h",
                      "body": "Witcher is cheap, constantly.",
                      "score": 19,
                      "created_utc": 1744732260.0,
                      "replies": []
                    },
                    {
                      "id": "mn92lu8",
                      "author": "uniterka",
                      "body": "It is, but it was also discounted to 10 USD on multiple occasions.",
                      "score": 12,
                      "created_utc": 1744732329.0,
                      "replies": []
                    },
                    {
                      "id": "mn9sogo",
                      "author": "Obyson",
                      "body": "Lol I bought the Witcher 3 on ps4 for 5 bucks like a year ago",
                      "score": 8,
                      "created_utc": 1744739994.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mn8l17e",
              "author": "Vitss",
              "body": "Meanwhile I'm here mad at everyone, but particulary, PC parts manufactures. My GPU is aging, but there is no viable upgrade path.\n\nHonestly, I'm going to go back to reading, at least ebooks are cheap and will last.... [nevermind](https://libreture.com/blog/amazon-removing-your-ability-download-keep-ebooks/)\n\nMan, I hate this timeline.",
              "score": 2,
              "created_utc": 1744727053.0,
              "replies": [
                {
                  "id": "mn8sa8q",
                  "author": "Vismal1",
                  "body": "I just grabbed a 9070 and still feel guilty about it. It’s wild out there",
                  "score": 3,
                  "created_utc": 1744729243.0,
                  "replies": [
                    {
                      "id": "mnb27di",
                      "author": "JaceKagamine",
                      "body": "Tbf a comouter with a 9070 will last for a long time, sure it won't play 4k 120 fps all ganes well into the future but still\n\nWant to uograde as well, currently have a 6750xt but not sure if I can stomach the orice or wait another gen",
                      "score": 1,
                      "created_utc": 1744753763.0,
                      "replies": [
                        {
                          "id": "mnct3sf",
                          "author": "Vismal1",
                          "body": "That’s what I’m upgrading from as well. Figure I can still sell that for a bit …",
                          "score": 1,
                          "created_utc": 1744776597.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mn8apk7",
      "author": "None",
      "body": "If the device is years away from launch then this might just be specs without any real hardware behind it. I'm sure in years time it'll be adjusted and whatever SoC is planned for that time frame will have a much better chance of living up to the PS5 compute power. It would be silly for Sony to throw out much of their PS5/PS6 library if they can prevent it.",
      "score": 164,
      "created_utc": 1744723679.0,
      "replies": [
        {
          "id": "mn94o39",
          "author": "EagerSubWoofer",
          "body": "the nintendo switch is 15W and the PS5 is 250W. \n\nBattery technology is unlikely to dramatically change, so the PS6 handheld will still need to be about 15W to get decent battery life. \n\nTemper your expectations. According to rumors, the PS6 handheld is expected to obey the laws of thermodynamics.",
          "score": 112,
          "created_utc": 1744732943.0,
          "replies": [
            {
              "id": "mn9knwo",
              "author": "Alpacas_",
              "body": "To be fair, there's a sub 15w chip today that supposedly gets better perf than my 77w old chip. \n\nBut the ps5 is already 7nm and my cpu was 22 or 32, so maybe not huge gains to be had.",
              "score": 7,
              "created_utc": 1744737666.0,
              "replies": []
            },
            {
              "id": "mn95vyv",
              "author": "None",
              "body": "When I say \"it will be adjusted\" I mean the goal specifications. The Switch/Switch 2 are different technologies and that kind of change wouldn't play PS5 games anyway due to incompatibility. They could make a handheld on a different architecture though and make it like a Vita 2 or something, but I kind of expect something more akin to the Steam Deck. Time will tell, I guess.",
              "score": 12,
              "created_utc": 1744733318.0,
              "replies": [
                {
                  "id": "mnac9tt",
                  "author": "plzadyse",
                  "body": "The days of 2 device ecosystems are over (ex PlayStation and PlayStation Vita). Publishers and developers aren’t going to support two game dev environments.",
                  "score": 14,
                  "created_utc": 1744745920.0,
                  "replies": [
                    {
                      "id": "mnad0a3",
                      "author": "None",
                      "body": "I think I agree with this. The market is either oversaturated or close to it right now. More devices probably won't help the market any. The only way I think it could work is if they made the portable their main system, but then they lose their edge in the higher end graphics arena. It would also be stupid if they trashed backwards compatibility.",
                      "score": 4,
                      "created_utc": 1744746141.0,
                      "replies": []
                    },
                    {
                      "id": "mnaei4w",
                      "author": "Evilmudbug",
                      "body": "It seems like it only really worked for nintendo since handheld gaming was almost a monopoly for them, and since they weren't trying to push cutting edge hardware which makes development easier and can lower the cost of manufacturing.",
                      "score": 2,
                      "created_utc": 1744746584.0,
                      "replies": []
                    },
                    {
                      "id": "mpcue2t",
                      "author": "UboaNoticedYou",
                      "body": "But they already do with the existence of the Switch and Series S.\n\n...and it's a major problem developers complain about constantly so like, yeah you're probably right.",
                      "score": 1,
                      "created_utc": 1745779673.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mn9hdxr",
              "author": "Aleni9",
              "body": "I generally agree, but you should also realize that an old P4/GeForce 4 PC also needed a 300W PSU and you can play games from that era on a toaster now, progress in efficiency is actually a thing",
              "score": 1,
              "created_utc": 1744736728.0,
              "replies": [
                {
                  "id": "mn9t699",
                  "author": "KalashnikittyApprove",
                  "body": "While that's true, I think in the PC handheld space devices still struggle to play even some PS4/Xbox one era games at 15W without scaling them down, so I'd be sceptical whether enough progress can be made to run PS5 games, which may not even support scaling down in the same way PC games do, at 15W in a handheld in the next few years. Not without major patches to games, anyway.",
                  "score": 6,
                  "created_utc": 1744740140.0,
                  "replies": [
                    {
                      "id": "mncjf28",
                      "author": "NecroCannon",
                      "body": "Honestly the handheld boom has me excited because we’ll probably see more innovation in APUs, Gaming laptops are mobile desktops basically, now time to make a powerful, efficient chip for handheld devices. With Intel talking about making chips too, NVIDIA is the only one not fully on board with just the switch",
                      "score": 3,
                      "created_utc": 1744772479.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mna1fq6",
              "author": "tylerderped",
              "body": "The switch is also running an ARM-based CPU whereas the PS5 has an AMD64 CPU. \n\nRemember when Apple switched their CPU’s to ARM a few years ago? They absolutely perform on par with or even better than similar AMD64 CPU’s while using dramatically less power. \n\nUsing such a power-sipping CPU allows for a more powerful GPU as well. 15w for a mobile SoC is kinda huge. The Switch even has a heatsink and fan. Guarantee most of that power is going to the GPU.",
              "score": 2,
              "created_utc": 1744742638.0,
              "replies": [
                {
                  "id": "mndxd34",
                  "author": "Deringhouse",
                  "body": "While it is true that ARM-based SoCs tend to have a (slightly) better power efficiency than X86-64 CPUs (though both AMD and Intel claim that their current offerings beat Apple's and Qualcomm's ARM chips), many of the reasons why Apple's M chips saw such a massive increase in power efficiency don't apply to the Switch.\n\n- Apple is willing to pay extra to ensure that is own processors are made in the latest process nodes, i.e. the most advanced manufacturing methods offered on the market. When the Apple M1 Pro and M1 Max launched, they were made in a smaller process node (i.e. 5 nm) than contemporary desktop/laptop x86 CPUs. That alone provided a massive boost in power efficiency (TSMC claimed a 30% reduction going from 7 nm to 5 nm)\n\n- Apple's latop/desktop class M chips (i.e. M* Pro and M* Max) are massive and in regards to processors, size matters. E.g. the Apple M2 Max has a die area of ~510 mm², the M2 Pro has a die area of ~288 mm². The newer M3 Pro/Max and M4 Pro/Max models are similar sized, with the M4 Max  supposeldy being larger than 400 mm². Compared to this a current Strix Point APU from AMD has a die area of 232.5 mm².\n\n- The M* Pro/Max chips from Apple are always paired with fast memory and offer a relatively high bandwidth due to their memory controllers. The memory controller of a desktop x86 CPU might allow a bandwidth in the area of 200 GB/s at most; e.g. for a Ryzen 9 7950X the hypothetical maximum is 96 GB/s (effectively it is less than 80 GB/s even with the fastest DDR5 memory). The Apple M4 Pro meanwhile has a theoretical memory bandwidth of up to 273 GB/s. The larger cache and the higher bandwidth lead to less time spent waiting for cache hits, i.e. less time that computations have to wait (consuming energy) without providing performance\n\n- Last but not least, there is a sweetspot for power efficiency for every processor; i.e. a clock speed/voltage beyond which the power consumption increases more than the gain in performance. Due to the tight competition on the laptop & desktop market, many x86 CPUs are often clocked beyond that point.\n\nFor the Switch and Switch 2, only the last aspect matters (to some degree). Nintendo is not willing to pay extra for smaller process nodes, larger chips or fast memory. The company wants to keep production costs down and hence relies on slightly customized, older off-the-shelf designs from Nvidia. Likewise, Sony is unlikely to pay the extra costs required to copy Apple's massive power efficiency gains.",
                  "score": 2,
                  "created_utc": 1744799971.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mn98y1f",
              "author": "None",
              "body": "[deleted]",
              "score": 0,
              "created_utc": 1744734242.0,
              "replies": [
                {
                  "id": "mn9jmf5",
                  "author": "narwhal_breeder",
                  "body": "Nobody has shipped a solid state battery phone.",
                  "score": 10,
                  "created_utc": 1744737370.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mnclt9y",
          "author": "r31ya",
          "body": "So far all we know with Sony next console family is that its going to made with 3nm fabrication, based on AMD UDNA (RDNA5), and with newer version of PSSR\n\nThe console version should be at least 4 times more powerful than base PS5 since Sony themselves note that IF PS5 pro was made with  RDNA 3/4 could reach above 20 teraflop (expected to be around 30 ish). but Cerny opt to remain using RDNA2 for ease of game development. Current RDNA4 7090xt is at 52 Teraflop, tough sony usually aimed for upper mid range.\n\neven if PS6 Portable is less powerful than PS5, portable CPU should be able to reach desktop Zen2 easily next year with BIG.little medusa family, PS6 family will include next gen PSSR which will bridge some of the GPU raw the difference, and it won't chase native 4K/60fps anyway.\n\nIF PS6 portable could play bigger PS5 game at 1080p/120FPS portable, or upscaled 4k/30\\~60 on docked, it would be pretty good options for 2026/2027.\n\nsupposedly SteamDeck 2 might be looming as well in 2027 with proper UDNA(+) generation jump, OG steamdeck would be four years old in 2027.",
          "score": 3,
          "created_utc": 1744773444.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mn8m5t4",
      "author": "MarkyDeSade",
      "body": "Seems like “Playstation 6” is the wrong name for it",
      "score": 30,
      "created_utc": 1744727398.0,
      "replies": [
        {
          "id": "mnblql7",
          "author": "kermityfrog2",
          "body": "FTA, it's a PS6 companion device.",
          "score": 7,
          "created_utc": 1744760340.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mn8pco2",
      "author": "nezeta",
      "body": "With 15W TGP what else you'd expect?",
      "score": 38,
      "created_utc": 1744728366.0,
      "replies": [
        {
          "id": "mnbq6np",
          "author": "PUTASMILE",
          "body": "Bout 15.350W",
          "score": 7,
          "created_utc": 1744761879.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mn8qr5m",
      "author": "pirate135246",
      "body": "No shit a handheld would be less powerful than a ps5….",
      "score": 29,
      "created_utc": 1744728789.0,
      "replies": [
        {
          "id": "mn90usf",
          "author": "suppaman19",
          "body": "OP just has a baited/shitty subject line\n\nIt's s separate device, not the actual PS6",
          "score": 14,
          "created_utc": 1744731814.0,
          "replies": []
        },
        {
          "id": "mna1m26",
          "author": "nikolai_470000",
          "body": "Exactly what I said",
          "score": 2,
          "created_utc": 1744742691.0,
          "replies": []
        },
        {
          "id": "mn8wi3d",
          "author": "a_rabid_buffalo",
          "body": "Then why call it PlayStation 6? Call it the P5P or the PS5 Portable. PlayStation 6 seems like a bit of a miss marketing here.",
          "score": 3,
          "created_utc": 1744730516.0,
          "replies": [
            {
              "id": "mn8zs5e",
              "author": "None",
              "body": "It's not called the playstation 6. This is described as a handheld companion to the playstation 6. Why would they call a handheld companion to the playstation 6 the ps5 portable",
              "score": 5,
              "created_utc": 1744731494.0,
              "replies": [
                {
                  "id": "mn902ra",
                  "author": "a_rabid_buffalo",
                  "body": "Because it’s not as powerful as the PlayStation 5. Either market it as a psp or something else. But the headline would lead you to believe it’s called the PlayStation 6 handheld edition which idk just seems like a bad name.",
                  "score": 1,
                  "created_utc": 1744731583.0,
                  "replies": [
                    {
                      "id": "mn9humk",
                      "author": "corkyrooroo",
                      "body": "It's likely a further push into the streaming world of games. The portal has been fantastic. Also these aren't announced products so they have no name yet.",
                      "score": 1,
                      "created_utc": 1744736863.0,
                      "replies": []
                    },
                    {
                      "id": "mn91ig5",
                      "author": "None",
                      "body": "I don't see why it would have to. It would just be a handheld released presumably sometime along the life of the ps6. Presumably would have the capability to utilise the ps6 in some manner. Seems fine imo",
                      "score": 1,
                      "created_utc": 1744732008.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mnepjl2",
              "author": "StaysAwakeAllWeek",
              "body": "If it runs PS6 games in the PS6 ecosystem then it's a PS6. With modern/near future upscalers they only need to target 480p-540p base resolution on a screen that size so the claimed specs should be enough to run full PS6 games",
              "score": 1,
              "created_utc": 1744811195.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mn8g7s0",
      "author": "w1n5t0nM1k3y",
      "body": "Might be nice if all the gaming companies jump on this mobile bandwagon. Then we can stop focusing on drawing more polygons and pixels and focus on building fun games that people want to play.  \n\nI stopped caring about graphics getting better probably at least a decade ago.  A large portion of the market is just playing eSports games that can run on a basic computer. The gaming industry would be so much better without trying in increase visual fidelity and picked a target that was affordable for more people.",
      "score": 67,
      "created_utc": 1744725521.0,
      "replies": [
        {
          "id": "mn8innq",
          "author": "EViLTeW",
          "body": "This has always been the anti-Nintendo argument. \"Nintendo is so weak, look at how amazing the games look on XBox and PS!\" and Nintendo's argument has been, \"Our games are more innovative/fun and that matters more than realism.\" It would be interesting to see how things play out on a level playing field.",
          "score": 36,
          "created_utc": 1744726312.0,
          "replies": [
            {
              "id": "mn8pnqh",
              "author": "raccoonbrigade",
              "body": "TOTK is better than any big budget PS5 game I've played for example. It's embarrassing that Nintendo can release a game like that on an old tablet soc while Sony struggles to make anything interesting beyond how pretty a game is this gen.",
              "score": -1,
              "created_utc": 1744728458.0,
              "replies": [
                {
                  "id": "mn8ze1l",
                  "author": "Saboteure111",
                  "body": "This is such a bad faith argument - Yes, Tears of the Kingdom is a great game, but are you really going to argue Sony hasn’t released good games this generation?? Literally right after last year’s game of the year award was dominated by them as a studio with them having several entries?",
                  "score": 31,
                  "created_utc": 1744731378.0,
                  "replies": [
                    {
                      "id": "mn9f5rl",
                      "author": "w1n5t0nM1k3y",
                      "body": "Problem with \"Game of the year\" is right in the description. They have to nominate games from the current year. That doesn't mean that the games from the current year are better than game from 2 years ago, or 7 years ago.\n\nLooking at [this page](https://www.ign.com/articles/the-game-awards-2024-winners-the-full-list) for IGN GOTY, one of the standout games with many awards seems to be AstroBot, along with Balatro getting some nominations shows that graphics don't really matter all that much. Combine that with a Final Fantasy VII remake getting nominated for so many awards, there really must have not been a lot of great games to choose from in 2024.",
                      "score": 3,
                      "created_utc": 1744736080.0,
                      "replies": []
                    },
                    {
                      "id": "mnbgudy",
                      "author": "versace_drunk",
                      "body": "What Sony games are actually and truly fun though most of them for the last decade have been movies more or less.\n\nI’ve never felt like I needed to go back to games like the last of us or god of war.\n\nAstrobot and hell divers have made a turn for them though I’ll say that.",
                      "score": 2,
                      "created_utc": 1744758689.0,
                      "replies": []
                    },
                    {
                      "id": "mn9hos0",
                      "author": "raccoonbrigade",
                      "body": "I didn't say they never released anything good lol. \"Interesting\" is the term I used",
                      "score": -6,
                      "created_utc": 1744736816.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mn8y1ef",
                  "author": "w1n5t0nM1k3y",
                  "body": "To even expand upon that, Breath of the Wild came out in 2017, and ran on the WiiU, which came out it 2012, and it's still a lot better than most other stuff on PS5.",
                  "score": -6,
                  "created_utc": 1744730975.0,
                  "replies": [
                    {
                      "id": "mnbh0yq",
                      "author": "versace_drunk",
                      "body": "Don’t know why you’re being downvoted for being absolutely correct.\n\nWhat game do they have to at stands with tears or breath?",
                      "score": 0,
                      "created_utc": 1744758750.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mn91l93",
          "author": "Stussygiest",
          "body": "Nothing wrong with chasing better graphics. Graphical power/chips tend to spread to other industries like movies, ai, laptops, phones etc etc\n\nWhich in turn drive costs down for older chips.",
          "score": 2,
          "created_utc": 1744732031.0,
          "replies": [
            {
              "id": "mn9akxe",
              "author": "w1n5t0nM1k3y",
              "body": "The current PC gaming situation for higher end graphics doesn't make me want to participate at all. $550 MSRP for a 5070 that actually costs closer to $900-$1100 isn't really affordable for a lot of people. Personally I prefer PC gaming because of the free online play and support for mods and other advantages. But it's just so hard to justify the price of building a modern gaming PC.",
              "score": 3,
              "created_utc": 1744734724.0,
              "replies": [
                {
                  "id": "mn9dwun",
                  "author": "Stussygiest",
                  "body": "I'm still using a 1660 super. Plays most games fine. \n\nIt's near its end of life tho with recent games. Honestly, do people really need 5070? Isn't the 30 or 40 series adequately fine? With FRS and other ai whatever to boost fps getting better each year, it's not bad. \n\nThe price is fked because what I mentioned earlier, how these graphical chips being used in other industries. Yes you might be priced out of the best graphic cards, but society improvement as a whole is advancing. Self driving cars, robots etc.",
                  "score": 3,
                  "created_utc": 1744735720.0,
                  "replies": [
                    {
                      "id": "mn9frj6",
                      "author": "w1n5t0nM1k3y",
                      "body": "The problem is that the current generation of cards sets the mode for the pricing. Even the 30 and 40 series of cards are expensive for someone looking into getting in PC gaming. \n\nI'm on a 1080 and it still plays some games. I'm thinking of  getting CPU/RAM/MB update just so I can enjoy some more games. Might not be playing anything really new, but I can still have fun with a huge back catalog.",
                      "score": 3,
                      "created_utc": 1744736254.0,
                      "replies": [
                        {
                          "id": "mn9nkor",
                          "author": "Stussygiest",
                          "body": "A quick search. 3050 for £190 is too much? I dont know what to say. I bought my 1660 super for around the same price during covid when graphics card price was extremely expensive. \n\nIt's not cheap or expensive in my opinion. Thinking of upgrading now...",
                          "score": -1,
                          "created_utc": 1744738504.0,
                          "replies": [
                            {
                              "id": "mn9qb4s",
                              "author": "w1n5t0nM1k3y",
                              "body": "£190 = 250 USD for a 5 year old card with 8 GB of VRAM. Some quick searching on Google says that the 3050 is only a little better than the 1080.  The 3050 was $250 at launch. I did some search on eBay and found some that where around $160 USD, which seems like a better price, but still seems like more than I'd want to spend on something that old.  I got my 1080 for $112 USD from e-bay a couple years ago.",
                              "score": 2,
                              "created_utc": 1744739298.0,
                              "replies": [
                                {
                                  "id": "mn9tufn",
                                  "author": "Stussygiest",
                                  "body": "Yeah you could be right. Could be at this very moment, we are at the peak due to what I mentioned. \n\nWhen crypto died down after covid, graphics card did get cheaper for awhile(if my recollection is correct). I guess time the market cycle to purchase...unless the other industries don't die down.",
                                  "score": 1,
                                  "created_utc": 1744740340.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mnaxkz5",
                  "author": "happy-cig",
                  "body": "Honestly if i could do it over i would still be using my 1070 instead of buying a 4070s last year for $550. \n\n\nThe 5070 can be had easily for $550 on newegg. If i waited i couldve had a newer and better card for the same price. \n\n\nI dont even think i need a 5070 either. ",
                  "score": 1,
                  "created_utc": 1744752295.0,
                  "replies": []
                },
                {
                  "id": "mnea6oi",
                  "author": "aitorbk",
                  "body": "Also, gaming performance is dropping.  \nLook at the rehash of Talos.  Moving to UE6 means ... 5x slower .\n\nThis is BS.",
                  "score": 1,
                  "created_utc": 1744805790.0,
                  "replies": []
                },
                {
                  "id": "mnamv6a",
                  "author": "Squirrel_Apocalypse2",
                  "body": "And just 6 months ago you could get GPUs for great deals around black Friday. It's just a particularly poor time at the moment due to many factors. ",
                  "score": 1,
                  "created_utc": 1744749052.0,
                  "replies": [
                    {
                      "id": "mnanp8m",
                      "author": "w1n5t0nM1k3y",
                      "body": "Not sure what you mean by \"great deals\". The pricing for GPUs has been pretty garbage for years, as has availability.",
                      "score": 2,
                      "created_utc": 1744749300.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mn8rup7",
          "author": "ChafterMies",
          "body": ">basic computer\n\nThis is where your phone comes in. It’s a basic computer, mobile, can run all these “sports” games. All mobile gaming hardware is in danger of being supplanted by phones.",
          "score": -1,
          "created_utc": 1744729116.0,
          "replies": [
            {
              "id": "mn8xh2s",
              "author": "w1n5t0nM1k3y",
              "body": "Possible, but for whatever reason nobody seems ready to make the jump and put out good games for phones that aren't based on microtransactions.\n\nI think the issue might be that \"phones\" seems to have the same problems as PC gaming where you have to target a huge range of devices with various specifications, without the advantages of PC gaming where you can focus on high end games and people that are willing to put the effort into understanding how to get the most out of the hardware they have.\n\nAlso, phones have the problem of being communications devices. I wouldn't want to use my phone as my primary gaming device because I wouldn't want it interrupting me when a call or message came in while gaming, nor would I want it muting all incoming communications while I play. Having the phone as a separate device is useful.  I don't even like playing music on my phone when I'm at home because I'd rather not have messages/calls interrupting my music.",
              "score": 5,
              "created_utc": 1744730806.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mn8lwso",
          "author": "None",
          "body": "[deleted]",
          "score": -4,
          "created_utc": 1744727322.0,
          "replies": [
            {
              "id": "mnamdp8",
              "author": "Squirrel_Apocalypse2",
              "body": "I can find people that say anything. Doesn't mean it's anywhere close to general consensus ",
              "score": 1,
              "created_utc": 1744748910.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mn9fws3",
          "author": "shogun77777777",
          "body": "Same I couldn’t give a shit about graphics if the gameplay isn’t good and unique",
          "score": -4,
          "created_utc": 1744736297.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mnckogb",
      "author": "nelly2929",
      "body": "PlayStation 6 made in the USA ….. Only $5999",
      "score": 8,
      "created_utc": 1744772987.0,
      "replies": []
    },
    {
      "id": "mn8kfn6",
      "author": "nick182002",
      "body": "I've been saying for years that they should make a handheld that can play PS4 games natively.",
      "score": 7,
      "created_utc": 1744726872.0,
      "replies": [
        {
          "id": "mnaweft",
          "author": "Neo_Techni",
          "body": "that's what I'm hoping for",
          "score": 2,
          "created_utc": 1744751924.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mnc06fo",
      "author": "spaceraingame",
      "body": "I don’t even wanna start thinking about the home PS6 yet jfc",
      "score": 3,
      "created_utc": 1744765398.0,
      "replies": []
    },
    {
      "id": "mnabt1o",
      "author": "ProfessorSucc",
      "body": "I get that covid kinda threw the whole industry out of wack, but this is ridiculous.\n\nThe PS5 apparently can withstand 8K graphical capabilities and there’s maybe two games I’ve actually been impressed by. It doesn’t seem like we’ve even come close to the console’s capabilities. On top of that, most of the catalog has been remasters no one asked for.\n\nAnd yet here we are takin about the next console already. Figure this one out first ffs.",
      "score": 5,
      "created_utc": 1744745780.0,
      "replies": []
    },
    {
      "id": "mnb0sv5",
      "author": "gabslife",
      "body": "Why can’t it be psp2 or psvita2?",
      "score": 2,
      "created_utc": 1744753317.0,
      "replies": []
    },
    {
      "id": "mnb19mz",
      "author": "Auran82",
      "body": "Will the PS6 advertise supporting 16k on the box?",
      "score": 2,
      "created_utc": 1744753463.0,
      "replies": []
    },
    {
      "id": "mnci4w3",
      "author": "Alienhaslanded",
      "body": "If it's handheld then that's expected. But it will not be PS6 because that's just dumb and doesn't make sense.",
      "score": 3,
      "created_utc": 1744771981.0,
      "replies": []
    },
    {
      "id": "mner99i",
      "author": "Remy0507",
      "body": "\"A prolific leaker...\"\n\nStopped taking any of it seriously right there.",
      "score": 2,
      "created_utc": 1744811753.0,
      "replies": []
    },
    {
      "id": "mn8k6hx",
      "author": "I-LOVE-TURTLES666",
      "body": "A handled will be less powerful than a console! Wow! /s",
      "score": 4,
      "created_utc": 1744726791.0,
      "replies": []
    },
    {
      "id": "mn93s5c",
      "author": "None",
      "body": "Sony and Valve are probably waiting for the same chip for their next consoles 😏",
      "score": 2,
      "created_utc": 1744732677.0,
      "replies": []
    },
    {
      "id": "mn9w8ux",
      "author": "Masterofunlocking1",
      "body": "Give me another psp please!",
      "score": 2,
      "created_utc": 1744741068.0,
      "replies": []
    },
    {
      "id": "mnbvc58",
      "author": "Cuneus-Maximus",
      "body": "Who cares? It’s handheld.. it’s going to be low power by default.",
      "score": 2,
      "created_utc": 1744763682.0,
      "replies": []
    },
    {
      "id": "mnbgb76",
      "author": "fsfaith",
      "body": "It's cool that they're having another crack at handhelds again. Hopefully they'll actually support their own platform this time and not let it just die out.",
      "score": 1,
      "created_utc": 1744758508.0,
      "replies": []
    },
    {
      "id": "mnbksr1",
      "author": "FartyCakes12",
      "body": "Well ya, it’s a handheld…",
      "score": 1,
      "created_utc": 1744760016.0,
      "replies": []
    },
    {
      "id": "mnbzj6h",
      "author": "jpb21110",
      "body": "Man I just got my PS5 like 6 months ago, I don’t wanna hear another thing about the PS6 for like 4 years",
      "score": 1,
      "created_utc": 1744765166.0,
      "replies": []
    },
    {
      "id": "mncj25q",
      "author": "srebew",
      "body": "don't really need a 4k 8\" display, so being slightly less powerful is fine.  This is what MS should have done, a Series S as a handheld.",
      "score": 1,
      "created_utc": 1744772338.0,
      "replies": []
    },
    {
      "id": "mndh1wq",
      "author": "Rubicon2-0",
      "body": "PS6 for GTA6, I see now...",
      "score": 1,
      "created_utc": 1744789814.0,
      "replies": []
    },
    {
      "id": "mndme4w",
      "author": "Nawt_",
      "body": "You trying to say this will be a PSP 2?",
      "score": 1,
      "created_utc": 1744793297.0,
      "replies": []
    },
    {
      "id": "mne2kyp",
      "author": "ResponsibleQuiet6611",
      "body": "😂",
      "score": 1,
      "created_utc": 1744802529.0,
      "replies": []
    },
    {
      "id": "mnen8h5",
      "author": "JackfruitCalm3513",
      "body": "They have the portal..so why????",
      "score": 1,
      "created_utc": 1744810420.0,
      "replies": []
    },
    {
      "id": "mnhctmv",
      "author": "IFunkymonkey",
      "body": "A hybrid playstation?! Nice idea, if they do a seperate way of buying. I dont need portable gaming, but for people who want to enjoy the game on the go they can buy a less powerfull, but still pretty cappable handheld console. But not like an PSP / Vita type of games exclusive to that console. That's stupid. Make it the same system archetecture and make every game compatabile like the switch did. But the 'docked' version more powerfull than the handheld",
      "score": 1,
      "created_utc": 1744839695.0,
      "replies": []
    },
    {
      "id": "mnhdj6w",
      "author": "Optimus_Bull",
      "body": "I consider that a failure if a PS6 Handheld Edition is less powerful than a PS5. I honestly think they should strive for at least being as powerful as the regular PS5.\n\nAlthough I know that it also might not be feasible or make sense in the handheld space, since you could make the argument that it's needlessly powerful as a handheld, draining battery too quickly and costing too much to manufacture not to mention what retail price could be for consumers.",
      "score": 1,
      "created_utc": 1744839927.0,
      "replies": [
        {
          "id": "mnrerpz",
          "author": "B1zZare-o_O",
          "body": "What would you power it with a car battery.",
          "score": 1,
          "created_utc": 1744985202.0,
          "replies": [
            {
              "id": "mo37dx7",
              "author": "Optimus_Bull",
              "body": "We have gaming laptops, which is more powerful running on regular batteries.\n\nAnd power saving settings that reduce graphical power in exchange for longer battery life.\n\nEven the SteamDeck has such settings, even with less powerful hardware.\n\nSo it isn't undoable, but like I wrote earlier, Sony likely want to be \"cost efficient\". Which is understandable, even if a little disappointing.",
              "score": 1,
              "created_utc": 1745156288.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mnhoes4",
      "author": "Samtoast",
      "body": "What in the Nintendo!?",
      "score": 1,
      "created_utc": 1744843592.0,
      "replies": []
    },
    {
      "id": "mnrejtb",
      "author": "B1zZare-o_O",
      "body": "According to the rumor, Sony will launch two devices. The first is the PlayStation 6 itself, with all the technical bells and whistles. The second is a supposed PS6 portable. Said to feature a “15W SoC on 3nm” chipset that is “not as strong as the PlayStation 5.”",
      "score": 1,
      "created_utc": 1744985130.0,
      "replies": []
    },
    {
      "id": "mundcsq",
      "author": "DangerouslyTired0",
      "body": "If Sony let more time elapse before producing and releasing the PS6, wouldn’t that also allow hardware to advance further and also become more affordable? If that’s true, a significant upgrade to the PS5 becomes more attainable. If gains between console generations are becoming less pronounced and development times are going up, the simplest solution is for Sony to adapt and prolong the timeframe of the PS5 to allow technological progress sufficient for a generational leap.",
      "score": 1,
      "created_utc": 1748408955.0,
      "replies": []
    },
    {
      "id": "mna1jmw",
      "author": "nikolai_470000",
      "body": "No shit, it’s a handheld.",
      "score": 1,
      "created_utc": 1744742671.0,
      "replies": []
    },
    {
      "id": "mna2wv3",
      "author": "yakuzalinecook",
      "body": "My launch edition already can't play FF16, so it'd be wild to release something that's spec'd lower than a ps5 lol. Isn't going to be able to play anything.",
      "score": 1,
      "created_utc": 1744743085.0,
      "replies": []
    },
    {
      "id": "mn8xf7q",
      "author": "MercenaryCow",
      "body": "I'll just keep my ps5 pro then since apparently it will be way more powerful than the 6. And if 5 is better than 6 I can really foresee every single game being released on 5 too",
      "score": -2,
      "created_utc": 1744730791.0,
      "replies": [
        {
          "id": "mn9r598",
          "author": "BrewKazma",
          "body": "Huh? This is talking about a handheld. Not a base console.",
          "score": 3,
          "created_utc": 1744739540.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mnakmlk",
      "author": "Almawt",
      "body": "And still the steam deck clears it",
      "score": -3,
      "created_utc": 1744748392.0,
      "replies": [
        {
          "id": "mnavtfw",
          "author": "Neo_Techni",
          "body": "Steam Deck is weaker than PS4 Pro though, so no",
          "score": 6,
          "created_utc": 1744751741.0,
          "replies": [
            {
              "id": "mo1hg3a",
              "author": "MonsterHunterRainy",
              "body": "It's strong as PS3...",
              "score": 1,
              "created_utc": 1745122198.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnmsyyr",
          "author": "User9705",
          "body": "na, why have the asus ally x that ram boost helps a ton.",
          "score": 1,
          "created_utc": 1744916188.0,
          "replies": []
        }
      ]
    }
  ]
}