{
  "post": {
    "title": "Nintendo Switch 2 Surpasses 5 Million Units Sold in First Month, Marking Historic Launch",
    "author": "Moth_LovesLamp",
    "id": "1lpf3et",
    "score": 2148,
    "created_utc": 1751407974.0,
    "selftext": "",
    "num_comments": 509,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lpf3et/nintendo_switch_2_surpasses_5_million_units_sold/"
  },
  "comments": [
    {
      "id": "n0ux8ip",
      "author": "Tankninja1",
      "body": "Not surprised it’s still outselling the competition.\n\nI am surprised it’s outselling the launch of the Switch 1.",
      "score": 567,
      "created_utc": 1751416190.0,
      "replies": [
        {
          "id": "n0v4y5w",
          "author": "EbonBehelit",
          "body": "People were skeptical about the Switch when it initially launched, and its predecessor (the Wii U) was one of the worst commercial failures in Nintendo's history. It's not _that_ surprising.",
          "score": 202,
          "created_utc": 1751418939.0,
          "replies": [
            {
              "id": "n0vutum",
              "author": "quotesforlosers",
              "body": "I don’t remember anyone being skeptical about the first switch. I thought the consensus was that it was really ingenious.",
              "score": 65,
              "created_utc": 1751428483.0,
              "replies": [
                {
                  "id": "n0w93ln",
                  "author": "Suspicious_Owl_5740",
                  "body": "At first lots of people were saying like \"what's the point\" but then Steam and sony is now following Nintendo's footsteps in handhelds. ",
                  "score": 41,
                  "created_utc": 1751435172.0,
                  "replies": [
                    {
                      "id": "n0wcmwd",
                      "author": "quotesforlosers",
                      "body": "Not saying it didn’t happen, but this is all news to me. \n\nMaybe it’s an age thing, because I thought young kids, their parents, and established adults loved the initial thought of being able to game on the go without loss of graphical performance.",
                      "score": 18,
                      "created_utc": 1751437048.0,
                      "replies": [
                        {
                          "id": "n0wdsyn",
                          "author": "unripenedfruit",
                          "body": "> being able to game on the go without loss of graphical performance.\n\nI mean that's not exactly true. Docked performance is higher than handheld mode\n\nRegardless, I don't know how much scepticism existed at the launch of the original switch, but I can understand if there was at least some. And understandably less with the switch 2 after it proved to be incredibly successful, when the switch's predecessor was ultimately a flop",
                          "score": 5,
                          "created_utc": 1751437686.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n0y4iz4",
                      "author": "APRobertsVII",
                      "body": "I remember some of that being discussed, but I don’t think it was as common as some people remember. As someone who has always preferred handhelds, the love was ingenious to me.\n\nSwitch 1 sold nearly 3 million in its first month, which was at or near record levels for the time, so it obviously wasn’t so controversial as to impact sales out of gate.",
                      "score": 2,
                      "created_utc": 1751466157.0,
                      "replies": []
                    },
                    {
                      "id": "n0wlehd",
                      "author": "mschuster91",
                      "body": ">and sony is now following Nintendo's footsteps in handhelds. \n\nIf anything it's the other way around, remember the PlayStation Portable? The Switch is a carbon copy off of that concept, just with fancier controllers and better battery life.",
                      "score": -3,
                      "created_utc": 1751441985.0,
                      "replies": [
                        {
                          "id": "n0wry07",
                          "author": "Tecnoguy1",
                          "body": "PSP wasn’t a hybrid, it was taking notes from the Nintendo DS. \n\nThe Wii U definitely took some features from the PSVita though, as that could be a PS3 controller as well as a console.",
                          "score": 3,
                          "created_utc": 1751445892.0,
                          "replies": []
                        },
                        {
                          "id": "n0xkhco",
                          "author": "Suspicious_Owl_5740",
                          "body": "That has to be sarcasm right, we're not in r/tomorrow right now you know",
                          "score": 2,
                          "created_utc": 1751459620.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n0vvzsn",
                  "author": "SuperCool101",
                  "body": "People were pretty meh about the launch lineup.",
                  "score": 11,
                  "created_utc": 1751428972.0,
                  "replies": [
                    {
                      "id": "n0whfss",
                      "author": "QueezyF",
                      "body": "Also all it had was Breath of the Wild and not the best 3rd party support. Very weak launch lineup.",
                      "score": 2,
                      "created_utc": 1751439697.0,
                      "replies": [
                        {
                          "id": "n0wkjc9",
                          "author": "JamesHeckfield",
                          "body": "Zelda was the killer app for switch. I played that game for months!\n\nA brand new, first of its kind, open world Zelda… and you can play it on the go or on your TV. \n\nI didn’t even use the dock for like the first month, I was so blown away by the game on handheld.\n\nNo, there wasn’t a ton of compelling software right out of the gate. There was more than enough, however, to sell people on the concept.",
                          "score": 6,
                          "created_utc": 1751441473.0,
                          "replies": [
                            {
                              "id": "n0zo0fo",
                              "author": "baldeagle1991",
                              "body": "Tbh even then it was a port of a Wii U game. What Switch only games were even out on release?",
                              "score": 1,
                              "created_utc": 1751481944.0,
                              "replies": [
                                {
                                  "id": "n0ztbje",
                                  "author": "JamesHeckfield",
                                  "body": "None that I can think of.\n\nIn hindsight, this was a good thing. They didn’t rush out any games to meet a launch window. 3DS didn’t have much in their launch window either. Both were launched in spring so it can be seen as a soft launch. And a lot of folks skipped the Wii U, so they never played Mario Kart 8.\n\nBOTW is an exceptional case here, it was developed for Wii U like you said. But the Wii U version is an afterthought. It wasn’t like the it came out for switch a year after release.\n\nFor all intents and purposes, BOTW is a Switch game.",
                                  "score": 1,
                                  "created_utc": 1751483532.0,
                                  "replies": [
                                    {
                                      "id": "n12ecqm",
                                      "author": "DaCody_98",
                                      "body": "No one tell them that the switch literally uses WiiU emulation for BOTW.",
                                      "score": 1,
                                      "created_utc": 1751513723.0,
                                      "replies": [
                                        {
                                          "id": "n12miha",
                                          "author": "JamesHeckfield",
                                          "body": "No one cares about the Wii U.\n\nI had one. At launch. \n\nYou can go on and on about technicalities, but it’s a switch title.",
                                          "score": 1,
                                          "created_utc": 1751517203.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "n0yho47",
                          "author": "bluedestiny88",
                          "body": "While I won’t argue against the weak launch lineup as a whole, Breath of the Wild was a unprecedented and monumental achievement in terms of what it did for the Switch’s future: BOTW had an attach rate of over 100%, meaning the [game’s Switch version sold more in its initial sales period than the total number of Switch consoles sold in the same timeframe](https://www.forbes.com/sites/insertcoin/2017/04/15/wait-how-did-zelda-breath-of-the-wild-for-switch-outsell-the-switch-itself/). People were buying the game even if they didn’t have a Switch to play it on",
                          "score": 3,
                          "created_utc": 1751469917.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n0xnh9l",
                      "author": "Ganon_Cubana",
                      "body": "To be fair people are pretty meh on the lineup of switch 2.",
                      "score": 3,
                      "created_utc": 1751460694.0,
                      "replies": []
                    },
                    {
                      "id": "n0w8gkt",
                      "author": "quotesforlosers",
                      "body": "Not saying they weren’t, but this is all news to me.",
                      "score": 0,
                      "created_utc": 1751434845.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n0wvufw",
                  "author": "Lusankya",
                  "body": "In retrospect, yeah.\n\nBefore it happened, not so much.\n\nA system trying to play console quality on the go was still a big risk, and Nintendo wasn't exactly known for portable graphical fidelity with the 3DS. A lot of critics thought we were going to get a mid tier mobile phone's worth of gaming experience stuck to some uncomfortable controllers and an hour of battery under real-world conditions.\n\nS1 was the *only* Nintendo console I didn't preorder during my adult life. I wasn't convinced it'd pan out. Instead, I wound up stalking websites chasing the restocks once BotW made it clear that they had a winner on their hands.",
                  "score": 6,
                  "created_utc": 1751448198.0,
                  "replies": [
                    {
                      "id": "n132ol8",
                      "author": "quotesforlosers",
                      "body": "I was the opposite. It was the first Nintendo console I purchased since the N64. Seeing all of these contrasting opinions about launch makes me think we were just in different marketing categories/places in our lives at the time.",
                      "score": 1,
                      "created_utc": 1751525339.0,
                      "replies": []
                    },
                    {
                      "id": "n0x2n2h",
                      "author": "Programmdude",
                      "body": "I mean, it's still not console quality (assuming graphics). The switch 1 was a far cry from ps4/xbone graphics, and is closer to a high end 2017 phones graphics.\n\nIt's certainly far closer to dedicated console graphics/performance than the previous portable console attempts, and its got enough performance that you can actually port games to it without much loss in quality/features.",
                      "score": 1,
                      "created_utc": 1751451950.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n11es82",
                  "author": "Spider-Mike23",
                  "body": "I remember them being sought after and demanded like mad, and everyone was popping up with one. Switch 2, I haven’t seen any discourse online for them meet high demand immediately, nor have I have even seen one people with one actually. It’s weird.",
                  "score": 2,
                  "created_utc": 1751501310.0,
                  "replies": []
                },
                {
                  "id": "n0xg6kj",
                  "author": "punIn10ded",
                  "body": "There was scepticism around third part support. Especially after the wii-U",
                  "score": 1,
                  "created_utc": 1751457982.0,
                  "replies": []
                },
                {
                  "id": "n0xuagk",
                  "author": "brads-a-wizard",
                  "body": "I was definitely skeptical. Waited years for my own reassurance.",
                  "score": 1,
                  "created_utc": 1751462993.0,
                  "replies": []
                },
                {
                  "id": "n0ykk4h",
                  "author": "hyperforms9988",
                  "body": "I don't know that *everybody* was fully confident that the Switch wasn't going to bomb the same way the Wii U did.  I certainly didn't rush out to get one after I got stung by having purchased a Wii U.  I think I waited maybe a year or two before I bought the Switch.\n\nThe Wii U's issue was partly software.  You weren't going to know how the Switch software support was going to pan out just from its launch.  Not long after its launch, they started having slam dunks for Nintendo Directs showing all the new upcoming software they were coming out with at the time and I feel like that's when things really started to snowball and the last assurance was out there for people... that yeah, they're working on some *good* shit and they're going to be keeping us busy for a while.\n\nIronically, the failure of the Wii U was a blessing in disguise because that opened up a ton of opportunity for Switch ports of the better Wii U games that relatively nobody played because they didn't buy the Wii U, so Nintendo at one point was *pumping* shit out between regular releases and ports and it made the Switch look very attractive for a lot of people.  They don't have the same luxury for the Switch 2.  It's backwards compatible, they got all those ports out of their system from the Wii U, and it's much more capable in hardware... so it's going to be a little weirder in terms of software support this time around, at least in theory anyway.",
                  "score": 1,
                  "created_utc": 1751470715.0,
                  "replies": []
                },
                {
                  "id": "n10oz2q",
                  "author": "sentient-sloth",
                  "body": "I recall a fair amount of skepticism, especially amongst Nintendo fans. The Wii U left a bad taste in peoples mouth. I had a Wii U and was mostly unimpressed with its lineup of exclusives. It was about 2-3 years before the Switch library was deep enough that I was willing to buy one.\n\nDoesn’t mean it was all bad though, there was a lot of hype behind it too and it was sold out for a while after release but once stock became readily available it took a few years to really get going.",
                  "score": 1,
                  "created_utc": 1751492913.0,
                  "replies": []
                },
                {
                  "id": "n11kvzj",
                  "author": "LoudAndCuddly",
                  "body": "It’s was novel, some of the first promos ads were a bit cheesy and unrealistic.",
                  "score": 1,
                  "created_utc": 1751503298.0,
                  "replies": []
                },
                {
                  "id": "n0w2pf8",
                  "author": "mediocre-referee",
                  "body": "With gamers, yes. Casuals didn't know what the Switch was yet by April 2017",
                  "score": -2,
                  "created_utc": 1751432000.0,
                  "replies": [
                    {
                      "id": "n0w8dyo",
                      "author": "quotesforlosers",
                      "body": "I doubt that too. Wasn’t the whole switch marketing campaign for casuals?",
                      "score": 1,
                      "created_utc": 1751434807.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0wpz2z",
              "author": "THExPILLOx",
              "body": "Honestly, if it didn't have the backwards compatibility, I don't think it would sell nearly as well as it has. \n\n\nKnowing that I already owned 30+ games for it, definitely made it more appealing. ",
              "score": 4,
              "created_utc": 1751444706.0,
              "replies": []
            },
            {
              "id": "n0xqu8f",
              "author": "Rybread52",
              "body": "The Switch also didn’t have nearly as many units in stock at launch. It was sold out for pretty much the first several months.",
              "score": 4,
              "created_utc": 1751461852.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0v5wkw",
          "author": "Lankpants",
          "body": "I'm not surprised about either. The main constraints on S1 sales was supply. It's still the main constraints on S2 sales but the difference in total supply between the two is huge.",
          "score": 30,
          "created_utc": 1751419279.0,
          "replies": []
        },
        {
          "id": "n0v7jhu",
          "author": "fire2day",
          "body": "The switch was popular at launch, but even then it was nowhere near pandemic Animal Crossing popular.",
          "score": 13,
          "created_utc": 1751419865.0,
          "replies": []
        },
        {
          "id": "n0uzjhv",
          "author": "Rixien",
          "body": "I wasn’t following Nintendo too closely around then (never got a Wii U and only kept my 3DS for Pokemon) but ended up getting the Switch for Christmas later that year.\n\nI think (or at least was under the impression back in the day) that a lot more people assumed the Switch was gonna be the actual end of Nintendo following the Wii U’s performance until it came out and people started seeing it in the wild.",
          "score": 22,
          "created_utc": 1751417018.0,
          "replies": [
            {
              "id": "n0vb0sw",
              "author": "Coliosis",
              "body": "Same boat, funnily enough what actually got me to buy a switch was Tetris 99. It just scratched an itch I didn’t know I had and hooked me instantly lmao. I’m not looking forward to the day they shut down those servers",
              "score": 4,
              "created_utc": 1751421075.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0vajb2",
          "author": "pitterpatter0910",
          "body": "What’s the competition to the switch? Genuine question I have no idea.",
          "score": 4,
          "created_utc": 1751420909.0,
          "replies": [
            {
              "id": "n0vh3xm",
              "author": "Tankninja1",
              "body": "Steam Deck and some of the other handhelds think Asus and Lenovo make along with other even smaller brands. Some of these don’t technically play Nintendo games but yarrrr.\n\nPS5 and Xbox are also technically competitors in the console space.  Maybe debatable since they aren’t portable but there are a lot of really popular games with cross play.",
              "score": 10,
              "created_utc": 1751423187.0,
              "replies": [
                {
                  "id": "n0w4dj5",
                  "author": "Blanche_Cyan",
                  "body": "Can those even be considered actual competition? Like, at best they are competition in the same way the first trainer of the first route in a Pokemon game is competition... I will give them the benefit of doubt and won't say they only have bug types...",
                  "score": 5,
                  "created_utc": 1751432802.0,
                  "replies": [
                    {
                      "id": "n0wbjq2",
                      "author": "TaiyoT",
                      "body": "from a marketing stance? No, not really.\n\nfrom a hardware stance? Yes. It serves the same purpose as a switch 2 would. Portable gaming.\n\nIf people do choose between owning a handheld pc over a switch 2, then it kinda is. All competition has to start somewhere.\n\nedit: to reference pokemon, they're like a trainer hiding in a cave, that's quite powerful and actually a challenge, but nobody knows they're there.",
                      "score": -2,
                      "created_utc": 1751436460.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n0wiiqv",
                  "author": "Bdr1983",
                  "body": "Nintendo lives in a separate space from those. The Nintendo IP is so strong that people will buy their consoles simply for the Mario, Zelda, and Pokemon franchises.  \nWhile other console makers have focussed on realism, graphics, etc. Nintendo has stuck to their idea of making good games and putting graphics and all that in second place.\n\nWhile I can enjoy the graphical orgasms of the newer consoles and AAA titles on PC, if a game is not enjoyable to play no graphics onslaught can make it a good game (to me).  \nI've always enjoyed Nintendo games, though.",
                  "score": 3,
                  "created_utc": 1751440304.0,
                  "replies": []
                },
                {
                  "id": "n0vhodj",
                  "author": "pitterpatter0910",
                  "body": "Are the first ones you listed also consoles or is switch the only thing that does both?",
                  "score": 2,
                  "created_utc": 1751423388.0,
                  "replies": [
                    {
                      "id": "n0vvbo6",
                      "author": "TaiyoT",
                      "body": "They're technically handheld gaming PCs so you can plug them into any monitor or tv with hdmi and bluetooth any controller or keyboard like you would with a computer.",
                      "score": 6,
                      "created_utc": 1751428690.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n10cwv5",
              "author": "Realistic_Condition7",
              "body": "I mean in a broader sense it would be the other consoles. Nintendo is putting their innovation and exclusivity up against other consoles power and exclusivity.\n\nCould say that handheld PCs compete with them in the portability space, but that’s still a massive difference in game library.\n\nAs long as they have Mario and Zelda nobody will really directly compete with them in the way maybe that Xbox and PlayStation compete.",
              "score": 1,
              "created_utc": 1751489326.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0vk1ex",
          "author": "Unfair-Banana-1505",
          "body": "Yeah Nintendo is the king of the console market and that's not changing anytime soon",
          "score": 6,
          "created_utc": 1751424239.0,
          "replies": []
        },
        {
          "id": "n0vhbby",
          "author": "Willyscoiote",
          "body": "Everyone of my friends wanted a Switch 1 in my country. The only issue was that Nintendo wasn’t selling it here, so people had to import one after stocks normalized",
          "score": 1,
          "created_utc": 1751423259.0,
          "replies": []
        },
        {
          "id": "n0wcqta",
          "author": "NoobensMcarthur",
          "body": "There was only one game worth playing when the Switch launched, hot off the heels of the colossal failure of the WiiU. Switch 2 not only benefits from the Switch’s success but it got the advantage to launch with a lifetime worth of games to play. ",
          "score": 1,
          "created_utc": 1751437107.0,
          "replies": []
        },
        {
          "id": "n0xrij4",
          "author": "qualitypi",
          "body": "Why? Switch is a proven concept now, and there's a hell of a lot more confidence in the platform both from consumers and partners.",
          "score": 1,
          "created_utc": 1751462080.0,
          "replies": []
        },
        {
          "id": "n0xxmf3",
          "author": "AthearCaex",
          "body": "Switch 1 had very few units available on launch and Nintendo scrambled afterwards to meet demand. Nintendo prepared for this launch and has been producing units for over 6 months which is why there was so many leaks. They have likely 10+million units out there that they can sell when for the switch 1 it was likely around 3 million.\n\nAt the pace nintendo is going if they keep up production they could hit 30mil units in a year which is impressive but I do feel like this system could plateau quickly with sales as everyone who wants one might already have one or at least has access to them but we shall see once winter hits to see if people are still rushing out to buy them.",
          "score": 1,
          "created_utc": 1751464071.0,
          "replies": []
        },
        {
          "id": "n0yn0fg",
          "author": "lyons_vibes",
          "body": "friendly reminder nintendo considers all shipped units as sales. meaning those bulk orders walmart, target, gamestop etc place are considered sales whereas sony and other competitors count sales as units actually being sold to customers from any retailer",
          "score": 1,
          "created_utc": 1751471388.0,
          "replies": [
            {
              "id": "n0yze2h",
              "author": "Tankninja1",
              "body": "Not sure why they wouldn’t count those as sales. Walmart is actually buying them from Nintendo.",
              "score": 1,
              "created_utc": 1751474910.0,
              "replies": [
                {
                  "id": "n0zk359",
                  "author": "lyons_vibes",
                  "body": "typically sales numbers are used to represent how popular a product is based on how many consumers buy the product at the register. by including these wholesale orders from walmart, target, gamestop, its into their “units sold” numbers artificially inflates the sales numbers to make it look like the product is more popular among consumers than it actually is. nintendo can take these numbers to investors and pretend their console is selling more than it actually among consumers. classic ryan howard move",
                  "score": 1,
                  "created_utc": 1751480773.0,
                  "replies": [
                    {
                      "id": "n0zrff3",
                      "author": "Tankninja1",
                      "body": "Unit sales isn’t the only metric Nintendo uses to measure their sales and growth as a company, not even really their leading statistic they show investors. Page 1 of their annual report is all Net Sales and various Operating Profits in billion of yen or %.\n\nAnd again the units have been sold. Nintendo already made all the money they’re going to make on the console when they sold it to Walmart. The important statistic for Nintendo is that retailers keep ordering.",
                      "score": 1,
                      "created_utc": 1751482958.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n10bpiw",
          "author": "Realistic_Condition7",
          "body": "Feels like the PS1>PS2.\n\nPS1 took the world by storm, and then PlayStation didn’t try to pull any punches, just put out a next generation system with a 2 on the end of it and people went bananas.\n\nSwitch finally taking a page out of PlayStation’s book, rather than its own/Xbox’s with goofy naming conventions and deviations from what made their previous device successful.",
          "score": 1,
          "created_utc": 1751488979.0,
          "replies": []
        },
        {
          "id": "n12g9kk",
          "author": "rabouilethefirst",
          "body": "The switch 2 has the benefit of being able to play all switch 1 games with better performance",
          "score": 1,
          "created_utc": 1751514499.0,
          "replies": []
        },
        {
          "id": "n0vf2kj",
          "author": "Dhegxkeicfns",
          "body": "With the level of enthusiasm I have about it I'm totally perplexed. Who is buying this thing?",
          "score": -2,
          "created_utc": 1751422474.0,
          "replies": [
            {
              "id": "n0vv1gc",
              "author": "MittenstheGlove",
              "body": "In America? Nintendo Fans and MAYBE as a gift for the kids since it’s a handheld. It’s basically the equivalent of being a Disney Adult and I don’t mean that with shade.\n\nJapan loves handhelds.",
              "score": 2,
              "created_utc": 1751428572.0,
              "replies": [
                {
                  "id": "n10v16i",
                  "author": "Dhegxkeicfns",
                  "body": "I'm just saying the pricetag essentially doubled from the Switch and while the hardware is better the ecosystem is going to be pretty dry for a while. I don't see any reason to upgrade yet.",
                  "score": 1,
                  "created_utc": 1751494847.0,
                  "replies": [
                    {
                      "id": "n10z2zb",
                      "author": "MittenstheGlove",
                      "body": "I upvoted your previous comment just FYI. Your question was more like “What’s with buying on this console? It’s only got like 5 games currently.”",
                      "score": 1,
                      "created_utc": 1751496179.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0xo0j9",
              "author": "Hazel-Rah",
              "body": "https://i.kym-cdn.com/photos/images/original/000/645/713/888.jpg",
              "score": 1,
              "created_utc": 1751460881.0,
              "replies": [
                {
                  "id": "n10tr19",
                  "author": "Dhegxkeicfns",
                  "body": "Do they have any S2 specific console defining games yet?\n\nThe hardware itself looks nearly identical.",
                  "score": 1,
                  "created_utc": 1751494430.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n1vatxy",
              "author": "Snooch_Nooch",
              "body": "Me",
              "score": 1,
              "created_utc": 1751920800.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0w8rla",
          "author": "xtoc1981",
          "body": "Not only that, it sold the most units in history within the 1st day and 1st month",
          "score": 0,
          "created_utc": 1751435001.0,
          "replies": []
        },
        {
          "id": "n11kqk4",
          "author": "LoudAndCuddly",
          "body": "I’m completely baffled and can’t believe how wrong I was about this… will be blown away if it keeps selling this good.",
          "score": 0,
          "created_utc": 1751503248.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0unhd7",
      "author": "Scorpio989",
      "body": "1 in 3 people in Japan own a Switch. The Japanese market alone is enough for Nintendo to stay competitive globally.\n\nFor comparison, only around 5% own a PS5.",
      "score": 260,
      "created_utc": 1751412799.0,
      "replies": [
        {
          "id": "n0ux9b3",
          "author": "_cakewalk_",
          "body": "I wonder why only 5% own a PS5 when a Japanese company produces the console. I’d expect that figure to be significantly higher\n\nEdit: thanks for educating me on this!",
          "score": 58,
          "created_utc": 1751416197.0,
          "replies": [
            {
              "id": "n0uya7c",
              "author": "Amtoj",
              "body": "PlayStation actually moved a lot of its operations to the US in the past decade. Not to mention shutting down studios they had over in Japan. They're very focused on the American and European markets.",
              "score": 126,
              "created_utc": 1751416565.0,
              "replies": [
                {
                  "id": "n0widxi",
                  "author": "QueezyF",
                  "body": "Team Asobi really the only ones holding it down anymore in Japan.",
                  "score": 10,
                  "created_utc": 1751440229.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0uxk00",
              "author": "MosaicCantab",
              "body": "PlayStation has deeper penetration in the US even though Xbox is an American company.",
              "score": 46,
              "created_utc": 1751416306.0,
              "replies": [
                {
                  "id": "n0wfhh6",
                  "author": "godfathertrevor",
                  "body": ">deeper penetration\n\nNice.",
                  "score": -5,
                  "created_utc": 1751438614.0,
                  "replies": []
                },
                {
                  "id": "n0ze1ub",
                  "author": "ssnoopy2222",
                  "body": "Xbox is being penetrated.",
                  "score": -3,
                  "created_utc": 1751479002.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0vblus",
              "author": "subpar-life-attempt",
              "body": "Real talk, it's the lifestyle.\n\nMost people in Japan live in small apartments and share roommates. \n\nThey are typically out and about a lot so gaming on the go is huge. That's also why the ps portal is getting so many upgrades. PS saw a pop in sales overseas with it.",
              "score": 30,
              "created_utc": 1751421277.0,
              "replies": [
                {
                  "id": "n0vqdlw",
                  "author": "SupremeDictatorPaul",
                  "body": "I don’t know how accurate it is, but a lot of Japanese and Korean shows/movies seem to show people in their tiny rooms/apartments watching movies on their phone or a tablet in bed. Or playing games on the same devices. \n\nWithout extra space, it seems like a lot of people are skipping a couch/TV combo, and making do with smaller/cheaper alternatives. If that’s the case, the Switch would seem to fit that lifestyle better.",
                  "score": 13,
                  "created_utc": 1751426664.0,
                  "replies": [
                    {
                      "id": "n1148d3",
                      "author": "CandidBee8695",
                      "body": "Nintendo has cute games. And a lot of Japanese people like cute stuff as well. They also just generally seem more laid back about stuff. Like I can’t see them getting aggressive about things like an American audience gets about Nintendo.",
                      "score": 2,
                      "created_utc": 1751497869.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n0vv1a3",
                  "author": "LihLin22",
                  "body": "Even bedrooms and living rooms in most homes in Japan tend to be on the smaller side so space is more of a premium. Why get a bulky PS5 that's stationary when you can get a much smaller mobile PS4/ PS4 Pro like graphics in a portable easy to move package where you can play anywhere you want?",
                  "score": 4,
                  "created_utc": 1751428569.0,
                  "replies": []
                },
                {
                  "id": "n0z0avp",
                  "author": "Enchelion",
                  "body": "Yep. Handheld consoles have traditionally done far better there than in many other countries. The original Gameboy/pocket/color sold 32 million units just in Japan. At the time of the consoles discontinuation the total population of the country was 127m. For comparison the US bought 44m on a population of 290m.",
                  "score": 4,
                  "created_utc": 1751475167.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0vhqow",
              "author": "LongjumpingShip3657",
              "body": "The Switch just makes more sense from a Japanese perspective\n\nThe PS5 is massive, more expensive, isn't portable, none of the first party games are that interesting to the Japanese audience, and it has to compete with the PC market",
              "score": 6,
              "created_utc": 1751423411.0,
              "replies": []
            },
            {
              "id": "n0uzr6y",
              "author": "Scorpio989",
              "body": "It's a combination of a lot of reasons, but I think it's mostly that Nintendo products are just more practical for Japanese. \n\nMany people are just too busy to commit to \"hardcore\" games. A lot of people spend hours every day traveling by train, and then a majority of their free time is still at work/school. They simply don't have the time or space to enjoy a Playstation.",
              "score": 11,
              "created_utc": 1751417095.0,
              "replies": [
                {
                  "id": "n0vdqyf",
                  "author": "Smelldicks",
                  "body": "Japan is completely average in leisure time metrics from the OECD.",
                  "score": 5,
                  "created_utc": 1751422016.0,
                  "replies": [
                    {
                      "id": "n0wv3ux",
                      "author": "brixtonwreck",
                      "body": "Yeah, how Japan appears in the media (everyone's a salaryman in a tiny flat in Tokyo) is doing a lot of lifting in this discussion generally.\n\nHaving looked at the results you mention, I'm generally surprised how tightly they cluster!\n https://en.m.wikipedia.org/wiki/List_of_countries_by_time_devoted_to_leisure_and_personal_care",
                      "score": 3,
                      "created_utc": 1751447759.0,
                      "replies": [
                        {
                          "id": "n0zeb7n",
                          "author": "Smelldicks",
                          "body": "Yeah they also work less than places like the US",
                          "score": 1,
                          "created_utc": 1751479076.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0xo7z8",
              "author": "chargebeam",
              "body": "I think they prefer handheld consoles. When I visited Japan in 2016, I saw so many people holding a PSP in the subway.",
              "score": 2,
              "created_utc": 1751460953.0,
              "replies": []
            },
            {
              "id": "n0y9jt9",
              "author": "alexturnerftw",
              "body": "Ps5 is also very expensive and Japanese people are struggling. Switch pricing is cheaper in japan than abroad due to this",
              "score": 1,
              "created_utc": 1751467610.0,
              "replies": []
            },
            {
              "id": "n0xpbjq",
              "author": "_RADIANTSUN_",
              "body": "This might come as a surprise to you but people in Japan don't just buy everything just cuz it's from a Japanese company, they have a full, strong, incredibly competitive, functioning market economy where companies actually have to offer value to consumers.",
              "score": 1,
              "created_utc": 1751461333.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0vm71b",
          "author": "inyue",
          "body": "Is this ownership related to sales? Because I can guarantee that a big portion of PS5 sold in Japan was scalped and exported since we had the cheapest PS5 in the world for a while. \n\nEven normies (and only normies could do that due to scalper restrictions) were buying PS5 at the store then selling it for the double of the price on the other side of the street.",
          "score": 1,
          "created_utc": 1751425041.0,
          "replies": []
        },
        {
          "id": "n0vv3qk",
          "author": "subjectivemusic",
          "body": "But how many own a Plash Speed 5 Wireless Router?",
          "score": 1,
          "created_utc": 1751428598.0,
          "replies": []
        },
        {
          "id": "n0y2sga",
          "author": "zeusdescartes",
          "body": "I'm curious how popular the ps5 is tbh. I know a ton of people have them, I just can't justify buying one. My ps4 works perfectly fine and the game catalog is deep! So many games I haven't played and they're all in 4K.",
          "score": 1,
          "created_utc": 1751465647.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0uams4",
      "author": "donpianta",
      "body": "It’s wild how the Nintendo Switch 2 is not only the fastest selling console to date (3.5 million units sold in just 4 days) but it also holds the record for the most successful launch of any home console in the history of video games… and people are still going to claim Nintendo is doomed and needs to go third party. 😒",
      "score": 417,
      "created_utc": 1751408562.0,
      "replies": [
        {
          "id": "n0umkfg",
          "author": "not_a_moogle",
          "body": "Nintendo did a good job of making sure they had plenty of units available at launch so that scalpers weren't gobbling them up.",
          "score": 117,
          "created_utc": 1751412495.0,
          "replies": [
            {
              "id": "n0v119m",
              "author": "DarkDuo",
              "body": "Scalpers did buy them but they’re finding out quickly it doesn’t sale very well when stores get quick restocks",
              "score": 26,
              "created_utc": 1751417547.0,
              "replies": []
            },
            {
              "id": "n0urh3z",
              "author": "Whatever801",
              "body": "Man I still can't find one. Not looking very hard to be fair",
              "score": 43,
              "created_utc": 1751414140.0,
              "replies": [
                {
                  "id": "n0uxg4j",
                  "author": "not_a_moogle",
                  "body": "Target got a bunch last week and bust buy just got them today.  You probably could have gotten one this morning. \n\nHonestly though, restocks have been pretty consistent.",
                  "score": 28,
                  "created_utc": 1751416266.0,
                  "replies": [
                    {
                      "id": "n0ve324",
                      "author": "Whatever801",
                      "body": "Yeah I've been hearing that buts it's always sold out at my local stores. I live in a big metro area though so maybe demand is higher",
                      "score": 4,
                      "created_utc": 1751422132.0,
                      "replies": [
                        {
                          "id": "n0zie0v",
                          "author": "Lee_Sinna",
                          "body": "I work at a Target in electronics, they’ve been coming in pretty frequently but we haven’t gotten more than like 10 at a time since the initial release so they usually sell out by mid-day\n\nJust call the store when they open to check if they got any on their truck that day, and if they have them in you probably have to go earlier in the day to pick it up to have a chance to",
                          "score": 1,
                          "created_utc": 1751480271.0,
                          "replies": [
                            {
                              "id": "n0ziwwf",
                              "author": "Whatever801",
                              "body": "Yeah makes sense. I might just wait it out for a while. So much steam and playstation backlog already haha",
                              "score": 1,
                              "created_utc": 1751480426.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n0v1z58",
                      "author": "HotdoghammerOG",
                      "body": "Way better than PS5",
                      "score": 5,
                      "created_utc": 1751417880.0,
                      "replies": [
                        {
                          "id": "n0vandb",
                          "author": "subpar-life-attempt",
                          "body": "PS5 came out during COVID. That was expected.",
                          "score": 0,
                          "created_utc": 1751420948.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n0uwhb5",
                  "author": "TheTingGoSkrrrrraaaa",
                  "body": "A Best Buy I visited today had like 20 each, they had a big restock at most stores",
                  "score": 2,
                  "created_utc": 1751415916.0,
                  "replies": []
                },
                {
                  "id": "n0vrpr5",
                  "author": "matthewmspace",
                  "body": "Try calling GameStops near you in the morning when they open and ask if they have Switch 2’s. That’s how I got mine. The one near me had 9, so I went in and bought one.",
                  "score": 1,
                  "created_utc": 1751427199.0,
                  "replies": [
                    {
                      "id": "n0vry8o",
                      "author": "Whatever801",
                      "body": "Thanks, I'll try that",
                      "score": 1,
                      "created_utc": 1751427294.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n0wle9w",
                  "author": "peppruss",
                  "body": "This morning, my Best Buy had a mountain of them. In the weeks prior, there was no stock.",
                  "score": 1,
                  "created_utc": 1751441981.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0ufo29",
          "author": "Spideroctopus",
          "body": "Now people know how I feel about the 2 last Zelda's",
          "score": 48,
          "created_utc": 1751410217.0,
          "replies": []
        },
        {
          "id": "n0unphk",
          "author": "None",
          "body": "People on Reddit. Just like people on Reddit went on and on about the price when it was obvious it would sell at any price.",
          "score": 38,
          "created_utc": 1751412874.0,
          "replies": [
            {
              "id": "n0uxqx5",
              "author": "VinhoVerde21",
              "body": "Complaining about the price isn’t the same as saying it won’t sell well. The majority of people were complaining more about pushing games to the 80 dollar/euro price tag anyway (which, again, isn’t the same as saying 80€ games won’t sell well).",
              "score": 20,
              "created_utc": 1751416375.0,
              "replies": [
                {
                  "id": "n0vvnpa",
                  "author": "MittenstheGlove",
                  "body": "I fully expected it to sell. I was just disappointed that it did. $80 digital and $90-$100 physical is actually insane.\n\n4 game carts and you paid for a whole switch 2, lol.",
                  "score": 8,
                  "created_utc": 1751428830.0,
                  "replies": [
                    {
                      "id": "n0wm2zp",
                      "author": "JamesHeckfield",
                      "body": "A video game is a major product that takes millions of man hours to make. \n\nI paid $60 for BOTW at launch and put in over 200 hours (which I loved every minute of).\n\nPeople literally pour years of their life into makes these immense video games… and then people complain $100 is insane. \n\nA family of four can easily spend more than that on dinner and a movie.\n\nThat same family of four can enjoy, say, Mario Kart World every Friday night for family game night.  ",
                      "score": -6,
                      "created_utc": 1751442393.0,
                      "replies": [
                        {
                          "id": "n0xw3hs",
                          "author": "VinhoVerde21",
                          "body": "Let’s look at Expedition 33. It’s a big game, with a wonderful story, music, visual design, pretty much everything, they knocked out of the park. \n\nIts launch price was 50 euro, physical and digital. Do you really believe Mario Kart World took more effort to make to the point of having to be near double the price? It didn’t even take more effort, full stop.\n\nHell, this isn’t even to say MKW is a bad game, it’s not at all. But to pretend that Nintendo needs to charge 80-90 bucks to keep paying their devs is a bit of a joke.\n\nCompanies raise prices to maintain or increase profit margins, that’s it. If Nintendo could raise their prices to 100 next year, their fans would still pretend it was done to pay the devs, instead of going to the execs pockets.",
                          "score": 7,
                          "created_utc": 1751463582.0,
                          "replies": [
                            {
                              "id": "n0y2yze",
                              "author": "JamesHeckfield",
                              "body": "All of what you say is technically true \n\nI just don’t care.  Nintendo can charge what they want.\n\nYour example game is totally irrelevant. There is no objective standard by which a game should be priced.",
                              "score": -1,
                              "created_utc": 1751465701.0,
                              "replies": [
                                {
                                  "id": "n0y3qvo",
                                  "author": "VinhoVerde21",
                                  "body": "If you don’t care, just say it. I wouldn’t have any objection if you had just said that from the beginning.\n\nJust don’t come with the bullshit “oh, actually they’re charging that much because it takes a lot of talent to make the games” when everyone knows you don’t need to charge that much to reward talent and make a profit, and that extra money doesn’t go to the devs.",
                                  "score": 3,
                                  "created_utc": 1751465928.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "n0wrdjk",
                          "author": "THExPILLOx",
                          "body": "I can't take my wife to the movies for less than $50 without sacrificing on the movie experience. \n\n\nA dinner at even a fast casual sit down restaurant for two is $50 once you include drinks and a tip. Both examples are for two people, let alone a family of four. \n\n\nHell, to watch Hulu without being psychologically attacked and manipulated every 4 minutes, costs $20 a month.\n\n\nI'm not out here happy and ecstatic to pay $80 for a video game, but by the time I got the full game from gearbox, I spent over $120 on borderlands 2 a decade ago when it came out. Blackops 2 was $70+ to get the game and the black ops 1 zombie maps. ",
                          "score": 5,
                          "created_utc": 1751445552.0,
                          "replies": []
                        },
                        {
                          "id": "n0xfp6m",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 1,
                          "created_utc": 1751457792.0,
                          "replies": [
                            {
                              "id": "n0yd8bg",
                              "author": "Sourpowerpete",
                              "body": "   I think the co-issue that makes the higher prices harder to swallow is that quality isn't strictly increasing with price. With so many games trying to offer more without considering the quality of what's added, lots of gamers including myself are falling back to more refined packages. Take Monster Hunter Wilds: I didn't  buy it because with the demo, the writing was on the wall and I knew it wasn't going to run on PC. Instead I went and tried Monster Hunter Generations Ultimate for the first time, costing me roughly $15 for the biggest and debatebly best MH game ever made.\n\n\n   Whether or not it's \"fair\" to compare older more updated titles to newer experiences is an important debate to have, but when considering what matters most to consumers, I dont think it ultimately matters. Games used to run better, still looked good if not better (Iceborne looks better than Wilds, sue me), were cheaper at release and are faaaaar cheaper now, often were more experimental and/or fun, and we have a huge stockpile of untouched games to choose from. If triple A were pushing boundaries *in a way that truly benefits the consumer more than it hurts them*, then asking more money for it is completely fair. However, I don't think that's the scenario we find ourselves in, and I think it's a wound that triple A publishers and studios inflicted to themselves.",
                              "score": 4,
                              "created_utc": 1751468659.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "n0wtz0e",
                          "author": "f4r1s2",
                          "body": "But for some people in some countries, 100$ is a lot and Nintendo doesn't do regional pricing.\n\nEdit, and it's not only Nintendo, other major companies like WB, EA, Rockstar, 2K also dont",
                          "score": 1,
                          "created_utc": 1751447086.0,
                          "replies": [
                            {
                              "id": "n0wvpdy",
                              "author": "JamesHeckfield",
                              "body": "That’s their problem! ",
                              "score": -2,
                              "created_utc": 1751448115.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n0vrbrz",
                  "author": "Vritla",
                  "body": "Fact are most casual players dont mind dropping 80 bucks every other month for a game, this is pretty much a \"hardcore\" gamer issue.",
                  "score": 3,
                  "created_utc": 1751427040.0,
                  "replies": [
                    {
                      "id": "n0vxmp4",
                      "author": "TaiyoT",
                      "body": "Most of my casual gamer friends buy two games a year.\n\nI have one who literally bought the first switch for Animal Crossing and has only bought Stardew Valley since.",
                      "score": 11,
                      "created_utc": 1751429679.0,
                      "replies": []
                    },
                    {
                      "id": "n0w2jgv",
                      "author": "moonshineTheleocat",
                      "body": "What is a \"casual gamer\" in this context?\n\nPersonally, I am willing to drop 80 only if the quality of the game justified it. And most games cannot even justify a 60 dollar price tag. And that's not me looking at the graphics.",
                      "score": 3,
                      "created_utc": 1751431921.0,
                      "replies": []
                    },
                    {
                      "id": "n0wkfrf",
                      "author": "brianvan",
                      "body": "Some people are spending $100 a week on Pokemon Go. Console carts with no “feed the meter” mechanics deliver incredible value when you compare that to other mainstream game spending options",
                      "score": 1,
                      "created_utc": 1751441414.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n10txoq",
                  "author": "None",
                  "body": "Yeah fair point mate. I see that complaint a lot as well and everything is stupid expensive now but I find it interesting that games, adjusted for inflation, were more expensive 20-30 years ago.",
                  "score": 1,
                  "created_utc": 1751494489.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0uvggj",
          "author": "MassiveBoner911_3",
          "body": "Thats because Reddit hates fucking everything. Its all doom and gloom here.",
          "score": 36,
          "created_utc": 1751415544.0,
          "replies": []
        },
        {
          "id": "n0uli1m",
          "author": "kzlife76",
          "body": "I had a similar thought. All I've heard is how mediocre it is. How bad the screen is. How they didn't do anything to fix the sticks. It sounds like this would spell utter doom.",
          "score": 12,
          "created_utc": 1751412145.0,
          "replies": [
            {
              "id": "n0uogte",
              "author": "Key_Amazed",
              "body": "Because very very few people actually give a shit about the screen stuff that nobody would've even noticed if DF (who do fantastic work) didn't do extensive testing that 99% of people would never think to do. In practice the screen issues don't affect gaming at all unless you're the top 1% of gamers who do native 4k 240hz gaming.\n\nIt's a Switch but more powerful. It needs more games, but that's literally how every console launch goes. If you buy in at the start you are the guinea pig.\n\nIts success was guaranteed.",
              "score": 40,
              "created_utc": 1751413127.0,
              "replies": [
                {
                  "id": "n0utwfe",
                  "author": "Twombls",
                  "body": "Plus the people that actually care are probably playing it docked anyway.",
                  "score": 19,
                  "created_utc": 1751414990.0,
                  "replies": []
                },
                {
                  "id": "n0uqjuz",
                  "author": "alman12345",
                  "body": "Plenty of people would've noticed it regardless of Digital Foundry, it's nearly as slow as a $50 Amazon projector. Ghosting on VA panels that respond over 3 times quicker than the Switch 2 display is painfully obvious, there's no chance that many people wouldn't notice such extreme ghosting on the Switch 2 even if the games only ran at 30 frames per second and even less that they wouldn't give a shit about how awful it looks. \n\nThe success was guaranteed because there are enough uninitiated gamers who don't care because they don't know any different, they probably play on mediocre $100 Fire TVs that respond similarly as slowly anyways.",
                  "score": -31,
                  "created_utc": 1751413825.0,
                  "replies": [
                    {
                      "id": "n0v0bnr",
                      "author": "soggybiscuit93",
                      "body": ">uninitiated gamers who don't care.\n\nSounds like they're willing to overlook or not care about a hardware component being subpar because they just wanna play games.\n\nThat sounds like a gamer to me. Hardware enthusiasts are a different hobby.",
                      "score": 20,
                      "created_utc": 1751417294.0,
                      "replies": [
                        {
                          "id": "n0v12c5",
                          "author": "alman12345",
                          "body": "Subpar is generous, a handheld screen that’s slower than most TVs is utterly pathetic and blatantly obvious. It’s like calling the Ford Pinto a subpar car.",
                          "score": -12,
                          "created_utc": 1751417558.0,
                          "replies": [
                            {
                              "id": "n0v2635",
                              "author": "soggybiscuit93",
                              "body": "I didn't hear a single person, IRL or on Reddit, talk about the screen until *after* Youtubers started covering it a few weeks after launch. I don't remember any launch day reviews complaining about it either. Can't be *that* bad\n\nIt's not like the OG switch screen was any good either and it didn't stop me from enjoying it.",
                              "score": 12,
                              "created_utc": 1751417949.0,
                              "replies": [
                                {
                                  "id": "n0v323q",
                                  "author": "alman12345",
                                  "body": "It’s 33ms, 50% worse than the original switch that could only output 1/2 the frames. And I don’t personally care whether you’ve seen it or heard it, nor does anyone else, [it has been brought up](https://www.reddit.com/r/NintendoSwitch/s/9fTshNEZ2H) well before the most recent onslaught of criticism. [Multiple times](https://www.reddit.com/r/NintendoSwitch/s/pAtbwTNwb9), even. If your eyes are so poor that you can’t see the ghosting then that’s fine, many prefer an OLED explicitly because their eyes work that well though.",
                                  "score": -10,
                                  "created_utc": 1751418267.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n0uvagz",
                      "author": "nugymmer",
                      "body": "My oh my...WTF did Nintendo cheap out on the display?\n\nMight have to wait for the OLED version. That'll take another couple years.",
                      "score": 2,
                      "created_utc": 1751415485.0,
                      "replies": [
                        {
                          "id": "n0v08tg",
                          "author": "HeftyArgument",
                          "body": "120hz vrr oled, couple of years, sure buddy.",
                          "score": 6,
                          "created_utc": 1751417266.0,
                          "replies": [
                            {
                              "id": "n0v0kf3",
                              "author": "alman12345",
                              "body": "There’s one in the G14 already, keep up",
                              "score": -4,
                              "created_utc": 1751417382.0,
                              "replies": [
                                {
                                  "id": "n0v0q0h",
                                  "author": "HeftyArgument",
                                  "body": "yes, at what cost?",
                                  "score": 1,
                                  "created_utc": 1751417436.0,
                                  "replies": [
                                    {
                                      "id": "n0v0ven",
                                      "author": "alman12345",
                                      "body": "We talking cost at Nintendos scale or ASUS’? Also, are you at all familiar with how the cost of OLED production scales with screen size? I’m gonna guess no.",
                                      "score": -2,
                                      "created_utc": 1751417489.0,
                                      "replies": [
                                        {
                                          "id": "n0v1bbn",
                                          "author": "HeftyArgument",
                                          "body": "look, if companies weren’t able to milk us for everything we had, everything in the market would be oled high refresh rate dream machines.\n\nnintendo is in the business of making money, and they will do so as much as they can. If noone else is going to sell you that solution for a good price, nintendo won’t be the first.",
                                          "score": 3,
                                          "created_utc": 1751417645.0,
                                          "replies": [
                                            {
                                              "id": "n0v28q3",
                                              "author": "alman12345",
                                              "body": "No one else is selling a DLSS capable handheld for $450, yet here Nintendo is offering just that. Nintendo has a very unique opportunity to blaze the trail once again with the first VRR handheld display, and they obviously have the demand to satisfy a very large order which will dramatically improve cost. If Nintendo follows their own model with the Switch 1 to the Switch OLED then the Switch 2 OLED has room to be a massive step up, VRR or not.\n\nAnd honestly, when it comes down to it, the VRR is less important to me than response times that don’t utterly suck eggs. Nintendo will be releasing some form of mid generation refresh to further capitalize on customer interest, which is the “milking” at play.",
                                              "score": -1,
                                              "created_utc": 1751417976.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "n0v1cci",
                          "author": "alman12345",
                          "body": "I definitely won’t be touching the LCD model in light of the response time news even if Prime 4 comes out before the OLED.",
                          "score": 1,
                          "created_utc": 1751417655.0,
                          "replies": []
                        },
                        {
                          "id": "n0v40pv",
                          "author": "Magma_Axis",
                          "body": "yep, that what i gonna do\n\nim weighting between Ps5 pro and Switch 2\n\nfor now seems Ps5 pro will win bcs we will get some absolutely amazing display games later this year",
                          "score": 0,
                          "created_utc": 1751418608.0,
                          "replies": []
                        },
                        {
                          "id": "n0uykwa",
                          "author": "ABotelho23",
                          "body": ">My oh my...WTF did Nintendo cheap out on the display?\n\nAbsolutely.\n\nAnd as shown, it doesn't fucking matter. Nintendo could release a turd with some buttons attached to it and people would buy it.",
                          "score": -7,
                          "created_utc": 1751416671.0,
                          "replies": [
                            {
                              "id": "n0wbzly",
                              "author": "Electricfire19",
                              "body": "> Nintendo could release a turd with some buttons attached to it and people would buy it.\n\nYet the Wii-U flopped spectacularly. GameCube didn’t do to well either. Neither did the 3DS for a while. Same with N64 later in its lifespan. And let’s not forget about the Virtual Boy.\n\nBut sure, people will totally buy anything with the Nintendo name on it. That’s the only reason this is selling well.",
                              "score": 2,
                              "created_utc": 1751436698.0,
                              "replies": [
                                {
                                  "id": "n12hins",
                                  "author": "ABotelho23",
                                  "body": "Nintendo since the Switch is a different beast.",
                                  "score": 0,
                                  "created_utc": 1751515021.0,
                                  "replies": [
                                    {
                                      "id": "n12hzmv",
                                      "author": "Electricfire19",
                                      "body": "Since the last console? So your theory is that the Nintendo Switch 2 is only successful because “Nintendo could release a turd with some buttons attached to it and people would buy it,” and your evidence for that claim is that the last console also sold well. Absolutely brilliant.",
                                      "score": 0,
                                      "created_utc": 1751515220.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0uyazr",
              "author": "ABotelho23",
              "body": "Both things can be correct.",
              "score": 3,
              "created_utc": 1751416573.0,
              "replies": []
            },
            {
              "id": "n0up4vk",
              "author": "hitmonng",
              "body": "I'm jus happy that I can finally play SF6 on the go 😄",
              "score": 3,
              "created_utc": 1751413348.0,
              "replies": []
            },
            {
              "id": "n0zoyge",
              "author": "baldeagle1991",
              "body": "Tbh going from memory, didn't digital foundry compared the screen against desktop comparisons.\n\nIn relation to other handheld the screen is fine and allows for a longer lasting battery",
              "score": 1,
              "created_utc": 1751482225.0,
              "replies": []
            },
            {
              "id": "n0vb6io",
              "author": "subpar-life-attempt",
              "body": "Ya gotta remember that Nintendo is the only console that sells to regular people and not gamers.\n\nMost of these units get bought, played with for about a month and then sit until another month goes by etc.\n\nUnless the family has kids, then that shit gets wore out",
              "score": -1,
              "created_utc": 1751421130.0,
              "replies": [
                {
                  "id": "n0vwqjw",
                  "author": "MittenstheGlove",
                  "body": "You are probably onto something here. My switch has sat untouched for the better part of a year.",
                  "score": 1,
                  "created_utc": 1751429291.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0uz1do",
          "author": "QuadH",
          "body": "With minimal launch titles as well! Like one new game and a few upgraded games. \n\nThey know their market. People just wanted and can afford an incremental upgrade after 7 years.",
          "score": 6,
          "created_utc": 1751416835.0,
          "replies": [
            {
              "id": "n0vawv0",
              "author": "subpar-life-attempt",
              "body": "That family dynamic. \n\nWhat scares me is that this system took years to develop but doesn't do anything new.\n\nIts just a more defined and powerful switch 1. Nothing against that, it's just jarring since Nintendo loves to push the boundaries on innovation.",
              "score": -4,
              "created_utc": 1751421038.0,
              "replies": [
                {
                  "id": "n0vwttj",
                  "author": "MittenstheGlove",
                  "body": "That’s how pretty much any consoles upgrades work. Nintendo found its niche.",
                  "score": 8,
                  "created_utc": 1751429331.0,
                  "replies": [
                    {
                      "id": "n0zo3a0",
                      "author": "subpar-life-attempt",
                      "body": "That's how other companies' consoles worked.\n\nLook at the GameCube, the Wii, the Wii u, the 3ds, the virtual boy.\n\nEvery other console was more than just an upgrade. It was a risk taker.\n\nThe switch 2 isn't. That's not a bad thing....just a clearer picture of the new Nintendo.",
                      "score": 0,
                      "created_utc": 1751481967.0,
                      "replies": [
                        {
                          "id": "n0zupaa",
                          "author": "MittenstheGlove",
                          "body": "Nintendo has found its niche and can be upgraded accordingly. The niche is a hybrid system. Nintendo doesn’t need to take anymore risk. Just make a hybrid console that suits their needs.\n\nTV standard is currently at 4K and 8K doesn’t seem to be the new screen standard for at least another few years.",
                          "score": 1,
                          "created_utc": 1751483948.0,
                          "replies": [
                            {
                              "id": "n0zzzrj",
                              "author": "subpar-life-attempt",
                              "body": "I mean yeah that's clear and it works. Which is awesome.\n\nI just don't want them to go down the road of Xbox and PS where it's just graphical iterations.\n\nHell the switch 2 is cool but the c development cycle was crazy long for something that isn't innovative.",
                              "score": 1,
                              "created_utc": 1751485559.0,
                              "replies": [
                                {
                                  "id": "n1051uy",
                                  "author": "MittenstheGlove",
                                  "body": "I don’t know what their next iteration will be but they basically achieved what they needed. They will probably try to make a device with wireless connectivity to the TV similar to the Wii U game pad.\n\nI don’t think the development cycle was for anything but to maximize profitability of the switch.",
                                  "score": 1,
                                  "created_utc": 1751487055.0,
                                  "replies": [
                                    {
                                      "id": "n1061wh",
                                      "author": "subpar-life-attempt",
                                      "body": "That could be true. They do have a controlled market essentially so no need to rush out a new console.",
                                      "score": 2,
                                      "created_utc": 1751487351.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n0vlbfz",
                  "author": "QuadH",
                  "body": "Gotta say mouse mode has potential. \n\nBut agree on the rest. Nothing new really. Just bigger and better.",
                  "score": 2,
                  "created_utc": 1751424710.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n12z46p",
          "author": "CeldonShooper",
          "body": "A few years ago allegedly all consoles were supposed to be \"the last\" because we would all be cloud gaming now. Until everyone realized how annoying even small latencies and connection drops can be in games. It totally kills immersion.",
          "score": 1,
          "created_utc": 1751523407.0,
          "replies": []
        },
        {
          "id": "n0v44q9",
          "author": "Small_Editor_3693",
          "body": "I walked into a Walmart the other day and there were 3 on the shelf. Not even selling out any more. They’re obviously doomed. \n\nI did buy 2 though. One for me and one for my brother",
          "score": 0,
          "created_utc": 1751418648.0,
          "replies": []
        },
        {
          "id": "n0vagce",
          "author": "subpar-life-attempt",
          "body": "Who the hell would ever say that?\n\nNintendo is the top tier of capitalism in video games right now. Keeps you in their ecosystem. Mtx in many games, increased prices for games. Quality of console still leagues behind some current gen products.\n\nThey make more money than ever because their games are locked to the system.  \n\nThey also sue anyone who even wants to try and save their old games from disappearing.",
          "score": 0,
          "created_utc": 1751420882.0,
          "replies": []
        },
        {
          "id": "n0uewuo",
          "author": "NautiMain1217",
          "body": "They could make more money but are allergic.",
          "score": -23,
          "created_utc": 1751409966.0,
          "replies": [
            {
              "id": "n0uj5ma",
              "author": "Corinite",
              "body": "They're the richest company in Japan, I think they have a handle on it",
              "score": 32,
              "created_utc": 1751411371.0,
              "replies": [
                {
                  "id": "n0unnhd",
                  "author": "Molwar",
                  "body": "They could have failed the Wii U 3 times and still have money in the banks. Now the switch's store/software sale is pretty much printing them money.",
                  "score": 10,
                  "created_utc": 1751412855.0,
                  "replies": []
                },
                {
                  "id": "n0ve7f3",
                  "author": "Smelldicks",
                  "body": "Not that it changes the point all that much but they’re actually like no 5 or something",
                  "score": -1,
                  "created_utc": 1751422173.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0ulvju",
              "author": "ThatsARatHat",
              "body": "Sometimes it’s not just about MORE money.",
              "score": 8,
              "created_utc": 1751412268.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0uf363",
          "author": "FightOnForUsc",
          "body": "I would love for Nintendo to make their games available for Mac and iPad they can charge their $60 or $70 even. But to do it on a bigger screen. Faster device. It would be great.",
          "score": -21,
          "created_utc": 1751410024.0,
          "replies": [
            {
              "id": "n0uiswm",
              "author": "ThisIsNotACryForHelp",
              "body": "Nintendo makes their money on game sales, so they need people to buy their hardware, and they incentivize that with their exclusives.\n\nSo, for example, a Mac user might buy a Switch just to play Mario Kart. But once they have it, maybe they'll buy a Kirby game, some third party stuff, indies, etc. If they do, Nintendo makes money on all of those sales.\n\nHowever, if Mario Kart were also available on Mac, that user never would have bought a Switch, and they never would have made those purchases. So, Nintendo would have lost money on that customer.\n\nAnd that's why they don't put their games on other platforms.",
              "score": 23,
              "created_utc": 1751411252.0,
              "replies": [
                {
                  "id": "n0uoi6n",
                  "author": "ChrisFromIT",
                  "body": ">So, for example, a Mac user might buy a Switch just to play Mario Kart. But once they have it, maybe they'll buy a Kirby game, some third party stuff, indies, etc. If they do, Nintendo makes money on all of those sales.\n\nA lot of people forget this. To develop on Xbox, Playstation or any Nintendo platform it requires licensing from the hardware maker. Nintendo also makes a bit more money by providing the cartridge too.\n\nSo, any game sold for the Nintendo platforms is money for Nintendo. Not to mention, also amy online services that they sell.",
                  "score": 7,
                  "created_utc": 1751413140.0,
                  "replies": [
                    {
                      "id": "n0uoqt8",
                      "author": "ThisIsNotACryForHelp",
                      "body": "That's why Valve doesn't really have to make games anymore - because hosting Steam is so profitable on its own.",
                      "score": 8,
                      "created_utc": 1751413219.0,
                      "replies": [
                        {
                          "id": "n0uozl3",
                          "author": "ChrisFromIT",
                          "body": "And why Apple really fought to keep the iOS App store so closed down.",
                          "score": 8,
                          "created_utc": 1751413300.0,
                          "replies": [
                            {
                              "id": "n0uslsc",
                              "author": "iamflame",
                              "body": "Losing 30% cut has in the past led apple to do plenty more than just prevent third-party app loading too. \nUnless you are Netflix your app cannot include alternative payment processors, links to your main sales page, reference to the apple-less price sans 30%, etc.",
                              "score": 5,
                              "created_utc": 1751414533.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n0unxgf",
                  "author": "FightOnForUsc",
                  "body": "I mean I guess. I’m still not sure that the 50 million sales they do of Mario wouldn’t be matched by 50 million+ sales on Mac and iPad. And they could still sell first party devices as well.",
                  "score": -8,
                  "created_utc": 1751412948.0,
                  "replies": [
                    {
                      "id": "n0uof2g",
                      "author": "ThisIsNotACryForHelp",
                      "body": "Individual game sales on other platforms would increase short-term profit for those titles. However, if Nintendo games were available on Steam, far fewer people would buy Switches, reducing long-term profit.",
                      "score": 11,
                      "created_utc": 1751413111.0,
                      "replies": [
                        {
                          "id": "n0up15y",
                          "author": "FightOnForUsc",
                          "body": "But Nintendo doesn’t make money (really) selling hardware. Maybe a tiny bit. It seems they’d mostly lose on control. And as you said maybe people with switches buy games they wouldn’t if they hadn’t already put the upfront cost into the device",
                          "score": -8,
                          "created_utc": 1751413314.0,
                          "replies": [
                            {
                              "id": "n0upgw0",
                              "author": "ThisIsNotACryForHelp",
                              "body": "They do sell their consoles at a profit, according to interviews. But they make most of their money on game sales after the fact. When anyone buys anything for the Switch (be it a physical game or a digital game via the eShop) Nintendo makes money.\n\nIf people don't own Switches, they don't buy their 3rd party games through Nintendo. That's why they would lose money.",
                              "score": 6,
                              "created_utc": 1751413460.0,
                              "replies": [
                                {
                                  "id": "n0upqiw",
                                  "author": "FightOnForUsc",
                                  "body": "Hmm, yea. I guess that makes sense. It’s frustrating because it would be such a better experience. 120hz OLED display. More powerful. Also works for other use cases besides just gaming. Maybe when Apple is forced to allow other app stores Nintendo will create their own and charge but I doubt it.",
                                  "score": -1,
                                  "created_utc": 1751413549.0,
                                  "replies": [
                                    {
                                      "id": "n0uq887",
                                      "author": "ThisIsNotACryForHelp",
                                      "body": "The Switch 2 _is_ 120hz! And it might not be OLED, but the screen supports VRR and HDR. It honestly looks really great.",
                                      "score": 7,
                                      "created_utc": 1751413715.0,
                                      "replies": [
                                        {
                                          "id": "n0uqclc",
                                          "author": "FightOnForUsc",
                                          "body": "It’s barely HDR. Max brightness 400nits. iPad Pro max brightness is 4 times that. And is also VRR.",
                                          "score": 1,
                                          "created_utc": 1751413757.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "n0v0tws",
                              "author": "soggybiscuit93",
                              "body": "Nintendo is also getting a 30% cut of *every* game sold on the Switch. Selling their 1st party games on Mac/iOS would not only destroy their console, and that 30% cut on every game sold on it, but it would also require them to *pay Apple* a 30% of their game sale revenue.",
                              "score": 3,
                              "created_utc": 1751417474.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0utii9",
              "author": "sacktheory",
              "body": "that’s what the dock is for, you can plug it into a gigantic screen. but i see what you’re saying. but that’s part of the reason why nintendo consoles sell so well, if you want their games you need their console",
              "score": 4,
              "created_utc": 1751414854.0,
              "replies": [
                {
                  "id": "n0uu0s8",
                  "author": "FightOnForUsc",
                  "body": "Still slower. Still a worse screen when traveling. Still yet another device when I already have my laptop. The dock is also large, I only need a cable with my tablet or laptop. The physical device is better (it’s also more expensive) but I already own it too",
                  "score": -1,
                  "created_utc": 1751415033.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0uluxe",
              "author": "TheGreatBenjie",
              "body": "\"iPad\"\n\nlma-fucking-o",
              "score": 7,
              "created_utc": 1751412263.0,
              "replies": [
                {
                  "id": "n0upbpn",
                  "author": "FightOnForUsc",
                  "body": "You realize iPads with m chips are as fast as the switch 2 is in processing performance. And they’ll be much faster in a couple years. While the next Nintendo device is probably 6+ years away. I get why they won’t do it, but an iPad with a controller would be awesome for so many Nintendo games",
                  "score": -1,
                  "created_utc": 1751413413.0,
                  "replies": [
                    {
                      "id": "n0upplh",
                      "author": "TheGreatBenjie",
                      "body": "You realize fucking nobody is going to look at the iPad as a legitimate gaming device? lmao",
                      "score": 5,
                      "created_utc": 1751413541.0,
                      "replies": [
                        {
                          "id": "n0upwgk",
                          "author": "FightOnForUsc",
                          "body": "It’s faster than a switch 2. Is it going to beat a PS5 or Xbox series X? Of course not, but it doesn’t need to. I’m talking about Nintendo games that rarely are that hardware intensive.",
                          "score": -2,
                          "created_utc": 1751413605.0,
                          "replies": [
                            {
                              "id": "n0uqbi9",
                              "author": "TheGreatBenjie",
                              "body": "And I'm telling you it's funny that you think it's even a possibility.",
                              "score": 5,
                              "created_utc": 1751413747.0,
                              "replies": [
                                {
                                  "id": "n0uqhal",
                                  "author": "FightOnForUsc",
                                  "body": "From a hardware standpoint it is. From a financial point of few, yea Nintendo isn’t going to do it. Show me what specs the switch beats an m4 on. Let alone an m4 pro or m4 max.",
                                  "score": -2,
                                  "created_utc": 1751413801.0,
                                  "replies": [
                                    {
                                      "id": "n0uqmu4",
                                      "author": "TheGreatBenjie",
                                      "body": "Bro you're so stuck on power as if that matters. The iPad will never be seen as a legit gaming device, full stop.",
                                      "score": 5,
                                      "created_utc": 1751413854.0,
                                      "replies": [
                                        {
                                          "id": "n0ur1ur",
                                          "author": "FightOnForUsc",
                                          "body": "What it’s seen as has nothing to do with “possibility”. You’re saying it’s not a possibility because it isn’t viewed that way. Ok fine. But that’s a perception issue and not an issue of hardware or performance. There’s more money and time spent “gaming” on phones than any of the consoles. It’s not really a stretch (opinion). But sure, if the only issue is it’s not viewed as a legit gaming device. Then Nintendo releasing 5-10 huge games for iPad and Mac would completely change everyone’s mind about that. And then boom, suddenly it is a legit gaming device",
                                          "score": -1,
                                          "created_utc": 1751413995.0,
                                          "replies": [
                                            {
                                              "id": "n0urc7n",
                                              "author": "TheGreatBenjie",
                                              "body": "Take shitty gacha games out of the equation and see if that claim still works lmao\n\nIt's not gonna happen, no matter how much you cope over it.",
                                              "score": 3,
                                              "created_utc": 1751414094.0,
                                              "replies": [
                                                {
                                                  "id": "n0urkif",
                                                  "author": "FightOnForUsc",
                                                  "body": "I know it won’t happen. I just said I wish it could. My only issue with what you said was that you can’t game on an iPad when it is more powerful than switch 2.\n\nI know it won’t happen. I wish it would but it won’t that’s fine, hence why I bought a switch 2. But I’d much rather be playing on a more powerful device with a bigger better screen",
                                                  "score": 0,
                                                  "created_utc": 1751414172.0,
                                                  "replies": [
                                                    {
                                                      "id": "n0uskz1",
                                                      "author": "TheGreatBenjie",
                                                      "body": "I never said you can't game on the iPad. I said it's never going to be seen as a legitimate gaming device, which is still true.",
                                                      "score": 2,
                                                      "created_utc": 1751414525.0,
                                                      "replies": [
                                                        {
                                                          "id": "n0usspz",
                                                          "author": "FightOnForUsc",
                                                          "body": "That presupposes that would still be true if Nintendo released all their major games for it. It also implies that even matters? Like ok, it’s not “legitimate”. Oh no, so sad, I’ll cry as I go play Mario on my Mac because it’s not a real gaming device. Who cares?!",
                                                          "score": 0,
                                                          "created_utc": 1751414601.0,
                                                          "replies": [
                                                            {
                                                              "id": "n0ut2ja",
                                                              "author": "TheGreatBenjie",
                                                              "body": "Lol okay bro",
                                                              "score": 1,
                                                              "created_utc": 1751414697.0,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "n0v0s0l",
                                          "author": "drossvirex",
                                          "body": "I dunno about that. Some big titles are on Ipad. Games you wouldn't think are there.",
                                          "score": -2,
                                          "created_utc": 1751417456.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n0unql8",
                  "author": "FightOnForUsc",
                  "body": "What?",
                  "score": -1,
                  "created_utc": 1751412884.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0uh4ke",
          "author": "bonesnaps",
          "body": "They can enjoy their $120 CAD games and paying for internet twice then, all while watching Nintendo become even more predatory in the process.\n\n\nI shall enjoy popcorn from my pc setup.",
          "score": -13,
          "created_utc": 1751410699.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0uqkss",
      "author": "crimxxx",
      "body": "I’ll give Nintendo this they did a good job with console availability, for the most part popular console launches are met with lots of demand and little stock for months or years. Nintendo stock piled there consoles and actually worked with retailers to prioritize in person sales rather than digital only aka scalper land. Just my observation of you were really trying for a switch they’ve been getting refreshes often and you could get one if you put in enough effort.\n\nSo overall I think purely from an availability standpoint point good job Nintendo.",
      "score": 48,
      "created_utc": 1751413834.0,
      "replies": [
        {
          "id": "n13d1hm",
          "author": "Smurfsville",
          "body": "Can't get a switch in Japan",
          "score": 1,
          "created_utc": 1751531309.0,
          "replies": []
        },
        {
          "id": "n0vqy0s",
          "author": "SupremeDictatorPaul",
          "body": "COVID forced them to push their timeline back a year or two, which ended up making sorting out design and supply a lot easier. They basically knew everything that would go in it years in advance, and could make sure there were sufficient supplies of everything beforehand.",
          "score": -1,
          "created_utc": 1751426887.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0umnxy",
      "author": "red_the_room",
      "body": "Reddit assured me no one was going to buy it. Weird.",
      "score": 133,
      "created_utc": 1751412527.0,
      "replies": [
        {
          "id": "n0us27y",
          "author": "CptJacksp",
          "body": "REDDIT WAS WRONG?!??",
          "score": 57,
          "created_utc": 1751414343.0,
          "replies": [
            {
              "id": "n0uu12z",
              "author": "red_the_room",
              "body": "I too am shocked.",
              "score": 12,
              "created_utc": 1751415036.0,
              "replies": [
                {
                  "id": "n0v0pgk",
                  "author": "Nobanob",
                  "body": "But not that shocked",
                  "score": 6,
                  "created_utc": 1751417430.0,
                  "replies": []
                },
                {
                  "id": "n0uzjz9",
                  "author": "Nobanob",
                  "body": "But not that shocked",
                  "score": 0,
                  "created_utc": 1751417023.0,
                  "replies": [
                    {
                      "id": "n0vixik",
                      "author": "The_BoogieWoogie",
                      "body": "r/dementia",
                      "score": 1,
                      "created_utc": 1751423840.0,
                      "replies": [
                        {
                          "id": "n0vmmve",
                          "author": "Nobanob",
                          "body": "![gif](giphy|AaQYP9zh24UFi)",
                          "score": 1,
                          "created_utc": 1751425208.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0vly0w",
              "author": "doyouevenfly",
              "body": "Could this thread also be wrong?",
              "score": 4,
              "created_utc": 1751424945.0,
              "replies": [
                {
                  "id": "n0w318t",
                  "author": "Mrjasonbucy",
                  "body": "Nah not possible we’re in it 😏",
                  "score": 3,
                  "created_utc": 1751432153.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0v4tjz",
          "author": "Super-Ad1976",
          "body": "There are still people on here calling it failure.",
          "score": 13,
          "created_utc": 1751418893.0,
          "replies": []
        },
        {
          "id": "n0ya3bw",
          "author": "Chezni19",
          "body": "reddit prophet is as good as reddit detective",
          "score": 2,
          "created_utc": 1751467765.0,
          "replies": []
        },
        {
          "id": "n0vvf2l",
          "author": "hungryhusky",
          "body": "They'll figure out what to nitpick next after the price and the screen.",
          "score": 4,
          "created_utc": 1751428729.0,
          "replies": []
        },
        {
          "id": "n0zcrr6",
          "author": "celmate",
          "body": "Honestly, it's still way too soon to tell. Every console sells out all their stock at launch, Switch 2 had a lot more stock than is typical. It was hard to get a Switch 1 over a year after release.\n\nNot saying it won't be popular mind you, but this particular data point (biggest launch everrrrr!) doesn't mean too much in terms of its actual success.",
          "score": -1,
          "created_utc": 1751478642.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0v0syp",
      "author": "Momo--Sama",
      "body": "As evidenced by the PS5, you don’t need some killer feature or even 10/10 masterpiece launch titles to have a great launch if you have hurricane force momentum going in.",
      "score": 9,
      "created_utc": 1751417465.0,
      "replies": [
        {
          "id": "n12opri",
          "author": "Beginning_Book_2382",
          "body": "Exactly, if even 2% of the Switch 1 owners try to get it launch day (which they did), it'll be the biggest console launch ever\n\nIt's not a quality game, it's a momentum game and a numbers game",
          "score": 1,
          "created_utc": 1751518207.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0v5lcq",
      "author": "droid6",
      "body": "Nvida shield 2 please",
      "score": 12,
      "created_utc": 1751419167.0,
      "replies": [
        {
          "id": "n0wn8s0",
          "author": "mineer4",
          "body": "My dream, and the main reason I wanted a switch 2 to release haha ",
          "score": 1,
          "created_utc": 1751443083.0,
          "replies": [
            {
              "id": "n0y592y",
              "author": "Breal3030",
              "body": "What's the connection between the switch 2 and Nvidia shield? Would love an updated shield as well",
              "score": 2,
              "created_utc": 1751466369.0,
              "replies": [
                {
                  "id": "n0y7pps",
                  "author": "mineer4",
                  "body": "Nvidia released a new shield in 2017 (switch launch) and 2019 (switch revision launch), both using the same processor as the switch of that year. So the general thought (and hope) is they could release a new one now with the switch 2 processor!",
                  "score": 2,
                  "created_utc": 1751467086.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n0v204u",
      "author": "Delra12",
      "body": "Sony is definitely going to make the PS6 $700 bucks",
      "score": 10,
      "created_utc": 1751417890.0,
      "replies": [
        {
          "id": "n0vfi9z",
          "author": "summons72",
          "body": "Well yeah, their overpriced Ps5 pro already told them that much is okay.",
          "score": 10,
          "created_utc": 1751422627.0,
          "replies": []
        },
        {
          "id": "n11jcu1",
          "author": "NighTraiN7804",
          "body": "At that point put in a few hundred more dollars and build a decent PC. You get pretty much all of the PlayStation exclusives plus an access to a whole new world of games. I hate that consoles are slowly becoming major purchases.",
          "score": 0,
          "created_utc": 1751502798.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0ugmp1",
      "author": "t_thor",
      "body": "I guess I'm out of touch now because I really don't see why someone would insta-buy this console. And I love Nintendo games!",
      "score": 123,
      "created_utc": 1751410535.0,
      "replies": [
        {
          "id": "n0urp3t",
          "author": "owlandphoenix",
          "body": "I bought one on launch day as a potential cost savings purchase. It’s still sitting in the box underneath my television. I am terribly worried that by the time I did want one because there are games I actually wanna play, the US tariffs would go into effect and it would be far more expensive than the $500 I paid for it.",
          "score": 19,
          "created_utc": 1751414216.0,
          "replies": [
            {
              "id": "n0v8sq2",
              "author": "shadowCloudrift",
              "body": "Exactly why I bought it. I haven't even really played mine because to be honest there aren't any exclusive Switch 2 games that's a must play for me yet.",
              "score": 6,
              "created_utc": 1751420311.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0uhwat",
          "author": "tootsragu",
          "body": "Because you listen to people on Reddit too much.",
          "score": 115,
          "created_utc": 1751410950.0,
          "replies": [
            {
              "id": "n0um21x",
              "author": "t_thor",
              "body": "Nah it really just doesn't have much to offer me at the moment. The point is that my tastes are no longer in trend with the market.",
              "score": 38,
              "created_utc": 1751412328.0,
              "replies": [
                {
                  "id": "n0uow01",
                  "author": "OriolesMets",
                  "body": "I mean, they’re launching the staples in the first stretch. Mario Kart, Donkey Kong, Legend of Zelda, Metroid.",
                  "score": 14,
                  "created_utc": 1751413266.0,
                  "replies": [
                    {
                      "id": "n0vrx5r",
                      "author": "BackupTrailer",
                      "body": "Uhh. What Zelda. And Metroid Prime 4 still has no release date.",
                      "score": 11,
                      "created_utc": 1751427282.0,
                      "replies": [
                        {
                          "id": "n0wnsey",
                          "author": "JamesHeckfield",
                          "body": "The open world Zelda’s are available for the console with substantial upgrades. Those two games are immensely popular. They are games that still sell well.",
                          "score": -4,
                          "created_utc": 1751443402.0,
                          "replies": [
                            {
                              "id": "n0wvh9z",
                              "author": "BackupTrailer",
                              "body": "I’ve played BOTW on Switch 2 and Switch 1. “Substantial upgrade” isn’t appropriate, it’s not a meaningfully different experience. That might apply to Pokemon S&V, but that would be ignoring that the game ran very poorly on the intended hardware.\n\nBy this logic the Game Boy Advance launched with A Link to the Past - I just don’t really consider rereleases as full launch titles.",
                              "score": 5,
                              "created_utc": 1751447981.0,
                              "replies": [
                                {
                                  "id": "n0x89o6",
                                  "author": "JamesHeckfield",
                                  "body": "You may not see it that way, but Nintendo is purposefully promoting those games as system sellers.\n\nBecause they are. \n\nI’ve read many comments online of people expressing their desire to revisit Hyrule with dramatically improved frame rate and resolution (and improved graphics in general).\n\nLink to the past on gameboy? Take a moment and appreciate the fact that that was the first time you could play that game on a handheld.\n\nOn the go. Your criticism of my argument falls flat.\n\nI’m sure Skyrim moved a few Switch units as well, back in 2017.\n\nAnd I stand by my point that it is a substantial upgrade. Metroid Prime Remastered was also a substantial upgrade (it looks like a game that belongs on PS4) and that game made no major changes besides the visuals.",
                                  "score": 0,
                                  "created_utc": 1751454665.0,
                                  "replies": [
                                    {
                                      "id": "n1q7trf",
                                      "author": "BackupTrailer",
                                      "body": "“I mean, they’re launching the staples in the first stretch. Mario Kart, Legend of Zelda, Metroid.”\n\nBotW and TotK are Switch 1 titles running on better hardware, Metroid Prime 4 has no release date and ~3 min of gameplay footage a month after launch.\n\nYour argument fails regardless of how I see it.",
                                      "score": 1,
                                      "created_utc": 1751848686.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n0ury7p",
                      "author": "Jetavator",
                      "body": "there is a new legend of zelda coming?",
                      "score": 13,
                      "created_utc": 1751414304.0,
                      "replies": [
                        {
                          "id": "n0v2on6",
                          "author": "Worried_Pineapple823",
                          "body": "There’s a new Zelda Warriors coming to take place in the Totk past. So sorta.",
                          "score": -1,
                          "created_utc": 1751418134.0,
                          "replies": []
                        },
                        {
                          "id": "n0usrrc",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 0,
                          "created_utc": 1751414592.0,
                          "replies": [
                            {
                              "id": "n0uwcrk",
                              "author": "Devilsdance",
                              "body": "I doubt I'm the only person that doesn't count Hyrule Warriors games as Legend of Zelda.",
                              "score": 26,
                              "created_utc": 1751415869.0,
                              "replies": [
                                {
                                  "id": "n0ux8cf",
                                  "author": "alohadawg",
                                  "body": "Zelda-adjacent, agreed",
                                  "score": 10,
                                  "created_utc": 1751416188.0,
                                  "replies": [
                                    {
                                      "id": "n0uzb9r",
                                      "author": "Devilsdance",
                                      "body": "Kinda like calling \"Mario and Rabbids\" games Super Mario.",
                                      "score": 11,
                                      "created_utc": 1751416934.0,
                                      "replies": [
                                        {
                                          "id": "n0v5q5f",
                                          "author": "alohadawg",
                                          "body": "Double-agreed!\n\nSuper Smash Bros also would’ve been an excellent example",
                                          "score": 2,
                                          "created_utc": 1751419215.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "n0uz9v7",
                                  "author": "QuadH",
                                  "body": "It’s like saying Smash Brothers is a Mario game. \n\nKinda true but getouttahere",
                                  "score": 10,
                                  "created_utc": 1751416921.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "n0uvvqk",
                              "author": "Jetavator",
                              "body": "thanks",
                              "score": 2,
                              "created_utc": 1751415698.0,
                              "replies": []
                            },
                            {
                              "id": "n0uxrs1",
                              "author": "onerb2",
                              "body": "That's a wlmusou wolarriors game before it's a Zelda game.",
                              "score": 1,
                              "created_utc": 1751416383.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "n0wnkmc",
                          "author": "JamesHeckfield",
                          "body": "The launch of the new console is a good opportunity to promote the new versions of the old switch tentpole titles.\n\nTOTK is only two years old, and the new version offers a substantial upgrade. So, in absence of an actual NEW Zelda tile, this is a solid substitute.",
                          "score": 0,
                          "created_utc": 1751443274.0,
                          "replies": [
                            {
                              "id": "n0zfse9",
                              "author": "ModsRTryhards",
                              "body": "Ya and you are affirming his point. He's not paying hundreds of dollars for a console for an upgrade to a game he played recently. He'll wait till there's more stuff he wants it for. \n\nIt's only a \"substitute\" if you already own the switch 2. Honestly if I had one I would not buy zelda again even for just the $10.",
                              "score": 1,
                              "created_utc": 1751479504.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n0vflvc",
                      "author": "otaconucf",
                      "body": "Tears is new to me at least, I never got around to picking it up, I've had too much going on, and now it'll actually run better",
                      "score": 2,
                      "created_utc": 1751422662.0,
                      "replies": [
                        {
                          "id": "n0vhuo1",
                          "author": "OriolesMets",
                          "body": "It’s an awesome game. Hope you like it!",
                          "score": 1,
                          "created_utc": 1751423449.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0ujbgz",
              "author": "the1newman2",
              "body": "😂",
              "score": -2,
              "created_utc": 1751411426.0,
              "replies": []
            },
            {
              "id": "n0ul3iq",
              "author": "DespairTraveler",
              "body": "I don't even usually reddit gaming subs. Everybody in my gaming circles pass on switch 2 due to how Nintendo decided to price treat non-Japanese world. I seriously don't understand where they get all the those sells. Not even holiday season.",
              "score": -20,
              "created_utc": 1751412015.0,
              "replies": [
                {
                  "id": "n0ulrfn",
                  "author": "None",
                  "body": "[removed]",
                  "score": 1,
                  "created_utc": 1751412230.0,
                  "replies": [
                    {
                      "id": "n0umw0s",
                      "author": "DespairTraveler",
                      "body": "You realize the world doesn't end with US and US wages are MUCH bigger than everywhere else? Median monthly wage here in central European country is \\~2k$. Subtract rent, groceries, and 600$ doesn't sound too good of an investment, when they ask 60-80$ for games.",
                      "score": 0,
                      "created_utc": 1751412601.0,
                      "replies": [
                        {
                          "id": "n0uneoq",
                          "author": "None",
                          "body": "[removed]",
                          "score": 2,
                          "created_utc": 1751412774.0,
                          "replies": [
                            {
                              "id": "n0uogu3",
                              "author": "DespairTraveler",
                              "body": "It is expensive by European(and even more so by all the other countries) standards. What I can only assume that people are throwing money they can't really afford to throw because of weird hype. I can't deny that Pokemon legends had record breaking sales with 70$ price tag, yet it is astonishingly bad and cheap mobile-tier game, which sells on the back on franchise hype. So I see the switch 2 in the same vein.",
                              "score": 0,
                              "created_utc": 1751413127.0,
                              "replies": [
                                {
                                  "id": "n0upm56",
                                  "author": "None",
                                  "body": "[removed]",
                                  "score": 4,
                                  "created_utc": 1751413509.0,
                                  "replies": [
                                    {
                                      "id": "n0uy8w0",
                                      "author": "alohadawg",
                                      "body": "Convoluted assumption #1: Americans are generally more financially irresponsible than Europeans. Honestly, can’t say I disagree much with that one!",
                                      "score": -1,
                                      "created_utc": 1751416552.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "n0upy8p",
                          "author": "mbeachcontrol",
                          "body": "Good thing there were only 2 games at launch. Not too many to buy.",
                          "score": 0,
                          "created_utc": 1751413622.0,
                          "replies": []
                        },
                        {
                          "id": "n0uxub5",
                          "author": "alohadawg",
                          "body": "Europe also has a decidedly lower average COL. So unless you’re living in Switzerland, chances are pretty good your $2k/month is stretching much, much farther than it would in the US",
                          "score": 0,
                          "created_utc": 1751416409.0,
                          "replies": [
                            {
                              "id": "n0v53jz",
                              "author": "DespairTraveler",
                              "body": "I really don't want to start a pity party here, but I am here renting a studio for 1k$, not even counting utilities. I could squish my food expenses to 250$ probably on a bad month, but 400$ is more comfortable margin if I eat out sometimes. And rent/food isn't your only life expenses. So no, sadly, 2k ain't really much. And I don't live in Switzerland(which isn't even EU lol).",
                              "score": 1,
                              "created_utc": 1751418992.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n0unxjf",
                  "author": "Molwar",
                  "body": "Tax credit return season? xD",
                  "score": 0,
                  "created_utc": 1751412949.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0x60te",
          "author": "AMouthBreather",
          "body": "Naw you're just sane.",
          "score": 3,
          "created_utc": 1751453631.0,
          "replies": []
        },
        {
          "id": "n0yi0vt",
          "author": "None",
          "body": "[deleted]",
          "score": 3,
          "created_utc": 1751470016.0,
          "replies": [
            {
              "id": "n1c45ox",
              "author": "KingMaster80",
              "body": "DK will be GOTY contender.",
              "score": 1,
              "created_utc": 1751648837.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0us1h1",
          "author": "Whatever801",
          "body": "People really love Mario Kart. I also think that Nintendo has just been so consistently good for so long that the chance of like the new Donkey Kong not being great is basically 0. There almost certainly will be new 3d and 2d Mario games, new Zelda, etc that will be amazing even though they haven't announced anything.",
          "score": 7,
          "created_utc": 1751414336.0,
          "replies": []
        },
        {
          "id": "n0uus4h",
          "author": "svdomer09",
          "body": "It instantly made most of my switch games better. Like way better. Even if MK world and donkey Kong weren’t coming, that was reason enough for me.",
          "score": 6,
          "created_utc": 1751415304.0,
          "replies": []
        },
        {
          "id": "n0uybe4",
          "author": "SpartanKwanHa",
          "body": "yeah, I'm still working thru my wii u catalog",
          "score": 1,
          "created_utc": 1751416577.0,
          "replies": []
        },
        {
          "id": "n0vrq1w",
          "author": "Lankpants",
          "body": "For me it's just because there's a shortlist of upcoming games I know I'll want and MKW is a fun game right now. MKW isn't worth getting an entire console for, but I was going to get it anyway so it may as well be now.",
          "score": 1,
          "created_utc": 1751427202.0,
          "replies": []
        },
        {
          "id": "n0w1khn",
          "author": "BaggyHairyNips",
          "body": "An incremental upgrade to the original switch is all I really wanted. I'm sold, and I'm sure I'll get one eventually.\n\nBut with only a few launch games and presumably a future OLED version I'm not really seeing why people are jumping at it so eagerly. Is Mario Kart alone worth the price of a whole new console?\n\nGive us a new 3D Mario and we'll talk.",
          "score": 1,
          "created_utc": 1751431467.0,
          "replies": [
            {
              "id": "n0wvsui",
              "author": "AdamTheTall",
              "body": "They confirmed yesterday that bananza was done by the Mario Odyssey team. I suspect that'll scratch the itch for a bit.",
              "score": 1,
              "created_utc": 1751448172.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0xbva1",
          "author": "RegJohn2",
          "body": "I gave my Switch lite 3 years ago when I got a Steam Deck, got the Switch 2 about a week after launch and insta sold my OG Steam Deck. It’s a good time to sell a Steam Deck with all the redditors telling people to buy it and I have 3+ years of Nintendo backlog games to mess around with. Currently hooked on BOTW for the first time and having the time of my life. The Switch 2 is remarkable, feels next gen",
          "score": 1,
          "created_utc": 1751456236.0,
          "replies": []
        },
        {
          "id": "n0xn516",
          "author": "jackmusick",
          "body": "Even as a long time Zelda fan, it’s going to take a pretty amazing entry into the franchise to buy a console this time around. People talk about not wanting to pay for 80 dollar games. I don’t want to do that and buy a console for a handful of expensive games that aren’t better (imo) than many things in my Steam backlog.\n\nAll that to say is that it’s not for me and that’s fine. Though I really wish I could get a Switch 2 running Steam OS. The console is really slick.",
          "score": 1,
          "created_utc": 1751460576.0,
          "replies": []
        },
        {
          "id": "n14bjpw",
          "author": "ACoderGirl",
          "body": "I intend to get one eventually. But... The games don't interest me enough, yet. Mario Kart World is the only one of interest and it's not $700 interest. I guess what I'm surprised by is that it would sell this well before a Zelda, Animal Crossing, or Pokemon game came out.\n\nBuuuut, I note that many of the games on it are ports new to Nintendo consoles but have long since been on PC (my primary platform). Perhaps that is the big appeal to many, who may not have any of the platforms that could play such games?",
          "score": 1,
          "created_utc": 1751547623.0,
          "replies": []
        },
        {
          "id": "n0ukxis",
          "author": "Head_Haunter",
          "body": "I want one, dont have one. Kind of just want to play fantasy life and prepping for upcoming fire emblems. Oh and final fantasy tactics remaster.",
          "score": 1,
          "created_utc": 1751411962.0,
          "replies": []
        },
        {
          "id": "n0uvjof",
          "author": "GameMask",
          "body": "For me I wanted better Fortnite and I knew I'd want it sooner or later so I jumped on it. Plus, the backwards compatability is actually a pretty huge boon for me. Yeah not all of them look amazing but so many titles just run better now that it made it worth the upgrade. That said, I can absolutely see why it would be a wait and see for now.",
          "score": 1,
          "created_utc": 1751415576.0,
          "replies": []
        },
        {
          "id": "n0uvv9k",
          "author": "MassiveBoner911_3",
          "body": "It’s an instant buy because the old switch is over a decade old and it’s as slow as shit.",
          "score": -2,
          "created_utc": 1751415693.0,
          "replies": [
            {
              "id": "n0uwims",
              "author": "t_thor",
              "body": "I can see that maybe for people who haven't played games like cyberpunk already. The nature of Nintendo exclusive games means that small technological improvements like we have now are generally superficial.",
              "score": 2,
              "created_utc": 1751415929.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0uvh4i",
          "author": "Nyctoz",
          "body": "you don’t love Nintendo games then",
          "score": -7,
          "created_utc": 1751415550.0,
          "replies": [
            {
              "id": "n0uvs0v",
              "author": "t_thor",
              "body": "You seem fun",
              "score": 1,
              "created_utc": 1751415661.0,
              "replies": []
            },
            {
              "id": "n0v70n7",
              "author": "RedDwarf022",
              "body": "I agree, I can understand not buying it but it makes no sense to not understand why someone would buy it",
              "score": 0,
              "created_utc": 1751419677.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0xagar",
      "author": "Buttafuoco",
      "body": "How tf do you buy one??",
      "score": 5,
      "created_utc": 1751455629.0,
      "replies": [
        {
          "id": "n0xpmge",
          "author": "JazzHandsNinja42",
          "body": "Same.  Aside from scalpers, I find one anywhere.",
          "score": 1,
          "created_utc": 1751461438.0,
          "replies": [
            {
              "id": "n12p1z9",
              "author": "Beginning_Book_2382",
              "body": "Popfindr.com\n\nAlways right, just keep hitting refresh every day and call the store when you see a local one has some available. That's how I got mine a few days ago",
              "score": 1,
              "created_utc": 1751518363.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n12p1g9",
          "author": "Beginning_Book_2382",
          "body": "Popfindr.com\n\nAlways right, just keep hitting refresh every day and call the store when you see a local one has some available. That's how I got mine a few days ago\n\nBe blessed 🙏",
          "score": 1,
          "created_utc": 1751518356.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0v30lm",
      "author": "cooldaniel6",
      "body": "lol this is why I never listen to Reddit for anything. Y’all don’t know fuck about shit.",
      "score": 17,
      "created_utc": 1751418252.0,
      "replies": [
        {
          "id": "n0v649n",
          "author": "JohnSnowKnowsThings",
          "body": "You’re just finding this out? People on the internet are generally wrong more often than right and have 0 insider knowledge",
          "score": 7,
          "created_utc": 1751419354.0,
          "replies": [
            {
              "id": "n122d8u",
              "author": "ATR2400",
              "body": "If someone on the internet told me the sky was blue during the day, I’d have to go outside and check for myself",
              "score": 2,
              "created_utc": 1751509079.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n1dj646",
          "author": "ttoma93",
          "body": "This subreddit in particular has always had a completely irrational hatred of Nintendo. It’s very funny.",
          "score": 1,
          "created_utc": 1751665253.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0xywfd",
      "author": "Necessary-Note1009",
      "body": "And everyone said they wouldn’t buy it because of the price lmao",
      "score": 4,
      "created_utc": 1751464473.0,
      "replies": []
    },
    {
      "id": "n0zh8xb",
      "author": "polomarkopolo",
      "body": "I mean…. They haven’t had supply chain issues so yea",
      "score": 2,
      "created_utc": 1751479931.0,
      "replies": []
    },
    {
      "id": "n1dql3c",
      "author": "cheknauss",
      "body": "Simps",
      "score": 2,
      "created_utc": 1751667930.0,
      "replies": []
    },
    {
      "id": "n0ubw2l",
      "author": "Blarg0ist",
      "body": "Why can’t I find one to buy that’s not scalped!!?!   Nintendo offered a way to buy directly from the company but never got back to me or anyone else I know.  And I’ve been a loyal customer since 1985!\n\nEdit: I know there are ways to get one if you do the work, but it shouldn't be this hard.  Shame on Nintendo for favoring the retailers over their base. I wish they never even offered me the direct purchase option, because now I'm super resentful.\n\nAnother edit:  good for you, guys!  Sincerely glad you got one!  Yes, I tried walking in stores, and yes, I've gone online to all four stores and checked their stock somewhat regularly.  I'm not going to download twitter for this shit.  Again, my point is that it shouldn't be this hard.  Nintendo could have sold directly to consumers (at retail) before supplying stock to retailers (at wholesale).   It's a bad system that encourages scalping, and I'm sick to death of it.",
      "score": 15,
      "created_utc": 1751408972.0,
      "replies": [
        {
          "id": "n0uf6zv",
          "author": "ninjah1944",
          "body": "I just got my email to purchase direct from\nNintendo over the weekend, though I lucked out buying it at Costco a week before.",
          "score": 11,
          "created_utc": 1751410060.0,
          "replies": []
        },
        {
          "id": "n0ufun3",
          "author": "TechNick3",
          "body": "Probably too late now but best buy just had a refresh today.  I was able to walk into the store and pick one up hassle free.",
          "score": 9,
          "created_utc": 1751410278.0,
          "replies": []
        },
        {
          "id": "n0uonux",
          "author": "thewitchof-el",
          "body": "My boyfriend picked one up last weekend at Target, he was surprised to see it in stock.",
          "score": 6,
          "created_utc": 1751413193.0,
          "replies": []
        },
        {
          "id": "n0uk51a",
          "author": "DandySlayer13",
          "body": "I got mine a few days ago via Walmart+ early sale and Best Buy just notified me that they are getting a restock(probably gone now) as well.",
          "score": 3,
          "created_utc": 1751411698.0,
          "replies": []
        },
        {
          "id": "n0ut6d9",
          "author": "The-student-",
          "body": "I got an email from them last week, despite buying one at launch. They'll get to you eventually.",
          "score": 3,
          "created_utc": 1751414735.0,
          "replies": []
        },
        {
          "id": "n0uviue",
          "author": "opticalshadow",
          "body": "They are in stock at stores around me",
          "score": 3,
          "created_utc": 1751415568.0,
          "replies": []
        },
        {
          "id": "n0ufhhe",
          "author": "HappyHappyGamer",
          "body": "Is this still hard to get in certain places?",
          "score": 2,
          "created_utc": 1751410156.0,
          "replies": [
            {
              "id": "n0vlpqv",
              "author": "darkmacgf",
              "body": "Yes.",
              "score": 2,
              "created_utc": 1751424859.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0v5exx",
          "author": "Rpcouv",
          "body": "Based off your edits I’m going to assume you didn’t try to get the series x and ps5 during launch because those were an entirely different game  when it came to trying to track them down. I’ve seen multiple switch 2 devices on shelf 3 times since launch along with a couple hours before launch just being able to wait in line to preorder at GameStop. I believe it’s going out of stock on the restock days but I don’t believe that there is any sort of lines or challenge getting them if you just show up as stores open.",
          "score": 2,
          "created_utc": 1751419105.0,
          "replies": []
        },
        {
          "id": "n0uks0z",
          "author": "jpjamal",
          "body": "I walked into Target at 1:00 PM launch day and they had several units on the shelves. Have you walked into your local store yet? Or do you just like to complain",
          "score": 8,
          "created_utc": 1751411912.0,
          "replies": [
            {
              "id": "n0uyimq",
              "author": "onerb2",
              "body": "Dude said he couldn't get one, why be so aggressive about it?",
              "score": 10,
              "created_utc": 1751416649.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0ufcga",
          "author": "krstphr",
          "body": "Sign up at Nowinstock.net",
          "score": 2,
          "created_utc": 1751410110.0,
          "replies": []
        },
        {
          "id": "n0uylim",
          "author": "byamannowdead",
          "body": "I just got my invite to buy from Nintendo an hour ago, but I got lucky at pre-order midnight from Walmart. So they’re still rolling out.",
          "score": 2,
          "created_utc": 1751416677.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0v3f53",
      "author": "Subziro91",
      "body": "The f Nintendo reddit page is on su1cid3 watch .",
      "score": 8,
      "created_utc": 1751418394.0,
      "replies": []
    },
    {
      "id": "n0w642y",
      "author": "crashbandyh",
      "body": "Not even surprised, every new thing with some hype behind it breaks past records now. What matters is a couple months from now will the console maintain it's popularity.",
      "score": 4,
      "created_utc": 1751433659.0,
      "replies": []
    },
    {
      "id": "n0w6x5x",
      "author": "Saratje",
      "body": "I still don't see why people kept saying that the Switch 2 wouldn't sell at 450-500. Things simply got more expensive, don't be surprised when the PS6 goes for 1099 in a few years with scalpers pushing it up to 1599, or the Next Xbox for 899 with some premium model going for 1099.\n\nBoth times Nintendo has launched several years ahead of the upcoming next gen, while waiting long enough for current gen to have aged to be able to create a device with comparatively equal performances with cheaper hardware at a lower price than the competition, which above all is also a handheld.",
      "score": 3,
      "created_utc": 1751434063.0,
      "replies": []
    },
    {
      "id": "n0ud0bv",
      "author": "krossx123",
      "body": "I just don't understand why people will buy it just to play one exclusive game on it. I'm gona wait for atleast 3-5 exclusive games before buying the console honestly.",
      "score": 8,
      "created_utc": 1751409342.0,
      "replies": [
        {
          "id": "n0uhe55",
          "author": "Mirikado",
          "body": "Nintendo doesn’t run sales. What’s the point of waiting? It’s not like waiting will make the games cheaper. \n\n$500 is also disposable income to a lot of people.",
          "score": 29,
          "created_utc": 1751410784.0,
          "replies": [
            {
              "id": "n0uzz6x",
              "author": "VinhoVerde21",
              "body": "Not having a console collecting dust in the drawer for a year, wasting warranty doing nothing. That or not wearing it down (remember, those joysticks will get drift) playing games you can just play on the Switch.\n\nIt’s not like it’s gonna get more expensive either, what’s the point of buying something you don’t plan to use any time soon? Hell, if you can wait a bit longer and you can probably go straight for the inevitable Switch 2 OLED.",
              "score": -7,
              "created_utc": 1751417174.0,
              "replies": [
                {
                  "id": "n0vhucj",
                  "author": "Mirikado",
                  "body": "The people who buy it clearly have a use for it. A lot of people have been asking for Switch 1 with better hardware. They have the entire Switch library to play with + 3rd party games that the Switch couldn’t run. \n\nWeird af to assume people have no use for a new console that they buy. Maybe YOU don’t. Don’t make that assumption for everyone.",
                  "score": 2,
                  "created_utc": 1751423446.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0vqh6o",
              "author": "kat1795",
              "body": "The point of waiting for the OLED screen! Their current screen is shite",
              "score": -5,
              "created_utc": 1751426703.0,
              "replies": [
                {
                  "id": "n0vz2zb",
                  "author": "Diakia",
                  "body": "The handheld OLED screen that matches the specs (VRR and 120hz specifically), cost and efficiency of the Switch 2 doesn't exist, ASUS outlined this very clearly when they stated why the Xbox ROG Ally doesn't have an OLED screen.",
                  "score": 7,
                  "created_utc": 1751430320.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0ug08s",
          "author": "ThisIsNotACryForHelp",
          "body": "Why wait when I know I'm going to get it eventually? Plus, it makes my current library run better",
          "score": 66,
          "created_utc": 1751410329.0,
          "replies": [
            {
              "id": "n0uhmqy",
              "author": "wirelessfingers",
              "body": "What if the launch model is the worst one (they were with Switch 1)? What if there are better deals at the end of the year? Nothing against you, but this view doesn't really hold up.\n\nEdit: games will be patched by then too for better performance or more content",
              "score": -23,
              "created_utc": 1751410862.0,
              "replies": [
                {
                  "id": "n0ui6cr",
                  "author": "d4nowar",
                  "body": "It's a viewpoint you can make when you have a bit of extra spending money. And at that point, you'll just exchange the release day switch 2 for a better model and pay the difference.",
                  "score": 16,
                  "created_utc": 1751411043.0,
                  "replies": []
                },
                {
                  "id": "n0ukkox",
                  "author": "ThisIsNotACryForHelp",
                  "body": "What if the PS6 is better than the PS5? Why would I buy an i9 processor when the i11 will come out one day and be better? What if the latest AAA game is available for free on the Epic store a year after it launches?\n\nObviously, the reason people make full price purchases at launch is because they want to experience things sooner rather than later.\n\nSpeaking personally, I love Mario Kart, Donkey Kong, Metroid, Zelda, and Kirby - and all of these franchises are getting new and/or remastered entries within the first year of Switch 2 - and I want to experience it all as it comes out. Plus, my entire Switch 1 library is running better than ever. For me, there's enough value on offer to justify my day 1 purchase.",
                  "score": 16,
                  "created_utc": 1751411844.0,
                  "replies": [
                    {
                      "id": "n0uo9w5",
                      "author": "Molwar",
                      "body": ">Plus, my entire Switch 1 library is running better than ever.\n\nThis is probably a huge reason why it sell so well, the backward compatibility offers 1000s of game that run even better then before. There's no downside to buying it now rather then later.",
                      "score": 9,
                      "created_utc": 1751413064.0,
                      "replies": []
                    },
                    {
                      "id": "n0un8l7",
                      "author": "wirelessfingers",
                      "body": "Waiting for an entire console generation or cpu generation is not the same as waiting a couple months for christmas. Ultimately, if the value is there for you, then good for you. I think the price of being locked into all the new stuff is not worth the premium you're paying in experience and cost.\n\nFor console launches, you just have to look at the 360 with its serious hardware issues. Nintendo games do better than most, but it's not hard to find examples of their games being released in unfinished states.\n\nI can't remember where I heard it, but someone said that most of their enjoyment in movies and games comes from discussing them online. In that case, the newness of the experience is worth a lot to you, and I can't argue anything against that.",
                      "score": -2,
                      "created_utc": 1751412718.0,
                      "replies": [
                        {
                          "id": "n0unudn",
                          "author": "mybananasareillegal",
                          "body": "Pokémon Scarlet/violet came out super buggy, as a recent example",
                          "score": 8,
                          "created_utc": 1751412919.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n0unbdy",
                      "author": "mybananasareillegal",
                      "body": "I think they’re more so talking about “why buy the switch 2 launch model now when the Switch 2 oled or the switch 2 lite might come out in a few years” which isn’t really equivalent to waiting for the PS6 or i11 chips. Nintendo has released multiple version of their consoles for decades, so it’s very probable they will again with the switch 2.\n\nYour point still stands (buy/don’t buy the console for whatever reason you want)  but I feel the distinction is important here",
                      "score": -4,
                      "created_utc": 1751412743.0,
                      "replies": [
                        {
                          "id": "n0unjdi",
                          "author": "ThisIsNotACryForHelp",
                          "body": "I was intentionally being hyperbolic",
                          "score": 4,
                          "created_utc": 1751412818.0,
                          "replies": [
                            {
                              "id": "n0unqyb",
                              "author": "mybananasareillegal",
                              "body": "Considering OP and myself felt the need to correct you, your hyperbole was not well communicated ¯\\_(ツ)_/¯",
                              "score": -1,
                              "created_utc": 1751412887.0,
                              "replies": [
                                {
                                  "id": "n0unwzn",
                                  "author": "ThisIsNotACryForHelp",
                                  "body": "Both of you also said that you got my point",
                                  "score": 2,
                                  "created_utc": 1751412943.0,
                                  "replies": [
                                    {
                                      "id": "n0uo5yk",
                                      "author": "mybananasareillegal",
                                      "body": "Ergo why I’m not criticizing your point, but the comparison (hyperbole) you tried to make",
                                      "score": 2,
                                      "created_utc": 1751413027.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n0wwbg9",
                  "author": "AdamTheTall",
                  "body": ">What if the launch model is the worst one (they were with Switch 1)? What if there are better deals at the end of the year? Nothing against you, but this view doesn't really hold up.\n\nLiterally every console manufacturer has released multiple models over the course of a single generation. Either it's worth it to you to get at release or it isn't, but waiting years for a mid-gen rerelease or price drop that may not come isn't the most logical path for anyone with interest now.",
                  "score": 2,
                  "created_utc": 1751448473.0,
                  "replies": []
                },
                {
                  "id": "n0ule0u",
                  "author": "DespairTraveler",
                  "body": "What do you mean worst one? Usually launch models are actually better due to bugs that allow the console to be hacked, which gets patched later.",
                  "score": 1,
                  "created_utc": 1751412109.0,
                  "replies": [
                    {
                      "id": "n0ulu5j",
                      "author": "wirelessfingers",
                      "body": "The processor in the Switch was updated in later models for better battery life. If you're hacking it, you can get better performance from overclocking a newer model. It is true the launch model has that hardware exploit, but that's the only place where it's better.",
                      "score": 6,
                      "created_utc": 1751412255.0,
                      "replies": [
                        {
                          "id": "n0uxmpi",
                          "author": "Sock-Enough",
                          "body": "That was over two years later. I want to play Mario Kart World, Donkey Kong Bananza, and the improved Pokémon games now.",
                          "score": 6,
                          "created_utc": 1751416333.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n0w40u5",
                  "author": "m0rogfar",
                  "body": "What if there’s worse deals at the end of the year?\n\nPrice/performance hasn’t really gone down aggressively for tech in recent years, and the economic climate is so unstable that things generally go up in price, not down - and notably, the other consoles are _more expensive_ than when they launched five years ago. The economic world we live in now is fundamentally not one where you postpone purchases to get a cheaper price later, but one where you accelerate purchases that you know you’ll make eventually, if you can afford to do it now, in order to lock in the current price, and avoid a more expensive price later, is the move. That’s just the new economic reality.\n\nIn addition, we know that the MKW bundle is going out of production later this year, so even ignoring the general economic climate, that’s a guaranteed $30 price increase if you’re going to get that game.",
                  "score": 0,
                  "created_utc": 1751432628.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0ug5o5",
          "author": "GeneralBrwni1",
          "body": "I mean from the opposite end, if you're *absolutely sure* that you have at least 3-5 games that you want to play on a console already, why wait to play the one that's out now?\n\nBut also sometimes a person just loves a series enough to sink hundreds of hours into each game. I bought a Wii U and all it really needed was Smash for me to play it that much, I can see Mario Kart being that series for a lot of people.",
          "score": 15,
          "created_utc": 1751410379.0,
          "replies": []
        },
        {
          "id": "n0upq2u",
          "author": "Key_Amazed",
          "body": "Between Mario Kart World, DK Bananza, Duskbloods next year, knowing that Legends ZA is going to be shit on the Switch 1, I bought it so I don't have to go through the song and dance of finding one later. There's also no telling that a person's financial situation will remain the same in the future, so there's security in that as well.\n\nAnd that's knowing there will be a Mario game soon, one or two Zelda games in its lifespan, Gen 10 and 11 Pokemon (yes I know Pokemon bad but I get 500+ hours out of each game so they're fine for me.\n\nAnd who knows what else lurks in its future. People really need to realize that they don't have to understand why other people might want something. They're not entitled or owed an explanation. And I don't see why Redditors get so angry thinking about another person living their own life lol.",
          "score": 7,
          "created_utc": 1751413545.0,
          "replies": [
            {
              "id": "n0x8bnr",
              "author": "SubtleNotch",
              "body": "Scarlet and Violet are really great on Switch 2. Lots of the bad graphics got resolved, though not all.",
              "score": 2,
              "created_utc": 1751454690.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0uiksk",
          "author": "Mllns",
          "body": "There is already a big backlog of games available from the OG Switch that play much better. It's like who would buy a 5080 today if you can still play all games with a 2060?",
          "score": 14,
          "created_utc": 1751411178.0,
          "replies": [
            {
              "id": "n0v0xjn",
              "author": "VinhoVerde21",
              "body": "I mean, yea, if all the games you like run fine with a 2060, why would you buy a 5080? It’d be overkill, muscle sat unused.",
              "score": -2,
              "created_utc": 1751417510.0,
              "replies": [
                {
                  "id": "n0wfn5q",
                  "author": "funforgiven",
                  "body": "If all the games ran fine, sure. But all of them run shit on the original Switch.",
                  "score": 2,
                  "created_utc": 1751438701.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0ugjeh",
          "author": "falconpunch1989",
          "body": "1 - We've been hanging for a nicer Switch for years. Even for non-exclusive games it looks, feels, and in many cases performs better.\n\n2 - I can only seriously play 1-2 games at a time. 1 good launch game is the amount of new games I can realistically play in the month until the next good exclusive comes out.",
          "score": 10,
          "created_utc": 1751410506.0,
          "replies": []
        },
        {
          "id": "n0ugo6c",
          "author": "junglespycamp",
          "body": "The longer you have it the more value. Plus there is the added benefit of the performance upgrades for several games. So anyone with a Switch 1 backlog can benefit now. \n\nThat said, it’s 100% a luxury choice for long term not a must own now.",
          "score": 4,
          "created_utc": 1751410548.0,
          "replies": []
        },
        {
          "id": "n0uhqsy",
          "author": "Pingy_Junk",
          "body": "we got one after a family member managed to get 3 of them and tbh if your a huge lover of the console itself I can see the appeal. It’s like if the switch 1 didn’t have rampant performance issues.",
          "score": 2,
          "created_utc": 1751410900.0,
          "replies": []
        },
        {
          "id": "n0uti50",
          "author": "The-student-",
          "body": "It's a no brainer if you're already playing Switch games and value increased performance. Almost every single Switch 1 game runs moderately to significantly better on Switch 2. \n\nAlso, it's not going on sale, so what's the difference between buying it now and buying it when it has 3-5 exclusives on it?",
          "score": 2,
          "created_utc": 1751414851.0,
          "replies": []
        },
        {
          "id": "n0ux6w9",
          "author": "CyberDalekLord",
          "body": "Honestly, I got mine just in case tariffs fuck up the pricing.  It is super nice playing Tears of the Kingdom with the improved performance, though.",
          "score": 2,
          "created_utc": 1751416174.0,
          "replies": [
            {
              "id": "n0v523o",
              "author": "Worried_Pineapple823",
              "body": "As a Canadian, I was worried about getting 2nd hand tariffs since our stock has traditionally been coming through Nintendo of America, it’d have ended out being an easy 1k with the numbers being thrown around for tariffs.",
              "score": 1,
              "created_utc": 1751418977.0,
              "replies": [
                {
                  "id": "n0v766k",
                  "author": "CyberDalekLord",
                  "body": "Jesus, thats a rough conversion.  Hopefully, tariffs dont end up screwing up pricing, but you never know.",
                  "score": 1,
                  "created_utc": 1751419732.0,
                  "replies": [
                    {
                      "id": "n0v7qg0",
                      "author": "Worried_Pineapple823",
                      "body": "It’s already $699, but a tariff on entry in the US would have raised the base price, and then another tariff coming into Canada potentially, and then the tax on would have been that much more. (It’s just short of $800 after taxes now)",
                      "score": 1,
                      "created_utc": 1751419932.0,
                      "replies": [
                        {
                          "id": "n0vgrat",
                          "author": "CyberDalekLord",
                          "body": "![gif](giphy|qUyK0v2rFcCDC)",
                          "score": 2,
                          "created_utc": 1751423065.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n0um3ds",
          "author": "TheGreatBenjie",
          "body": "One exclusive? What about the plethora of Switch 1 games that play way better on the 2?\n\nAre yall actually in denial that a lot of people are looking at the Switch 2 as a Switch Pro? Wild.",
          "score": 6,
          "created_utc": 1751412340.0,
          "replies": [
            {
              "id": "n0usrf9",
              "author": "krossx123",
              "body": "Uh I already played them on the Switch 1 multiple times?",
              "score": 5,
              "created_utc": 1751414588.0,
              "replies": [
                {
                  "id": "n0usymg",
                  "author": "TheGreatBenjie",
                  "body": "Okay? You were talking about \"people\" not \"you\".\n\nPlenty of people are buying Switch 2 to play Zelda, Pokemon, and plenty of others now at 60fps.",
                  "score": 4,
                  "created_utc": 1751414658.0,
                  "replies": [
                    {
                      "id": "n0v1lsh",
                      "author": "VinhoVerde21",
                      "body": "They’re not Switch 2 exclusives, that’s the point.",
                      "score": -2,
                      "created_utc": 1751417747.0,
                      "replies": [
                        {
                          "id": "n0v3yup",
                          "author": "TheGreatBenjie",
                          "body": "The point is they run better? Why is this so difficult to comprehend?",
                          "score": 1,
                          "created_utc": 1751418590.0,
                          "replies": [
                            {
                              "id": "n0vapt3",
                              "author": "VinhoVerde21",
                              "body": "I’m talking about what you missed, I know people use the Switch 2 to play Switch games better (again, there’s no other use for it besides that and MKW lol).",
                              "score": 4,
                              "created_utc": 1751420970.0,
                              "replies": [
                                {
                                  "id": "n0vbjek",
                                  "author": "TheGreatBenjie",
                                  "body": "The original comment I replied to couldn't understand why people were buying Switch 2 \"just to play one exclusive\" as if that's the \"ONLY\" reason to buy Switch 2...I didn't miss anything.",
                                  "score": 1,
                                  "created_utc": 1751421253.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n0v0oqx",
                      "author": "krossx123",
                      "body": "Are you saying people who would have rushed to buy a Nintendo Switch 2 on day one but wouldn't have purchased Zelda, Pokémon, or other games when they came out? Instead, they'd waited for a Switch 2, which wasn't confirmed back then and was purely speculative until the very end? Yeah, okay, buddy.",
                      "score": -2,
                      "created_utc": 1751417424.0,
                      "replies": [
                        {
                          "id": "n0v716f",
                          "author": "TheGreatBenjie",
                          "body": "Wow reading comprehension is at an all time low around here huh",
                          "score": 1,
                          "created_utc": 1751419683.0,
                          "replies": [
                            {
                              "id": "n0vqizn",
                              "author": "krossx123",
                              "body": "Said the guy whose argument was that the Switch 2 could play all Switch 1 games faster, lmao! You can argue all you want, buddy, but the fact is, the Switch 2 only has one exclusive game right now, and everything else can be played elsewhere. Heck, you could play Switch 1 games on a PC, which runs them faster than the Switch 2 ever could, if that's the argument you want to make. And if you're going to say you can't take a PC anywhere, well, there's the Steam Deck.",
                              "score": -1,
                              "created_utc": 1751426723.0,
                              "replies": [
                                {
                                  "id": "n0vsf9v",
                                  "author": "TheGreatBenjie",
                                  "body": "Yup 0 reading comprehension. Thanks for proving my point.\n\nI never said it could play all Switch 1 games faster but you're massively coping if you don't think it doesn't play most faster or at least more stable.\n\nActing like emulation is somehow competing with Switch 2 is an even bigger cope especially if you think the Deck can do any better than the Switch 2.",
                                  "score": 1,
                                  "created_utc": 1751427485.0,
                                  "replies": [
                                    {
                                      "id": "n0w0kjt",
                                      "author": "krossx123",
                                      "body": "Lmao! I have zero reading comprehension because you never said the Switch 2 could play all Switch 1 games faster? Well, it’s the Switch 2, so it should play every Switch 1 games faster. But the point remains: the Switch 2 still only has one exclusive game right now, and that’s not enough to justify buying it. Also, you’re the one with zero reading comprehension. I never said emulation is a competitor to the Switch 2; however, it’s an alternative that can run Switch 1 games faster. It’s a counterargument to your reasoning about why people would buy the Switch 2, other than to just play that one exclusive game.",
                                      "score": -1,
                                      "created_utc": 1751431002.0,
                                      "replies": [
                                        {
                                          "id": "n0w3q3z",
                                          "author": "TheGreatBenjie",
                                          "body": "Yes correct you have zero reading comprehension. If the amount of exclusives weren't enough to justify buying it it wouldn't be the fastest selling console of all time lmao.\n\nEmulation isn't a counterargument in the slightest because your example of the steam deck doesn't even run Switch games better than the Switch, let alone the Switch 2.",
                                          "score": 3,
                                          "created_utc": 1751432484.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n0vz8we",
          "author": "prism1234",
          "body": "There will eventually be 3 to 5 games on it I want to play, probably fairly soon. I doubt the price is coming down anytime soon and I didn't feel like waiting for the likely future oled version so I didn't really see the point in holding off.\n\nRight now there's Mario Kart and Pokemon Scarlet/Violet runs better which I haven't played yet. Donkey Kong and Legends ZA are soonish.",
          "score": 1,
          "created_utc": 1751430393.0,
          "replies": []
        },
        {
          "id": "n0xtpry",
          "author": "qualitypi",
          "body": "Nintendo has proven that they will release a steady cadence of titles. People don't play 15 games at once, a large launch library was once common wisdom with a new console launch but it's outdated.",
          "score": 1,
          "created_utc": 1751462805.0,
          "replies": [
            {
              "id": "n0yhppn",
              "author": "krossx123",
              "body": "I'll eventually get the Switch 2 once more games start rolling out. I know people aren't playing 15 games at once, but right now, there's only one exclusive, which doesn't offer much to choose from. When more games come out, that's when people will have more options to pick from.",
              "score": 0,
              "created_utc": 1751469930.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0uex5i",
          "author": "Dracogame",
          "body": "People have FOMO. ",
          "score": 1,
          "created_utc": 1751409969.0,
          "replies": []
        },
        {
          "id": "n0uhi5p",
          "author": "TheRealSeeThruHead",
          "body": "Why bother waiting?",
          "score": 1,
          "created_utc": 1751410820.0,
          "replies": [
            {
              "id": "n0wc5r6",
              "author": "InbredLegoExpress",
              "body": "warranty is a good point imo.",
              "score": -1,
              "created_utc": 1751436789.0,
              "replies": [
                {
                  "id": "n0wd3fy",
                  "author": "TheRealSeeThruHead",
                  "body": "I play my switch 2 every day\n\nMain reason is that switch one games run well on it, much better than switch 1 hardware.\n\nNo sense waiting. I’ve never had to warranty a Nintendo device.",
                  "score": 2,
                  "created_utc": 1751437298.0,
                  "replies": [
                    {
                      "id": "n0wf8a4",
                      "author": "InbredLegoExpress",
                      "body": "diff consumer behaviour. OPs main purpose behind the purchase is to play new exclusives, rather than replaying Switch 1 exclusives he already played but now on updated hardware. \n\nBut theres currently no interesting lineup and buying a console early for future releases to set dust and run off warranty fells pointless and even contraproductive to OP.",
                      "score": -1,
                      "created_utc": 1751438472.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n0ulc53",
          "author": "Isiddiqui",
          "body": "A lot of Switch 1 games the last few years didn’t run all that well. So I avoided getting them on the Switch 1. Now that they run well on Switch 2, it’s a perfect time to play them",
          "score": 1,
          "created_utc": 1751412091.0,
          "replies": []
        },
        {
          "id": "n0uecg9",
          "author": "NamiiikazeTX",
          "body": "Same, waiting for at least the Pokémon ZA version to come out.",
          "score": 0,
          "created_utc": 1751409779.0,
          "replies": [
            {
              "id": "n0ugvh9",
              "author": "Chickenman456",
              "body": "I want to like that game so fucking bad but I just can't get over how the environments look like they're from three generations ago. Hoping I'm wrong and it's still good anyway",
              "score": -1,
              "created_utc": 1751410616.0,
              "replies": [
                {
                  "id": "n0ulky7",
                  "author": "ReturnToGreco",
                  "body": "Last two games haven’t bucked the trend so very unlikely to change. Arceus got a pass because the gameplay loop is solid.",
                  "score": 3,
                  "created_utc": 1751412171.0,
                  "replies": [
                    {
                      "id": "n0ungsp",
                      "author": "Chickenman456",
                      "body": "I heard Arceus is really good. I'm thinking about picking that up for my Switch 1 in the meantime",
                      "score": 1,
                      "created_utc": 1751412794.0,
                      "replies": [
                        {
                          "id": "n0uo5nw",
                          "author": "ReturnToGreco",
                          "body": "Played hundreds of hours of it and streamed it a bit. Loved the game and really hoped they would continue the series. Not so stoked the new one is all in the one city. I hoped they would expand it and make it more open world. Arceus is def worth playing.",
                          "score": 2,
                          "created_utc": 1751413024.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n0v15dq",
                  "author": "VinhoVerde21",
                  "body": "They’re not going to improve unless sales drop. And sales won’t drop if people keep buying.",
                  "score": 1,
                  "created_utc": 1751417588.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n0unvj9",
      "author": "Key_Amazed",
      "body": "And reddit couldn't be more enraged over it",
      "score": 4,
      "created_utc": 1751412930.0,
      "replies": [
        {
          "id": "n0vc6kr",
          "author": "Klaphood",
          "body": "Actually, it sounds more like they're totally acknowledging that they/Reddit was wrong.",
          "score": -5,
          "created_utc": 1751421478.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0vzmn8",
      "author": "oOkukukachuOo",
      "body": "good for those people. Hope they're happy with their purchase.  \ntime is still ticking and time tells all.   \nI'd rather not be an early adopter for most technology, but hey, you do you.",
      "score": 3,
      "created_utc": 1751430566.0,
      "replies": []
    },
    {
      "id": "n0vpfz3",
      "author": "Kaizen2468",
      "body": "Surprising considering it has like what, 1 game?",
      "score": 1,
      "created_utc": 1751426297.0,
      "replies": []
    },
    {
      "id": "n0v4igw",
      "author": "Tim_Mango",
      "body": "Really surprised it’s beating the original especially given that release came after the Wii U",
      "score": 1,
      "created_utc": 1751418784.0,
      "replies": []
    },
    {
      "id": "n0vtj38",
      "author": "ShadykillaWolf",
      "body": "Yeah, we’re cooked.",
      "score": 1,
      "created_utc": 1751427942.0,
      "replies": []
    },
    {
      "id": "n0vy5il",
      "author": "CaptainDonald",
      "body": "It’s incredible the amount of supply they were able to amass, especially considering the circumstances. PS5’s were sold out for months. You can readily buy a Switch 2 and it’s not for lack of popularity. Very impressive work",
      "score": 1,
      "created_utc": 1751429907.0,
      "replies": []
    },
    {
      "id": "n0vyltm",
      "author": "Confused-Raccoon",
      "body": "Went to browse/checkout/buy one on amazon and saw the price had gone up to £460?! but was out of stock or just not available. Are stock levels holding or is everywhere sold out?",
      "score": 1,
      "created_utc": 1751430108.0,
      "replies": []
    },
    {
      "id": "n0vzcf0",
      "author": "MASTER_L1NK",
      "body": "I think they knew to make shitloads more available at launch compared to the first Switch.",
      "score": 1,
      "created_utc": 1751430437.0,
      "replies": []
    },
    {
      "id": "n0vzj6w",
      "author": "General_Snack",
      "body": "Okay but where are the cool Nintendo RPGs? Where’s the new xenoblade, where’s the new fire emblem. I ain’t getting one of these till I see those",
      "score": 1,
      "created_utc": 1751430522.0,
      "replies": []
    },
    {
      "id": "n0wjv0q",
      "author": "Chr0ll0_",
      "body": "Not surprised",
      "score": 1,
      "created_utc": 1751441079.0,
      "replies": []
    },
    {
      "id": "n0wwjfm",
      "author": "nervusy",
      "body": "Are there statistics on what people are mostly playing on the Switch 2?",
      "score": 1,
      "created_utc": 1751448599.0,
      "replies": []
    },
    {
      "id": "n0xn3hw",
      "author": "hiimbackagain",
      "body": "And they didn't even have to release it with a good launch title. That's the most impressive part.",
      "score": 1,
      "created_utc": 1751460561.0,
      "replies": []
    },
    {
      "id": "n0yausr",
      "author": "Senior_League_436",
      "body": "Scalpers is why",
      "score": 1,
      "created_utc": 1751467982.0,
      "replies": []
    },
    {
      "id": "n0yjido",
      "author": "irascible_Clown",
      "body": "Because scalpers bought them all, who’s paying $900 for on eBay!?",
      "score": 1,
      "created_utc": 1751470427.0,
      "replies": []
    },
    {
      "id": "n0yqspp",
      "author": "kr4ckenm3fortune",
      "body": "Lol...how many of them are re-sold because of the \"stapler incidents\"? Or the \"bricking\"? Or the \"scalpers\"?",
      "score": 1,
      "created_utc": 1751472446.0,
      "replies": []
    },
    {
      "id": "n0z3b5t",
      "author": "BarringGaffner",
      "body": "Still no email from Nintendo to purchase one :/ \n\nHas anyone that didn’t get an immediate preorder had any luck with a Nintendo follow up?",
      "score": 1,
      "created_utc": 1751476003.0,
      "replies": []
    },
    {
      "id": "n10td55",
      "author": "sweendog101",
      "body": "I’m visiting NYC and went to the Nintendo Store. Plenty of Switch 2 stock this morning and tons of people afterwards just buying Nintendo shirts/plushes/basically anything all day every day",
      "score": 1,
      "created_utc": 1751494304.0,
      "replies": []
    },
    {
      "id": "n134pdr",
      "author": "getSome010",
      "body": "That’s kinda sad, especially in this economy",
      "score": 1,
      "created_utc": 1751526468.0,
      "replies": []
    },
    {
      "id": "n160z63",
      "author": "Holiday-Ad8351",
      "body": "This is wild to me considering it doesn’t have much to offer just yet until more NEW games get released for it.",
      "score": 1,
      "created_utc": 1751565555.0,
      "replies": []
    },
    {
      "id": "n16apgh",
      "author": "Agent101g",
      "body": "Cool, I'm not buying it. It's made by the most evil anti-preservation company in gaming",
      "score": 1,
      "created_utc": 1751568408.0,
      "replies": []
    },
    {
      "id": "n17qm1a",
      "author": "_FIRECRACKER_JINX",
      "body": "When is the OLED version coming out? \n\n\nThat's all I need 😕",
      "score": 1,
      "created_utc": 1751584497.0,
      "replies": []
    },
    {
      "id": "n18kpa5",
      "author": "joker041988",
      "body": "How many are actively even still playing it, you can only play mario kart for so long. Almost every system after gamecube people dont play new Nintendo consoles past the first few weeks to a month",
      "score": 1,
      "created_utc": 1751595555.0,
      "replies": []
    },
    {
      "id": "n1ab0wg",
      "author": "WanderingSimpleFish",
      "body": "Well your not buying it, your buying the licence to use it. Reason why I’ll never buy one. Nintendo doesn’t like what you do with it then it turns into a brick.",
      "score": 1,
      "created_utc": 1751626388.0,
      "replies": []
    },
    {
      "id": "n1nnitk",
      "author": "CodsBollocks",
      "body": "Im going to get one but there's nothing I want to play on it just yet",
      "score": 1,
      "created_utc": 1751818941.0,
      "replies": []
    },
    {
      "id": "n0ux0d1",
      "author": "Paddlesons",
      "body": "WAAAHH!! I'm mad about a relatively moderate priced console! WAAAH!",
      "score": 1,
      "created_utc": 1751416107.0,
      "replies": []
    },
    {
      "id": "n0v5lv6",
      "author": "Kopen12",
      "body": "I'm quite surprised that the Switch 2 did this well. I admit, I thought for sure I was going to buy one... But, then there was the price, the fact that the cartridges don't actually have games on them, no OLED, battery life issues, batteries expanding, Nintendo's radical stance on bricking your equipment for emulators and the fact that there aren't any groundbreaking launch titles... Yea, I'm out.",
      "score": -3,
      "created_utc": 1751419173.0,
      "replies": [
        {
          "id": "n0wl3ai",
          "author": "Romi-Omi",
          "body": "The reality is 99% of the folks that just wants to play some games and have fun don’t care about any of the things you mentioned, except maybe the price. Like what percentage of player base actually mods their switch? Most people don’t even know what’s the difference between OLED and LCD",
          "score": 9,
          "created_utc": 1751441802.0,
          "replies": [
            {
              "id": "n11iys4",
              "author": "Kopen12",
              "body": "I suppose you're right. I must be in the minority. Honestly, I know it's better than my original Switch, but it's definitely not worth it to me right now. I know I listed a bunch of negatives, but the only one that is really preventing me from wanting this system is the lack of ownership I feel with regard to the games.",
              "score": 1,
              "created_utc": 1751502668.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0uwe9h",
      "author": "hestalinal",
      "body": "Wow, that's a lot of Switches sold! Go Nintendo!",
      "score": 1,
      "created_utc": 1751415884.0,
      "replies": []
    },
    {
      "id": "n0v09je",
      "author": "drossvirex",
      "body": "Im not sure who is buying it and why. Not like theres a good launch game",
      "score": -1,
      "created_utc": 1751417273.0,
      "replies": []
    },
    {
      "id": "n0ul3f0",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1751412014.0,
      "replies": [
        {
          "id": "n0up8e0",
          "author": "monkeybuttsauce",
          "body": "Once again, Reddit doesn’t represent the majority of people",
          "score": 5,
          "created_utc": 1751413382.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0veri9",
      "author": "Peakomegaflare",
      "body": "And this is why companies will continue to put out slop. Nintendo has had some REALLY bad PR over the years with anti-consumer practices and really questionable lawsuits.",
      "score": -4,
      "created_utc": 1751422367.0,
      "replies": [
        {
          "id": "n0vy6jq",
          "author": "RegalKillager",
          "body": "Slop games aren't quite the same issue as anti-consumer practices and legal villainry.",
          "score": 5,
          "created_utc": 1751429919.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0vc3ty",
      "author": "dantesmaster00",
      "body": "Bet it’s the scalpers and fanboys",
      "score": -1,
      "created_utc": 1751421451.0,
      "replies": []
    },
    {
      "id": "n0w7q6q",
      "author": "Sandwhale123",
      "body": "5 million suckers",
      "score": -3,
      "created_utc": 1751434470.0,
      "replies": []
    },
    {
      "id": "n0uvfnq",
      "author": "cursedbones",
      "body": "Consumers deserve all the shit they get.\n\nSeriously.",
      "score": -8,
      "created_utc": 1751415536.0,
      "replies": [
        {
          "id": "n0v3bz8",
          "author": "cooldaniel6",
          "body": "It’s only Reddit that’s upset. People love it and it drives Reddit crazy to see people enjoying it.",
          "score": 5,
          "created_utc": 1751418363.0,
          "replies": []
        },
        {
          "id": "n0vjkwp",
          "author": "The_BoogieWoogie",
          "body": "Boohoo?",
          "score": 1,
          "created_utc": 1751424074.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0usfjt",
      "author": "555deadoralive",
      "body": "Guess no one is listening to me when I say they shouldn’t get one.",
      "score": -6,
      "created_utc": 1751414472.0,
      "replies": []
    },
    {
      "id": "n0ucpoz",
      "author": "BarryBro",
      "body": "I thought the general consensus was it was too overpriced and now knowing the system isn't that great, im confused by the sales",
      "score": -18,
      "created_utc": 1751409244.0,
      "replies": [
        {
          "id": "n0ugfsn",
          "author": "julezblez",
          "body": "reddit opinions represent a small echo chamber",
          "score": 23,
          "created_utc": 1751410473.0,
          "replies": []
        },
        {
          "id": "n0ugzkq",
          "author": "ThisIsNotACryForHelp",
          "body": "The system is awesome. I have no idea what you've heard, but it's a great device",
          "score": 12,
          "created_utc": 1751410653.0,
          "replies": []
        },
        {
          "id": "n0ueejt",
          "author": "ninjapro98",
          "body": "The system is amazing, I wish it had more games but that’s just been this generation as a whole.",
          "score": 12,
          "created_utc": 1751409798.0,
          "replies": [
            {
              "id": "n0uh2wh",
              "author": "ThisIsNotACryForHelp",
              "body": "It's brand new. More games will come, in time",
              "score": 8,
              "created_utc": 1751410684.0,
              "replies": [
                {
                  "id": "n0uhq4d",
                  "author": "ninjapro98",
                  "body": "I really am hoping they announce a new 3D Mario soon",
                  "score": 1,
                  "created_utc": 1751410893.0,
                  "replies": [
                    {
                      "id": "n0uiyuf",
                      "author": "ThisIsNotACryForHelp",
                      "body": "Donkey Kong Bananza is being made by the team that made Odyssey. It looks like it's going to scratch that Mario itch, for the time being.",
                      "score": 9,
                      "created_utc": 1751411308.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n0uk1m3",
          "author": "crasy8s",
          "body": "Get off Reddit it’s melting your brain",
          "score": 8,
          "created_utc": 1751411666.0,
          "replies": []
        },
        {
          "id": "n0udc04",
          "author": "internetlad",
          "body": "The best I can say is it's a *huge* example of \"can't buy a house or car, but I can afford this thing and that will make me happy enough to get by\"",
          "score": 12,
          "created_utc": 1751409448.0,
          "replies": []
        },
        {
          "id": "n0ukawr",
          "author": "Caasi72",
          "body": "That's just your small internet bubbles opinion",
          "score": 4,
          "created_utc": 1751411753.0,
          "replies": []
        },
        {
          "id": "n0uldei",
          "author": "DandySlayer13",
          "body": "It's a great system and your library of Switch 1 titles carry over save states and all. A vast majority of that back catalog you have will also benefit from the performance uplift without needing a day one update and if they do get updates for the Switch 2 then they'll perform probably even better. \n\nI do not regret my purchase and I've only played MKW which is loads of fun and Super Mario Odyssey which looks and runs better than ever on my Switch 2! Donkey Kong Bananza on the 17th is gunna be a blast!!!",
          "score": 3,
          "created_utc": 1751412103.0,
          "replies": []
        },
        {
          "id": "n0uy4k5",
          "author": "Capitol62",
          "body": "The general consensus on Reddit*\n\nIt's a $50 markup after adjusting the Switch 1 price for inflation. The \"over priced\" complaints on Reddit were transparently bullshit as soon as they popped up.",
          "score": 2,
          "created_utc": 1751416510.0,
          "replies": []
        },
        {
          "id": "n0xfvu2",
          "author": "saborlatino",
          "body": "I stopped taking gamers seriously back in the day when they were complaining about dlc and PlayStation plus/ Xbox game pass. Sure you’ll have people stick true to a boycott, but the majority will talk a big game then fold faster than a lawn chair. You’ll stop getting surprised once you take everything gamers say with a grain of salt.",
          "score": 0,
          "created_utc": 1751457865.0,
          "replies": []
        },
        {
          "id": "n0uisi1",
          "author": "Polymersion",
          "body": "Scalpers.",
          "score": -4,
          "created_utc": 1751411248.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0ubkb6",
      "author": "OMBERX",
      "body": "and I've heard nothing but complaints about the thing.  Truly ridiculous",
      "score": -24,
      "created_utc": 1751408866.0,
      "replies": [
        {
          "id": "n0ucgtm",
          "author": "whereami1928",
          "body": "The people enjoying it are too busy to post online",
          "score": 43,
          "created_utc": 1751409163.0,
          "replies": []
        },
        {
          "id": "n0ucj6g",
          "author": "kytheon",
          "body": "Complaints are about the price, not the product",
          "score": 18,
          "created_utc": 1751409184.0,
          "replies": [
            {
              "id": "n0uuptz",
              "author": "sacktheory",
              "body": "the main complaint i see is about the screen. but i’m not a dork so idc. i use my switch 1 as a home console anyways. but it does suck that they gave haters something to complain about",
              "score": 1,
              "created_utc": 1751415281.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0uc6sm",
          "author": "H_Industries",
          "body": "Well I love mine so now you haven’t.",
          "score": 25,
          "created_utc": 1751409070.0,
          "replies": [
            {
              "id": "n0ue0z1",
              "author": "mcfuddlebutt",
              "body": "You were the first review I read, I've only heard people love theirs.",
              "score": 9,
              "created_utc": 1751409674.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0ugk7g",
          "author": "ThisIsNotACryForHelp",
          "body": "Everyone I know who has one loves it - including myself.",
          "score": 5,
          "created_utc": 1751410513.0,
          "replies": []
        },
        {
          "id": "n0ue8tn",
          "author": "3MATX",
          "body": "i got to play with one for a few days. I’m sold just looking for one available at retail. the nostalgia alone is worth it and upcoming games look pretty fun.",
          "score": 3,
          "created_utc": 1751409746.0,
          "replies": []
        },
        {
          "id": "n0uiz0x",
          "author": "Polymersion",
          "body": "Sure but the scalpers are still going to buy up the supply expecting enough people to want it",
          "score": 1,
          "created_utc": 1751411309.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0wwm1s",
      "author": "Prestigious_Cold_756",
      "body": "Just 1,5 million more in the 26 days after the 3,5 million in the first 4 days? That’s a lot of momentum lost. Shouldn’t they be at 26 million already instead of 5 million?! There’s like a billion people that play video games out there and they only convinced 5 million of them to buy a Switch 2?! That’s not a good look.",
      "score": 0,
      "created_utc": 1751448642.0,
      "replies": []
    },
    {
      "id": "n0upyoy",
      "author": "Chaos-Spectre",
      "body": "Starting to think that Nintendo fanboys is a form of kink at this point. For as much as Nintendo makes it clear they hate their fanbase, especially the portion that is creative and passionate, they somehow still keep selling an absurd amount of product. Like some sort of stockholm syndrome for a corpo",
      "score": -9,
      "created_utc": 1751413626.0,
      "replies": [
        {
          "id": "n0uqtqf",
          "author": "Key_Amazed",
          "body": "Bro you're posting this using a piece of tech made by a corporation 💀 It's hilarious seeing people pretend they're above it when you can name 100 different things you have or service you use that's produced and run by a corporation. There was a guy in the gaming thread calling everyone fanboy sheep and the dude literally had a recent comment where he bought a 2600$ graphics card 💀.\n\nIt's not a fanboy thing. That's always the argument of lowest common denominator brainlets who can't form a coherent, rational thought.",
          "score": 6,
          "created_utc": 1751413919.0,
          "replies": [
            {
              "id": "n0v2hw1",
              "author": "VinhoVerde21",
              "body": "“You criticize society, yet you participate in it”\n\nCmon, I don’t agree with the previous commenter, but that wannabe smartass argument has never made sense. You can criticize a system whist being in it. Pretty much impossible to not be in it nowadays.",
              "score": 1,
              "created_utc": 1751418066.0,
              "replies": []
            },
            {
              "id": "n0usofo",
              "author": "Chaos-Spectre",
              "body": "No shit I'm posting using a piece of tech made by a corpo. That misses the point. My complaint is in regards to people willing shelling out a shit ton of money to a corporation who actively is hostile to its own customers.\n\nNo where did I say I was above using corpo tech, thats not something you can realistically escape. But I'm not ignorant enough to actively give my money to a company that treats me like shit and actively destroys game preservation. I don't just mindlessly buy shit like it seems a lot of people do.\n\nIf it isn't fanboys, then its just willfully ignorant consumers. Either way, people keep giving nintendo money and nintendo keeps using that money to harm them or the industry, either directly or indirectly.",
              "score": 4,
              "created_utc": 1751414559.0,
              "replies": []
            },
            {
              "id": "n0yfl1s",
              "author": "Ogreislyfe",
              "body": "This is objectively a wrong argument to make against OP lol. It’s so childish, so, according to your words I can’t criticise the system I live in because I live in it. Therefore I need to keep my mouth shut. How would society progress if it didn’t criticise the very system we live in? Nintendo is a shitty company, it stomps creative ideas of fans, eliminates any attempt at preserving older, no longer supported game by Nintendo and is an all around price gouger. The systems they make though are stellar and one of a kind, the games are excellent and cater to a huge huge audience.",
              "score": 0,
              "created_utc": 1751469328.0,
              "replies": [
                {
                  "id": "n0yjbjv",
                  "author": "Key_Amazed",
                  "body": "Redditors again don't understand what objectively means. All the people calling the ones who bought the Switch 2 corporate shills consume corporate products on a regular basis. It's not childish. What's childish is the lack of self reflection you people have.",
                  "score": 1,
                  "created_utc": 1751470375.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n0uf69r",
      "author": "Rootfour",
      "body": "Eh I'll wait until it gets more than 50million units in record time to celebrate. Even pokemon gets like 25 million sales for a game that ticks all the boxes for a terrible and overpriced game except it's pokemon.",
      "score": -7,
      "created_utc": 1751410053.0,
      "replies": []
    },
    {
      "id": "n0usbod",
      "author": "drough08",
      "body": "With nothing to play on it.....good job try hards",
      "score": -2,
      "created_utc": 1751414435.0,
      "replies": []
    },
    {
      "id": "n0uy7bt",
      "author": "SpartanKwanHa",
      "body": "Bought mostly by scalpers",
      "score": -2,
      "created_utc": 1751416537.0,
      "replies": []
    },
    {
      "id": "n0w1vig",
      "author": "TheGlenrothes",
      "body": "All that with the skimpiest launch lineup of games in history. Thats how powerful the brand is.\n\nEDIT: all the Nintendo fans gaslighting themselves haha. Hey, I’m gonna buy one eventually too, but you can’t deny that this is the worst launch lineup in history.",
      "score": -3,
      "created_utc": 1751431611.0,
      "replies": [
        {
          "id": "n0wcx2o",
          "author": "GoldenRpup",
          "body": "To be fair, I literally only bought an Xbox One for Halo when it was an exclusive.",
          "score": 1,
          "created_utc": 1751437202.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0wo8wp",
      "author": "Averack",
      "body": "No one I know owns one or has rushed to buy one. \n\nWe all have the first gen",
      "score": -2,
      "created_utc": 1751443671.0,
      "replies": [
        {
          "id": "n0xe6s6",
          "author": "ScurryScout",
          "body": "They’re also out of stock in most stores and have been nearly impossibly to find in a lot of areas. \n\nSee how many of your friends start getting them once they become available.",
          "score": 1,
          "created_utc": 1751457193.0,
          "replies": [
            {
              "id": "n11wii5",
              "author": "Averack",
              "body": "I'm in Australia, they are in stock. I can order one now from a local store and have it ubered to me in under 90 minutes if i wanted to.",
              "score": 0,
              "created_utc": 1751507105.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0v5d8k",
      "author": "Truthgamer2",
      "body": "I’m not surprised, but I’m still disappointed",
      "score": -3,
      "created_utc": 1751419088.0,
      "replies": []
    },
    {
      "id": "n0uslgj",
      "author": "KAKYBAC",
      "body": "Don't forget that at the time the Dreamcast broke sales records.\n\nI didn't think Switch 2 would be selling this well but credit to Nintendo with their stock levels and release strategies to diffuse scalping.\n\nI still don't think it will come anywhere near to Switch 1 sales. In fact I would imagine it will taper off in 36 months.",
      "score": -6,
      "created_utc": 1751414530.0,
      "replies": [
        {
          "id": "n0wc9js",
          "author": "Particular-Diet-5147",
          "body": "Prob wont surpass switch 1 sales, but I genuinely think its still gonna break the 100mil mark pretty comfortably",
          "score": 3,
          "created_utc": 1751436846.0,
          "replies": []
        },
        {
          "id": "n0vdelw",
          "author": "Klaphood",
          "body": "This might be the best take. It's at least what I would expect for it to happen as well.\n\nIt's simply the huge success and popularity of the Switch that makes the 2 sell so well. Nothing else.\n\nThere's pretty much no other logical argument at hand anyways. There's literally just 2 games. It costs more than double of what a Switch 1 costs, and you have to pay on top for the older games to even run better on it, since those performance increases don't even come for free either. Also, most people have already played Zelda and stuff multiple times anyways.\n\nIt's the Switch (1) hype that created these sales. The console itself has nothing really special about it.",
          "score": -5,
          "created_utc": 1751421900.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0uxktw",
      "author": "plstouchme1",
      "body": "bunch of corporate dick sucking slaves",
      "score": -7,
      "created_utc": 1751416314.0,
      "replies": []
    },
    {
      "id": "n0vd6ox",
      "author": "Diligent-Soup-2176",
      "body": "95% of the Nintendo games are straight garbage. You get a few like mainstream games then it’s all like waifu girlfriend simulator crap and bizzaro Japanese games. Ain’t buying one for rocket league, my switch lite does ok though the Wi-Fi is absolute shit when I should be getting 500mbps level speed and my god do updates take forever.",
      "score": -6,
      "created_utc": 1751421824.0,
      "replies": [
        {
          "id": "n0vdhx7",
          "author": "Diligent-Soup-2176",
          "body": "I’m sure it’s their servers that suck but I mean my gaming computer will download a 20GB update in a couple minutes, as opposed to the switch which takes an hour.",
          "score": -9,
          "created_utc": 1751421930.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0x9frm",
      "author": "Nijindia18",
      "body": "Welp, anti consumerism works. We did it, we normalized their shitty practices. Yay.",
      "score": -1,
      "created_utc": 1751455189.0,
      "replies": []
    },
    {
      "id": "n0xakf6",
      "author": "YTAftershock",
      "body": "Disgusting",
      "score": -1,
      "created_utc": 1751455678.0,
      "replies": []
    },
    {
      "id": "n0utl4z",
      "author": "SexyTimeSamet",
      "body": "4 million of those were scalpers.",
      "score": -6,
      "created_utc": 1751414880.0,
      "replies": []
    },
    {
      "id": "n0usuzr",
      "author": "SkyrinGans",
      "body": "I didn’t plan on buying it but my friend snagged one for me. Super nice of him and I figure it would be tariff proof in case the price would increase by the holidays",
      "score": 0,
      "created_utc": 1751414623.0,
      "replies": []
    },
    {
      "id": "n0vkteu",
      "author": "MonkeyWithIt",
      "body": "Mario Kart World is a banger. But it's a little too easy to beat.",
      "score": 0,
      "created_utc": 1751424524.0,
      "replies": []
    },
    {
      "id": "n0vlt9s",
      "author": "BUNNIES_ARE_FOOD",
      "body": "Once Silksong drops I'll probably cave and get one",
      "score": 0,
      "created_utc": 1751424896.0,
      "replies": []
    },
    {
      "id": "n0vmf4c",
      "author": "twili-midna",
      "body": "It’s a great console, I’m loving mine",
      "score": 0,
      "created_utc": 1751425125.0,
      "replies": []
    },
    {
      "id": "n0wbuci",
      "author": "Fubianipf",
      "body": "Wow this is crazy...I don't have one but one of my friends have the Switch 1, and he's also considering getting a Switch 2. It brings him a lot of fun.",
      "score": 0,
      "created_utc": 1751436619.0,
      "replies": []
    },
    {
      "id": "n0wiyh4",
      "author": "Bdr1983",
      "body": "Remember when all of Reddit was convinced this would be a flop due to the price?",
      "score": 0,
      "created_utc": 1751440556.0,
      "replies": []
    },
    {
      "id": "n0wp1ci",
      "author": "ShrimpToothpaste",
      "body": "So I guess that makes $80 the new standard price for AAA games.",
      "score": 0,
      "created_utc": 1751444139.0,
      "replies": []
    },
    {
      "id": "n0x4d2a",
      "author": "kukaz00",
      "body": "I don't understand the appeal of Nintendo but hey, I don't have to.",
      "score": 0,
      "created_utc": 1751452832.0,
      "replies": []
    },
    {
      "id": "n0ybc6h",
      "author": "GOURMANDIZER",
      "body": "They’ve only hit those sales number because they had the stock, which most console release struggle to keep up with. \n\nThey only have the stock because it’s made with ancient 2000’s technology.",
      "score": 0,
      "created_utc": 1751468120.0,
      "replies": []
    },
    {
      "id": "n12efm4",
      "author": "AcherusArchmage",
      "body": "I guess no one was informed that the games aren't on the cartridges and they could get a bricked console at any time?",
      "score": 0,
      "created_utc": 1751513756.0,
      "replies": []
    },
    {
      "id": "n12exo0",
      "author": "jayspeedy24",
      "body": "Imagine bricking your hundreds of dollars console because you have a profile named Mario Moist Master.",
      "score": 0,
      "created_utc": 1751513960.0,
      "replies": []
    },
    {
      "id": "n0uk2om",
      "author": "Standard-Sand-3414",
      "body": "I don't know anyone that owns one...weird",
      "score": -7,
      "created_utc": 1751411676.0,
      "replies": []
    },
    {
      "id": "n0umvhw",
      "author": "None",
      "body": "🏴‍☠️",
      "score": -6,
      "created_utc": 1751412596.0,
      "replies": [
        {
          "id": "n0vnfwb",
          "author": "LongjumpingShip3657",
          "body": "You literally can't pirate the Switch 2\n\nLike seriously you just can't it's not like I'm against it but it just isn't possible and might not ever be possible the Switch only got cracked by a complete fluke in the launch model",
          "score": 3,
          "created_utc": 1751425518.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0ultxy",
      "author": "KN_Knoxxius",
      "body": "Why... It's an extremely limited scope console from a shit company that overprice their shit. \n\nFuck sakes. Get a steam deck or others like it. This shite is just stupid to support.",
      "score": -8,
      "created_utc": 1751412254.0,
      "replies": []
    },
    {
      "id": "n0uaif8",
      "author": "bgmedic",
      "body": "Not buying one on principle. They can block online access sure but, bricking the whole device that you own, means you don't own shit. \n\nWasn't planning on pirating games, just don't support bs.",
      "score": -29,
      "created_utc": 1751408524.0,
      "replies": [
        {
          "id": "n0ugop4",
          "author": "ThisIsNotACryForHelp",
          "body": "Every console does this if you pirate games.",
          "score": 12,
          "created_utc": 1751410553.0,
          "replies": []
        },
        {
          "id": "n0ubgsr",
          "author": "DeviantStrain",
          "body": "They just block online access tho, they don't brick your console. That's just misinformation",
          "score": 17,
          "created_utc": 1751408833.0,
          "replies": [
            {
              "id": "n0vbxdy",
              "author": "kurisu7885",
              "body": "Which also blocks access to any game you need one of those stupid key cards for.",
              "score": 1,
              "created_utc": 1751421389.0,
              "replies": []
            },
            {
              "id": "n0ud28t",
              "author": "bgmedic",
              "body": "\n\n\nAfter the Software is updated or changed (including without limitation in connection with an Update), any existing or future unauthorized modification of the Console or the Software, or the use of an unauthorized device in connection with the Console, may render the Console and/or the Software permanently unusable in whole or in part.\n\nMaybe I'm misunderstanding the text here?\n\nSource:\n\nhttps://en-americas-support.nintendo.com/app/answers/detail/a_id/68586/~/nintendo-switch%26nbsp%3B2%3A-user-agreement",
              "score": -11,
              "created_utc": 1751409358.0,
              "replies": [
                {
                  "id": "n0ueejx",
                  "author": "Jaberwocky23",
                  "body": "That's standard for any console, [example from PS5 ](https://www.playstation.com/en-us/legal/ps5-ssla/)\n\n\n>If SIE Inc determines that you have violated this Agreement's terms, SIE Inc may itself or may procure the taking of any action to protect its interests such as disabling access to or use of some or all System Software, disabling use of this PS5 system online or offline",
                  "score": 12,
                  "created_utc": 1751409798.0,
                  "replies": [
                    {
                      "id": "n0ujriz",
                      "author": "d4nowar",
                      "body": "PS5 bricks your whole console if you violate the terms! That's draconian and awful.",
                      "score": 6,
                      "created_utc": 1751411573.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n0udwur",
                  "author": "qualitypi",
                  "body": "This is the same TOS other consoles have, and the worst penalty any ever receives is revocation of online service. They're not gonna remotely brick your device.",
                  "score": 9,
                  "created_utc": 1751409637.0,
                  "replies": []
                },
                {
                  "id": "n0udxec",
                  "author": "DeviantStrain",
                  "body": "It's worded like that because it stops you from loading new virtual game cards. Actual bans have been issued (for using a MIG switch) and all that happened is their console was banned from connecting to online services.",
                  "score": 5,
                  "created_utc": 1751409641.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0ud8ko",
          "author": "hassis556",
          "body": "So that’s a lie. They block online access like they have been doing. Not brick consoles. That’s why no one takes you guys seriously. You always lie. That’s why it selling.",
          "score": 15,
          "created_utc": 1751409416.0,
          "replies": []
        },
        {
          "id": "n0vy5k0",
          "author": "Athrek",
          "body": "They just block online access. However the ban is a hardware ban, not just an account ban. So people are returning their banned switches and stores aren't realizing they are banned and reselling them. So people who buy used are getting screwed over for something outside of their control.",
          "score": 1,
          "created_utc": 1751429908.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0udrzs",
      "author": "etibek",
      "body": "Sets a bad precedent for the gaming community as a whole when they set outrageous prices and people will buy it no matter fucking what.\n\n100$ games coming within a few years\n\n700$+ consoles\n\n180$ for base controllers",
      "score": -14,
      "created_utc": 1751409593.0,
      "replies": [
        {
          "id": "n0ugb2n",
          "author": "Berkut22",
          "body": "And PC gaming is no better.\n\nI might have to give up on gaming altogether, once my PC ages out.",
          "score": 11,
          "created_utc": 1751410428.0,
          "replies": [
            {
              "id": "n0uji0k",
              "author": "d4nowar",
              "body": "PC gaming has the advantage of a dirt cheap backlog of games you can buy and enjoy.",
              "score": -2,
              "created_utc": 1751411486.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0ugvqu",
          "author": "ThisIsNotACryForHelp",
          "body": "I assume this isn't USD?",
          "score": 3,
          "created_utc": 1751410619.0,
          "replies": []
        },
        {
          "id": "n0ul6yy",
          "author": "Chrollo220",
          "body": "I see opinions online across subcultures and hobbies that buying overpriced goods, whether retail or reseller, is almost a badge of honor because it means you can afford it no matter what. Complaints about pricing are met with ridicule—“just say you’re broke bro.”",
          "score": 1,
          "created_utc": 1751412046.0,
          "replies": []
        },
        {
          "id": "n13foca",
          "author": "Yellowspawn",
          "body": "PS5 is already 800 € in my country, switch 2 being only around 500€ is actually super \"cheap\" here, so never really understood the uproar for the console price, I mean sure, it's alot, but so are the other consoles. (Although did order it from another country because it was even cheaper there)  \n  \n  \nOn top of that there's already been 90€ games (not collectors editions or anything, just the base games) on PS store for a while now so nintendo did/does not set this standard either.  \n  \nSo the price inreases have been a problem for a while now, nintendo did not create this problem, they just joined in on it, becoming a part of the problem. People have been buying games for outrageous prices for a while already. Welcome to 2025.",
          "score": 0,
          "created_utc": 1751532839.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0v5bsu",
      "author": "Truthgamer2",
      "body": "I’m not surprised, but I’m still disappointed",
      "score": -1,
      "created_utc": 1751419074.0,
      "replies": []
    },
    {
      "id": "n0wjcqu",
      "author": "GamingReviews_YT",
      "body": "So, everything about the build quality is worse, it could have the better features of the Switch 1 from before (which they purposefully didn’t include for no good reason), and there’s nothing new or innovative, all for an incredibly higher unwarranted cost and the risk of bricking the console.\n\nPeople are literally enabling exponential price increases and worse quality. Nintendo must be thrilled by this.",
      "score": -2,
      "created_utc": 1751440784.0,
      "replies": [
        {
          "id": "n0wrs9e",
          "author": "16ap",
          "body": "What’s worse about the build quality? I have the Switch from day one, bought the 2 on launch, and it’s all drastically better. Build quality is excellent. Much sturdier. Design improvements. And hardware-wise it’s ages ahead of the original.",
          "score": 5,
          "created_utc": 1751445797.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0v75xp",
      "author": "FleeRancer",
      "body": "I remember people were \"boycotting\" the new prices. I knew it wasn't going to amount to anything, but every time a dedicated fanbase threatens to boycott. I genuinely wonder what percentage of sales within the first few weeks are people who threatened to not buy.",
      "score": -1,
      "created_utc": 1751419730.0,
      "replies": []
    },
    {
      "id": "n0v9a5e",
      "author": "Rubixcubelube",
      "body": "NGL that new Donkey Kong game has me twitchin'. I've obstained from Nintendo after the palworld bullshit but man... they do publish some incredible games.",
      "score": -1,
      "created_utc": 1751420478.0,
      "replies": []
    },
    {
      "id": "n0wffkz",
      "author": "BrettAtog",
      "body": "Everything i’ve heard is that buyers are whelmed.",
      "score": -1,
      "created_utc": 1751438585.0,
      "replies": []
    },
    {
      "id": "n0y9e3p",
      "author": "SmokelessSubpoena",
      "body": "And the death to physical game ownership continues in the console world, very sad to see consumers buying into losing their ownership of the games they play, but I guess some small shiny upgrades, and downgrades _(lol can't wait for the \"OLED Switch 2\" which should have been standard at launch, but hey, how else does Nintendo do a whole console relaunch in ~1 year?)_ just make it all worth losing ownership of the games we play.\n\n\n\n\n\n\n\n (And don't reply with _BuT, but,  EULA, YoU NeVer OwNeD YoUr gAmE tO BeGin WitH!_, so tired of this nonsense being regurgitated and forced into the minds of gamers, as many gamers are being bought into this bullshit just to upgrade to the next series, which I'll say has _almost always made sense_, until now, we are going from Switch 1 GAME OWNERSHIP, to NO LONGER OWNING PHYSICAL GAMES, this should freak **everyone out**)\n\n\n\n\n\n\n\n\n\n\nThe console industry will die to the pcmasterrace if we continue heading this way, as everything will just devolve into accessories that a PC can utilize, and the modern PS5/Xbox are basically glorified PC's, so I guess it is what it is, Nintendo might as well join the club of screwing over every consumer and all of them to come.\n\n\n\n\n\n\n\n\n\nAnyways, back to my Switch 1 and owned games in hand, alongside my PC, best of luck Switch 2 gamers, I think this will be the last Nintendo system I ever buy, I'll leave getting ripped off royally to the younger generations, especially considering how eager they are to be screwed over by their rich overlords.",
      "score": -1,
      "created_utc": 1751467564.0,
      "replies": []
    },
    {
      "id": "n0ujgz4",
      "author": "tjb4",
      "body": "Yeah right lol",
      "score": -12,
      "created_utc": 1751411476.0,
      "replies": []
    }
  ]
}