{
  "post": {
    "title": "OnePlus 13 review: A focused flagship that ignores the AI hype",
    "author": "meenu_anon",
    "id": "1ikndsi",
    "score": 1135,
    "created_utc": 1739021705.0,
    "selftext": "",
    "num_comments": 208,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ikndsi/oneplus_13_review_a_focused_flagship_that_ignores/"
  },
  "comments": [
    {
      "id": "mbnudi3",
      "author": "thisischemistry",
      "body": "Houston, we have a problem:\n\n> very reasonable starting price of $900\n\nI don't enjoy this being made the new normal and being framed as reasonable! Yes, I don't need a focus on AI but this is the price of a higher-end phone *with* a focus on AI, if it's leaving off features then shouldn't the price be lower? Or is the article/device just BS?",
      "score": 713,
      "created_utc": 1739024692.0,
      "replies": [
        {
          "id": "mbolst3",
          "author": "Krogholm2",
          "body": "I miss the days where one plus was flagship competitive but way cheaper.",
          "score": 155,
          "created_utc": 1739033194.0,
          "replies": [
            {
              "id": "mbpfak5",
              "author": "PaddiM8",
              "body": "OnePlus Nord 4 is faster than the Pixel 9 Pro, has 4 years of major updates and 6 years of security updates, metal body, 5500 mAh battery, 120 Hz amoled, thin bezels, under display fingerprint sensor, 100W fast charging, touch works great when the display is wet, UFS 3.1, great haptics (much better than flagship samsungs). Mine was 350€. Flagships have a bit better cameras and wireless charging. That's mostly it.\n\n...it also has an IR blaster",
              "score": 64,
              "created_utc": 1739041674.0,
              "replies": [
                {
                  "id": "mbqxnb3",
                  "author": "whateverfloatsurgoat",
                  "body": "My Nord2 is still going strong, stronger than my old OnePlus 6 even (which saw a dramatic decrease in battery life after a couple of years). \n\nWhy bother with 900€ phones anyways ? I don't play on 'em, I just... Fucking communicate, I guess.",
                  "score": 15,
                  "created_utc": 1739058209.0,
                  "replies": [
                    {
                      "id": "mbtdmcp",
                      "author": "Cahootie",
                      "body": "I am writing this on my OnePlus 6. The battery is absolutely terrible these days, but it still works. I really should upgrade though.",
                      "score": 6,
                      "created_utc": 1739096475.0,
                      "replies": [
                        {
                          "id": "mbtpor8",
                          "author": "whateverfloatsurgoat",
                          "body": "I keep it as my backup phone and you're right, the battery life is miserable",
                          "score": 2,
                          "created_utc": 1739103121.0,
                          "replies": []
                        },
                        {
                          "id": "mbudklb",
                          "author": "liebereddit",
                          "body": "Can the battery be replaced?",
                          "score": 1,
                          "created_utc": 1739112693.0,
                          "replies": [
                            {
                              "id": "mbuepc5",
                              "author": "Cahootie",
                              "body": "Probably, but I doubt that it would be worth it on a phone from 2018.",
                              "score": 1,
                              "created_utc": 1739113075.0,
                              "replies": [
                                {
                                  "id": "mcwrxys",
                                  "author": "matthasaproblem",
                                  "body": "iFixit has reputable batteries for around $15 USD, and you can find back glass replacements that come with the tools needed and replacement adhesive for about the same price on eBay and Amazon.  Plenty of videos out there showing the replacement process and it isn't hard.  I've had my 6T since September of 2019, on its third battery and still going strong.",
                                  "score": 1,
                                  "created_utc": 1739632066.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mfbus0c",
                          "author": "201111533",
                          "body": "I'm reading this because I'm updating my 6 now too - I don't mind the battery life (I'm a stay at home mom and the charger is so fast that I can just charge it as needed) but now the camera is so slow that I can't get pictures of the kids anymore before they run away. I'll miss the headphone jack, though",
                          "score": 1,
                          "created_utc": 1740780138.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mbrdf8q",
                  "author": "shapeshiftsix",
                  "body": "Sounds like you just described the upgrade for my OP8.  Hate how fast the battery dies on it now.  It's been a good phone I can't complain",
                  "score": 6,
                  "created_utc": 1739063641.0,
                  "replies": [
                    {
                      "id": "mbsmziv",
                      "author": "becofthestars",
                      "body": "Same over here with my 6T. I've been dreading getting a Pixel, but hearing that the Nord is *actually good,* I'll have to look into it.",
                      "score": 3,
                      "created_utc": 1739081738.0,
                      "replies": []
                    },
                    {
                      "id": "mbtd6sl",
                      "author": "Aviel5990",
                      "body": "Switch the battery. I still use my 8 and I can't really justify an upgrade from it because it is so good",
                      "score": 2,
                      "created_utc": 1739096228.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbtanaw",
                  "author": "RaiKyoto94",
                  "body": "I have it. Amazing device for the money.",
                  "score": 4,
                  "created_utc": 1739094772.0,
                  "replies": []
                },
                {
                  "id": "mbrfxum",
                  "author": "Gadetron",
                  "body": "And the thing that basically makes every one of these great deals useless for me\n\n  \n\n\nDoes it support Verizon? Cuz that's the only thing available here\n\nAlso SD card support?",
                  "score": 4,
                  "created_utc": 1739064524.0,
                  "replies": []
                },
                {
                  "id": "mbvccjo",
                  "author": "HoidToTheMoon",
                  "body": "I just want a flagship of any line to bring back Google's rear fingerprint sensor. It's probably the biggest feature downgrade I've seen with absolutely zero tradeoff. Losing the headphone jack at least helped with waterproofing.",
                  "score": 3,
                  "created_utc": 1739122923.0,
                  "replies": [
                    {
                      "id": "mbvn2bk",
                      "author": "PaddiM8",
                      "body": "OnePlus has really fast under display fingerprint sensors though. Mine is faster than any traditional ones I've tried",
                      "score": 0,
                      "created_utc": 1739125894.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbt2yoe",
                  "author": "Neospecial",
                  "body": "Still using a OnePlus 5 and it's working fine with a slight noticable battery degradation. Unfortunately it'll be made useless this year due it's OS as mandatory to have apps will stop working on it due to safety reasons. \n\nSucks, means will have to waste money on something otherwise wouldn't need.",
                  "score": 0,
                  "created_utc": 1739090386.0,
                  "replies": [
                    {
                      "id": "mbt46o9",
                      "author": "speculatrix",
                      "body": "Can't you unlock the boot loader and install lineage?",
                      "score": 3,
                      "created_utc": 1739091079.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mc1ugl5",
              "author": "gam3r2k2",
              "body": "unfortunately this is the path taken by all brands seeking for brand awareness/recognition.  start at a lower price and steadily increase the price as time goes on.",
              "score": 2,
              "created_utc": 1739210165.0,
              "replies": []
            },
            {
              "id": "mbtoqqr",
              "author": "edis92",
              "body": "My oneplus 3 was fucking incredible, considering it cost half of what the s7 edge cost back then. The only things I didn't like were the subpar camera and the microphones absolutely sucked dick for some reason, they were basically unusable for sending voice recordings over whatsapp.",
              "score": 1,
              "created_utc": 1739102642.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbo678r",
          "author": "Marcoscb",
          "body": "Leaving AI off is a feature for me.",
          "score": 79,
          "created_utc": 1739028571.0,
          "replies": [
            {
              "id": "mboibms",
              "author": "whk1992",
              "body": "If privacy is a concern, then choosing OnePlus is comical.",
              "score": 16,
              "created_utc": 1739032182.0,
              "replies": [
                {
                  "id": "mbooimw",
                  "author": "lightningbadger",
                  "body": "But he said AI, not privacy",
                  "score": 49,
                  "created_utc": 1739033988.0,
                  "replies": []
                },
                {
                  "id": "mbtavli",
                  "author": "jcabia",
                  "body": "If privacy is a concern, don't get a device that listens to you all day and basically all of them do",
                  "score": 16,
                  "created_utc": 1739094905.0,
                  "replies": [
                    {
                      "id": "mbtgt9l",
                      "author": "Alienhaslanded",
                      "body": "Seriously. People who shit on Chinese devices when it comes to privacy are so stupid. It's all the same and frankly North American companies have much more use of your data in a harmful way than the Chinese government.",
                      "score": 19,
                      "created_utc": 1739098315.0,
                      "replies": [
                        {
                          "id": "mbtj6j5",
                          "author": "AsparagusDirect9",
                          "body": "They could oppress the Uyghurs with my data",
                          "score": 4,
                          "created_utc": 1739099654.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mbtna30",
                      "author": "Numerlor",
                      "body": "Difference is oneplus has a proven history of having telemetry of every action and forgetting to remove development backdoors from release builds",
                      "score": 4,
                      "created_utc": 1739101882.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbw6i5m",
                  "author": "ztpurcell",
                  "body": "You think American made phones don't data harvest you more than the Chinese? Keep sucking down that Kool aid kid ",
                  "score": 8,
                  "created_utc": 1739131321.0,
                  "replies": []
                },
                {
                  "id": "mbrobz0",
                  "author": "i7-4790Que",
                  "body": "what's comical is how bad your reading comprehension is.\n\nThey never even used the word privacy, their comment has no edit mark (at the time of my post, 10 hours after parent comment)\n\nHow do people like you even dress yourselves?  It must be a real challenge.",
                  "score": -16,
                  "created_utc": 1739067478.0,
                  "replies": [
                    {
                      "id": "mbsuz03",
                      "author": "nokeldin42",
                      "body": "Holy irony lmao. \n\nJust to spell it out - the \"If\" at the beginning is key. whk1992 is inferring from the comment that privacy might be the primary concern as it is for many people with AI (ref: Microsoft recall fiasco). \n\nIts a reasonable inference given the fuss surrounding AI in consumer tech (even predating consumer facing LLMs). Also for the fact that there really isn't much valid criticism of AI tools outside of privacy and data security (many people view other criticisms as \"old man yells at cloud\" fallcies). \n\nThis skill is called \"inferring from context\" and is a critical part of reading comprehension in the real world.",
                      "score": 7,
                      "created_utc": 1739085968.0,
                      "replies": [
                        {
                          "id": "mbusvys",
                          "author": "dakoellis",
                          "body": "My issue with the Ai crap is that it takes resources and adds nothing of value. I don't really have the other concerns you mentioned on a phone specifically because they can already get all that info without it",
                          "score": 1,
                          "created_utc": 1739117415.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mbsn69z",
                      "author": "TopAnonomity",
                      "body": "Yeah he can’t read but is it that serious brodie",
                      "score": 5,
                      "created_utc": 1739081830.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbojhon",
              "author": "Mobbo2018",
              "body": "This!",
              "score": -13,
              "created_utc": 1739032524.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbo48ze",
          "author": "ultraforce47",
          "body": "I’m not an Apple fanboy, but the iPhone 16 is $799 and is criticized for pricing. But flagship Android phones seem to be immune to criticism about pricing despite costing the same if not more. It’s a double standard that I’ve noticed",
          "score": 144,
          "created_utc": 1739027974.0,
          "replies": [
            {
              "id": "mbo89p5",
              "author": "Ajreil",
              "body": "Buying an Android flagship feels like more of a choice because there are perfectly usable $200-400 phones. Apple doesn't really have a budget option.\n\nFlagship technology trickles down into the budget space. I don't mind letting the rich people play with tech while it's still expensive.",
              "score": 114,
              "created_utc": 1739029196.0,
              "replies": [
                {
                  "id": "mbobq7d",
                  "author": "Chatek",
                  "body": "They have its called SE",
                  "score": 22,
                  "created_utc": 1739030234.0,
                  "replies": [
                    {
                      "id": "mbod99l",
                      "author": "Ajreil",
                      "body": "iPhone SE: $429\n\nSamsung A15 5G: $200\n\nI'm sure the iPhone is a better experience but $429 is mid-range, not budget",
                      "score": 83,
                      "created_utc": 1739030688.0,
                      "replies": [
                        {
                          "id": "mbok4lk",
                          "author": "TeutonJon78",
                          "body": "Even the A35 5G is MSRP $399, and on sale for $325 right now. And is from March 2024, not 2022.\n\nThere is a new SE coming, but also the A36.",
                          "score": 20,
                          "created_utc": 1739032708.0,
                          "replies": [
                            {
                              "id": "mbona8j",
                              "author": "kamilo87",
                              "body": "I like the upcoming new SE. if there was a bigger screen one would be perfect for me. I only use the 1x lens.",
                              "score": 3,
                              "created_utc": 1739033626.0,
                              "replies": [
                                {
                                  "id": "mbpe05u",
                                  "author": "thisischemistry",
                                  "body": "The SE should continue the small form-factor it had in past versions, this new one you might as well get the base iPhone since it's the same size anyways.",
                                  "score": 3,
                                  "created_utc": 1739041303.0,
                                  "replies": [
                                    {
                                      "id": "mbpefjt",
                                      "author": "kamilo87",
                                      "body": "You missed the point that this phone is going to be cheaper than base. Also, all the SE has been using old tech for the screens, not just bc is the smallest one.",
                                      "score": 1,
                                      "created_utc": 1739041425.0,
                                      "replies": [
                                        {
                                          "id": "mbpgndx",
                                          "author": "thisischemistry",
                                          "body": "I did not miss the point. You missed the point that it was the only small phone-factor available and now that's going away. Apple will have no options for anyone who prefers a smaller phone, it's large or larger.\n\nThe price is a separate concern but they could still do a low-cost phone in a small phone factor, in fact it would probably be even lower cost than a larger phone.",
                                          "score": 1,
                                          "created_utc": 1739042066.0,
                                          "replies": [
                                            {
                                              "id": "mbph71t",
                                              "author": "kamilo87",
                                              "body": "You’re right. Apple is doing the bare minimum with this phone.",
                                              "score": 1,
                                              "created_utc": 1739042223.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mbq6nrk",
                              "author": "whoever81",
                              "body": " iPhone SE 4: $499",
                              "score": 3,
                              "created_utc": 1739049700.0,
                              "replies": [
                                {
                                  "id": "mbqaau4",
                                  "author": "TeutonJon78",
                                  "body": "Yeah, definitely not budget.",
                                  "score": 1,
                                  "created_utc": 1739050789.0,
                                  "replies": [
                                    {
                                      "id": "mbswyjo",
                                      "author": "noobqns",
                                      "body": "It's functionally the iphone 16 without the ultrawide lens (and also older selfie camera design) for $499 vs $799   \n\nIt even has the a18 chip compared to iphone 14,15 which had to use past year's",
                                      "score": 1,
                                      "created_utc": 1739087057.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mbqm2x7",
                                      "author": "whoever81",
                                      "body": "Yup. And guess what, In Europe €599. That's approaching flagship territory. Hard pass.",
                                      "score": 1,
                                      "created_utc": 1739054440.0,
                                      "replies": [
                                        {
                                          "id": "mbs6nis",
                                          "author": "linuxares",
                                          "body": "Iphone SE gen 3 and iPhone 14 have been pulled from the market in Europe. It's only spare stocks left now. They aren't allowed to be imported anymore because of the usb c law.\n\nSo it's gonna be interesting to see if SE 4 or as some rumors also call it iPhone 16E will be budget at all.",
                                          "score": 1,
                                          "created_utc": 1739074374.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mbpz5wt",
                          "author": "ThinkExtension2328",
                          "body": "Did you price in the years of software updates and security patches ?",
                          "score": 1,
                          "created_utc": 1739047474.0,
                          "replies": []
                        },
                        {
                          "id": "mbp73fj",
                          "author": "billbixbyakahulk",
                          "body": "If people aren't complaining at least a little about Apple's phone prices, then Apple is doing something wrong. It's an aspirational brand with part of the appeal evoking envy in people who can't or won't spend for one.\n\nedit: looks like I found the envious ones",
                          "score": -8,
                          "created_utc": 1739039348.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mbqsf3m",
                      "author": "val252",
                      "body": "So I’m so old that I have to tell you my story. I’ve had the google phones science they were called the galaxy google phones. For Samsung. Had it. Great phone. Then they got to nexus. Had it. Nice phone. Then had all the straining pixels. Nice phones. But then I switched to an iPhone. I’ve also had the first generation iPhone. Between all those  google phones.  In my home. With an iPad and an MacBook Pro this phone is the best. I’ve had an iPhone 11 for the last 5 years and now I’ve switched to a 16. Call it what you want but it’s a phone that you can use it for longer than 5 years if you change the battery. Overall experience ? Better than google.",
                      "score": -1,
                      "created_utc": 1739056478.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbr3h22",
                  "author": "Deftek178",
                  "body": "You can buy this phone for 200 guaranteed.. Just wait 2 years. People are so obsessed with the shiny... I've never spent more than $200 on a phone and never will. I'm currently using an s21+ I bought for $150 like 2 years ago. I know these companies like to scare people with intentionally ending security updates to try to give these phones a fake (conveniently determined by them) lifespan but there are ways to fight back against that scam.",
                  "score": 1,
                  "created_utc": 1739060215.0,
                  "replies": [
                    {
                      "id": "mbsb274",
                      "author": "Eurotrashable",
                      "body": "Agree! But i think is worth getting a flagship and be good for 4-6 years though . I've spent 200-400$ and 2 years later get another one... my s22 ultra is still rocking! Definitely skip 25...",
                      "score": 1,
                      "created_utc": 1739076208.0,
                      "replies": [
                        {
                          "id": "mbtema6",
                          "author": "Revenge_of_the_User",
                          "body": "my phone is over a decade old, some samsung thing. \n\nIve replaced the battery once. I'd do it again as the battery life is abysmal again, but ive cracked the screen and the software is starting to break. \n\nSo I'll probably get a new one soon out of necessity, or id just keep this thing.",
                          "score": 2,
                          "created_utc": 1739097048.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mbpjbsv",
                  "author": "DieuMivas",
                  "body": "But isn't a choice between a Samsung and an iPhone already a choice? No one is forcing people to buy an iPhone. \n\nIf I want a jacket or something from a luxury brand but it's too expensive, I will just buy a less expensive jacket from another brand and I would see no reason to complain about the fact that that luxury brand don't have less expensive jackets.",
                  "score": -1,
                  "created_utc": 1739042835.0,
                  "replies": [
                    {
                      "id": "mbplr1v",
                      "author": "snil4",
                      "body": "Some people are stuck way too hard in the apple ecosystem, there's also the thing with the green bubbles which I'm so happy to live in a country where everybody uses WhatsApp.",
                      "score": 1,
                      "created_utc": 1739043527.0,
                      "replies": []
                    },
                    {
                      "id": "mbsc2ln",
                      "author": "Eurotrashable",
                      "body": "Naaah ... different ecosystem blah blah... is not necessary a \"look what i got\"  between samsung and iphone... i have an lg v60 who is still better in many ways then my s22 ultra and people give me a hard time about it because is \"just \" an Lg! Samsung spend billions on marketing LG nothing and goes bankrupt!",
                      "score": 0,
                      "created_utc": 1739076644.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbq4dzv",
                  "author": "markianw999",
                  "body": "You mean stupid ppl",
                  "score": -1,
                  "created_utc": 1739049025.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbp6oyt",
              "author": "Newwavecybertiger",
              "body": "The base 16 is 800. Pro or max or storage versions are more. Base model camera for example is not competitive at all. Not saying it's a good argument but that's where the comparison comes from.",
              "score": 8,
              "created_utc": 1739039232.0,
              "replies": []
            },
            {
              "id": "mbpty4z",
              "author": "swagglepuf",
              "body": "An $800 dollar phone in 2025 that is stuck with a 60hz screen deserves to be criticized. Especially when sub $300 android phones have 120hz.",
              "score": 9,
              "created_utc": 1739045930.0,
              "replies": []
            },
            {
              "id": "mbobbnd",
              "author": "Diplo_Advisor",
              "body": "I'm not American but in my country, iPhone 16 is priced much higher than some flagship killers. Yet, iPhone 16 screen is only 60hz refresh rate. A low mid-range Android today comes with 120hz refresh rate.",
              "score": 39,
              "created_utc": 1739030112.0,
              "replies": [
                {
                  "id": "mboxeek",
                  "author": "None",
                  "body": "Refresh rate really doesn’t matter if you are just web browsing, streaming or using social media apps. If you are playing games where you need that refresh rate you shouldn’t be on a phone lol\n\nThere are points to be made. But that should not be a selling point for really anyone.\n\n\n“Usages like office work, editing photos or standard video content for YouTube, and slower-paced games don’t benefit significantly from a high refresh rate, and a 60Hz display will likely work well for you.”\nhttps://www.rtings.com/monitor/learn/60hz-vs-144hz-vs-240hz\n\nSince I’m being downvoted. Here. It’s objectively not that important for people who just scroll through social media. If you want to have a higher refresh rate to have a higher refresh rate go ahead. It’s just not that big of a deal. It’s like having a car that can go 90mph or 120mph. You’ll never really need to go that fast so either is fine. \n\nIf you are trying to play competitive games on a phone you are already at a disadvantage so why even play them on that device instead of a pc/console",
                  "score": -22,
                  "created_utc": 1739036576.0,
                  "replies": [
                    {
                      "id": "mbq0ng2",
                      "author": "memeita",
                      "body": "People want it because it’s nice. You don’t really need your display to be over 400 ppi of pixel density or the back of the phone to be made out of metal and glass, but they’re much nicer than a low res display or a plastic back.",
                      "score": 14,
                      "created_utc": 1739047914.0,
                      "replies": []
                    },
                    {
                      "id": "mbq3s8x",
                      "author": "-Badger3-",
                      "body": ">\tRefresh rate really doesn’t matter if you are just web browsing, streaming or using social media apps.\n\n*Hard* disagree. People on their phones do a lot of reading while scrolling, and the eye strain relief you get from reading smoothly moving text on a high refresh display is alone enough of a justification.\n\nLike I don’t game on my phone at all and I’m never going back to a 60hz display.",
                      "score": 20,
                      "created_utc": 1739048846.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbr3osv",
                  "author": "Deftek178",
                  "body": "What could you possibly need 120hz refresh on a phone? It's not a gaming monitor man.",
                  "score": -19,
                  "created_utc": 1739060289.0,
                  "replies": [
                    {
                      "id": "mbrftew",
                      "author": "BrokenDownMiata",
                      "body": "It is literally just a nicer, smoother experience.\n\nNot necessary, but a nice little addition.",
                      "score": 13,
                      "created_utc": 1739064479.0,
                      "replies": []
                    },
                    {
                      "id": "mbusswz",
                      "author": "ItsColorNotColour",
                      "body": "1. Mobile is the biggest gaming market, larger than the entire console and PC market combined\n\n2. You don't need anything, a 100 dollar phone is sufficient for anyone. But when you are paying 800 dollars in 2025, you should expect better specifications.",
                      "score": 1,
                      "created_utc": 1739117389.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbo9p55",
              "author": "themightychris",
              "body": ">immune to criticism about pricing despite costing the same if not more. It’s a double standard that I’ve noticed\n\nit's because there are tons of Android phones available at a wide spread of prices...",
              "score": 21,
              "created_utc": 1739029622.0,
              "replies": [
                {
                  "id": "mbofqjt",
                  "author": "ultraforce47",
                  "body": "> flagship",
                  "score": -2,
                  "created_utc": 1739031423.0,
                  "replies": [
                    {
                      "id": "mbp6vdv",
                      "author": "OniExpress",
                      "body": "Yes, flagship, not \"the only ship\". That's why the conversation is different.",
                      "score": 9,
                      "created_utc": 1739039283.0,
                      "replies": []
                    },
                    {
                      "id": "mbrnqum",
                      "author": "i7-4790Que",
                      "body": "you keep proving why you don't understand the distinction and why you've deluded yourself into thinking it's a double standard when it's not.  \n\nYou're definitely a fanboy.",
                      "score": 5,
                      "created_utc": 1739067269.0,
                      "replies": []
                    },
                    {
                      "id": "mbofv3h",
                      "author": "themightychris",
                      "body": "yes it matters less if the flagship is really expensive if there are lots of other options",
                      "score": 18,
                      "created_utc": 1739031460.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbtf62d",
              "author": "tejanaqkilica",
              "body": "The OnePlus 13 is in the same category as the iPhone 16 Pro Max which is 1200$.\n\nIt's quite cheaper in comparison.",
              "score": 3,
              "created_utc": 1739097372.0,
              "replies": [
                {
                  "id": "me6ybhe",
                  "author": "ultraforce47",
                  "body": "16 Plus is the same screen size at 6.7” and is the same price as the OP13. 16 Pro Max is better than OP13 but 16 Plus alone is better than  the OP13 🤷‍♂️",
                  "score": 1,
                  "created_utc": 1740244086.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbtu3nt",
              "author": "alidan",
              "body": "only phone im willing to give passes to are ones that made cameras first and foremost on their mind, like the one that used a full frame sensor, or the one that put good optics on a 50mp sensor for the first time, or samsung's note where you get a digital sketch book along with a phone, damn near everything else, justifies its price because other companies charge that much.\n\nas for iphone, I use neko and mihon, they make apple products non viable from the get go.",
              "score": 2,
              "created_utc": 1739105237.0,
              "replies": []
            },
            {
              "id": "mbosar7",
              "author": "The_Pandalorian",
              "body": "You're literally responding to criticism of a flagship Android phone price by complaining about Android flagship phone prices being immune from criticism.",
              "score": 3,
              "created_utc": 1739035090.0,
              "replies": []
            },
            {
              "id": "mboswg9",
              "author": "shadeOfAwave",
              "body": "You're literally replying to a comment criticizing the price",
              "score": 2,
              "created_utc": 1739035267.0,
              "replies": []
            },
            {
              "id": "mbo7hjz",
              "author": "None",
              "body": "I’m an iPhone user, but don’t most android phones have significantly higher end features than iPhone ?",
              "score": 7,
              "created_utc": 1739028962.0,
              "replies": [
                {
                  "id": "mboav4a",
                  "author": "poorperspective",
                  "body": "I think it because Android gives a much wider spread of options for pricing, but also really it’s expressed in more or less features. You can either pay high for all the features with possibly some plus of the current flagship IPhone, or you can easily by a newer but still feature less model. \n\nApple focuses on releasing a new product yearly with upgrades. You can also buy a used IPhone, which has similar specs and features for a lower price. \n\nIt’s just two separate marketing strategies. Apple like other luxury goods focuses on small yearly updates, similar to a car model that is updated yearly. Apple would just suggest buying an older model. Of course they are going to try to up-sale you, but everyone is marketing. Almost all apple products follow this model. \n\nAndroid phone companies focuses on providing a variety of options. You can buy a “new” phone that may actually be a couple of years behind on the latest features of smart phones. They also market many other aspects that hit the variety mark. \n\nConsistency is a huge market appeal to apple products. It’s why certain design elements are evident that they focus on this aspects. Yes, they may not have the latest features, but they aren’t going to add a feature that may be just a fad. Updates to their OS tends to be incremental and well laid out. I cannot say the same experience with Android products. So it often just comes down to what people want. Consistency or options.",
                  "score": 6,
                  "created_utc": 1739029974.0,
                  "replies": []
                },
                {
                  "id": "mbo9rvs",
                  "author": "TheSoCalledExpert",
                  "body": "What are these “higher end features” you speak of?",
                  "score": 1,
                  "created_utc": 1739029645.0,
                  "replies": [
                    {
                      "id": "mboa5ax",
                      "author": "None",
                      "body": "Just off top of my head, most android phones have better quality screens with higher resolutions and refresh rates. Often android phones have more storage and more ram. \n\nMy point was more that an iPhone and android phone that’s re the same price, the android is usually the better value because you get more.",
                      "score": 14,
                      "created_utc": 1739029757.0,
                      "replies": [
                        {
                          "id": "mboy4to",
                          "author": "calcium",
                          "body": "With the exception of their refresh rates, Apple's screens tend to be some of the best in the industry.",
                          "score": 1,
                          "created_utc": 1739036787.0,
                          "replies": []
                        },
                        {
                          "id": "mboiov7",
                          "author": "ultraforce47",
                          "body": "Does more RAM really matter when iPhone manages RAM better and the performance is just as fast if not faster?",
                          "score": -10,
                          "created_utc": 1739032290.0,
                          "replies": [
                            {
                              "id": "mboj5gz",
                              "author": "OffbeatDrizzle",
                              "body": "source? your ass?",
                              "score": 9,
                              "created_utc": 1739032425.0,
                              "replies": [
                                {
                                  "id": "mbos7nr",
                                  "author": "FaxxMaxxer",
                                  "body": "It’s a simple fact. iOS has always been better optimized, and able to deliver a smoother and snappier experience with as little as half the RAM. Not a surprise given that Apple makes both the hardware and software, and can tailor iOS for just a handful of processors running their silicon. \n\n[Even Android Authority recognizes this](https://www.androidauthority.com/ios-vs-android-1068950/).",
                                  "score": -9,
                                  "created_utc": 1739035065.0,
                                  "replies": [
                                    {
                                      "id": "mbovcx7",
                                      "author": "KiW3",
                                      "body": "> Even Android Authority recognizes this.\n\nYour source briefly mentions that the apple phone they tested had a lower amount of ram compared to the other phones in the test. But the actual test (which is not even directly the source you linked) only tests their CPU speed. So the actual source has nothing on whether their ram is actually performing better.",
                                      "score": 5,
                                      "created_utc": 1739035984.0,
                                      "replies": [
                                        {
                                          "id": "mboycwm",
                                          "author": "FaxxMaxxer",
                                          "body": "We’re talking about an observable user experience, just bc it’s something that hasn’t been scientifically tested in a lab and peer reviewed doesn’t make it less true. Android Authority themselves plainly state it, are they lying? \n\nWould you not expect the world’s richest company, who designs their own leading edge silicon to run specifically with their own code to be more efficient at delivering a more efficient end product? I think so many of y’all are up your own asses about your choice in consumer products you cannot come to terms with the simple fact that iOS is as fast or faster with half the RAM. It’s honestly kinda pathetic.",
                                          "score": -1,
                                          "created_utc": 1739036851.0,
                                          "replies": [
                                            {
                                              "id": "mbp1nak",
                                              "author": "KiW3",
                                              "body": ">  Android Authority themselves plainly state it, are they lying?\n\nMy brother they are talking about CPU speed in the test the article uses as it's basis for stating \"iOS is generally faster and smoother\".  You are misquoting them.\n\nI had heard that wars between android and apple fanboys would easily get heated, but is it funny to see it for the first time myself. I merely pointed out that the source you produced did not support your claim about ram. Are you sure you shouldn't look inwards when you afterwards make comments like \"it's pathetic\" when we are merely having a discussion.",
                                              "score": 4,
                                              "created_utc": 1739037786.0,
                                              "replies": []
                                            },
                                            {
                                              "id": "mbq1j8z",
                                              "author": "OffbeatDrizzle",
                                              "body": "> We’re talking about an observable user experience, just bc it’s something that hasn’t been scientifically tested in a lab and peer reviewed doesn’t make it less true\n\nso it's anecdotal then... lmao\n\ndid you ever try turning your animation speed up / off? everyone always moaned that android felt far snappier when you changed this setting\n\nthat's just one example of a setting completely blinding you to the fact that there's little to no difference\n\nhonestly, kinda pathetic",
                                              "score": 1,
                                              "created_utc": 1739048176.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mbodgjz",
                          "author": "lolmagic1",
                          "body": "The standard iphone has a better screen that Samsung ultra 25",
                          "score": -17,
                          "created_utc": 1739030748.0,
                          "replies": [
                            {
                              "id": "mboh9jy",
                              "author": "MattBrey",
                              "body": "The standard iphone has 60hz and for that alone should not even be considered an option. What do you mean better screen that the ultra??",
                              "score": 19,
                              "created_utc": 1739031870.0,
                              "replies": [
                                {
                                  "id": "mbootxh",
                                  "author": "lolmagic1",
                                  "body": "It's a generation newer",
                                  "score": -7,
                                  "created_utc": 1739034078.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mboiadq",
                              "author": "trichomesRpleasant",
                              "body": "iPhone can't touch the Z Fold 6 though, they've fallen behind",
                              "score": 1,
                              "created_utc": 1739032172.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbpc7mq",
              "author": "Alienhaslanded",
              "body": "Android phones use bigger number hardware. OnePlus in particular always uses several generations of hardware ahead of the competition. I still use my 2020 OnePlus phone and it puts more modern phones to shame.\n\n\nThat being said, since they switched from oxygen OS to color OS they ruined many things about the usability of their phones. They also jacked up their prices to unreasonable amounts, even with the most cutting edge hardware. Their whole schtick was best hardware for reasonable prices, but this doesn't follow that moto.",
              "score": 2,
              "created_utc": 1739040791.0,
              "replies": []
            },
            {
              "id": "mbqasx6",
              "author": "MainStCool",
              "body": "Which iPhone 16 is $799? Pro max with 256G is $1,200, that’s a better comparison",
              "score": 1,
              "created_utc": 1739050938.0,
              "replies": []
            },
            {
              "id": "mbt1999",
              "author": "Shiningc00",
              "body": "iPhone 16 512GB is $999",
              "score": 1,
              "created_utc": 1739089435.0,
              "replies": []
            },
            {
              "id": "mbu22vi",
              "author": "Curse3242",
              "body": "Not immune to me. This has twisted my personal view on Apple & Android. Some good phones are coming out but price wise the parity is not there anymore. iOS is also slowly improving anyways. So at this point I'm not too fussed about the idea of ever owning a Apple\n\nThe only thing keeping me on android is side loading",
              "score": 1,
              "created_utc": 1739108564.0,
              "replies": []
            },
            {
              "id": "mbofezq",
              "author": "deSuspect",
              "body": "Becouse with android I'm not limited to what apple deems safe and I can actually control everything on my phone.",
              "score": 1,
              "created_utc": 1739031329.0,
              "replies": []
            },
            {
              "id": "mbrdbam",
              "author": "RealDickGrimes",
              "body": "Because apple use shitty specs compared to android, and their os is bullshit",
              "score": 1,
              "created_utc": 1739063602.0,
              "replies": []
            },
            {
              "id": "mbos5ck",
              "author": "DudebuD16",
              "body": "Um, google has been heavily criticised for jacking up their prices, as have Samsung.",
              "score": 0,
              "created_utc": 1739035046.0,
              "replies": []
            },
            {
              "id": "mbpn1j9",
              "author": "itsdrewmiller",
              "body": "iPhone 16 is not a flagship phone.",
              "score": 0,
              "created_utc": 1739043897.0,
              "replies": [
                {
                  "id": "mbut9sj",
                  "author": "ItsColorNotColour",
                  "body": "120hz is not a flagship feature.",
                  "score": 0,
                  "created_utc": 1739117529.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mboyvta",
              "author": "jamesrave",
              "body": "Apple will never escape the criticism of doing exactly what other manufacturers do. \n\nOnePlus 13: A focused flagship ship that ignores the AI hype at a reasonable price \n\niPhone 16: what kind of over priced garbage phone launches without any AI. \n\nThey can’t win.",
              "score": -4,
              "created_utc": 1739037000.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbo7zuz",
          "author": "ThatLaloBoy",
          "body": "The closest competitor to this is probably the S25+ and that’s selling at $999. And I’d argue that the OnePlus 13 offers more for the price. It managed to be slightly thinner and lighter than last year’s phone while packing in a much bigger battery, better cooling for the SoC, and pretty much the latest tech for everything except the camera. That SUPERVOCC charger is amazing for charging your phone in less than 20 minutes.\n\nAnd for anyone that doesn’t mind last year’s SoC and camera to save money, the 13R looks like a much better value offering a smilar experience at $599.",
          "score": 16,
          "created_utc": 1739029114.0,
          "replies": []
        },
        {
          "id": "mbowmn9",
          "author": "Baron_of_Berlin",
          "body": "Start with - who the fuck cares about ai. And it's just garbage software that can be loaded or removed after the fact. \n\nThe cost is 90% HARDWARE. So the appropriate Q is - is the hardware here comparable to other flagship phones and they're low balling price? Or is it on some vague linear scale of price vs hardware capacity of other flagships? Eg about 50% as good.",
          "score": 8,
          "created_utc": 1739036354.0,
          "replies": []
        },
        {
          "id": "mbuci8q",
          "author": "blackscales18",
          "body": "There's a debian phone that's only 500 and it has a headphone jack and removable battery, so 900 is pretty rough",
          "score": 2,
          "created_utc": 1739112332.0,
          "replies": []
        },
        {
          "id": "mbq8pdc",
          "author": "blastradii",
          "body": "U.S. consumers are getting shafted in pricing here. (Trade war collateral damage). It’s about $600 if you buy in China.",
          "score": 2,
          "created_utc": 1739050312.0,
          "replies": [
            {
              "id": "mbv47ey",
              "author": "GPO1",
              "body": "We pay 1000 dollars for the 256GB version in the EU. What trade war?",
              "score": 1,
              "created_utc": 1739120634.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbrs5tk",
          "author": "HanzoNumbahOneFan",
          "body": "The new Redmagic 10 Pro phone is actually a reasonable starting price of $650 and seems to hit all of the flagship checks. Only downside to it I can see is the lack of waterproofing cause of the fan on the side. But there is no front camera cutout, and the bezzles are super thin still. There's no camera bumps on the back so the phone is completely flat all the way around. Has an audio port. 7000mAH battery. If I was in the market for a new phone, that'd be what I go with. Even if it's a \"gaming\" phone, and I don't play many games on my phone, it hits all of my checkboxes I want in one anyways.",
          "score": 1,
          "created_utc": 1739068854.0,
          "replies": [
            {
              "id": "mbrvr7d",
              "author": "thisischemistry",
              "body": "That one is very interesting for sure. I appreciate someone going in a different direction and making some bold choices. It's certainly not the phone for me but I hope it's the phone for someone!",
              "score": 1,
              "created_utc": 1739070172.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbsaor1",
          "author": "MountainAny320",
          "body": "Article is bullshit as they clearly were hyping about it's AI capabilities before its launch.",
          "score": 1,
          "created_utc": 1739076049.0,
          "replies": []
        },
        {
          "id": "mbstar4",
          "author": "bpmdrummerbpm",
          "body": "Define “features”.",
          "score": 1,
          "created_utc": 1739085072.0,
          "replies": []
        },
        {
          "id": "mbutwxd",
          "author": "ajpiko",
          "body": "This is a relatively low price for high end phones, this is not a budget phone?",
          "score": 1,
          "created_utc": 1739117718.0,
          "replies": []
        },
        {
          "id": "mbz5zbw",
          "author": "dekacube",
          "body": "S25 Ultra starts at $1,299\n\n[https://www.samsung.com/us/smartphones/galaxy-s25-ultra/buy/galaxy-s25-ultra-512gb-unlocked-sm-s938uakexaa/](https://www.samsung.com/us/smartphones/galaxy-s25-ultra/buy/galaxy-s25-ultra-512gb-unlocked-sm-s938uakexaa/)",
          "score": 1,
          "created_utc": 1739168504.0,
          "replies": []
        },
        {
          "id": "mch4ldw",
          "author": "iLikeTurtuls",
          "body": "If you upgrade year over year, yeah, sucks. But $300 a year for 3 years, eh. Also 6 years of software updates means $150 a year. I really think that $1000 mark is where we have to really question WHY. Example, ultra phones.\nBut if price is the issue, that’s why we have the 13r",
          "score": 1,
          "created_utc": 1739410414.0,
          "replies": []
        },
        {
          "id": "mfwkpu7",
          "author": "edwbuck",
          "body": "I'm a bit late to the party, but remember that $900 today is nearly $750 five years ago.  And yes, $750 was ridiculous for a phone back then, but there were plenty of top-end phones in that price range.\n\n\\* 2020 One Plus 8 Pro - $899\n\n\\* 2020 Samsung Galaxy Note - $999\n\n\\*  2020 Google Pixel 4 - $799\n\nThe main problem isn't the price, it's that the earnings we all take home are just not enough for these \"small luxuries\" to be considered worth the value.  Back in the day, the wow factor was higher (not much new in cell phones today, aside from AI that seems to be wrong more often than right), and the costs might have been (adjusted for dollars) a slight bit higher, but more importantly, the ability to pay them was a lot, lot higher.",
          "score": 1,
          "created_utc": 1741060298.0,
          "replies": []
        },
        {
          "id": "mboiavt",
          "author": "Crintor",
          "body": "I haven't looked into the phones specs, but if it's an actual flagship tier device with full flagship specs, that's extremely reasonable.\n\nNothing recently did a little collab thing with MKBHD where they asked what his dream phone specs would be and then Nothing priced what that would actually cost an at scale brand to produce, and the Bill of Materials for it was about 500$.\n\nAnd that's *just* the actual cost of materials. That's no margins, no R&D, no marketing, no distribution, no assembly.",
          "score": 1,
          "created_utc": 1739032176.0,
          "replies": []
        },
        {
          "id": "mbopsfn",
          "author": "chemistrybla",
          "body": "It's not outrageous if you include the gift plus discounts If you bought it within the 1st month.\n\nI got $100 off,  plus $100 for trading my old Essential ph1 that was fathering dust in a box, plus OnePlus Watch2 (going for $250 now).\n\n$699 (plus tax) and a free watch has been a good deal since smartphones have been around.\n\nGalaxy s2 was $800 on release.",
          "score": 1,
          "created_utc": 1739034361.0,
          "replies": []
        },
        {
          "id": "mbot5c7",
          "author": "us1549",
          "body": "You're wrong. The OP 13 has specs that are better than the competition, except maybe the cameras for hundreds of dollars less.\n\n$900 is very very reasonable for what you're getting.\n\n$900 for a device that is on your person every waking hour of your day and you use constantly. Sounds like a great good deal to me.\n\nThere are phones for $500 if you want them but they won't be this good.",
          "score": -2,
          "created_utc": 1739035338.0,
          "replies": [
            {
              "id": "mcn1ulz",
              "author": "rouyal",
              "body": "Moto Edge+ 2023 is way better and a lot more affordable",
              "score": 0,
              "created_utc": 1739489151.0,
              "replies": []
            },
            {
              "id": "mbr6ecw",
              "author": "Deftek178",
              "body": "900 is not reasonable for a smartphone. 200 is. That is why all flagship phones drop down to ~200 within 2 years of release. People buying phones at release are suckers.",
              "score": -7,
              "created_utc": 1739061219.0,
              "replies": [
                {
                  "id": "mbr6wmf",
                  "author": "us1549",
                  "body": "Can you provide an example of a two year old flagship phone that cost $200 after two years?\n\nQuick search on eBay has these two year old flagships at the following prices\n\niPhone 14 Pro Max - $600\n\n\nSamsung S23 Ultra - $588\n\n\nJust admit you don't know what you're talking about",
                  "score": 11,
                  "created_utc": 1739061392.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mboz5dk",
          "author": "Agreeable_Friendly",
          "body": "Yea, just disable AI.",
          "score": -1,
          "created_utc": 1739037075.0,
          "replies": []
        },
        {
          "id": "mbqqetl",
          "author": "val252",
          "body": "Dude. There’s an iPhone 16",
          "score": -1,
          "created_utc": 1739055822.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbp99ij",
      "author": "killshelter",
      "body": "I can’t wait for a few years from now when a phone company starts advertising that being AI-free is a feature.",
      "score": 25,
      "created_utc": 1739039957.0,
      "replies": [
        {
          "id": "mbpjflr",
          "author": "RaisinBran21",
          "body": "I came here to say this. This will most def be a thing!",
          "score": 8,
          "created_utc": 1739042865.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbnwvrm",
      "author": "-Interceptor",
      "body": "I want a phone with dual sims (any combo of esim/sim), micro-SD card and excellent camera. headphone jack would be a plus. \n\nThere are many phones with micro-SDs, but they are mostly mid-range- . How did did it come to flagships have LESS features then low cost phones???",
      "score": 118,
      "created_utc": 1739025553.0,
      "replies": [
        {
          "id": "mbnxyuk",
          "author": "epiphanyelephant",
          "body": "Xperia 1 VI fulfills these but if you are in the US, you won't be able to get it officially.",
          "score": 44,
          "created_utc": 1739025917.0,
          "replies": [
            {
              "id": "mbnynv2",
              "author": "AdditionalMixture697",
              "body": "normal for US, wouldn't want to introduce competition into the market or anything...",
              "score": 42,
              "created_utc": 1739026147.0,
              "replies": [
                {
                  "id": "mbo7c8j",
                  "author": "Wilson-theVolleyball",
                  "body": "Sony phones used to be sold in the US but they haven't sold well so they've stopped. \n\nPart of the blame is on Sony for not marketing them better and making them more available but the US phone market is pretty much dominated by Apple with Samsung and Google making up the majority of Android sales.",
                  "score": 31,
                  "created_utc": 1739028917.0,
                  "replies": [
                    {
                      "id": "mbp0vna",
                      "author": "epiphanyelephant",
                      "body": "US cell carriers impose device restrictions through denylist. They also heavily subsidize the devices in favour of locked contracts. Some manufacturers don't want that, so get left out of the US market, leading to only a handful of brands being available to consumers.",
                      "score": 5,
                      "created_utc": 1739037567.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbx44mt",
                  "author": "eVaan13",
                  "body": "Sony was cut off from quite a few markets in Europe as well. So I wouldn't put this one on the US even though I know they are glad it happened.",
                  "score": 1,
                  "created_utc": 1739141267.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbpgvh8",
              "author": "-Interceptor",
              "body": "I've looked at xperia, but it looks like the camera is a hit or miss  for point&click people like myself. ",
              "score": 4,
              "created_utc": 1739042130.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbonsky",
          "author": "ShadowBannedAugustus",
          "body": "So they can upsell you 128GB of storage for $100.",
          "score": 7,
          "created_utc": 1739033776.0,
          "replies": [
            {
              "id": "mbtnzia",
              "author": "PCMasterCucks",
              "body": "Cloud storage for $10/mo",
              "score": 1,
              "created_utc": 1739102250.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbo2ou8",
          "author": "sarhoshamiral",
          "body": "micro SD card became a niche for sure.\n\nVery few people have their own music library on the phone anymore. First of all having one legally is difficult since most purchases moved to digital. Also, the few people that have their own library uses hosts them on a personal server to share between devices so still use internet to access them.\n\nPhotos are same too, storing photos on micro SD is actually fairly risky unless you are backing them up to a remote service continuously. But if you are doing that, why not use the same service to view your photos as well. After all, in US at least most cell plans now have unlimited internet.\n\nheadphone jack is also moving in the same direction, if it isn't there already. The only time I was using a wired headset was in planes but now even they support bluetooth headsets with their entertainment systems.",
          "score": 9,
          "created_utc": 1739027487.0,
          "replies": [
            {
              "id": "mbse1hl",
              "author": "SprucedUpSpices",
              "body": "If you're removing features just because the masses don't use them, what's even the point of having \"ultra\" phones at all that have extra features that the masses won't use? At that point just have a milquetoast standard variant for the masses. But having phones for enthusiasts that have fewer and fewer features each passing year is an insult.\n\nThe MicroSD slot is having a choice, back it up to the cloud or don't, but at least you have the choice. Without it, you remove the possibility of choosing at all.",
              "score": 8,
              "created_utc": 1739077511.0,
              "replies": [
                {
                  "id": "mbsn9sl",
                  "author": "sarhoshamiral",
                  "body": "Because they sell and the higher specs they have in display, camera seems to be what masses are interested in. Samsung isn't making Ultra series to sell tonfw enthusiasts like, they are making it to sell to masses. Enthusiasts buy things regardless.",
                  "score": 4,
                  "created_utc": 1739081879.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbsow3e",
              "author": "Tchocky",
              "body": "\n>Very few people have their own music library on the phone anymore. First of all having one legally is difficult since most purchases moved to digital. **Also, the few people that have their own library uses hosts them on a personal server to share between devices so still use internet to access them.**\n\n\nÅh, no. You might be wildly underestimating the amount of people who simply enjoy carrying their own music with them.",
              "score": 3,
              "created_utc": 1739082708.0,
              "replies": []
            },
            {
              "id": "mbzl58d",
              "author": "coffeesippingbastard",
              "body": "Spotify lets you store your playlists locally on microsd.\n\n>But if you are doing that, why not use the same service to view your photos as well. After all, in US at least most cell plans now have unlimited internet.\n\nYou don't always have Internet.",
              "score": 1,
              "created_utc": 1739177535.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbt4cs3",
          "author": "silon",
          "body": "also: rear fingerprint sensor, easily unlockable bootloader",
          "score": 2,
          "created_utc": 1739091179.0,
          "replies": []
        },
        {
          "id": "mbo0hmw",
          "author": "Ruben_NL",
          "body": "Easy. People who have the money to buy a flagship are mostly people who \"always want the best of the best\", and don't care about those features.",
          "score": 2,
          "created_utc": 1739026785.0,
          "replies": [
            {
              "id": "mbo1hw8",
              "author": "SQL617",
              "body": "Exactly. I personally have no need for an SD card on my phone, nor a headphone jack. I keep all my music on a DAP that has 3 types of headphone jacks and enough amp to actually power my non-Bluetooth headphones. \n\nI use my flagship phone for business/leisure and have many other devices such that I don’t need my phone to do everything mediocre.\n\nIf creating a flagship phone with a headphone jack and SD capacity made more money, best believe we’d see it be industry standard by now.",
              "score": 3,
              "created_utc": 1739027107.0,
              "replies": [
                {
                  "id": "mbpivk9",
                  "author": "-Interceptor",
                  "body": "Looks more like the higher capacity phones are selling for a premium. If they give you phone with SD card you can just buy one for cheap. Loss of $$$.",
                  "score": 3,
                  "created_utc": 1739042705.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbo33zy",
              "author": "DrAnklePumps",
              "body": "I'm a flagship buyer every 2-3 years with a bit of expendable income. I haven't bought less than a 512gb phone in a long time, since I can afford it. At 512gb of storage minimum, I haven't felt the need for a microSD card in years. That's enough for anyone's music collection. Now that 256gb is essentially the new minimum for base level flagship phones except for iPhones, I expect microSD slots to be even less available.",
              "score": 0,
              "created_utc": 1739027622.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbtjwpk",
          "author": "Gabelschlecker",
          "body": "Samsung A55 offers most, except no headphone jack and average camera. But other than that, it doesn't really feel like a midrange phone at all.",
          "score": 1,
          "created_utc": 1739100055.0,
          "replies": []
        },
        {
          "id": "mbqly80",
          "author": "Randromeda2172",
          "body": "Honestly what do you really need an SD card for. I last used an SD card on my Moto G4 which had like 16 gigs of storage, which I then expanded to 32. Since then every phone I've had has had at least 128 gigs that I've never gotten close to using. \n\nPhotos are all stored on the cloud or on physical drives. Songs are streamed. Same for movies.",
          "score": -4,
          "created_utc": 1739054399.0,
          "replies": [
            {
              "id": "mbs80vg",
              "author": "-Interceptor",
              "body": "Movies, videos & photos, work files. \n\nTheres times when there is no access to internet,  either remote places or airplanes. I got 200GB google drive and dont have room on it for phone photos because its syncs with my work laptop and is almost full. \n\n1 minute of 4k video takes up couple of gigs these days.\n\nI also recieve a lot of work photos. My whatsapp is 10GB , I last cleared it just 6 month ago.  \n\nPlus streaming & syncing everything takes a toll on battery life. \n\n512GB microSD costs $30 for life these days.",
              "score": 5,
              "created_utc": 1739074935.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbo4pef",
          "author": "None",
          "body": "[removed]",
          "score": 0,
          "created_utc": 1739028116.0,
          "replies": [
            {
              "id": "mbomfe6",
              "author": "MartyKei",
              "body": "And system ads which are a pain in the butt",
              "score": 3,
              "created_utc": 1739033378.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mboxv79",
      "author": "None",
      "body": "[deleted]",
      "score": 67,
      "created_utc": 1739036711.0,
      "replies": [
        {
          "id": "mbsqosi",
          "author": "Neo_Techni",
          "body": "I got the Nexus 5 cause it was $399, then a used Nexus 5x for like $200. Then a Galaxy A8 cause my wife upgraded her phone, and they gave her a loner and said \"if something happened to it, you owe us $300\". So I took it and paid the fine. I'm not paying a grand for a phone.",
          "score": 3,
          "created_utc": 1739083673.0,
          "replies": [
            {
              "id": "mbtcxsg",
              "author": "reduces",
              "body": "I got a Motorola razr 2024 for like $200 from Walmart straight talk for black Friday last year. Was locked to straight talk for a few months but worth it, it's a good phone. Can't believe that anyone is calling $900 modest or reasonable or whatever.",
              "score": 3,
              "created_utc": 1739096083.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbot59r",
      "author": "NinjaLion",
      "body": "But does it have ass bloatware like my last OnePlus did? because thats just as bad...",
      "score": 27,
      "created_utc": 1739035337.0,
      "replies": [
        {
          "id": "mbubnc7",
          "author": "GoButters",
          "body": "I recently switched to a OnePlus 13 from a Pixel. There were a handful of pre-installed OnePlus apps, but it really wasn't bad. Also easy and quick to uninstall/disable them.\n\n\nMeanwhile I remember Samsung phones just inundating me with BS, and then installing MORE junk with each software update. ",
          "score": 4,
          "created_utc": 1739112035.0,
          "replies": []
        },
        {
          "id": "mbsyc31",
          "author": "Auno94",
          "body": "I have the OnePlus 12 and didn't have bloatware",
          "score": 3,
          "created_utc": 1739087819.0,
          "replies": []
        },
        {
          "id": "mbrqcxo",
          "author": "Roboculon",
          "body": "I don’t know how people can stand this. I attempted to jump ship from iPhone back with the galaxy S8, and I was astounded with how much I hated the experience. That phone shipped with like 3 competing text message apps pre installed. And Bixby.",
          "score": 7,
          "created_utc": 1739068207.0,
          "replies": [
            {
              "id": "mbsqu28",
              "author": "Neo_Techni",
              "body": "> And Bixby\n\nhttps://www.youtube.com/watch?v=tZQEyFn3FdE",
              "score": 6,
              "created_utc": 1739083754.0,
              "replies": []
            },
            {
              "id": "mbswhx6",
              "author": "None",
              "body": "[deleted]",
              "score": 2,
              "created_utc": 1739086803.0,
              "replies": [
                {
                  "id": "mbv964k",
                  "author": "Roboculon",
                  "body": "This makes me think Android users must therefore fall into two camps:\n\n* people so savvy they understand what “running a script” means\n* people so stupid they don’t mind using an OS that is awash in garbage bloat",
                  "score": 2,
                  "created_utc": 1739122030.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mbz62nb",
          "author": "dekacube",
          "body": "Still less bloatware than Samsung phones come with.",
          "score": 1,
          "created_utc": 1739168553.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbo7j3n",
      "author": "internetlad",
      "body": "Love ditching AI. OnePlus is on my shitlist for trying to cheat me on trade in though so fuck em. Terrible customer service.",
      "score": 45,
      "created_utc": 1739028974.0,
      "replies": []
    },
    {
      "id": "mbt6j9u",
      "author": "IIlIIlIIlIlIIlIIlIIl",
      "body": "6 years of software support listed as a con lol",
      "score": 9,
      "created_utc": 1739092411.0,
      "replies": [
        {
          "id": "mch4szk",
          "author": "iLikeTurtuls",
          "body": "It’s wild cause 6 years would be OnePlus 7 Pro and 7 would be OnePlus 6t. How many people do you think are still using those phones from day 1? Probably a very small number",
          "score": 1,
          "created_utc": 1739410484.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbotnsu",
      "author": "GregTheMad",
      "body": "How are all the new phones that support Qi2 not come with magnets?! I don't care about faster charging, IIRC faster charging actually is bad for the battery. The magnets, however, are actually an amazing feature for charging efficiency, and utility is some cases. That's the one thing they should have taken from that standard.",
      "score": 7,
      "created_utc": 1739035487.0,
      "replies": [
        {
          "id": "md10dj4",
          "author": "Rabble_Runt",
          "body": "Too cheap to pay the licensing I suppose",
          "score": 2,
          "created_utc": 1739682795.0,
          "replies": [
            {
              "id": "md19q6k",
              "author": "GregTheMad",
              "body": "Could have saved their costs elsewhere, like those fucking camera bumps. \n\nI was browsing phones yesterday and those Pixel bumps are HUMONGOUS! And for what? Slightly better zoom that nobody needs? More resolution that, again, nobody needs? Could have used it for a 3Dscanner,or stereo-cameras that _some_ need.\n\nI hope my S21 keeps on going a little while longer, because there's nothing attractive on the market right now.",
              "score": 1,
              "created_utc": 1739687520.0,
              "replies": [
                {
                  "id": "md1dnpv",
                  "author": "Rabble_Runt",
                  "body": "I hear what youre saying, but everyones needs are different. I use the IR blaster and zoom features a lot at work with my Open since I work in commercial AV and work with projectors that are 10-20ft off the floor everyday. \n\nIt may seems simple but that is the diffence between me having to go get a 10ft ladder and drag it into a classroom, or simply pulling my phone out of my pocket.",
                  "score": 1,
                  "created_utc": 1739689714.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mbojgga",
      "author": "cronoes",
      "body": "This would have been my choice...if it was still offered through tmobile.   \n\nIt's not.  So then I have to consider shelling out $900, and maybe selling the old oneplus 10 pro for maybe $200 after... or getting $1000 for it through my carrier, and getting the S25+.\n\nI went for the S25+.",
      "score": 16,
      "created_utc": 1739032514.0,
      "replies": [
        {
          "id": "mbwet47",
          "author": "YellowWristBand",
          "body": "I got mine for free too. I know I don't own the phone and will have to \"pay\" it off until I can upgrade, but with carriers and phones being a necessary package, I don't understand why not to go this route? Why buy a phone out of pocket when carriers will pay it for you?",
          "score": 2,
          "created_utc": 1739133737.0,
          "replies": [
            {
              "id": "mc0kdlr",
              "author": "cronoes",
              "body": "You likely save some money if you pay up front for the phone, and use an alternative carrier...but that means big up front cash, and likely worse overall service. \n\nIt's roughly saving $20 a month when you consider all things, and that's not quite enough for me to walk away from all the free shit I get from tmobile. Including and especially mlb.tv.\n\nSince I live in NYC, and the Twins are my team.",
              "score": 1,
              "created_utc": 1739195927.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbq3su0",
      "author": "coozin",
      "body": "Remember when they used to be the flagship killer?",
      "score": 5,
      "created_utc": 1739048851.0,
      "replies": []
    },
    {
      "id": "mbotcnk",
      "author": "Exact-Ad-1307",
      "body": "I have enjoyed my one plus 8 pro for 4 years then my one plus 11 lightning fast charging 0 to a hundred in like 28 mins tops long battery life lots of memory uses the same operating system as the Samsung flagships when I got my 8 pro it was 500 cheaper than the Samsung Galaxy these are high end phone that are very durable my one plus 11 has more than my kids iPhones",
      "score": 4,
      "created_utc": 1739035398.0,
      "replies": [
        {
          "id": "mbrho62",
          "author": "jack27nikkkk",
          "body": "Yo plz use . In your sentences xd",
          "score": 3,
          "created_utc": 1739065125.0,
          "replies": []
        },
        {
          "id": "mbtkquq",
          "author": "dhesse1",
          "body": "Oneplus 8 had the worst camera ever",
          "score": 0,
          "created_utc": 1739100517.0,
          "replies": [
            {
              "id": "mbuuu97",
              "author": "Exact-Ad-1307",
              "body": "I'm not really a photographer it was a great phone for 800 vs 1300 for the Samsung Galaxy",
              "score": 1,
              "created_utc": 1739117986.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbojgl6",
      "author": "nimbleWhimble",
      "body": "I had a OnePlus 8T and I had no issues. Moved onto the OnePlus 12R, and still no problems. I paid 450 for mine so wait for a sale if you want one? I always use unlocked.\nOnePlus is a great alternative IF you want a good android experience without the bloatware or cost of Samsung.",
      "score": 4,
      "created_utc": 1739032515.0,
      "replies": []
    },
    {
      "id": "mboqr3g",
      "author": "bigwilliec",
      "body": "Fiancé still using her oneplus 8.  I just recently ditched a oneplus 7 pro for a pixel and was just waiting for oneplus to make something that is getting reviewed like the OP13 seems to be. \n\nExciting times",
      "score": 2,
      "created_utc": 1739034643.0,
      "replies": []
    },
    {
      "id": "mbthzqs",
      "author": "goosewrinkles",
      "body": "Except, you know, the whole Chinese huawei construction and parts thing…",
      "score": 2,
      "created_utc": 1739098988.0,
      "replies": []
    },
    {
      "id": "mbp5fyn",
      "author": "Patriots93",
      "body": "Highlighting the oversized camera bump looks terrible imo. Wish they'd do more to make it less noticeable.",
      "score": 3,
      "created_utc": 1739038876.0,
      "replies": [
        {
          "id": "mbs7zr9",
          "author": "wicodly",
          "body": "All the other Android SKUs have the same internals but different camera bumps. It's awful that that's become the new yardstick for better flagships. It's not going anywhere anytime soon. The public (and some of Reddit) has made it their new 3.5mm jack. It's gotta look big to be good.",
          "score": 3,
          "created_utc": 1739074922.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbp5dsr",
      "author": "None",
      "body": "OnePlus 12R is good enough for 300-400. Good battery, good screen (if curved), ect.",
      "score": 4,
      "created_utc": 1739038859.0,
      "replies": [
        {
          "id": "mcn1lrp",
          "author": "rouyal",
          "body": "Or Moto Edge+ 2023",
          "score": 1,
          "created_utc": 1739489072.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbr2pey",
      "author": "Latter_Tip_583",
      "body": "I'm too lazy to read. \n\n\nDid it keep the IR blaster? ",
      "score": 2,
      "created_utc": 1739059951.0,
      "replies": [
        {
          "id": "mbr58ys",
          "author": "Numerlor",
          "body": "yes",
          "score": 5,
          "created_utc": 1739060826.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbqthlx",
      "author": "cheecheese45",
      "body": "How I missed the real flagship of OnePlus one, after one of the founder left OnePlus haven't been the same",
      "score": 1,
      "created_utc": 1739056832.0,
      "replies": []
    },
    {
      "id": "mbu5fm9",
      "author": "Fr000m",
      "body": "Aaaaand of course ATT won't support WiFi calling on it, since they're a bag of smashed assholes.",
      "score": 1,
      "created_utc": 1739109827.0,
      "replies": []
    },
    {
      "id": "mbuy18l",
      "author": "ttubehtnitahwtahw1",
      "body": "I wouldn't mind the one+ phones if their camera situation was so fucning ugly",
      "score": 1,
      "created_utc": 1739118903.0,
      "replies": []
    },
    {
      "id": "mbwv4ho",
      "author": "HarkonnenSpice",
      "body": "Most people don't even run AI locally on PC's with dedicated GPU's. \n\nMost use-cases for mobile are better off as an Internet connected app than anything running locally and it doesn't require any difference in hardware.",
      "score": 1,
      "created_utc": 1739138478.0,
      "replies": []
    },
    {
      "id": "mdjho0f",
      "author": "oplix",
      "body": "The back of this phone is hideous.",
      "score": 1,
      "created_utc": 1739929943.0,
      "replies": []
    },
    {
      "id": "mj99dcp",
      "author": "sting_12345",
      "body": "Get a brand new OP 12 for 699.99 right now. Amazing phone.",
      "score": 1,
      "created_utc": 1742701042.0,
      "replies": []
    },
    {
      "id": "mbplplc",
      "author": "Sroemr",
      "body": "I've regretted buying my OnePlus 11 Pro since about a month in. Hard pass.",
      "score": -9,
      "created_utc": 1739043515.0,
      "replies": [
        {
          "id": "mbpu58f",
          "author": "jnmjnmjnm",
          "body": "What are your issues with it?",
          "score": 8,
          "created_utc": 1739045988.0,
          "replies": []
        },
        {
          "id": "mbrasfa",
          "author": "adcarryonly",
          "body": "there's no 11 pro, did u even do your research before buying it",
          "score": 1,
          "created_utc": 1739062725.0,
          "replies": [
            {
              "id": "mbrd08d",
              "author": "Sroemr",
              "body": "5G*\n\nExcuse me, gotta be specific for you types.",
              "score": -12,
              "created_utc": 1739063495.0,
              "replies": [
                {
                  "id": "mbredhj",
                  "author": "adcarryonly",
                  "body": "thats crazy coming from someone who hard regrets buying a phone but can't name 1 reason",
                  "score": 6,
                  "created_utc": 1739063973.0,
                  "replies": [
                    {
                      "id": "mbrgfsa",
                      "author": "Sroemr",
                      "body": "White knighting a phone company\n\nBeyond pathetic, and I didn't think that was even possible after glancing at your profile.\n\nI'm working, dipshit, so I can make posts but to answer a legit question I was going to wait until I had more time.\n\nNot everyone watches anime in mommy's basement all weekend.",
                      "score": -16,
                      "created_utc": 1739064697.0,
                      "replies": [
                        {
                          "id": "mbrh9qh",
                          "author": "adcarryonly",
                          "body": "Noones white knighting onneplus. You have time to crushout on reddit but not to respond to the other guy asking what did you not like about the phone, makes sense. Sorry you have to work on weekend, back to work buddy.",
                          "score": 9,
                          "created_utc": 1739064985.0,
                          "replies": []
                        },
                        {
                          "id": "mc00y6u",
                          "author": "Nippahh",
                          "body": "You couldn't fit a single valid reason in that text instead of sperging out while you work at McDonalds?",
                          "score": 2,
                          "created_utc": 1739187348.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mbth0m3",
          "author": "natefrogg1",
          "body": "Any particular reasons?",
          "score": 1,
          "created_utc": 1739098433.0,
          "replies": []
        }
      ]
    }
  ]
}