{
  "post": {
    "title": "MSI and Asus increase Nvidia RTX 5090 and RTX 5080 prices by up to 400USD | It's like 2021 all over again",
    "author": "chrisdh79",
    "id": "1ij14vs",
    "score": 2554,
    "created_utc": 1738844026.0,
    "selftext": "",
    "num_comments": 470,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ij14vs/msi_and_asus_increase_nvidia_rtx_5090_and_rtx/"
  },
  "comments": [
    {
      "id": "mbab8g8",
      "author": "catcher82611",
      "body": "Having a 3080 I knew I’d be okay for a while, but looks like I’m really going to be riding this card into the ground until I upgrade again. \n\nI’d consider upgrading if the price OR performance made sense, but with the trend Nvidia’s been following, I have a hard time paying 5090 money for a 5080 that has the performance of a card that should really be called a 5070. \n\nThe higher end of the enthusiast price bracket has been milked for every penny, and I have no idea how people can drop this kind of coin for such middling upgrades. \n\nDefinitely going to look hard at AMD when I do finally feel the need to upgrade, but at this rate I might just keep my PC until it dies and return to buying stuff on console first.",
      "score": 344,
      "created_utc": 1738847466.0,
      "replies": [
        {
          "id": "mbavkfe",
          "author": "JSoppenheimer",
          "body": "Yup, RTX 3080 is hitting the point where it still runs everything alright with some compromises, but it would be nice to upgrade and get stress-free high framerates on ultra settings again \\*if\\* there was a sensible upgrade option available.\n\nAnd while it is undeniable that RTX 5080 would be a big upgrade if you just solely look at the performance delta between 3080 -> 5080, everything else about the launch just feels scummy as hell. Pitiful generational increase from the last gen, even more pitiful availability, high prices, dubious amounts of VRAM, all that very much kills my enthusiasm for upgrading until it becomes a real necessity, not just a \"would be nice\" option.",
          "score": 102,
          "created_utc": 1738854287.0,
          "replies": [
            {
              "id": "mbb3d29",
              "author": "None",
              "body": "Hell, i still run a 1070ti and will be until the end of times",
              "score": 35,
              "created_utc": 1738856566.0,
              "replies": [
                {
                  "id": "mbb6u6m",
                  "author": "audigex",
                  "body": "1080 gang here\n\nIt's starting to show its age but I'd rather drop to medium settings than drop $1.5-2.5k on a graphics card",
                  "score": 51,
                  "created_utc": 1738857550.0,
                  "replies": [
                    {
                      "id": "mbbf94s",
                      "author": "joomla00",
                      "body": "Recently got a legion go, rather than a 4060 super.  Which probably woulda req me to upgrade my 3rd gen i5k too.  Its been a great buy, I think I'm done with desktop PC gaming.  Unless I plunge into vr or something.",
                      "score": 6,
                      "created_utc": 1738859899.0,
                      "replies": [
                        {
                          "id": "mbbp3wh",
                          "author": "audigex",
                          "body": "Yeah I spend a lot of my gaming time on my Steam Deck now, and I'm lucky that I play a bunch of older games rather than primarily new AAA titles - eg OpenTTD, Factorio, Minecraft, World of Warships, Star Trek Online aren't very demanding\n\nI can afford it, but I just can't justify the cost to myself to upgrade with these rip-off prices, for my usage",
                          "score": 8,
                          "created_utc": 1738862608.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mbckb2f",
                      "author": "madmofo145",
                      "body": "Yeah, I'd be happy to upgrade, but the best option in the range I've been willing to spend would be a 60 series, and performance there has been stagnant.",
                      "score": 1,
                      "created_utc": 1738871204.0,
                      "replies": []
                    },
                    {
                      "id": "mbd95wb",
                      "author": "Sabotskij",
                      "body": "I mean i recently got a 7800xt for less than $500, which is cheap-ish here. You don't have to buy nvidia to upgrade. Sure, it's not the aboslute best, you could maybe get a 4070 for the same price as the 7800xt and it'd be slightly better... but if you're happy with a 1080, the difference between them is not going to matter to you.",
                      "score": 1,
                      "created_utc": 1738878025.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbf5lor",
                  "author": "wristdeepinhorsedick",
                  "body": "Eyyy 1070ti gang rise up! (Slowly, and with lower frame rate, but we still rising!)",
                  "score": 6,
                  "created_utc": 1738900092.0,
                  "replies": [
                    {
                      "id": "mbghl9d",
                      "author": "defaultfresh",
                      "body": "1060 6gb 🙋‍♂️",
                      "score": 3,
                      "created_utc": 1738924817.0,
                      "replies": []
                    },
                    {
                      "id": "mbhbb6b",
                      "author": "combatsmithen1",
                      "body": "Running my 1070 from November 2016 into the ground",
                      "score": 2,
                      "created_utc": 1738937741.0,
                      "replies": []
                    },
                    {
                      "id": "mbicje7",
                      "author": "angel700",
                      "body": "lol",
                      "score": 1,
                      "created_utc": 1738948786.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbfzjcg",
                  "author": "None",
                  "body": "NVIDIA recently announced they will stop driver support for 10 series.",
                  "score": 2,
                  "created_utc": 1738913773.0,
                  "replies": [
                    {
                      "id": "mbhu4wr",
                      "author": "None",
                      "body": "This is really an asshole move. I will make my own card, with blackjack and hookers",
                      "score": 3,
                      "created_utc": 1738943567.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbh8roy",
                  "author": "beephod_zabblebrox",
                  "body": "1050ti 🙂‍↕️\n\nwell the pc i use them most has a 6600 but i had the 1050 for a while",
                  "score": 2,
                  "created_utc": 1738936866.0,
                  "replies": [
                    {
                      "id": "mbisq8q",
                      "author": "rikescakes",
                      "body": "I had a 1050ti til I got a 3060\n\nI'll probably have the 3060 as long as I had the 1050...(forever)",
                      "score": 1,
                      "created_utc": 1738953375.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbcujty",
                  "author": "shaky2236",
                  "body": "My 1660ti still does enough for me tbh. I don't really play graphically intensive games on my PC, and use it mainly for strategy games or older games. If I wanna play something that looks fancy, I just play on console.\n\nI'd love a fancy GPU, but I'm fine with what I have for now and might upgrade in another year or 2. I just can't justify to myself paying that kinda money.",
                  "score": 3,
                  "created_utc": 1738874034.0,
                  "replies": [
                    {
                      "id": "mbdjj4g",
                      "author": "None",
                      "body": "Thats the thing, im stuck at the fallout serie and other older games, and if i want the new ones im just going to drop the quality a bit i don't care about playing medium",
                      "score": 2,
                      "created_utc": 1738880953.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbem5er",
                  "author": "thelangosta",
                  "body": "+1",
                  "score": 1,
                  "created_utc": 1738893381.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbc2vnp",
              "author": "Shaftakovich",
              "body": "Couldn't agree more. Have to turn down some settings in Helldivers to get 60 FPS on my 3080, and I would *like* to upgrade, but right now it just doesn't make sense to do so.",
              "score": 8,
              "created_utc": 1738866402.0,
              "replies": [
                {
                  "id": "mbfvc44",
                  "author": "Inadover",
                  "body": "Playing in 4k or similar I suppose? I still get decent framerates with my Vega 56 at 1440p and it really only drops to around 30 when things get too crazy in the automaton front.",
                  "score": 1,
                  "created_utc": 1738911395.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbbq5tf",
              "author": "surdtmash",
              "body": "I went from a 5700xt to 3070, and you can rest assured my next one is going to be 9070 xt.",
              "score": 4,
              "created_utc": 1738862897.0,
              "replies": [
                {
                  "id": "mbem9m4",
                  "author": "Gmoney86",
                  "body": "I went from a 970 I bought in 2015 to a 3070 5 years ago. Now that I mostly stream to my steam deck I feel like I can make my 3070 roll for a number of years while I burn through my backlog. \n\nMaybe I’ll get a new GPU in 2-3 years after the next generational jump in GPU tech.",
                  "score": 1,
                  "created_utc": 1738893422.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbcyniq",
              "author": "jawshoeaw",
              "body": "Is a 5080 a big upgrade ? It would be lower power usage . Otherwise it seems like for most use cases it’d a moderate upgrade",
              "score": 1,
              "created_utc": 1738875149.0,
              "replies": []
            },
            {
              "id": "mbd9y06",
              "author": "Dave10293847",
              "body": "I think this is their business model now though. DLSS extends lifespan plus game graphics are hitting diminishing returns. So if you’re nvidia expecting people to upgrade every other year is just non existent like it used to be. So jack up the price and target people getting entirely new computers. In other words they’re targeting a sale every four to six years instead of every third.",
              "score": 1,
              "created_utc": 1738878236.0,
              "replies": []
            },
            {
              "id": "mbdf4w4",
              "author": "Piett_1313",
              "body": "I fought for my 3080 and I can’t believe the state of the market still. Insane. Riding this sucker until I can’t anymore too.",
              "score": 1,
              "created_utc": 1738879684.0,
              "replies": [
                {
                  "id": "mbdkoma",
                  "author": "JSoppenheimer",
                  "body": "Trying to get one at release was truly a struggle, but considering what you got for the price, it was worth every last cent I paid for it, zero doubts about that. Basically, a superb GPU with a horrible launch. Now it feels like you get the worst of both worlds, having to fight over a product that brings very disappointing improvements when compared to the previous gen, and one that has some worrying shortcomings if you consider the future (VRAM).\n\nOK, I admit it, 3080’s 10 GB VRAM also hasn’t aged that graciously, but in 2020, nobody really expected that VRAM requirements would rocket up so damn fast in the following 4 years. Meanwhile, 5080’s 16 GB is already cutting dangerously close in some extreme scenarios, and if it does so now, it’s not hard to guess how it will be with the most demanding releases 2-4 years from today.",
                  "score": 2,
                  "created_utc": 1738881294.0,
                  "replies": [
                    {
                      "id": "mbhhxx5",
                      "author": "Piett_1313",
                      "body": "I opened the Newegg app after a discord pinged me they were in stock. Literally blind bought my card I was moving so fast (and had to, I failed multiple times before). Got EVGA FTW3 and then decided to embrace RGB for the first time 😂\n\nSeems like the 50 series is a similar “paper launch” that the 30 series was in Fall 2020. I can’t believe I’ve had this card for over four years now, time just doesn’t feel real anymore. \n\nAnd honestly I’m not playing anything *crazy* on my PC, so it’ll definitely hold up fine for whatever compromises I need to make on the settings. \n\nMy pal just got an AMD card when the word came out about the 50 series not reviewing super and now the card he got is completely out of stock. I’m glad I don’t need to play the buying a GPU game and will hold off as long as I can.",
                      "score": 1,
                      "created_utc": 1738939911.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbeuhrm",
              "author": "Earthbound_X",
              "body": "I have a 3070, and I think an over 10 year old CPU and I can still play a lot of games at 60FPS+, some at max settings or near max at 1080p-1440p. Or some at least medium or high of every game I've tried. Even something like Doom Eternal I could play at 4K if I wanted to, but that's ID, they still optimize their games unlike seemingly everyone else.",
              "score": 1,
              "created_utc": 1738896230.0,
              "replies": []
            },
            {
              "id": "mbgfsb6",
              "author": "Broadband-",
              "body": "And most those compromised are just due to unoptimized games.",
              "score": 1,
              "created_utc": 1738923749.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbbfje8",
          "author": "heliosphann",
          "body": "I'm in the same boat. Was planning on getting a 5080 to replace my 3080, but after all this nonsense, I'm going to just wait it out.",
          "score": 8,
          "created_utc": 1738859976.0,
          "replies": []
        },
        {
          "id": "mbc036n",
          "author": "SehrGuterContent",
          "body": "The 3080 is slowly becoming the used market goat. They go for around 300-400$ and there's absolutely nothing new that's even close to that price point. They have 60-70% of the performance of the 1000-1200$ MSRP 5080, and it's market price is even higher.",
          "score": 7,
          "created_utc": 1738865620.0,
          "replies": [
            {
              "id": "mbfswu3",
              "author": "cretek3",
              "body": "dude idk, ill just say I had a 3080 and picked up a 5080, and the gain feels greater than that, feels closer to twice as fast, solid upgrade, would definitely keep an eye out for one if you can. I still have my 3080, not sure what im gonna list it for yet",
              "score": 1,
              "created_utc": 1738910092.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbbup8k",
          "author": "Dracekidjr",
          "body": "At this point, unless you are running at 4k with Ray tracing, a higher end amd card gets you target performance without crossing into 4 digits.",
          "score": 6,
          "created_utc": 1738864142.0,
          "replies": []
        },
        {
          "id": "mbb4wbw",
          "author": "ZonaiSwirls",
          "body": "I'm a video editor and I do 3d modeling and I'm riding my 3090 I got in October of 2020 into the fucking ground.",
          "score": 10,
          "created_utc": 1738857004.0,
          "replies": []
        },
        {
          "id": "mbc52i5",
          "author": "Applekid1259",
          "body": "Exactly this. I have a 3090 and I can't imagine paying about what my entire rig cost just for a video card. I don't think I could ever swallow that pill. I've said it before. If it got to that point; I would go back to console gaming.",
          "score": 3,
          "created_utc": 1738867006.0,
          "replies": []
        },
        {
          "id": "mbcoxpt",
          "author": "droppinkn0wledge",
          "body": "I built a new system last month with plans to upgrade from a 3080 to a 5090. \n\nWound up just buying a 4090, and I don’t regret it at all. The 4090 is still expensive but it crushes 3440x1440p 240hz. \n\nUpgrading and price and value is all relative. I have rifle optics worth more than a new 5090. But the availability and minimal uplift from 40xx to 50xx is what made me settle for the 4090. It also gave me the excuse to build a whole new tower and take advantage of DDR5 ram.",
          "score": 2,
          "created_utc": 1738872480.0,
          "replies": []
        },
        {
          "id": "mbbkrof",
          "author": "DDRDiesel",
          "body": "Got myself a 3060ti during the height of Covid thanks to luck and following the right discord servers for drop info.  The down side is I paid $800 for that card, so you better believe I'm getting every last frame from this card before I retire it",
          "score": 2,
          "created_utc": 1738861402.0,
          "replies": [
            {
              "id": "mbbld37",
              "author": "7eregrine",
              "body": "That's what I paid for my 3070ti in the EVGA lottery. Also feel like I got lucky.",
              "score": 1,
              "created_utc": 1738861569.0,
              "replies": []
            },
            {
              "id": "mbbs54g",
              "author": "suprememontana",
              "body": "I paid $1200 for my 3080 bought at Microcenter. It was my first GPU which makes it a little easier to swallow, but still I ended up paying more for that than I did my 4080",
              "score": 1,
              "created_utc": 1738863447.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbbr5ur",
          "author": "PacketAuditor",
          "body": "3080 here. I'll be checking used 5090 prices at the end of 2025.\n\nOtherwise 6000 series better impress me lol.",
          "score": 2,
          "created_utc": 1738863173.0,
          "replies": [
            {
              "id": "mbg81vw",
              "author": "guareber",
              "body": "Why would anyone be selling a 5090 less than a year old?\n\nMy hope is on the 9070xt",
              "score": 2,
              "created_utc": 1738918945.0,
              "replies": [
                {
                  "id": "mbgwoxk",
                  "author": "PacketAuditor",
                  "body": "Life circumstances, etc. Many reasons.",
                  "score": 2,
                  "created_utc": 1738932358.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mbc3yq7",
          "author": "fuzzy_man_cum",
          "body": "Before reality kicked in I had considered selling my 4070TI and getting the 5080, paying the nominal difference. But there's just no point, and now they want to gouge you further for that.\n\nMFG might have been a good reason to upgrade but only if the raw performance increased enough but it's just not there. Now we are dealing with scarcity and price shenanigans it's just like there hasn't been a release at all. Just wait for the 60 series for Nvidia's upgrade on the 40 series.\n\n50 series is definitely worth your attention if you're a low end 40 series user or still running a pre-40 series card but I just feel you lot are getting fucked out of your cash and I'm fed up with it all too.",
          "score": 1,
          "created_utc": 1738866700.0,
          "replies": []
        },
        {
          "id": "mbc6eux",
          "author": "Icy_Dream_3028",
          "body": "My 1080ti was still pushing out 4K 60fps on certain AAA games depending on how well they were optimized well into 2020. \n\nI upgraded to a 3080ti and can run the majority of AAA games with everything set at ultra and I'm still getting 80 to 100 FPS. I'll be damned if I see a compelling reason to upgrade my GPU before it dies",
          "score": 1,
          "created_utc": 1738867376.0,
          "replies": []
        },
        {
          "id": "mbcczqx",
          "author": "Alienhaslanded",
          "body": "My next card will probably be 8000 series and I'll pay for it in 52 installments with interest. Second mortgage my house to get one.",
          "score": 1,
          "created_utc": 1738869180.0,
          "replies": []
        },
        {
          "id": "mbck969",
          "author": "Digital-Dinosaur",
          "body": "I have a 970 and I cannot justify these prices. It's put me off pc gaming altogether and I ended up getting an Xbox with gamepass",
          "score": 1,
          "created_utc": 1738871189.0,
          "replies": [
            {
              "id": "mbdexw5",
              "author": "Max-Phallus",
              "body": "Yeah it's nuts. I had a GTX 970 from 2014 until 2023. It was already way more expensive than I anticipated.\n\nIt's wild that £500 won't come close to buying a current XX80 card.",
              "score": 2,
              "created_utc": 1738879630.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbdagol",
          "author": "couchfucker2",
          "body": "As a 3090 owner, yeah, that’s exactly what I thought to myself, including “middling upgrade.” Perfect description. Maybe I’m just used to the 2000s but I want no less than double the performance when I upgrade. I guess a caveat here though is I’d also appreciate less power and heat to some degree, I’ve never been in a situation where I’m essentially creating a space heater using GPU running computations as my filament.",
          "score": 1,
          "created_utc": 1738878376.0,
          "replies": []
        },
        {
          "id": "mbdr2jr",
          "author": "None",
          "body": "This. Not only that but my 3080ti is an EVGA Classified. Like a collectible for me at this point.",
          "score": 1,
          "created_utc": 1738883222.0,
          "replies": []
        },
        {
          "id": "mbeejig",
          "author": "hgs25",
          "body": "The problem is, with the new tariffs on Silicon and chips from Taiwan, AMD prices will be shooting up too.",
          "score": 1,
          "created_utc": 1738890835.0,
          "replies": []
        },
        {
          "id": "mbeidwo",
          "author": "LosoTheRed",
          "body": "I’m still running my 2080 super 🫠. That 5080 would be a great upgrade for me. Unfortunately, just like the 4080 these cards are way too expensive to be selling out",
          "score": 1,
          "created_utc": 1738892110.0,
          "replies": []
        },
        {
          "id": "mbfn532",
          "author": "1MFK1",
          "body": "I think going to go to the 9070XT if the price is right.\n\nAnything sub the 3080s original msrp and if it gets close to 4080 performance.\n\nWell that’s the upgrade I’ve been waiting for!",
          "score": 1,
          "created_utc": 1738907230.0,
          "replies": []
        },
        {
          "id": "mbfr0b7",
          "author": "SoftlySpokenPromises",
          "body": "I jumped to AMD this cycle and it's been very smooth.  I was worried about driver issues but one program took care of everything and Adrenaline is a solid control panel.\n\nIf the prices had been better I'd still be with Nvidia, but it really hasn't changed much either way.",
          "score": 1,
          "created_utc": 1738909108.0,
          "replies": []
        },
        {
          "id": "mbfzgm2",
          "author": "None",
          "body": "it's the same as buying the brand new shiny iphone just to be able to say you have it.",
          "score": 1,
          "created_utc": 1738913729.0,
          "replies": []
        },
        {
          "id": "mbhd63c",
          "author": "Daynebutter",
          "body": "I got a 3080 10gb before the 12gb came online. It still runs well but more modern games are getting close to 10gb at 1440p. Rip if you play at 4k though. Worst offender I've noticed are UE5 games.\n\nHonestly, if devs optimized games more instead of just relying on hardware, this wouldn't even be an issue.",
          "score": 1,
          "created_utc": 1738938357.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mba7y4i",
      "author": "lungshenli",
      "body": "Buying a 20series card right before Covid hit remains my best decision to this day.",
      "score": 484,
      "created_utc": 1738846167.0,
      "replies": [
        {
          "id": "mbab3h9",
          "author": "NeededMonster",
          "body": "Exactly was I was about to post. I got my 2080 super a few months before covid for less than half of what I'd pay for a 5080. Thank God for that! I would love to upgrade but prices nowadays are absurd...",
          "score": 93,
          "created_utc": 1738847413.0,
          "replies": [
            {
              "id": "mbad8yc",
              "author": "Sad-Pound1087",
              "body": "Got a 2070 super at this time and got made fun of by friends for not waiting for the 3’s",
              "score": 20,
              "created_utc": 1738848211.0,
              "replies": []
            },
            {
              "id": "mbad7cf",
              "author": "-PM_Me_Dat_Ass_Girl-",
              "body": "I'm actually still using the same card as you, and I got it around the same time.\n\n\nFrankly, I've only been playing BG3 for the last while, and it handles that game well enough. With Trump's dumbass *\"I'ma tariff errybody!\"*, who knows when I'll even bother looking to shop for one again.",
              "score": 8,
              "created_utc": 1738848194.0,
              "replies": []
            },
            {
              "id": "mbalp56",
              "author": "dm_me_pasta_pics",
              "body": "i’m considering buying a prebuilt system with a 4080 in it at the moment. they are rolling around the $3400aud mark since the 5000 series dropped (which are currently $5800-$6500aud from the same supplier lol).",
              "score": 5,
              "created_utc": 1738851149.0,
              "replies": [
                {
                  "id": "mbeigbh",
                  "author": "trowawHHHay",
                  "body": "I went prebuilt on the 30 series. \n\nThe it was barely more than card cost for a 3090 to get an HP Omen with a 3090 and skimp the peripherals to replace later.\n\nHowever, I didn’t do that. I got a ~~used car~~ iBuyPower rig. \n\nBut, it’s paid for, and I’m good for a while - it is PSU time.",
                  "score": 3,
                  "created_utc": 1738892133.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbal0md",
              "author": "Aimhere2k",
              "body": "I made the mistake of buying my 3060 Ti near the end of the last shortage. I should have waited another six months. 😞💸💸💸",
              "score": 1,
              "created_utc": 1738850923.0,
              "replies": [
                {
                  "id": "mbaznka",
                  "author": "locofspades",
                  "body": "I got my 4090 right before prices spiked in 22, so i did good there, but i bought my truck at the height of the chip shortage, so i wish id only lost out on a couple hundred lol im not smart",
                  "score": 1,
                  "created_utc": 1738855500.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbanfe0",
              "author": "hates_stupid_people",
              "body": "Same here, and seems like I'm going to have to stick with it for another generation.",
              "score": 1,
              "created_utc": 1738851721.0,
              "replies": []
            },
            {
              "id": "mbb434g",
              "author": "None",
              "body": "My 2060 is still doing fine for my purposes but as soon as I get a game that it can't really handle I'll have to start looking. I'll be taking a hard look at AMD and especially Intel. Hopefully they come out with something slightly better than the B580 and the reviews are good. I know Intel is just being very consumer friendly as they try to gain market share and it's not going to last, but I'll consider them while the getting is still good.",
              "score": 1,
              "created_utc": 1738856774.0,
              "replies": []
            },
            {
              "id": "mbbbd0u",
              "author": "kurotech",
              "body": "Just wait a few months they will release another ai/ crypto card and the 5k series will be flooding the second hand market but save your money and get a 4k series card used I know there's always a risk secondhand but eBay has buyer protections for a reason",
              "score": 1,
              "created_utc": 1738858827.0,
              "replies": []
            },
            {
              "id": "mbbf409",
              "author": "NegaDeath",
              "body": "Basically ditto. It seemed like a bad deal vs the 10 series at the time since the raytracing was effectively useless, but the continuing improvements to DLSS made it worth it in the long run.",
              "score": 1,
              "created_utc": 1738859860.0,
              "replies": []
            },
            {
              "id": "mbbkpat",
              "author": "flexonyou97",
              "body": "Used 3080s are at a good price, I think it’s worth getting if you want hdmi 2.1",
              "score": 1,
              "created_utc": 1738861385.0,
              "replies": []
            },
            {
              "id": "mbc66oz",
              "author": "Snuffleupuguss",
              "body": "Got my 2080 2nd hand for about £380 off gumtree, just before Covid hit as well. I feel vindicated",
              "score": 1,
              "created_utc": 1738867314.0,
              "replies": []
            },
            {
              "id": "mbd3kg6",
              "author": "Cheap-and-cheerful",
              "body": "lol it’s like the opposite of me. One year into covid I ended up dropping 600 euro for an rtx 2060 because I just couldn’t wait for a GPU any longer and that was the most money I could afford",
              "score": 1,
              "created_utc": 1738876489.0,
              "replies": []
            },
            {
              "id": "mbdsi7d",
              "author": "beefjerky9",
              "body": "Yep, I am also in the same situation with my 2080 super. I'd love to upgrade, but refuse to pay these ridiculous, artificially inflated prices. I hope they sit in a warehouse and rot.",
              "score": 1,
              "created_utc": 1738883672.0,
              "replies": []
            },
            {
              "id": "mbamu6y",
              "author": "Protean_Protein",
              "body": "Put the price you paid into an inflation calculator…",
              "score": -2,
              "created_utc": 1738851527.0,
              "replies": [
                {
                  "id": "mbcvn8i",
                  "author": "Helmet_Juice",
                  "body": "I have the same card, bought at the same time (March 2020)\n\n\"A basket of goods and services valued at AUD$950 in calendar year \n2019, would in calendar year 2024 cost AUD$1,144.33\"\n\nIt was a pretty good deal.",
                  "score": 2,
                  "created_utc": 1738874335.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mbae3jp",
          "author": "moritashun",
          "body": "got my 30series during the time as well, not the best but its chugging and good",
          "score": 18,
          "created_utc": 1738848522.0,
          "replies": [
            {
              "id": "mbai4vx",
              "author": "JadowArcadia",
              "body": "Yeah I was considering upgrading from my 3080 to a 5080 but I'm glad I decided to pass now. Not like there are any properly available now anyway",
              "score": 9,
              "created_utc": 1738849941.0,
              "replies": [
                {
                  "id": "mbamk0w",
                  "author": "Zenama4",
                  "body": "Been thinking about upgrading my 3080 as well (or potentially a whole new build). What other cards have you considered, asking for a friend.",
                  "score": 1,
                  "created_utc": 1738851433.0,
                  "replies": [
                    {
                      "id": "mbatnpk",
                      "author": "JadowArcadia",
                      "body": "Realistically I was only considering a 5080. Seems like the only kind of upgrade that would make sense but as more info came out I kinda feel like it's difficult to justify. I still get great performance in 90% of games on day 1. Id essentially be buying a new card purely for the fake frames for certain specific games. Would be cool to 100+ frames in Cyberpunk instead of the 45-70 I currently get but I don't think that's worth $1000. \n\nId say save the money or spend it on a different part. Maybe your CPU could use an upgrade or something. I just spent my money new bass guitar instead.",
                      "score": 3,
                      "created_utc": 1738853710.0,
                      "replies": []
                    },
                    {
                      "id": "mbb6ybv",
                      "author": "anchovyCreampie",
                      "body": "You just let ole anchovyCreampie know when you done with that 3080 mmmk?",
                      "score": 1,
                      "created_utc": 1738857582.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbb8r9b",
              "author": "Massive-Exercise4474",
              "body": "Got a 3070 only because they sent the local guy an extra graphics card. It's great other than the vram issue.",
              "score": 1,
              "created_utc": 1738858092.0,
              "replies": []
            },
            {
              "id": "mbbd9bl",
              "author": "reformedmikey",
              "body": "I snagged a 3060ti a few days after release, but only because my buddy bought it and then bought the 3080 when it released. He sold me the 3060ti for cost plus shipping, and at this point I think I’m okay with keeping it for the foreseeable future.",
              "score": 1,
              "created_utc": 1738859349.0,
              "replies": [
                {
                  "id": "mbdf104",
                  "author": "Beznia",
                  "body": "I got a 3060Ti soon after release as well. During the crypto boom, I was lucky enough to get the option to buy a 3080 from Best Buy at \"retail\" (about $869 for the card). My 3060Ti was one of the pre-nerfed cards, and I got $1,200 for it on eBay. After taxes on the 3080 and eBay fees on the 3060Ti I ended up making about $150 in profit upgrading from a 3060Ti to a 3080, which was pretty sweet.",
                  "score": 1,
                  "created_utc": 1738879654.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbbvxqs",
              "author": "joemaniaci",
              "body": "Yeh, I got fleeced for my 3090 during covid, but I upgraded from a gtx 680, and knew it would last a good long while. Knock on wood.",
              "score": 1,
              "created_utc": 1738864481.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbakt6q",
          "author": "STR4NGE",
          "body": "Still rocking my goat 1080ti.",
          "score": 13,
          "created_utc": 1738850853.0,
          "replies": [
            {
              "id": "mbesd9f",
              "author": "pacmanic",
              "body": "EVGA 1070 FTW here you will need to rip it from my cold dead hands.",
              "score": 3,
              "created_utc": 1738895500.0,
              "replies": []
            },
            {
              "id": "mbbb58u",
              "author": "Missus_Missiles",
              "body": "Bruh, my rig still runs a 970. I'm terrified of it dying.",
              "score": 5,
              "created_utc": 1738858766.0,
              "replies": [
                {
                  "id": "mbbechs",
                  "author": "divDevGuy",
                  "body": "Overclocked and over bolted 14th gen Intel iGPU baby. Nothing's stopping this bad boy ever!",
                  "score": 2,
                  "created_utc": 1738859649.0,
                  "replies": [
                    {
                      "id": "mbbf2uk",
                      "author": "RikiWardOG",
                      "body": "Mr. Money Bags over here!! :P",
                      "score": 2,
                      "created_utc": 1738859851.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbed9s3",
                  "author": "UsernameIn3and20",
                  "body": "You're in for a rude awakening if you wanted to try mhwilds.",
                  "score": 1,
                  "created_utc": 1738890413.0,
                  "replies": [
                    {
                      "id": "mbm6lvh",
                      "author": "Missus_Missiles",
                      "body": "What's mhwilds?",
                      "score": 1,
                      "created_utc": 1738993673.0,
                      "replies": [
                        {
                          "id": "mbmds6u",
                          "author": "UsernameIn3and20",
                          "body": "Monster Hunter Wilds. Newest Monster Hunter.",
                          "score": 1,
                          "created_utc": 1738997396.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mbaullz",
          "author": "Shadowcam",
          "body": "Same here, got a 2070 super because all the rest of the parts i wanted were available, and I didn't want to deal with hunting down 30-series stock before demand stabilized. Then weeks later the shortages got worse than I imagined, while I was happily playing at 1440p. XD",
          "score": 4,
          "created_utc": 1738853994.0,
          "replies": [
            {
              "id": "mbf5glv",
              "author": "Tritium10",
              "body": "I bought a 2070S to replace my AMD 6950 when I wanted to get back into gaming. I didn't really use it much and felt bad that I had wasted so much money on a graphics card I wasn't taking advantage of. \n\nThen COVID hit, sold the card for a profit even though it was over a year old. Bought myself an entire new prebuilt computer since my entire computer was old as well at that point and It was the only way to get a 3080. Now I feel like I'm never upgrading until I'm in a similar situation as I was when I bought the 2070.",
              "score": 1,
              "created_utc": 1738900044.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbat3oj",
          "author": "None",
          "body": "Waiting in evgas 3080 list was mine 750 for a hydro card. \n\nTo bad evga is gone now :(",
          "score": 3,
          "created_utc": 1738853540.0,
          "replies": [
            {
              "id": "mbay3xr",
              "author": "stellvia2016",
              "body": "I managed to order one through a local PC shop for $800. It was like a $40 markup, but that's acceptable by going local. Told my friend about it and he ordered only 2 weeks after me and the bottom already fell out of the market: He had to pay $1200.",
              "score": 1,
              "created_utc": 1738855047.0,
              "replies": [
                {
                  "id": "mbblrv0",
                  "author": "Zynbab",
                  "body": ">had to",
                  "score": 1,
                  "created_utc": 1738861683.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mbazoiq",
          "author": "wheelietime",
          "body": "I snagged an evga 3090ti on eBay last year for $750 and I love this thing so much. I miss evga :(",
          "score": 2,
          "created_utc": 1738855508.0,
          "replies": []
        },
        {
          "id": "mbb0ca3",
          "author": "Desert_Nanners",
          "body": "Bought one of the last evga 2080 supers newegg had and stepped it up to a 3080. Tremendously good decision",
          "score": 2,
          "created_utc": 1738855700.0,
          "replies": [
            {
              "id": "mbbaava",
              "author": "jakeandcupcakes",
              "body": "I did the same, but with a 2060 super. Took advantage of EVGA's Step Up program and got a 3080 for MSRP during the pandemic. I refused to oay scalper prices, and by God I did NOT. PAY. SCALPER. PRICES.\n\nStill proud of that one",
              "score": 1,
              "created_utc": 1738858528.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbb5xz4",
          "author": "luftwaffles22",
          "body": "All of my friends were telling me to wait for 30 series, but I grabbed a 2080 ti a month before the pandemic hit.",
          "score": 2,
          "created_utc": 1738857298.0,
          "replies": []
        },
        {
          "id": "mbass4w",
          "author": "Lemmonjello",
          "body": "I was terrified that my 2080 would die during covid doe some inexplicable reason and I wouldn't be able to afford to replace it",
          "score": 1,
          "created_utc": 1738853440.0,
          "replies": []
        },
        {
          "id": "mbay2by",
          "author": "iamacannibal",
          "body": "I got a 1080ti with a damaged cooler for $50 in February 2020. Built a fully water cooled system that is still going today. \n\nThe damage to the cooler was a couple fins on one of the fans broke off.",
          "score": 1,
          "created_utc": 1738855034.0,
          "replies": []
        },
        {
          "id": "mbaz59x",
          "author": "Cetun",
          "body": "I just happen to do this, one year later I could have sold the used card for more than I bought it for.",
          "score": 1,
          "created_utc": 1738855352.0,
          "replies": []
        },
        {
          "id": "mbb50id",
          "author": "Peakomegaflare",
          "body": "Same. Then got a 40 series for less than 500 USD brand new.",
          "score": 1,
          "created_utc": 1738857037.0,
          "replies": []
        },
        {
          "id": "mbb5pm8",
          "author": "jonker5101",
          "body": "During COVID I managed to trade up from a 2060 Super to a 3080 Ti and make $70 in the process. I think I'll have that card for a while. Plus it's EVGA so I'm babying it.",
          "score": 1,
          "created_utc": 1738857234.0,
          "replies": []
        },
        {
          "id": "mbb66qm",
          "author": "Zi0nized",
          "body": "Got my 3080 for canadian MSRP when it came out and I feel pretty darn good as well. Holding strong.",
          "score": 1,
          "created_utc": 1738857366.0,
          "replies": []
        },
        {
          "id": "mbb6ts4",
          "author": "None",
          "body": "It's almost as good as buying a new EVGA 3080 TI (on a forum marketplace for $800) just 3 days before EVGA stopped making Nvidia GPUs. /s",
          "score": 1,
          "created_utc": 1738857547.0,
          "replies": [
            {
              "id": "mbbpo1m",
              "author": "fritzie_pup",
              "body": "The best feeling was buying one of the very last rounds of offered EVGA 3090 FTW3 Ultra cards Mid December '22 for $969 from direct on their site.\n\nI will never, ever give this card up. I had refreshed that page hundreds of times daily knowing there were still some that trickled through. I also picked up a 3080 XC3 a few weeks before that and woulda been happy with that too, til I saw the 90.",
              "score": 1,
              "created_utc": 1738862762.0,
              "replies": [
                {
                  "id": "mbc9zpo",
                  "author": "None",
                  "body": "Nice snag! EVGA was a major part of the Golden era of gaming. It's sad those days are long gone. May your 3090 live long and bring you many happy hours of gaming!",
                  "score": 2,
                  "created_utc": 1738868352.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mbb8a9p",
          "author": "cortlong",
          "body": "I scored a 3080 RIGHT before lockdown at 800 bucks and I swear the gods smiled upon me that day.",
          "score": 1,
          "created_utc": 1738857959.0,
          "replies": []
        },
        {
          "id": "mbbaxsn",
          "author": "kurotech",
          "body": "Yep 2080 super ftw and it was still cheaper than the base models of the 50k series",
          "score": 1,
          "created_utc": 1738858708.0,
          "replies": []
        },
        {
          "id": "mbbbses",
          "author": "Hottentott14",
          "body": "I built a system with a GTX 980 in 2016, then when the 20-series hit I was like \"I can wait a bit longer\", and since then the \"price vs how much I need it\" ratio has never let me justify upgrading, and now I'm here with an over 8 year old system that I still can't justify upgrading because the prices just don't go down. I think about the people who upgraded to the 20-series often, so I'm glad to hear it from the other side. I'm almost 30 and my gaming career is of course winding down, so I'm starting to think I'll just never upgrade - at this point I'm not sure I can justify the price even if my current system stops working, and I'll just ride it out with it. Oh well.",
          "score": 1,
          "created_utc": 1738858945.0,
          "replies": [
            {
              "id": "mbcwcea",
              "author": "No_Station7387",
              "body": "I still have a GTX 1070 and it still does the job at 1080 p.  \nI play modern and less modern games with reasonable quality.  \nThe cost to upgrade is just too steep: new display, motherboard, cpu, gpu, memory, maybe power source.  \nI was waiting for VR to be more mainstream before rebuilding, but it always feels a few years away.",
              "score": 1,
              "created_utc": 1738874524.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbbjz84",
          "author": "ScoobertD",
          "body": "Buying a 3070 a month before prices went down remains one of my worst decisions to this day…",
          "score": 1,
          "created_utc": 1738861184.0,
          "replies": []
        },
        {
          "id": "mbbn9or",
          "author": "llamapower13",
          "body": "Mine died during that time and I got a used 1660ti. I was so grateful in my timing. \n\nJust upgraded from it but it’s still kicking. Giving the old PC to a friend who’s just getting into some PC games that are older so we can play together.",
          "score": 1,
          "created_utc": 1738862099.0,
          "replies": []
        },
        {
          "id": "mbbqopi",
          "author": "Narradisall",
          "body": "Same. Best financial decision I’ve made in years! I got a 2070S and people were laughing about how the 3 series was going to come out and make it obsolete.\n\nThen we spent a couple of years watching people try to find them and pay over the odds, and then every gen cards just got more expensive.\n\nCurrent cards cost more than my whole rig cost and I can still play everything I want at the moment.",
          "score": 1,
          "created_utc": 1738863042.0,
          "replies": []
        },
        {
          "id": "mbbrati",
          "author": "AGWiebe",
          "body": "Same here. But my 2070 super is getting a little long in the tooth for 3440x1440. I will be fighting for a 5080FE when stock starts popping up.",
          "score": 1,
          "created_utc": 1738863212.0,
          "replies": []
        },
        {
          "id": "mbbzkef",
          "author": "smurficus103",
          "body": "\"You should wait, there's a bunch of new cards coming out\" ... /shocked pikachu",
          "score": 1,
          "created_utc": 1738865476.0,
          "replies": []
        },
        {
          "id": "mbcqgjx",
          "author": "lxs0713",
          "body": "Same, people said the 2070 Super was a bad deal, and once the 3070 was revealed I did feel a bit of buyers remorse, but that quickly went away once the scalping started. I'm starting to think the 4070 Super that I got last year for $500 might also be another stroke of luck.\n\n5000 series has been somewhat disappointing and looks like stock levels are going to be Covid era bad. 4070 Super and 4070Ti Super stock has dried up, and I don't know if there will be enough 5070/Ti stock to make up for it. Looks like scalpers will be having a field day again",
          "score": 1,
          "created_utc": 1738872903.0,
          "replies": []
        },
        {
          "id": "mbcw5ds",
          "author": "xSmallDeadGuyx",
          "body": "I bought a 1080ti in the blissful period between the announcement of the 20 series cards and then the announcement of their price 2 weeks later. One of the biggest price dips then immediate jumps I've ever seen in GPUs",
          "score": 1,
          "created_utc": 1738874471.0,
          "replies": []
        },
        {
          "id": "mbdviwo",
          "author": "None",
          "body": "As time goes on, the more I realize getting my pre built with a 4060 TI for $850 in December was a blessing to say the least.",
          "score": 1,
          "created_utc": 1738884628.0,
          "replies": []
        },
        {
          "id": "mbez0bp",
          "author": "watchme3",
          "body": "for me it was the 4090 open box from bestbuy",
          "score": 1,
          "created_utc": 1738897781.0,
          "replies": []
        },
        {
          "id": "mbb2h3c",
          "author": "khinzaw",
          "body": "I bought a 2080TI right before Covid and I upgraded to a 4080 Super right before this.\n\nI know when to commit apparently.",
          "score": 1,
          "created_utc": 1738856315.0,
          "replies": []
        },
        {
          "id": "mbbii9e",
          "author": "SuppleDude",
          "body": "4090 FE for me 😎",
          "score": 1,
          "created_utc": 1738860786.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mba6jmg",
      "author": "Icy_Transportation_2",
      "body": "I wonder what their analytics are like.\n\nThey knew it would be mass purchased by resellers. They must have, right? Why didn’t they do the price increase prior to sale and then reduced them after the stock was originally cleared out?\n\nIs it them hoping to cash in on the fomo?",
      "score": 91,
      "created_utc": 1738845583.0,
      "replies": [
        {
          "id": "mbb6lb7",
          "author": "audigex",
          "body": "> Is it them hoping to cash in on the fomo?\n\nBasically yes\n\nFundamentally it's just supply and demand - if you're running a company aiming to make a profit, then your aim is to maximise profit. Therefore your aim is to sell all your stock at the maximum possible price\n\nWhy sell it for $2000 when you can sell it for $2400?\n\nUsually the risk is that another competitor comes in and sells theirs for less, but with astonishingly high barriers to entry so much of our tech industry has become a duopoly (at best) and thus there's not enough competition to force prices down\n\nAt the end of the day prices will always be set at what people will pay. If they sell out at $2400, they're gonna keep selling it for $2400, or even test higher prices than that",
          "score": 37,
          "created_utc": 1738857481.0,
          "replies": [
            {
              "id": "mbdynca",
              "author": "takomaster_",
              "body": "I’m out of loop isn’t that seller Nvdia ? Where are the founders edition sold ?",
              "score": 1,
              "created_utc": 1738885645.0,
              "replies": [
                {
                  "id": "mbelk25",
                  "author": "audigex",
                  "body": "This thread is about MSI and ASUS selling OEM versions of the cards, not the founders edition cards which are the reference models sold by nVidia themselves",
                  "score": 2,
                  "created_utc": 1738893178.0,
                  "replies": []
                },
                {
                  "id": "mbl9hw1",
                  "author": "lowercaset",
                  "body": ">Where are the founders edition sold ?\n\nThey would need to exist first. But in theory best buy.",
                  "score": 1,
                  "created_utc": 1738980624.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mbfdvue",
          "author": "agitatedprisoner",
          "body": "I read this as it being more profitable to use scarce advanced node production capacity to make stuff other than consumer grade graphics cards.  That'd be a good sign for expected demand for whatever else that advanced node capacity would be going toward.  AI chips for example.  Or maybe it speaks more to relatively inelastic demand of consumers for high end Nvidia graphics cards.  I'd guess it's good news for AI but it could be a few other things.",
          "score": 1,
          "created_utc": 1738903256.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mba91t9",
      "author": "petermadach",
      "body": "remember as long as youre buying, they not gonna stop selling (at these prices)",
      "score": 97,
      "created_utc": 1738846616.0,
      "replies": [
        {
          "id": "mbb36nj",
          "author": "Defiant_Office",
          "body": "Sadly the people who need to see this who are contributing to the problem don't really care. I have seen so many people bragging about their 5080/5090s as they have so much disposable income, sad really",
          "score": 26,
          "created_utc": 1738856517.0,
          "replies": [
            {
              "id": "mbc4aa7",
              "author": "NoTearsOnlyLeakyEyes",
              "body": "I feel like a lot of them likely don't have THAT much disposable income. It's easier than ever to get installment payments on small purchases. Nearly every site you go on nowadays sponsors Affirm 0% interest installment payments as long as it's paid by a certain date. What's in small print is the interest is like 20-30% if you miss a payment or don't pay it off in time. People are taking loans out more than ever for unnecessary purchases.",
              "score": 3,
              "created_utc": 1738866788.0,
              "replies": []
            },
            {
              "id": "mbcamqj",
              "author": "Obviously_Ritarded",
              "body": "I have disposable income and plan to get a 5090, (currently 1080 not even ti) but I’m not willing to pay the price increase that I’ve seen in Newegg. I was committed to 2-2.5k but idk now. May be rising this 1080 until it quits",
              "score": 1,
              "created_utc": 1738868527.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbd5169",
          "author": "BenadrylChunderHatch",
          "body": "Also the 50 series is a pretty weak improvement over the 40 series unless you're looking to target 240+fps using multiframe gen.",
          "score": 1,
          "created_utc": 1738876887.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbaugpf",
      "author": "Umbra_Draconis",
      "body": "Yes! And people keep buying them! \n\nLet's all think on why does this happen...",
      "score": 16,
      "created_utc": 1738853953.0,
      "replies": [
        {
          "id": "mbe88q1",
          "author": "radeon9800pro",
          "body": "Dude, its ridiculous. I have a 1070 and I went to Microcenter about 15 minutes before open to see if just maybe I could snag one of the 5080's on release...and the line was going AROUND the building and Microcenter buildings are not small. This was on a Thursday morning, mind you. \n\nI talked to a few people and apparently the first half of the line literally camped out since *Monday*.  And jokes on them because there were only like five 5090's and not enough 5080's to meet their demand. I stuck around because I needed to buy a platter drive for my NAS(and thankfully Microcenter had a separate line for people *not* buying a GPU)\n\nBut yeah, I think this is scuffed. Either all these people are rich as fuck and don't have jobs to be at and can afford to pay the ludicrous price OR - and I fear this is the truth - its a bunch of people that are super irresponsible and are probably just going to put it on credit and just want the shiny new GPU. If its the latter, then this is perpetually fucked. People have no sense of what something is worth anymore and are just riding the dopamine hit of buying something. And for those of us that know what something is worth, we have to wait much longer to buy the thing at a reasonable price.",
          "score": 5,
          "created_utc": 1738888767.0,
          "replies": [
            {
              "id": "mbg2pzs",
              "author": "Umbra_Draconis",
              "body": "You know what, rich people don't stand in lines like that so... I believe the problem remains on the persons that are financially irresponsible.",
              "score": 3,
              "created_utc": 1738915664.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mba53vv",
      "author": "CryptikTwo",
      "body": "Are people selling 5-10 year old cards for more than they paid new? That’s what 2021 was like, this is nothing like that.",
      "score": 170,
      "created_utc": 1738844960.0,
      "replies": [
        {
          "id": "mba5up6",
          "author": "lokicramer",
          "body": "I sold my old used 3070 for just under $600 a couple weeks ago.",
          "score": 35,
          "created_utc": 1738845286.0,
          "replies": [
            {
              "id": "mbajh74",
              "author": "RxBrad",
              "body": "That's nuts.  You can buy them cheaper than that off Amazon, all day long.  Granted, almost all are refurbs and not new.  But yours was also used.",
              "score": 8,
              "created_utc": 1738850399.0,
              "replies": [
                {
                  "id": "mbajsxm",
                  "author": "lokicramer",
                  "body": "I assume they just wanted it instantly with no wait. They drove to my house to get it.",
                  "score": 3,
                  "created_utc": 1738850510.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mba7edr",
              "author": "CryptikTwo",
              "body": "Damn dude, I got a 3080 with a waterblock for £375 less than a week ago.",
              "score": 19,
              "created_utc": 1738845942.0,
              "replies": [
                {
                  "id": "mbap4yd",
                  "author": "Optimus_Prime_Day",
                  "body": "I'm pretty sure those run $800 or more, used, here in Canada",
                  "score": 11,
                  "created_utc": 1738852276.0,
                  "replies": [
                    {
                      "id": "mbaqkho",
                      "author": "bonesnaps",
                      "body": "Yeah this is all dependant on where you live.\n\n\nIf you live in Canada, and not a metropolis like Vancouver, Calgary, etc. expect to not get batshit crazy deals like a 3080 for anything under $800.",
                      "score": 3,
                      "created_utc": 1738852741.0,
                      "replies": [
                        {
                          "id": "mbbzdey",
                          "author": "JAZthebeast11",
                          "body": "I’m in Vancouver, got a used 3080 for 550",
                          "score": 1,
                          "created_utc": 1738865423.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mbay727",
                  "author": "Saberinbed",
                  "body": "I got a brand new 3080 from a guy off kijiji in canada 2 years ago for $500 cad",
                  "score": 3,
                  "created_utc": 1738855073.0,
                  "replies": [
                    {
                      "id": "mbb05fk",
                      "author": "CactusCustard",
                      "body": "I just bought my 3070 off my friend for 200$. I wasn’t even looking to upgrade but I’d be an idiot to say no to that lol",
                      "score": 3,
                      "created_utc": 1738855645.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbaca2o",
              "author": "SkanksnDanks",
              "body": "lol damn that’s 3090 prices, ripped em off for sure",
              "score": 18,
              "created_utc": 1738847855.0,
              "replies": [
                {
                  "id": "mbara6h",
                  "author": "_QuantumEnigma_",
                  "body": "3090s are being sold from 800 to 1k on ebay",
                  "score": 6,
                  "created_utc": 1738852968.0,
                  "replies": [
                    {
                      "id": "mbc309j",
                      "author": "HealthyInPublic",
                      "body": "Yeah, I just bought a 3090 for about 1k a couple weeks ago.",
                      "score": 1,
                      "created_utc": 1738866437.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbadhaj",
                  "author": "lokicramer",
                  "body": "TBH I had like 5 people message me wanting to buy it on FB marketplace.",
                  "score": -6,
                  "created_utc": 1738848297.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbac27z",
              "author": "spoonedBowfa",
              "body": "That’s insane when a 5070 is always in stock from nvidisa for THAT",
              "score": 7,
              "created_utc": 1738847774.0,
              "replies": [
                {
                  "id": "mbd4szv",
                  "author": "ShittyTechnical",
                  "body": "Damn, that’s crazy the card that isn’t even released yet is always in stock from nvidia at that price",
                  "score": 3,
                  "created_utc": 1738876826.0,
                  "replies": [
                    {
                      "id": "mbdb7t1",
                      "author": "spoonedBowfa",
                      "body": "I meant 4070 lol",
                      "score": 1,
                      "created_utc": 1738878583.0,
                      "replies": [
                        {
                          "id": "mbdc8lt",
                          "author": "ShittyTechnical",
                          "body": "I figured, just was giving you some shit",
                          "score": 2,
                          "created_utc": 1738878869.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbaf4xg",
              "author": "TroyFerris13",
              "body": "lol i tried selling my 6750XT and people were offering me 50 dollars",
              "score": 3,
              "created_utc": 1738848897.0,
              "replies": [
                {
                  "id": "mbafwqf",
                  "author": "Vismal1",
                  "body": "I’ll give you $55 friend. \n\nI just got one of those for $300, card is treating me well.",
                  "score": 6,
                  "created_utc": 1738849168.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbaiane",
              "author": "beleidigtewurst",
              "body": ">I sold my old used 3070 for just under $600 a couple weeks ago.\n\nMy freaking god, that's over 7900GRE, a card about 1.5 times faster than 3070.",
              "score": 3,
              "created_utc": 1738849995.0,
              "replies": []
            },
            {
              "id": "mbacn0i",
              "author": "AnalogFeelGood",
              "body": "Ge, 1080 are still selling for 200$ loll",
              "score": 2,
              "created_utc": 1738847987.0,
              "replies": []
            },
            {
              "id": "mbam2bi",
              "author": "internetlad",
              "body": "Fuck yes it's happening again boys",
              "score": 1,
              "created_utc": 1738851271.0,
              "replies": []
            },
            {
              "id": "mbc4qr1",
              "author": "adoniiiii",
              "body": "I bought a 3070 for $135 4 months ago 💀",
              "score": 1,
              "created_utc": 1738866915.0,
              "replies": []
            },
            {
              "id": "mbae39c",
              "author": "DaCody_98",
              "body": "I just bought a 3070ti recently for 350$ lol",
              "score": 1,
              "created_utc": 1738848519.0,
              "replies": [
                {
                  "id": "mbaofks",
                  "author": "Fredasa",
                  "body": "I say try to sell it for $600 like OP.  There's bound to be at least one more person out there panicky enough to make a very hasty, very ill-advised purchase.",
                  "score": 1,
                  "created_utc": 1738852048.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mbae9sk",
          "author": "I-LOVE-TURTLES666",
          "body": "Used 4090’s are going for pretty much msrp when they came out",
          "score": 4,
          "created_utc": 1738848586.0,
          "replies": []
        },
        {
          "id": "mbafppd",
          "author": "chrisdh79",
          "body": "I sold my Gigabyte 4090 for 1799 on FB marketplace. 100 more than what I paid 2 years ago.. Prices for used are still inflated, I don't get it.",
          "score": 15,
          "created_utc": 1738849099.0,
          "replies": [
            {
              "id": "mbaisw9",
              "author": "CryptikTwo",
              "body": "Slightly different situation when a 4090 is still one of the fastest cards on the market and stock of the only faster card is basically non-existent.",
              "score": 21,
              "created_utc": 1738850169.0,
              "replies": []
            },
            {
              "id": "mbayql6",
              "author": "stellvia2016",
              "body": "What did you replace it with? None of the cards shown so far from 50 series seemed worth it.",
              "score": 5,
              "created_utc": 1738855231.0,
              "replies": [
                {
                  "id": "mbb11rq",
                  "author": "chrisdh79",
                  "body": "I was able to snag a 5090 from BestBuy. HotStock app sent me an alert during the afternoon drop.",
                  "score": 3,
                  "created_utc": 1738855903.0,
                  "replies": [
                    {
                      "id": "mbb1h27",
                      "author": "stellvia2016",
                      "body": "Well hopefully it works out for you. I've heard the drivers are rough at the moment, but that should get better. Overall though I wasn't impressed. Watched the videos from LTT, GN, Jayz2Cents etc.",
                      "score": 1,
                      "created_utc": 1738856026.0,
                      "replies": [
                        {
                          "id": "mbb87kb",
                          "author": "chrisdh79",
                          "body": "Thanks. So far so good. Drivers seemed to be an issue with the 5090D (chinese) cards mainly. I haven't had any hiccups yet.",
                          "score": 1,
                          "created_utc": 1738857938.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbcf4dr",
              "author": "perk11",
              "body": "Running AI locally is a new market for 3090s and 4090s specifically as they have 24 GiB of VRAM, not sure how much that impacts the price though.",
              "score": 1,
              "created_utc": 1738869765.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbc8car",
          "author": "volfin",
          "body": "just upgraded to a 4070 ti super, and sold my 2070 super for $210.00",
          "score": 2,
          "created_utc": 1738867902.0,
          "replies": []
        },
        {
          "id": "mbafhje",
          "author": "BaconatedGrapefruit",
          "body": "Man, I remember selling my old r9 390,in 2021, for basically what I paid for it back in the day. Any time I feel bad I remember it likely went to a miner and have a good laugh.",
          "score": 1,
          "created_utc": 1738849020.0,
          "replies": []
        },
        {
          "id": "mbb6per",
          "author": "Yhrite",
          "body": "I sold my EVGA 980 for $450 CAD.",
          "score": 1,
          "created_utc": 1738857513.0,
          "replies": []
        },
        {
          "id": "mbb7r44",
          "author": "wheelers",
          "body": "Give it a few weeks.",
          "score": 1,
          "created_utc": 1738857809.0,
          "replies": []
        },
        {
          "id": "mba65xg",
          "author": "hellowiththepudding",
          "body": "My Vega 64 I bought two years earlier, used, for $300 was worth $800 on eBay. Nutty",
          "score": 1,
          "created_utc": 1738845422.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbacv6m",
      "author": "AEternal1",
      "body": "By the time i was ready to upgrade my 1070, the gpu market had started to lose its mind. I said, ill wait this out. Its been so damn long, i dont know anymore,6 years? I bought it for $300 new, gigabyte, and it still works just fine for 99% of games. It does well enough for cyberpunk,  it only ever truly shows its age with black myth wukong. So im not exactly pressed to get a new card, but my desire for a new card is utterly squashed by this nonsense.",
      "score": 28,
      "created_utc": 1738848070.0,
      "replies": [
        {
          "id": "mbdfjpf",
          "author": "Esseth",
          "body": "I saw a lot of 10 series people I know finally upgrade jumping to the B580 as it was the first real upgrade path in years for anyone that didn't want to spend a ridiculous amount on a GPU.",
          "score": 2,
          "created_utc": 1738879802.0,
          "replies": [
            {
              "id": "mbf8d0t",
              "author": "AEternal1",
              "body": "I thought about this. Might need to reconsider it more now.",
              "score": 1,
              "created_utc": 1738901099.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbamoa3",
          "author": "QuestGiver",
          "body": "Eh it was worth it to me. I bought a 7900 xtx on release for 900 and have been using it this whole time. People always say things are overpriced but then it gets even worse...",
          "score": 0,
          "created_utc": 1738851473.0,
          "replies": []
        },
        {
          "id": "mbdd6dl",
          "author": "Psychast",
          "body": "I got good news for you! A $300 dollar card, literally any of them today, will decimate that 1070 in every game. You don't have to pay a single red cent more than what you paid all those years ago.\n\nhttps://pcpartpicker.com/product/Yy6p99/xfx-radeon-rx-6650-xt-8-gb-speedster-swft-210-core-video-card-rx-665x8dfdr - Here you go bro, $300 dollar 6650XT. You can even play 1440p at good frames with this one.\n\nThere's no reason to be a martyr just because value is really bad right now compared to 5 to 10 years ago. Then again, Graphics demand is also shifting in a time of changing video game landscapes. Like you said, \"99%\" of the games you actually play run fine on an 8 year old card. Why is that? I think it's because so many games now are built for PC AND mobile (Fortnite, for instance), and a huge increase in good games made by small teams (Hollow Knight, for instance), that anyone who only plays just those basically needs the barebones minimum of GPUs. This, apparently, hasn't offset demand but it is interesting that there's a whole genre of players out there that basically never touch AAA games and thus haven't had an actual *need* for GPU upgrades in a long time.",
          "score": 1,
          "created_utc": 1738879131.0,
          "replies": [
            {
              "id": "mbf8n91",
              "author": "AEternal1",
              "body": "Thanks for the direction, it's really appreciated",
              "score": 1,
              "created_utc": 1738901206.0,
              "replies": []
            },
            {
              "id": "mblxtzf",
              "author": "Black007lp",
              "body": "I'm playing kingdom come deliverance 2 at 65-80fps on my 1070 with fsr balanced, I want to make a big upgrade, but the gpu market sucks. I'd like to get a 5070 super/ti when it comes out, but I know I won't be able to, not for its real price at least, and even less in my country, where it can be up to 2x msrp.",
              "score": 1,
              "created_utc": 1738989728.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbcdaps",
          "author": "wrong_usually",
          "body": "Go with the 40 series instead. Who cares?",
          "score": 0,
          "created_utc": 1738869263.0,
          "replies": [
            {
              "id": "mbceyte",
              "author": "AEternal1",
              "body": "I have found it difficult to find a 4070 in stock at about a 300-400 price point.",
              "score": 6,
              "created_utc": 1738869722.0,
              "replies": [
                {
                  "id": "mbcs9ie",
                  "author": "Madbrad200",
                  "body": "That's probably not gonna change to be honest. It's such a sizable jump that I'd say it's worth it personally",
                  "score": 3,
                  "created_utc": 1738873404.0,
                  "replies": [
                    {
                      "id": "mbcuvy9",
                      "author": "AEternal1",
                      "body": "Unfortunately, my pay has not kept up with GPU prices, so🤷",
                      "score": 7,
                      "created_utc": 1738874126.0,
                      "replies": [
                        {
                          "id": "mbdnwhr",
                          "author": "HeIsMyPossum",
                          "body": "Eh, don't let people shame you. I rode my 1070 for a long time. I upgraded but only because someone on FB Marketplace was selling a 3060 TI for $200. That was enough of a jump - but I saw the way the market was going and just knew that price point wasn't going to get me there.\n\nHonestly, keep riding the 1070, and don't let people get you down about not having a 30XX or 40XX card.",
                          "score": 3,
                          "created_utc": 1738882254.0,
                          "replies": [
                            {
                              "id": "mbe3zjk",
                              "author": "wrong_usually",
                              "body": "100%",
                              "score": 1,
                              "created_utc": 1738887384.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mblacap",
              "author": "lowercaset",
              "body": "4090s are selling for more than MSRP on 5090s. From what I've seen at a glance you'd have to go down to a 4070 to be much cheaper than 5090 FE.",
              "score": 1,
              "created_utc": 1738980920.0,
              "replies": [
                {
                  "id": "mbp0kwm",
                  "author": "wrong_usually",
                  "body": "O.0",
                  "score": 1,
                  "created_utc": 1739037482.0,
                  "replies": []
                },
                {
                  "id": "mbp0ys2",
                  "author": "wrong_usually",
                  "body": "Man I just checked and its more expensive from when I bought one. Wtf¿",
                  "score": 1,
                  "created_utc": 1739037591.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mbakct7",
      "author": "SomewhatOptimal1",
      "body": "It’s not, I can go do other stuff if nVIDIA doesn’t want my money. Party, pubing, skiing and do other sports. \n\n\nAlso PS5 got me covered for single player games and my old pc can do esport games still. \n\nI was about to spend 1250€ for 5080 or even 2400€ for 5090. Now they got nothing and if 9070XT with FSR4 is a success, they lost my business.\n\nPlus there is still large supply of 4070Ti Super and 4070 Super in Europe, so only high end card can be scalped. So the situation is not as dire.",
      "score": 8,
      "created_utc": 1738850699.0,
      "replies": [
        {
          "id": "mbbzppa",
          "author": "bow_down_whelp",
          "body": "I'm not a fan of of anyone I just go with what I feel like. And the way nvidia have handled this is disgusting. Really turning me off buying their shit  I have a 4090 and if they don't pull their shit together before it melts in the next generation, I'm not buying it",
          "score": 4,
          "created_utc": 1738865517.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbc6c9m",
      "author": "None",
      "body": "Who can justify buying cards at these prices. I mean it's 1799 euro for a 5080 and 3129 euro for a 5090 where I live, if you're able to get one in a store.",
      "score": 8,
      "created_utc": 1738867357.0,
      "replies": [
        {
          "id": "mbmhfws",
          "author": "SupX",
          "body": "A house deposit the way things are going ",
          "score": 1,
          "created_utc": 1738999450.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbcypve",
      "author": "vidfail",
      "body": "LOL. What 5090 and 5080? They don't exist. There's no stock anywhere except for scalpers and scammers on eBay. What a fucking joke.",
      "score": 7,
      "created_utc": 1738875167.0,
      "replies": []
    },
    {
      "id": "mbaxg60",
      "author": "LeCrushinator",
      "body": "If people are willing to pay for them, they’re the problem in my opinion. Although lack of supply is on Nvidia.",
      "score": 6,
      "created_utc": 1738854851.0,
      "replies": []
    },
    {
      "id": "mba895m",
      "author": "ResponsibleTruck4717",
      "body": "Pc gaming is already much more expensive compare to console.",
      "score": 19,
      "created_utc": 1738846294.0,
      "replies": [
        {
          "id": "mbej2fo",
          "author": "cbung",
          "body": "I guess that would be due to economy of scale? Building millions of the same build. What are the hardware specs on modern consoles like (im out of the loop) do they use nvidia cards?",
          "score": 2,
          "created_utc": 1738892339.0,
          "replies": []
        },
        {
          "id": "mbapx7p",
          "author": "entreri22",
          "body": "Maybe up front. But not over time",
          "score": -13,
          "created_utc": 1738852532.0,
          "replies": [
            {
              "id": "mbar5ed",
              "author": "ResponsibleTruck4717",
              "body": "ain't game priced the same?",
              "score": 0,
              "created_utc": 1738852927.0,
              "replies": [
                {
                  "id": "mbb8j61",
                  "author": "AJ_Dali",
                  "body": "at launch, maybe. If you can wait a couple hours greenman gaming will get you 10-20% off. PC games go on much deeper sales than console games.",
                  "score": 8,
                  "created_utc": 1738858029.0,
                  "replies": []
                },
                {
                  "id": "mbaxrx2",
                  "author": "chadhindsley",
                  "body": "Free online gaming",
                  "score": 5,
                  "created_utc": 1738854949.0,
                  "replies": [
                    {
                      "id": "mbb78q8",
                      "author": "ModsRTryhards",
                      "body": "I don't know about this being a reason. I don't know exactly what math the other commentor was doing but I doubt it included this.\n\nPS Plus is currently $80/yr (up from $60 not too long ago) and that is the most expensive entry level out of the top 3 companies. If I buy a $500 console and you buy a $1500 graphics card it would take me over 10 years to get to that cost and that's not even considering the other components.",
                      "score": 4,
                      "created_utc": 1738857664.0,
                      "replies": [
                        {
                          "id": "mbbxls6",
                          "author": "LordModlyButt",
                          "body": "A $1500 graphics card would absolutely demolish any console on the market, that is not a fair comparison. ",
                          "score": 2,
                          "created_utc": 1738864933.0,
                          "replies": [
                            {
                              "id": "mbc5pvt",
                              "author": "ModsRTryhards",
                              "body": "Disagree. We aren't exactly comparing performance. We are talking about PC price Vs console price. Buying new right now the console is much cheaper in the short term. \n\nOriginal comment said PC is cheaper in long run. I'm not saying anything about that though I was only discussing the other comment that the cost of online isn't much of a factor in overall cost during the console's lifetime. And we still need to add the rest of the PC cost",
                              "score": 2,
                              "created_utc": 1738867185.0,
                              "replies": [
                                {
                                  "id": "mbdif9h",
                                  "author": "LordModlyButt",
                                  "body": "Why are you using the example of a $1500 GPU if performance is not a metric you are taking into account? \n\nBuy a Steam deck and only play the free games offered by epic and now you have a pc gaming experience even cheaper than the Nintendo switch. ",
                                  "score": 2,
                                  "created_utc": 1738880633.0,
                                  "replies": [
                                    {
                                      "id": "mbfnypy",
                                      "author": "ModsRTryhards",
                                      "body": "Omg say the GPU cost 500. The GPU costs 500 the same as the ps5. Say it's free. The total price of the PC still costs a lot more and online gaming isn't a financial factor. I feel this is cut and dry and you are discussing something else.\n\nA steam deck is not a PC. You are entirely missing the point.",
                                      "score": 1,
                                      "created_utc": 1738907612.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mbg57eh",
                  "author": "zrasam",
                  "body": "I don't know where u live, but it is cheaper on Steam for me because of regional price (thank god). \n\nAnd Steam have WAYYYYYY more sales events than PS / XBOX. \n\nSometimes a game I want randomly went on sale on a random weekend. Not on ps store or xbox. So yeah in the long run it is cheaper. \n\nPlus no need to pay to use your own fuckin internet to play. \n\nNot sure why the dude got so much downvote",
                  "score": 1,
                  "created_utc": 1738917167.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mbawzac",
      "author": "TpMeNUGGET",
      "body": "1060 gang lol",
      "score": 11,
      "created_utc": 1738854711.0,
      "replies": [
        {
          "id": "mbbibug",
          "author": "bdoll1",
          "body": "6GB still going strong, lack of TPM 2.0/Win10 updates will push me off this PC before the GPU does. I was gonna pull the trigger on a 5070 TI and 9800X3D but I think I'll wait until after our inevitable recession for some price drops/bug fixes/Super version.",
          "score": 3,
          "created_utc": 1738860737.0,
          "replies": [
            {
              "id": "mbbl05l",
              "author": "TpMeNUGGET",
              "body": "Picked up an i9 9900k for 90 bucks and a z390 mobo with a bent cpu pin for 10 bucks last year lol. Unless you’re editing 4k video or trying to run games at 120hz or on a 4k monitor, 4+ year old parts are honestly the best deal right now.",
              "score": 1,
              "created_utc": 1738861468.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbcgsks",
          "author": "SaxPanther",
          "body": "1070 squad",
          "score": 1,
          "created_utc": 1738870227.0,
          "replies": [
            {
              "id": "mbddt2m",
              "author": "sigep0361",
              "body": "Dual 1070 squad!",
              "score": 1,
              "created_utc": 1738879306.0,
              "replies": [
                {
                  "id": "mbdh1f5",
                  "author": "SaxPanther",
                  "body": "hell yeah brother",
                  "score": 1,
                  "created_utc": 1738880231.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mbb3uid",
      "author": "LeastUnderstoodHater",
      "body": "EVGA was right to avoid this endless fucking nightmare all over again.",
      "score": 10,
      "created_utc": 1738856705.0,
      "replies": []
    },
    {
      "id": "mbbnfj6",
      "author": "Pacothetaco619",
      "body": "toy rich dolls reply vast crown stupendous alive rock repeat\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "score": 5,
      "created_utc": 1738862144.0,
      "replies": []
    },
    {
      "id": "mbc091m",
      "author": "talon04",
      "body": "I'm over the price insanity. It's insane what pc gaming is becoming. I remember when people used to claim PC gaming was too expensive in the PS3/Xbox 360 era. \n\nWe are now becoming that truth. I'm glad I'm not opposed to a used graphics card cause these prices are over the entire cost of the last 3 of my PCs in many cases. \n\nI snagged a 3090 last year locally for 575 and I'm probably going to run it until the rest of my rig dies I have a feeling that these cards are going to become the next \"goat\" contender once the needs of Ray tracing forces the 10 series out.",
      "score": 5,
      "created_utc": 1738865665.0,
      "replies": [
        {
          "id": "mbcmi2m",
          "author": "soulsoda",
          "body": "Pc gaming vs console usually goes back and forth on which one is the most bang for your $, neither side is always the winner unless youre willing to use \"used\" stuff then its anyone's game.",
          "score": 1,
          "created_utc": 1738871809.0,
          "replies": [
            {
              "id": "mbd9fqr",
              "author": "talon04",
              "body": "I'd disagree for a long time you could easily build a PC that could compete with a console with minimal or no used parts. Then upgrade as time and budget allowed.\n\nNow with GPUs costing double to triple what a Playstation 5 Pro costs with essentially being Vaporware that proposition is entirely out the window. \n\nGranted that's supposed to be the \"Enthusiast\" tier of GPU but even the 70 seies is going to cost as much as a Pro. Tell me how the masses are going to be interested in that? \n\nSo they ended up with a 50-60 series card and instead locked into the \"upgrade\" every 2 years like when console guys used to joke about. \n\nWe became a self fulfilling prophecy.",
              "score": 1,
              "created_utc": 1738878098.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbazgqi",
      "author": "Mean_Peen",
      "body": "And just like in 2021, nobody NEEDS these cards right now. Wait til it dies down and then buy one. Don’t let FOMO control your lives",
      "score": 15,
      "created_utc": 1738855445.0,
      "replies": [
        {
          "id": "mbbtwin",
          "author": "Calphurnious",
          "body": "I said that many times before with various things and the prices only went up, not down.",
          "score": 9,
          "created_utc": 1738863927.0,
          "replies": []
        },
        {
          "id": "mbrcv09",
          "author": "Ifritmaximus",
          "body": "What they said for 40s but they just kept going up then discontinued.",
          "score": 0,
          "created_utc": 1739063444.0,
          "replies": []
        },
        {
          "id": "mbbanje",
          "author": "DoradoPulido2",
          "body": "Nobody? My 8+hour render times beg to differ. I have to batch render and composite images with my 3080 because it can't load all the figures at once. ",
          "score": -7,
          "created_utc": 1738858628.0,
          "replies": [
            {
              "id": "mbbni7q",
              "author": "Zynbab",
              "body": "Your renders of anime girls can wait",
              "score": 8,
              "created_utc": 1738862166.0,
              "replies": [
                {
                  "id": "mbdvx1t",
                  "author": "DoradoPulido2",
                  "body": "I'm an indie game dev. It's my business but go off. ",
                  "score": -2,
                  "created_utc": 1738884755.0,
                  "replies": [
                    {
                      "id": "mbhyq1x",
                      "author": "Zynbab",
                      "body": "Send steam code of latest project and I'll let you know if the 5090 is needed",
                      "score": -1,
                      "created_utc": 1738944881.0,
                      "replies": [
                        {
                          "id": "mbl8kas",
                          "author": "DoradoPulido2",
                          "body": "IRay rending in Daz Studio. It only works on Nvidia cards. There's no reason to be patronizing if you don't know about render pipelines. ",
                          "score": 0,
                          "created_utc": 1738980302.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbdbn2m",
              "author": "couchfucker2",
              "body": "This is so reddit. [statement saying nobody needs this] [upvotes] [person provides a context where it’s needed] [downvotes ensue]. It’s like people don’t know and are mad at someone pointing out that there’s whole world of creatives, AI developers, filmmakers that need to use these GPUs for something besides gaming. Ya know like maybe MAKING the games that they like to play. 🤦‍♂️",
              "score": -1,
              "created_utc": 1738878701.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbal8af",
      "author": "nzox",
      "body": "My 4090 I got for retail is looking better and better",
      "score": 9,
      "created_utc": 1738850994.0,
      "replies": [
        {
          "id": "mbcdeqh",
          "author": "wrong_usually",
          "body": "Yea same. I'll wait until the 6090 thanks.",
          "score": 2,
          "created_utc": 1738869294.0,
          "replies": [
            {
              "id": "mberg8k",
              "author": "h3rpad3rp",
              "body": "Its probably just gonna be $500+ more than the last generation, again.",
              "score": 1,
              "created_utc": 1738895185.0,
              "replies": [
                {
                  "id": "mbeuccu",
                  "author": "wrong_usually",
                  "body": "Right. Gotta make it worth any jump, but fuck em I'll switch to AMD after a time.",
                  "score": 1,
                  "created_utc": 1738896178.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mbbn0ku",
      "author": "None",
      "body": "“Oh shit! Our AI cash cow is going down! We need to charge stupid prices for our consumer cards again”",
      "score": 4,
      "created_utc": 1738862029.0,
      "replies": []
    },
    {
      "id": "mbah4c7",
      "author": "silverado83",
      "body": "Paid $2,399.99 CAN pre-tax in 2021 for an Asus 3080 ti OC edition..  What a silly purchase...  I did at least sell 2 2080 ti's for $1000 to offset the costs but still.  The performance was similar in games that supported SLI, but the RT marketing sucked me in.\n\nWas prepared to purchase a 5090 till the prices came out, then said hell no.  NOT doing a 2021 repeat again.. no thanks.",
      "score": 6,
      "created_utc": 1738849592.0,
      "replies": []
    },
    {
      "id": "mbbmi59",
      "author": "LuntiX",
      "body": "I’m starting to feel like my decision to stay with AMD, while not being on par performance wise, is a good move.",
      "score": 3,
      "created_utc": 1738861886.0,
      "replies": []
    },
    {
      "id": "mba3wy0",
      "author": "IndyPoker979",
      "body": "I think they're about to be shocked by the lack of sales. There are very few people who have that kind of capital to invest in a new card with very little increase in benchmark. It might be justifiable for stock investors or corporations but their bread and butter market, the PC gamer is not going to spend that kind of money to invest in a card that doesn't produce significant change in experience.",
      "score": 51,
      "created_utc": 1738844427.0,
      "replies": [
        {
          "id": "mba76y3",
          "author": "LePenatramos",
          "body": "It’s gona sell out everywhere don’t kid yourself",
          "score": 184,
          "created_utc": 1738845855.0,
          "replies": [
            {
              "id": "mbajwmn",
              "author": "RxBrad",
              "body": "But at what stock levels? Everything I've heard points to extremely, extremely low levels of inventory.\n\nSelling out an inventory of 1,000 is a lot different than selling out 500,000.\n\nNvidia is simply allocating all of the silicon over to datacenter.",
              "score": 22,
              "created_utc": 1738850545.0,
              "replies": []
            },
            {
              "id": "mba9svh",
              "author": "Tzukkeli",
              "body": "This is it. I saw Astrals gone immediately, and they have like +40% msrp markup. There is always few willing to buy at absurd prices.",
              "score": 20,
              "created_utc": 1738846914.0,
              "replies": [
                {
                  "id": "mbaeiia",
                  "author": "Keisari_P",
                  "body": "Expensive = better  \nMost expensive = best\n\nThats the logic.",
                  "score": 7,
                  "created_utc": 1738848674.0,
                  "replies": [
                    {
                      "id": "mbalric",
                      "author": "karlzhao314",
                      "body": "I mean, I'm pretty sure most people aren't under any illusion that an Astral is *actually* a better card than any other 5090, especially not $1400 better.\n\nThe problem is, right now the market value of a 5090 is already more than $1400 over its retail. So Asus can sell Astrals for $3400 simply because 5090s - *any* 5090s - are worth more than $3400 right now.",
                      "score": 4,
                      "created_utc": 1738851171.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbclasj",
                  "author": "soulsoda",
                  "body": "because there's like 1000 5090s in the entire US of A, and if you don't buy one at MSRP a scalper will get it and sell it to some A hole with another 50-100% mark up.",
                  "score": 1,
                  "created_utc": 1738871477.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbam1gg",
              "author": "frostnxn",
              "body": "Then selling out doesn't tell the whole story. It's one thing selling out a few thousands, it's another thing selling out a few dozens. Since no one publishes the amount of GPUs sold, we can never know unfortunately.",
              "score": 8,
              "created_utc": 1738851263.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mba5674",
          "author": "MakeThanosGreatAgain",
          "body": "Yeah this has all about sucked the soul of out of PC gaming for enthusiasts. I wanted a new card so bad but I'm at the point I hate even thinking about them. It's been 4 years of this shit.",
          "score": 44,
          "created_utc": 1738844988.0,
          "replies": [
            {
              "id": "mba67wa",
              "author": "ACertainUser123",
              "body": "Just get an AMD card",
              "score": 28,
              "created_utc": 1738845445.0,
              "replies": [
                {
                  "id": "mba6i06",
                  "author": "MakeThanosGreatAgain",
                  "body": "I actually like DLSS and Frame Gen tho. It helps my ultrawide OLED actually run raytracing at a pleasurable FPS",
                  "score": 12,
                  "created_utc": 1738845564.0,
                  "replies": [
                    {
                      "id": "mba8mxx",
                      "author": "sambull",
                      "body": "And I'm the opposite i use it for vr, all this frame gen stuff is worthless sans dlaa, Render performance and VRAM is needed badly",
                      "score": 18,
                      "created_utc": 1738846450.0,
                      "replies": [
                        {
                          "id": "mbaymb9",
                          "author": "bibober",
                          "body": "I'm thinking about the time that AMD released the 6000 series cards and you couldn't use them with Adobe substance painter at all because it would instantly crash. 6 months for AMD to release a functioning driver. Then the time that there was 6 months worth of drivers that would cause VRchat to immediately crash if you loaded into a world with a video player. \n\nAMD is not a serious choice for something niche like VR because their Windows drivers continue to be beta quality and they take forever to fix issues.",
                          "score": 3,
                          "created_utc": 1738855197.0,
                          "replies": []
                        },
                        {
                          "id": "mbac2pg",
                          "author": "None",
                          "body": "[deleted]",
                          "score": -4,
                          "created_utc": 1738847779.0,
                          "replies": [
                            {
                              "id": "mbae6y2",
                              "author": "Ghostlystrike",
                              "body": "You haven’t kept up then. The last bad things about Nvidia drivers happened over a year ago and they’ve all been fixed since then. Btw AMD drivers have never bricked cards or see them on fire like nvidia cards have.",
                              "score": 2,
                              "created_utc": 1738848557.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mbabta7",
                      "author": "The_FireFALL",
                      "body": "Hi. Ultrawide screen owner with a 7900XTX. It has no problem with Ray tracing and almost every game doesn't require frame gen to achieve well over 100 FPS using it.",
                      "score": 4,
                      "created_utc": 1738847682.0,
                      "replies": [
                        {
                          "id": "mbajy6y",
                          "author": "MakeThanosGreatAgain",
                          "body": "What are you getting in Alan Wake 2 or Witcher 3 with ray tracing on?",
                          "score": 1,
                          "created_utc": 1738850560.0,
                          "replies": [
                            {
                              "id": "mbaua86",
                              "author": "The_FireFALL",
                              "body": "Alan wake 2 I haven't got but Witcher 3 runs at a stable 105fps. That's with a 7800X3D as well as the 7900XTX.",
                              "score": 1,
                              "created_utc": 1738853899.0,
                              "replies": [
                                {
                                  "id": "mbdj0im",
                                  "author": "MakeThanosGreatAgain",
                                  "body": "Yeah that's not bad at all",
                                  "score": 1,
                                  "created_utc": 1738880803.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mba6m0d",
                      "author": "ACertainUser123",
                      "body": "If you want to play with Ray tracing then you are going to have to pay for it, for everything else AMD is as good as nvidea while being cheaper",
                      "score": 5,
                      "created_utc": 1738845611.0,
                      "replies": [
                        {
                          "id": "mba97ih",
                          "author": "Kiwi_In_Europe",
                          "body": ">for everything else AMD is as good as nvidea while being cheaper\n\nNo fucking way lmao. DLSS completely shits on FSR3 especially with the new transformer DLSS4 update. I would not touch an AMD card until we see how FSR4 performs later this year.",
                          "score": 2,
                          "created_utc": 1738846679.0,
                          "replies": [
                            {
                              "id": "mbaiyl5",
                              "author": "AgentOfSPYRAL",
                              "body": "Mileage may vary of course but you can get an AMD card for a decent price that doesn’t even need upscaling.",
                              "score": 4,
                              "created_utc": 1738850222.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mba719y",
                          "author": "MakeThanosGreatAgain",
                          "body": "I'd pay for it right now if I could actually buy it from a retailer.",
                          "score": 1,
                          "created_utc": 1738845790.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mbakwdp",
                      "author": "RxBrad",
                      "body": "Honestly, as a RTX3070 owner, I've been totally satisfied with the FSR3 & Lossless Scaling that Nvidia has locked me into.  This is *actually playing the games* and not pixel-peeping zoomed-in cherrry-picked slow-mo YouTube clips.\n\nIf the RX9070XT sells for under $600 -- There's a high likelihood I'm switching back to AMD again.",
                      "score": 1,
                      "created_utc": 1738850883.0,
                      "replies": []
                    },
                    {
                      "id": "mbaaohb",
                      "author": "blither86",
                      "body": "Does Ray tracing even make that much of a difference?",
                      "score": 1,
                      "created_utc": 1738847256.0,
                      "replies": [
                        {
                          "id": "mbacwi6",
                          "author": "ToastedGlass",
                          "body": "versed squeal yam frightening connect market gray correct foolish paint\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                          "score": 7,
                          "created_utc": 1738848083.0,
                          "replies": [
                            {
                              "id": "mbaemcd",
                              "author": "blither86",
                              "body": "I don't need to watch videos as I have direct experience. I recently completed Indiana Jones, for example. As I'm sure you know that only has a ray traced lighting model. In many other games that have both baked in lighting or ray tracing available I just don't see enough of an uplift to make it worth the huge performance trade off. I'd far prefer other visual settings and frame rate being higher. Appreciate it's personal preference.",
                              "score": -3,
                              "created_utc": 1738848712.0,
                              "replies": [
                                {
                                  "id": "mbah6of",
                                  "author": "ToastedGlass",
                                  "body": "unused pen intelligent snails unwritten desert absurd possessive wipe license\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                                  "score": 5,
                                  "created_utc": 1738849615.0,
                                  "replies": [
                                    {
                                      "id": "mbahdjc",
                                      "author": "blither86",
                                      "body": "Because I just don't see much of a difference.",
                                      "score": -2,
                                      "created_utc": 1738849681.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mbam7fx",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 2,
                          "created_utc": 1738851318.0,
                          "replies": [
                            {
                              "id": "mbard8w",
                              "author": "blither86",
                              "body": "I enjoyed playing OG Doom and, I think Doom 2 with it. In Portal it was okay but not enough to make me want to replay the whole game. It looks nice in Indiana Jones in many places but I feel like there's more to come. Sometimes it felt like light sources didn't cast enough light and other times it felt almost overly bright. The cut scenes did look pretty damn beautiful on many occasions though.",
                              "score": 1,
                              "created_utc": 1738852996.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mba937b",
              "author": "wildgirl202",
              "body": "The price increases have been insane, I do well but I just cannot justify a new card anymore",
              "score": 8,
              "created_utc": 1738846632.0,
              "replies": [
                {
                  "id": "mba9gg2",
                  "author": "MakeThanosGreatAgain",
                  "body": "It's sad because it feels like my heart is telling me to come to that conclusion as well. But If I can get a 5080 or 70ti it might be last for the foreseeable future",
                  "score": 1,
                  "created_utc": 1738846778.0,
                  "replies": [
                    {
                      "id": "mbaavri",
                      "author": "blither86",
                      "body": "What are you running now?",
                      "score": 1,
                      "created_utc": 1738847333.0,
                      "replies": [
                        {
                          "id": "mbaldre",
                          "author": "MakeThanosGreatAgain",
                          "body": "I have a 3080. Bought an open box 4080 Super in December and ended up returning it w hopes of getting a 5080. What a mistake that was\n\n3080 plays everything nice but even the jump to 4080 at my resolution was palpable. I definitely notice that it's gone and miss it\n\nI also built a new pc and planned to give this card/my old rig to my lady",
                          "score": 3,
                          "created_utc": 1738851045.0,
                          "replies": [
                            {
                              "id": "mbam1de",
                              "author": "blither86",
                              "body": "Sorry to hear about the return being something you regret! I play almost exclusively in 4k and have a 10gb 3080, too. Recently got a 180hz 1440p for competitive FPS but it doesn't get used all that much. I've found DLSS to be pretty helpful in both cases. Black ops 6 upscaling with DLSS is scary good, even from a really low native res!\n\nPersonally I'm going to wait several more years as I just don't see the value in the market at the moment.",
                              "score": 1,
                              "created_utc": 1738851262.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mba7pjd",
          "author": "t0FF",
          "body": ">There are very few people who have that kind of capital to invest in a new card with very little increase in benchmark.\n\nProblem is lack of options for people building a new PC, with hight-end GTX4000 going out of stock, no mid-end GTX5000 available yet, and AMD next generation not available before at least a couple of months.\n\nAs of now there is really no option a for thoses who want to build a PC aiming on 4K resolution.",
          "score": 6,
          "created_utc": 1738846070.0,
          "replies": [
            {
              "id": "mbb0umz",
              "author": "V1pArzZz",
              "body": "7900xt(x) and 4080s should be findable no?",
              "score": 2,
              "created_utc": 1738855846.0,
              "replies": [
                {
                  "id": "mbbmje1",
                  "author": "t0FF",
                  "body": "4080 is going to get increasingly hard to find, I just checked biggest french webshop, it's already out of stock on it, all models. 7900xtx is findable on it, about half models in stocks.",
                  "score": 3,
                  "created_utc": 1738861896.0,
                  "replies": []
                },
                {
                  "id": "mbbpgkt",
                  "author": "EHP42",
                  "body": "7900xt(x) prices are going up and they're getting hard to find after the paper launch of Nvidia's 5xxx series.",
                  "score": 1,
                  "created_utc": 1738862704.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbhuvgw",
              "author": "diabbb",
              "body": "> and AMD next generation not available before at least a couple of months.\n\n9070 coming in march.",
              "score": 1,
              "created_utc": 1738943777.0,
              "replies": []
            },
            {
              "id": "mbal6y9",
              "author": "wh1pp3d",
              "body": "RTX",
              "score": 1,
              "created_utc": 1738850982.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mba6b2f",
          "author": "Lubenator",
          "body": "I think you're unfortunately mistaken. I'm shopping for a card rn and the only 4090s i can find are new and 3k+ or used for well over msrp. The only new 4090s that don't immediately disappear on restock are 3800.",
          "score": 11,
          "created_utc": 1738845482.0,
          "replies": [
            {
              "id": "mbamivm",
              "author": "karlzhao314",
              "body": "Not sure if this is an option you're open to, but Dell has prebuilts with 4090s in them for less than what 4090s alone are going for. In particular, the cheapest config of the Dell Tower Plus with a 4090 (Core Ultra 7 265, 1x16GB DDR5, 512GB NVMe, RTX 4090) is $3130.\n\nIf you have a Dell discount through your employer that could come down as low as $2800.\n\nThe Dell OEM 4090 isn't bad, and it's also one of the smallest ones. Shucking the GPU, CPU, RAM, and SSD, and junking the rest, might be one of the cheaper ways to build a 4090 PC right now.\n\nI managed to get a similar deal two weeks ago (14900KF, 32GB DDR5, 2TB NVMe, RTX 4090) for $2600. That's never felt like a better decision than now.",
              "score": 3,
              "created_utc": 1738851423.0,
              "replies": [
                {
                  "id": "mbaobst",
                  "author": "Lubenator",
                  "body": "I appreciate your insight, thank you!",
                  "score": 1,
                  "created_utc": 1738852014.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mba9d8x",
              "author": "IndyPoker979",
              "body": "I just picked up a 4070 last month for $400 USD. Are you stuck on a 4090?",
              "score": -5,
              "created_utc": 1738846743.0,
              "replies": [
                {
                  "id": "mba9tqo",
                  "author": "Lubenator",
                  "body": "OP is talking about 5080 and 5090. 4070 isn't comparable. I'm looking for 5090, 5080, 4090, 4080 super, 3090, or 3090 ti. Until 5070 ti drops and I snag one to put me out of my graphica card misery. But its not like thats what I want, it'd just be my placehold for the next 0-2 years until I can get a solid 24gb card from nvda.",
                  "score": 8,
                  "created_utc": 1738846924.0,
                  "replies": [
                    {
                      "id": "mbaajdl",
                      "author": "IndyPoker979",
                      "body": "Yeah you had mentioned the 4090 so I was curious if you needed an upgrade right now. \n\nUntil the 50** or 4090 drop,  I've been suggesting people stick with the 70s if they are budget conscious.  The benchmarks are still high enough that nothing new coming out will have any issues.",
                      "score": 0,
                      "created_utc": 1738847201.0,
                      "replies": [
                        {
                          "id": "mbab8vv",
                          "author": "Lubenator",
                          "body": "I am building my first desktop. I need a graphics card and have a high budget, but I'm not paying way way way over msrp for new cards often from drop shippers or used cards without warranties. It's been harder than expected, I asked a few friends for advice and they all talked me out of worrying about tarrifs and shortages. Now here we are and I can't find anything better than a 70 for a fair price.",
                          "score": 4,
                          "created_utc": 1738847471.0,
                          "replies": [
                            {
                              "id": "mbacxm6",
                              "author": "IndyPoker979",
                              "body": "I've had several friends that have bought prefab because the card in it was worth the price of the entire PC. It's tough to be a DIY pc in today's market.",
                              "score": 3,
                              "created_utc": 1738848094.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mbcg8nv",
                  "author": "Xumayar",
                  "body": "4070's have gone up in price recently, new ones are all $600+\n\nI couldn't even find a used one for less than $550",
                  "score": 1,
                  "created_utc": 1738870074.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mba8kz3",
          "author": "Undeadafrican",
          "body": "I’d buy one right now if it was available! I’m sure tons of others would. There’s literally no high end gaming gpu’s available right now",
          "score": 3,
          "created_utc": 1738846427.0,
          "replies": []
        },
        {
          "id": "mbaerkq",
          "author": "ianlulz",
          "body": "I’m sorry and I don’t mean this rudely but you’re way out of touch with the reality of the current market. It is firmly a sellers market at the moment due to rock-bottom supply, and MSI and Asus raised their prices to reflect the scarcity compared to the demand. 5080s and 5090s of any brand at any price from any retailer are selling out within seconds of being listed or restocked, and 5090s are selling for thousands over list base MSRP on the secondary market. Even last-gen cards are now growing difficult to find and are selling for near their MSRP for years old used cards. \n\n\nThis is all before the incoming uncertainty by trumps threatened tariffs, which is sure to reflect in the price as well. Not to mention your point of nvidias “bread and butter” being the consumer PC, which is false; Nvidia makes the lions share of their sales from data centers and bulk purchases.\n\n\nI may not like it and I may not support their costs, but that’s the reality of the situation today.",
          "score": 5,
          "created_utc": 1738848765.0,
          "replies": []
        },
        {
          "id": "mba9m8u",
          "author": "awen478",
          "body": "It probably still sold out because how low the stock is",
          "score": 2,
          "created_utc": 1738846842.0,
          "replies": [
            {
              "id": "mbaama2",
              "author": "IndyPoker979",
              "body": "That and scalpers just like last time",
              "score": 1,
              "created_utc": 1738847233.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbabt3a",
          "author": "Kataclysmc",
          "body": "They are selling out within minutes and there is ridiculously low stock",
          "score": 2,
          "created_utc": 1738847680.0,
          "replies": []
        },
        {
          "id": "mba50wb",
          "author": "Blindfire2",
          "body": "Yeah I saw this last night when they released the newegg bundles, the 1300 psu+ gpu bundle went up to 1500 or 1600, I gave up. $1400 was max I'm willing to spend, but bots make this shit 10x worse so I'm just going to wait and hope I'm not dead when/if this shit gets fixed",
          "score": 2,
          "created_utc": 1738844923.0,
          "replies": [
            {
              "id": "mba5stv",
              "author": "kevin7254",
              "body": "1500? Come to Sweden and it’s double that. If it costed 1500 here I would’ve bought 10 (not really but that would have been an insane price)",
              "score": 0,
              "created_utc": 1738845264.0,
              "replies": [
                {
                  "id": "mba6qma",
                  "author": "Blindfire2",
                  "body": "Zz",
                  "score": -6,
                  "created_utc": 1738845665.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mbat5iv",
          "author": "hey_you_too_buckaroo",
          "body": "I think you underestimate the number of lemmings out there.",
          "score": 1,
          "created_utc": 1738853555.0,
          "replies": []
        },
        {
          "id": "mbaxrxs",
          "author": "sometipsygnostalgic",
          "body": "If the card costs 10x to 100x the value of production, and they sell only a tenth of their stock, theyre still making money.\n\nThe scalping is good for them because it means they are selling 100% of their stock.\n\nThe question of sustainability is how much development of these cards cost and whether that money can cover it, but with nvidia being as valuable as it is right now because of them, they see stars in their eyes. They have already made back the development cost. The only thing thatd shake them is a market crash big enough to shake the entire tech industry.",
          "score": 1,
          "created_utc": 1738854949.0,
          "replies": []
        },
        {
          "id": "mbbupl2",
          "author": "asker509",
          "body": "The 5080 is going to turn into the 4080 all over again at these prices. \n\nI think Nvidia is seriously underestimating the alternatives this time compared to the 3000 series.\n\nPeople couldn't leave their houses, consoles were also difficult to buy, and AMD couldn't meet demand because they were on the TSMC node. \n\nIt's way different this time and the card has horrible price/performance.",
          "score": 1,
          "created_utc": 1738864145.0,
          "replies": []
        },
        {
          "id": "mbbvfpk",
          "author": "IvaNoxx",
          "body": "Why do you think that only people with 40 series are buying new gpus ?",
          "score": 1,
          "created_utc": 1738864343.0,
          "replies": []
        },
        {
          "id": "mba44cd",
          "author": "ggallardo02",
          "body": "Their bread and butter market, the PC gamer?  \n  \nEdit: [https://www.visualcapitalist.com/nvidia-revenue-by-product-line/](https://www.visualcapitalist.com/nvidia-revenue-by-product-line/)",
          "score": 1,
          "created_utc": 1738844521.0,
          "replies": [
            {
              "id": "mba5eb4",
              "author": "FlowBot3D",
              "body": "Are ASUS and MSI gaming cards going into datacenters? \n\nNo, those are the custom built H100s.",
              "score": 12,
              "created_utc": 1738845088.0,
              "replies": []
            },
            {
              "id": "mba5s9f",
              "author": "IndyPoker979",
              "body": "That is a great chart. What that says to me is that in the past 6 years, gamers have decided the cost is becoming too expensive, and so they're keeping the cards they have as games have not needed to upgrade. I would love to see a larger chart to see if the past 5/6 years is a distinct change or if it was just a blip when everyone upgraded to a new card (1080/2070 to 3070/4070). I will say that this past few years, the trend seems to have changed, but for me, that indicates they are pricing themselves out of the GPU market for the average user.\n\nReally nice visual though!",
              "score": 3,
              "created_utc": 1738845256.0,
              "replies": [
                {
                  "id": "mba7n8m",
                  "author": "ggallardo02",
                  "body": "That's because that's what you wanna see. I asked chatGPT for actual numbers instead of percentages, let's have a look:\n\n\n\nNVIDIA's revenue from its Gaming and Data Center segments has evolved significantly between 2019 and 2024. Here's a detailed breakdown:\n\n**Fiscal Year 2019:**\n\n* **Gaming:** $5.52 billion\n* **Data Center:** $2.93 billion\n\n**Fiscal Year 2020:**\n\n* **Gaming:** $5.52 billion\n* **Data Center:** $2.98 billion\n\n**Fiscal Year 2021:**\n\n* **Gaming:** $7.76 billion\n* **Data Center:** $6.70 billion\n\n**Fiscal Year 2022:**\n\n* **Gaming:** $12.46 billion\n* **Data Center:** $10.61 billion\n\n**Fiscal Year 2023:**\n\n* **Gaming:** $9.07 billion\n* **Data Center:** $15.01 billion\n\n**Fiscal Year 2024:**\n\n* **Gaming:** $10.4 billion\n* **Data Center:** $47.5 billion\n\n  \nSeems to me that the obvious answer is that the Gaming market barely moves, and look at the Data center, from 3B to 47B in 5 years.\n\n  \nSo, as I mentioned before, their bread and butter market is not the PC gaming anymore, and that's because the growth in AI, not because their GPU prices.",
                  "score": -8,
                  "created_utc": 1738846044.0,
                  "replies": [
                    {
                      "id": "mba96jp",
                      "author": "IndyPoker979",
                      "body": "Can you ask what the numbers are since 2010? I ask because I agree that the gaming community has had less of the market share.  I'm curious about longer trends. Forgive my ignorance, but I'm not sure why graphics power translates into AI centers. \n\nI don't think you're wrong it just is a little melancholy that the market that gave Nvidia its start is forgotten.",
                      "score": 2,
                      "created_utc": 1738846668.0,
                      "replies": [
                        {
                          "id": "mbac663",
                          "author": "ggallardo02",
                          "body": "I'm sad about that too. I feel like to NVidia, gamers barely matter numerically anymore, and not only that, they have all those price increases, less efficient cards, new lines that barely improve on the last ones, and their revenue in gaming grew. So yeah.\n\n  \n**Fiscal Year 2018:**\n\n* **Gaming:** $5.513 billion\n* **Data Center:** $1.932 billion\n\n**Fiscal Year 2017:**\n\n* **Gaming:** $4.060 billion\n* **Data Center:** $830 million\n\n\n\n**Fiscal Year 2016:**\n\n* **Gaming:** $3.166 billion\n* **Data Center:** $339 million\n\n\n\n**Fiscal Year 2015:**\n\n* **Gaming:** $2.207 billion\n* **Data Center:** $151 million\n\n\n\n**Fiscal Year 2014:**\n\n* **Gaming:** $2.292 billion\n* **Data Center:** $82 million\n\n\n\n**Fiscal Year 2013:**\n\n* **Gaming:** $2.413 billion\n* **Data Center:** $50 million",
                          "score": -2,
                          "created_utc": 1738847815.0,
                          "replies": [
                            {
                              "id": "mbaclzv",
                              "author": "good-prince",
                              "body": "Source of data?",
                              "score": 1,
                              "created_utc": 1738847977.0,
                              "replies": [
                                {
                                  "id": "mbadchl",
                                  "author": "ggallardo02",
                                  "body": "As I said before, ChatGPT. Pretty sure it linked a source when I asked, but I didn't save it.",
                                  "score": -3,
                                  "created_utc": 1738848247.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mbacoqn",
                              "author": "IndyPoker979",
                              "body": "Thanks for the extra data.  Just a sign of the times it seems.",
                              "score": 0,
                              "created_utc": 1738848004.0,
                              "replies": [
                                {
                                  "id": "mbav1ra",
                                  "author": "nastharl",
                                  "body": "It was from chatgpt, none of that is even real.",
                                  "score": 2,
                                  "created_utc": 1738854131.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mbaaa8f",
                      "author": "sorrylilsis",
                      "body": "> Gaming market barely moves\n\nI mean gaming sales are actually pretty damn good considering how much prices have inflated. There has never been so many PC players. the last few years have been fairly incredible from a market POV.",
                      "score": 2,
                      "created_utc": 1738847103.0,
                      "replies": [
                        {
                          "id": "mbaawj6",
                          "author": "ggallardo02",
                          "body": "Yeah, I misspoke there. And that's even sadder for gamers.",
                          "score": 1,
                          "created_utc": 1738847341.0,
                          "replies": []
                        },
                        {
                          "id": "mbb1rr4",
                          "author": "V1pArzZz",
                          "body": "Then again now upgrade pace is much slower now, ive switched CPU twice and GPU 4 times in nearly 15 years and been consistently mid-high end. Pre 2010 pcs became dinosaurs much faster with the higher progress rate.",
                          "score": 1,
                          "created_utc": 1738856112.0,
                          "replies": [
                            {
                              "id": "mbb2ge3",
                              "author": "sorrylilsis",
                              "body": "Yeah upgrade cycles are longer but even taking that into account plus the economic cycles the market is growing regularly. Hell gaming generally vastly outperforms the wider PC market.\n\n5 years ago Nvidia would have killed to do the number their gaming division is pulling today.",
                              "score": 1,
                              "created_utc": 1738856309.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mba5qnr",
              "author": "Edward_TH",
              "body": "For graphic cards? Yeah. Data centers accelerators may use the same processor but aren't strictly graphic cards anymore, they're more akin to ASICs than graphic cards.",
              "score": 2,
              "created_utc": 1738845237.0,
              "replies": [
                {
                  "id": "mba83k9",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1738846230.0,
                  "replies": [
                    {
                      "id": "mbadpjm",
                      "author": "Edward_TH",
                      "body": "The die, yes. But where those dies gets on differs in lots of ways and it's not always graphic oriented. 3rd parties generally uses the dies for GPUs, while nVidia itself pumps much more data centers stuff. Hell, those data center cards are sometimes not even capable to output a video signal!\n\n\nIf a 3rd party announces a price increase on a GPU line without specifying which specific product is gonna suffer from them, it's generally pretty safe to assume they will be graphic cards unfortunately.",
                      "score": 1,
                      "created_utc": 1738848381.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mback8b",
          "author": "paradoxbound",
          "body": "My next build will be a a 5090 but I’m simply buying a Founders Edition. The days of Asus and MSI bringing value to the Nvidia model are over.",
          "score": -2,
          "created_utc": 1738847959.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbb3l53",
      "author": "None",
      "body": "[deleted]",
      "score": 5,
      "created_utc": 1738856632.0,
      "replies": [
        {
          "id": "mbbz6pg",
          "author": "Brofessor-0ak",
          "body": "The only frustrating thing is now game devs are relying heavily on DLSS and other gimmicks to make up for their lack of quality coding and poor efficiency. Reducing settings can only do so much.",
          "score": 3,
          "created_utc": 1738865371.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbad9vh",
      "author": "Inksrocket",
      "body": "This continues as long as people buy. Its that simple.\n\nI havent seen single AAA, or Graphically intenseive indie, that would justify paying **999 - 3000** usd to play it at relatively high FPS\\* and ultra/high. Hell, I dont even care if the game looks like reality, is massive open world and plays at 120 fps with 5090. I aint paying even if I could.\n\n\\*with or without frame-gen",
      "score": 8,
      "created_utc": 1738848221.0,
      "replies": []
    },
    {
      "id": "mba92n3",
      "author": "contraryrhombus",
      "body": "I wanted an MSI card, but the price was outrageous.",
      "score": 2,
      "created_utc": 1738846625.0,
      "replies": []
    },
    {
      "id": "mbamko0",
      "author": "manofth3match",
      "body": "Just don’t buy them",
      "score": 2,
      "created_utc": 1738851440.0,
      "replies": []
    },
    {
      "id": "mbaq7gy",
      "author": "OBERBOSSPLAYER",
      "body": "Some ppl still buy it so it's pretty smart tbh.\n\nI'll stick to the 4070ti I bought used for 600€ a year ago. Not too much of a performance gap but the price gap is insane.",
      "score": 2,
      "created_utc": 1738852624.0,
      "replies": []
    },
    {
      "id": "mbatdo8",
      "author": "ballmode",
      "body": "Still rocking my 1070ti but I want to upgrade...",
      "score": 2,
      "created_utc": 1738853624.0,
      "replies": [
        {
          "id": "mbazn45",
          "author": "rumski",
          "body": "I’ve rocked a bone stock 1080 since launch and just upgraded to a 5080. Hasn’t arrived yet but I’m anxious 😬. Yeah I’ve watched all the reviews saying it doesn’t perform as well as a 4090 but I have a 1080 lol. It will be an improvement 🤣",
          "score": 2,
          "created_utc": 1738855497.0,
          "replies": [
            {
              "id": "mbbof4w",
              "author": "Zynbab",
              "body": "Lol I'm in a similar boat. Crazy seeing all these people that say \"you know what? I think I'm going to keep my 4080s! Take that Nvidia!\"\n\nLike regardless of prices, upgrading your gpu every release is insane. And the number of people who seem to think they're entitled to doing it too. All so they can play video games. Nuts.",
              "score": 2,
              "created_utc": 1738862418.0,
              "replies": []
            },
            {
              "id": "mbb3o18",
              "author": "ballmode",
              "body": "I'll be trying to get a 5070 if the benchmarks are solid... if not I'll wait to see how those new AMD GPUs are in March\n\nThat 5080 should do you well!",
              "score": 1,
              "created_utc": 1738856654.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbbl0zv",
      "author": "lucidzfl",
      "body": "You guys think this is related to tariffs or just price increases?",
      "score": 2,
      "created_utc": 1738861474.0,
      "replies": [
        {
          "id": "mbcktkt",
          "author": "ComputeBeepBeep",
          "body": "I don't actually think this is the tariffs, at least not solely. The biggest complaint from the manufacturers has been that the profit margin was way too low on these, sometimes 100 USD or less. They likely are doing this to increase the margin as well as cover any new costs. The price hike of 400 USD is far more than the tariff amounts.",
          "score": 0,
          "created_utc": 1738871345.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbboyiq",
      "author": "TQilla",
      "body": "Simple solution: ignore scalpers, buy AMD",
      "score": 2,
      "created_utc": 1738862567.0,
      "replies": []
    },
    {
      "id": "mbc1f4d",
      "author": "omikias",
      "body": "Shit like this is why I switched to a full AMD build.",
      "score": 2,
      "created_utc": 1738866003.0,
      "replies": []
    },
    {
      "id": "mbcbfuh",
      "author": "Puzzleheaded_Low_619",
      "body": "I'm holding out until a new Elder Scrolls. I've got years.",
      "score": 2,
      "created_utc": 1738868752.0,
      "replies": []
    },
    {
      "id": "mbcexbf",
      "author": "IHkumicho",
      "body": "Prices increased by about 10%, and Trump just instituted a new 10% tax on everything imported from China...\n\nCoincidence?",
      "score": 2,
      "created_utc": 1738869710.0,
      "replies": [
        {
          "id": "mbcqdrd",
          "author": "Serikan",
          "body": "Aren't the chips from Taiwan, which is only China depending on who you ask?",
          "score": 1,
          "created_utc": 1738872882.0,
          "replies": [
            {
              "id": "mbcqwis",
              "author": "IHkumicho",
              "body": "You're probably right? Just assumed that all that stuff was made in China...",
              "score": 1,
              "created_utc": 1738873027.0,
              "replies": [
                {
                  "id": "mbdph4u",
                  "author": "Serikan",
                  "body": "They have all the factories for manufacturing micro chips in Taiwan; they guard the secrets of making them closely. This is why China wants to reclaim Taiwan and the USA wants them to remain sovereign",
                  "score": 1,
                  "created_utc": 1738882729.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mbd5vyi",
      "author": "oaksyy_",
      "body": "1070 ti lasted forever and my 3070 ti is gonna last a long time. i’m patient",
      "score": 2,
      "created_utc": 1738877123.0,
      "replies": []
    },
    {
      "id": "mbfze5h",
      "author": "None",
      "body": "As long as NVIDIA abuses the monopoly they're in I am not buying any new GPU.",
      "score": 2,
      "created_utc": 1738913688.0,
      "replies": []
    },
    {
      "id": "mbidwek",
      "author": "BritishAnimator",
      "body": "Thou shall not be shafted! They are off my Christmas list.",
      "score": 2,
      "created_utc": 1738949170.0,
      "replies": []
    },
    {
      "id": "mba850d",
      "author": "ZainTheOne",
      "body": "My 4080S looking so good rn",
      "score": 3,
      "created_utc": 1738846247.0,
      "replies": [
        {
          "id": "mbaxtqo",
          "author": "chadhindsley",
          "body": "Give it here malfoy",
          "score": 2,
          "created_utc": 1738854964.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbcj7tq",
      "author": "Leaksahoy",
      "body": "Call it what it is: Price Fixing. Call the EU regulatory board, in AU call the ACCC, demand that these companies be investigated for coordinating efforts to raise GPU prices. We just have to show they did it at the same time, they are guilty by conduct. The US won't do it, but the rest of you can.",
      "score": 3,
      "created_utc": 1738870902.0,
      "replies": []
    },
    {
      "id": "mba7k6h",
      "author": "Ven18",
      "body": "And this kind of thing is why I am fine being a console gamer. When 1 piece of a build is more expensive than my entire console I don’t care how much FPS you get it’s not worth it.\n\nEdit I somehow completely forgot that mods exist and now feel very dumb so for people who are like mods fair play.",
      "score": 5,
      "created_utc": 1738846008.0,
      "replies": [
        {
          "id": "mbaafgg",
          "author": "Dirty_Dragons",
          "body": "Lol, it's a hell of a lot more than FPS.",
          "score": 14,
          "created_utc": 1738847159.0,
          "replies": [
            {
              "id": "mbad3mg",
              "author": "kevihaa",
              "body": "Care to elaborate?  We’re basically 3 generations deep into the *vast* majority of games being developed for consoles with PC as an afterthought. \n\nLike, Cyberpunk released 4 years ago and is *still* used as a benchmark both for whether PCs can finally run it maxed out at 100+ FPS (still not possible without DLSS) and as basically the only example of when there is a truly significant gap in visual fidelity between a $600 console and a $1500 GPU.",
              "score": -7,
              "created_utc": 1738848157.0,
              "replies": [
                {
                  "id": "mbaeydn",
                  "author": "Dirty_Dragons",
                  "body": "The primary reason why I prefer pc gaming is mods.\n\nAnd of course I want my games to look good. I don't care about getting 300 fps. I just want 4k @ 60. Which unfortunately the vast majority of games on console aren't.\n\nFinal Fantasy Rebirth on PS5 is 4k @ 30. Or 1152p @ 60.\n\nAm I an elitist for not wanting to play at 30 FPS?",
                  "score": 9,
                  "created_utc": 1738848832.0,
                  "replies": [
                    {
                      "id": "mbaxs0w",
                      "author": "btown1987",
                      "body": "I completely agree. That's why this whole current GPU conversation is just completely unhinged. \n\nThe reality is that cards from two generations ago will play fine at 4k with dlss/fsr at 80+ fps. These idiots are shelling out thousands to watch an fps counter go higher and wouldn't even be able to tell a difference without the counter turned on.",
                      "score": 3,
                      "created_utc": 1738854950.0,
                      "replies": []
                    },
                    {
                      "id": "mbb63hh",
                      "author": "ModsRTryhards",
                      "body": "I agree with you but he doesn't make a terrible point. It will all come down to preferences and $. But there are a decent amount of games that run 4k at 60. I just finished Cyberpunk, that's one of em. \n\nI think going forward the 40k at 60 is going to be pretty prevalent. So if that's all you need, and you aren't loaded or craving mods, a console is a fantastic option.\n\nI want a gaming PC. I haven't had one since 2019 when I lost a job and sold it to my friend since I needed to keep paying bills. I have a PS5 because in the mean time it was an affordable option. And I'm still not buying all the components for a PC for a while I'm guessing.\n\nFor someone who doesn't already own a gaming PC, consoles are a great option in this current market. I thought that was his main point I duno.",
                      "score": 2,
                      "created_utc": 1738857341.0,
                      "replies": [
                        {
                          "id": "mbbq4c9",
                          "author": "Dirty_Dragons",
                          "body": ">I agree with you but he doesn't make a terrible point. It will all come down to preferences and $.\n\nIt irked me a little when he made it seem that a $1,500 GPU is required for PC gaming, which of course isn't true. Also he made it seem that he only benefit to PC gaming was high FPS. The other major benefit to a gaming PC is emulation. Right now the best way to play Bloodborne, is on PC.\n\n>I think going forward the 40k at 60 is going to be pretty prevalent. \n\nI hope so. Nobody should be playing at 30 FPS in 2025. \n\nSucks about you losing your job and having to sell the computer. Hopefully you'll be able to get another soon. And yeah, the 5000 series GPU is rough.",
                          "score": 2,
                          "created_utc": 1738862886.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mbai16t",
                  "author": "Sorcerious",
                  "body": "I personally like options, and don't like being locked into the prices that Sony decides, or being at the mercy of the second hand market.\n\nAnd with a little knowhow you can put together a PC that's more powerful and versatile than any console. The console strength is ease of use, not power.\n\nI have both a PC and PS5, and depending on the mood I can play a game on the couch or in the chair. Why I don't play from a PC while sitting on the couch while I could do that? Console exclusives.",
                  "score": 3,
                  "created_utc": 1738849906.0,
                  "replies": [
                    {
                      "id": "mbaj6ty",
                      "author": "kevihaa",
                      "body": ">I personally like options, and don’t like being locked into the prices that Sony decides, or being at the mercy of the second hand market.\n\nSony doesn’t dictate the cost of third party PS5 games, and they take the same cut that Valve takes on Steam\n\n>And with a little knowhow you can put together a PC that’s more powerful and versatile than any console. The console strength is ease of use, not power.\n\nNot for the same price, and the only time it even gets close is at the end of a console generation. And that still often assumes you’re comparing *just* the cost of a GPU to the cost of the console.",
                      "score": -4,
                      "created_utc": 1738850300.0,
                      "replies": [
                        {
                          "id": "mbc2qu0",
                          "author": "Sorcerious",
                          "body": "... Our discussion ends here, get your facts straight before defending something.",
                          "score": 1,
                          "created_utc": 1738866366.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mba95kv",
          "author": "-Inyafaze-",
          "body": "I get it somewhere, ive been on Budget builds my whole life and now that im getting older and have more money I dream of building a high end PC. I'd never pay these prices, it's too scummy for me, but i get the people who don't look too much into it and just get whatever dream-config they want. It's a shame that we people as a collective can't hold back on buying cards for these prices, we will probably never set a sign for nvidia/scalpers.",
          "score": 4,
          "created_utc": 1738846658.0,
          "replies": [
            {
              "id": "mbahx6n",
              "author": "panisch420",
              "body": "even as gaming enthusiast there is no need to pay  1000 bucks or more for a GPU. AMD has  plenty very good options in  a 300-600 price range",
              "score": 1,
              "created_utc": 1738849868.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbalbe6",
          "author": "gbghgs",
          "body": "The obvious rejoinder is obviously that much more budget friendly cards exists, that give comparable performance to consoles, compared to these top end cards which go for ridiculous prices. \n\nThe less obvious one is that the costs even out a lot more once you consider the yearly subscriptions fees console players end up paying out for over the lifetime of a console and that your game libary on pc isn't tied to specific hardware the same way console games are.",
          "score": 1,
          "created_utc": 1738851022.0,
          "replies": []
        },
        {
          "id": "mbb8ioj",
          "author": "Simple-Reception4262",
          "body": "They used to be more comparable but the prices they want for this shit now is insane. $1000 used to get you a very solid gaming pc.",
          "score": 1,
          "created_utc": 1738858026.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbado4w",
      "author": "Luize0",
      "body": "I bought a second hand barely used PC off someone with a rtx 3090 right before 4090 game out. Honestly quite happy, especially with LLMs.",
      "score": 4,
      "created_utc": 1738848367.0,
      "replies": []
    },
    {
      "id": "mbai30d",
      "author": "I_T_Gamer",
      "body": "Stop feeding the scalpers.   If you MUST have a 5090, wait a bit or accept the uptick.  I typically buy used, look for someone you know personally or find a seller that has been around for a year or more that doesn't just sell video cards.  Got my 4070Ti a month ago for $600.\n\nI see lots of folks chiming in happy with their 2080's.  I hope that persists for you.   For me, any UE5 game was taxing my 1080Ti hard.  It was time, it served me well.  The 2080 Super is essentially a 1080Ti with RTX, beware the incoming stable of games will for sure include more UE5 titles.",
      "score": 2,
      "created_utc": 1738849923.0,
      "replies": []
    },
    {
      "id": "mbaknvx",
      "author": "dargonmike1",
      "body": "They should have just started the price at 4k lol why should any common folk even dream of getting the newest gpu",
      "score": 2,
      "created_utc": 1738850803.0,
      "replies": []
    },
    {
      "id": "mbakqgw",
      "author": "positivcheg",
      "body": "Who the fuck still buys aSUS products after all that shit from that company?",
      "score": 2,
      "created_utc": 1738850827.0,
      "replies": []
    },
    {
      "id": "mbadiv5",
      "author": "MobileVortex",
      "body": "It feels like some of you are surprised lol",
      "score": 1,
      "created_utc": 1738848313.0,
      "replies": []
    },
    {
      "id": "mbajdg1",
      "author": "W1shm4ster",
      "body": "My goal of having a new computer next month for my birthday is getting out of reach more and more..",
      "score": 1,
      "created_utc": 1738850363.0,
      "replies": []
    },
    {
      "id": "mbaka4b",
      "author": "acyclovir31",
      "body": "If only there was a reason they’re jacking up the prices. “Curse you made in Taiwan!”\n\n![gif](giphy|9jVAv94PRzPoc)",
      "score": 1,
      "created_utc": 1738850673.0,
      "replies": []
    },
    {
      "id": "mbap3fb",
      "author": "Xero_id",
      "body": "This will sadly probably be my last venture thru pc gaming as the price is getting out of reach for me. I just built a new pc, first in 6 years and I've been waiting on a new gpu for 3 years now because of price. I'm still using a 1080 and it's on its final leg so I'll upgrade but this is the end for me sadly. I definitely don't have a life that can sustain buying a pc or gpu anymore so I'll be going the console route and life span.",
      "score": 1,
      "created_utc": 1738852261.0,
      "replies": []
    },
    {
      "id": "mbapxmk",
      "author": "crazy_muffins",
      "body": "Well, at least GN are going to have a enjoyable informative opinion piece about this!",
      "score": 1,
      "created_utc": 1738852535.0,
      "replies": []
    },
    {
      "id": "mbarpgb",
      "author": "Avilionv91",
      "body": "Might just switch to console gaming after my 3080 dies out. This shit is absurd.",
      "score": 1,
      "created_utc": 1738853103.0,
      "replies": []
    },
    {
      "id": "mbayohd",
      "author": "RelentlessTriage",
      "body": "You guys really would be fine with lesser cards. Don’t support this shit",
      "score": 1,
      "created_utc": 1738855215.0,
      "replies": []
    },
    {
      "id": "mbb57ie",
      "author": "nuclearwinterxxx",
      "body": "The playbook writes itself.",
      "score": 1,
      "created_utc": 1738857092.0,
      "replies": []
    },
    {
      "id": "mbb68cp",
      "author": "ThenExtension9196",
      "body": "Honestly I’m shocked they ever even released at MSRP.",
      "score": 1,
      "created_utc": 1738857379.0,
      "replies": []
    },
    {
      "id": "mbb7d2d",
      "author": "Simple-Reception4262",
      "body": "Who the hell is buying at these prices. Do people even mine crypto anymore? That was what was driving it before…",
      "score": 1,
      "created_utc": 1738857697.0,
      "replies": [
        {
          "id": "mc969q8",
          "author": "dlwiest",
          "body": "GPU mining is break even at best once you factor in energy prices, but now we have AI to drive up prices instead.",
          "score": 1,
          "created_utc": 1739308976.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbb7emg",
      "author": "EducationallyRiced",
      "body": "Is the meaning of affordable alien to them?\nAnd the definition of fixing a fucking price for Nvidia?",
      "score": 1,
      "created_utc": 1738857710.0,
      "replies": []
    },
    {
      "id": "mbb8lgo",
      "author": "macguy9",
      "body": "None of these cards are necessary. Not a single one. And it's our fault that they exist and that most normal people have to sell a kidney to purchase one.\n\nGame devs are releasing horrendously unoptimized garbage over and over, and we not only put up with it, we *encourage* it. We keep buying their shitty, unoptimized products and they laugh all the way to the bank with our money. They get paid; we get a product full of bugs and miserable frame rates.\n\nAnd who can blame them? Why would they spend the time and money to release a properly made and *complete* game when suckers out there will gladly pay $2500 USD on a card that can cover up their unoptimized garbage with AI frame generation? There's no motivation for them to do so.\n\nIf they actually released software that was finished, you could probably run most of these games on a 3080ti or a 4070. You don't need a 50-series card. Nobody does really. \n\nWe are literally paying software devs to be lazy and not do their jobs.\n\nI'm going to sound like a fossil now, but before the internet and 'day one patches'. game devs had to release a product that was completely done. There was no downloading patches to fix things. QA was actually a major job with significant implications; if you released more than one game with major issues, your studio died. Nobody bought your software, at all. But now? Just put a patch on the internet.\n\nYes, it's convenient for people. But it's made devs lazy, made GPU manufacturers laugh with glee as people pay outlandish prices for their products, and screwed customers.\n\nThe only way this is ever going to stop is if we as consumers say no more. Stop buying unnecessary hardware. Stop buying early access, bug-ridden games that only run at 20-30 FPS without frame gen. Tell them *no more*. \n\nUntil then, they'll keep screwing over the gamers because they can.",
      "score": 1,
      "created_utc": 1738858047.0,
      "replies": []
    },
    {
      "id": "mbbb68m",
      "author": "ItsMrChristmas",
      "body": "...meanwhile a whole ass PS5 Pro which plays the same games is $699",
      "score": 1,
      "created_utc": 1738858774.0,
      "replies": []
    },
    {
      "id": "mbbbyb9",
      "author": "Lardzor",
      "body": "Why should scalpers have all the fun.",
      "score": 1,
      "created_utc": 1738858991.0,
      "replies": []
    },
    {
      "id": "mbbbz28",
      "author": "SafeModeOff",
      "body": "The simple solution here is to not buy them",
      "score": 1,
      "created_utc": 1738858997.0,
      "replies": []
    },
    {
      "id": "mbbc7g0",
      "author": "bobbarkee",
      "body": "This is insane. For almost every consumer, these products haven't actually even been released yet. What garbage business practices.",
      "score": 1,
      "created_utc": 1738859061.0,
      "replies": []
    },
    {
      "id": "mbbdzed",
      "author": "XxAbsurdumxX",
      "body": "I’m just becoming more and more happy with the 4070 super I got at a discount price after the 50-series was launched",
      "score": 1,
      "created_utc": 1738859548.0,
      "replies": [
        {
          "id": "mbcdszh",
          "author": "elderly_squid",
          "body": "Went from a RX 580 to 4070 super few months ago. Can’t imagine needing something better. Thing’s nice as hell.",
          "score": 1,
          "created_utc": 1738869402.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbbe3bl",
      "author": "RobustCabbage",
      "body": "I’m running a pre-built with a 4060ti. I came from a rig that someone Frankensteined together and  gave me with a 970. I’m so happy with my rig currently.  Being able to play the games I always wanted to play at a decent level has been such a joy for me.",
      "score": 1,
      "created_utc": 1738859578.0,
      "replies": []
    },
    {
      "id": "mbbeod2",
      "author": "NegaDeath",
      "body": "......so I have to sell *both* kidneys now?",
      "score": 1,
      "created_utc": 1738859741.0,
      "replies": []
    },
    {
      "id": "mbbfacd",
      "author": "PwmEsq",
      "body": "Dang I really need an upgrade to by 1070ti",
      "score": 1,
      "created_utc": 1738859908.0,
      "replies": []
    },
    {
      "id": "mbbfcvt",
      "author": "Zeconation",
      "body": "Water is wet.",
      "score": 1,
      "created_utc": 1738859927.0,
      "replies": []
    },
    {
      "id": "mbbie7p",
      "author": "SuppleDude",
      "body": "Stick to Founder’s Edition card if you really want one and only pay MSRP.",
      "score": 1,
      "created_utc": 1738860755.0,
      "replies": []
    },
    {
      "id": "mbbigjh",
      "author": "SoraUsagi",
      "body": "And here I am still running my radeon RX580 I've had since it came out ...",
      "score": 1,
      "created_utc": 1738860773.0,
      "replies": []
    },
    {
      "id": "mbbiilq",
      "author": "cloudcity",
      "body": "loving the 3080 i picked up for $500 more and more every day",
      "score": 1,
      "created_utc": 1738860789.0,
      "replies": []
    },
    {
      "id": "mbbj7o9",
      "author": "X5690",
      "body": "I'm gaming 4K 144FPS on a 7900 GRE that was $520, I don't understand who is worried about these new cards.",
      "score": 1,
      "created_utc": 1738860977.0,
      "replies": []
    },
    {
      "id": "mbbkb1n",
      "author": "SolarSailer2022",
      "body": "I built my first-ever rig with a 3060 about 3 years ago, it's exactly enough for what I do (emulating old games, playing new stuff on low-medium)",
      "score": 1,
      "created_utc": 1738861274.0,
      "replies": []
    },
    {
      "id": "mbbqokb",
      "author": "MessiahPrinny",
      "body": "I'm glad I upgraded last year. It's embarrassing that the 5080 is only like 10 percent faster than my 4080 Super. The stagnation is real. I'm scared of what the 70 and 60 class performance look like.",
      "score": 1,
      "created_utc": 1738863041.0,
      "replies": []
    },
    {
      "id": "mbbrbpg",
      "author": "bah_nan_kah",
      "body": "Lol this is the kinda stuff that always comes to mind when I want to think about building a pc. Go from one rip off to another.",
      "score": 1,
      "created_utc": 1738863220.0,
      "replies": []
    },
    {
      "id": "mbbtpww",
      "author": "RailGun256",
      "body": "honestly i expect thia from Asus at this point. MSI less so but theyre corporations at the end of the day",
      "score": 1,
      "created_utc": 1738863877.0,
      "replies": []
    },
    {
      "id": "mbbuzhj",
      "author": "UniQue1992",
      "body": "Fucking scumbags.",
      "score": 1,
      "created_utc": 1738864221.0,
      "replies": []
    },
    {
      "id": "mbbwvez",
      "author": "Gigalisk",
      "body": "Yall better pay attention to Intel Arc they’re cheap and catching up in performance to NVIDIA’s low/mid tier offerings.  Competition benefits the consumer, but tariffs have negated ALL THAT.",
      "score": 1,
      "created_utc": 1738864734.0,
      "replies": [
        {
          "id": "mbeggfq",
          "author": "Newbianz",
          "body": "maybe once they fix their supported game issues with their drivers or whatnot \n\nuntil then its a crapshoot if they will work for a lot of games still",
          "score": 2,
          "created_utc": 1738891470.0,
          "replies": [
            {
              "id": "mcfwiuo",
              "author": "Gigalisk",
              "body": "The Alchrmist series had driver updates regularly and with regular performance bumps.  Hoping for the same.",
              "score": 1,
              "created_utc": 1739396775.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbbydnq",
      "author": "SNGGG",
      "body": "Curious how much this price is being affected by greed vs things like tariffs",
      "score": 1,
      "created_utc": 1738865146.0,
      "replies": []
    },
    {
      "id": "mbbzqrt",
      "author": "MrOphicer",
      "body": "They noticed everybody lining up to buy them, and even buying the scalper's overpriced stock and so on... why wouldn't they raise the price?",
      "score": 1,
      "created_utc": 1738865526.0,
      "replies": []
    },
    {
      "id": "mbc1k9d",
      "author": "bogdanadgob",
      "body": "I upgraded from a 1070 to a 4070 super.  I’m not going to upgrade again in 10 years lmao",
      "score": 1,
      "created_utc": 1738866041.0,
      "replies": []
    },
    {
      "id": "mbc4l81",
      "author": "adoniiiii",
      "body": "I love my 4080 super proart",
      "score": 1,
      "created_utc": 1738866873.0,
      "replies": []
    },
    {
      "id": "mbc7qdh",
      "author": "imdoctorwho",
      "body": "Thought spending 2500 in November on a prebuilt with an i9-13900/4080 super was a huge mistake but...maybe just teeny mistake seeing current GPU prices.",
      "score": 1,
      "created_utc": 1738867736.0,
      "replies": []
    },
    {
      "id": "mbc8dpb",
      "author": "lemonpepperlarry",
      "body": "Thank god I pulled the trigger on the 7900xt two weeks ago. Now I can ride out this shit storm in peace knowing 1440p ultra is guaranteed for me for a few years",
      "score": 1,
      "created_utc": 1738867912.0,
      "replies": []
    },
    {
      "id": "mbcblml",
      "author": "ziatonic",
      "body": "They might \"have\" to. EVGA left the biz because they were making no money on cards because Nvidia were undercutting them with the Founders Editions.",
      "score": 1,
      "created_utc": 1738868796.0,
      "replies": []
    },
    {
      "id": "mbcc5lf",
      "author": "Howboutnow82",
      "body": "I'm super glad I picked up a 4070 ti Super Last summer on a sale instead of waiting for the 50 series crap show.",
      "score": 1,
      "created_utc": 1738868949.0,
      "replies": [
        {
          "id": "mbdk71l",
          "author": "Pepparino",
          "body": "For how much? I thinking about getting one since it should run 4k games without many problems.\n\nIm on a 2070 super since 2019..",
          "score": 1,
          "created_utc": 1738881148.0,
          "replies": [
            {
              "id": "mbenqlh",
              "author": "Howboutnow82",
              "body": "I picked up the ASUS ROG model for $800 at the time, not sure what they go for now but it was like a $300 or so dollar discount at the time. I'm super happy with it but I don't do 4k gaming only 1440p. I think it's the perfect card for this resolution. \n\nFrom the reading I did at the time when trying to decide between the 4080 and the 4070 models, the 4080 did outperform the 4070 ti Super by a little bit in 4k gaming but the frame rates were still not good enough for me to want to grab a 4080 instead and start gaming in 4k. Up to you if the extra money is worth it or not for a few more frames in 4k.",
              "score": 1,
              "created_utc": 1738893928.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbcc9lw",
      "author": "elderly_squid",
      "body": "Imma run my 4070 super until it draws its very last breath",
      "score": 1,
      "created_utc": 1738868980.0,
      "replies": [
        {
          "id": "mbcqhnh",
          "author": "Serikan",
          "body": "I have a Gigabyte 3070 and the thing still demolishes games",
          "score": 1,
          "created_utc": 1738872912.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbccm1e",
      "author": "Alienhaslanded",
      "body": "Just in case poor people had a chance to buy them.",
      "score": 1,
      "created_utc": 1738869075.0,
      "replies": []
    },
    {
      "id": "mbccv3c",
      "author": "wrong_usually",
      "body": "I have a 4090 and won't have any reason to upgrade until the 6090, and that's only if I'm afraid taiwan gets hit by china.",
      "score": 1,
      "created_utc": 1738869144.0,
      "replies": []
    },
    {
      "id": "mbce3oi",
      "author": "tongii",
      "body": "And their restock still sold out in seconds. Makes the $1600 4090 seemed like a good deal now as planned isn’t it.",
      "score": 1,
      "created_utc": 1738869483.0,
      "replies": []
    },
    {
      "id": "mbcg28m",
      "author": "tupe12",
      "body": "I look away for 5 seconds and the price gets even larger",
      "score": 1,
      "created_utc": 1738870025.0,
      "replies": []
    },
    {
      "id": "mbcmbn9",
      "author": "BakaPhoenix",
      "body": "According to some leaks Nvidia dropped the price of the gpu before the announcement, is not the first time that Nvidia do stuff like this making aib taking the hate. If they produce the card to be sold at 1200 or 1400 can't expect them to then sell it to 1k after Nvidia change the price the same day it get announced",
      "score": 1,
      "created_utc": 1738871760.0,
      "replies": []
    },
    {
      "id": "mbcsh1z",
      "author": "VirginiaWillow",
      "body": "Welp, I feel even more lucky getting an msi card before that",
      "score": 1,
      "created_utc": 1738873462.0,
      "replies": []
    },
    {
      "id": "mbcte1b",
      "author": "Cocoasprinkles",
      "body": "It’s almost like they know I wanted to build a racing sim",
      "score": 1,
      "created_utc": 1738873716.0,
      "replies": []
    },
    {
      "id": "mbcv9g1",
      "author": "Fred_Oner",
      "body": "Imma stick to used cards then, idc if they are pricey for their age or that they're used. If we keep buying at these prices from these greedy ass companies, then they'll see it as an okay to keep pushing the boundry of how much they should charge. I wouldn't die if I don't have a new GPU but they'll definitely feel the pain when stocks drop. :)",
      "score": 1,
      "created_utc": 1738874232.0,
      "replies": []
    },
    {
      "id": "mbcvtgd",
      "author": "kalirion",
      "body": "I'll be getting a new prebuilt next Black Friday, I wonder if $2k will even be able to get me a 5800x3d w/ 4060 by that point...",
      "score": 1,
      "created_utc": 1738874381.0,
      "replies": []
    },
    {
      "id": "mbcyewq",
      "author": "jawshoeaw",
      "body": "Don’t buy them. My 3080 is huffing and puffing along just fine",
      "score": 1,
      "created_utc": 1738875083.0,
      "replies": []
    },
    {
      "id": "mbd5i1a",
      "author": "E3Special",
      "body": "I still have my 1070, I only play older games so I don’t care about a new card until mine actually dies. Screw this price gouging BS.",
      "score": 1,
      "created_utc": 1738877017.0,
      "replies": []
    },
    {
      "id": "mbdaxfg",
      "author": "Shebalied",
      "body": "still got a 1080TI",
      "score": 1,
      "created_utc": 1738878502.0,
      "replies": []
    },
    {
      "id": "mbdcblb",
      "author": "Hydraflux",
      "body": "I have a 2060. Got it in 2019. I feel like I have no choice but to upgrade at this point. I got a near unplayable score with everything set to lowest in 1080p on the Monster Hunter Wilds benchmark, which is a game I've been looking forward to for years. It just sucks because I feel like this is the worst time ever to upgrade. Then again, ever since the 3000 series launch, it feels like it's always the worst time to upgrade.",
      "score": 1,
      "created_utc": 1738878894.0,
      "replies": []
    },
    {
      "id": "mbdddj2",
      "author": "ashtefer1",
      "body": "I got a 4070, but I really wish I got a 7900 xt instead. Tariffs are gonna send prices through the roof and I have to hold on to this gpu for much longer than expected.",
      "score": 1,
      "created_utc": 1738879186.0,
      "replies": []
    },
    {
      "id": "mbdenum",
      "author": "Psychast",
      "body": "I feel bad for NVIDIA man, the 4090 was basically a 1.5 generation leap in terms of performance, there was no way the 5090 was gonna keep that pace. Still, a 25-30% increase in real frames (not DLSS 4) is quite impressive, getting that with a 25% increase to price AND power consumption is...less impressive.\n\nIDK anymore tho man, how high can the highest end cards go up in terms of price before the market for them bottoms out? NVIDIA seems determined to find that out, while they're doing that, I hope Intel keeps putting out banger cards (and gets a better PR team, that overblown CPU shit is all I hear about now w/ the B580).",
      "score": 1,
      "created_utc": 1738879551.0,
      "replies": []
    },
    {
      "id": "mbdp70v",
      "author": "happy-cig",
      "body": "Love getting my 4070s for below MSRP while people were saying to wait for the 5000 series. ",
      "score": 1,
      "created_utc": 1738882643.0,
      "replies": []
    },
    {
      "id": "mbdswsp",
      "author": "stumpycrawdad",
      "body": "Dang I just put my first pc back in October, bought a 4070 just in time I guess.",
      "score": 1,
      "created_utc": 1738883799.0,
      "replies": []
    },
    {
      "id": "mbdtt8n",
      "author": "PantherX69",
      "body": "I’m done being price gouged, I’m riding my 4090 to senility\n.",
      "score": 1,
      "created_utc": 1738884085.0,
      "replies": []
    },
    {
      "id": "mbdxog6",
      "author": "None",
      "body": "Do I keep my 4060 or get the 5080?",
      "score": 1,
      "created_utc": 1738885328.0,
      "replies": []
    },
    {
      "id": "mbe2sox",
      "author": "None",
      "body": "lmao at every last person even considering buying one of these.  You are most of the problem.",
      "score": 1,
      "created_utc": 1738887000.0,
      "replies": []
    },
    {
      "id": "mbe4x3e",
      "author": "Elgato01",
      "body": "Hey it’s not as bad as the price gouging happening over here in Costa Rica, a 5080 costs damn nearly 4k.",
      "score": 1,
      "created_utc": 1738887683.0,
      "replies": []
    },
    {
      "id": "mbe7ebe",
      "author": "TGPJosh",
      "body": "And I will continue to not buy them",
      "score": 1,
      "created_utc": 1738888493.0,
      "replies": []
    },
    {
      "id": "mbe81k1",
      "author": "RyanMakesNoise",
      "body": "I still have a 1070 TI and I guess I always will ¯\\_(ツ)_/¯",
      "score": 1,
      "created_utc": 1738888703.0,
      "replies": []
    },
    {
      "id": "mbecn4j",
      "author": "SarahArabic2",
      "body": "Sticking with my 4080 until it dies",
      "score": 1,
      "created_utc": 1738890204.0,
      "replies": []
    },
    {
      "id": "mbefz0b",
      "author": "Citycen01",
      "body": "Have a 4070, they can put those cards right up their greedy assholes.",
      "score": 1,
      "created_utc": 1738891310.0,
      "replies": []
    },
    {
      "id": "mbehouy",
      "author": "trowawHHHay",
      "body": "Looks like I should just order the liquid cooling set for my 3090 and continue to sit on it.",
      "score": 1,
      "created_utc": 1738891879.0,
      "replies": []
    },
    {
      "id": "mbehvrx",
      "author": "LosoTheRed",
      "body": "EVGA saw this coming. They not making money on these cards anymore so they need to raise the price.",
      "score": 1,
      "created_utc": 1738891942.0,
      "replies": []
    },
    {
      "id": "mbelvzv",
      "author": "h3rpad3rp",
      "body": "Yeah, the 5090 is $3-4000 Canadian, and the 5080 is about 2k. Nvidia can eat a dick, I'm not interested at those prices. \n\n My 3080 is still fine, and I think I paid too fucking much for that too TBH.",
      "score": 1,
      "created_utc": 1738893292.0,
      "replies": []
    },
    {
      "id": "mbes6j2",
      "author": "Neonisin",
      "body": "All of you who buy graphics cards at these prices deserve everything coming to you.",
      "score": 1,
      "created_utc": 1738895435.0,
      "replies": []
    },
    {
      "id": "mbeu879",
      "author": "LoudAndCuddly",
      "body": "Why shouldn’t they, fuck scalpers",
      "score": 1,
      "created_utc": 1738896138.0,
      "replies": []
    },
    {
      "id": "mbeyv91",
      "author": "Yayoistrong",
      "body": "I've had my card since 2017 that really needs changing.  God I hate this garbage.  Console gaming is going to be my go to from now on.",
      "score": 1,
      "created_utc": 1738897732.0,
      "replies": []
    },
    {
      "id": "mbeznh5",
      "author": "Electrical-Money6548",
      "body": "The 5070 is going to cost $799 upon release, mark my words. \n\nI already switched from Intel to AMD, looks like a NVIDIA to AMD move is in the cards for me when I get rid of my 4070.",
      "score": 1,
      "created_utc": 1738898003.0,
      "replies": []
    },
    {
      "id": "mbg8fmw",
      "author": "Less_Party",
      "body": "Would be cool if there was actual competition instead of AMD going ‘well here’s a card that’s almost as fast but lacks half the features, for the same price’ and Intel focusing exclusively on the highly coveted immediately obsolete segment.",
      "score": 1,
      "created_utc": 1738919184.0,
      "replies": []
    },
    {
      "id": "mbgdbvz",
      "author": "roehnin",
      "body": "I don’t care about the price as much as the fact none seem to be released in my country at all",
      "score": 1,
      "created_utc": 1738922264.0,
      "replies": []
    },
    {
      "id": "mbgrt4p",
      "author": "Exe0n",
      "body": "The craziest thing is the 4000 series are still available, heck AMD's 7000 and 6000 series are offering even more value now.\n\nWhy buy a 5080 for +1800$ when you can buy a 7900 XTX for 800-900$?\nRT and DLSS are not worth +900$.",
      "score": 1,
      "created_utc": 1738930223.0,
      "replies": []
    },
    {
      "id": "mbgx7gf",
      "author": "LouisSal",
      "body": "Seriously I’m not seeing why you need to upgrade if you have 20, 30 or 40 series.",
      "score": 1,
      "created_utc": 1738932569.0,
      "replies": []
    },
    {
      "id": "mbhchcs",
      "author": "Zanian19",
      "body": "So happy with my 4080 super. Practically the same card but at a fraction of the price.",
      "score": 1,
      "created_utc": 1738938130.0,
      "replies": []
    },
    {
      "id": "mbhehr1",
      "author": "Sammoonryong",
      "body": "I bought my 4090 PC with i9 14-series + shenanigans for 2k in december. Best steal ever.",
      "score": 1,
      "created_utc": 1738938792.0,
      "replies": []
    },
    {
      "id": "mbmgjpa",
      "author": "mcbowler78",
      "body": "Make them $5k.  At least.",
      "score": 1,
      "created_utc": 1738998935.0,
      "replies": []
    },
    {
      "id": "mbmofg4",
      "author": "Tangentkoala",
      "body": "When are they going to make a graphics card for the everyday man. \n\nI thought we would have a graphics card war to see who can make the cheapest yet efficent graphics card once we met the 4k threshold. \n\n\nWe got tricked into the fps war, and now we have settings up to 360 fps. Do we really need a 500 fps monitor? The fucks the point in that.",
      "score": 1,
      "created_utc": 1739003519.0,
      "replies": []
    },
    {
      "id": "mbsj0ju",
      "author": "None",
      "body": "What’s the price now? Just bought a new prebuilt this week as my first pc. Wanted to get in before the tariffs (if they happen) drive prices too high. \n\n\nPaid $2000 for rtx 4070 super ti, ryzen 7 7800x3d, 2tb ssd, 32gb ram. Decent price right now, yeah?\n\nFigure it’ll last a good while too.",
      "score": 1,
      "created_utc": 1739079777.0,
      "replies": []
    },
    {
      "id": "mbyptqk",
      "author": "js_cooks",
      "body": "Isn't it because of the 10% tariffs?  I mean each card went up by exactly 10%",
      "score": 1,
      "created_utc": 1739161054.0,
      "replies": []
    },
    {
      "id": "mbabxys",
      "author": "h0tel-rome0",
      "body": "Is this still because of AI?",
      "score": 1,
      "created_utc": 1738847730.0,
      "replies": []
    },
    {
      "id": "mbasi4l",
      "author": "compound-interest",
      "body": "I’d love if there was an investigation on whether stock levels are manipulated to keep demand and prices high. In a low competition market it wouldn’t surprise me if even the non-data center silicon allocation isn’t being sold in good faith. It’s one thing if they simply didn’t allocate any, but it’s another if they are sitting on chips and trickling them out long term to manipulate markets.",
      "score": 1,
      "created_utc": 1738853355.0,
      "replies": []
    },
    {
      "id": "mbcca6x",
      "author": "None",
      "body": "I overpaid for my RTX 3070 in 2021 but tbh I didn't get ripped off as badly compared to these prices. At this rate im not going to upgrade for another 4 or more years.",
      "score": 1,
      "created_utc": 1738868984.0,
      "replies": []
    },
    {
      "id": "mba9wut",
      "author": "None",
      "body": "They've got people camped out to buy them, and supply is short, they can jack up the prices. It's either they jack up the prices or the scalpers do.\n\nPersonally, I'd rather the company does it. Because fuck scalpers.",
      "score": 0,
      "created_utc": 1738846959.0,
      "replies": []
    },
    {
      "id": "mbb7iiz",
      "author": "YouInternational2152",
      "body": "Trump tariffs at work!",
      "score": 0,
      "created_utc": 1738857740.0,
      "replies": []
    },
    {
      "id": "mbacgcx",
      "author": "r4plez",
      "body": "All because msi and asus saw camping ppl outside mirocenters ?",
      "score": 0,
      "created_utc": 1738847919.0,
      "replies": []
    },
    {
      "id": "mbacz47",
      "author": "MrHedgehogMan",
      "body": "At the end of last year I was thinking to myself ‘do I wait for 50 series or get something like a 7800XT?’ \n\nI feel vindicated by my 7800XT purchase.",
      "score": 0,
      "created_utc": 1738848109.0,
      "replies": []
    },
    {
      "id": "mbara2b",
      "author": "RaNdMViLnCE",
      "body": "What could I possibly do with this new card that I can’t already do on a 4060 TI for less then 600cad?\n\nHell a basic 4060 can play every single game made has Ray tracing and all the other fun features doesn’t it? And that’s like 450 CAD.\n\nI’m just not seeing the appeal . As a casual gamer anyway everything runs great for me as is. \n\nSo serious question , what does one gain from upgrading from a 4060 to one of these new cards? Slightly higher FPS when I already don’t have FPS issues?",
      "score": 0,
      "created_utc": 1738852967.0,
      "replies": [
        {
          "id": "mbbc4go",
          "author": "AmStupid",
          "body": "I was using a 3060ti for the longest time and pretty much said the same thing until I upgraded my monitor recently. Just a quick example, a 4080S is still unable to drive a Samsung 57” ultra wide to full 7680x2160 @ 240Hz on ultra settings, not even close. Even at 5120x1440 @ 240Hz on high setting, once a while it may dip into the 30s FPS range when playing newer/action games like Forza. I am not complaining, I am at my happy place and I am not going to upgrade to chase that last bit of performance, my old eyes can’t catch up anyways. \n\nThough, on the production side (solidworks, blender, and such), I did get a nice boost from upgrading, so I assume the newer gen will give a slight edge too.",
          "score": 2,
          "created_utc": 1738859038.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbb2u3d",
      "author": "Un111KnoWn",
      "body": "thanks trump",
      "score": 0,
      "created_utc": 1738856418.0,
      "replies": []
    },
    {
      "id": "mbfsc9m",
      "author": "GreyBeardEng",
      "body": "\"trade wars are easy to win\"",
      "score": 0,
      "created_utc": 1738909794.0,
      "replies": []
    },
    {
      "id": "mbeys5h",
      "author": "FrootLoop23",
      "body": "Well of course they did. People expected MSRP on a $2k GPU? I hope they raise it further.",
      "score": -1,
      "created_utc": 1738897703.0,
      "replies": []
    },
    {
      "id": "mba746k",
      "author": "irrealewunsche",
      "body": "I'm glad I bought a 4070 a couple of years ago - it's going to last me until at least the 80 series cards come along in about a decade. Hopefully there'll be a decent performance bump by then...",
      "score": -3,
      "created_utc": 1738845823.0,
      "replies": []
    }
  ]
}