{
  "post": {
    "title": "Don’t call it a drone: Zipline’s uncrewed aircraft wants to reinvent retail | Ars visits a zipline delivery service that's deploying in more locations soon.",
    "author": "chrisdh79",
    "id": "1julg43",
    "score": 494,
    "created_utc": 1744138518.0,
    "selftext": "",
    "num_comments": 57,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1julg43/dont_call_it_a_drone_ziplines_uncrewed_aircraft/"
  },
  "comments": [
    {
      "id": "mm2zcrr",
      "author": "jakgal04",
      "body": "Just another thing for people to be divided over. I personally think this is pretty cool and will definitely help out in rural areas where delivery by truck logistically doesn't make sense.\n\n50% of people: \"That's so cool! I'd buy something just to get it delivered by drone!\"\n\n50% of people: \"If that thing so much comes within 1000 feet of my house I will shoot it out of the sky\"",
      "score": 109,
      "created_utc": 1744138795.0,
      "replies": [
        {
          "id": "mm4bjxm",
          "author": "S_A_N_D_",
          "body": "For me it's a question of noise. Drones are pretty loud and their high pitched sound can be annoying, much like a mosquito buzzing around you. They tend to be more piercing.\n\nSo the question is will we be able to find a happy middle ground where they're no more annoying than what you might expect from a roadway relative to the neighbourhood you're in? What happens to people who live on their more common flight paths?. \n\nI see nothing inherently wrong with drone delivery, but I see a a bunch of possible issues that could degrade peoples quality of life that will need to be managed if they're going to be used in large numbers.",
          "score": 28,
          "created_utc": 1744153516.0,
          "replies": [
            {
              "id": "mm4cn06",
              "author": "Znuffie",
              "body": "Zipline already squashed this issue.\n\nThe drones fly up in the air (100+ meters), and they drop their packages via a Zipline.\n\nMKBHD and Mark Robbers have videos about them (Zipline).\n\nhttps://youtu.be/88yQTzlmsiA?si=m5aZlF6bzTO2INez",
              "score": 31,
              "created_utc": 1744153882.0,
              "replies": [
                {
                  "id": "mmfiets",
                  "author": "strictlyPr1mal",
                  "body": "honestly you can still hear plenty in the air 100meters away",
                  "score": 3,
                  "created_utc": 1744309347.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm4e8cf",
              "author": "jakgal04",
              "body": "Noise shouldn’t be much of a concern. For the size of the drone (larger drones have a lower pitch noise) and the altitude, they should pretty much blend in to background noise. \n\nThe drone I fly for work (Matrice 350) is basically noiseless at 250+ feet.",
              "score": 11,
              "created_utc": 1744154423.0,
              "replies": [
                {
                  "id": "mmsxz8y",
                  "author": "positivelymonkey",
                  "body": "Noise pollution is a real issue and fucks up all sorts of things you wouldn't think of.",
                  "score": 1,
                  "created_utc": 1744495871.0,
                  "replies": [
                    {
                      "id": "mn6mx9n",
                      "author": "SherbetDramatic1051",
                      "body": "Then the bigger issue is gas powered cars as seen from what Chinese cities have done. Drones are definitely not a huge issue in this.",
                      "score": 1,
                      "created_utc": 1744691835.0,
                      "replies": [
                        {
                          "id": "mncr6q2",
                          "author": "positivelymonkey",
                          "body": "They are if they're whizzing around at night.",
                          "score": 1,
                          "created_utc": 1744775737.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mm8fj4x",
              "author": "bremidon",
              "body": "You should probably go watch some stuff from Zipline before making up your mind.\n\nTheir tech is pretty cool, and that includes how quiet their drones can be and how they stay pretty high in the air.",
              "score": 2,
              "created_utc": 1744215336.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm32wls",
          "author": "reddit455",
          "body": "i could care less about getting a sandwich... \n\n\n\nthe bigger takeaway is the FAA setting up the rules around autonomous flight in populated areas, for commercial purposes\n\n\n\n>Zipline's aircraft operate under a series of FAA classifications—specifically, [part 107](https://www.faa.gov/newsroom/small-unmanned-aircraft-systems-uas-regulations-part-107), [part 135](https://www.faa.gov/uas/advanced_operations/package_delivery_drone), and the upcoming [part 108](https://www.faa.gov/regulations_policies/rulemaking/committees/documents/media/UAS_BVLOS_ARC_FINAL_REPORT_03102022.pdf), which will formalize BVLOS operation. The uncrewed aircraft, which are able to operate as such, navigate through controlled airspace, and even near airports, with the help of FAA-mandated transponder data as well as onboard sensors that can detect the presence of an approaching aircraft and automatically avoid it.\n\n\n\n...with people inside.\n\n\n\n**Joby reports certification progress and delivery of second aircraft to U.S. Air Force at Edwards Air Force Base**\n\n[https://verticalmag.com/press-releases/joby-reports-certification-progress-and-delivery-of-second-aircraft-to-u-s-air-force-at-edwards-air-force-base/](https://verticalmag.com/press-releases/joby-reports-certification-progress-and-delivery-of-second-aircraft-to-u-s-air-force-at-edwards-air-force-base/)\n\n\n\n**Archer receives FAA certification to begin commercial airline**\n\n[https://www.aero-mag.com/archer-receives-faa-certification-to-begin-commercial-airline](https://www.aero-mag.com/archer-receives-faa-certification-to-begin-commercial-airline)",
          "score": 23,
          "created_utc": 1744139862.0,
          "replies": [
            {
              "id": "mm8g0ap",
              "author": "bremidon",
              "body": "You might not care about a sandwich, but you might take a look at their tech about delivering drugs and medication.\n\nPop over to the pharmacy, drop the little mini-me gadget into a special hole, the drugs are put in, and then off it goes to deliver it.\n\nThis could be absolutely the difference between life and death in the right situations.  And it will certainly make it easier for older people to keep up with their medication.",
              "score": 3,
              "created_utc": 1744215479.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm6h12r",
          "author": "bwc153",
          "body": "Another point of friction as well is that awhile back the FAA proposed rules that would give BVLOS drones like this a lot of protections over manned aircraft.\n\nThe rules would have effectively gave them right of way at low altitude, exempted them from see and avoid rules, and also wouldn't require them to have a transponder.  The drones themselves are small and fast, so would be hard for a pilot to see visually, jeopardizing pilot safety.   I know the paramotor community, which flies under FAR 103, was particularly upset over it as paramotors aren't fast or agile, don't typically carry transponders either, and operate at low altitudes too so would be in some of the higher risk from the propsed rules",
          "score": 2,
          "created_utc": 1744187454.0,
          "replies": []
        },
        {
          "id": "mmetsh6",
          "author": "NeuroXc",
          "body": "The rural people this would help are the ones most likely to be shooting at it.",
          "score": 1,
          "created_utc": 1744302205.0,
          "replies": []
        },
        {
          "id": "mmkl2zo",
          "author": "Oregonrider2014",
          "body": "One of the most difficult things with wildfire prevention is inspecting powerlines through forested/mountan areas. We can't use drones because the people out there shoot them down every time. I still wonder how much more could be prevented if those dipshits could just stop shooting anything they are unfamiliar with.",
          "score": 1,
          "created_utc": 1744382857.0,
          "replies": [
            {
              "id": "mmklvon",
              "author": "jakgal04",
              "body": "I'm hoping you get the authorities involved! The FAA treats drones like aircraft. If you shoot a drone down, you've shot an aircraft down. Someone in the township I work in was arrested back in 2018 just for making the threat. He was handed a 5 year federal prison sentence.",
              "score": 1,
              "created_utc": 1744383094.0,
              "replies": [
                {
                  "id": "mmkmc0q",
                  "author": "Oregonrider2014",
                  "body": "Yeah its way above my paygrade on that one. Im sure the utility did go after them, but they wont let us use them anymore because the cost of replacing them was so expensive.",
                  "score": 1,
                  "created_utc": 1744383228.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mm5w247",
          "author": "JohnnyOnslaught",
          "body": "> 50% of people: \"If that thing so much comes within 1000 feet of my house I will shoot it out of the sky\"\n\nI would imagine that would be treated a lot like robbing an Amazon delivery van at gunpoint.",
          "score": 1,
          "created_utc": 1744174933.0,
          "replies": [
            {
              "id": "mm6wb7s",
              "author": "party_peacock",
              "body": "The FAA has ruled that shooting at a drone constitutes a federal crime",
              "score": 1,
              "created_utc": 1744196548.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm5kklo",
          "author": "Fridaybird1985",
          "body": "We move out to rural areas to get away from bullshit like this. Also who are you going to blame when one of these inevitably drops on someone’s head.",
          "score": -6,
          "created_utc": 1744169645.0,
          "replies": [
            {
              "id": "mm5ujvf",
              "author": "CommodoreAxis",
              "body": "The same people we blame on the extremely rare occasion a plane or helicopter falls on someone, or the common occasion that a semi/delivery van hits someone on the road.",
              "score": 10,
              "created_utc": 1744174188.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mm5ngje",
      "author": "JimiSlew3",
      "body": "Their work in delivering medical supplies is pretty amazing.",
      "score": 10,
      "created_utc": 1744170887.0,
      "replies": []
    },
    {
      "id": "mm3awn8",
      "author": "SniperPilot",
      "body": "That’s a nice drone.",
      "score": 14,
      "created_utc": 1744142208.0,
      "replies": []
    },
    {
      "id": "mm5jc7l",
      "author": "tslnox",
      "body": "What's this with the constant renaming things? Uber: don't call it taxi. Airbnb: don't call it a hotel... Always ends up being the same stuff, just trying to sidestep the laws.",
      "score": 14,
      "created_utc": 1744169123.0,
      "replies": [
        {
          "id": "mm64tms",
          "author": "HoidToTheMoon",
          "body": "The article at least explains why they sidestep regular drone laws\n\n\n>Zipline's aircraft are much more comprehensive machines, able to fly for miles and miles. By necessity, they must fly well beyond the range of any human operator, or what's called \"beyond visual line of sight,\" or BVLOS. In 2023, Zipline was the first commercial operator to get clearance for BVLOS flights.\n>\n>Zipline's aircraft operate under a series of FAA classifications—specifically, part 107, part 135, and the upcoming part 108, which will formalize BVLOS operation. The uncrewed aircraft, which are able to operate as such, navigate through controlled airspace, and even near airports, with the help of FAA-mandated transponder data as well as onboard sensors that can detect the presence of an approaching aircraft and automatically avoid it.",
          "score": 10,
          "created_utc": 1744179729.0,
          "replies": []
        },
        {
          "id": "mm62bo5",
          "author": "Bennydhee",
          "body": "It’s just marketing to sound hip and new. Which attracts customers",
          "score": 2,
          "created_utc": 1744178268.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm3onik",
      "author": "manic_andthe_apostle",
      "body": "![gif](giphy|Sy1ObxzIjZPZhEQTwO|downsized)",
      "score": 19,
      "created_utc": 1744146096.0,
      "replies": []
    },
    {
      "id": "mm679co",
      "author": "fringecar",
      "body": "Weird title, to get people to feel just a little more hate? Ok...",
      "score": 5,
      "created_utc": 1744181199.0,
      "replies": []
    },
    {
      "id": "mm3ywq2",
      "author": "Fresh-Birdshit",
      "body": "Tic-tac",
      "score": 3,
      "created_utc": 1744149265.0,
      "replies": []
    },
    {
      "id": "mm5ke6r",
      "author": "Coffee_exe",
      "body": "My only issue is yet another thing a corporation will lobby into a law so they dont get affected by other aircraft/drone laws.",
      "score": 3,
      "created_utc": 1744169569.0,
      "replies": []
    },
    {
      "id": "mm4mdmg",
      "author": "AlexHimself",
      "body": "Video - https://youtu.be/nY2RjINT1K0?si=X6E5iZKw60Gnpk9T",
      "score": 2,
      "created_utc": 1744157209.0,
      "replies": []
    },
    {
      "id": "mm6m8xy",
      "author": "None",
      "body": "I’m gonna call it a drone",
      "score": 2,
      "created_utc": 1744190861.0,
      "replies": []
    },
    {
      "id": "mm45dr8",
      "author": "Died_Of_Dysentery1",
      "body": "Nice drone bro",
      "score": 2,
      "created_utc": 1744151413.0,
      "replies": []
    },
    {
      "id": "mm3zk2r",
      "author": "yanginatep",
      "body": "Just in time for people to buy fewer things due to tariffs!",
      "score": 2,
      "created_utc": 1744149474.0,
      "replies": [
        {
          "id": "mm4at2z",
          "author": "reddit455",
          "body": "who ordered the kidney?\n\n# \n\n[https://research.umd.edu/articles/advances-continue-organ-delivery-drone](https://research.umd.edu/articles/advances-continue-organ-delivery-drone)\n\nIn tests last month, research corneas and a research kidney were successfully delivered by drone between medical facilities in the Las Vegas area. Ryan Henderson (below, left) and Anthony Pucciarella (right) were part of a groundbreaking flight in 2019 to carry a kidney to a patient at a hospital in Baltimore; today they work for MissionGO, the drone delivery company that carried out the Las Vegas testing.",
          "score": 2,
          "created_utc": 1744153266.0,
          "replies": [
            {
              "id": "mm4cwmr",
              "author": "yanginatep",
              "body": "Yeah, MKBHD did a video on them recently. It's actually really impressive technology. Just worried about the timing for them.",
              "score": 1,
              "created_utc": 1744153973.0,
              "replies": [
                {
                  "id": "mm5uc93",
                  "author": "CommodoreAxis",
                  "body": "I watched the Mark Rober vid that they did alongside that one and it is indeed super cool. It certainly isn’t like some sort of life-altering technology for the masses, but there are quite a few very real applications like using them for hospital organ transport.",
                  "score": 1,
                  "created_utc": 1744174085.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mm5ojvp",
      "author": "Royal_Mud893",
      "body": "r/deathstranding has a lot to say about zip lines and delivery methods",
      "score": 1,
      "created_utc": 1744171367.0,
      "replies": []
    },
    {
      "id": "mm8tdzs",
      "author": "HowlingWolven",
      "body": "Nice drone.",
      "score": 1,
      "created_utc": 1744219374.0,
      "replies": []
    },
    {
      "id": "mma5u61",
      "author": "worksafe_Joe",
      "body": "It should be a blimp. Much larger cargo capacity, quieter, less energy used.",
      "score": 1,
      "created_utc": 1744233406.0,
      "replies": []
    },
    {
      "id": "mm35jnu",
      "author": "Jay-Five",
      "body": "A delivery robot called unscrewed?\n     \nIs this a porn reference?",
      "score": -6,
      "created_utc": 1744140652.0,
      "replies": [
        {
          "id": "mm3afwz",
          "author": "legoj15",
          "body": "I read it as unscrewed at first too, but alas it says un-crewed",
          "score": 6,
          "created_utc": 1744142076.0,
          "replies": [
            {
              "id": "mm3b7fs",
              "author": "Slave35",
              "body": "Alas",
              "score": 1,
              "created_utc": 1744142291.0,
              "replies": []
            },
            {
              "id": "mm3btu0",
              "author": "Jay-Five",
              "body": "Still a porn reference. ",
              "score": -3,
              "created_utc": 1744142464.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mm4raan",
      "author": "peskyghost",
      "body": "When a company claims to reinvent or revolutionize or disrupt an industry, it means they’re going to directly contribute to the enshittification of that industry",
      "score": -2,
      "created_utc": 1744158944.0,
      "replies": [
        {
          "id": "mm6ci77",
          "author": "sideline_nerd",
          "body": "These guys get some slack in my book.  \nThey've been running in Africa(can't remember exactly where) for the past decade or so, helping deliver medical supplies to remote villages. Directly impacting peoples lives",
          "score": 1,
          "created_utc": 1744184496.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm3cfy6",
      "author": "MakarovIsMyName",
      "body": "lol.  riiight. lmk how that works out.",
      "score": -12,
      "created_utc": 1744142642.0,
      "replies": [
        {
          "id": "mm3u2i2",
          "author": "BigPickleKAM",
          "body": "They have been operating in Rwanda since 2016.\n\nThe have over a million deliveries in country and over 70 million miles covered by their drones.\n\nThis isn't a start up anymore.\n\nIt isn't a silver bullet game changer but a steady iteration of existing tech.\n\nThey fell off my radar after the pandemic but it is good to see them rolling out in two American markets.",
          "score": 16,
          "created_utc": 1744147747.0,
          "replies": [
            {
              "id": "mm3yeb3",
              "author": "gramathy",
              "body": "This is the org that does the medical deliveries to local hospitals right? Fantastic use of drone delivery for critical supplies without needing distributed storage in hard to reach areas",
              "score": 8,
              "created_utc": 1744149102.0,
              "replies": [
                {
                  "id": "mm494ih",
                  "author": "bizzarefoods",
                  "body": "Right! Amazing videos out there covering them. Life changing technology, or life saving one might say",
                  "score": 1,
                  "created_utc": 1744152701.0,
                  "replies": []
                },
                {
                  "id": "mm5fwgf",
                  "author": "BigPickleKAM",
                  "body": "Yup that is them.  It was a great testing ground for them.  It will be interesting to see what comes of it as them move into consumer level deliveries.",
                  "score": 1,
                  "created_utc": 1744167729.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mm4ag9o",
          "author": "reddit455",
          "body": "it's working out pretty good. by the time you can get a bagel.. they've got plenty of data for transporting other things.\n\n\n\n**Get medications faster with drone delivery from Amazon Pharmacy**\n\n[https://www.aboutamazon.com/news/retail/amazon-pharmacy-amazon-air-prescription-drone-delivery](https://www.aboutamazon.com/news/retail/amazon-pharmacy-amazon-air-prescription-drone-delivery)  \n\n\n**What the First Lung Delivered by Drone Means for Transplant Science**\n\n[https://www.scientificamerican.com/article/what-the-first-lung-delivered-by-drone-means-for-transplant-science/](https://www.scientificamerican.com/article/what-the-first-lung-delivered-by-drone-means-for-transplant-science/)\n\n\n\n**Electric drones and air taxis target the logistical frustration of transporting organs for transplants**\n\n[https://aerospaceamerica.aiaa.org/electric-drones-and-air-taxis-target-the-logistical-frustration-of-transporting-organs-for-transplants/](https://aerospaceamerica.aiaa.org/electric-drones-and-air-taxis-target-the-logistical-frustration-of-transporting-organs-for-transplants/)\n\n\n\n**Drones as First Responders in Everett: What to know**\n\n[https://www.everettpost.com/local-news/drones-as-first-responders-in-everett-what-to-know](https://www.everettpost.com/local-news/drones-as-first-responders-in-everett-what-to-know)",
          "score": 2,
          "created_utc": 1744153147.0,
          "replies": [
            {
              "id": "mm4cbk6",
              "author": "MakarovIsMyName",
              "body": "not trusting vital transplant organs to a damn drone. \n\nexplain why not ONE COMPANY in the US has succeeded at this then.",
              "score": -6,
              "created_utc": 1744153775.0,
              "replies": [
                {
                  "id": "mm4fxol",
                  "author": "ACriticalGeek",
                  "body": "Zipline has had a two to three year jump on everyone else this n this space.\n\nThe answer, btw, is politics and getting new regulations written for new tech.\n\nIt was easier to get those laws rewritten in Africa.",
                  "score": 2,
                  "created_utc": 1744154998.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}