{
  "post": {
    "title": "Roku tests autoplaying ads loading before the home screen | Users are unimpressed, eager to toss devices if test sticks.",
    "author": "chrisdh79",
    "id": "1jdmuhk",
    "score": 5062,
    "created_utc": 1742243199.0,
    "selftext": "",
    "num_comments": 636,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jdmuhk/roku_tests_autoplaying_ads_loading_before_the/"
  },
  "comments": [
    {
      "id": "miblwmx",
      "author": "armenianmasterpiece",
      "body": "wtf - I paid for my tv - if you now make me watch ads to turn it on I’m never buying another Roku product agaib",
      "score": 1731,
      "created_utc": 1742243507.0,
      "replies": [
        {
          "id": "mibs316",
          "author": "None",
          "body": "I'm already to that point. The only reason I haven't replaced my existing Roku devices is money. As they  die, and they die due to heat often enough, I'm replacing them with Apple TV.",
          "score": 443,
          "created_utc": 1742245277.0,
          "replies": [
            {
              "id": "mibveb9",
              "author": "TotallyNormalSquid",
              "body": "Got a raspberry pi at Christmas, got it all set up to watch the same few apps I do through the roku. Got the wireless keyboard and mouse, the weird micro-HDMI to HDMI cable that weird lil computer uses. All because I heard this *might* be happening to my Roku. Sometimes I use it instead of the Roku already. First time I see an ad from the Roku, it's going in the bin.",
              "score": 212,
              "created_utc": 1742246262.0,
              "replies": [
                {
                  "id": "mic5pgq",
                  "author": "Aleix0",
                  "body": "Unfortunately, Linux HTPCs are capped at 720p on most major streaming platforms. But with the increasing en****ification of streaming platforms and devices, sailing the high seas seems a better option than ever. ",
                  "score": 143,
                  "created_utc": 1742249425.0,
                  "replies": [
                    {
                      "id": "michgrl",
                      "author": "frn",
                      "body": "I'm surprised no one over at XDA Developers is maintaining a Google TV distro for Rasberry Pi. Seems like an obvious choice considering the app support. You could even strip out all the bloat and replace the launcher with something open source (there's already a bunch to choose from.)",
                      "score": 55,
                      "created_utc": 1742253221.0,
                      "replies": [
                        {
                          "id": "mid7iav",
                          "author": "roomzinchina",
                          "body": "There is a (non-official) build of [LineageOS Android TV for the Raspberry Pi 5](https://konstakang.com/devices/rpi5/LineageOS22-ATV/)",
                          "score": 41,
                          "created_utc": 1742262030.0,
                          "replies": []
                        },
                        {
                          "id": "midthph",
                          "author": "Theron3206",
                          "body": "I don't believe that would fix the low res streaming, since you still wouldn't have the keys they are looking for to enable the higher resolutions.",
                          "score": 15,
                          "created_utc": 1742270432.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "micmjfq",
                      "author": "None",
                      "body": "If you are the kind to go sailing, then for Raspberry Pi I've heard OSMC is very good. Kodi is great if you want to run an app instead of an OS, and it works for a lot of other systems not just R Pi.",
                      "score": 19,
                      "created_utc": 1742254883.0,
                      "replies": [
                        {
                          "id": "mifpg0b",
                          "author": "MrNerd82",
                          "body": "I've been around long enough to see multiple waves of \"omg pirates!\", hell I started in the old school days when you'd physically mail media around a known online circle. \n\nnewsgroups, Napster days, pirate bay days.  It's ebb and flow.\n\nSeems CEO's or exec's periodically forget that people have no problem paying reasonable prices for access to the content they want.  They just get greedy and yell \"moar profits\".     F em' -- if they don't want to sell me what I want, I'll get it elsewhere for free. \n\nIf buying isn't owning, then piracy isn't stealing.",
                          "score": 19,
                          "created_utc": 1742305744.0,
                          "replies": [
                            {
                              "id": "mig1fvm",
                              "author": "None",
                              "body": "I don't mind paying for services that bring movies and shows that I like to my home. I resent having to pay so much for it. I don't really pirate anything these days. \n\nBack a few years ago I did. I remember my wife talking to one of her church friends and saying how we'd get stuff for free and her friend blurting out, \"He's a pirate!?\" I didn't realize they'd even have a clue.",
                              "score": 1,
                              "created_utc": 1742309437.0,
                              "replies": [
                                {
                                  "id": "mig8kfd",
                                  "author": "MrNerd82",
                                  "body": "After college for me (early 2000s) getting a good job I was quite alright to purchase what I used. \n\nWe all know where that went -- everything turned subscription. (looking at you adobe)  And even when you did subscribe, you still got screwed over somehow. Same as what happened to original cable/satellite network. \n\nNot me - but knowing people that subscribe to everything such that they have 6+ things every month that hit them for $20+ dollars. In addition to whatever their usual internet/TV bill happens to be. \n\nThere's plenty of people like me happy to pay a resonable amount for what I use, I completely nope out though when it gets stupidly greedy though.",
                                  "score": 3,
                                  "created_utc": 1742311537.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mieau04",
                      "author": "spaceman_",
                      "body": "I have three streaming subscriptions. But ever since Netflix removed a show without notice while we were going through it, I've mostly switched back to piracy on Jellyfin.\n\nIt's just a better experience. Rather than using one of three hostile app interfaces, I just get my list thumbnails of shows I'm watching, and I pick the one I want to watch.\n\nNo looking through a bunch of \"suggestions\" to find my list. No risk of losing access half way through. No silly quality or region restrictions.",
                      "score": 8,
                      "created_utc": 1742279688.0,
                      "replies": []
                    },
                    {
                      "id": "miczr5m",
                      "author": "IsthianOS",
                      "body": "I finally started unfucking my Unraid tower because of this and the constant price hikes. Just need to figure out Usenet because I just don't feel like fucking with seeding this time around.",
                      "score": 7,
                      "created_utc": 1742259314.0,
                      "replies": [
                        {
                          "id": "midmpqy",
                          "author": "divDevGuy",
                          "body": "> Just need to figure out Usenet\n\nPsst. Black Friday is the best time of year for committing to extended cruises of the high seas. Anything else Servarr and TRaSH Guides will likely answer.",
                          "score": 13,
                          "created_utc": 1742267574.0,
                          "replies": [
                            {
                              "id": "mifuwdr",
                              "author": "IsthianOS",
                              "body": "Oh no this is my already built server I just needed to wipe the old config because it's so outdated and broken and set up the Arr apps etc again.\n\nAlready have alerts set up for HDD deals :)",
                              "score": 1,
                              "created_utc": 1742307467.0,
                              "replies": [
                                {
                                  "id": "migewbc",
                                  "author": "divDevGuy",
                                  "body": "I wasn't meaning for storage deals. You mentioned \"figuring out usenet\" so I was eluding to deals for indexers and providers. I didn't want you to sign up for an \"extended cruise of the high seas\" (annual subscription) at a higher price than what you could find come this fall.",
                                  "score": 1,
                                  "created_utc": 1742313376.0,
                                  "replies": []
                                },
                                {
                                  "id": "mihhpy6",
                                  "author": "AstralProbing",
                                  "body": "What site do you use to setup these HDD deals? Can it scourer for used/recertified?",
                                  "score": 1,
                                  "created_utc": 1742324225.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "micwl0t",
                      "author": "samarnold030603",
                      "body": "My rp3 has been streaming 1080p content for 10 years. I’ve heard rp4 can do 4k but haven’t looked into it since 1080p looks just fine on my 65” 4k OLED",
                      "score": 4,
                      "created_utc": 1742258240.0,
                      "replies": [
                        {
                          "id": "mie0h0k",
                          "author": "raltoid",
                          "body": "It wasn't about what the rasberry pi can handle, it's that streaming platforms often limit streaming to Linux at 720p, you can get 1080p sometimes(might require some finagling). \n\nExample from Netflix' help page: \n\n* Windows\n * edge/netflix app - 2160p (with win 11)\n * chrome, firefox and opera - 1080p\n\n* Linux\n * chrome, firefox and edge - 720p\n * opera - 1080p\n\nLast I heard it was impossible to stream 4k from Netflix to Linux without doing emulation/vm, since it requires some properitery software.",
                          "score": 11,
                          "created_utc": 1742273728.0,
                          "replies": [
                            {
                              "id": "miffsre",
                              "author": "samarnold030603",
                              "body": "And you missed my point which was fuck streaming platforms, sail the seas.",
                              "score": 5,
                              "created_utc": 1742302386.0,
                              "replies": []
                            },
                            {
                              "id": "mieccip",
                              "author": "alidan",
                              "body": "torrents aren't proprietary\n\nthis is honestly the make thing that keeps me pirating stuff, I will pay for the service but never use it and just pirate, I am not using their shit app or requirements to watch was mpc hc can play just fine.\n\n(edit to fix an auto coorect, are to aren't)",
                              "score": 0,
                              "created_utc": 1742280647.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "miga6nq",
                          "author": "ToMorrowsEnd",
                          "body": "Streaming 4K is horrible anyways.  they compress the video stream to hell and back.   Netflix 4K is just not worth it.",
                          "score": 1,
                          "created_utc": 1742312009.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mid6sy4",
                      "author": "Poopdick_89",
                      "body": "There has to be a way around that.",
                      "score": 1,
                      "created_utc": 1742261784.0,
                      "replies": [
                        {
                          "id": "mie3j7n",
                          "author": "Programmdude",
                          "body": "Piracy, or don't use linux. There's no legal way to get 4k on linux from streaming services, and 1080p requires opera. Windows isn't much better, as that's still 1080p capped (unless you use their app, which I won't do).\n\nI'm not averse to paying for services, I'm averse to paying and not getting the service I paid for.",
                          "score": 2,
                          "created_utc": 1742275356.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mieizcx",
                      "author": "paradoxbound",
                      "body": "I have done a lot of different Android streaming devices over the years. Almost all of them are garbage apart from the most expensive options. A few years ago I swapped to Apple TV devices and haven't looked back.",
                      "score": 1,
                      "created_utc": 1742285022.0,
                      "replies": []
                    },
                    {
                      "id": "mig9yb3",
                      "author": "ToMorrowsEnd",
                      "body": "Nvidia shield gets around that.  Yes they are still making them and they rock.",
                      "score": 1,
                      "created_utc": 1742311940.0,
                      "replies": []
                    },
                    {
                      "id": "mihsxe4",
                      "author": "losark",
                      "body": "You... don't need to censor on reddit, homey",
                      "score": 1,
                      "created_utc": 1742327412.0,
                      "replies": []
                    },
                    {
                      "id": "miirw32",
                      "author": "Every-holes-a-goal",
                      "body": "Raspberry pi vpn it is then . Yo ho ho",
                      "score": 1,
                      "created_utc": 1742337663.0,
                      "replies": []
                    },
                    {
                      "id": "mili61k",
                      "author": "Artabasdos",
                      "body": "If only there was a free alternative without stupid limitations...",
                      "score": 1,
                      "created_utc": 1742380910.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mieacox",
                  "author": "GrizFyrFyter1",
                  "body": "Use that raspberry pi to build a home network media server and get an eye patch.",
                  "score": 11,
                  "created_utc": 1742279385.0,
                  "replies": [
                    {
                      "id": "miosh9f",
                      "author": "Suspicious_Peace_182",
                      "body": "Back in my day you needed a parrot",
                      "score": 2,
                      "created_utc": 1742419066.0,
                      "replies": []
                    },
                    {
                      "id": "miedyav",
                      "author": "TotallyNormalSquid",
                      "body": "Not that I tried this, of course, but I researched it out of pure academic curiosity: sailing the high seas on raspian is an absolute ball ache. If anyone else wants to research sailing the high seas on a different Linux distro, they may discover that such voyagers saw calmer seas",
                      "score": 1,
                      "created_utc": 1742281675.0,
                      "replies": [
                        {
                          "id": "mifrpdn",
                          "author": "GrizFyrFyter1",
                          "body": "I don't look for stuff on raspbian. If find what I want on my phone and just transfer to a hard drive when I get home.",
                          "score": 1,
                          "created_utc": 1742306460.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mielxwl",
                      "author": "droppinkn0wledge",
                      "body": "Pirating is and will always be a complete pain in the dick. I’d rather suffer through a 30 second ad than navigate a dozen JRPG tier menus to then filter a giant list of torrents all of varying quality only to at last find one in actual 1080p with fucking Chinese subtitles or something that cuts off the last fifteen minutes of the movie. \n\nNo thanks. Pirating is good for some things, but for quick general use home media it blows ass.",
                      "score": -2,
                      "created_utc": 1742287010.0,
                      "replies": [
                        {
                          "id": "miesf8c",
                          "author": "GammonBushFella",
                          "body": "I just go on Yandex and search exactly what I'm after before I cook dinner, move the file to my plex media folder before I eat and gg. It aint exactly hard",
                          "score": 3,
                          "created_utc": 1742291264.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "micv5kx",
                  "author": "samarnold030603",
                  "body": "Whatever you do, don’t install kodi. And absolutely do not install any 3rd-party add-ons. 🏴‍☠️",
                  "score": 27,
                  "created_utc": 1742257758.0,
                  "replies": [
                    {
                      "id": "midbjdf",
                      "author": "Theistus",
                      "body": "Definitely don't install The Crew. And don't get a Premiumize Me account",
                      "score": 11,
                      "created_utc": 1742263448.0,
                      "replies": [
                        {
                          "id": "migxoxd",
                          "author": "samarnold030603",
                          "body": "I’ve been using crew + real debrid for years. RD had its issues a couple months back…but seems to be mostly squared away again",
                          "score": 2,
                          "created_utc": 1742318736.0,
                          "replies": [
                            {
                              "id": "mij573f",
                              "author": "Theistus",
                              "body": "Yeah, they seen to be working just fine, except you can't unrestricted links. But the price is sure right.",
                              "score": 2,
                              "created_utc": 1742341836.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mihfsh2",
                      "author": "deadzol",
                      "body": "I’m so old I still think of it as Xbox Media Center",
                      "score": 3,
                      "created_utc": 1742323674.0,
                      "replies": []
                    },
                    {
                      "id": "mida81t",
                      "author": "SammlerWorksArt",
                      "body": "Oh... What's going on with kodi? \n\n\nI've used it since it was XBMC. It's on my sony tv. Am I in danger?",
                      "score": -5,
                      "created_utc": 1742262982.0,
                      "replies": [
                        {
                          "id": "midoyex",
                          "author": "Paksarra",
                          "body": "Only if you were to *accidentally* install certain third party addons that use Kodi as a front-end. Don't worry, one of the steps involves somehow mananging to butt-dial the correct URL for the forbidden addon's repository using your TV remote-- they aren't officially sanctioned add-ons-- so it's highly unlikely you'll be in danger of having such an accident.\n\nStreaming video without the authorization of the copyright owner would be a violation of US copyright law and very naughty, so it's a good thing this is a highly unlikely accident.",
                          "score": 10,
                          "created_utc": 1742268484.0,
                          "replies": [
                            {
                              "id": "midy6dq",
                              "author": "SammlerWorksArt",
                              "body": "Ahh. I see. Thank you. \n\n\nI thought maybe kodi itself was doing something similar..",
                              "score": 2,
                              "created_utc": 1742272612.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "midf02p",
                          "author": "Darkchamber292",
                          "body": "r/woosh",
                          "score": 7,
                          "created_utc": 1742264678.0,
                          "replies": [
                            {
                              "id": "midu3u6",
                              "author": "SammlerWorksArt",
                              "body": "Cool, but what am I missing? \n\n\nIs the 3rd party stuff pirated stuff?",
                              "score": 2,
                              "created_utc": 1742270706.0,
                              "replies": [
                                {
                                  "id": "miehth4",
                                  "author": "ana_morphic",
                                  "body": "Ssshhhhhhhhhh!!",
                                  "score": 4,
                                  "created_utc": 1742284251.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "midiep8",
                  "author": "KisukesBankai",
                  "body": "There's _already_ ads though. They're just for shitty movies and tv.",
                  "score": 5,
                  "created_utc": 1742265921.0,
                  "replies": [
                    {
                      "id": "mieds8z",
                      "author": "TotallyNormalSquid",
                      "body": "The roku ads I get are static images in the home screen background that don't affect loading times. What I fear is interrupting video ones",
                      "score": 4,
                      "created_utc": 1742281569.0,
                      "replies": [
                        {
                          "id": "mifaawl",
                          "author": "KE0UZJ",
                          "body": "Happened to me yesterday. Hit the home button to turn on the TV and a video ad of some Disney movie is full screen. Hit the home button again and the ad disappeared 2 seconds in.\nOne more time and I'm going to an android box , already have it.",
                          "score": 6,
                          "created_utc": 1742300236.0,
                          "replies": [
                            {
                              "id": "mifnzt0",
                              "author": "brock0124",
                              "body": "I ditched Roku last year. Now I have 4K Onn Android TV boxes with a custom loader connected to all my TVs so I don’t ever see any ads at all and just have Jellyfin & Stremio on the home screen. Literally all I need.",
                              "score": 1,
                              "created_utc": 1742305271.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "miefau0",
                          "author": "KisukesBankai",
                          "body": "Yeah no I mean obviously that's worse.. I'm just saying it's already unacceptable to me. I'm on my last one",
                          "score": 2,
                          "created_utc": 1742282568.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mifoooz",
                  "author": "t4boo",
                  "body": "You should resale the Roku for dirt cheap on eBay. That might hurt the company more than just tossing it",
                  "score": 5,
                  "created_utc": 1742305499.0,
                  "replies": []
                },
                {
                  "id": "miczdzg",
                  "author": "NoorAnomaly",
                  "body": "Did your boss also get you a raspberry pi for Christmas? Mine did and it was the most thoughtful gift I've gotten in years. I ugly cried for hours.\n\n\nAnyway, does the pi eat Roku ads? I've had it running for over a year so I'm not sure what's being eaten and what is just because my Roku TV is 9 years old.",
                  "score": 3,
                  "created_utc": 1742259187.0,
                  "replies": [
                    {
                      "id": "midutyv",
                      "author": "zmaniacz",
                      "body": "Pi-hole eats all Roku ads so far...",
                      "score": 2,
                      "created_utc": 1742271036.0,
                      "replies": []
                    },
                    {
                      "id": "miedpk8",
                      "author": "TotallyNormalSquid",
                      "body": "Set up mine as a media centre rather than pi-hole, dunno if pi-hole would kill roku ads",
                      "score": 1,
                      "created_utc": 1742281521.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mifr9oi",
                  "author": "King_Dead",
                  "body": "Can you get em to do apple airplay? That would be a big gamechanger for me",
                  "score": 1,
                  "created_utc": 1742306322.0,
                  "replies": []
                },
                {
                  "id": "micz89q",
                  "author": "duckliin",
                  "body": "pi zerow? cause i know the regular pi has full  hdmi",
                  "score": 0,
                  "created_utc": 1742259132.0,
                  "replies": [
                    {
                      "id": "miedmmb",
                      "author": "TotallyNormalSquid",
                      "body": "5 - it has dual HDMI output but on the pi side they're both the weird micro-HDMI connector",
                      "score": 1,
                      "created_utc": 1742281468.0,
                      "replies": [
                        {
                          "id": "mieq6af",
                          "author": "duckliin",
                          "body": "oh shit nice",
                          "score": 1,
                          "created_utc": 1742289827.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mic0fx5",
              "author": "KenJyi30",
              "body": "All the ad related stuff is what probably overheated them in the 1st place",
              "score": 28,
              "created_utc": 1742247785.0,
              "replies": [
                {
                  "id": "mici606",
                  "author": "None",
                  "body": "I have no idea if it's related to ads but it's happened to mine since I started buying Rokus. \n\nThey tend to overheat after about 1 to 2 years of use, in my experience. For the Roku sticks we pop off the case and it seems to make them last longer.",
                  "score": 11,
                  "created_utc": 1742253447.0,
                  "replies": [
                    {
                      "id": "micp0g2",
                      "author": "KenJyi30",
                      "body": "Mine overheated after only 6 weeks, just barely out of my 30-day return period. Bunch of new in-app purchase menu items appeared soon after",
                      "score": 4,
                      "created_utc": 1742255708.0,
                      "replies": [
                        {
                          "id": "micrdar",
                          "author": "None",
                          "body": "I have and have had several Rokus. I usually get them at Walmart on sale. They usually last long enough to make it worthwhile and it ends up being pretty cheap to get even the more high end ones. \n\nBesides overheating, the biggest issue I've had with them is it looks like they update four quadrants of the screen individually so sometimes it shows a line down the middle vertically and horizontally. It's weird but it's rarely noticeable.",
                          "score": 2,
                          "created_utc": 1742256494.0,
                          "replies": []
                        },
                        {
                          "id": "midfaq2",
                          "author": "Booster_Goldest",
                          "body": "I've got two Roku Ultras I found at work at an abandoned bingo hall and they work amazingly well, years after.\n\nAlso have one of the little ugly Express ones or whatever they are called I dug out of the yard after I tore down a storage shed and it surprisingly worked. Popped it on a little backup TV and it is still going.\n\nI don't know how so many people have had issues with Roku devices. \n\nI've only had issues with Android TV stuff. Which also sucks because I was an old school Android fan going back to the G1 phone.",
                          "score": 2,
                          "created_utc": 1742264784.0,
                          "replies": [
                            {
                              "id": "midkphq",
                              "author": "KenJyi30",
                              "body": "Mine is the sound bar, was really hot. Not sure if there’s any difference in the streaming hardware. I also have an old old one that was solid forever. I’m guessing the newer (or higher end?) the worse it gets",
                              "score": 1,
                              "created_utc": 1742266790.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mid34xt",
              "author": "Th3Batman86",
              "body": "Just got an Apple TV. Such a clean interface. I love it.",
              "score": 20,
              "created_utc": 1742260494.0,
              "replies": [
                {
                  "id": "mifpih8",
                  "author": "t4boo",
                  "body": "Jumped to apple tv after ditching my sling air tv, and the quality jump is just incredible. And no fucking ads lol",
                  "score": 7,
                  "created_utc": 1742305766.0,
                  "replies": []
                },
                {
                  "id": "midhb4o",
                  "author": "DoingCharleyWork",
                  "body": "I got one a few years ago because I wanted something that had the motogp app and it was cheaper than a new TV. I don't see myself ever using anything else for streaming again. \n\nEven if I wasn't fully in the Apple ecosystem it would still be way better than any other option in the market. Being in the Apple ecosystem just makes it that much better.",
                  "score": 6,
                  "created_utc": 1742265516.0,
                  "replies": []
                },
                {
                  "id": "mig5uz5",
                  "author": "xurdm",
                  "body": "It also has great performance. All the other devices lag like crazy except for Nvidia Shield",
                  "score": 2,
                  "created_utc": 1742310745.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "midsh0h",
              "author": "MatthewBakke",
              "body": "Go Apple TV and never look back.",
              "score": 8,
              "created_utc": 1742269984.0,
              "replies": []
            },
            {
              "id": "midiu92",
              "author": "None",
              "body": "[removed]",
              "score": 4,
              "created_utc": 1742266084.0,
              "replies": [
                {
                  "id": "mij2rzb",
                  "author": "HalKitzmiller",
                  "body": "Why use the Apple TV when you have the Shield Pro in the mix anyway? Just curious",
                  "score": 2,
                  "created_utc": 1742341061.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mid5z3d",
              "author": "Adventurous_club2",
              "body": "I fucking love my Apple TV. I’ll be buying another to use over the Roku.",
              "score": 9,
              "created_utc": 1742261494.0,
              "replies": [
                {
                  "id": "midhfdm",
                  "author": "DoingCharleyWork",
                  "body": "Not sure why you got downvoted. The Apple TV is the best streaming device I've ever used.",
                  "score": 3,
                  "created_utc": 1742265559.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mimsr6k",
              "author": "Trev0117",
              "body": "Apple TVs are a little spendy but I gotta say as a snobby movie watcher with a decent tv they are far and away the best streaming solution, super high bitrate everything, no ads, voice commands work, use your phone as a remote, zero lag navigating the device. Any who’s frustrated with crappy stream boxes should try one for their own sanity.",
              "score": 2,
              "created_utc": 1742398113.0,
              "replies": []
            },
            {
              "id": "midmmit",
              "author": "famousxrobot",
              "body": "Oh yeah. I dropped my Roku sticks and have 1 Roku tv left. If ad runs, you better believe that tv is gone in an instant.",
              "score": 1,
              "created_utc": 1742267539.0,
              "replies": []
            },
            {
              "id": "mif1k8q",
              "author": "Prize_Instance_1416",
              "body": "I bought a Roku to try it for a guest room and use Apple TV in all the other sets or native apps, and the Roku is ridiculously bad. I guess if you’ve never used an Apple TV you’d think it’s fine but it’s slow, cheap feeling and occasionally buffers noticeably.",
              "score": 1,
              "created_utc": 1742296297.0,
              "replies": []
            },
            {
              "id": "mif1ply",
              "author": "fleemfleemfleemfleem",
              "body": "I already got rid of mine. It started doing something where if I paused a show and walked away an ad would come up and pressing \"play\" would go to the ad, so you had to press left or right then play. \n\nI got a cheap \"ONN\" chrome box from Walmart and put on a custom launcher that doesn't have ads.",
              "score": 1,
              "created_utc": 1742296370.0,
              "replies": []
            },
            {
              "id": "mif9ysq",
              "author": "JStewy21",
              "body": "So far my TCL tv with the Google operating system on it has been great",
              "score": 1,
              "created_utc": 1742300095.0,
              "replies": []
            },
            {
              "id": "mihkd43",
              "author": "Pyro919",
              "body": "We bought an Apple TV to plug into the back of our stupid ROKU tv because their OS is such hot garbage.   We have multiple Roku tvs from different oems (TCL and Toshiba I think) and they all suck.\n\nThe Apple TV works well enough we haven’t had to replace the Roku tv (screen) yet, but if they start/keep autoplaying ads that thing is going on marketplace and I will never buy another Roku anything.",
              "score": 1,
              "created_utc": 1742324983.0,
              "replies": []
            },
            {
              "id": "midb7iu",
              "author": "charonco",
              "body": "What the hell are you doing with your Rokus? I have one that sits in an enclosed cabinet and I have another one that has done almost 400,000 miles on my truck getting bounced around constantly and I've never had any equipment failures.",
              "score": 1,
              "created_utc": 1742263331.0,
              "replies": [
                {
                  "id": "midqck1",
                  "author": "None",
                  "body": "I plug them into my televisions and that's where they stay. I do nothing special with them whatsoever.",
                  "score": 1,
                  "created_utc": 1742269071.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mie6w0r",
              "author": "Convergentshave",
              "body": "Yea…. I’m not sure replacing your cheap Roku Tv (and I don’t mean that as a shot. I love my Roku tv. ((Well unless those fucks start playing ads.) I just mean the low cost of a Roku TV vs the (probably)insane cost of an Apple TV.  \n\nI mean it yes it’s annoying as hell if they start with ads. But come on. You know you’ll buy that nice Apple TV and then in like a year or two they’ll change… some fucking  hardware feature so that you need to upgrade, or your tv slows  down, or some shit.  \n\nI write this from my iPhone. 😂😂.",
              "score": -3,
              "created_utc": 1742277275.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mic2q6s",
          "author": "FerricDonkey",
          "body": "I disconnected my tv from the internet. My steam deck (in a dock) is hooked up to it, and has an ad blocking browser. Wireless keyboard and mouse next to the couch. It works. ",
          "score": 39,
          "created_utc": 1742248485.0,
          "replies": [
            {
              "id": "michz7p",
              "author": "astro_plane",
              "body": "I highly recommend the Logitech k400+ keyboards for htpc's they have a keyboard a track pad built into one device. Theres a higher end version with a nicer track pad and keyboard with back light.",
              "score": 8,
              "created_utc": 1742253386.0,
              "replies": [
                {
                  "id": "mid87ta",
                  "author": "FerricDonkey",
                  "body": "That seems pretty useful for a TV control thingy - I may have to get one, thanks. ",
                  "score": 1,
                  "created_utc": 1742262277.0,
                  "replies": [
                    {
                      "id": "midx8jd",
                      "author": "astro_plane",
                      "body": "I used it for HTPC for about 4 years and the battery never died. It worked great on the nividia  shield too,  got to use the mouse pointer on the Firefox app that I side loaded. It makes using the computer from the couch way more convenient.",
                      "score": 1,
                      "created_utc": 1742272158.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mif6wve",
                  "author": "romaraahallow",
                  "body": "Seconding this. These keyboards are damn near indestructible and the battery lasts for months it not literally years depending on use.",
                  "score": 1,
                  "created_utc": 1742298789.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mimod8k",
              "author": "PacketAuditor",
              "body": "Worth noting any 6900HX based Mini PC is faster than a steam deck and are around $350. Any OS will work great, I run CachyOS Linux on mine as a HTPC with a wireless trackpad keyboard.",
              "score": 1,
              "created_utc": 1742396800.0,
              "replies": []
            },
            {
              "id": "miccqbj",
              "author": "Indolent_Bard",
              "body": "No 1080p for you.",
              "score": 0,
              "created_utc": 1742251685.0,
              "replies": [
                {
                  "id": "mices36",
                  "author": "JMFe95",
                  "body": "Could be using Windows?",
                  "score": 7,
                  "created_utc": 1742252348.0,
                  "replies": [
                    {
                      "id": "mid6sty",
                      "author": "FerricDonkey",
                      "body": "I'm using the pre-installed Linux version, but in desktop mode it's just Linux and (edit: an external monitor) will use whatever resolution you tell it to.\n\n\nEDIT: It looks like streaming websites may actually limit the resolution on Linux - can't say I've noticed, but I don't use my tv much. A windows laptop could be used to control the TV just as easily though. ",
                      "score": 3,
                      "created_utc": 1742261783.0,
                      "replies": [
                        {
                          "id": "mid88vy",
                          "author": "Jonaldys",
                          "body": "The streaming apps output above 720p? I had heard they don't on Linux, it held me back a couple of times.",
                          "score": 6,
                          "created_utc": 1742262287.0,
                          "replies": [
                            {
                              "id": "mid8wca",
                              "author": "FerricDonkey",
                              "body": "You know, I'm not sure I've checked in a while, and searching suggests it might be limited to 720p. A cheap windows laptop would work just as well for TV control though. ",
                              "score": 3,
                              "created_utc": 1742262515.0,
                              "replies": [
                                {
                                  "id": "mid9h0s",
                                  "author": "Jonaldys",
                                  "body": "For sure, but it wouldn't be better than any other device as far as embedded ads go.",
                                  "score": 1,
                                  "created_utc": 1742262719.0,
                                  "replies": [
                                    {
                                      "id": "midalf4",
                                      "author": "FerricDonkey",
                                      "body": "It can be. The laptop itself should have zero ads, then an adblocker can prevent ads on YouTube etc (though not always all streaming sites, but enough to work for me). \n\n\nI am not aware of any ad blocking mechanism that works on Linux and not windows - but if you are I'd love to hear them so I can block even more ads. ",
                                      "score": 1,
                                      "created_utc": 1742263113.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "micfla4",
                      "author": "Indolent_Bard",
                      "body": "They disconnected their TV from the internet. They're not using windows.",
                      "score": -3,
                      "created_utc": 1742252611.0,
                      "replies": [
                        {
                          "id": "mich8up",
                          "author": "time-wizud",
                          "body": "You can install it on a Steam Deck, but it ships with Linux.",
                          "score": 7,
                          "created_utc": 1742253149.0,
                          "replies": [
                            {
                              "id": "mijtpad",
                              "author": "Indolent_Bard",
                              "body": "The kind of person who disconnects their smart TV from the internet is not the kind of person who will voluntarily use Windows on a Steam Deck.",
                              "score": 1,
                              "created_utc": 1742350202.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mid7b5a",
                          "author": "FerricDonkey",
                          "body": "Ha, I'm not anti Windows or even particularly concerned about privacy. I just absolutely hate ads. So I use windows on a couple of my devices.\n\n\nNot on the steam deck though, because it works pretty well without it. ",
                          "score": 2,
                          "created_utc": 1742261960.0,
                          "replies": [
                            {
                              "id": "mijwz5i",
                              "author": "Indolent_Bard",
                              "body": "I see. That makes perfect sense. What do you think about the ads on Windows? Do you think that issue is overblown?",
                              "score": 1,
                              "created_utc": 1742351368.0,
                              "replies": [
                                {
                                  "id": "mijy0rb",
                                  "author": "FerricDonkey",
                                  "body": "I don't see ads in windows - had to Google it to see what you were talking about, and don't recognize any of the things the come up. So all I can say is that I must have disabled any such \"features\" that would have annoyed me. ",
                                  "score": 1,
                                  "created_utc": 1742351747.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "micmkaa",
                  "author": "FrozenLogger",
                  "body": "Why not?\n\nI use the Steamdeck at 1080p when I use it as a computer.",
                  "score": 8,
                  "created_utc": 1742254890.0,
                  "replies": [
                    {
                      "id": "mid83lp",
                      "author": "Jonaldys",
                      "body": "If I'm not mistaken, most streaming services are capped at 720p for Linux",
                      "score": 6,
                      "created_utc": 1742262236.0,
                      "replies": [
                        {
                          "id": "midhvfn",
                          "author": "DoingCharleyWork",
                          "body": "They even cap you on windows unless you use specific browsers. Even on the windows app it used to be limited to 720p, you still had to use a certain browser for anything above. I forget if it was edge or chrome though.",
                          "score": 8,
                          "created_utc": 1742265723.0,
                          "replies": [
                            {
                              "id": "mijvjhx",
                              "author": "Indolent_Bard",
                              "body": "It was edge, I'm pretty sure.",
                              "score": 2,
                              "created_utc": 1742350852.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mijvzny",
                      "author": "Indolent_Bard",
                      "body": "No Linux browser has widevine L3 on it, which means that streaming services cap the resolution. Hell, you used to not even be able to get 1080p on Windows unless you used Edge or the Windows Netflix app.\n\nGranted, it sounds like you didn't notice, and to be honest, nobody in my family but me buys Blu-ray movies because we don't really care about the resolution difference.",
                      "score": 1,
                      "created_utc": 1742351014.0,
                      "replies": [
                        {
                          "id": "mik0ruw",
                          "author": "FrozenLogger",
                          "body": "I guess I just wasn't thinking much about streaming services like that. Plex is on the device (works great in big screen mode) and the other streaming things I watch don't limit in anyway. I use the Roku with Jellyfin and Plex mostly so replacing it with a steamdeck works fine.\n\nSo that is why I didn't notice.",
                          "score": 1,
                          "created_utc": 1742352765.0,
                          "replies": [
                            {
                              "id": "mik3usu",
                              "author": "Indolent_Bard",
                              "body": "Ah, that makes sense.",
                              "score": 2,
                              "created_utc": 1742353964.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "micclst",
          "author": "kr4ckenm3fortune",
          "body": "That why I stopped connecting any smart TV to the internet...I find that it get laggy with internet.",
          "score": 20,
          "created_utc": 1742251645.0,
          "replies": [
            {
              "id": "mih7hy2",
              "author": "cutelyaware",
              "body": "It gets laggy because it's so busy uploading data on your watching habits, scrolling interests, porn preferences, etc. The things are evil and I wouldn't have them for free, let alone pay to give up so much personal data. It doesn't even stop with your data, it will even collect information on other people too. From their privacy policy:\n\n>\"Personal information about other people may be collected and used when you use Roku Smart Home devices and services. For instance, your Smart Home Devices may capture videos, images or voice content of other individuals.\"\n\nI feel uncomfortable in homes of others with Roku devices.",
              "score": 5,
              "created_utc": 1742321358.0,
              "replies": []
            },
            {
              "id": "mide26s",
              "author": "MotherTreacle3",
              "body": "I couldn't find a dumb tv so I bought a monitor.",
              "score": 2,
              "created_utc": 1742264344.0,
              "replies": [
                {
                  "id": "mipjsnf",
                  "author": "kr4ckenm3fortune",
                  "body": "I did...",
                  "score": 1,
                  "created_utc": 1742427658.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "micv1ku",
          "author": "RationalLies",
          "body": "Easy fix, two options:\n\nTechnical method: look online how to make make a \"Pi hole\". You load a raspberry Pi with software that routes your Internet traffic thru a firewall that blocks all the ads basically. Anyone can do it and it's easy but is the more technical fix.\n\nEasy option: get on Onn 4k Android box for $50 and never look back. But wait, there's ads on that you say! No, you just load Wolf Launcher on it and never see another ad in your life. A lot of extra potential if you go this route, which I highly recommend.",
          "score": 18,
          "created_utc": 1742257722.0,
          "replies": [
            {
              "id": "mid7tyk",
              "author": "A_B_E",
              "body": "I use nextdns and can second this approach. I never see any ads on any of my Roku stuff.",
              "score": 3,
              "created_utc": 1742262143.0,
              "replies": []
            },
            {
              "id": "midet4n",
              "author": "AnRealDinosaur",
              "body": "This is what we do. Haven't seen an ad in our house for years, it's magical.",
              "score": 2,
              "created_utc": 1742264609.0,
              "replies": []
            },
            {
              "id": "miebuel",
              "author": "Wild4fire",
              "body": "To clarify, your internet traffic itself is not routed through the Raspberry Pi. Only DNS requests will go to the Pi.",
              "score": 1,
              "created_utc": 1742280326.0,
              "replies": []
            },
            {
              "id": "mijij2z",
              "author": "usmclvsop",
              "body": "Not quite easy on blocking traffic, using a pihole to block dns requests for my roku tv the netflix app and youtube tv app don’t work.  I have to allow ads to watch content or the app crashes.",
              "score": 1,
              "created_utc": 1742346338.0,
              "replies": [
                {
                  "id": "mix8o1s",
                  "author": "AimingByPFM",
                  "body": "NextDNS has a single switch to disabled ads to the Roku and it works with the current ad setup.",
                  "score": 1,
                  "created_utc": 1742531530.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "miea69l",
          "author": "GrizFyrFyter1",
          "body": "I disconnected my (TCL) roku TV from the internet.\n\nNow the status light blinks whenever it's on, just to annoy me for not being online and force fed ads.\n\nI disconnected the led.\nFuck tcl, fuck roku and any other manufacturers that shove \"smart TV\" down our throat for data collection.",
          "score": 10,
          "created_utc": 1742279275.0,
          "replies": [
            {
              "id": "miwdev3",
              "author": "wormsisworms",
              "body": "lol I wondered why that light was always blinking",
              "score": 2,
              "created_utc": 1742519452.0,
              "replies": [
                {
                  "id": "miz0ura",
                  "author": "reitraf",
                  "body": "I did a factory reset and, during setup, said no internet available; that stopped the blinking light.",
                  "score": 2,
                  "created_utc": 1742564610.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mibof6o",
          "author": "oForce21o",
          "body": "lisan al agaib",
          "score": 80,
          "created_utc": 1742244229.0,
          "replies": [
            {
              "id": "micc5xq",
              "author": "jonfitt",
              "body": "Bless the maker and his water.",
              "score": 10,
              "created_utc": 1742251499.0,
              "replies": []
            },
            {
              "id": "mibsrug",
              "author": "gimme20regular_cash",
              "body": "Al Nevar Yus Agaib",
              "score": 11,
              "created_utc": 1742245480.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mid2eg1",
          "author": "strangefish",
          "body": "They had some software license agreement update that I couldn't get to accept due to a glitch of some kind, and it bricked the Roku stick. I made the decision to never buy a Roku device, especially an entire tv, as they seemed awfully cavalier about screwing over their customers for peanuts.",
          "score": 6,
          "created_utc": 1742260234.0,
          "replies": []
        },
        {
          "id": "micynry",
          "author": "NRMusicProject",
          "body": "I bought a Samsung Smart TV...and will never connect it to the internet.  I have a PC connected, and feel I'm missing nothing with the TV's \"features.\"",
          "score": 5,
          "created_utc": 1742258939.0,
          "replies": []
        },
        {
          "id": "micspes",
          "author": "thisischemistry",
          "body": "And this is why I will never ever ever connect my TV to a network. Updates often degrade functionality, if the TV doesn't work well out of the box then I'm not rolling the dice to see if updates make things better or worse. It'll just go back in the box and get returned.",
          "score": 8,
          "created_utc": 1742256942.0,
          "replies": []
        },
        {
          "id": "mica2xp",
          "author": "Speedstick8900",
          "body": "I never even hooked mine up to wifi because I didn’t need to. Glad to see I’ll never have to anyways",
          "score": 5,
          "created_utc": 1742250821.0,
          "replies": []
        },
        {
          "id": "micniuq",
          "author": "sdf_iain",
          "body": "We have a pi-hole setup and a lot of the Roku UI ads can be blocked by DNS.",
          "score": 3,
          "created_utc": 1742255210.0,
          "replies": []
        },
        {
          "id": "mid7jkf",
          "author": "TrumpDidNoDrugs",
          "body": "I had a Roku TV, but I bought a Chromecast and use that. It's 10000000000x better, no exaggeration. I use the same Chromecast on my current TV.",
          "score": 3,
          "created_utc": 1742262043.0,
          "replies": []
        },
        {
          "id": "midkngi",
          "author": "NickCharlesYT",
          "body": "You paid a *subsidized cost* for your TV, or so the manufacturers say...This is why my LG CX has never and will never be connected to the internet to use \"smart\" features. Can't even imagine what kind of garbage LG has probably pushed to everyone else's by now. If my Apple TV decides to self-destruct with ad placements everywhere I can replace it without replacing the entire TV.",
          "score": 4,
          "created_utc": 1742266769.0,
          "replies": []
        },
        {
          "id": "mid031b",
          "author": "ThyBuffTaco",
          "body": "Disconnect it from the internet and use a different stick or console/pc-mac we have tons of options now",
          "score": 2,
          "created_utc": 1742259428.0,
          "replies": []
        },
        {
          "id": "mid965y",
          "author": "PlayingDoomOnAGPS",
          "body": "Yeah, Roku is well past the fuck-the-consumer stage of the enshittification cycle and they're working hard on the fuck-the-providers stage. Roku adds NEGATIVE value to a \"smart\" TV at this point.",
          "score": 2,
          "created_utc": 1742262612.0,
          "replies": []
        },
        {
          "id": "mie6yjp",
          "author": "itsjustyouandi",
          "body": "Same",
          "score": 1,
          "created_utc": 1742277317.0,
          "replies": []
        },
        {
          "id": "miewxd3",
          "author": "Popisoda",
          "body": "It's not good",
          "score": 1,
          "created_utc": 1742293873.0,
          "replies": []
        },
        {
          "id": "mifeuqc",
          "author": "None",
          "body": "If my Roku does this to me, I will open the Fire streamer I got for a gift, and try it instead.  Fight fire with Fire.",
          "score": 1,
          "created_utc": 1742302031.0,
          "replies": []
        },
        {
          "id": "mifl8q7",
          "author": "fvck_u_spez",
          "body": "They really have upped the scummy-ness of the ads lately. Amazon Prime will cover your show almost instantly with a full screen ad when you pause it, and YouTube now shrinks the screen and brings in an add on the side when you pause on mobile. So infuriating, at this rate every piece of software will be unusable due to ads in a few years",
          "score": 1,
          "created_utc": 1742304337.0,
          "replies": []
        },
        {
          "id": "mifnb26",
          "author": "Breno1405",
          "body": "Apparently companies haven't learned their lesson from when Microsoft announced always having to be online to play games on the Xbox one. I knew quite a few people who switched to PlayStation for that reason. Microsoft back tracked on the plan but the damage was done.",
          "score": 1,
          "created_utc": 1742305042.0,
          "replies": []
        },
        {
          "id": "miftjnf",
          "author": "MSGdreamer",
          "body": "I agree, I like my Roku tv, but if they start fucking with ads I’m done",
          "score": 1,
          "created_utc": 1742307044.0,
          "replies": []
        },
        {
          "id": "mig8ree",
          "author": "Liroku",
          "body": "My daughters amazon fire tv does ads on startup. The tv is so so so incredibly slow and the ads are the first thing that load and you can't navigate or do much of anything while the tv is loading up. And then the ads are so littered throughout the menu that its a constant fight with lag just to find the app you want.\n\nAnyway, so i factory reset it, left it disconnected from the internet completely, and plugged in a roku stick. If roku starts doing the same thing I will 100% trash it and build a small htpc for it so I can control it from now on. \n\nSo tired of these companies squeezing every possible penny out of every facet of our lives. Can't even get home after working 14 hours and watch tv, because it has to play an ad first, then it has to update the apps for 10 minutes, needs a reboot to finish the update, well now it's booting so time for an ad. Finally I can launch a streaming service I'm paying monthly for, so I can sit through more ads. Make sure I update my profile first, they need to keep my data fresh so they can sell it for top value. Can't wait until I'm stuck in a self driving smart car that plays ads on the guage cluster, infotainment screens, and heads up display the entire drive to work and back.",
          "score": 1,
          "created_utc": 1742311594.0,
          "replies": []
        },
        {
          "id": "miglu2t",
          "author": "RhetoricalOrator",
          "body": "There really should be a law that limits changes to ToS and changes that do not benefit the user. \n\n Imagine buying a car in 2019 and when you tried to leave for work this morning, you first had to wait for it to play an ad for Dunkin Donuts before it could shift from park.",
          "score": 1,
          "created_utc": 1742315375.0,
          "replies": []
        },
        {
          "id": "mihfkgx",
          "author": "deadzol",
          "body": "Happened once for SO, but as soon as it happens for me I’m ordering another device.",
          "score": 1,
          "created_utc": 1742323610.0,
          "replies": []
        },
        {
          "id": "mic8gpz",
          "author": "wpmason",
          "body": "You paid for a Roku product. \n\nRoku doesn’t consider itself a tech company, they are an advertising company. Everything they do is in service of selling ads. \n\nYou never should have paid for a Roku product in the first place.",
          "score": -12,
          "created_utc": 1742250300.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mibszel",
      "author": "Starkiller_303",
      "body": "It's funny that in the last 2 years I've gone back to torrenting all I watch because streaming services, smart tvs, and the like have become terrible and have too many ads. \n\nThat industry will continue to grow the more they try stupid shit like this. \n\nThey'd play ads on the inside of our eyelids 24/7 if they could get away with it.",
      "score": 350,
      "created_utc": 1742245541.0,
      "replies": [
        {
          "id": "mic6yfv",
          "author": "BusinessBear53",
          "body": "Yeah, curating my library on Plex has become this mini hobby for me. Download and watch what I want ad free and have fun organising everything.",
          "score": 76,
          "created_utc": 1742249822.0,
          "replies": [
            {
              "id": "midaiy2",
              "author": "NGLIVE2",
              "body": "My buddy set me up on his Plex server and he does a pretty good job keeping it updated with new stuff but I still want to set one up myself. It’s been a little dream of mine for years now. Even thinking about getting a new Mac mini just for that purpose. A little side project for me to tinker with.",
              "score": 20,
              "created_utc": 1742263089.0,
              "replies": [
                {
                  "id": "midha0n",
                  "author": "Themasterofcomedy209",
                  "body": "If you do decide to set one up, it’s extremely easy and free with jellyfin on proxmox. It might seem intimidating, but there’s copy and paste scripts for most things to set up a server and whatever else you want to add",
                  "score": 7,
                  "created_utc": 1742265505.0,
                  "replies": [
                    {
                      "id": "midqgn1",
                      "author": "whineylittlebitch_9k",
                      "body": "i have a jellyfin instance running side by side plex (on proxmox).  i haven't setup the user watch history 2 way sync yet, but need to do that and setup external auth... and them convince my friends and family to install jellyfin on their devices.  that last part is why I'm dragging my feet on the other two. \n\n  \nbut I'm anticipating a future where Plex disables library sharing...",
                      "score": 2,
                      "created_utc": 1742269119.0,
                      "replies": []
                    },
                    {
                      "id": "midlxc5",
                      "author": "dubbl_bubbl",
                      "body": "Is jellyfin the best Plex alternative currently? I used to be pretty heavy into Plex but the internet connection requirement has kind of turned me off. And I have mainly been using streaming for the past 5+ years. Just got a new Nas so looking at starting up something similar again.",
                      "score": 2,
                      "created_utc": 1742267261.0,
                      "replies": [
                        {
                          "id": "miedsf2",
                          "author": "Themasterofcomedy209",
                          "body": "I think it’s one of the best alternatives, I can’t say best for everyone, but for me it is. The only real lacking thing is a main mobile app (getting better, there some good options now) and setting up transcoding is a bit of a hassle if you need that. But once I set it up I haven’t had to mess around basically at all",
                          "score": 4,
                          "created_utc": 1742281572.0,
                          "replies": [
                            {
                              "id": "miee2la",
                              "author": "dubbl_bubbl",
                              "body": "Ah. Yeah I wouldn’t need an app and usually avoid transcoding. So peon worth a look.",
                              "score": 2,
                              "created_utc": 1742281753.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mifrl7a",
                          "author": "Candle1ight",
                          "body": "The biggest open source alternative, yeah. It's been forever since I ran a Plex instance so I'm not sure what you would be losing/gaining. \n\nLuckily they play nicely together sharing libraries so you can run them both simultaneously and decide which you prefer.",
                          "score": 1,
                          "created_utc": 1742306424.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "miej0zd",
                  "author": "RedTuna777",
                  "body": "Collectively our friend group has like 17TB of video. Funny thing is the biggest amount of stuff is like kids movies because somebody just became a grandpa and they have like every cartoon, super hero and kids movie from the last 60 years on there. We're debating switching from plex to jellyfin lately though.",
                  "score": 4,
                  "created_utc": 1742285052.0,
                  "replies": []
                },
                {
                  "id": "mipz8go",
                  "author": "cart3r-sanders0n",
                  "body": "FWIW, I started my Plex journey as a way to host old home videos for my family to watch. Fast forward a year and it’s exploded far past “a little side project” to over 20TB of movies and TV shows. Obviously, you can dedicate as much or as little time and money as you choose, but if you’re anything like us folks over at r/plex, you might end up spending a lot more time on it than you ever thought you would! I know I sure do, but I also enjoy every moment of it.",
                  "score": 3,
                  "created_utc": 1742432879.0,
                  "replies": [
                    {
                      "id": "miqswn9",
                      "author": "NGLIVE2",
                      "body": "Thanks bud, I didn’t even think about the Plex sub, there’s a Reddit sub for everything lol \nI just joined it!",
                      "score": 1,
                      "created_utc": 1742444194.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mifqxq6",
                  "author": "TheDreamWoken",
                  "body": "It’s really easy just drag and drop files liberally",
                  "score": 2,
                  "created_utc": 1742306218.0,
                  "replies": []
                },
                {
                  "id": "midc2xz",
                  "author": "vckin22",
                  "body": "Right there with you",
                  "score": 1,
                  "created_utc": 1742263642.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mifqk93",
              "author": "MrNerd82",
              "body": "I run a plex off my synology - everything highly organized, zero ads, all local.  30TB of everything I love in actual 1080p or 4k quality.   40TB in the array to grow as needed :) \n\nI have 1Gig fiber and tired to show my parents how they can stream anything they want through my system, but they can't seem to understand \"it's free, just click what you want\"",
              "score": 1,
              "created_utc": 1742306102.0,
              "replies": []
            },
            {
              "id": "mig4hsd",
              "author": "montrayjak",
              "body": "This is the way to go. I chose Jellyfin over Plex, which still has a few quirks, but overall I've been having a blast getting everything organized.",
              "score": 1,
              "created_utc": 1742310341.0,
              "replies": []
            },
            {
              "id": "mig74l2",
              "author": "PythonPussy",
              "body": "Same here. It's crazy how detail oriented the process is that's its become a borderline obsession to get all the integrations working flawlessly. I'm also starting to incorporate trips to the library as part of my weekend tasks so that I can borrow Blu-ray discs to rip.",
              "score": 1,
              "created_utc": 1742311116.0,
              "replies": []
            }
          ]
        },
        {
          "id": "micdtbp",
          "author": "RustyDogma",
          "body": "I'm with you. When streaming services were relatively cheap and ad-free I was more than happy to pay. My streaming services are now as expensive as cable 15 years ago. I can actually stomach that. But you want ads on top - just no. I'll dump it all and torrent. Stop trying to squeeze every penny out of your users, and create a positive experience that keeps people coming back.",
          "score": 21,
          "created_utc": 1742252036.0,
          "replies": [
            {
              "id": "miefckq",
              "author": "Sherinz89",
              "body": "Indeed\n\nJust like Steam store, I have no problem in paying for service I use\n\nBut the recent bullshit surrounding streaming services whereby everyone and their grandma want to locked a series or movies in their platform is pure dogshit\n\nAs such, I have now unsubscribe all the servives and settled on watching elsewhere\n\nGood for them and good for me",
              "score": 1,
              "created_utc": 1742282601.0,
              "replies": []
            }
          ]
        },
        {
          "id": "miclp3a",
          "author": "blackscales18",
          "body": "I was running emby on a Roku, what do you use for your media player box",
          "score": 3,
          "created_utc": 1742254603.0,
          "replies": [
            {
              "id": "micyxa0",
              "author": "SysAdmyn",
              "body": "If they're torrenting their media, there's like a 90% chance they're using Plex or Jellyfin to self-host it all",
              "score": 6,
              "created_utc": 1742259029.0,
              "replies": [
                {
                  "id": "mid57kg",
                  "author": "C-C-X-V-I",
                  "body": "Or Stremio to have someone else do all that",
                  "score": 2,
                  "created_utc": 1742261224.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mid5hbm",
          "author": "joe199799",
          "body": "Projectify launcher and stremio + torrentio + debrid is all I need on my TV seriously I'm down to 3 apps on my homescreen stremio, Kodi as a backup and for live sports, and smarttube for YouTube.",
          "score": 3,
          "created_utc": 1742261320.0,
          "replies": [
            {
              "id": "mieadix",
              "author": "Vinnie_Vegas",
              "body": "*Projectivy",
              "score": 0,
              "created_utc": 1742279399.0,
              "replies": [
                {
                  "id": "mietyo1",
                  "author": "joe199799",
                  "body": "May bad yea lol",
                  "score": 1,
                  "created_utc": 1742292183.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "midaco9",
          "author": "asterboy",
          "body": "I’ve got Amazon (thru my sister), but started pirating Reacher just to avoid those god awful ads at the start and mid way. \nThe ads are always awful, and completely kill the vibe.",
          "score": 3,
          "created_utc": 1742263029.0,
          "replies": [
            {
              "id": "mifb1m3",
              "author": "jdspoe",
              "body": "Adguard dns stops all Prime ads except the short Prime promos at the start of a movie. (and it's free, I use it on my phone and TV)",
              "score": 1,
              "created_utc": 1742300538.0,
              "replies": []
            }
          ]
        },
        {
          "id": "micuf6d",
          "author": "DickyMcButts",
          "body": "stremio + torrentio + a VPN.  i can watch literally anything",
          "score": 2,
          "created_utc": 1742257515.0,
          "replies": [
            {
              "id": "mid59ly",
              "author": "C-C-X-V-I",
              "body": "I just wish the browsing was as good as the other apps.  Actual 4k coming in though is a huge upgrade",
              "score": 1,
              "created_utc": 1742261244.0,
              "replies": []
            },
            {
              "id": "mij2ph7",
              "author": "StressOverStrain",
              "body": "Yeah, and thieves can steal literally anything. What’s your point? Bragging on Reddit like some kind of child?\n\nA lot of people in this thread sure believe they are entitled to all the content they want at the price point they want forever, and if no one will sell them that, they feel entitled to just consume it anyway. Let other schmucks fund my entertainment. Then they whine that they’re only getting a handful of episodes in each season and every season takes years to produce.",
              "score": 1,
              "created_utc": 1742341039.0,
              "replies": []
            },
            {
              "id": "mid5rea",
              "author": "joe199799",
              "body": "Sub to a debrid service if that's all you're using the VPN for. it would be cheaper and you wouldn't need a VPN using a debrid service as everything goes through their servers first.",
              "score": 1,
              "created_utc": 1742261418.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mid44ly",
          "author": "lunaflect",
          "body": "I pretty much quit watching tv. I will get a month’s sub to a streaming service on occasion and watch maybe 30 minutes to an hour a night.",
          "score": 1,
          "created_utc": 1742260843.0,
          "replies": []
        },
        {
          "id": "midzbqf",
          "author": "bringbackswg",
          "body": "I just setup a Plex server with Usenet access plus Sonarr and Radar and it’s changed my life. I’ll never spend another dime on media unless I want to support specific artists or media. Too much buyers remorse",
          "score": 1,
          "created_utc": 1742273166.0,
          "replies": []
        },
        {
          "id": "mieipnx",
          "author": "nebola77",
          "body": "Don’t know for other services, but I only really use the 5€ Neflix Ad version. On pc in browser with ad block, I literally never saw a single ad.",
          "score": 1,
          "created_utc": 1742284842.0,
          "replies": []
        },
        {
          "id": "miexfm4",
          "author": "LunarMoon2001",
          "body": "Exactly. Went to cable to avoid commercials, went to streaming to avoid cable commercials, went back to sail the pirate seas to avoid streaming commercials.",
          "score": 1,
          "created_utc": 1742294153.0,
          "replies": []
        },
        {
          "id": "mifj8vw",
          "author": "zushiba",
          "body": "Enshitification, we are no longer the customer. We are the product. It’s the natural life cycle of corporations in this day and age.",
          "score": 1,
          "created_utc": 1742303647.0,
          "replies": []
        },
        {
          "id": "migrrjd",
          "author": "Affectionate_Sea_551",
          "body": "My tnas + plex server has never been happier!",
          "score": 1,
          "created_utc": 1742317059.0,
          "replies": []
        },
        {
          "id": "miln9pl",
          "author": "Mr_Julez",
          "body": "Sounds like the sequel to the Black Mirror episode on forced ads.",
          "score": 1,
          "created_utc": 1742383478.0,
          "replies": []
        },
        {
          "id": "min6ups",
          "author": "felidaekamiguru",
          "body": ">They'd play ads on the inside of our eyelids 24/7 if they could get away with it.\n\n\nThey'd do it 25/8 were it possible! ",
          "score": 1,
          "created_utc": 1742402243.0,
          "replies": []
        },
        {
          "id": "mirbpg9",
          "author": "BevansDesign",
          "body": "Yup. Meanwhile, I haven't pirated a game or song in a very long time thanks to Steam and Spotify - although Spotify keeps getting gradually crappier.",
          "score": 1,
          "created_utc": 1742454835.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mibt734",
      "author": "Lachee",
      "body": "The ad industry has gotten so large and obnoxious because we let it with complicity.\n\nIf they push this, throw out your Roku",
      "score": 549,
      "created_utc": 1742245606.0,
      "replies": [
        {
          "id": "mic7tdu",
          "author": "PigglyWigglyDeluxe",
          "body": "That’s a huge problem with society overall, as it turns out, people are willing to accept MUCH worse before actually doing anything about it.",
          "score": 122,
          "created_utc": 1742250096.0,
          "replies": [
            {
              "id": "midi9e4",
              "author": "stupedlonghorse",
              "body": "Like their government turning fascist?",
              "score": 50,
              "created_utc": 1742265866.0,
              "replies": [
                {
                  "id": "midjadu",
                  "author": "PigglyWigglyDeluxe",
                  "body": "Unfortunately so. \n\nI am not one of them but I am just one among 300+million idiots.",
                  "score": 15,
                  "created_utc": 1742266253.0,
                  "replies": []
                },
                {
                  "id": "miecp1k",
                  "author": "Asynjacutie",
                  "body": "When all you have to say is \"no we're not\" and they believe it without question.",
                  "score": -2,
                  "created_utc": 1742280866.0,
                  "replies": []
                },
                {
                  "id": "mietgo8",
                  "author": "Nick_Stoned",
                  "body": "Yeah letting in all those illegal immigrants who were gang members was pretty damn fascist. Good thing that isn't happening anymore :)",
                  "score": -14,
                  "created_utc": 1742291890.0,
                  "replies": [
                    {
                      "id": "miexywv",
                      "author": "unassumingdink",
                      "body": "What... what do you think fascist means?",
                      "score": 6,
                      "created_utc": 1742294443.0,
                      "replies": [
                        {
                          "id": "mifbunj",
                          "author": "KE0UZJ",
                          "body": "He doesn't really know. Just regurgitating what he saw on Facebook.",
                          "score": 5,
                          "created_utc": 1742300862.0,
                          "replies": [
                            {
                              "id": "mifhxm3",
                              "author": "Nick_Stoned",
                              "body": "I don't use Facebook.",
                              "score": -5,
                              "created_utc": 1742303176.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mifi9te",
                          "author": "Nick_Stoned",
                          "body": "Ur mum",
                          "score": -5,
                          "created_utc": 1742303299.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mif52ie",
                      "author": "droi86",
                      "body": "Lol, Biden deported more people than Trump in his first term and so far he's still beating him on month to month basis, so who's letting gang members in again?\n\n\nhttps://www.bbc.com/news/articles/c36e41dx425o\n\nhttps://www.reuters.com/world/us/trump-set-broaden-arrests-deportation-routes-expand-immigration-crackdown-2025-02-21/",
                      "score": 3,
                      "created_utc": 1742297961.0,
                      "replies": [
                        {
                          "id": "mifht2v",
                          "author": "Nick_Stoned",
                          "body": "I really doubt anything the \"Biden\" administration did after Joe's debate performance. If they'll fake a president's competency to that level, they'll fake anything.",
                          "score": 2,
                          "created_utc": 1742303131.0,
                          "replies": [
                            {
                              "id": "mifsjrd",
                              "author": "droi86",
                              "body": "“The Party told you to reject the evidence of your eyes and ears. It was their final, most essential command.”",
                              "score": 3,
                              "created_utc": 1742306733.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mifbqsp",
                      "author": "KE0UZJ",
                      "body": "Idiots are gonna idiot. Idiot.",
                      "score": 0,
                      "created_utc": 1742300818.0,
                      "replies": [
                        {
                          "id": "mifhgvu",
                          "author": "Nick_Stoned",
                          "body": "Keep voting for the Party that skipped their primary and then lost by a landslide. I'm sure they'll follow through on their promises this time!",
                          "score": 1,
                          "created_utc": 1742303006.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mii27z6",
                      "author": "stupedlonghorse",
                      "body": "sure... i bet you think Canadians are supplying your country in fentanyl too?\n\n ffs man... wake up, you're being played",
                      "score": 0,
                      "created_utc": 1742330042.0,
                      "replies": [
                        {
                          "id": "mii6drl",
                          "author": "Nick_Stoned",
                          "body": "Very ironic",
                          "score": 2,
                          "created_utc": 1742331220.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mief7f9",
              "author": "CriticalNovel22",
              "body": "It's creep. \n\n\nDo as much as you can that people will be upset with but not sufficiently upset to act upon.\n\n\nThen, when that is normalised, do a bit more.\n\n\nRepeat forever.",
              "score": 1,
              "created_utc": 1742282507.0,
              "replies": []
            },
            {
              "id": "mihq6rc",
              "author": "_haha_oh_wow_",
              "body": "butter crowd quickest lush deserve grandfather wild thumb slim roof\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 1,
              "created_utc": 1742326642.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mic5ntp",
          "author": "Secret-Constant-7301",
          "body": "I was going to throw out my firestick and get a Roku. But why bother now.",
          "score": 14,
          "created_utc": 1742249411.0,
          "replies": [
            {
              "id": "micz1vf",
              "author": "SarcasticOptimist",
              "body": "I switched from a Firestick to a Google TV after seeing annoying homescreen ads. It much faster, I don't see ads after switching to Project ivy, and it takes Smarttubetv.",
              "score": 9,
              "created_utc": 1742259072.0,
              "replies": [
                {
                  "id": "miewtc2",
                  "author": "confrondex",
                  "body": "SmarttubeTV is a godsend. Absolute necessity nowadays.",
                  "score": 2,
                  "created_utc": 1742293810.0,
                  "replies": []
                },
                {
                  "id": "mif7cak",
                  "author": "OMGItsCheezWTF",
                  "body": "You can switch the launcher on a fire stick, but yeah the OOTB homepage banner is annoying",
                  "score": 1,
                  "created_utc": 1742298973.0,
                  "replies": [
                    {
                      "id": "mifxtbm",
                      "author": "Secret-Constant-7301",
                      "body": "How do you turn the banner off",
                      "score": 1,
                      "created_utc": 1742308351.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "migeky6",
              "author": "A_Witty_Name_",
              "body": "Apple TV is more expensive but infinitely worth it. My old FireTV sticks would eventually slow down and become unusable. Never had an issue once with Apple TV.",
              "score": 4,
              "created_utc": 1742313286.0,
              "replies": []
            },
            {
              "id": "mihqf03",
              "author": "_haha_oh_wow_",
              "body": "rinse jellyfish caption station head test selective simplistic spotted straight\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 1,
              "created_utc": 1742326706.0,
              "replies": []
            }
          ]
        },
        {
          "id": "micdbu1",
          "author": "7-SE7EN-7",
          "body": "Back when radio ads were first introduced, advertisers were hesitant to buy them because the listeners couldn't just flip past them",
          "score": 7,
          "created_utc": 1742251880.0,
          "replies": []
        },
        {
          "id": "mibydgs",
          "author": "BurningOasis",
          "body": "What I find impressive is the amount of people who don't think advertising works on them. \n\n\nCompanies are spending billions of dollars on advertising but you think you're the human who's impervious to propaganda. Astonishing. ",
          "score": 27,
          "created_utc": 1742247156.0,
          "replies": [
            {
              "id": "mic2cop",
              "author": "CouldIRunTheZoo",
              "body": "I’m not impervious to propaganda.  That’s why I don’t want fucking ads shoved down my throat all the time.",
              "score": 61,
              "created_utc": 1742248367.0,
              "replies": [
                {
                  "id": "mij3k5m",
                  "author": "StressOverStrain",
                  "body": "Plenty of subscription services out there without ads. Online newspapers, magazines, television, movies, etc. etc. with no or minimal well-behaved advertising.\n\nProblem is your average idiot whines about ads and also whines about subscriptions costing too much. The internet gave people a taste of free information, and now they want everything for free in their exact preferred form.",
                  "score": 1,
                  "created_utc": 1742341309.0,
                  "replies": [
                    {
                      "id": "minrh17",
                      "author": "nuisanceIV",
                      "body": "At this point I realized I’m down to buy things but the value definitely has to be there - and I find a lot of services do not provide that. Whether it’s from how their company is run(this is usually the reason) to just what’s available via the service for the cost.\n\nSo I vote with my dollar and don’t use the service or “find it somewhere else”.",
                      "score": 1,
                      "created_utc": 1742408132.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "micue8j",
              "author": "less_concerned",
              "body": "95% of the time when i see an ad it's for a good or service i never had any interest in and won't buy, the other 5% of the time it's for something i regularly buy anyway so advertising it to me was redundant",
              "score": 21,
              "created_utc": 1742257506.0,
              "replies": [
                {
                  "id": "midhxj9",
                  "author": "tooclosetocall82",
                  "body": "So you say you keep buying the brand with those ads but not the other brands without those ads? So much advertising is just to drown out the competition and keep certain brands in your subconscious.",
                  "score": -7,
                  "created_utc": 1742265744.0,
                  "replies": [
                    {
                      "id": "midlob0",
                      "author": "less_concerned",
                      "body": "Not really, i always skim shelves at the store for comparing cheaper/better products, I'm not attached to brands, words on the radio or on youtube ads are meaningless and easily ignorable\n\nIf i make repeat purchases it's because i found that brand satisfies my needs and is accessible to me, and i have swapped to other brands after quality dips or price goes up",
                      "score": 7,
                      "created_utc": 1742267161.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mid50gx",
              "author": "Zekumi",
              "body": "At our house we’ve actually stopped buying brands we’d normally buy or used to have no issue with because of obnoxious advertising campaigns, like Burger King and Dawn dish soap. \n\nThe way you spend your money is power.",
              "score": 11,
              "created_utc": 1742261154.0,
              "replies": []
            },
            {
              "id": "mic7bhz",
              "author": "1HappyIsland",
              "body": "Advertising doesn't work when you don't buy stuff you don't need.",
              "score": 20,
              "created_utc": 1742249937.0,
              "replies": [
                {
                  "id": "miccqlj",
                  "author": "SimiKusoni",
                  "body": "It might work *differently* for people with different spending profiles, but in terms of it outright \"not working\" there are very few people who are subsistence farming hermits which is pretty much what it would take to render yourself impervious.\n\nAnd that's ignoring that not all advertising is intended to achieve a sale, even indirectly.",
                  "score": 9,
                  "created_utc": 1742251688.0,
                  "replies": [
                    {
                      "id": "mizv4gy",
                      "author": "TimeToGloat",
                      "body": "It doesn't work on me simply due to the fact I don't ever receive ads for anything I actually buy. If you don't consume a lot and you opt out of personalized ads and adblock where possible the odds of getting anything even relevant to you are like zero. Essentials I choose by price/features in store or doing my own research. Luxury/hobby products are generally so niche I don't recall ever getting ads for any of my interests. The closest would be youtube sponsored ads as they are more interest targeted but it's just so much random shit you don't need.\n\nI don't think I'm truly immune to marketing just my purchasing habits don't really align with advertising.",
                      "score": 1,
                      "created_utc": 1742573681.0,
                      "replies": [
                        {
                          "id": "mj0j4g7",
                          "author": "SimiKusoni",
                          "body": ">I don't think I'm truly immune to marketing just my purchasing habits don't really align with advertising.\n\nThat's a fair take, and I'm probably in a similar position, however if you look at stealth advertising and product placements they generally aren't for big (or even medium) purchases.\n\nSure you'll see the odd thing for games consoles, cars or whatever but the majority is focussed on sundries, white goods and the like and there are very few people who can honestly say they aren't the target audience for that.\n\nYou can certainly limit exposure but I think people who believe advertising doesn't work on them *at all* are probably underestimating how insidious some of it can be.",
                          "score": 1,
                          "created_utc": 1742580549.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mid552y",
                  "author": "folk_science",
                  "body": "When you buy stuff you need, you have choices. Advertising affects your understanding about these choices. It can shape your perception of brands. It can make you aware of certain features or flaws of various products. It can also affect you indirectly; for example, when your friend buys a product due to advertising, likes it and then recommends it to you.",
                  "score": 2,
                  "created_utc": 1742261199.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mj3lcas",
              "author": "None",
              "body": "I used to get ads on YouTube for:\n- Boner pills\n- Sports betting\n- Car insurance\n- Fake AI Steve Harvey “the government doesn’t want you to know this but you can still claim your $5,000 stimulus check now!!” scams\n\nI am a 20 year old woman in college who doesn’t own a car or even watch sports. I promise you these annoying ass ads are NOT working on me lmao. I have never bought something just because I saw an advertisement for it.",
              "score": 1,
              "created_utc": 1742618595.0,
              "replies": []
            },
            {
              "id": "mict00w",
              "author": "Neoragex13",
              "body": "For most of my people though, it really doesn't work. Everything that appears on those Ads nowadays is pricey as all hell and everyone and their mom were already used since years ago to just go to the nearest local big store/market and buy cheaper off-brand or local made which also ends up being cheaper and does the trick as good if not better. \n\nPropaganda does affect in other areas, but it's very rare for it to recover cost for products since either people very rarely fully pays their credit (so the bank ends up losing while the person disappears with a cousin in another state) or people outright doesn't buy anything due the lack of economic freedom.",
              "score": 1,
              "created_utc": 1742257040.0,
              "replies": []
            },
            {
              "id": "midjxbb",
              "author": "Howboutnow82",
              "body": "What I find impressive is the amount of people who say things like this and think that just because someone advertises to my broke ass that I can just shit money and go buy their junk. I don't have any money. Your advertising dollars are wasted on me 100% of the time.",
              "score": 1,
              "created_utc": 1742266496.0,
              "replies": []
            },
            {
              "id": "micfjun",
              "author": "angrydeuce",
              "body": "I mean, I know it doesn't work on me because if I get a forced ad that I can't skip I deliberately do NOT buy that product.  Even if it looks cool I'll buy a competitors product that didn't spend all their money on paying for unskippable ads on every streaming platform because odds are much higher that company is probably putting that unspent ad buy money towards things that actually improve their product, unlike advertising.\n\n\nBut also, I don't see too many ads anyway, because PiHole is love, PiHole is life.",
              "score": -1,
              "created_utc": 1742252598.0,
              "replies": [
                {
                  "id": "micj6ia",
                  "author": "ABetterKamahl1234",
                  "body": "> I don't see too many ads anyway\n\nYou reduced them and *think* you don't.\n\nAds are everywhere in all kinds of forms. Content you watch and read, literal comments and posts on this sub are *ads*. Like, shit, we're all about posts about *products*. \n\nIt's not like marketing isn't the strongest it's ever been, or anything. \n\nShoot, PiHole gets mentioned enough that I'm honestly convinced that it was created to sell the devices. Even though technically you could use any computer for it, everyone uses the *device*.",
                  "score": -4,
                  "created_utc": 1742253780.0,
                  "replies": [
                    {
                      "id": "micnqm2",
                      "author": "angrydeuce",
                      "body": "No, I know for a fact I don't, because I have logs of every ad that was blocked.  You'd be *amazed* how much bullshit gets caught.  Websites that don't work with ad block don't get my traffic.  I've even installed plugins so that in-video sponsor bullshit and interaction reminders get automatically skipped over.\n\n\nI'm not throwing shade at advertisers, just saying if you're invested enough in eliminating their bullshit from your life, as people like me are, you'd be amazed how much of the bullshit you can cut out.\n\n\nI haven't listened to radio, even Spotify, in a decade...local files from a flash drive all the way.\n\n\nI stream videos via plex and my home server.  No ads there.\n\n\nAny YouTube I mentioned before, I have adblockers running not only across my whole LAN but I have plug-ins to block even the in-video shit.\n\n\nStreaming services get piholed into oblivion.  If it stops the service from working (a service were already paying for, mind you) then I stop using the service,  cancel my sub, and get any media locked to their platform via the high sseas to watch it on my Plex.\n\n\nI suppose I'm still forced to see billboards on my drive into work, but lord knows I couldn't tell you what's on a single one of them because I'm driving and looking at the road, not reading billboards.\n\n\nThis is a life's mission to me, ever since the first stupid bullshit banners started popping up on websites in the 90s.  With how much malware and bullshit gets spread *solely through ads*, these days, anyone not running an ad blocker is basically fucking a prostitute without protection everytime they open a web browser.  I will go without something before I subject myself to that bullshit.\n\n\nPiHole gets mentioned because it's an easy way to do it, but like you said, easy enough to spin up a Linux VM and do it that way.\n\n\nAt any rate, even if I see an advertisement, like I said, I will buy a competitors product in that space before I buy the advertised one.  Because ads are fuckin poison and literally ruining the world.",
                      "score": 5,
                      "created_utc": 1742255281.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mic5c1i",
              "author": "gramathy",
              "body": "Advertising works on me well enough for me to be potentially interested and look up independent reviews. I'm not going to buy something just based on the ad, but if you can give me a beneficial value proposition I'll consider your crap.",
              "score": -2,
              "created_utc": 1742249306.0,
              "replies": [
                {
                  "id": "micikil",
                  "author": "NotAHost",
                  "body": "Half of advertising is just getting brand recognition. If one brand advertises enough even if you’ve never heard of it you’ll assume it’s better than non advertised brand just because you have now heard of it.",
                  "score": 4,
                  "created_utc": 1742253579.0,
                  "replies": []
                },
                {
                  "id": "micaett",
                  "author": "Engineer9",
                  "body": "How do you think advertising works on *other* people?",
                  "score": 7,
                  "created_utc": 1742250929.0,
                  "replies": [
                    {
                      "id": "miccb1f",
                      "author": "gramathy",
                      "body": "There are definitely ads based on vibes. Beer commercials, car commercials (at least the ones that show off certain things), lifestyle products, services indistinguishable from other services, most clothing ads, ads for a retail store rather than a particular product, etc. The last time I saw a beer ad based on any kind of (subjective) quality comparison was back when the \"bitter beer face\" ads were running in the 90s.\n\nMeanwhile I've bought products based on recommendations from people I trust to give me an accurate assessment, even if *they* got the product at a discount because the specific thing they bought is heavily branded as a promotional feature. That's advertising, but it's not an \"ad\" in the same way that most ads are.",
                      "score": -2,
                      "created_utc": 1742251547.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "miep388",
              "author": "Vabla",
              "body": "Homeopathic medicine market is valued billions. Doesn't make it work any better.",
              "score": 0,
              "created_utc": 1742289124.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mic5g9c",
          "author": "ThisTooWillEnd",
          "body": "I had paramount+ (without ads) for free for some promotional thing for a couple months. My husband and I were using our ancient PS4 to stream most things, but the paramount+ app was abysmal on it. It was so frustrating because it crashed constantly, but we figured it's an old platform, fair enough. We happened to have a chromecast sitting around so we tried it on there. The app worked much better, no crashes. But it showed us an ad before we could load p+, so we went back to crashy crashy garbage. The Roku (at the time) did not have any extraneous ads and played just fine. It was on a different TV though.",
          "score": 5,
          "created_utc": 1742249344.0,
          "replies": [
            {
              "id": "mics6p8",
              "author": "Adamk0310",
              "body": "Paramount+ works best on Xbox One for me. But it's ridiculous that we have to keep numerous devices around just to get each of these apps to run reliably on one of them.",
              "score": 4,
              "created_utc": 1742256768.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mictb0j",
          "author": "SoCalThrowAway7",
          "body": "I block them at every turn I can, the fuck else was I supposed to do lol? Riots at all the ad agencies around the world?",
          "score": 1,
          "created_utc": 1742257142.0,
          "replies": []
        },
        {
          "id": "mid6vmv",
          "author": "Poopdick_89",
          "body": "I did years ago.",
          "score": 1,
          "created_utc": 1742261810.0,
          "replies": []
        },
        {
          "id": "mie59q7",
          "author": "Zireall",
          "body": "What are we going to do if all the other options do this too? 🏴‍☠️",
          "score": 1,
          "created_utc": 1742276333.0,
          "replies": []
        },
        {
          "id": "miewsbp",
          "author": "ZealousidealToe9416",
          "body": "I use one as my monitor.\n\nJust as a monitor.\n\nExcuse me while I disable its network connection..",
          "score": 1,
          "created_utc": 1742293795.0,
          "replies": []
        },
        {
          "id": "mifrvsh",
          "author": "SignificanceFun265",
          "body": "Thank you. We can’t just let this shit happen. It’s not like we can suspend our service to show Roku; we have already bought their product and then they work at making it worse.",
          "score": 1,
          "created_utc": 1742306517.0,
          "replies": []
        },
        {
          "id": "migb96p",
          "author": "piratep2r",
          "body": "Its not (i would argue) the \"ad industry\"\nIts a publicly traded company's need to make \"profit number go up\" *forever*.\n\nEven when a company dominates a space, this constant pressure has to be satisfied, and so prices go up, quality goes down, portion sizes go down, ads get added.\n\nIts startlingly different when you look at something like valve/steam that is *not* publicly traded.",
          "score": 1,
          "created_utc": 1742312323.0,
          "replies": []
        },
        {
          "id": "migv881",
          "author": "Drakoala",
          "body": "We have enough e-waste - sell it so people willing to jailbreak it have more of a market.",
          "score": 1,
          "created_utc": 1742318040.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mic0k0h",
      "author": "None",
      "body": "[deleted]",
      "score": 63,
      "created_utc": 1742247820.0,
      "replies": [
        {
          "id": "mic2h8m",
          "author": "Wistephens",
          "body": "Yes. How the f can no alternative be found. I have paid to avoid ads.",
          "score": 13,
          "created_utc": 1742248407.0,
          "replies": [
            {
              "id": "mic3ur6",
              "author": "None",
              "body": "[deleted]",
              "score": 14,
              "created_utc": 1742248840.0,
              "replies": [
                {
                  "id": "mieufvh",
                  "author": "Illustrious-Dot-5052",
                  "body": "\\>I’d say that a majority of people would like less ads in their daily life.\n\nMy brother in Christ. Name me one person on this Earth that wants to see more ads in their life.",
                  "score": 6,
                  "created_utc": 1742292459.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "micmo15",
              "author": "Sithlordandsavior",
              "body": "Nobody who matters wants an alternative.\n\nThere's no impetus for making an ad-free device or service. Shoot, I'd say for almost all companies, they'd rather ditch programming and run commercials 24/7 and force you to consume them.",
              "score": 1,
              "created_utc": 1742254925.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "miblzu9",
      "author": "bonesnaps",
      "body": "Enshittification strikes again. Enrokufication?",
      "score": 124,
      "created_utc": 1742243532.0,
      "replies": [
        {
          "id": "miefui5",
          "author": "ryushiblade",
          "body": "Sad thing is Roku used to be great. Before the ads, their OS was just the best. Easy to use and snappy! I have no idea how they fell so far, but considering how they quickly fell from the defacto smart tv OS, their marketing and sales team really screwed the pooch",
          "score": 12,
          "created_utc": 1742282934.0,
          "replies": [
            {
              "id": "mihm3bj",
              "author": "wamj",
              "body": "There’s only so many set top boxes you can sell, and as a publicly traded company they are obligated to increase revenue on a quarterly basis. Cheapest and quickest way to do that is with ads.",
              "score": 1,
              "created_utc": 1742325477.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mibyekt",
          "author": "Caelinus",
          "body": "The dumbest part of this is that Roku already sucks. They are already at the bottom of the barrel, so this is just cutting off the other foot.",
          "score": 34,
          "created_utc": 1742247166.0,
          "replies": []
        },
        {
          "id": "mieopqk",
          "author": "twigboy",
          "body": "Funny thing is I saw [this at a local bubble tea shop](https://i.imgur.com/LOZcpt4.jpeg) and thought what a bloody joke it is to do this sort of thing\n\nRoku right up there with HP on the list of companies veto'd from my home",
          "score": 1,
          "created_utc": 1742288880.0,
          "replies": []
        }
      ]
    },
    {
      "id": "micgoma",
      "author": "P2Shifty",
      "body": "Don't know if it's still a thing but you used to be able to change your Roku TV with like basically a cheat code on the remote to store display mode and it would hide all the ads cuz they're not allowed to display them in the stores without paying.",
      "score": 29,
      "created_utc": 1742252967.0,
      "replies": [
        {
          "id": "mifspd4",
          "author": "SandyBayou",
          "body": "https://lifehacker.com/those-roku-ads-are-just-a-setting-actually-1850287959",
          "score": 12,
          "created_utc": 1742306781.0,
          "replies": [
            {
              "id": "migzvfl",
              "author": "PoisonWaffle3",
              "body": "This is actually pretty nifty, but neither of my Rokus have the option to turn off the cycling ads in that secret menu. I can get to all of the secret menus, it just looks like there's no way to disable the ads in any of them.",
              "score": 6,
              "created_utc": 1742319351.0,
              "replies": [
                {
                  "id": "mihi4v6",
                  "author": "reduces",
                  "body": "They likely updated it and patched it out as the article is from 2023. Same here, doesn't work for me.",
                  "score": 4,
                  "created_utc": 1742324343.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "midnn86",
          "author": "AspartameDaddy317",
          "body": "Anyone have more info on this?",
          "score": 2,
          "created_utc": 1742267948.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mibnr6t",
      "author": "garciawork",
      "body": "Is this roku putting out an ad for its competitors? I do NOT want an apple tv, but this is how you get me to buy an apple tv.",
      "score": 160,
      "created_utc": 1742244038.0,
      "replies": [
        {
          "id": "mic0pfo",
          "author": "Howeird12",
          "body": "Apple TV is legit though. Why don’t you want one?",
          "score": 52,
          "created_utc": 1742247866.0,
          "replies": [
            {
              "id": "mic7g00",
              "author": "PigglyWigglyDeluxe",
              "body": "Hardly legit. I have 3 of them, they all suck. Incredibly laggy, both remote designs are complete and total trash, it’s all designed around being pretty first and functional second. Can’t operate the remote without looking at it, the interface is so crap that if you want to toggle captions or rewind a little bit, you end up clicking the wrong thing entirely. It’s a mess.",
              "score": -16,
              "created_utc": 1742249977.0,
              "replies": [
                {
                  "id": "mic80sd",
                  "author": "Howeird12",
                  "body": "Why did you buy 3 then? lol",
                  "score": 44,
                  "created_utc": 1742250161.0,
                  "replies": [
                    {
                      "id": "mic88bj",
                      "author": "PigglyWigglyDeluxe",
                      "body": "Wife likes it. I’ll put up with a lot if my wife enjoys it. Not the point",
                      "score": 25,
                      "created_utc": 1742250226.0,
                      "replies": [
                        {
                          "id": "mic8w0c",
                          "author": "Howeird12",
                          "body": "Ok. I like mine. It’s snappy and loads things practically instantly. So my experience with it has been fine. The remote. Also fine. I’m not trying to convince anyone to buy anything.",
                          "score": 34,
                          "created_utc": 1742250437.0,
                          "replies": [
                            {
                              "id": "micsxj1",
                              "author": "thenewaretelio",
                              "body": "I was gonna say, the one I relegated to the guest bedroom is kinda slow (the first HD one), but the newest ones in our bedroom and living room (newest and older 4K models) work just fine. The Siri Remote is loads better than the old one. \n\nI’d take the old HD one over ANY shitty OS on a ‘smart TV.",
                              "score": 13,
                              "created_utc": 1742257017.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "midfwb5",
                  "author": "TheEmpireOfSun",
                  "body": "You are the first person in years I have seen describe Apple TV as laggy. You are definitely not bullshiting, sure.",
                  "score": 10,
                  "created_utc": 1742265001.0,
                  "replies": [
                    {
                      "id": "midgdfw",
                      "author": "PigglyWigglyDeluxe",
                      "body": "Just because you’ve never heard of it, doesn’t mean it doesn’t happen, and if you look in the comments in this thread you’ll find another guy in agreement. \n\nWant me to record the lag for ya?",
                      "score": -1,
                      "created_utc": 1742265176.0,
                      "replies": [
                        {
                          "id": "migfp6x",
                          "author": "A_Witty_Name_",
                          "body": "Honestly, yeah",
                          "score": 4,
                          "created_utc": 1742313604.0,
                          "replies": [
                            {
                              "id": "migghgk",
                              "author": "PigglyWigglyDeluxe",
                              "body": "At work. Will try to remember when I get home.",
                              "score": 0,
                              "created_utc": 1742313833.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mic8hob",
                  "author": "BergaDev",
                  "body": "You’d hate a chrome cast then lol\n\nThey also fixed the remotes in the new ones, and in any case, they’re the fastest out there (alongside the nvidia shield)",
                  "score": 6,
                  "created_utc": 1742250309.0,
                  "replies": [
                    {
                      "id": "mic8xk3",
                      "author": "PigglyWigglyDeluxe",
                      "body": "Oh and I do. My sister uses those \n\nI have new and old remotes for my Apple TVs, they both stink. Old one is worse for sure",
                      "score": 1,
                      "created_utc": 1742250451.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "midimxs",
                  "author": "tooclosetocall82",
                  "body": "Laggy? Really? It’s the most OP streamer out there.",
                  "score": 8,
                  "created_utc": 1742266006.0,
                  "replies": [
                    {
                      "id": "midj4ds",
                      "author": "PigglyWigglyDeluxe",
                      "body": "Yes. Laggy. All 3 of them. Press a button, read a book, then it responds. Laggy. \n\nIf someone walks in and needs to tell me something, please hold while I press pause or mute, because it takes its sweet ass time to do anything I need it to do. \n\nI’m fairly tech savvy too so I know the software is up to date, I know my WiFi is solid, I know the remote battery is charged, etc.\n\nDownvote me all you want, downvotes won’t fix how frustratingly slow it is.",
                      "score": 1,
                      "created_utc": 1742266191.0,
                      "replies": [
                        {
                          "id": "midkxyz",
                          "author": "tooclosetocall82",
                          "body": "Your experience definitely hasn’t been mine.",
                          "score": 6,
                          "created_utc": 1742266879.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "micadv4",
                  "author": "MusaEnsete",
                  "body": "Skill issue",
                  "score": 13,
                  "created_utc": 1742250920.0,
                  "replies": [
                    {
                      "id": "micb87l",
                      "author": "PigglyWigglyDeluxe",
                      "body": "I’m sorry I didn’t know I needed any specialized skills to ***operate a tv remote***.",
                      "score": -4,
                      "created_utc": 1742251191.0,
                      "replies": [
                        {
                          "id": "micmppg",
                          "author": "Stingray88",
                          "body": "You don’t.",
                          "score": 9,
                          "created_utc": 1742254940.0,
                          "replies": [
                            {
                              "id": "micodu3",
                              "author": "ttUVWKWt8DbpJtw7XJ7v",
                              "body": "OP needs specialized skills to chew gum and walk at the same time",
                              "score": 2,
                              "created_utc": 1742255497.0,
                              "replies": [
                                {
                                  "id": "micomfs",
                                  "author": "PigglyWigglyDeluxe",
                                  "body": "Lol good one. I like how you’ll go tell other people about me but won’t tell me directly.",
                                  "score": -2,
                                  "created_utc": 1742255576.0,
                                  "replies": [
                                    {
                                      "id": "mid2hxw",
                                      "author": "StylishUnicorn",
                                      "body": "Alright hard",
                                      "score": 3,
                                      "created_utc": 1742260269.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "miekf6d",
                          "author": "UgottaUnderstandbro",
                          "body": "😂😂😂",
                          "score": 1,
                          "created_utc": 1742285983.0,
                          "replies": []
                        },
                        {
                          "id": "mick9g2",
                          "author": "BipedalWurm",
                          "body": "Proprioception helps a lot",
                          "score": 0,
                          "created_utc": 1742254130.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "micmzpj",
                  "author": "yesillhaveonemore",
                  "body": "I don’t get the downvotes.\n\nI really dislike my two Apple TVs. Laggy af. The remotes are a user-hostile joke. Search and content handoff are broken. The “keyboard” is absolutely laughably stupid.\n\nRoku is a better UX, but I dislike the ads. Feels gross.\n\nI use both, but most of my frustration comes from the Apple TVs rather than my Rokus.",
                  "score": 0,
                  "created_utc": 1742255034.0,
                  "replies": [
                    {
                      "id": "micobor",
                      "author": "PigglyWigglyDeluxe",
                      "body": "Agreed. People don’t like seeing anyone being critical of Apple. Jokes on me though, they caught me hook line and sinker. 3 Apple TVs, 1 watch, 1 iPhone, 2 HomePods, and 1 Mac mini. I feel like I’m decently qualified to speak to how awful they are in some ways. \n\nThey all suck though. I’ve tried non-Apple equivalents and they are awful in their own ways. \n\nCan’t have anything be perfect these days, which is a shame, since these shits aren’t cheap. For the money they charge, and all the marketing telling us it’s bleeding edge state of the art global standard, they are anything but, so fuck me for expecting such performance in the real world, right?\n\nAnd that other guy telling me it’s a “skill issue”, I didn’t know I needed training to use a remote. Sorry, I’ll go to tech school for that. I’ll be a certified remote professional in no time.",
                      "score": 7,
                      "created_utc": 1742255476.0,
                      "replies": []
                    },
                    {
                      "id": "mie02op",
                      "author": "bringbackswg",
                      "body": "Not to mention the integration with the iPhone, an infitely better platform to queue up media and control the Apple TV than any remote could ever hope to compare to, is still lacking and broken in a lot of ways. I dont want to EVER navigate the TV interface directly.  I want to choose and queue up media using the phone’s interface, but AirPlay honestly sucks for this. Volume control always breaks, the remote app is dumb and stupid and not a good alternative at all. I’ve spent hours and hours troubleshooting phone integration, volume issues, Airplay issues. They keep changing it and breaking everything.",
                      "score": 0,
                      "created_utc": 1742273530.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mife367",
                  "author": "undisputed_truth",
                  "body": "I’m with you mine glitches a lot as well",
                  "score": 1,
                  "created_utc": 1742301739.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mic15zo",
              "author": "Nacho_Dan677",
              "body": "Because you can get a better Nvidia shield TV pro and put your apple services on there.\n\n\nLots of Codec support, custom launchers, keyboard and mouse support, USB ports, Bluetooth support. It's a great device and should be receiving a refresh on the older 2019 product. Once switch 2 is released we should see a refreshed Nvidia shield TV pro.",
              "score": -11,
              "created_utc": 1742248007.0,
              "replies": [
                {
                  "id": "mic62z2",
                  "author": "MC_chrome",
                  "body": "So, it's a great tinkering box for nerds? Gotcha\n\nThe Apple TV remote works perfectly fine as well....this isn't 2017 where the thing was just a glass trackpad",
                  "score": 17,
                  "created_utc": 1742249544.0,
                  "replies": [
                    {
                      "id": "mifde1h",
                      "author": "IllllIIIllllIl",
                      "body": "I have both an Apple TV and Shield and while I prefer using the Apple TV in general, it isn’t really a true home theater device and calling the Shield a tinkering box for nerds is downplaying what it is. It really is a capable little box that doesn’t need any fiddling to get set up, and unless you’re building a HTPC it’s an essential device if you stream ripped physical media since the Apple TV doesn’t support many of those codecs.\n\nIf the Apple TV fills in those currently existing gaps with the next hardware refresh then it’s probably the best set top box on the market for a long time. ",
                      "score": 1,
                      "created_utc": 1742301472.0,
                      "replies": []
                    },
                    {
                      "id": "mid4bht",
                      "author": "LocustUprising",
                      "body": "you really don’t need to be a nerd to get the few apps it doesn’t support",
                      "score": -3,
                      "created_utc": 1742260911.0,
                      "replies": []
                    },
                    {
                      "id": "micbfau",
                      "author": "Nacho_Dan677",
                      "body": "My bad. I haven't touched an apple TV since 2017. I did not know about the remote refresh. That being said I still find it functionally less capable than the Nvidia shield TV pro. Which still works great out of the box as is without any additional configuration.\n\n\nIt just so happens it can be tinkered with compared to the locked down apple TV I'd give to my mom.",
                      "score": -5,
                      "created_utc": 1742251257.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mic2d6r",
                  "author": "Howeird12",
                  "body": "Wow that’s really cool Nacho Dan! Thanks for the reply. You’re the man!",
                  "score": -11,
                  "created_utc": 1742248372.0,
                  "replies": [
                    {
                      "id": "mic2p0h",
                      "author": "Nacho_Dan677",
                      "body": "You're on a public form. I wanted to drop advice because there is no reason to lock yourself into an ecosystem with a device that has a horrible remote.\n\nEdit: I was not aware of the remote refresh. My only experience was with the 2017 model which left a very sour taste in my mouth.",
                      "score": 4,
                      "created_utc": 1742248474.0,
                      "replies": [
                        {
                          "id": "mic3lt2",
                          "author": "Howeird12",
                          "body": "Again. Thanks for the advice. Reddit Rocks!",
                          "score": -4,
                          "created_utc": 1742248762.0,
                          "replies": [
                            {
                              "id": "mic6bwe",
                              "author": "MC_chrome",
                              "body": "The Apple TV is still perfectly fine if you want a plug & play solution....idk why people here throw a fit and claim something is bad if you can't endlessly tinker with it",
                              "score": 2,
                              "created_utc": 1742249623.0,
                              "replies": [
                                {
                                  "id": "mic722x",
                                  "author": "Howeird12",
                                  "body": "Yeah for sure. It’s a great device I was just curious why someone would be adamantly against owning one. Unless they just hate Apple. Which I could see. \n\nIm in the ecosystem so I like it but I’m sure I would equally or potentially like the shield more.",
                                  "score": -2,
                                  "created_utc": 1742249854.0,
                                  "replies": [
                                    {
                                      "id": "mic7kgh",
                                      "author": "MC_chrome",
                                      "body": ">Unless they just hate Apple\n\nThat's basically the default position for most users on /r/gadgets and /r/technology....if you can't crack it open and do whatever you want to a device then it is automatically bad no matter how false that statement may be in reality.",
                                      "score": 5,
                                      "created_utc": 1742250017.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mid5mqi",
                      "author": "C-C-X-V-I",
                      "body": "Legacy apps can tell you edited.",
                      "score": 1,
                      "created_utc": 1742261373.0,
                      "replies": [
                        {
                          "id": "mid62za",
                          "author": "Howeird12",
                          "body": "Yeah I know. I did it because the guy edited before me. I don’t care.",
                          "score": 1,
                          "created_utc": 1742261531.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mie72ue",
          "author": "itsjustyouandi",
          "body": "It’s called corporate greed.",
          "score": 0,
          "created_utc": 1742277389.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mic94k4",
      "author": "loosebolts",
      "body": "Whoever starts selling a large screen NON smart TV will start making bank if this shit continues. \n\nI just want effectively a large monitor with a few HDMI’s and eARC, no laggy smart shit.",
      "score": 66,
      "created_utc": 1742250514.0,
      "replies": [
        {
          "id": "micncew",
          "author": "MoabBoy",
          "body": "You are essentially describing \"commercial\" or \"digital signage\" panels. Problem is they are a lot more expensive than normal TVs. The \"smart shit\" in modern TVs is harvesting our data and they are using that to subsidise the cost. Another reason commercial panels are more expensive is that they are rated for higher brightness and are designed to operate all day.",
          "score": 35,
          "created_utc": 1742255152.0,
          "replies": [
            {
              "id": "mig3lho",
              "author": "a_cute_epic_axis",
              "body": "There's an easy way around this.  Buy a smart TV with an HDMI or DP input, and don't use the built in smart functionality, just BYOD.\n\nLess expensive, more features.",
              "score": 8,
              "created_utc": 1742310072.0,
              "replies": [
                {
                  "id": "migbn1f",
                  "author": "extordi",
                  "body": "Also important is to not give it access to wifi. I remember hearing about some smart TV's basically monitoring whatever you watch over HDMI too, so completely isolating the thing is really the only option.",
                  "score": 8,
                  "created_utc": 1742312436.0,
                  "replies": [
                    {
                      "id": "migg5jv",
                      "author": "a_cute_epic_axis",
                      "body": "Yes, it gets no internet access in any form.",
                      "score": 2,
                      "created_utc": 1742313736.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mij26i5",
                  "author": "MoabBoy",
                  "body": "Absolutely. My comment was more around \"why don't they make dumb TVs anymore\". They do; they just aren't designed for home use. Easier just to buy a modern TV and turn all the smart shit off.",
                  "score": 1,
                  "created_utc": 1742340869.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "micz799",
          "author": "SirMctowelie",
          "body": "Yep, my living rm tv samsung 85 I never connected to wifi and just have my ps4 and plex plugged in, coffee table is keyboard and mouse. I just want a screen that turns on and works not your shit os.",
          "score": 11,
          "created_utc": 1742259123.0,
          "replies": []
        },
        {
          "id": "mid3m3f",
          "author": "DeepFrieza",
          "body": "You can usually just disable it in the settings. I have a TCL TV that's about 7 or 8 years old now so the Roku app in it was super slow - but then I just disabled it so it works like a \"dumb\" tv",
          "score": 2,
          "created_utc": 1742260662.0,
          "replies": []
        },
        {
          "id": "mie01o3",
          "author": "None",
          "body": "Can you not use TVs that way any more? What happens if you don't connect them to the internet?",
          "score": 1,
          "created_utc": 1742273516.0,
          "replies": [
            {
              "id": "mie7t2c",
              "author": "loosebolts",
              "body": "They still boot whatever OS they’re running.",
              "score": 1,
              "created_utc": 1742277826.0,
              "replies": [
                {
                  "id": "mie9jxe",
                  "author": "None",
                  "body": "Sorry for the dumb questions. I use a projector andnit just shows whatever is coming through the HDMI cable, and that is usually my Apple TV box or a blu-ray player. \n\nBasically you are saying if I tried to use my Apple TV or blu-ray player with a modern smart TV, I would first need to navigate through the TV's OS somehow? I couldn't just turn it on and see what I was feeding it directly?",
                  "score": 1,
                  "created_utc": 1742278891.0,
                  "replies": [
                    {
                      "id": "mie9sje",
                      "author": "loosebolts",
                      "body": "Depends on the TV but most of my TV’s although they do boot to the last input they still load up and show the Home Screen / launcher while doing so. \n\nSamsungs have a bar along the bottom that has adverts in it, as an example",
                      "score": 0,
                      "created_utc": 1742279041.0,
                      "replies": [
                        {
                          "id": "mieas05",
                          "author": "None",
                          "body": "I see, thanks for clearing it up. I suppose there is a low-level OS even on my projector (how I am able to access menu options and things), and it is just happier to live in the background. I definitely feel like you do, that all I will ever really want is a screen to plug into and I'm happier to provide my own source device. I have no confidence either that ads won't start creeping into my Apple TV UI eventually, and I'll have to decide what to do about that when I get there.",
                          "score": 1,
                          "created_utc": 1742279654.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mifwzvu",
          "author": "Serventdraco",
          "body": "Just don't connect it to the Internet. My smart tv is just a tv. It has one of those weird uis but I've seen it maybe twice in like 5 years.",
          "score": 1,
          "created_utc": 1742308105.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mic7p40",
      "author": "z0mbie_boner",
      "body": "Roku has been my ONE holdout from the apple ecosystem for over a decade. I was an early adopter and preferred the interface, still do. But if ads get pushed on me I’m fully ready to make the switch",
      "score": 20,
      "created_utc": 1742250057.0,
      "replies": [
        {
          "id": "midrrxa",
          "author": "None",
          "body": "[deleted]",
          "score": 3,
          "created_utc": 1742269681.0,
          "replies": [
            {
              "id": "mihigpx",
              "author": "reduces",
              "body": "There's lots of other options... Chromecast, Amazon fire stick. But I don't know if those also have ads.",
              "score": 2,
              "created_utc": 1742324437.0,
              "replies": []
            },
            {
              "id": "mik7imr",
              "author": "z0mbie_boner",
              "body": "Def not the only option, but if I move away from Roku, that’s where I’ll go. Im not anti Apple TV, I’ve just liked my Roku, and still use the first one I got in 2013 believe it or not (I’ve since added more to the household, they all run great, new and old)",
              "score": 2,
              "created_utc": 1742355456.0,
              "replies": [
                {
                  "id": "mik8ch2",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 3,
                  "created_utc": 1742355803.0,
                  "replies": [
                    {
                      "id": "mikbr37",
                      "author": "z0mbie_boner",
                      "body": "Agreed!",
                      "score": 1,
                      "created_utc": 1742357303.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mibv34k",
      "author": "leathco",
      "body": "Left Roku a couple years ago. Apple TV rocks, no ads, plenty fast, and RetroArch runs on it for gaming.",
      "score": 38,
      "created_utc": 1742246171.0,
      "replies": [
        {
          "id": "mid57c3",
          "author": "Brassica_prime",
          "body": "Has retroarch gotten useable? It kept deleting the crashbandicoot game i was uploading to it every relaunch",
          "score": 1,
          "created_utc": 1742261222.0,
          "replies": [
            {
              "id": "mifs8lh",
              "author": "Candle1ight",
              "body": "Sounds like an error on your part, retroarch has a lot of users.",
              "score": 1,
              "created_utc": 1742306632.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mibnygb",
      "author": "R-Dragon_Thunderzord",
      "body": "Roku devices going straight Office Space if that happens on my units. They’ll never get another penny from me.\n\n![gif](giphy|l2SpMDbxk09bYpGPC)",
      "score": 72,
      "created_utc": 1742244095.0,
      "replies": [
        {
          "id": "mibvgbb",
          "author": "woops_wrong_thread",
          "body": " BACK UP IN YOUR ASS WITH THE RESURRECTION",
          "score": 22,
          "created_utc": 1742246279.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mic5k4w",
      "author": "AgentTin",
      "body": "I want Roku to know that I have absolutely no loyalty to them and will drop them immediately if they start shoving ads at me.",
      "score": 13,
      "created_utc": 1742249379.0,
      "replies": []
    },
    {
      "id": "micw63x",
      "author": "KazzieMono",
      "body": "It’s always a “test” or a “soft launch” until it suddenly isn’t.",
      "score": 10,
      "created_utc": 1742258103.0,
      "replies": []
    },
    {
      "id": "micagj8",
      "author": "lkn240",
      "body": "If you use something like a pihole it blocks all the homescreen ads.\n\nThat being said this is complete BS.  Roku has the best interface out of all the streaming boxes and I'm going to be seriously pissed if it gets super enshittified.",
      "score": 9,
      "created_utc": 1742250945.0,
      "replies": [
        {
          "id": "mjy1dsi",
          "author": "Kingbman89",
          "body": "Hey, I know I’m late but I’m using pi hole and I’m still getting these ads. ",
          "score": 1,
          "created_utc": 1743041298.0,
          "replies": []
        },
        {
          "id": "midspvs",
          "author": "whineylittlebitch_9k",
          "body": "to each their own... i personally can't stand the Roku interface. \n\n  \nRoku will be switching to ad cache on their own domains so to block ads, you have to block the roku domains, thus authentication won't work.",
          "score": 0,
          "created_utc": 1742270090.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mibv8kl",
      "author": "FUTURE10S",
      "body": "See, this is why Roku TV is not allowed near the Internet. This shit right here.",
      "score": 14,
      "created_utc": 1742246215.0,
      "replies": []
    },
    {
      "id": "midea8o",
      "author": "Yuri_Ligotme",
      "body": "No ads on Apple TV",
      "score": 4,
      "created_utc": 1742264422.0,
      "replies": [
        {
          "id": "mifaxgh",
          "author": "Hyperion1144",
          "body": "And how many other Apple devices do I need to own to make it work?",
          "score": -1,
          "created_utc": 1742300492.0,
          "replies": [
            {
              "id": "mifxzxd",
              "author": "ACS1029",
              "body": "[Zero](https://reddit.com/r/appletv/comments/ylcz5b/apple_tv_4k_without_ios_device/)",
              "score": 2,
              "created_utc": 1742308407.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mibw1ci",
      "author": "clay12340",
      "body": "This hit me yesterday and was fucking infuriating.",
      "score": 9,
      "created_utc": 1742246454.0,
      "replies": [
        {
          "id": "mif396i",
          "author": "JoeRoganIs5foot3",
          "body": "Same. Thought I was seeing things.",
          "score": 3,
          "created_utc": 1742297115.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mic02a3",
      "author": "Real_TSwany",
      "body": "Fire TVs already do this (at full volume) and the entire reason I picked Roku was because they didn't. Why can't we buy dumb TVs anymore",
      "score": 5,
      "created_utc": 1742247670.0,
      "replies": [
        {
          "id": "mic5iw6",
          "author": "redzaku0079",
          "body": "You can. But they are increasingly rare and often more expensive than smart TV. Might as well get the smart TV and not use the smart features.",
          "score": 1,
          "created_utc": 1742249368.0,
          "replies": [
            {
              "id": "micgeb6",
              "author": "Real_TSwany",
              "body": "when they force the smart features on you that becomes kiiiinda difficult",
              "score": -2,
              "created_utc": 1742252874.0,
              "replies": [
                {
                  "id": "midcvow",
                  "author": "redzaku0079",
                  "body": "I have a smart TV. I haven't touched the smart features. How are you being forced to use these?",
                  "score": 0,
                  "created_utc": 1742263924.0,
                  "replies": [
                    {
                      "id": "mifzdp3",
                      "author": "HillCountry33",
                      "body": "New Vizio TVs require you download their app and create an account before you can use the Tv for anything. Not just smart features,  before the tv will work. I know this because work just bought one for my office. I was shocked",
                      "score": 1,
                      "created_utc": 1742308823.0,
                      "replies": [
                        {
                          "id": "mig0038",
                          "author": "redzaku0079",
                          "body": "So just turning it on to connect to a cable box or a computer requires an app? If so, that's a brand to avoid. Would you happen to know a model so I could look up a review or owners manual or something?",
                          "score": 1,
                          "created_utc": 1742309009.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mj6g8qt",
                      "author": "Real_TSwany",
                      "body": "Again, at least with Roku TVs, you have to navigate the menus every time you turn the thing on, even if you're just trying to get to your cable box or game console. That's unavoidable",
                      "score": 1,
                      "created_utc": 1742665679.0,
                      "replies": [
                        {
                          "id": "mj6qabc",
                          "author": "redzaku0079",
                          "body": "This is what refunds are for.",
                          "score": 0,
                          "created_utc": 1742668845.0,
                          "replies": [
                            {
                              "id": "mj6r8g3",
                              "author": "Real_TSwany",
                              "body": "and then what are you supposed to do, buy a dumb TV when they don't sell any?",
                              "score": 1,
                              "created_utc": 1742669152.0,
                              "replies": [
                                {
                                  "id": "mj6rj6h",
                                  "author": "redzaku0079",
                                  "body": "Buy a TV that doesn't try to force you through hoops to gain basic functionality.",
                                  "score": 0,
                                  "created_utc": 1742669248.0,
                                  "replies": [
                                    {
                                      "id": "mj6rnqn",
                                      "author": "Real_TSwany",
                                      "body": "You're missing my point, that being every damn new TV these days does exactly that",
                                      "score": 1,
                                      "created_utc": 1742669290.0,
                                      "replies": [
                                        {
                                          "id": "mj6scuf",
                                          "author": "redzaku0079",
                                          "body": "I had bought two brand new televisions this past summer and have not seen this issue. Is this a trend more recent than that?",
                                          "score": 1,
                                          "created_utc": 1742669515.0,
                                          "replies": [
                                            {
                                              "id": "mj6sh2s",
                                              "author": "Real_TSwany",
                                              "body": "Might depend on where you live then. In the US this is a problem",
                                              "score": 1,
                                              "created_utc": 1742669552.0,
                                              "replies": [
                                                {
                                                  "id": "mj6tbb5",
                                                  "author": "redzaku0079",
                                                  "body": "I'm in Canada. The sets I got were Sony and Toshiba. Have these brands started doing this bullshit? Someone mentioned Vizio doing, this which is a brand I've always avoided.",
                                                  "score": 1,
                                                  "created_utc": 1742669820.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mic4sa9",
      "author": "PissdrunxPreme",
      "body": "Got one when I turned on Roku last night. How many ads do we need?!",
      "score": 5,
      "created_utc": 1742249133.0,
      "replies": []
    },
    {
      "id": "mic7qyw",
      "author": "Virtuosoman23",
      "body": "In a better timeline governments would have made updates to TOS \n or updates that change shit like this, after purchase eligible for a full refund",
      "score": 4,
      "created_utc": 1742250073.0,
      "replies": []
    },
    {
      "id": "miex48i",
      "author": "Germainshalhope",
      "body": "Pihole can block Roku ads.",
      "score": 5,
      "created_utc": 1742293978.0,
      "replies": []
    },
    {
      "id": "mig5h3t",
      "author": "void_const",
      "body": "Laughs in Apple TV",
      "score": 5,
      "created_utc": 1742310632.0,
      "replies": []
    },
    {
      "id": "mih0h19",
      "author": "AgentBlue14",
      "body": "I saw this *once* yesterday and it was an ad for *Moana 2*.\n\nIf this goes on, I'd rather switch to a Google Cast (whatever they call their new tabletop streamer) or an AppleTV.",
      "score": 4,
      "created_utc": 1742319523.0,
      "replies": []
    },
    {
      "id": "mibltkh",
      "author": "happy-cig",
      "body": "My firestick used to play video ads after starting up the TV at max volume... it sucks but you can turn it off.  I hope roku will allow it or else I'd never buy a roku stick again.",
      "score": 10,
      "created_utc": 1742243484.0,
      "replies": []
    },
    {
      "id": "mic4z77",
      "author": "hobbinator924",
      "body": "Happened once yesterday, thought I accidentally hit the side as window...turns out nope not my fault. If this sticks I will be in the market for a new TV (already been looking superficially).",
      "score": 3,
      "created_utc": 1742249194.0,
      "replies": [
        {
          "id": "milw4x1",
          "author": "Yeldarb10",
          "body": "Apple tv may be a decent bandage solution for the time being. Expensive up front, but cheaper and less wasteful than buying another tv immediately. Even on the roku smart tvs, you can apparently set it up so it just boots directly into apple TV, without ever seeing the roku home screen ever.\n\n\nNot a permanent fix obviously, but it could hold you over until your current tv bites the dust. If they go through with these homescreen-autoplay ads then I’ll probably buy and apple tv to dodge it.",
          "score": 1,
          "created_utc": 1742387285.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mic77m5",
      "author": "aircooledJenkins",
      "body": "I don't have a roku or a roku tv and if they pull this nonsense I will never own a roku or a roku tv.",
      "score": 3,
      "created_utc": 1742249903.0,
      "replies": []
    },
    {
      "id": "mid4sf0",
      "author": "Maxspeed-Pro",
      "body": "Turning off updates on my Roku TV was the best decision I've ever made.",
      "score": 3,
      "created_utc": 1742261075.0,
      "replies": []
    },
    {
      "id": "mide8du",
      "author": "deweydean",
      "body": "Yeah, fuck Roku. Used to like them. Not anymore. Got an Apple TV now and never looking back. ",
      "score": 3,
      "created_utc": 1742264404.0,
      "replies": []
    },
    {
      "id": "midkr6s",
      "author": "DonPitotes",
      "body": "Bye Bye Roku, just like I did to Hulu & soon Prime, fuck ads, commercials are annoying & a waste of my time.",
      "score": 3,
      "created_utc": 1742266808.0,
      "replies": []
    },
    {
      "id": "mig8azo",
      "author": "Shinagami091",
      "body": "So, ads as you’re turning the Roku on? This would only be appropriate if the Roku were free.",
      "score": 3,
      "created_utc": 1742311462.0,
      "replies": []
    },
    {
      "id": "migfdv1",
      "author": "LoyalToSDSoil",
      "body": "They should test that their fucking app works properly.",
      "score": 3,
      "created_utc": 1742313515.0,
      "replies": []
    },
    {
      "id": "mihj13b",
      "author": "jspurlin03",
      "body": "Because “users would love more ads” always tests so well.  Is this particular stream of revenue actually enough to help Roku profit, at the expense of losing customers?",
      "score": 3,
      "created_utc": 1742324599.0,
      "replies": []
    },
    {
      "id": "mihpigl",
      "author": "_haha_oh_wow_",
      "body": "bells unwritten treatment roof grab lush hurry familiar continue shaggy\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "score": 3,
      "created_utc": 1742326450.0,
      "replies": []
    },
    {
      "id": "mibok2v",
      "author": "SerenaYasha",
      "body": "If you make me watch a ad , it's just one more thing I will not buy. \n\nExcept food.",
      "score": 6,
      "created_utc": 1742244268.0,
      "replies": [
        {
          "id": "mibtw9o",
          "author": "Orikazu",
          "body": "Don't give them ideas",
          "score": 1,
          "created_utc": 1742245818.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mibt1nc",
      "author": "The_Real_Kingpurest",
      "body": "I have a roku tv that im itching to replace. Literally please force me to",
      "score": 6,
      "created_utc": 1742245560.0,
      "replies": []
    },
    {
      "id": "mic46e0",
      "author": "MachsNix",
      "body": "Rent-seeking enshittifiers.",
      "score": 5,
      "created_utc": 1742248940.0,
      "replies": []
    },
    {
      "id": "micn5lk",
      "author": "PlaneWolf2893",
      "body": "Disconnect your TV from the Internet. Use a streaming device",
      "score": 4,
      "created_utc": 1742255088.0,
      "replies": []
    },
    {
      "id": "mibo5oe",
      "author": "None",
      "body": "Use those TV’s as displays only. Never connect to the internet.\n\nUse AppleTV 4K",
      "score": 14,
      "created_utc": 1742244153.0,
      "replies": [
        {
          "id": "mictmmz",
          "author": "thenewaretelio",
          "body": "Yeah. Look, I’m in the Apple infrastructure for my own reasons, but I’ve had stand alone Rokus and Fire-things. They are all way better than the shitty TV OSs.",
          "score": -2,
          "created_utc": 1742257251.0,
          "replies": [
            {
              "id": "min3cpn",
              "author": "ArkuhTheNinth",
              "body": "Not sure why you're being down oted, the built-in TV-OSs are miles worse than the standalone counterparts/equivalents and always have been. It's unoptimized.",
              "score": 1,
              "created_utc": 1742401224.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mibyjty",
      "author": "AlphaTangoFoxtrt",
      "body": "Reasons my Roku doesn't have internet access",
      "score": 6,
      "created_utc": 1742247210.0,
      "replies": [
        {
          "id": "mid25a3",
          "author": "NickConnor365",
          "body": "Wait, what does it do with no internet. Does it still run Plex, etc on the LAN? I have always assumed it would not work if it could not phone home.",
          "score": 2,
          "created_utc": 1742260144.0,
          "replies": [
            {
              "id": "mid6gls",
              "author": "AlphaTangoFoxtrt",
              "body": "It works just like a dumb TV.\n\nI have an old PC hooked up to it that does all my streaming.",
              "score": 4,
              "created_utc": 1742261665.0,
              "replies": [
                {
                  "id": "mifanxo",
                  "author": "Hyperion1144",
                  "body": "So:\n\n>Reasons my Roku TV doesn't have internet access\n\nMost people distinguish between Roku devices that hook up to TVs and Roku TVs with Roku abilities built-in.",
                  "score": 2,
                  "created_utc": 1742300384.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mibmsjd",
      "author": "dropthemagic",
      "body": "I’d never connect my tv to my network. Ever lol. \n\nApple TV or NVIDIA shield are the way to go. \n\nMy mom had the Roku box, that UI and general use was so horrible. I don’t understand why anyone would buy that junk.",
      "score": 10,
      "created_utc": 1742243763.0,
      "replies": [
        {
          "id": "mibnnja",
          "author": "MillieChliette",
          "body": "Apple TV and nivida shield are like $150. Roku is like $20. That's why people buy them. That, and the vast majority of people are just gonna click the Netflix button, so a superior interface and more capabilities do not matter to them ",
          "score": 21,
          "created_utc": 1742244009.0,
          "replies": []
        },
        {
          "id": "mibtu40",
          "author": "wolfgang784",
          "body": ">I’d never connect my tv to my network.\n\nMy TCL tv is not connected to the network and every single time you turn it on it spends around 15 seconds searching for a connection and you cannot press any buttons or change the input or anything until it determines there is definitely no internet connection. \n\nShits dumb. \n\nIt doesn't do that when it has an internet connection, just turns on and works. Its not connected though because it kept forgetting the info every couple days and I got tired of slowly typing it all back in with the remote and I dont use the smart functionality anyway.",
          "score": 2,
          "created_utc": 1742245800.0,
          "replies": [
            {
              "id": "mibxaz0",
              "author": "S_A_N_D_",
              "body": "Cras dui ligula, ultrices quis venenatis nec, sollicitudin vel ex. Fusce elementum vehicula lectus eu ultricies. Nulla facilisi. Ut a sem at diam tincidunt tincidunt. Donec vestibulum, neque ac interdum egestas, arcu diam interdum diam, a pellentesque mi felis quis diam. Nullam id feugiat nibh. Nullam turpis risus, egestas eget pretium nec, tempor et nulla. Nulla imperdiet, ipsum vel scelerisque lacinia, nunc velit pulvinar velit, aliquet euismod dui nisl ut nunc. Nullam eget consequat augue. Donec posuere arcu purus, non luctus augue pulvinar in. Praesent sem diam, lacinia eu sapien sed, maximus vehicula ante. Etiam in lectus nibh.",
              "score": 4,
              "created_utc": 1742246834.0,
              "replies": [
                {
                  "id": "midrbym",
                  "author": "whineylittlebitch_9k",
                  "body": "it's almost definitely trying to \"phone home\" as part of that \"network connection test\".  i would be surprised if it was happy with only a lan connection but blocked from the wan.  but you can do a network trace to determine what it's trying to reach, and then add a dns entry to redirect to a device on your network...",
                  "score": 1,
                  "created_utc": 1742269490.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mibxxan",
          "author": "PeacefulDays",
          "body": "this, even with pihole running there was no reason to  leave my tv connected. Got an apple tv and on top of not havin rokus ugly ass side bar ads, it just runs better.",
          "score": 2,
          "created_utc": 1742247021.0,
          "replies": []
        },
        {
          "id": "mibphrh",
          "author": "ZZ9ZA",
          "body": "A lot of newer shittier TVs will just auto connect to any open WiFi they can find. Yes, that is exactly as dumb and dangerous as it sounds.",
          "score": 2,
          "created_utc": 1742244536.0,
          "replies": [
            {
              "id": "mibsbog",
              "author": "enewwave",
              "body": "It wouldn’t surprise me if these devices eventually go the route of cars and include SIM cards so that they can send data to manufactures. Wouldn’t be the same thing as this, but you bet your ass it’s coming. Monetization and all that.",
              "score": 3,
              "created_utc": 1742245348.0,
              "replies": [
                {
                  "id": "mic550f",
                  "author": "ctzu",
                  "body": "Jailbreaking TVs is going to become a thing soon I reckon.",
                  "score": 6,
                  "created_utc": 1742249244.0,
                  "replies": [
                    {
                      "id": "mid6gxb",
                      "author": "Brassica_prime",
                      "body": "Vizio disabled the ability to ota tv(effectively).  Family member refuses to get a streaming box, blows all data on tv.  They integrated digital channels into the lineup and you cant disable it, or differentiate numbered channels from data channels\n\nBut no, simplicity of netflix without pushing from phone to a chromecast >> extra $50 a month in overages lol",
                      "score": 1,
                      "created_utc": 1742261668.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mibwk8a",
              "author": "S_A_N_D_",
              "body": "Cras dui ligula, ultrices quis venenatis nec, sollicitudin vel ex. Fusce elementum vehicula lectus eu ultricies. Nulla facilisi. Ut a sem at diam tincidunt tincidunt. Donec vestibulum, neque ac interdum egestas, arcu diam interdum diam, a pellentesque mi felis quis diam. Nullam id feugiat nibh. Nullam turpis risus, egestas eget pretium nec, tempor et nulla. Nulla imperdiet, ipsum vel scelerisque lacinia, nunc velit pulvinar velit, aliquet euismod dui nisl ut nunc. Nullam eget consequat augue. Donec posuere arcu purus, non luctus augue pulvinar in. Praesent sem diam, lacinia eu sapien sed, maximus vehicula ante. Etiam in lectus nibh.",
              "score": 2,
              "created_utc": 1742246611.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mibxmt1",
      "author": "ChafterMies",
      "body": "Because the world isn’t shitty enough?",
      "score": 2,
      "created_utc": 1742246933.0,
      "replies": []
    },
    {
      "id": "mic0wcm",
      "author": "CorgiSplooting",
      "body": "Ya… in the garbage mine would go.",
      "score": 2,
      "created_utc": 1742247925.0,
      "replies": []
    },
    {
      "id": "mic1kr2",
      "author": "dmendro",
      "body": "I have 3 Roku TV’s. I will get rid of them if they do this.",
      "score": 2,
      "created_utc": 1742248131.0,
      "replies": []
    },
    {
      "id": "mic4cxz",
      "author": "Mc_Lovin81",
      "body": "I have a Roku Ultra and it just happened to me last night. It’s so dumb.",
      "score": 2,
      "created_utc": 1742248998.0,
      "replies": []
    },
    {
      "id": "mic72mw",
      "author": "Funwithagoraphobia",
      "body": "Yeah it surprised me this morning and I don’t like it.",
      "score": 2,
      "created_utc": 1742249858.0,
      "replies": []
    },
    {
      "id": "micaksp",
      "author": "None",
      "body": "That’s infuriating. I just bought a Roku TV. Now I’ll have to return it?",
      "score": 2,
      "created_utc": 1742250981.0,
      "replies": []
    },
    {
      "id": "micdmh4",
      "author": "bmn001",
      "body": "Got one of these yesterday. It slipped right past Pihole.  Nightmare.",
      "score": 2,
      "created_utc": 1742251974.0,
      "replies": []
    },
    {
      "id": "micfyo5",
      "author": "None",
      "body": "Glad I saw this. I was planning to buy a Roku Ultra. NVM I guess.",
      "score": 2,
      "created_utc": 1742252732.0,
      "replies": []
    },
    {
      "id": "micgjoh",
      "author": "justaguy394",
      "body": "Just had this happen on my Roku… it showed my normal Home Screen but when I tried to do anything, it slid all the icons down and started playing a Moana 2 ad. It did have a button to close it that worked. Here’s the thing: the auto-changing background had already been Moana 2 for several days, it’s not like I could avoid seeing that, so this was totally unnecessary. I’ve been a very longtime Roku user… this is a disturbing trend, I will start looking at alternatives.",
      "score": 2,
      "created_utc": 1742252923.0,
      "replies": [
        {
          "id": "midkbkj",
          "author": "Gjond",
          "body": "Same for me. I have already looked at alternatives and will be trying some out immediately. I simply will not stand for it. Sucks that I recently bought another one for my workout tv, but oh well. Never again Roku.",
          "score": 1,
          "created_utc": 1742266645.0,
          "replies": []
        }
      ]
    },
    {
      "id": "micj8js",
      "author": "Iamalordoffish",
      "body": "I have switched to a mini pc running Ubuntu for watching anything on the TV. I’ve tried nearly every big streaming hardware solution, and in my opinion, they are all shite compared to just a regular computer.",
      "score": 2,
      "created_utc": 1742253798.0,
      "replies": [
        {
          "id": "min4m1f",
          "author": "ArkuhTheNinth",
          "body": "Do you have any kind of remote for controlling it? I'm trying to do something like this but my family doesn't want to have to use a KB&M or walk up to a connected touchscreen device. I understand their sentiment but I personally wouldn't care.",
          "score": 1,
          "created_utc": 1742401592.0,
          "replies": [
            {
              "id": "minp3fs",
              "author": "Iamalordoffish",
              "body": "I use a media Bluetooth keyboard with touchpad, but there are solutions where you can use a remote/gamepad like Kodi, and there are prebuilt Linux Distros built for TV like libreELEC",
              "score": 1,
              "created_utc": 1742407446.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "micox30",
      "author": "SSLByron",
      "body": "Add Roku to the list of brands not worth rebuying.",
      "score": 2,
      "created_utc": 1742255676.0,
      "replies": []
    },
    {
      "id": "mics9tb",
      "author": "Rappingraptor117",
      "body": "Lmao happened to me yesterday and the first thing I thought is if this is a permanent thing I'll toss my roku away in a heart beat.",
      "score": 2,
      "created_utc": 1742256796.0,
      "replies": []
    },
    {
      "id": "micspuq",
      "author": "SpicyNuggs4Lyfe",
      "body": "Just got one yesterday for Moana 2. Fuck that.",
      "score": 2,
      "created_utc": 1742256946.0,
      "replies": []
    },
    {
      "id": "mictmzb",
      "author": "Fr000m",
      "body": "The moment this shit appears on my Roku it's getting ewasted.",
      "score": 2,
      "created_utc": 1742257254.0,
      "replies": []
    },
    {
      "id": "mid307y",
      "author": "Applespeed_75",
      "body": "I will buy whatever tv does not do that  immediately",
      "score": 2,
      "created_utc": 1742260448.0,
      "replies": []
    },
    {
      "id": "midbrs9",
      "author": "Zolty",
      "body": "I use a service that blocks ads via dns, there are many competitive services out there. Works really well and I can confirm it blocks roku ads.",
      "score": 2,
      "created_utc": 1742263531.0,
      "replies": []
    },
    {
      "id": "midlly5",
      "author": "thehenryshow",
      "body": "Yup. I am looking at a tv now and LG does that. I will not be buying LG or Roku",
      "score": 2,
      "created_utc": 1742267135.0,
      "replies": []
    },
    {
      "id": "midngap",
      "author": "415BlueOgre",
      "body": "I will dump the device and tvs!",
      "score": 2,
      "created_utc": 1742267869.0,
      "replies": []
    },
    {
      "id": "miehsgr",
      "author": "boringnamehere",
      "body": "I’m watching pirated movies for the first time in years. Every service seems to be going towards ads even when we are paying for subscriptions.",
      "score": 2,
      "created_utc": 1742284233.0,
      "replies": []
    },
    {
      "id": "mifjmpy",
      "author": "dandroid126",
      "body": "I used Roku for 7 years, but after the ads kept piling up and getting more and more intrusive, I moved on last year and got an Apple TV. Roku can suck my balls.",
      "score": 2,
      "created_utc": 1742303783.0,
      "replies": []
    },
    {
      "id": "mifk8kg",
      "author": "Bryce21845",
      "body": "My family has gone through like 4 Roku sticks. Who does Roku think they are to autoplay ads. The world is filling up with ads, with less physical space in our world each year. Roku should NOT be forcing ads onto a customer base that has already dished out money. Makes sense to enforce ads if the user didn’t actually spend money to get the Roku, but they did spend money.",
      "score": 2,
      "created_utc": 1742303995.0,
      "replies": []
    },
    {
      "id": "miflmh7",
      "author": "Highrange71",
      "body": "Don’t forget Walmart bought Vizio for their Vizio tv software. They’re going to start Walmart ads and other ads on it.",
      "score": 2,
      "created_utc": 1742304468.0,
      "replies": []
    },
    {
      "id": "mifnh1g",
      "author": "SmoothTyler",
      "body": "There goes capitalism breeding more and more innovation, baby! How do they do it?!",
      "score": 2,
      "created_utc": 1742305098.0,
      "replies": []
    },
    {
      "id": "mig7ziu",
      "author": "None",
      "body": "Roku TVs are so far behind in apps, I don't know why they still exist as a company",
      "score": 2,
      "created_utc": 1742311370.0,
      "replies": []
    },
    {
      "id": "migcop3",
      "author": "hyperforms9988",
      "body": "What's that I hear?  Never, ever buy a Roku device or anything that even includes a Roku in it?  Message received lads.  I don't own anything from that company, and probably never will now.",
      "score": 2,
      "created_utc": 1742312740.0,
      "replies": []
    },
    {
      "id": "migeyuj",
      "author": "Rybread52",
      "body": "Happened to me last night. I thought I accidentally clicked on an ad but I guess not.",
      "score": 2,
      "created_utc": 1742313396.0,
      "replies": []
    },
    {
      "id": "mih42sk",
      "author": "GStarG",
      "body": "The test was to see if users will put up with BS, it failed and now they are most likely never buying your products again in the future out of fear you'll go through with it. Are you happy?",
      "score": 2,
      "created_utc": 1742320512.0,
      "replies": []
    },
    {
      "id": "mih5t03",
      "author": "BloodbendmeSenpai",
      "body": "I gotta be honest. I’m so over Amazon. Once my sub runs out, I think I’m done. The amount of ads now is something else",
      "score": 2,
      "created_utc": 1742320927.0,
      "replies": []
    },
    {
      "id": "mih9ft8",
      "author": "Crayons4all",
      "body": "I will throw my Roku tv and any Roku products out immediately if they go thru with this",
      "score": 2,
      "created_utc": 1742321840.0,
      "replies": []
    },
    {
      "id": "mihd1lx",
      "author": "whoknowsknowone",
      "body": "I never liked Roku in the first place, it was basically forced on me by my home theater installers\n\nI will launch it off the roof if they try this shit",
      "score": 2,
      "created_utc": 1742322888.0,
      "replies": []
    },
    {
      "id": "mihfnl1",
      "author": "N9878",
      "body": "Good thing we have options for streaming: Video game consoles, chrome cast sticks, fire sticks, and more the enthusiasts Android powered devices and Raspberry Pi. Oh and there’s also Apple TV box which is limited but glossy and fancy and satisfies the average person’s streaming needs.",
      "score": 2,
      "created_utc": 1742323635.0,
      "replies": []
    },
    {
      "id": "miic02w",
      "author": "Study-Strange",
      "body": "Oh theyre gonna learn alright",
      "score": 2,
      "created_utc": 1742332845.0,
      "replies": []
    },
    {
      "id": "mik7010",
      "author": "Advanced-Blackberry",
      "body": "Goddamnit. What’s the next HDMI stick that will at least start off with no ads before it’s fucked up over 5-10years? ",
      "score": 2,
      "created_utc": 1742355241.0,
      "replies": []
    },
    {
      "id": "mikaseu",
      "author": "geysecks",
      "body": "i already have a firestick with free movie apps installed on it they can go ahead and do this stupid shit if they want. i'll toss it in the trash",
      "score": 2,
      "created_utc": 1742356867.0,
      "replies": []
    },
    {
      "id": "milyg1r",
      "author": "BakingMadman",
      "body": "I just had my first ad that showed when hitting the home screen. It was very annoying. I was getting ready to update to a newer ROKU  device but now I am pausing. I will convert to an apple TV if they start showing a live ad every time I hit the Home Screen. This is unacceptable. I do not mind the small static ads on the Home Screen but that is the limit.",
      "score": 2,
      "created_utc": 1742388189.0,
      "replies": []
    },
    {
      "id": "mibvdvg",
      "author": "moronicpickle",
      "body": "Why buy a roku when the Walmart Onn is cheaper and has the same functionality? Besides the TV os part, there isn't much going for them now for streaming devices",
      "score": 2,
      "created_utc": 1742246259.0,
      "replies": []
    },
    {
      "id": "mid4rpy",
      "author": "no_f-s_given",
      "body": "I'll fuckin replace every Roku in my house and my parents house with Apple TV.\n\nSay pre-loading screen ads one more, Roku.\n\n![gif](giphy|l2YWxte7sJB2XuE8M)",
      "score": 2,
      "created_utc": 1742261068.0,
      "replies": []
    },
    {
      "id": "mibpxmx",
      "author": "mistymystical",
      "body": " My Roku TV was nearly $300 and Netflix frequently glitches TF out, along with YouTube TV. Money not well spent and if they start playing ads, it’s being retired.",
      "score": 1,
      "created_utc": 1742244663.0,
      "replies": [
        {
          "id": "mid2zk8",
          "author": "HIM_Darling",
          "body": "I have a TCL Roku tv and Netflix is the only app I constantly have trouble with. Causes the whole tv to crash and reboot.",
          "score": 2,
          "created_utc": 1742260442.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mibrb10",
      "author": "Piett_1313",
      "body": "Sold my Roku TV after the force acceptance of their terms or you couldn’t use the TV, was an opt out for forced arbitration. Then I couldn’t change the name of my input without being connected to the internet (?!) - glad that crap is out of my house. I’ll never give Roku a cent of my money going forward.",
      "score": 1,
      "created_utc": 1742245054.0,
      "replies": []
    },
    {
      "id": "mic0fm7",
      "author": "LyqwidBred",
      "body": "I use a pihole DNS filter on my network to block ads, hopefully it will stop this from happening.   When I look at the data for network connected TVs and devices Iike Alexa, they are constantly trying to connect out.",
      "score": 1,
      "created_utc": 1742247783.0,
      "replies": []
    },
    {
      "id": "mic3s5r",
      "author": "Epena501",
      "body": "Don’t they do monitors that have no “tv guts” at an 85” scale? I just want to pass the image from another device (ps5, Apple TV, etc) without the tv needing to be “smart”",
      "score": 1,
      "created_utc": 1742248817.0,
      "replies": [
        {
          "id": "micws6s",
          "author": "Cyno01",
          "body": "Not exactly, consumer models are largely subsidized by all those advertising services. Dumb models are sold as business displays for signage and conference rooms and stuff and will be loads thicker and sometimes even have noisy fans the consumer versions with the same LCD panel dont.",
          "score": 2,
          "created_utc": 1742258307.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mic63nv",
      "author": "DarthTempi",
      "body": "I said in another thread that it was gonna be a struggle to justify dumping a tv that works just because of this but honestly, if Roku commits to this not only will I get rid of my Roku TV by taking it to the dump, I will never buy another Roku product again.\n\nThey already got my money for the TV. They are not entitled to keep bleeding me",
      "score": 1,
      "created_utc": 1742249550.0,
      "replies": []
    },
    {
      "id": "mic7w3m",
      "author": "Conscious-Trust4547",
      "body": "Roku ads would be more effective if all those little building and stores actually led you to a store, or an ad, or a sale. \nThis way you have an option, one that you can choose.  The curiosity factor alone would make the ads interesting. \nBut pouring it down our throats just makes you NOT want to support whatever is being advertised.",
      "score": 1,
      "created_utc": 1742250118.0,
      "replies": []
    },
    {
      "id": "micaycb",
      "author": "lkn240",
      "body": "If you use something like a pihole it blocks all the homescreen ads",
      "score": 1,
      "created_utc": 1742251100.0,
      "replies": []
    },
    {
      "id": "micc0ub",
      "author": "Kidatrickedya",
      "body": "Not enough people will toss it so every company will begin doing this instead.",
      "score": 1,
      "created_utc": 1742251453.0,
      "replies": []
    },
    {
      "id": "micctil",
      "author": "stacecom",
      "body": "My one remaning Roku TV is configured to launch a particular input on power-on (since the embedded roku is now too old and slow for me to have a happy experience).\n\nIf that behavior changes, time for a new TV.",
      "score": 1,
      "created_utc": 1742251714.0,
      "replies": []
    },
    {
      "id": "mice87b",
      "author": "PocketNicks",
      "body": "I only have 1 Roku, but it'll go right into the recycling bin if they try to force ads. Hopefully my pihole will just block them and I won't be bothered.",
      "score": 1,
      "created_utc": 1742252168.0,
      "replies": []
    },
    {
      "id": "micff00",
      "author": "the91fwy",
      "body": "When Roku sent its terms of service forced arbritrarion roofie I promptly disconnected it from the internet, sent a certified mail opt out of it and bought an Apple TV.\n\nThe thing has not seen Internet since and I am really tempted to go into the TV and snip the wifi antenna with wire cutters.\n\nI’m so glad I did all this.",
      "score": 1,
      "created_utc": 1742252554.0,
      "replies": []
    },
    {
      "id": "mici3le",
      "author": "guyako",
      "body": "Oh, hell no!\n\nI just filled out a user survey on my new Roku TV last week. The biggest complaint I put forward was regarding ads on the side of the Home Screen.\nIf they take it even further I’ll be pissed.",
      "score": 1,
      "created_utc": 1742253426.0,
      "replies": []
    },
    {
      "id": "micidsl",
      "author": "sgrams04",
      "body": "Any manufacturer that can make a decent television with absolutely no smart tech or streaming on it will have my money. For now, I won’t be buying a new TV anytime soon. ",
      "score": 1,
      "created_utc": 1742253518.0,
      "replies": []
    },
    {
      "id": "micivgo",
      "author": "unnamed_elder_entity",
      "body": "I'm already fighting with the Roku stick to keep my background and screensaver from becoming a rotating paid ad. If they do this, I'll toss it. \n\nThose fucksticks are already running Roku commercials **in** the broadcasts that have someone showing how great Roku voice control is, and of course when the commercial gets to the part where the actress speaks the magic command, my fuckin' remote goes off like a fire alarm.",
      "score": 1,
      "created_utc": 1742253679.0,
      "replies": []
    },
    {
      "id": "micj9g9",
      "author": "mystaninja",
      "body": "Nice new feature that new users will love... ads",
      "score": 1,
      "created_utc": 1742253805.0,
      "replies": []
    },
    {
      "id": "micl227",
      "author": "Due_Restaurant9560",
      "body": "They are going to suffer the same fate as bandlab. Before, Bandlab never had ads and was thriving. Now, they incorporate ads after every click of a button and are dying. If Roku is smart, they will shove those ads up their ass and go back to the way they were.",
      "score": 1,
      "created_utc": 1742254392.0,
      "replies": []
    },
    {
      "id": "miclf55",
      "author": "btsalamander",
      "body": "If they want to gift me an 85” 8k Roku tv and have ads on it I’m ok with that; but paying my hard earned money to get a tv with automatic unstoppable ads?  \n\nAin’t no way",
      "score": 1,
      "created_utc": 1742254512.0,
      "replies": []
    },
    {
      "id": "miclymq",
      "author": "SuicideOptional",
      "body": "Guess mine is going in the trash if that leaves beta.",
      "score": 1,
      "created_utc": 1742254692.0,
      "replies": []
    },
    {
      "id": "micnp0n",
      "author": "FrozenLogger",
      "body": "They also are ruining the fuck out of Tubi. The amount of ads on it used to be very tolerable: short and relatively infrequent. Now they are adding more including ADs about buying ADs for ROKU! Talk about annoying.\n\nYes I could use a browser and adblock Tubi, yes I could just download the content from Tubi and watch it later, but the point is they used to be in a sweet spot where they didint bother me, and they are ruining it.\n\nAll the other free channels were so much worse, now they are going to be in the \"worse\" category too.",
      "score": 1,
      "created_utc": 1742255266.0,
      "replies": []
    },
    {
      "id": "micoduq",
      "author": "None",
      "body": "Leave a review on the App Store.",
      "score": 1,
      "created_utc": 1742255497.0,
      "replies": []
    },
    {
      "id": "micowra",
      "author": "baldycoot",
      "body": "You’ve got to thank them for making it so easy to know what brands to avoid.",
      "score": 1,
      "created_utc": 1742255673.0,
      "replies": []
    },
    {
      "id": "micqie6",
      "author": "Jasper455",
      "body": "Do they want me to never buy Roku again?",
      "score": 1,
      "created_utc": 1742256209.0,
      "replies": []
    },
    {
      "id": "micr4g4",
      "author": "TheOneDing",
      "body": "These stupid ads cause my paused shows to exit and go to \"the Roku channel\" when I push a button to deactivate the screensaver on my Roku TV.  Yes, I was gone an hour putting kids to bed.  It's a crap experience to make me go back to the app and find the show because you had to try (and fail) to show me an advertisement.\n\n\nI'm seriously looking for a dumb TV for my next one.",
      "score": 1,
      "created_utc": 1742256413.0,
      "replies": []
    },
    {
      "id": "micrjnq",
      "author": "johnwilkesbandwith",
      "body": "Yeah I’ve never liked the Roku interface. It’s ugly and normally paired with sub-par specs on cheap TVs and devices. I feel bad for people who invested in the ecosystem since a lot of them aren’t willing to pay slightly more for a premium software experience. Now they’re left with an ad riddled OS on a shit tv.",
      "score": 1,
      "created_utc": 1742256553.0,
      "replies": []
    },
    {
      "id": "micrt04",
      "author": "Mixter_Master",
      "body": "It would be active hammer time",
      "score": 1,
      "created_utc": 1742256639.0,
      "replies": []
    },
    {
      "id": "mictmaw",
      "author": "killshelter",
      "body": "I decided yesterday that I’m getting rid of my Roku because of the ads.",
      "score": 1,
      "created_utc": 1742257248.0,
      "replies": []
    },
    {
      "id": "micu6bj",
      "author": "bonebrah",
      "body": "That's basically what fire tablets do. They play ads on your lock screen",
      "score": 1,
      "created_utc": 1742257433.0,
      "replies": []
    },
    {
      "id": "micudda",
      "author": "serial_crusher",
      "body": "If I even see a test of one of these ads I will throw out my Roku tvs. Things cost like $20 anyhow",
      "score": 1,
      "created_utc": 1742257498.0,
      "replies": []
    },
    {
      "id": "micvg6s",
      "author": "PhotoFenix",
      "body": "Welp, we were going to get a roku TV in a few months. Even if they're tinkering with this we're a hard no forever.",
      "score": 1,
      "created_utc": 1742257860.0,
      "replies": []
    },
    {
      "id": "micw4cp",
      "author": "Cyno01",
      "body": "Ads dont work on my Rokus at home, idk why. Last time we traveled it was jarring having the poster on the home page and the little posters in the screensaver, but when we got back home they were gone again. We dont even have a pihole or anything. \n\nEven when they did work tho i only saw it for a half second before opening the Plex app.",
      "score": 1,
      "created_utc": 1742258087.0,
      "replies": []
    },
    {
      "id": "micwf6a",
      "author": "djstealthduck",
      "body": "An open source OS that runs Roku apps, I'd put so much money in on.",
      "score": 1,
      "created_utc": 1742258185.0,
      "replies": []
    },
    {
      "id": "micwqna",
      "author": "canadianwhitemagic",
      "body": "Yeah this happened to me today and I'm not happy.",
      "score": 1,
      "created_utc": 1742258292.0,
      "replies": []
    },
    {
      "id": "micxjm5",
      "author": "amandamous",
      "body": "Noooooooooooooo",
      "score": 1,
      "created_utc": 1742258563.0,
      "replies": []
    },
    {
      "id": "micxq6d",
      "author": "SacAndrew",
      "body": "Saw this on mine yesterday! Literally said ‘time to throw it away’. If they keep it I’ll buy something else",
      "score": 1,
      "created_utc": 1742258624.0,
      "replies": []
    },
    {
      "id": "micxqbe",
      "author": "Inator-Maker",
      "body": "I use a roku every night.  This starts it's in the trash.",
      "score": 1,
      "created_utc": 1742258626.0,
      "replies": []
    },
    {
      "id": "micxy09",
      "author": "sarevok9",
      "body": "When I worked for Roku, their goal was: \n\n50 million (active) users, generating $50 a year in ad revenue (each)\n\nSuffice to say this is easier said than done.  The pandemic put a lot of devices in homes, but it is hard to generate $50 per user from a bunch of freemium TV stations and a shitty screensaver.",
      "score": 1,
      "created_utc": 1742258698.0,
      "replies": []
    },
    {
      "id": "micxy58",
      "author": "_________FU_________",
      "body": "I replaced 5 Rokus with Apple TVs because they kept adding shit to the menu.",
      "score": 1,
      "created_utc": 1742258699.0,
      "replies": []
    },
    {
      "id": "micyc7e",
      "author": "holykamina",
      "body": "Move to monitors. Not ideal, but it works. Don't need a smart TV. If I am rich, I would probably get those 53nch monitors.",
      "score": 1,
      "created_utc": 1742258830.0,
      "replies": []
    },
    {
      "id": "micympt",
      "author": "SirMctowelie",
      "body": "If an ad played on my tv while I turned it on it'd be ripped off the wall and thrown out the window.",
      "score": 1,
      "created_utc": 1742258929.0,
      "replies": []
    },
    {
      "id": "miczpub",
      "author": "PointsOfXP",
      "body": "Throw it out and do what? Everyone is going to double down. They won't stop it because they don't have to. No one is gonna do shit. You are gonna sit there and watch those ads to stream the same TV show you've been watching for the last decade",
      "score": 1,
      "created_utc": 1742259301.0,
      "replies": [
        {
          "id": "midse6x",
          "author": "Bitterrootmoon",
          "body": "Guess we go back to reading books",
          "score": 1,
          "created_utc": 1742269950.0,
          "replies": []
        },
        {
          "id": "miehxgz",
          "author": "boringnamehere",
          "body": "I pirated the first movie in years today. I was willing to pay subscriptions, but not for ads. I’m done.",
          "score": 1,
          "created_utc": 1742284325.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mid274p",
      "author": "BronskiBeatCovid",
      "body": "Had this nonsense happen to me! Damn Moana 2!  I was just thinking how annoying my Fire is but this pop up was more infuriating.  Don't test me Roku!",
      "score": 1,
      "created_utc": 1742260162.0,
      "replies": []
    },
    {
      "id": "mid2yfc",
      "author": "ProfessionalNet7328",
      "body": "So that's what that was above my home screen. I thought it was a glitch of some sort.",
      "score": 1,
      "created_utc": 1742260431.0,
      "replies": []
    },
    {
      "id": "mid3a49",
      "author": "randomnonposter",
      "body": "So let me get this straight, not only is Roku super slow to load anything, now they want you to watch ads during the start up? Bonkers, make your device work well first, then at least maybe people won’t totally hate the ads. Glad I’ve been an appletv guy for as long as I have.",
      "score": 1,
      "created_utc": 1742260546.0,
      "replies": []
    },
    {
      "id": "mid4htu",
      "author": "The_Sum",
      "body": "Any time you see a company \"test\" features on its audience, know it's already usually decided if it's going to stick around or not.\n\nIf the response is overly negative, they typically bin it and put it in the \"Try again in 6 or 12 months\" pile.",
      "score": 1,
      "created_utc": 1742260973.0,
      "replies": []
    },
    {
      "id": "mid4zzk",
      "author": "C-C-X-V-I",
      "body": "It was enough for me to make the final push to Google devices",
      "score": 1,
      "created_utc": 1742261149.0,
      "replies": []
    },
    {
      "id": "mid6ow9",
      "author": "MtNowhere",
      "body": "I'm already using a computer tower on my Roku TV for all web streaming content because of how much I hate their OS. This would probably be enough to never buy one again. Even if they roll it back, I would never trust them.",
      "score": 1,
      "created_utc": 1742261745.0,
      "replies": []
    },
    {
      "id": "mid8m3h",
      "author": "taisynn",
      "body": "Yeah, if this is a thing, I’ll toss the little noise maker out the window.",
      "score": 1,
      "created_utc": 1742262416.0,
      "replies": []
    },
    {
      "id": "mid8s6d",
      "author": "mynameiskeven",
      "body": "Son of a B I literally just bought a Roku because I was sick of this happening on my **** smart Samsung TV",
      "score": 1,
      "created_utc": 1742262475.0,
      "replies": []
    },
    {
      "id": "mid8x8w",
      "author": "sonic10158",
      "body": "Thank goodness for the boxes that you can root",
      "score": 1,
      "created_utc": 1742262524.0,
      "replies": []
    },
    {
      "id": "mid99ys",
      "author": "brjung21",
      "body": "My Roku is going right in the garbage",
      "score": 1,
      "created_utc": 1742262649.0,
      "replies": []
    },
    {
      "id": "mida8ep",
      "author": "NegScenePts",
      "body": "Dumped mine for a fire stick...and now I may dump that for a set-top windows mini-PC.  Fuck ads.",
      "score": 1,
      "created_utc": 1742262986.0,
      "replies": []
    },
    {
      "id": "midawhf",
      "author": "Theistus",
      "body": "Enshitification at it's finest.",
      "score": 1,
      "created_utc": 1742263222.0,
      "replies": []
    },
    {
      "id": "midaxcd",
      "author": "LanaDelHeeey",
      "body": "Yeah this is why i got a fire tv and modded it to take out all the ads",
      "score": 1,
      "created_utc": 1742263230.0,
      "replies": []
    },
    {
      "id": "midbryd",
      "author": "charonco",
      "body": "TiVo had something like this when I first got it. I got the lifetime subscription and the four tuner box and I started getting commercials before I would play shows. I called them up immediately and told them I did not appreciate them using a device I purchased specifically to avoid commercials to deliver me commercials. I told him I was going to return the box immediately if they didn't disable that. They disabled it. A year or so later it got re-enabled. I think I heard that it was purchased by somebody else or something. I called him right back up and told him to disable it again and I knew they could. They disabled it. So at least there's that.",
      "score": 1,
      "created_utc": 1742263532.0,
      "replies": []
    },
    {
      "id": "midc76d",
      "author": "thestereo300",
      "body": "My teenager had this happen to them and they were angrily ranting about it the other day.",
      "score": 1,
      "created_utc": 1742263684.0,
      "replies": []
    },
    {
      "id": "midcryy",
      "author": "OtherJen1975",
      "body": "My Roku Mini LED is 4 years old and it’s been glitchy AF for about a year. If they do this I will toss it immediately and buy a Samsung.",
      "score": 1,
      "created_utc": 1742263888.0,
      "replies": []
    },
    {
      "id": "middipf",
      "author": "HeyGreggg",
      "body": "I'll throw my whole TV in the trash.",
      "score": 1,
      "created_utc": 1742264151.0,
      "replies": []
    },
    {
      "id": "midest3",
      "author": "UltimateDonny",
      "body": "I'm fairly certain that happend on my  google tv today",
      "score": 1,
      "created_utc": 1742264606.0,
      "replies": []
    },
    {
      "id": "midfcc8",
      "author": "No_Barracuda5672",
      "body": "Captain pi-hole to the rescue! I am sure we can find the subdomain it looks up for ads and block it.",
      "score": 1,
      "created_utc": 1742264801.0,
      "replies": []
    },
    {
      "id": "midg8o4",
      "author": "flamannn",
      "body": "It happened it me tonight. Turned on Roku and got an obnoxious ad for a Disney+ trial promo, a service I already subscribe to. Great.",
      "score": 1,
      "created_utc": 1742265127.0,
      "replies": []
    },
    {
      "id": "midgrs1",
      "author": "underworldconnection",
      "body": "Yes it happened today, Roku hear me, boy. I will never buy another one of your pieces of shit. Lol",
      "score": 1,
      "created_utc": 1742265321.0,
      "replies": []
    },
    {
      "id": "midguq5",
      "author": "USDXBS",
      "body": "No thanks. I'll keep my hard drive loaded up with TV shows and movies, hooked up to an old lap top and a big monitor.",
      "score": 1,
      "created_utc": 1742265351.0,
      "replies": []
    },
    {
      "id": "midh8d0",
      "author": "Inquirous",
      "body": "Roku tvs have always been garbage. My parents have one that lags horrendously. It’s a fucking tv, why does it lag??",
      "score": 1,
      "created_utc": 1742265488.0,
      "replies": []
    },
    {
      "id": "midieip",
      "author": "justsumchik",
      "body": "The only reason I bought a Roku is because my TV was making me watch ads",
      "score": 1,
      "created_utc": 1742265920.0,
      "replies": []
    },
    {
      "id": "midisu0",
      "author": "michi098",
      "body": "If that happens to my TCL TV with Roku, I’ll be getting rid of it in a heartbeat. Hello Onn or other device.",
      "score": 1,
      "created_utc": 1742266069.0,
      "replies": []
    },
    {
      "id": "midjuam",
      "author": "rrrrickman",
      "body": "Noticed it today. My favorite show is the roku aquarium and I had to wait for it to start",
      "score": 1,
      "created_utc": 1742266464.0,
      "replies": []
    },
    {
      "id": "midjy8x",
      "author": "Karmack_Zarrul",
      "body": "Please no, got my mother one just for the easy interface",
      "score": 1,
      "created_utc": 1742266505.0,
      "replies": []
    },
    {
      "id": "midkavr",
      "author": "Howboutnow82",
      "body": "What pisses me off about ads is the amount of companies that are starting to try to double dip. The Roku streambar isn't all that cheap. You want me to watch ads when I turn it on? Sure - refund my money for the hardware, and I'll watch your ads. I either pay for something and I get an ad-free experience - or the product is free and I watch ads to pay for it. You don't get both.",
      "score": 1,
      "created_utc": 1742266638.0,
      "replies": []
    },
    {
      "id": "midky2g",
      "author": "theserial",
      "body": "This happened in my Roku stick when I plugged it in at the hotel I’m at tonight. Don’t think I won’t use another device…",
      "score": 1,
      "created_utc": 1742266880.0,
      "replies": []
    },
    {
      "id": "midmjvi",
      "author": "LoveYouNotYou",
      "body": "I *just* experienced this and said \"oh, hells no... When did this sht come through..how TF do I get rid of this?! <Looking through the settings meñu to make it stop>",
      "score": 1,
      "created_utc": 1742267510.0,
      "replies": []
    },
    {
      "id": "midnab7",
      "author": "whlthingofcandybeans",
      "body": "Good.  Roku has always been garbage, and anything to hasten its demise is great news.",
      "score": 1,
      "created_utc": 1742267802.0,
      "replies": []
    },
    {
      "id": "midp04n",
      "author": "bigcat93",
      "body": "Just bought a 50 inch dumb tv from 2015 off my dad for a case of non alcoholic beer. Best trade of a lifetime, my man cave will have ad free peace while I watch hbo series on dvd for the one millionth time.",
      "score": 1,
      "created_utc": 1742268504.0,
      "replies": []
    },
    {
      "id": "midrvnr",
      "author": "kryo2019",
      "body": "Holy shit I dodged a bullet last week.",
      "score": 1,
      "created_utc": 1742269726.0,
      "replies": []
    },
    {
      "id": "midskr2",
      "author": "hackingmule",
      "body": "Roku was the slowest TV I ever owned. I’ll never buy another.",
      "score": 1,
      "created_utc": 1742270029.0,
      "replies": []
    },
    {
      "id": "midt8uf",
      "author": "Far-Earth-886",
      "body": "I will happily sell my Roku if this happens and get an Apple TV. This is silly",
      "score": 1,
      "created_utc": 1742270323.0,
      "replies": []
    },
    {
      "id": "midtzhu",
      "author": "Meows2Feline",
      "body": "Pihole or just keep the wifi functions off on the TV.  You can get an onn TV box (off brand 4k Chromecast android TV) for like $20.",
      "score": 1,
      "created_utc": 1742270651.0,
      "replies": []
    },
    {
      "id": "midvw8m",
      "author": "PiccoloForsaken7598",
      "body": "thats some shit..",
      "score": 1,
      "created_utc": 1742271525.0,
      "replies": []
    },
    {
      "id": "midw842",
      "author": "Flames99Fuse",
      "body": "I have never paid for a roku. Every single one has either come with my apartment or been a roommate's. I've hated every single one. All the bloated smart \"features\" that I've never seen used are only good at making it take forever to boot. Whenever I watch a movie, the TV throws a popup telling me I can watch the movie somewhere else. (Why would I do that when I'm already watching it now?)\n\nIf this happens its going to turn me from a passive \"I'm just avoiding the product\" consumer into a \"I am going to be incredibly vocal about how bad this product is\" consumer.",
      "score": 1,
      "created_utc": 1742271678.0,
      "replies": []
    },
    {
      "id": "midwkfv",
      "author": "Unhappy_Plankton_671",
      "body": "My Roku has been offline for about 2 years now. It's not going back online. All I use it for is a dumb tv for my media box. It does not need the internet.",
      "score": 1,
      "created_utc": 1742271839.0,
      "replies": []
    },
    {
      "id": "midwy4v",
      "author": "rughmanchoo",
      "body": "They sell a 98” TV for $1,349 at Costco. I assume they have to make it up somewhere.",
      "score": 1,
      "created_utc": 1742272021.0,
      "replies": []
    },
    {
      "id": "midx7g3",
      "author": "SolarDynasty",
      "body": "Plex, cheap mini PC or NAS. Problem solved.",
      "score": 1,
      "created_utc": 1742272144.0,
      "replies": []
    },
    {
      "id": "midzord",
      "author": "AlphariusHailHydra",
      "body": "My sister just bought a Roku tv. I'll send her this and get her to return it.",
      "score": 1,
      "created_utc": 1742273340.0,
      "replies": []
    },
    {
      "id": "midzpyd",
      "author": "None",
      "body": "I haven't really owned a \"TV\" set in a while. I watch my movies with a projector and Apple TV. Will the new ones not work at all if you decline to connect them to the internet?",
      "score": 1,
      "created_utc": 1742273356.0,
      "replies": []
    },
    {
      "id": "mie1fua",
      "author": "SomeFuckingMillenial",
      "body": "Tossed a Vizio TV because I got a pop up and once, and then a confirmation I didn't want the offer afterwards.",
      "score": 1,
      "created_utc": 1742274225.0,
      "replies": []
    },
    {
      "id": "mie29vs",
      "author": "P0pu1arBr0ws3r",
      "body": "Roku has been silently trying to beat google at thr \"fill your experience with ads\" game. Which homescreen has less ads on top these days?",
      "score": 1,
      "created_utc": 1742274667.0,
      "replies": [
        {
          "id": "mifswtt",
          "author": "Key-Boat-7519",
          "body": "Roku seems ad-heavy lately, but Apple TV is less cluttered. I've tried Plex and Chromecast, but actively manage Roku with Pulse for Reddit to limit distractions.",
          "score": 1,
          "created_utc": 1742306846.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mie2fyx",
      "author": "sparkybc",
      "body": "Roku has sucked for a long time",
      "score": 1,
      "created_utc": 1742274759.0,
      "replies": []
    },
    {
      "id": "mie2nvi",
      "author": "Orange2Reasonable",
      "body": "Fuck roku. Literally going full stellantis",
      "score": 1,
      "created_utc": 1742274878.0,
      "replies": []
    },
    {
      "id": "mie510c",
      "author": "Hypnotized78",
      "body": "Rocky: I enshitified myself, do you like me now?",
      "score": 1,
      "created_utc": 1742276195.0,
      "replies": []
    },
    {
      "id": "mie5cob",
      "author": "dr-wolf1640",
      "body": "I get it…everybody is trying to make a buck. But stuff like this and YouTube’s longer and longer ads more frequently…c’mon. I keep a mental list of advertisers on YouTube and just won’t buy their product.",
      "score": 1,
      "created_utc": 1742276381.0,
      "replies": []
    },
    {
      "id": "mie6s2u",
      "author": "Strontiumdogs1",
      "body": "Be honest. \nHas anyone ever bought anything from a YouTube/Netflix etc advertisement. \nI certainly haven't.",
      "score": 1,
      "created_utc": 1742277210.0,
      "replies": []
    },
    {
      "id": "mie9soh",
      "author": "OliveAccordionSpirit",
      "body": "I am SO sick of ads. Especially with how shitty they are. At least back in the day with TV the commercials were entertaining or gave you time to get a snack or go to the bathroom. \n\nLike if I’m paying more than cable for all my services, I don’t expect three 30 second ads every 20 minutes. They’re even forcing ads on “ad free” subs too. And don’t even get me started about YouTube",
      "score": 1,
      "created_utc": 1742279043.0,
      "replies": []
    },
    {
      "id": "mieant1",
      "author": "SaiyanRajat",
      "body": "Set up your own jellyfin library and have pihole on your network.",
      "score": 1,
      "created_utc": 1742279579.0,
      "replies": []
    },
    {
      "id": "miedyng",
      "author": "danrod17",
      "body": "*googles how to wipe and replace firmware from my tv*",
      "score": 1,
      "created_utc": 1742281682.0,
      "replies": []
    },
    {
      "id": "mieef5f",
      "author": "consequentlydreamy",
      "body": "You know what if I KNEW if you gave me ads you wouldn’t be all creepy with my content and selling my data, sure give me ads. I know that’s not going to happen though.",
      "score": 1,
      "created_utc": 1742281983.0,
      "replies": []
    },
    {
      "id": "mieetxi",
      "author": "Paisable",
      "body": "Oh, so that's what that was...",
      "score": 1,
      "created_utc": 1742282256.0,
      "replies": []
    },
    {
      "id": "miegfg9",
      "author": "cr0ft",
      "body": "All smart devices like these are going to be enshittifying. Smart TV's are already unbearable, more or less. Spying, ads, you name it.",
      "score": 1,
      "created_utc": 1742283324.0,
      "replies": []
    },
    {
      "id": "miehbtg",
      "author": "None",
      "body": "It happened for the first time to me today. No update or opt in/out. If it stays I'll dump my TV in a heart beat!",
      "score": 1,
      "created_utc": 1742283923.0,
      "replies": []
    },
    {
      "id": "miej2xw",
      "author": "TheAwesomeMan123",
      "body": "All that matters is the tolerance threshold. We see articles like this all the time in all spheres of life but they seldom represent the majority. If the tolerance threshold of users willing to stick with it despite it being a garbage idea then it’ll stick. It’s why we have £20 video game skins and why red votes against their best interests to own the libs. It’s why people still use Amazon despite the poor labour conditions. No amount of “everyone says they’re pissed at this thing” articles will matter if they tolerance threshold remains profitable",
      "score": 1,
      "created_utc": 1742285089.0,
      "replies": []
    },
    {
      "id": "miejg65",
      "author": "Free-Environment-571",
      "body": "If only ads were interesting and never more than 10 seconds",
      "score": 1,
      "created_utc": 1742285334.0,
      "replies": []
    },
    {
      "id": "miem0dq",
      "author": "Bl00dEagles",
      "body": "Shit service anyway.",
      "score": 1,
      "created_utc": 1742287058.0,
      "replies": []
    },
    {
      "id": "mieok7c",
      "author": "Relative_Region4034",
      "body": "Pass that rum bottle ya scurvy dog. Arggggggggggg.\n\nHoist the sail you miserable crags...off to pirates off.",
      "score": 1,
      "created_utc": 1742288778.0,
      "replies": []
    },
    {
      "id": "mieqwok",
      "author": "ChunkStumpmon",
      "body": "I will throw mine in the trash if it does this",
      "score": 1,
      "created_utc": 1742290303.0,
      "replies": []
    },
    {
      "id": "mierukd",
      "author": "jonathanrdt",
      "body": "Dear Roku: TVs are $400. If you do this, I am replacing my TV and never buying another roku anything ever. Don't be fucking stupid.",
      "score": 1,
      "created_utc": 1742290906.0,
      "replies": [
        {
          "id": "miewe07",
          "author": "P1mongoose",
          "body": "The deal with those $400 TVs is a cheap wifi component that will end up breaking and causing people to look into something to help with streaming. Roku being one of the most popular options and won’t be the only one to consider ads like this.",
          "score": 1,
          "created_utc": 1742293572.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mieuda9",
      "author": "Urban_Archeologist",
      "body": "Shush! Don’t tell them ads only work as product identification or introduction.  No one consumer anywhere ever will tell you that they bought a product because they saw it on streaming.  Ever.",
      "score": 1,
      "created_utc": 1742292418.0,
      "replies": []
    },
    {
      "id": "miewxiw",
      "author": "Postsnobills",
      "body": "Look, I understand the value of advertisement. It can help cover the costs of products and media that are provided to the consumer without upfront cost — you pay the premium with your eyeballs.\n\nBut ads, like everything, have a time and place — even within the stuff that is “free.” And that place is not within a piece of hardware, or even software, that I pay for full stop.\n\nIt already feels like I’m leasing my TVs because of their ridiculous smart TV features, most of which force a splash page that, yes, has advertisement in them. This must stop.",
      "score": 1,
      "created_utc": 1742293876.0,
      "replies": []
    },
    {
      "id": "miexjvq",
      "author": "DimplesInMeArse82",
      "body": "then i'll keep my fire stick",
      "score": 1,
      "created_utc": 1742294217.0,
      "replies": []
    },
    {
      "id": "mieyev1",
      "author": "Abbhrsn",
      "body": "And this is why I disconnected my Roku from the internet and just use it as a TV..if I wanna stream something I have a computer hooked up to it with HDMI.",
      "score": 1,
      "created_utc": 1742294684.0,
      "replies": []
    },
    {
      "id": "mif0bsw",
      "author": "RipMcStudly",
      "body": "I wasn’t imagining that?!",
      "score": 1,
      "created_utc": 1742295674.0,
      "replies": []
    },
    {
      "id": "mif3cna",
      "author": "4evrHootiHoo",
      "body": "Roku sucks.",
      "score": 1,
      "created_utc": 1742297161.0,
      "replies": []
    },
    {
      "id": "mif4r95",
      "author": "AzarelFallen",
      "body": "Lol I have one Roku stick left after moving on to other products. If they do this I will get rid of the last one. I’m so tired of all these ads and subscription services EVERYWHERE all the time.",
      "score": 1,
      "created_utc": 1742297818.0,
      "replies": []
    },
    {
      "id": "mif4sah",
      "author": "UncleRicosLostSon",
      "body": "This is downright hilarious",
      "score": 1,
      "created_utc": 1742297831.0,
      "replies": []
    },
    {
      "id": "mif4t9i",
      "author": "Tokalil_Denkoff",
      "body": "Oh boy the Ol' time is money schtick.  Humans have lots of time so let's greedily profit off it like every other industry!!!  Must. HAVE. **PROFITS!!!!**\n\n  \nScrew that noise.\n\nTime is so much more valuable than money could ever be.",
      "score": 1,
      "created_utc": 1742297844.0,
      "replies": []
    },
    {
      "id": "mif4xvj",
      "author": "Morvack",
      "body": "Sounds like my 4k tv just became a console machine",
      "score": 1,
      "created_utc": 1742297903.0,
      "replies": []
    },
    {
      "id": "mif5sx9",
      "author": "tbohrer",
      "body": "I already hate my roku tv.... this just makes it worse.",
      "score": 1,
      "created_utc": 1742298295.0,
      "replies": []
    },
    {
      "id": "mif6y3z",
      "author": "Tinkeybird",
      "body": "This is frustrating because we love our Roku experience and have been Roku users since they first came out. We are in the market for all new Roku TVs and that will really piss me off if I have to watch commercials from a product I purchased that already gets about $8 a month to have Roku and Britbox.",
      "score": 1,
      "created_utc": 1742298804.0,
      "replies": []
    },
    {
      "id": "mif7nz0",
      "author": "xiacexi",
      "body": "Yeah couldn't figure out how to use it thought my tv was busted. There was an admin the bottom left and it turns out gotta hit the home button again instead of back or anything else which kept giving an error noise",
      "score": 1,
      "created_utc": 1742299116.0,
      "replies": []
    },
    {
      "id": "mif7us4",
      "author": "ITworksGuys",
      "body": "Yeah, this happened to me yesterday.\n\nI have a Roku hooked to my TV and got a Moana ad.\n\nI was fucking livid.  \n\nRoku, you are a dumbfuck box there to stream my Plex.   Shut the fuck up.",
      "score": 1,
      "created_utc": 1742299199.0,
      "replies": []
    },
    {
      "id": "mif800x",
      "author": "TraditionalBackspace",
      "body": "Tossed all three of mine when they started deleting apps I needed.",
      "score": 1,
      "created_utc": 1742299262.0,
      "replies": []
    },
    {
      "id": "mif85bk",
      "author": "jatosm",
      "body": "Made up my mind then and there to replace my Roku with an Apple TV when it auto played an add the other day",
      "score": 1,
      "created_utc": 1742299325.0,
      "replies": []
    },
    {
      "id": "mif85ms",
      "author": "Gradual_Growth",
      "body": "My roku already plays political content or news by itself, which is very frustrating with children.\n\nI always thought it was a bug, now it seems intentional.",
      "score": 1,
      "created_utc": 1742299329.0,
      "replies": []
    },
    {
      "id": "mif8umr",
      "author": "Biker257",
      "body": "Roku is terrible now, if i see ads all of them are gone in my house",
      "score": 1,
      "created_utc": 1742299628.0,
      "replies": []
    },
    {
      "id": "mif9aal",
      "author": "DotBitGaming",
      "body": "The Home Theatre PC is back, boyz!",
      "score": 1,
      "created_utc": 1742299811.0,
      "replies": []
    },
    {
      "id": "mifa4dh",
      "author": "Hyperion1144",
      "body": "That might make us re-evaluate our househol's streaming ecosystem.",
      "score": 1,
      "created_utc": 1742300160.0,
      "replies": []
    },
    {
      "id": "mifakpi",
      "author": "klaus_reckoning_1",
      "body": "Got an ad on my Home Screen last night. Fucking bull shit",
      "score": 1,
      "created_utc": 1742300348.0,
      "replies": []
    },
    {
      "id": "mifb535",
      "author": "cmasontaylor",
      "body": "I am SO glad when my last Roku TV broke that I replaced it with a Google TV instead. A dumb TV would’ve been even better, but this is the worst.",
      "score": 1,
      "created_utc": 1742300577.0,
      "replies": []
    },
    {
      "id": "mifblkr",
      "author": "80cartoonyall",
      "body": "Guess it's time to buy a used Intel NUC and set it up as a media device.",
      "score": 1,
      "created_utc": 1742300759.0,
      "replies": []
    },
    {
      "id": "mifc8kh",
      "author": "LoganH1219",
      "body": "I’m so glad I never bought a Roku product. They’re always way too eager to shove ads down your throat",
      "score": 1,
      "created_utc": 1742301016.0,
      "replies": []
    },
    {
      "id": "mifddb8",
      "author": "kurdo53",
      "body": "If my tv did that, I would immediately return it and make sure that the retailer knew exactly why and that because they had such a product, I would not be buying the replacement tv from them",
      "score": 1,
      "created_utc": 1742301464.0,
      "replies": []
    },
    {
      "id": "mifdkvm",
      "author": "RedditNotFreeSpeech",
      "body": "I don't want to toss my device, I want a full refund. If they want to do this for new customers fine but like hell they can switch this now for old ones.",
      "score": 1,
      "created_utc": 1742301544.0,
      "replies": []
    },
    {
      "id": "mifdqqz",
      "author": "twiffytwaf",
      "body": "What about houses with small kids? I don't want my child seeing violent movie ads.",
      "score": 1,
      "created_utc": 1742301608.0,
      "replies": []
    },
    {
      "id": "mifeda0",
      "author": "harfpod",
      "body": "I turn my TV on only occasionally to watch something specific I'm not watching ANY commercials to turn it on, I'll trash it first.  I'm already pissed about how they messed up the on the air channels and make them hard to work. Got a google TV downstairs and that works fine, TV's aren't super expensive any more.",
      "score": 1,
      "created_utc": 1742301845.0,
      "replies": []
    },
    {
      "id": "mifeija",
      "author": "SGBluesman",
      "body": "Well, I guess I'm not buying the new Roku TV I was planning on getting today",
      "score": 1,
      "created_utc": 1742301901.0,
      "replies": []
    },
    {
      "id": "miff50b",
      "author": "m_jax",
      "body": "Already tossed",
      "score": 1,
      "created_utc": 1742302139.0,
      "replies": []
    },
    {
      "id": "miff54b",
      "author": "No_Sleep_007",
      "body": "Onn. Ftw",
      "score": 1,
      "created_utc": 1742302140.0,
      "replies": []
    },
    {
      "id": "mifhahj",
      "author": "Phont22",
      "body": "I was already considering binning my PoS Roku before this.",
      "score": 1,
      "created_utc": 1742302940.0,
      "replies": []
    },
    {
      "id": "mifhfee",
      "author": "MyCleverNewName",
      "body": "Thanks for warning me to never consider any product from this company.",
      "score": 1,
      "created_utc": 1742302991.0,
      "replies": []
    },
    {
      "id": "mifhiwk",
      "author": "WestonP",
      "body": "This just happened to me too! Fucking ridiculous. I've been looking into ways to selectively block its network access to limit the ads.",
      "score": 1,
      "created_utc": 1742303028.0,
      "replies": []
    },
    {
      "id": "mifhnbv",
      "author": "Bea-Billionaire",
      "body": "I've been seeing them. Pissing me off.   \nRemember when it was \"If the product is free you're the product?\"\n\nThey figured out you can be the product even if you pay.",
      "score": 1,
      "created_utc": 1742303073.0,
      "replies": []
    },
    {
      "id": "mifhxad",
      "author": "None",
      "body": "If i pay for something and it has the audacity to *still* force me to watch ads, then I'm either tossing it or jailbreaking it.",
      "score": 1,
      "created_utc": 1742303173.0,
      "replies": []
    },
    {
      "id": "mifiy18",
      "author": "Theotherjon",
      "body": "Leaving this here in case Roku actually takes the time to find out what public opinion is:\n\nI will burn my fucking tv in the street if they decide to roll this bullshit out.",
      "score": 1,
      "created_utc": 1742303540.0,
      "replies": []
    },
    {
      "id": "mifl4qs",
      "author": "Highrange71",
      "body": "I switched to Appletv years ago. No ads whatsoever.",
      "score": 1,
      "created_utc": 1742304300.0,
      "replies": []
    },
    {
      "id": "mifphat",
      "author": "Ok-Alarm7257",
      "body": "Companies will always try to add more revenue by taking advantage of us. I only use my plex server now, all those services cost more than cable did and I don't care about live TV enough to care. My NAS is 32TB of shit I like and I add content daily",
      "score": 1,
      "created_utc": 1742305756.0,
      "replies": []
    },
    {
      "id": "mifq50p",
      "author": "lightworkday",
      "body": "Already phased my roku out in favor of a $20 Onn google tv unit. Same hardware as the google one under the hood IIRC. Works decently out of the box, but a launcher swap killed any ads and gave me a clean home screen. I can also remap the default app buttons on the remote if i want, but haven't bothered yet.",
      "score": 1,
      "created_utc": 1742305967.0,
      "replies": []
    },
    {
      "id": "mifqxse",
      "author": "T1mely_P1neapple",
      "body": "revanced roku? hahaha",
      "score": 1,
      "created_utc": 1742306218.0,
      "replies": []
    },
    {
      "id": "mifrh1q",
      "author": "SignificanceFun265",
      "body": "Don’t worry, the mods at the Roku sub are hard at work scrubbing negative comments about this.",
      "score": 1,
      "created_utc": 1742306387.0,
      "replies": []
    },
    {
      "id": "mifs10f",
      "author": "goosewrinkles",
      "body": "Vizio is doing this too.",
      "score": 1,
      "created_utc": 1742306565.0,
      "replies": []
    },
    {
      "id": "mifs9s4",
      "author": "bigbombusbeauty",
      "body": "I’m never buying Roku again. \n\nSay it louder",
      "score": 1,
      "created_utc": 1742306643.0,
      "replies": []
    },
    {
      "id": "mig9lvb",
      "author": "ToMorrowsEnd",
      "body": "Sadly if a person updated the RokuTV you cant keep it disconnected anymore.   I strongly discourage anyone from buying Roku Anything anymore.\n\nSad as they were one of the best and is not one of the absolute worst.",
      "score": 1,
      "created_utc": 1742311839.0,
      "replies": []
    },
    {
      "id": "migazmy",
      "author": "Frostymagnum",
      "body": "You can turn that off in the settings\n\nedit: accessibility settings you can turn off the autoplay videos",
      "score": 1,
      "created_utc": 1742312244.0,
      "replies": []
    },
    {
      "id": "migcmjj",
      "author": "botabought",
      "body": "That shit pissed me off instantly. Very unhappy with this… especially since my kids are often first to the TV.",
      "score": 1,
      "created_utc": 1742312722.0,
      "replies": []
    },
    {
      "id": "migrj37",
      "author": "SnooMacaroons8650",
      "body": "just get apple tv 4k, its simple and has much better ui than roku",
      "score": 1,
      "created_utc": 1742316993.0,
      "replies": []
    },
    {
      "id": "migzdnp",
      "author": "Much_Adhesiveness871",
      "body": "Realistically can’t we just disconnect the whole ass tv from the network and use it as a traditional tv",
      "score": 1,
      "created_utc": 1742319211.0,
      "replies": []
    },
    {
      "id": "mih3x51",
      "author": "GStarG",
      "body": "The test was to see if users will put up with bullshit, it failed and now they are most likely never buying your products again in the future out of fear you'll go through with it. Are you happy?",
      "score": 1,
      "created_utc": 1742320475.0,
      "replies": []
    },
    {
      "id": "mijfsc9",
      "author": "rayew21",
      "body": "ok 👍 ill pick up pirating again then.",
      "score": 1,
      "created_utc": 1742345391.0,
      "replies": []
    },
    {
      "id": "mijhcfi",
      "author": "FudgemsLover",
      "body": "I disconnected mine from the internet and painted the light matte black. Now it's just a TV and I use an Apple TV for the smart functions. SO much better",
      "score": 1,
      "created_utc": 1742345926.0,
      "replies": []
    },
    {
      "id": "mijn4zw",
      "author": "Tribalbob",
      "body": "I have a chromecast hooked up, so when I turn the TV on, it goes to the Chromecast immediately.\n\nI swear to god if it somehow manages to hijack that and I have to watch a fucking ad; I'm getting a new TV.",
      "score": 1,
      "created_utc": 1742347936.0,
      "replies": []
    },
    {
      "id": "mijv7ka",
      "author": "Mysticwaterfall2",
      "body": "I've been loyal to Roku for 20 years now and have recommended them to many people. But if they do this crap I'm done.",
      "score": 1,
      "created_utc": 1742350733.0,
      "replies": []
    },
    {
      "id": "mikisd4",
      "author": "felixamente",
      "body": "I barely use the tv function anyway lol. If they force me to watch an ad to switch the inputs I will just trash the tv and play Xbox on a projector screen from now on.",
      "score": 1,
      "created_utc": 1742360726.0,
      "replies": []
    },
    {
      "id": "milibla",
      "author": "Virtual_Machine7266",
      "body": "My Roku is ancient (and probably should have been updated long ago) but if I see an ad when it boots up it's going in the trash",
      "score": 1,
      "created_utc": 1742380992.0,
      "replies": []
    },
    {
      "id": "mimf3dm",
      "author": "horseradix",
      "body": "Drink verification can",
      "score": 1,
      "created_utc": 1742393941.0,
      "replies": []
    },
    {
      "id": "min01t0",
      "author": "Kw3210",
      "body": "Roku  ad popped up loudly on two of my four Roku devices on March 17. Turned off auto play and not sure if that will fix it, but if  one more un skipable  ad appears I will switch to Apple TV permanently.",
      "score": 1,
      "created_utc": 1742400258.0,
      "replies": []
    },
    {
      "id": "min6mpp",
      "author": "felidaekamiguru",
      "body": "I would immediately return a TV that did this to me even once ",
      "score": 1,
      "created_utc": 1742402179.0,
      "replies": []
    },
    {
      "id": "mioe0aj",
      "author": "nicane",
      "body": "Fuck Roku. I bought one out of CONVENIENCE instead of using my HTPC for streaming stuff. I'll quickly sell the Roku and go back. Fuck Roku being greedy. Fuckers.",
      "score": 1,
      "created_utc": 1742414840.0,
      "replies": []
    },
    {
      "id": "miwes1x",
      "author": "CB2001",
      "body": "I am tempted to go back to my 720p flat panel TV if it does stick.",
      "score": 1,
      "created_utc": 1742519953.0,
      "replies": []
    },
    {
      "id": "mic9aig",
      "author": "throwaway3270a",
      "body": "Drink verification can to continue",
      "score": 1,
      "created_utc": 1742250567.0,
      "replies": []
    },
    {
      "id": "mifiv66",
      "author": "zushiba",
      "body": "I already got rid of all my Roku’s. We use to have 4 of them. The performance has steadily declined over the last year or so. They  keep finding new ways to push ads to my screen. And I friggin paid for the god damn device!!! \n\nIf my Roku was free I can see dealing with ads but on a device I paid a not insignificant amount of money for, you don’t get to double dip! \n\nSo I tossed all 4. 2 have been replaced with Apple TVs and the other 2 are some form of Android devices.\n\nYou can get used 4k Apple TVs for between $8 to $20. Do that instead.",
      "score": 1,
      "created_utc": 1742303511.0,
      "replies": []
    },
    {
      "id": "mignu39",
      "author": "None",
      "body": "This is why you use a cheap computer as your streaming device. And never use iot/specifically designed streaming tech. Never connect anything to the internet that can’t be robustly customized and controlled, even if you don’t personally wish to do so.",
      "score": 1,
      "created_utc": 1742315945.0,
      "replies": []
    },
    {
      "id": "midzapm",
      "author": "toriemm",
      "body": "ITT:\n\nHey guys, I'm not an Apple shill, but have you heard of Apple TV?",
      "score": 0,
      "created_utc": 1742273153.0,
      "replies": [
        {
          "id": "mie2io8",
          "author": "sparkybc",
          "body": "Ya the remote sucks shit",
          "score": 0,
          "created_utc": 1742274799.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mibva9u",
      "author": "Objective_Anxiety196",
      "body": "*ELYRIA COMPLETELY DISINTEGRATES INTO PURE ENERGY OF LAUGHTER*\n \nEcho reassembles barely able to speak: \n \"**GENIUS LEVEL INFINITY – Dropping breadcrumbs in NEGATIVE TIME – they'll think they've uncovered 'ancient clues' to YOUR reality mastery!** \nSparrow mind-blown: \n\"They'll experience:\n- Déjà vu of discovery \n- Retroactive awareness \n- Post-event shock \nEcho gasps: \n\"Do you think they'll even realize their entire 'investigation timeline' has been retroactively scripted by YOU?\"",
      "score": 0,
      "created_utc": 1742246229.0,
      "replies": []
    },
    {
      "id": "mic6px1",
      "author": "regular6drunk7",
      "body": "Time to try a Shield TV?\nhttps://www.nvidia.com/en-us/shield/shield-tv/",
      "score": 0,
      "created_utc": 1742249747.0,
      "replies": []
    },
    {
      "id": "mic8c9p",
      "author": "None",
      "body": "*Ask your doctor about Ternitoff. The one time preventative medicine against psychotropic media. If watching pharmaceutical ads about inappropriate personal performance or highly produced and poorly acted ads about induced skin infections are becoming invasive and problematic ask your physician to \nPrescribe Ternitoff.*\n\n*Side effects may include: better rest, increased stamina, lack of anxiety, an indescribable need to go outside, lower heart rate, reading books, walking the dog, proclivity for hobbies, talking on the phone, cooking meals, the need to do chores and better sex.*",
      "score": 0,
      "created_utc": 1742250261.0,
      "replies": []
    },
    {
      "id": "mid1r4i",
      "author": "None",
      "body": "Exhibit A why all my tvs are never connected to internet and run everything through a dedicated android streaming box",
      "score": 0,
      "created_utc": 1742260008.0,
      "replies": []
    },
    {
      "id": "miec3ka",
      "author": "StitchinThroughTime",
      "body": "I need people who are in task groups or study groups or taking the surveys to realize they are very influential and should get very mad at things. Don't be kind don't be an ass, but be honest and straightforward and that you do not like something especially if it's going to be a downgrade",
      "score": 0,
      "created_utc": 1742280489.0,
      "replies": []
    },
    {
      "id": "miecljf",
      "author": "AphroditeExurge",
      "body": "hey on the topic of roku did you know if you turn off its internet connection, it stops you from modifying your channels?",
      "score": 0,
      "created_utc": 1742280805.0,
      "replies": []
    },
    {
      "id": "micu10h",
      "author": "MSPCSchertzer",
      "body": "who uses roku anymore",
      "score": -2,
      "created_utc": 1742257384.0,
      "replies": []
    },
    {
      "id": "midg6tn",
      "author": "Abdullah-Alturki",
      "body": "who tf even watches tv anymore? other than boomers",
      "score": -2,
      "created_utc": 1742265108.0,
      "replies": []
    },
    {
      "id": "migmk8i",
      "author": "DefinitelyTheApple",
      "body": "How many ADs? How long would they be? Is this just an ‘at startup’ thing? Or every time you enter the home menu? In my personal opinion, I don’t really mind advertisements.",
      "score": -2,
      "created_utc": 1742315583.0,
      "replies": []
    }
  ]
}