{
  "post": {
    "title": "A bioinspired capsule can pump drugs directly into the walls of the GI tract. The needle-free device could be used to deliver insulin, antibodies, RNA, or other large molecules.",
    "author": "Sariel007",
    "id": "1gwh3lm",
    "score": 572,
    "created_utc": 1732198065.0,
    "selftext": "",
    "num_comments": 21,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gwh3lm/a_bioinspired_capsule_can_pump_drugs_directly/"
  },
  "comments": [
    {
      "id": "ly9jh9e",
      "author": "missprincesscarolyn",
      "body": "There’s absolutely no way monoclonal antibodies can survive the GI tract. Pepsin and chymotrypsin along with bile alone will absolutely destroy them. \n\nSource: am Protein Biologist",
      "score": 37,
      "created_utc": 1732206057.0,
      "replies": [
        {
          "id": "lya1ghl",
          "author": "Gabenism",
          "body": "Also minipumps have been a thing in bio labs forever. With realtime telemetry data paired to them. And humans can fit much bigger ones than mice and rats. Also “bioinspired” as a single word hurts the same part of my brain as “protein interactome” and all the other new “-omes” biologists keep coining",
          "score": 10,
          "created_utc": 1732211460.0,
          "replies": [
            {
              "id": "lya2807",
              "author": "missprincesscarolyn",
              "body": "What’s important is what’s in the mini pump. Mini pump and some injectable insulin is relatively stable at ambient temperatures, although ideally it should be refrigerated. \n\nBigger proteins like antibodies are more finicky. The monoclonal I’m on has to be refrigerated. \n\nProteins are kind of like fussy children at times. Most need very specific conditions to behave properly (pH, salt, temperature). Some are more flexible than others and some will precipitate/aggregate if you look at them the wrong way. Ugh.",
              "score": 2,
              "created_utc": 1732211683.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lydoeco",
          "author": "Trey-Angle",
          "body": "Good info.  Thanks for clarifying that",
          "score": 2,
          "created_utc": 1732258461.0,
          "replies": []
        },
        {
          "id": "ly9nzoc",
          "author": "gracecee",
          "body": "This.",
          "score": 0,
          "created_utc": 1732207456.0,
          "replies": [
            {
              "id": "ly9oocl",
              "author": "missprincesscarolyn",
              "body": "I take one every month (Ofatumumab) so independent of my scientific background, I need it to work every month so that I don’t end up even more disabled than I already am. I get that injections suck, but they’re just a part of taking a certain medication. If anything, I’m glad that you can do it at home. And that for now, I only have to give myself an injection every 30 days. In 6 months or so, I’ll have to do every other day injections of a small peptide (glatiramer acetate) for 9 months. Again, I wouldn’t want that to be destroyed by my digestive system either!",
              "score": 3,
              "created_utc": 1732207662.0,
              "replies": [
                {
                  "id": "ly9xcaz",
                  "author": "seahorse_party",
                  "body": "I just switched to Cosentyx infusions from Rinvoq (oral) for psoriatic arthritis/sppndylitis. This is biologic #9, so I've been on injections of some sort for 12 years (I think?) until switching to Rinvoq last year. We're hoping the infusion delivery method is more effective than both the oral Rinvoq and the sub-q version of Cosentyx, which I've already been on. It's worked the best out of all of the meds, it just wore off too soon; it's newly available as an infusion, so that's why I'm trying it again. \n\nI will gladly drag myself to The Cancer Center every month for an IV if I get my life back. I would do it once a week if I could feel 50% of my pre-illness normal. Whatever works.",
                  "score": 4,
                  "created_utc": 1732210255.0,
                  "replies": [
                    {
                      "id": "lya2hsm",
                      "author": "LeonardoW9",
                      "body": "Yeah, I just moved to Bimzelx and it stings so much more than Taltz. I'm still loading but I'll be glad to be on every other month if everything works.",
                      "score": 2,
                      "created_utc": 1732211763.0,
                      "replies": []
                    },
                    {
                      "id": "lya1fxp",
                      "author": "missprincesscarolyn",
                      "body": "I’m sorry you’re dealing with PA. These autoimmune diseases suck so much. I wouldn’t wish them on my worst enemy.\n\nI have MS. Maybe the infusion version of the antibody I’m on is a better method for controlling my disease activity. Ocrevus can be given as an infusion or now, a 10 minute injection. There’s also Briumvi which again, is the same antibody, but with slight modifications (glycosylation) to prevent it from triggering allergic reactions. Right now, I’m on Kesimpta, the once a month injection. \n\nSo far, the injectable form is…not so effective. At least it wasn’t after my first three loading doses and I ended up in the hospital for a week. My neurologist told me to stay the course and check in at 6 months, which reminds me—I need to schedule my MRI.\n\nI hope you’re having a relatively low symptom day. At least the weekend’s around the corner 💜",
                      "score": 1,
                      "created_utc": 1732211456.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ly9gef4",
      "author": "RetroFutureMan",
      "body": "I’m picturing tiny pill-jets ricocheting around my guts like cartoon bullets",
      "score": 5,
      "created_utc": 1732204996.0,
      "replies": []
    },
    {
      "id": "ly9mgtd",
      "author": "bigbangbilly",
      "body": "One step closer to Star Trek Hypospray",
      "score": 3,
      "created_utc": 1732206987.0,
      "replies": [
        {
          "id": "lya5bgg",
          "author": "HumbertHum",
          "body": "Am I about to blow your mind? https://en.m.wikipedia.org/wiki/Jet_injector",
          "score": 1,
          "created_utc": 1732212597.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lyajfct",
      "author": "GuerrillaRodeo",
      "body": "Just today I saw a patient who complained about the number of tablets she had to take every day (more than 20). I mean, it's relatable, I would probably lose track too, but asking that of an 80-something year old patient? Damn near impossible. In the medical community, it is well known that therapy adherence and the number of medications one has to take are practically [inversely correlated](https://pmc.ncbi.nlm.nih.gov/articles/PMC6919523/).\n\nWe've long diddled with depot medication and the likes, but this might be a game changer - taking your platelet aggregation inhibitors after a myocardial infarction is standard practice, but people ever so often forget about it, especially if there's more medications involved (and with heart attacks, there most definitely are). Plus you don't know if patients are telling the truth about their therapy adherence, who knows if they take their meds 100% of the time or just 60%.\n\nThe diabetes patients with the best HbA1c (long-term blood sugar lab value) I care for are either insanely disciplined or use closed-loop systems (blood sugar sensors that directly communicate with their insulin pumps, effectively emulating the pancreas). This approach has huge potential.",
      "score": 2,
      "created_utc": 1732216820.0,
      "replies": [
        {
          "id": "lyb3i02",
          "author": "missprincesscarolyn",
          "body": "This is definitely true. My mother is 70 and supposed to be taking at least 5 different medications a day. At different points, it was more than that. She’s never taken them as prescribed and has become more and more disabled as a result, particularly with her MS treatments over the years once she finally agreed to start taking them. Combine stubbornness with cognitive decline and you have the perfect recipe for noncompliance and worse outcomes for patients long-term, especially, as you said, the ones who really need those medications in the first place.\n\nUnfortunately, I also have MS and a few other chronic health conditions. I use alarms, reminders, calendars and pill organizers. I take 4 different oral medications, 6 pills a day and then the monthly injection. Technology can make it easier but only if the patient is committed to it.\n\nThank you for what you do. I’m tremendously appreciative for all of the doctors who have helped me. It’s clear you care about your patients.",
          "score": 2,
          "created_utc": 1732222929.0,
          "replies": [
            {
              "id": "lydljas",
              "author": "GuerrillaRodeo",
              "body": "Thank you! All the best to you and your mom too.",
              "score": 2,
              "created_utc": 1732256825.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lyamf6f",
      "author": "GoMinii",
      "body": "Health insurance companies will be like, “pain free pill not covered, bring out the needles.”",
      "score": 2,
      "created_utc": 1732217710.0,
      "replies": []
    },
    {
      "id": "ly9wda6",
      "author": "TheTompten",
      "body": "Keep an eye on this. I’ve been diabetic since childhood and every couple of years a projected advancement like this is brought up in tech or medical magazines. It never makes it to market and is usually bought by a large company and hidden away. \n\nIt’s always better for business when you have to buy more products at regular intervals than a one time solution or cure.",
      "score": 4,
      "created_utc": 1732209963.0,
      "replies": []
    },
    {
      "id": "ly9o0ta",
      "author": "None",
      "body": "Interesting. Going needle free would be a godsend.",
      "score": 1,
      "created_utc": 1732207466.0,
      "replies": []
    },
    {
      "id": "lya9ml4",
      "author": "Marv-elous",
      "body": "You had me at drugs",
      "score": 1,
      "created_utc": 1732213888.0,
      "replies": []
    },
    {
      "id": "ly9rnpg",
      "author": "dexterthekilla",
      "body": "This robotic drug capsule can help docs see hard-to-reach areas in the GI tract",
      "score": 1,
      "created_utc": 1732208561.0,
      "replies": [
        {
          "id": "lya2i8j",
          "author": "missprincesscarolyn",
          "body": "Nah, getting scoped is the best way to go. I’ve had too many endoscopies to count at this point and have a colonoscopy coming up soon. Capsules can be good for other stuff though, like pH monitoring for GERD. I highly recommend it.",
          "score": 1,
          "created_utc": 1732211767.0,
          "replies": []
        }
      ]
    }
  ]
}