{
  "post": {
    "title": "An update on highly anticipated—and elusive—Micro LED displays. New (and cheaper) Micro LED TVs have been announced.",
    "author": "Sariel007",
    "id": "1iq2eu6",
    "score": 1367,
    "created_utc": 1739629485.0,
    "selftext": "",
    "num_comments": 175,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1iq2eu6/an_update_on_highly_anticipatedand_elusivemicro/"
  },
  "comments": [
    {
      "id": "mcwsiu4",
      "author": "the_blake_abides",
      "body": "Too expensive now, but this is some pretty amazing tech. Seamless expandable main panels and removable mini-panels -- impressive.",
      "score": 270,
      "created_utc": 1739632261.0,
      "replies": [
        {
          "id": "mcx8l81",
          "author": "Weird_Cantaloupe2757",
          "body": "The price has come *way* down, hopefully it continues that trend, and they don’t run into some insurmountable obstacle to making them more inexpensively at scale.",
          "score": 91,
          "created_utc": 1739637344.0,
          "replies": [
            {
              "id": "mcycwwq",
              "author": "DarkerSavant",
              "body": "Economy of scale will kick in with continued adoption. Just like 4k panels have which were initially egregiously overpriced.",
              "score": 33,
              "created_utc": 1739649583.0,
              "replies": [
                {
                  "id": "mczsq1g",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -37,
                  "created_utc": 1739666245.0,
                  "replies": [
                    {
                      "id": "mczvuti",
                      "author": "BigHandLittleSlap",
                      "body": "4K absolutely did not exist in the mid-90s. The very first colour 4K monitor was introduced in 2001 and was only 41 Hz. These things were only ever used for special purposes such as viewing medical images, CAD, and the like. They weren't practical for gaming since no 3D accelerators existed that supported them.\n\n4K as we know it wasn't really a \"thing\" until 2007 when the first standards started to appear, but it was mostly just tech-demos, not commercial availability. Movies weren't made or broadcast in 4K until 2011. The first *consumer* true 4K monitors weren't available until mid 2013.\n\nJohn Carmack was pretty famous for using very-high-end gear such as big monitors and expensive workstations, but these were 1080p only, not 4K. E.g.: https://www.reddit.com/r/gaming/comments/kmkdg/john_carmack_coded_quake_on_a_28inch_169_1080p/",
                      "score": 44,
                      "created_utc": 1739667311.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "md44i50",
              "author": "Educational_Lie_3157",
              "body": "Like tariffs?",
              "score": 0,
              "created_utc": 1739731182.0,
              "replies": [
                {
                  "id": "n5hwgz1",
                  "author": "Ok-Block-6344",
                  "body": "What?",
                  "score": 1,
                  "created_utc": 1753649424.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mcy3av0",
          "author": "None",
          "body": "The real question is how do they handle burn in? Every display that I am aware of where each individual pixel is a set of some type of emitter has had burn in issues. It’s always come down to the pixels dimming at different rates depending on usage since the back light doesn’t really exist and instead is each pixel.",
          "score": 20,
          "created_utc": 1739646639.0,
          "replies": [
            {
              "id": "mcy8esy",
              "author": "bfilippe",
              "body": "A theater in Culver City, California has Samsung Onyx MicroLED movie screens. Burn in is possible but they don't need a brightness limiter like OLED since there is no organic matter that can be denatured. They're brighter and more resistant--no downsides aside from cost for now",
              "score": 43,
              "created_utc": 1739648200.0,
              "replies": [
                {
                  "id": "mcyo6hs",
                  "author": "camatthew88",
                  "body": "That's really cool. Cannot wait for it to revolutionize monotors",
                  "score": 2,
                  "created_utc": 1739653053.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "md1ob5m",
              "author": "Onsotumenh",
              "body": "It's not only OLED every LCD display can develop uniformity and image retention issues. It's not only the emitting side that can cause these problems. People seem to forget that.\n\n\nToday OLEDs have come so far that the wear on cheaper LCDs is often worse than on cheaper OLEDs.\n\n\n\nEdit: For example just look at the rting burn in test. They also tested LCD displays and the results are not flattering for them.\nhttps://www.rtings.com/tv/learn/longevity-results-after-10-months",
              "score": 7,
              "created_utc": 1739696070.0,
              "replies": []
            },
            {
              "id": "mcza8xu",
              "author": "droppinkn0wledge",
              "body": "The risk of burn in for modern OLED panels is almost nonexistent. It’s wild to me that people continue to pearl clutch about this. \n\nI have 2k hours of the same MMO on the same OLED panel with zero burn in. This is a problem that simply doesn’t happen to people who practice the most basic level of OLED care.",
              "score": 4,
              "created_utc": 1739660004.0,
              "replies": [
                {
                  "id": "mczdqcm",
                  "author": "Zer0C00l",
                  "body": "> people who practice the most basic level of OLED care.\n\nHow does one practice OLED care?",
                  "score": 11,
                  "created_utc": 1739661158.0,
                  "replies": [
                    {
                      "id": "mczl9a5",
                      "author": "ElectricTrees29",
                      "body": "Most OLEDs have a “cleaning pixel” routine every couple weeks.  I would also imagine not having a static background, just like with plasmas, would apply.",
                      "score": 11,
                      "created_utc": 1739663715.0,
                      "replies": []
                    },
                    {
                      "id": "mczfa2r",
                      "author": "he-tried-his-best",
                      "body": "Turn the prevent burn in function on.",
                      "score": 10,
                      "created_utc": 1739661682.0,
                      "replies": [
                        {
                          "id": "md0fhe5",
                          "author": "Zer0C00l",
                          "body": "wait, is this serious. why would it not be always on? what's the trade-off?",
                          "score": 1,
                          "created_utc": 1739674339.0,
                          "replies": [
                            {
                              "id": "md0hlvz",
                              "author": "EijiShinjo",
                              "body": "Some people \"unplug\" their TV set after watching it which prevents the pixel refresh from running 🤣",
                              "score": 6,
                              "created_utc": 1739675129.0,
                              "replies": [
                                {
                                  "id": "md17zw4",
                                  "author": "TrptJim",
                                  "body": "That's the \"short\" maintenance refresh. On my LG CX it is set to run automatically after 4 hours of continuous use, but only when the display is next shut off. If you keep the screen on it will never refresh until the \"long\" maintenance popup after 2,000 hours.\n\nWhen I first got the CX I kept it on for a week until noticing the screen retention being obvious. Now I just turn it off every day after around 12-18h of use - no image retention at the end of the day even though that should technically have had 3-4 short refreshes instead of just the 1.",
                                  "score": 1,
                                  "created_utc": 1739686582.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mczv8ff",
                      "author": "hellomistershifty",
                      "body": "To me, the two most basic things are to use a black desktop background and set your taskbar to auto-hide. \n\nI have a 55\" LG CX so the monitor is big enough that I pretty much just randomly place windows and rarely fullscreen things. I got a Best Buy warranty that covers burn-in, so I even turned off the auto 'logo dimming' feature. Despite 16.5k hours of usage, there is no noticeable burn-in.",
                      "score": 7,
                      "created_utc": 1739667100.0,
                      "replies": [
                        {
                          "id": "mpr69g1",
                          "author": "Comprehensive_Rise32",
                          "body": "I also set SDR content brightness to the lowest.",
                          "score": 1,
                          "created_utc": 1745971527.0,
                          "replies": []
                        },
                        {
                          "id": "md1izlt",
                          "author": "Hetstaine",
                          "body": "People who don't auto hide their taskbar by default are going to hell.",
                          "score": -13,
                          "created_utc": 1739692857.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mczw8zg",
                  "author": "BrunoEye",
                  "body": "Taskbar, window borders, common UI elements and frequent use of side by side windows are enough to lead to noticeable burn in.\n\nFor now I'm happy enough with my 4K 144Hz fast VA panel that only cost me £325. Maybe in a couple more years prices will finally be low enough.",
                  "score": 8,
                  "created_utc": 1739667445.0,
                  "replies": [
                    {
                      "id": "md0drrp",
                      "author": "TrptJim",
                      "body": "There's really two things here that are being combined into one.\n\nIf a display is designed with good wear leveling, burn in should not be an issue. Temporary retention is possible between maintenance periods, but is usually not an issue unless you keep the display on and/or skip screen refreshes.\n\nWhat you will definitely get over time, though, is a gradual dimming if your display as the wear leveling brings your max brightness down to the dimmest pixels.\n\nThat said, I have put my OLED through hell and there is no noticeable burn-in. [22065 hours](https://i.imgur.com/0w3fGwL.jpeg)  powered on over 52 months, used mainly as a PC monitor for work but also for PC/PS5 gaming and media consumption. I would think that my case is at least a decent worst case scenario even as a single data point.",
                      "score": 7,
                      "created_utc": 1739673684.0,
                      "replies": [
                        {
                          "id": "md20hpw",
                          "author": "BrunoEye",
                          "body": "Monitors Unboxed are doing a long term real world burn in test, and have shown noticeable but not distracting levels of burn in after 6 months. https://youtu.be/Pi37daETnf0?si=1ZwYqd3_1LZJikgl\n\nInterestingly it seems to not have gotten much worse at 9 months, but I'd still be a little worried about what it'll look like after 2-3 years.",
                          "score": 7,
                          "created_utc": 1739703576.0,
                          "replies": []
                        },
                        {
                          "id": "md1e354",
                          "author": "AgreeableTurtle69",
                          "body": "How do you know all this? Do you work in tech? Good post, man.",
                          "score": 1,
                          "created_utc": 1739689959.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "md32wsa",
                      "author": "thedoc90",
                      "body": "I went with a mini-led and tbh it looks good enough to where I can't really complain, like hald the price of an oled too.",
                      "score": 2,
                      "created_utc": 1739720204.0,
                      "replies": []
                    },
                    {
                      "id": "mlb50vu",
                      "author": "Da_Spooky_Ghost",
                      "body": "I've used a 15\" OLED laptop for 10+ hours a day for 5 years with none of those functions and I don't have burn in. Most of it was for work and the taskbar never burned in.",
                      "score": 1,
                      "created_utc": 1743733294.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "md1y3n8",
              "author": "doctorcapslock",
              "body": "regular LEDs also wear out over time and become less bright",
              "score": 1,
              "created_utc": 1739702110.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mcy16av",
          "author": "TrptJim",
          "body": "I don't see consumer models having the modular panels for most sizes. A single panel would weigh less and avoid module alignment and seam visibility concerns.",
          "score": 13,
          "created_utc": 1739645993.0,
          "replies": [
            {
              "id": "mcyae21",
              "author": "JoeyBigtimes",
              "body": "Nah. Those are both easily solvable problems. Just design issues. I wouldn’t assume the consumer version of this tech would be exactly the same as the pro version.",
              "score": 2,
              "created_utc": 1739648804.0,
              "replies": [
                {
                  "id": "mcytby4",
                  "author": "TrptJim",
                  "body": "The tolerances you are dealing with to align things pixel perfect are pretty small, and become increasingly smaller with larger sizes and more panels. Would be a nightmare to ship as a whole unit while staying aligned, and could require professional installation if packed as separate modules.\n\nIt's not to say I don't welcome such a possibility. It would be pretty cool to decouple dpi from screen size and just go as large as the display controller can handle. \n\nI just don't see it being the \"normal\" thing sold to the mass market, and hence won't sell in the numbers to be affordable/successful.",
                  "score": 4,
                  "created_utc": 1739654651.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mcxp2it",
          "author": "None",
          "body": "$8000 for a 75 inch top of the line tv is incredibly reasonable. What are you talking about?\n\n$49,900 for a 162 inch screen? That literally was $500,000 a couple years ago.",
          "score": -27,
          "created_utc": 1739642353.0,
          "replies": [
            {
              "id": "mcxpb3s",
              "author": "guareber",
              "body": "Lol no. It's definitely nowhere near \"incredibly reasonable\"",
              "score": 21,
              "created_utc": 1739642424.0,
              "replies": [
                {
                  "id": "mcxqoh7",
                  "author": "flowersweep",
                  "body": "Not that long ago 98\" tvs were tens of thousands of dollars. Now you can get one for a couple grand.\n\nIt's one thing that has definitely gotten much cheaper over the years.",
                  "score": 8,
                  "created_utc": 1739642832.0,
                  "replies": [
                    {
                      "id": "mcy46tu",
                      "author": "CallousChris",
                      "body": "I remember when my parents bought a 60” Sony flatscreen LCD TV, this was brand new and tube TVs and large screens projector TVs were still very popular. I think they spent around $8,000 on it back then, 2-3 years later I got an LED one for $2,000. A few years later they were under 1k for larger sizes. This will likely be the case for these and the OLEDs that are currently top of the line.",
                      "score": 1,
                      "created_utc": 1739646909.0,
                      "replies": [
                        {
                          "id": "mdamew3",
                          "author": "flowersweep",
                          "body": "It's really incredible. Projectors have advanced a lot but not nearly as quickly as TVs have.",
                          "score": 1,
                          "created_utc": 1739818844.0,
                          "replies": []
                        },
                        {
                          "id": "n2mznot",
                          "author": "Maximum_Pace885",
                          "body": "It'll be at least another 10 years before premium OLEDs are truly affordable for everyone",
                          "score": 1,
                          "created_utc": 1752275881.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mcxq01p",
                  "author": "TheOGRedline",
                  "body": "I would have gone with “outrageously expensive”. Even if that’s what it costs to produce it, who cares? It’s not worth that much compared to other tech.",
                  "score": 6,
                  "created_utc": 1739642629.0,
                  "replies": []
                },
                {
                  "id": "mcxprv1",
                  "author": "None",
                  "body": "What are you basing that on? LG sells an oled 77 inch for $60,000 right now. $8k for a micro led is incredible",
                  "score": -3,
                  "created_utc": 1739642562.0,
                  "replies": [
                    {
                      "id": "mcxvq3l",
                      "author": "guareber",
                      "body": "Because that's not a consumer top of the line product. It's an experiment.",
                      "score": 4,
                      "created_utc": 1739644352.0,
                      "replies": [
                        {
                          "id": "mcxw7v4",
                          "author": "None",
                          "body": "What are you referring too? LGs signature line is the definition of consumer top of the line.",
                          "score": -1,
                          "created_utc": 1739644501.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mcxrzn6",
                      "author": "samarnold030603",
                      "body": "I get into these same types of arguments with my 85 yo dad who doesn’t understand why a “prototype” is 10-100x more expensive than its technologically mature, mass-produced equivalent 🤷‍♂️",
                      "score": 4,
                      "created_utc": 1739643224.0,
                      "replies": [
                        {
                          "id": "mcxvxqy",
                          "author": "None",
                          "body": "The wall was mass produced and sold everywhere. https://www.samsung.com/us/business/displays/direct-view-led/ia-series/the-wall-all-in-one-110-p1-2-lh012iabmhs-go/\n\nAnd that’s 1080p",
                          "score": 1,
                          "created_utc": 1739644416.0,
                          "replies": [
                            {
                              "id": "mcxzcx6",
                              "author": "csoups",
                              "body": "You’re linking to something they market as a commercial product. No one is buying that for their home.",
                              "score": 2,
                              "created_utc": 1739645443.0,
                              "replies": [
                                {
                                  "id": "mcy030l",
                                  "author": "None",
                                  "body": "AUO is commercial displays as well…",
                                  "score": 1,
                                  "created_utc": 1739645665.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mczomyn",
                      "author": "MJOLNIRdragoon",
                      "body": "They also sell one for $2,200.",
                      "score": 1,
                      "created_utc": 1739664863.0,
                      "replies": [
                        {
                          "id": "mczs8yj",
                          "author": "None",
                          "body": "That’s not nearly as good. You can get a tv for $100 too",
                          "score": -2,
                          "created_utc": 1739666088.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mcxqc34",
              "author": "Narrow-Chef-4341",
              "body": "Reasonable? Sure.\n\nExpensive?  To a lot of people… Yeah, when you can walk out of Walmart or Costco with a 75 inch TV for $500.\n\nThat ***Seven Thousand Dollar*** difference is a lot of utility bills, a lot of dentist visits, a lot of car repairs, a lot of diapers, or replacing many broken phone screens.\n\nCongratulations on not realizing how lucky you are.",
              "score": 14,
              "created_utc": 1739642729.0,
              "replies": [
                {
                  "id": "mcxvn1f",
                  "author": "None",
                  "body": "That $500 tv is manufactured ewaste imo",
                  "score": -4,
                  "created_utc": 1739644327.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mcyoeyt",
              "author": "pokey_porcupine",
              "body": "Agree with you; this is actually considerably less than (pr at least on-par with) every large sized TV (large for the era) of new technology especially when adjusted for inflation",
              "score": 3,
              "created_utc": 1739653126.0,
              "replies": []
            },
            {
              "id": "mcy2nrs",
              "author": "boykinsir",
              "body": "Reasonable for a multimillionaire or a 'pro' gamer who has all their income from streams.",
              "score": 0,
              "created_utc": 1739646445.0,
              "replies": [
                {
                  "id": "mcy559x",
                  "author": "None",
                  "body": "$8k is a very normal price for a good tv",
                  "score": -4,
                  "created_utc": 1739647204.0,
                  "replies": [
                    {
                      "id": "mczq55n",
                      "author": "MJOLNIRdragoon",
                      "body": "From a quick browse of Samsung, Sony, and LGs websites, the most expensive 77\" I saw (aside from that one $60k transparent tv) was $5k. Not sure how you figure $8k is \"very normal\"",
                      "score": 1,
                      "created_utc": 1739665377.0,
                      "replies": [
                        {
                          "id": "mczsnlb",
                          "author": "None",
                          "body": "You don’t think $8k is comparable to $5k? This would have been $60,000 for the 77” micro led two years ago",
                          "score": 1,
                          "created_utc": 1739666223.0,
                          "replies": [
                            {
                              "id": "mczvlsx",
                              "author": "MJOLNIRdragoon",
                              "body": "It's over 50% more. So no....",
                              "score": 2,
                              "created_utc": 1739667227.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mcwwfxm",
      "author": "Spanky2k",
      "body": "We’re slowly getting there but it’s going to be another few years yet. Maybe 5 years? I can’t wait for a 65” microled 4k tv that has the image quality of OLED and the room appeal of an always on Samsung Frame. Once something like that hits ~5k, it’d be an instant buy for me.",
      "score": 65,
      "created_utc": 1739633536.0,
      "replies": [
        {
          "id": "mcxiqzl",
          "author": "DigitallyDetained",
          "body": "Yeah I’m still planning to get an OLED this year. Micro LED can be the next one down the road.",
          "score": 20,
          "created_utc": 1739640459.0,
          "replies": [
            {
              "id": "md26b3j",
              "author": "flux_capacitor3",
              "body": "OLED is the best picture i have ever owned. 77\" G series LG.",
              "score": 6,
              "created_utc": 1739707033.0,
              "replies": [
                {
                  "id": "n1nm6f8",
                  "author": "raikou1988",
                  "body": "Is the G series worth the money over the C series?",
                  "score": 1,
                  "created_utc": 1751818531.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "md1h53j",
          "author": "johnny_fives_555",
          "body": ">hits ~5k, it’d be an instant buy\n\nOnly for it to be ~2k after a couple of years lol",
          "score": 9,
          "created_utc": 1739691750.0,
          "replies": []
        },
        {
          "id": "md9h6uh",
          "author": "Northern-Canadian",
          "body": "Honest question. What’s the point? How does this improve life?\nIs current standards glaringly terrible but I just don’t see it?",
          "score": 1,
          "created_utc": 1739807176.0,
          "replies": [
            {
              "id": "md9tzhh",
              "author": "Spanky2k",
              "body": "How does any new tv tech ‘improve life’? It’s just nicer. It’s the stuff that people like to spend disposable income on. OLED looks incredible but it can’t be left on with a static image all the time. The Samsung Frame lets a tv blend into a room’s environment so that you don’t have an ugly black void on the wall. I want to have both. MicroLED will bring that. That’s why I want it. I currently have both an LG OLED and two Samsung Frames.",
              "score": 3,
              "created_utc": 1739810989.0,
              "replies": [
                {
                  "id": "mdbap5h",
                  "author": "Eve_newbie",
                  "body": "I was ready to come to your defense, it's so weird people care what you spend your money on.",
                  "score": 2,
                  "created_utc": 1739825597.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mcwre5k",
      "author": "Knownzero",
      "body": "Now if only all major broadcasters would finally upgrade their equipment to native 4K. It’s been what, 20 years now and we’re still stuck with shitty picture quality from the big 4? Gotta go to Amazon for a 4K NFL game or an extra $9.95/mo for like 2 shows a week on YouTubeTV? Gtfo.",
      "score": 203,
      "created_utc": 1739631881.0,
      "replies": [
        {
          "id": "mcx5xuh",
          "author": "itsaride",
          "body": "It's not just broadcast equipment I dare say American TV companies are mostly 4K capable, it's the bandwidth used by it, one 4K channel = 3 or 4 HD shopping channels and you don't want to lose those!",
          "score": 70,
          "created_utc": 1739636527.0,
          "replies": [
            {
              "id": "mcxbyiq",
              "author": "TeutonJon78",
              "body": "It also doesn't help that ATSC 3.0 stalled out due to greed of the broadcasters going for licensing fees and DRM. They shouldn't be allowed to DRM public airways.\n\nEdit: LG never implemented ATSC 3.0, just like Samsung won't implement Dolby Vision over fees. And Samsung had 2-3 generations with ATSC 3.0 and pulled it from all but the top end of their 2025 line.",
              "score": 36,
              "created_utc": 1739638387.0,
              "replies": [
                {
                  "id": "mcy8k9o",
                  "author": "kurotech",
                  "body": "Especially when they are taking public funds to \"improve\" their infrastructure and then 15 years later just say sorry money ran out before we started",
                  "score": 15,
                  "created_utc": 1739648245.0,
                  "replies": []
                },
                {
                  "id": "md0pgx3",
                  "author": "None",
                  "body": "All that tells me is that instead of licensing they need to pull an AMD and make open standards. For instance, HDMI is a cancer and should be replaced with DisplayPort.",
                  "score": 2,
                  "created_utc": 1739678146.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mcyoxs7",
              "author": "None",
              "body": "4K would be equivalent to of the bandwidth of 4 FHD (1080P) and 16 HD (720P) devices.",
              "score": 6,
              "created_utc": 1739653287.0,
              "replies": []
            },
            {
              "id": "mu1hgxl",
              "author": "CautiousHashtag",
              "body": "Don’t bail them out like that, it’s definitely the equipment as well. Companies like ESPN have been the same shitty 720p for 15 years now. They do maybe 4 games a year in 4K but they’re too cheap to invest in that equipment for more. There’s 0 reason the CFP shouldn’t have all been in 4K.",
              "score": 1,
              "created_utc": 1748108135.0,
              "replies": []
            },
            {
              "id": "myc2nmt",
              "author": "NBA2024",
              "body": "you do considering the viewership that the NFL brings in versus basically any other programming",
              "score": 1,
              "created_utc": 1750194573.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mcy8n15",
          "author": "username_taken55",
          "body": "1440p even would be a big improvement and a fair compromise on bitrate for the bean counters",
          "score": 21,
          "created_utc": 1739648269.0,
          "replies": [
            {
              "id": "mczwjaa",
              "author": "BrunoEye",
              "body": "1440p TVs are much .are rare than 4k, so it wouldn't make much sense.",
              "score": 1,
              "created_utc": 1739667544.0,
              "replies": [
                {
                  "id": "md02gjr",
                  "author": "username_taken55",
                  "body": "Upscaling",
                  "score": 5,
                  "created_utc": 1739669602.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mcxvj2o",
          "author": "PNWNative3000",
          "body": "This this THIS, yes please! On our 65” OLED the difference between watching Amazon NFL vs one of the ‘others’ isn’t subtle at all, it’s a huge improvement.",
          "score": 8,
          "created_utc": 1739644295.0,
          "replies": []
        },
        {
          "id": "mcy0hot",
          "author": "thedeadfish",
          "body": "What is the point of 4k when bit rates are too low to even max out 1080?",
          "score": 12,
          "created_utc": 1739645787.0,
          "replies": [
            {
              "id": "mczx1d7",
              "author": "BrunoEye",
              "body": "Due to how video compression works, static elements will be sharper. So things like the HUD during sports or just the backgrounds in static camera shots.",
              "score": 5,
              "created_utc": 1739667719.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mczvga4",
          "author": "None",
          "body": "1080p with high bitrate over 4k low bitrate.",
          "score": 3,
          "created_utc": 1739667175.0,
          "replies": []
        },
        {
          "id": "md0cuhw",
          "author": "IAMA_Lucario_AMA",
          "body": "And then when you pay for the 4k streaming, it’s full of compression artifacts and color banding. Amazon’s 4k streaming is usually between 10-16mbps - closer to the bitrate of a 480p dvd (~5-7mbps) than a 1080p bluray (~35-45mbps)",
          "score": 5,
          "created_utc": 1739673336.0,
          "replies": [
            {
              "id": "md1iwyd",
              "author": "im_thatoneguy",
              "body": "You have to take codes into account though. DVD was MPEG-2. Amazon is probably h.265.  On an apples to apples quality basis 1-2mbps h.265 probably matches MPEG-2. And Blu-ray was h.264 so once again 15mbps h265 is in line with 30mbps Blu-ray.",
              "score": 5,
              "created_utc": 1739692813.0,
              "replies": [
                {
                  "id": "md3c18l",
                  "author": "IAMA_Lucario_AMA",
                  "body": "very true and very good point, can’t believe i forgot to account for that - thanks !\n\nthat still leaves amazon’s 4k streams at sub-1080p quality on average which, while nowhere near as bad as i made it out to be, is still pretty unacceptable IMO, especially in visually busy content like Flow which genuinely looks worse on amazon streaming than some 720p remuxes",
                  "score": 6,
                  "created_utc": 1739722997.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mcx5uga",
          "author": "sykoman21",
          "body": "Most people don’t care and why spend money when it doesn’t net you anything. They’ll replace equipment when it’s EOL",
          "score": 6,
          "created_utc": 1739636497.0,
          "replies": [
            {
              "id": "mcx8rpa",
              "author": "Knownzero",
              "body": "The equipment has been EOL a half dozen times between the first 4K broadcast I saw on a 4K tv and now. Lol",
              "score": 17,
              "created_utc": 1739637407.0,
              "replies": [
                {
                  "id": "mcy43oz",
                  "author": "lonestar659",
                  "body": "I assume they mean when the thing dies. Not a manufacturer’s planned EOL",
                  "score": 4,
                  "created_utc": 1739646883.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mcz9zyz",
          "author": "nightfly1000000",
          "body": "So annoying. We all splashed out and bought the TVs.",
          "score": 2,
          "created_utc": 1739659922.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcz50cz",
      "author": "chronocapybara",
      "body": "This article is completely written by AI, it's garbage, and it tells us nothing new.",
      "score": 19,
      "created_utc": 1739658318.0,
      "replies": []
    },
    {
      "id": "mcx8nmo",
      "author": "Competitive-Cuddling",
      "body": "All the talk in here… like TVs won’t cost as much as a luxury car after Trump.",
      "score": 49,
      "created_utc": 1739637364.0,
      "replies": [
        {
          "id": "mcxrl6c",
          "author": "None",
          "body": "[removed]",
          "score": -51,
          "created_utc": 1739643104.0,
          "replies": [
            {
              "id": "mcxuea6",
              "author": "Competitive-Cuddling",
              "body": "Oh sorry. Please… recommence with fantasizing.",
              "score": 21,
              "created_utc": 1739643953.0,
              "replies": [
                {
                  "id": "mcxwj49",
                  "author": "None",
                  "body": "[removed]",
                  "score": -36,
                  "created_utc": 1739644595.0,
                  "replies": [
                    {
                      "id": "mczo1r0",
                      "author": "C-C-X-V-I",
                      "body": "We do not want to hear your Trump fantasies, thank you.",
                      "score": 4,
                      "created_utc": 1739664660.0,
                      "replies": []
                    },
                    {
                      "id": "mcxzn67",
                      "author": "csoups",
                      "body": "They’re making an exaggerated inference based on tariffs he’s announced. It’s not going to be as much as a car but surely you’re not deluded enough to think they won’t go up in price?",
                      "score": 22,
                      "created_utc": 1739645530.0,
                      "replies": [
                        {
                          "id": "mcy1vhj",
                          "author": "Jackal239",
                          "body": "The moment Trump wasn't worshipped as a god he turned his brain off.",
                          "score": 19,
                          "created_utc": 1739646207.0,
                          "replies": []
                        },
                        {
                          "id": "mcy2tj7",
                          "author": "None",
                          "body": "[removed]",
                          "score": -24,
                          "created_utc": 1739646495.0,
                          "replies": [
                            {
                              "id": "mcy4dej",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 17,
                              "created_utc": 1739646966.0,
                              "replies": [
                                {
                                  "id": "mcy57ai",
                                  "author": "None",
                                  "body": "[removed]",
                                  "score": -1,
                                  "created_utc": 1739647220.0,
                                  "replies": [
                                    {
                                      "id": "mcyfwpo",
                                      "author": "TheGreatBenjie",
                                      "body": "Trump's tarriffs WILL make tech more expensive, your inability to understand that is nobody else's problem but your own.",
                                      "score": 17,
                                      "created_utc": 1739650502.0,
                                      "replies": [
                                        {
                                          "id": "mcygwqo",
                                          "author": "None",
                                          "body": "[removed]",
                                          "score": -3,
                                          "created_utc": 1739650810.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "mcyomh6",
                                      "author": "csoups",
                                      "body": "I didn’t call you delusional lol. I said if you held that position you would be delusional. For someone so adamant that everyone else lacks reading comprehension you’re surely lacking in similar ways",
                                      "score": 10,
                                      "created_utc": 1739653190.0,
                                      "replies": [
                                        {
                                          "id": "mcyutru",
                                          "author": "None",
                                          "body": "[deleted]",
                                          "score": 2,
                                          "created_utc": 1739655116.0,
                                          "replies": [
                                            {
                                              "id": "mcyvodx",
                                              "author": "ILoveTheAtomicBomb",
                                              "body": "> I have enough reading comprehension \n\nSomehow I doubt that, but go off",
                                              "score": 8,
                                              "created_utc": 1739655381.0,
                                              "replies": []
                                            },
                                            {
                                              "id": "mcywk6l",
                                              "author": "csoups",
                                              "body": "Ok",
                                              "score": 6,
                                              "created_utc": 1739655657.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mcx9pu2",
      "author": "Ok-Criticism6874",
      "body": "I'm just going to wait for macro LED",
      "score": 17,
      "created_utc": 1739637703.0,
      "replies": [
        {
          "id": "mcxc01b",
          "author": "GBJI",
          "body": "It's been there for a long time by now - at least 1997, with U2 Pop Mart tour.\n\n[https://www.saco.com/u2-pop-mart-tour/](https://www.saco.com/u2-pop-mart-tour/)",
          "score": 14,
          "created_utc": 1739638400.0,
          "replies": [
            {
              "id": "mcxcfhk",
              "author": "Ok-Criticism6874",
              "body": "I meant mini macro LED",
              "score": -10,
              "created_utc": 1739638530.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mcxu3u1",
          "author": "wildyam",
          "body": "So, like one massive pixel, flashing on and off?",
          "score": 7,
          "created_utc": 1739643867.0,
          "replies": [
            {
              "id": "mcy3oyf",
              "author": "Ok-Criticism6874",
              "body": "![gif](giphy|3o7abKhOpu0NwenH3O)",
              "score": -3,
              "created_utc": 1739646758.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mq57juv",
      "author": "PauseMedical7825",
      "body": "I want to see macro led tv’a hit. Just one big ass pixel",
      "score": 2,
      "created_utc": 1746160256.0,
      "replies": []
    },
    {
      "id": "mcy2iqm",
      "author": "Fredasa",
      "body": "What's funny is that I think I have reached 95% of the way to \"all I want\" on the TV scale already.  There are only two things that bug me a bit with my QD-OLED.\n\nBurn in?  Honestly that concern has proven very manageable.  Like, I wouldn't pay more than 10% more cost to dispense with my lingering burn-in concerns.\n\nI do think QD-OLED's response time spectrum needs work.  During a slow pan (especially in anime), high brightness/contrast areas scroll with a visible stutter compared to low brightness/contrast areas because the pixels are taking longer to reach their new targets in those areas.\n\nI am _not_ convinced that MicroLED is burn-in proof.  I'll _be_ convinced after they've been in at least 10,000 hands for a year.\n\nAnd I sure as heck don't know if MicroLED fares any better in pixel responsiveness.  It could be worse.  We don't know.",
      "score": 3,
      "created_utc": 1739646402.0,
      "replies": [
        {
          "id": "mcy9kjh",
          "author": "Xesyliad",
          "body": "MicroLED burn in? Uhhh… okay, I mean ordinary LED tech has proven it doesn’t suffer burn in, and OLED has burn in because of the organic component. Tell me why exactly you would think MicroLED would have burnin? I mean, that’s one of its core traits (it doesn’t suffer burn in like OLED). MicroLED solves all the problems of OLED (burn in, responsiveness, etc).",
          "score": 12,
          "created_utc": 1739648552.0,
          "replies": [
            {
              "id": "mczwzcd",
              "author": "aitorbk",
              "body": "Leds lose lumen output with ours of operation.  This is how it is.\nTherefore, microleds will have burn in.  Any technology that has single pixels/subpixels that lose luminance with use will suffer from burn in.\nCRTs had id, plasma had it, oled had it, and MicroLed will have it.\nMicroleds are supposed to last more hours than oleds, so we should expect less burn in, proportional to the effective hours of operation... Simplyfing the problem.\n\nMicroleds are amazing.  The response time Is effectively instant if they don't use phosphors.\n\nI want my next computer screen to be MicroLed.",
              "score": 3,
              "created_utc": 1739667699.0,
              "replies": []
            },
            {
              "id": "mcyctvl",
              "author": "Fredasa",
              "body": "> I mean ordinary LED tech has proven it doesn’t suffer burn in\n\nHow so?  There aren't any TVs in the normal consumer market that use **LEDs as pixels**.  You seem to have a misunderstanding of the tech.\n\n> Tell me why exactly you would think MicroLED would have burnin?\n\nBecause\n\n* I have a LCD TV from 2010 that developed burn-in.  It took a while, about 4 years under PC conditions, but it happened.  The risk with LCD is low but it isn't zero.  What this _does_ mean is that when people say \"it can't burn in\", this is potentially fudging reality.  And that means claims about MicroLED aren't worth much.\n\n* Whatever testing they've conducted to reach a level of confidence about burn-in _has not been proven by hardware in consumers' hands for an extended period of time._\n\n* The only display technologies ever created which are truly immune to burn in are all **non self-emissive**.  Even CRTs develop \"phosphor burn-in.\"",
              "score": 3,
              "created_utc": 1739649557.0,
              "replies": [
                {
                  "id": "mcyrknr",
                  "author": "_RADIANTSUN_",
                  "body": "What I would like is microLED for 1:1backlight array while using a regular LCD for display pixels.",
                  "score": 1,
                  "created_utc": 1739654108.0,
                  "replies": [
                    {
                      "id": "mczxevf",
                      "author": "aitorbk",
                      "body": "Why?  If you have that backlight, you might as well triple the leds and don't use filters.  You are dividing the required light by three, making the panel thinner and the electronics simpler.  Also, the lcd panels are quite slow and have angle issues.",
                      "score": 2,
                      "created_utc": 1739667849.0,
                      "replies": [
                        {
                          "id": "md0yruj",
                          "author": "_RADIANTSUN_",
                          "body": "I imagine a single large microLED can be brighter and last longer than the comparable RGB subpixels, as is the case with LEDs at any size. So you can simply get the same level of pixel perfect brightness control as an OLED with a regular LCD display matrix, probably much greater brightness and contrast than any other technology with per pixel dimming.",
                          "score": 1,
                          "created_utc": 1739682068.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mczyb61",
                  "author": "NSMike",
                  "body": "While I understand your points, I honestly can't think of a circumstance under which the technology of an LED would even be susceptible to burn-in.",
                  "score": -1,
                  "created_utc": 1739668163.0,
                  "replies": [
                    {
                      "id": "md01l9j",
                      "author": "Fredasa",
                      "body": "Google LED aging and/or the L70 standard.\n\nLEDs will probably take twice as long to exhibit problems as an OLED display, but they may experience color shift long before that.",
                      "score": 2,
                      "created_utc": 1739669304.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mcyqwzm",
                  "author": "Xesyliad",
                  "body": "Okay, you do you. You’re going all comic book guy on a mature technology (not cheap) with recognised benefits.",
                  "score": -6,
                  "created_utc": 1739653904.0,
                  "replies": [
                    {
                      "id": "mcyxknz",
                      "author": "Fredasa",
                      "body": "You asked a question, my dude.  Is that really ample reason to go all ad hominem?\n\nIf MicroLED very quickly reaches OLED's price levels then I will be pleasantly surprised.  Keyword: surprised.  The problem it faces is that it isn't solving any major flaws, or bringing any meaningful benefits, that actually matter to 99% of consumers, so adoption is going to depend almost entirely on whether it can outdo existing tech in price.  Even I, as a consumer aware of what they're buying, wouldn't spend a great deal more on MicroLED than QD-OLED if I had both in front of me.",
                      "score": 3,
                      "created_utc": 1739655975.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mczmph3",
          "author": "CosmosExplorerR35",
          "body": "Honestly one thing I think microLED will solve that I see QD-OLED struggle with is brightness. I have an Alienware AW3225QF QD-OLED and when it’s displaying a pretty bright picture, for example my desktop, a bright scene in a game or movie, I notice it doesnt seem as bright as my old LCD monitor. So that’s one reason I would choose microLED over QD-OLED.\n\nJust a note: I’m not speaking about peak brightness when the monitor can reach like 1200 lumens of brightness because 90% of the screen is dark/black. I’m talking when it’s displaying bright colors/whiteness in more than 70% of the screen and it doesn’t get as bright as LCD.",
          "score": 3,
          "created_utc": 1739664206.0,
          "replies": [
            {
              "id": "mczpdab",
              "author": "Fredasa",
              "body": "To convince consumers, they'll have to set things up in a very particular way.  For starters, it won't really work in a \"Magnolia\" style dark room.  All you'll be showing off is that there's such a thing as too many lumens.  So it'll need to be an A/B comparison, specifically between OLED and MicroLED, in a brightly lit area.\n\nThey'll probably want to pass on comparing it to QD-OLED since it's the brightest OLED tech there is right now.  So that means LG.\n\nAnd the video footage itself will need to be essentially only daytime outdoors shots.  Anything high contrast would give the OLED display a chance as it would suffer less from its dependency on brightness windows.\n\nBut I feel like by the time MicroLED starts reaching a consumer-friendly price range, OLED tech will have drastically addressed its own lumens issues, making the fight that much tougher.\n\nFurthermore, MicroLED displays _do_ generate heat, and it's an easy guess that while it won't necessarily be as constrained as OLED, displays will be designed to keep overall brightness on a curve, just like OLED displays.",
              "score": 1,
              "created_utc": 1739665117.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mcztyay",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1739666662.0,
          "replies": [
            {
              "id": "md1k176",
              "author": "Slidje",
              "body": "[This Samsung Odyssey Neo Quantum Mini LED G85NB](https://www.amazon.co.uk/dp/B0BS1MPTB7) is what I`m using. In extremely darks scenes I get a bit of blooming but I've found a good balance and it looks amazing. Not as good as OLED but my AW3420DW had burnin after 6 months, and Dell kept sending me refurbs that also had burn in. I gave up and got a refund, but that took 4 months for Dell to sort out. Never again.",
              "score": 1,
              "created_utc": 1739693471.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "md0o9ui",
      "author": "ulyssesfiuza",
      "body": "I remember when a analyst said inthe 90s and show how digital displays will **NEVER**  replace cathodic tubes.",
      "score": 2,
      "created_utc": 1739677670.0,
      "replies": []
    },
    {
      "id": "mcxy44w",
      "author": "AlphaZanic",
      "body": "The Awall website is advertising a contrast for 1:12000 contrast ratio. That seems underwhelming For a $8000-10000 tv, you could buy 5-6 LG C4’s and just keep them in storage until the working one gives out. \n\nAre these micro led TVs not capable of quality individual pixel dimming or just outright turning them off?",
      "score": 1,
      "created_utc": 1739645069.0,
      "replies": [
        {
          "id": "myd7jga",
          "author": "Livid-Protection2058",
          "body": "People have called it the native contrast, though I don't fully understand it. They can also achieve infinite contrast like OLED by turning off pixels.",
          "score": 2,
          "created_utc": 1750207874.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcwlaii",
      "author": "None",
      "body": "It amazes me people still want the next tv innovation. By the time 4k arrived, as long as the sound and picture quality don’t degrade then upgrading seems pointless. It’s not like the jump from crt to flat screen anymore. It’s just another very similar tv. \n\nIf you’re not playing blu ray or gaming, then the higher pixel rating of your tv is irrelevant when you’re just streaming Netflix and your internet kinda sucks. \n\nTv manufacturers should be demanding better internet speeds across the world. Otherwise my 10 year old 4k that doesn’t have pop-up ads or invasive software is good enough.",
      "score": -22,
      "created_utc": 1739629756.0,
      "replies": [
        {
          "id": "mcwmjz6",
          "author": "Sariel007",
          "body": "> that doesn’t have pop-up ads or invasive software is good enough.\n\nI'd buy that.",
          "score": 30,
          "created_utc": 1739630208.0,
          "replies": [
            {
              "id": "mcwsrd6",
              "author": "AFoxGuy",
              "body": "Apple TV4K + TV.",
              "score": 12,
              "created_utc": 1739632342.0,
              "replies": [
                {
                  "id": "mcx870c",
                  "author": "dsmiles",
                  "body": "I've never been the biggest Apple fan, but I've been pushed more and more in that direction over recent years as every other tech product I own has been flooded with ads.\n\nI run a dns ad blocker as well as ad blockers on my clients, but even my (samsung) phone has ads baked in (although I'm pretty sure that's google's doing). It's gotten absolutely ridiculous.",
                  "score": 8,
                  "created_utc": 1739637225.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mcwnvkx",
          "author": "MultiMarcus",
          "body": "I think you might be missing something here.  TV manufacturers are well aware of that situation which is why they are aggressively pursuing ways to make low quality streamed content look better on their TVs. From on device AI upscaling to better colours and lighting. That is why OLED is a fairly large TV quality leap over LCD panels. Unfortunately OLED has its own set of issues from bad light levels to inevitable burn in. Micro-LED is hopefully able to do all that an OLED can while being immune to burn in and very bright.",
          "score": 16,
          "created_utc": 1739630674.0,
          "replies": [
            {
              "id": "mcwpfvq",
              "author": "Ser_Danksalot",
              "body": "I for one would be highly reluctant to buy an OLED panel TV because of the risk of burn in even if that risk is small.  Had 2 phones with slight OLED burn in now so that was enough to put me off.   I wouldn't have an issue buying a micro LED panel TV however.",
              "score": 2,
              "created_utc": 1739631215.0,
              "replies": [
                {
                  "id": "mcws3p4",
                  "author": "ZestycloseUnit7482",
                  "body": "I have a s95b and a b2. Both I crank up to 100. No burn in at about 3 years",
                  "score": 5,
                  "created_utc": 1739632119.0,
                  "replies": []
                },
                {
                  "id": "mcwsjyy",
                  "author": "NotBannedAccount419",
                  "body": "Pretty sure all Samsung and Apple phones have been oled for many years now and none have burn in. My oled gaming monitor has zero burn in as well",
                  "score": 6,
                  "created_utc": 1739632273.0,
                  "replies": [
                    {
                      "id": "mcxffjf",
                      "author": "Znuffie",
                      "body": "With normal use, no burn in.\n\n...but I know someone who always manages to burn in their keyboard on their phone.\n\nIt amazes me how she can do this with all new phones, in 2 years or less.",
                      "score": 3,
                      "created_utc": 1739639454.0,
                      "replies": [
                        {
                          "id": "mczmg34",
                          "author": "fullmetaljackass",
                          "body": "It's probably because they crank the brightness up to max and leave it there.",
                          "score": 1,
                          "created_utc": 1739664121.0,
                          "replies": [
                            {
                              "id": "md02d6b",
                              "author": "Znuffie",
                              "body": "Yeah, plus long timer for the screen to turn off. Probably falls asleep with the keyboard on... who knows.",
                              "score": 1,
                              "created_utc": 1739669569.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mcwy59x",
                  "author": "Spanky2k",
                  "body": "I’ve been using an LG C2 42” OLED TV as my main computer monitor for two years now. I use it all day for work and several hours at night for gaming. Most of that gaming is WoW which has static action bars. I have zero burn in. I do a few things to lower the chances of burn in; for work I use a Mac and I have the dock and menu bar set to auto hide and I rotate between backgrounds every ten minutes or something. I also don’t maximise anything full screen (I always like to use floating windows on MacOS especially on a high res monitor). I really thought I’d get some burn in by now so had assumed I’d only keep the tv for a couple of years but it’s still perfect. My point is that with minor precautions, OLED burn in really isn’t a big deal. The automatic dimming protections when static stuff is on screen does its job if you ever bugger up and leave something on it.",
                  "score": 3,
                  "created_utc": 1739634074.0,
                  "replies": []
                },
                {
                  "id": "mcwpv51",
                  "author": "azure_apoptosis",
                  "body": "Had one for about 5 years now, zero signs of wear and tear. Best picture I’ve ever had (CX model)",
                  "score": 5,
                  "created_utc": 1739631362.0,
                  "replies": [
                    {
                      "id": "mcwtjx7",
                      "author": "Xe6s2",
                      "body": "Some people have good luck some have bad luck I swear. Ive been blessed enough to have my machines always work to the bone.",
                      "score": 0,
                      "created_utc": 1739632607.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mcwzk2j",
                  "author": "okmarshall",
                  "body": "I'm 7 years in, TV is on between 5 and 12 hours a day depending on my family schedule, not a single issue.",
                  "score": 2,
                  "created_utc": 1739634527.0,
                  "replies": []
                },
                {
                  "id": "mcwr0ih",
                  "author": "Atomic0691",
                  "body": "Same. My kids might turn on the TV, watch for a while and walk away. I don’t need the YouTube pause screen stuff burned in forever. For work, all the programs I use have static menus that would all but guarantee burn in since they’re on the screen for the entire work day.",
                  "score": 1,
                  "created_utc": 1739631753.0,
                  "replies": [
                    {
                      "id": "mcwrh51",
                      "author": "caller-number-four",
                      "body": "> For work, all the programs I use have static menus that would all but guarantee burn in since they’re on the screen for the entire work day.\n\nSince 2020, I've been using OLED and it's been fine.  But I turn the display down.\n\nOnly issue I had was one morning my C9 had a rash of dead pixels.  The new C3 has been great.",
                      "score": 2,
                      "created_utc": 1739631909.0,
                      "replies": [
                        {
                          "id": "mcx9sms",
                          "author": "Atomic0691",
                          "body": "Good to know, thanks!",
                          "score": 1,
                          "created_utc": 1739637726.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mczeymo",
                  "author": "achibeerguy",
                  "body": "Had a Panasonic Viera plasma TV for 12 years with no burn in, had an LG C2 OLED for 3 with no burn in. The only burn in I have ever had was an older Samsung Galaxy phone which I had Waze on for 2-3 hours a day 5 days a week for the better part of a year. But if you prefer a much worse picture to avoid worrying about something that has negligible risk of happening I guess that's a choice.",
                  "score": 1,
                  "created_utc": 1739661575.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mcwmyuh",
          "author": "ZestycloseUnit7482",
          "body": "I don’t know. Going from a 7-8 year old led tv to an oled was a pretty big leap. I can’t enjoy going to the movies anymore with the poor picture quality. Not sure oled to micro led will be as big of a jump.",
          "score": 28,
          "created_utc": 1739630355.0,
          "replies": [
            {
              "id": "mcwrnjl",
              "author": "thatguy425",
              "body": "Exactly, OLED is leaps and bounds better than my 8 year old 4k TV. ",
              "score": 13,
              "created_utc": 1739631969.0,
              "replies": []
            },
            {
              "id": "mcx04bg",
              "author": "WhenPantsAttack",
              "body": "It won’t be a big jump in image quality, but it will be a big jump for well lit spaces and longevity/burn in.\n\nOLED wins in picture quality, but fails in brightness and and the organic substrates aren’t very robust, both of which traditional LED TV’s excel in. Micro LED TV’s are basically the end game because it has all the benefits of both types, without their either of their weaknesses.\n\nThe only problem with Micro-LED is that it’s really hard to miniaturize the technology into a traditional TV size at a high resolution.  We could probably have a 1080p Micro-LED TV today, but that would be a questionable trade off with upscaling tech as it is and likely a fail in marketing when compared to the 4k and 8k OLED and tradition LED TV’s, so we wait until the technology matures.",
              "score": 6,
              "created_utc": 1739634702.0,
              "replies": [
                {
                  "id": "mcxeifl",
                  "author": "IIlIIlIIlIlIIlIIlIIl",
                  "body": ">It won’t be a big jump in image quality, but it will be a big jump for well lit spaces and longevity/burn in.\n\nWhich is why I don't see that much of the hype for consumer TVs.\n\nConsumer TVs run much less risk of burn in due to the nature of what's shown on screen and they're usually indoors in completely controllable environments, so they don't often need the extreme brightness.\n\nThe hype I think is in PC monitors: Burn-in is a real risk there.",
                  "score": 3,
                  "created_utc": 1739639168.0,
                  "replies": []
                },
                {
                  "id": "mcyu99p",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1739654939.0,
                  "replies": [
                    {
                      "id": "mcz5b8o",
                      "author": "jaa101",
                      "body": "This year's LG OLEDs are up to 4000 nits peak brightness.  They're using 4 layers of OLED to make it brighter.",
                      "score": 1,
                      "created_utc": 1739658414.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mcwyc4v",
              "author": "Tzukkeli",
              "body": "Yeah, VHS was good enough until you tried DVD",
              "score": 3,
              "created_utc": 1739634135.0,
              "replies": []
            },
            {
              "id": "mcx0fwb",
              "author": "apple-pie2020",
              "body": "Yeah crt to led was a big jump.  Then led to oled.  I love my oled tv. But I can’t see picture quality getting any much better. Perhaps cost may come down and/or sizing can get larger for less but for my standard old family room 75” is enough",
              "score": 1,
              "created_utc": 1739634803.0,
              "replies": []
            },
            {
              "id": "mczy705",
              "author": "aitorbk",
              "body": "A good HDR oled screen is miles better than many theatres.  They stopped updating their technology and it shows..\nThe sound is better than what I currently have at home, but about as good as what I had 20 years ago.  20 years ago.\n\nMicroled will allow better image quality, particularly better transitions, and zero lag. I don't think most people will notice the difference except in brightness.",
              "score": 1,
              "created_utc": 1739668123.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mcwrpci",
          "author": "None",
          "body": "“If you don’t watch a lot of TV or are a video game enthusiast, an expensive TV probably isn’t worth it for you”.\n\nYeah, no shit.",
          "score": 10,
          "created_utc": 1739631986.0,
          "replies": [
            {
              "id": "mcxcvm3",
              "author": "None",
              "body": "Exactly, then people buy these high end tvs like it’s 2005 and brag about it but they only stream Netflix and Apple TV and the picture still looks like shit. \n\nThat’s my whole point. The people getting mad in here trying to justify it just prove that they’re bought into tv hype like it’s still relevant",
              "score": 2,
              "created_utc": 1739638667.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mcwoo69",
          "author": "Dutch_SquishyCat",
          "body": "For me it’s all about the price. If they can get these new technologies cheap like those 1080p screens were, I’m interested.",
          "score": 5,
          "created_utc": 1739630949.0,
          "replies": []
        },
        {
          "id": "mcwop0x",
          "author": "satanfurry",
          "body": "I just want them to release a (somewhat reasonably priced) monitor because i really want OLED but burn in is a deal breaker",
          "score": 4,
          "created_utc": 1739630957.0,
          "replies": []
        },
        {
          "id": "mcx6h60",
          "author": "LargelyInnocuous",
          "body": "microLED is like OLED but with less of the issues of OLED degradation. So there is a long term consumer benefit even if the resolution doesn't change. They probably just want to package it with a move to 8k because durability isn't a compelling marketing point for most of the market and selling $50k TVs is the best strategy when your manufacturing capacity isn't scalable yet.",
          "score": 2,
          "created_utc": 1739636693.0,
          "replies": []
        },
        {
          "id": "mcwr50q",
          "author": "thisischemistry",
          "body": "So the main thing right now is brightness and contrast ratios. Eliminating the backlight and going with emissive elements allows much better contrast ratios, the problem with using OLED is that the organic layer tends to degrade over time. To combat this they are often driven more gently and have lower brightness levels than they could have if they didn't degrade.\n\nA MicroLED array tends to be much more durable than OLED and ticks most of the boxes well. The major thing holding it up is the price of large displays, if they can bring that down then it's probably a significant upgrade over OLED. This doesn't mean that OLED is bad or immediately useless, but you'd rather have MicroLED if the price point is similar.\n\nhttps://www.androidauthority.com/microled-vs-oled-displays-3378913/",
          "score": 3,
          "created_utc": 1739631795.0,
          "replies": []
        },
        {
          "id": "mcwuny9",
          "author": "colombogangsta",
          "body": "Not true, there’s a big difference between a regular 4K and an OLED.",
          "score": 2,
          "created_utc": 1739632970.0,
          "replies": [
            {
              "id": "mcxckkj",
              "author": "None",
              "body": "Yes the tv is different. The quality of streamed content won’t change much though. An 8k micro led with a >100Mbps connection in a house full of devices is still gonna look like shit. The new price point isn’t justified unless you have better hardware to go along with it. Much of America still has shit internet service",
              "score": 1,
              "created_utc": 1739638573.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mcwqs9a",
          "author": "theghostecho",
          "body": "VR needs higher resolution",
          "score": 1,
          "created_utc": 1739631675.0,
          "replies": [
            {
              "id": "mcxd47d",
              "author": "None",
              "body": "VR, which is on your head and not at all on the tv unless you’re watching someone else play",
              "score": 1,
              "created_utc": 1739638740.0,
              "replies": [
                {
                  "id": "mcxety5",
                  "author": "theghostecho",
                  "body": "It’s not in your head, it’s light sent to your eyes via LEDs. \n\nThe problem rn is they can’t get them dense enough.",
                  "score": 1,
                  "created_utc": 1739639269.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mcwv9bu",
          "author": "MayorOfClownTown",
          "body": "We went down to a 1080p projector since we needed 100\"+ inches. I'd like a nicer screen one day but I'm totally fine with the image quality.  Gave the 4k tv to friends and they've been using that for years. It's very clear that the image suffers from the compressed streaming so an upgrade wouldn't do much.\n\nIt also might be where we're all at in life as well, but I'm not upgrading shit like I used to either.",
          "score": 1,
          "created_utc": 1739633159.0,
          "replies": [
            {
              "id": "mcxc6h5",
              "author": "None",
              "body": "Maybe you’re right. It just seems to me like everyone responding negatively is really bought into commercialism hype. Better tvs made sense when the platform for viewing them was getting better. Blu-ray and 4k went hand in hand. \n\nNow that most people stream, there’s no reason for super high end fidelity if they live in a lot of suburbs outside areas with good internet coverage. People bragging about a $2k+ tv while they show you Netflix is a joke. Just get a cheap tv and spend your money on better sound equipment",
              "score": 3,
              "created_utc": 1739638454.0,
              "replies": [
                {
                  "id": "mcxiwcw",
                  "author": "cythric",
                  "body": "The better tv generally still looks better, even if you stream.",
                  "score": 2,
                  "created_utc": 1739640504.0,
                  "replies": [
                    {
                      "id": "md9qd2e",
                      "author": "MayorOfClownTown",
                      "body": "True, but the returns diminish so much with the money spent. Though TVs are so fucking good and cheap these days. While I agree better TVs will show better images, I still can't get over how terrible the darks compression is.  Always looks splotchy from certain services.",
                      "score": 1,
                      "created_utc": 1739809918.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mcwnbcb",
          "author": "None",
          "body": "[deleted]",
          "score": -11,
          "created_utc": 1739630477.0,
          "replies": [
            {
              "id": "mcx37wo",
              "author": "3-DMan",
              "body": "> All content we watch is 1080p\n\nMaybe try...something in 4K HDR?  You're wasting a lot of the potential of your nice TV.",
              "score": 3,
              "created_utc": 1739635677.0,
              "replies": []
            },
            {
              "id": "mcwop3m",
              "author": "Weird_Cantaloupe2757",
              "body": "There is a huge difference between OLED and even the best LCDs that you unfortunately cannot unsee once you get accustomed to it, especially with any kind of HDR content.",
              "score": 5,
              "created_utc": 1739630958.0,
              "replies": [
                {
                  "id": "mcwqr97",
                  "author": "None",
                  "body": "Yeah on quality content. But streaming content can’t be fixed by the tv when it’s bottlenecked by the isp",
                  "score": -4,
                  "created_utc": 1739631666.0,
                  "replies": [
                    {
                      "id": "mcwzk6l",
                      "author": "Weird_Cantaloupe2757",
                      "body": "Nah even streaming HDR looks *way* better on OLED than LCD. It doesn’t make *as much* difference as what you see on quality content, but there really isn’t anything that doesn’t look better on OLED. And the ISP rarely has anything to do with the quality of streaming, that’s generally down to the streaming service.",
                      "score": 2,
                      "created_utc": 1739634528.0,
                      "replies": []
                    },
                    {
                      "id": "mcx41by",
                      "author": "Nope_______",
                      "body": "Isn't it the streaming service that's limiting bitrate? I can stream content >100 Mbps outside of Netflix or other big streaming services.",
                      "score": 1,
                      "created_utc": 1739635934.0,
                      "replies": [
                        {
                          "id": "mcxbl1r",
                          "author": "None",
                          "body": "If your internet is capable of that. A lot of people outside of major cities still have shit internet speeds of 100 or less",
                          "score": -1,
                          "created_utc": 1739638274.0,
                          "replies": [
                            {
                              "id": "mcxc4r3",
                              "author": "Nope_______",
                              "body": "Yeah but Netflix does like 5-16 Mbps for their highest quality content. Not many people are restricted by the ISP. Almost everyone is able to max out Netflix.",
                              "score": 3,
                              "created_utc": 1739638439.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}