{
  "post": {
    "title": "PlayStation VR2 will get hand-tracking support soon",
    "author": "Sariel007",
    "id": "1h795hq",
    "score": 840,
    "created_utc": 1733405258.0,
    "selftext": "",
    "num_comments": 90,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1h795hq/playstation_vr2_will_get_handtracking_support_soon/"
  },
  "comments": [
    {
      "id": "m0jkn3i",
      "author": "brickwindow",
      "body": "Will it get games too?",
      "score": 295,
      "created_utc": 1733409372.0,
      "replies": [
        {
          "id": "m0jut47",
          "author": "ThatGuyUAre",
          "body": "There’s some solid games on the platform.  The resident evil games and GT7 are worth the price alone IMO",
          "score": 52,
          "created_utc": 1733412791.0,
          "replies": [
            {
              "id": "m0k27pi",
              "author": "Vismal1",
              "body": "Metro Awakening is fantastic. Only game to give Alyx a run for its money in my opinion",
              "score": 26,
              "created_utc": 1733415121.0,
              "replies": [
                {
                  "id": "m0ksd5w",
                  "author": "ThatGuyUAre",
                  "body": "Metro was a lot fun too",
                  "score": 3,
                  "created_utc": 1733423117.0,
                  "replies": []
                },
                {
                  "id": "m0k4sa8",
                  "author": "AcceptableFold5",
                  "body": "Just hopping in to give a shoutout to Horizon Call of the Mountain, which is absolutely gorgeous and pretty cool in its own right.",
                  "score": 11,
                  "created_utc": 1733415919.0,
                  "replies": [
                    {
                      "id": "m0kq0jr",
                      "author": "Vismal1",
                      "body": "Oh yea I very much did enjoy that one too but it’s not as narratively compelling to me. Beautiful game and fun though.",
                      "score": 4,
                      "created_utc": 1733422406.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0xv1lw",
                  "author": "JeffCrossSF",
                  "body": "Buying now. Thanks",
                  "score": 1,
                  "created_utc": 1733610444.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0k3n6r",
              "author": "brickwindow",
              "body": "I may consider jumping in if I decide to build a gaming PC next year. I don't suppose I could run VR2 on my Steamdeck 🫣",
              "score": 3,
              "created_utc": 1733415564.0,
              "replies": [
                {
                  "id": "m0or0rk",
                  "author": "None",
                  "body": "They did just release a PC adapter for the PSVR2 back in August. I haven’t gotten it yet but it’s out there.",
                  "score": 4,
                  "created_utc": 1733480235.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0l1vk9",
              "author": "TylerDurdenEsq",
              "body": "Beat Saber is pretty good if basic",
              "score": 5,
              "created_utc": 1733426032.0,
              "replies": [
                {
                  "id": "m0ohscu",
                  "author": "None",
                  "body": "It has been around for ages and can run o potato by this point…",
                  "score": 3,
                  "created_utc": 1733474021.0,
                  "replies": [
                    {
                      "id": "m178bjk",
                      "author": "The_King_of_Okay",
                      "body": "True but it's even nicer with that HDR OLED and haptics lol",
                      "score": 1,
                      "created_utc": 1733756171.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m0ng0yd",
              "author": "ASIWYFA",
              "body": "Cool, games that are years old now.......",
              "score": 2,
              "created_utc": 1733455216.0,
              "replies": [
                {
                  "id": "m0pit3k",
                  "author": "--ipseDixit--",
                  "body": "Metro came out less than a month ago (Nov 7, 2024)",
                  "score": 3,
                  "created_utc": 1733494118.0,
                  "replies": []
                },
                {
                  "id": "m0q43ue",
                  "author": "ThatGuyUAre",
                  "body": "RE8 is 3 years old and the others I mentioned are 1-2 years old.  What are you, 12 years old?",
                  "score": 1,
                  "created_utc": 1733501357.0,
                  "replies": [
                    {
                      "id": "m0ql0ie",
                      "author": "ASIWYFA",
                      "body": "When your only gaming suggestions are 2-3 years old games,  it gives further creedence to OPs statement of \"when will it get games\". That doesn't make sense to you?",
                      "score": 1,
                      "created_utc": 1733506653.0,
                      "replies": [
                        {
                          "id": "m0s9s3a",
                          "author": "ThatGuyUAre",
                          "body": "Those are my favorites that I return to regularly, more than any other VR games.  There are other games that are fun.  We got Metro last month, then Behemoth and Alien are coming this month.  Why are you so insufferable?",
                          "score": 0,
                          "created_utc": 1733526508.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m0jncgf",
          "author": "certainlyforgetful",
          "body": "Game selection isn’t great… but it will be supported on PC soon so you can use any steam VR game.",
          "score": 39,
          "created_utc": 1733410313.0,
          "replies": [
            {
              "id": "m0jub6l",
              "author": "banditbananas",
              "body": "It's supported on PC right now. You just have to buy the adapter. I've used it a lot more since I've hooked it to my PC",
              "score": 63,
              "created_utc": 1733412628.0,
              "replies": [
                {
                  "id": "m0l0mp0",
                  "author": "FlintStoneOran",
                  "body": "Just a PSA, if you have a graphics card with “VirtualLink” USB C port, then you don’t even need the adapter at all, you just plug it straight into the graphics card. You just need to get the PSVR2 software from steam and a compatible Bluetooth adapter for the controllers. \n\nI believe the port is present in the Nvidia GeForce 20 Series cards. \n\nTested and working myself with my sister’s 2080ti.",
                  "score": 15,
                  "created_utc": 1733425648.0,
                  "replies": [
                    {
                      "id": "m0pb2uz",
                      "author": "Deceptiveideas",
                      "body": "More info here about the port you’re talking about btw\n\nhttps://www.uploadvr.com/every-virtuallink-gpu/",
                      "score": 3,
                      "created_utc": 1733491045.0,
                      "replies": [
                        {
                          "id": "m0qx9hi",
                          "author": "FlintStoneOran",
                          "body": "Perfect, thanks!",
                          "score": 1,
                          "created_utc": 1733510487.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m0nzqtu",
                      "author": "twigboy",
                      "body": "Interesting, first time hearing about this",
                      "score": 1,
                      "created_utc": 1733463427.0,
                      "replies": []
                    },
                    {
                      "id": "m0okr2x",
                      "author": "Da1witdamstrplan",
                      "body": "Works on ASUS 4090 and 3090 ASUS sir?",
                      "score": 1,
                      "created_utc": 1733476012.0,
                      "replies": [
                        {
                          "id": "m0ooltu",
                          "author": "FlintStoneOran",
                          "body": "Nope, I have a 3090 and they removed the VirtualLink. Only the 20 series cards have it as far as I know. I have to use the adapter on my rig.",
                          "score": 1,
                          "created_utc": 1733478640.0,
                          "replies": [
                            {
                              "id": "m0q2fwf",
                              "author": "Da1witdamstrplan",
                              "body": "What adapter? Link please",
                              "score": 1,
                              "created_utc": 1733500822.0,
                              "replies": [
                                {
                                  "id": "m0qx2qh",
                                  "author": "FlintStoneOran",
                                  "body": "https://direct.playstation.com/en-us/buy-accessories/playstationvr2-pc-adapter\n\nThe official PSVR 2 PC Adapter.",
                                  "score": 1,
                                  "created_utc": 1733510428.0,
                                  "replies": [
                                    {
                                      "id": "m0s29hn",
                                      "author": "Da1witdamstrplan",
                                      "body": "You’re a gentleman and a scholar.  Thank you! Bummer is sold out  :(  & is for DisplayPort and I use my lg g3 for gaming with hdmi at 4k 120hz",
                                      "score": 1,
                                      "created_utc": 1733523834.0,
                                      "replies": [
                                        {
                                          "id": "m0txxiz",
                                          "author": "FlintStoneOran",
                                          "body": "Might be some other stores near you that have it, I know my local tech stores all still have stock. \n\nAnd the DisplayPort shouldn’t be an issue because you have multiple ports in the back of the GPU, so you leave the HDMI plugged in to your monitor and GPU  and you just plug the DisplayPort cable into one of the other ports on the GPU and run it to the adapter. \n\nIt effectively is just like plugging in a second display, and doesn’t interfere with your existing setup.",
                                          "score": 1,
                                          "created_utc": 1733551952.0,
                                          "replies": [
                                            {
                                              "id": "m0u4b2z",
                                              "author": "Da1witdamstrplan",
                                              "body": "Maybe I can run an hdmi to display port cable? Or will it drop performance because of the cable?",
                                              "score": 1,
                                              "created_utc": 1733555798.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m0jwuhr",
                  "author": "LegPotato",
                  "body": "It works with all games that require VR?",
                  "score": 11,
                  "created_utc": 1733413438.0,
                  "replies": [
                    {
                      "id": "m0jz5y6",
                      "author": "LongBeakedSnipe",
                      "body": "Everything I tried it with, and its fantastic with iracing.\n\nYou just have to make sure to turn the resolution scaling down in steamvr setting. It starts stupidly high, and thus the default massively impacts performance",
                      "score": 21,
                      "created_utc": 1733414167.0,
                      "replies": [
                        {
                          "id": "m0k7an1",
                          "author": "alidan",
                          "body": "my understanding is with vr and modern lenses is the way we need to scale vr to be 1:1 is a 150% scaling, little more complex but that's about what it takes.",
                          "score": -4,
                          "created_utc": 1733416696.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m0k1ifc",
                  "author": "certainlyforgetful",
                  "body": "Oh that’s awesome. I was waiting for the driver to be released, I thought it just did the billboard thing right now!",
                  "score": 4,
                  "created_utc": 1733414900.0,
                  "replies": [
                    {
                      "id": "m0l748k",
                      "author": "wolfwings",
                      "body": "It's even directly available in Steam, no separate thing to hunt down literally \"PlayStation VR2 App\" right in the Steam store. Shockingly painless to setup. O.o",
                      "score": 1,
                      "created_utc": 1733427643.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0k2ghb",
                  "author": "-Agathia-",
                  "body": "\"Just have to buy the adapter\".\n\nThat's the thing though. I've been trying to get one in the past month. Not a single one available in Canada. All shops are out of stock and we can't order for later. It just feels like it's been released without any production going after the initial release.\n\nI wish Sony liked money, but it seems they do everything in their power to fuck it up sometimes. PSVR2 released with no games because PSVR1 games are NOT supported. None of them. Remapping controls should be extremely easy for 99% of them, but nope! PC adapter? No HDR, no eye tracking, no bluetooth included in the adapter just leading to confusion. It's always half assed, it's insane. I want it because my current PC headset one is slowly dying :(",
                  "score": 8,
                  "created_utc": 1733415196.0,
                  "replies": [
                    {
                      "id": "m0l6v15",
                      "author": "wolfwings",
                      "body": "The \"adapter\" is nothing but a USB 3.0 hub that merges two DisplayPort lines in for a specific USB 3.x 'alt mode' in basically the old VirtualLink setup. The old VirtualLink USB-C 2000-series RTX cards work without an adapter at all in fact!\n\nAnd despite what Sony claims most folks don't need a separate bluetooth adapter. If you have a laptop? The built-in bluetooth has a FAR better antenna than their 'recommended' micro-adapters, and even most desktops a lot of motherboards support wifi + bluetooth directly and... again, the included antenna will work far better.\n\nFor once they actually went with 'industry standards' instead of propietary but then the standards body discontinued it out from under them after they'd already 'taped out' the new tech. :(\n\nBut there are a LOT of third-party PC adapters out now when I look, since it turns out the adapter is painfully simple.",
                      "score": 7,
                      "created_utc": 1733427565.0,
                      "replies": [
                        {
                          "id": "m0ljo7v",
                          "author": "PM_ME_YOUR__INIT__",
                          "body": "I have an RTX2070 with USBC in the back and just bought PSVR2 and Half Life: Alyx for when I can get the adapter. You may have just saved a ton of time!",
                          "score": 7,
                          "created_utc": 1733431586.0,
                          "replies": [
                            {
                              "id": "m0nk7g8",
                              "author": "wolfwings",
                              "body": "Yup, you get to skip the adapter entirely! Go through the normal 'setup' process in the PS VR2 app in Steam but just skip forward when it tells you about the adapter and when it says to plug your headset into the adapter? Plug it into the VirtualLink port instead!\n\nThere is a bug in older PSVR2 firmwares that don't work out of the box with all VirtualLink ports (especially NVidia due to a bug on NVidia's side) so you might need to find a PS5 to plug into briefly to update the firmware on the headset if the one you get has the really old firmware.\n\nAlso one caveat I've encountered with the PSVR2 which others run into: After running SteamVR I lose my mouse cursor on the right half of my primary monitor.\n\nIf that happens to you? Win+Ctrl+Shift+B, it'll restart your GPU driver which fixes the issue.",
                              "score": 2,
                              "created_utc": 1733456809.0,
                              "replies": []
                            },
                            {
                              "id": "m0mm1kp",
                              "author": "AppropriateTouching",
                              "body": "That game is so good, I hope you get to play it soon!",
                              "score": 1,
                              "created_utc": 1733444293.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m0l4bb9",
                      "author": "aman27deep",
                      "body": "Very true. I haven't been able to find an adapter anywhere so I haven't purchased it yet even though the discounted price is attractive right now. I only plan to play on PC as I don't have a PS5.",
                      "score": 2,
                      "created_utc": 1733426778.0,
                      "replies": []
                    },
                    {
                      "id": "m0mlufn",
                      "author": "AppropriateTouching",
                      "body": "As an owner of an oculus rift.... I feel for you on the dying part... mine works 1 out of 20 times because the cable and usb drivers are shit and support could not give less of a shit.",
                      "score": 1,
                      "created_utc": 1733444222.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m0mi10p",
              "author": "ShaggysGTI",
              "body": "But I want steam games on PS5.",
              "score": 2,
              "created_utc": 1733442854.0,
              "replies": []
            },
            {
              "id": "m0nikh4",
              "author": "Theguest217",
              "body": "Great, let me just go buy a PC that can actually run VR games so I can actually use my PSVR2 headset.",
              "score": 1,
              "created_utc": 1733456182.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0ks6cp",
          "author": "singlefate",
          "body": "Sounds like you don't actually know about any VR games. It's been getting pretty highly anticipated games in the VR community like Aliens.",
          "score": 14,
          "created_utc": 1733423060.0,
          "replies": [
            {
              "id": "m0n5v0e",
              "author": "brickwindow",
              "body": "Aliens would be excellent. I'll be the first to admit I'm not following the pipeline of upcoming titles. Just looking at existing games there were only a handful that looked worthwhile.",
              "score": 0,
              "created_utc": 1733451470.0,
              "replies": []
            },
            {
              "id": "m0mo671",
              "author": "NeatoNico",
              "body": "Not all the games out for vr are interesting.  I have VR2 and only two games for my PS5 aren’t boring af",
              "score": -1,
              "created_utc": 1733445063.0,
              "replies": [
                {
                  "id": "m0pz8l1",
                  "author": "BLITZandKILL",
                  "body": "Idk why yall are getting downvoted. VR library on PS5 is garbage. I got the PC adapter a month ago and have already logged more hours on PC with my VR2 compared to on the PS5 since launch day. It’s soooo much better on PC and you get a full catalog of games.",
                  "score": 1,
                  "created_utc": 1733499801.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0kganq",
          "author": "BrewKazma",
          "body": "Skydances Behemoth came out today.",
          "score": 4,
          "created_utc": 1733419453.0,
          "replies": []
        },
        {
          "id": "m0p8hxs",
          "author": "dilroopgill",
          "body": "never a metaverse no mods so same shit no player created assets, they really need to bring back dreams as a free game with vr multipalayer support its their best bet",
          "score": 1,
          "created_utc": 1733489931.0,
          "replies": []
        },
        {
          "id": "m0psg9d",
          "author": "Softspokenclark",
          "body": "is the games in the room with us?",
          "score": 1,
          "created_utc": 1733497573.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0ke19c",
      "author": "KEVLAR60442",
      "body": "And just like the haptics, eye tracking, and foveated rendering, it'll probably be impossible to use with the PC adapter :(",
      "score": 35,
      "created_utc": 1733418758.0,
      "replies": []
    },
    {
      "id": "m0mfrvl",
      "author": "Darksol503",
      "body": "And dozens rejoice!",
      "score": 11,
      "created_utc": 1733442047.0,
      "replies": [
        {
          "id": "m0mnmux",
          "author": "None",
          "body": "Hey. Be nice. :(.",
          "score": 2,
          "created_utc": 1733444869.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0ocaiy",
      "author": "Bayako7",
      "body": "They should port the Batman Arkham game and assassins creed vr for vr2",
      "score": 3,
      "created_utc": 1733470482.0,
      "replies": []
    },
    {
      "id": "m0ouhs8",
      "author": "caspissinclair",
      "body": "It's a shame the PS5 Pro came out after interest in the PSVR2 had already died down.",
      "score": 1,
      "created_utc": 1733482477.0,
      "replies": [
        {
          "id": "m0p4llx",
          "author": "TheKramer89",
          "body": "It’s actually selling quite well.",
          "score": 1,
          "created_utc": 1733488117.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0mrbls",
      "author": "MonteSS_454",
      "body": "Man this guy can play guitar like no other , he is killing it. But he is not using a guitar vr program, then what is he .......\n\n![gif](giphy|ToMjGpx9F5ktZw8qPUQ|downsized)",
      "score": -2,
      "created_utc": 1733446193.0,
      "replies": []
    },
    {
      "id": "m0m1t2w",
      "author": "Gobigfoot",
      "body": "I got one on sale for Black Friday. The controller would keep disconnecting in games but work fine in the menus. Absolute garbage.",
      "score": -5,
      "created_utc": 1733437258.0,
      "replies": []
    },
    {
      "id": "m0o6yrl",
      "author": "SHADOWSTRIKE1",
      "body": "Too bad that like all PlayStation accessories, it was DOA with zero support",
      "score": -7,
      "created_utc": 1733467327.0,
      "replies": [
        {
          "id": "m0oea8y",
          "author": "atramentum",
          "body": "Like the PlayStation Portal that's been selling out since it launched and is being updated to support game streaming?",
          "score": 6,
          "created_utc": 1733471732.0,
          "replies": [
            {
              "id": "m0pklim",
              "author": "SHADOWSTRIKE1",
              "body": "EyeToy, PlayStation Eye, PlayStation Move, PSVR, etc… hell, even the PSP and Vita died from lack of support.\n\nBut I guess they made a controller with a screen to do the thing that any phone or tablet can already do.",
              "score": 1,
              "created_utc": 1733494791.0,
              "replies": [
                {
                  "id": "m178ujd",
                  "author": "The_King_of_Okay",
                  "body": "The PSP was incredibly successful and the PSVR sold a decent amount. I don't know much about the other devices you mentioned except the Vita which did sell badly tbf.",
                  "score": 1,
                  "created_utc": 1733756355.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m0l53ln",
      "author": "TheMacMan",
      "body": "Wait, it doesn't even have hand-tracking already? Seriously? No wonder it hasn't sold for crap.",
      "score": -22,
      "created_utc": 1733427020.0,
      "replies": [
        {
          "id": "m0lb6jz",
          "author": "ThisNameTakenTooLoL",
          "body": "Yeah, lack of hand tracking was totally the reason, lol.",
          "score": 24,
          "created_utc": 1733428906.0,
          "replies": []
        },
        {
          "id": "m0mtnqa",
          "author": "13thFleet",
          "body": "I'm getting one soon. My first vr doohickey since the HTC vive",
          "score": 3,
          "created_utc": 1733447050.0,
          "replies": [
            {
              "id": "m0mts4d",
              "author": "TheMacMan",
              "body": "I have an Apple Vision Pro and don't use it. I don't need another headset I won't likely use.",
              "score": -10,
              "created_utc": 1733447094.0,
              "replies": [
                {
                  "id": "m0mty4s",
                  "author": "13thFleet",
                  "body": "Isn't that more AR? I suppose it does vr too though",
                  "score": 5,
                  "created_utc": 1733447156.0,
                  "replies": [
                    {
                      "id": "m0mvxea",
                      "author": "TheMacMan",
                      "body": "It's a lot more but it does a lot more too. Still, there aren't many VR games for PS5 so I'll pass.",
                      "score": -5,
                      "created_utc": 1733447870.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0negm5",
                  "author": "Actual_Intercourse",
                  "body": "that shit cost almost 3000 dollars and had no applications that showed off it's potential for gaming so no wonder",
                  "score": 4,
                  "created_utc": 1733454629.0,
                  "replies": [
                    {
                      "id": "m0npucf",
                      "author": "TheMacMan",
                      "body": "I don't game much at all. Gaming certainly wasn't any of the reason I purchased it.",
                      "score": 0,
                      "created_utc": 1733459039.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m0lfnva",
          "author": "btotherad",
          "body": "Well I’m sure the fact it costs more than the actual console is a much bigger reason. Not to mention VR is still just too gimmicky.",
          "score": 1,
          "created_utc": 1733430323.0,
          "replies": [
            {
              "id": "m0lg6kn",
              "author": "TheMacMan",
              "body": "It cost $349, when did the console become less than that?",
              "score": 1,
              "created_utc": 1733430488.0,
              "replies": [
                {
                  "id": "m0livnj",
                  "author": "Anthraksi",
                  "body": "On sale. Just recently. Wasnt it 699usd or close at launch?\n\nEither way its not the only reason is struggling. Software support and the fact that yes, VR will probably never be mainstream since it's been over a decade since VR became readily available for consumers and it hasn't shown any signs of really taking off. It just isn't for everybody and thats fine.",
                  "score": 2,
                  "created_utc": 1733431341.0,
                  "replies": [
                    {
                      "id": "m0om2me",
                      "author": "None",
                      "body": "When it’s on sale for that price for months, that’s the price.",
                      "score": 1,
                      "created_utc": 1733476908.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0lmgo3",
                  "author": "btotherad",
                  "body": "I don’t know if it’s on sale or dropped that much but when it first came out it was $50 USD more than the actual PS5.",
                  "score": 1,
                  "created_utc": 1733432438.0,
                  "replies": []
                },
                {
                  "id": "m0mlyyr",
                  "author": "Oddjob64",
                  "body": "That’s the Black Friday sale. A lot of people bought it, including myself.",
                  "score": 1,
                  "created_utc": 1733444267.0,
                  "replies": [
                    {
                      "id": "m0mmavj",
                      "author": "TheMacMan",
                      "body": "They started offering that price months ago. Sales stalled and they lowered the price.",
                      "score": 2,
                      "created_utc": 1733444386.0,
                      "replies": [
                        {
                          "id": "m0mox3t",
                          "author": "Oddjob64",
                          "body": "Was the Horizon bundle for $350 available back then? I was lead to believe that was new. \n\nIt’s been pretty fun for what it is regardless.",
                          "score": 1,
                          "created_utc": 1733445334.0,
                          "replies": [
                            {
                              "id": "m0mpkwf",
                              "author": "TheMacMan",
                              "body": "Dunno. I know Sony had thousands of them sitting in a warehouse and stopped production some months back because of the back stock. They lowered the price to try to move them.",
                              "score": 1,
                              "created_utc": 1733445570.0,
                              "replies": [
                                {
                                  "id": "m0mrstj",
                                  "author": "Oddjob64",
                                  "body": "Makes sense. I wasn’t going to buy it at $550.",
                                  "score": 2,
                                  "created_utc": 1733446367.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m0m103f",
              "author": "renaissance_man__",
              "body": "VR is fantastic.\n\nVtolvr, dcs in vr, half life alyx are crazy fun",
              "score": 1,
              "created_utc": 1733436999.0,
              "replies": []
            },
            {
              "id": "m0lo4qr",
              "author": "DarthBuzzard",
              "body": "There's nothing gimmicky about VR.",
              "score": 1,
              "created_utc": 1733432960.0,
              "replies": [
                {
                  "id": "m0lq8vx",
                  "author": "btotherad",
                  "body": "Agree to disagree.",
                  "score": -3,
                  "created_utc": 1733433616.0,
                  "replies": [
                    {
                      "id": "m0lsokq",
                      "author": "DarthBuzzard",
                      "body": "It's early and clunky, but gimmicky would mean it's failing to produce value. The value is there, it just comes with caveats.",
                      "score": 3,
                      "created_utc": 1733434376.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m0om03z",
              "author": "None",
              "body": "It’s nowhere even near the cost of the console 😂",
              "score": 0,
              "created_utc": 1733476861.0,
              "replies": [
                {
                  "id": "m0qhg2f",
                  "author": "btotherad",
                  "body": "If you were wise enough you would have read the following comments and saw it’s currently marked way down for holiday sales. The Target app even says it’s originally $599 marked down to $350. But go ahead and feel good about your comment like you got me on something.",
                  "score": 1,
                  "created_utc": 1733505541.0,
                  "replies": [
                    {
                      "id": "m0qjvkx",
                      "author": "None",
                      "body": "It's been $350 *for months.* If you still think that inflated MSRPs being discounted means that it'll ever sell for $599 again, well then get in that jack shack and go to town, wise one.",
                      "score": 1,
                      "created_utc": 1733506297.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}