{
  "post": {
    "title": "XL gaming handheld, tablet and laptop: OneXplayer X1 Pro review",
    "author": "moeka_8962",
    "id": "1jgynbf",
    "score": 28,
    "created_utc": 1742611523.0,
    "selftext": "",
    "num_comments": 19,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jgynbf/xl_gaming_handheld_tablet_and_laptop_onexplayer/"
  },
  "comments": [
    {
      "id": "mj3q8t2",
      "author": "potworzak21",
      "body": "To be honest 1600 price tag kills whole idea. Steam deck is way cheaper, only advantage of x1 is egpu support",
      "score": 10,
      "created_utc": 1742621233.0,
      "replies": [
        {
          "id": "mj5f7gi",
          "author": "Oops_I_Cracked",
          "body": "It feels like it’s trying to be too many things so it won’t be $1,600 worth of good at any of them. \n\nNo one but Apple has truly cracked the tablet nut (and I say that as someone who regularly uses a Surface, a Galaxy Tab, and an iPad). A 2.5 lbs device with a 10” screen is a failure has a handheld. And eGPU support is going to make this thing so expensive that you may as well just build a desktop and buy a steam deck instead. You’ll end up with better portable *and* desktop experiences.\n\nEdit: also under 11” is small for a laptop, especially a gaming laptop. Companies tried 11” ultrabooks and chromebooks for a while. There is a reason 13ish inches has become the default “small” laptop size.",
          "score": 6,
          "created_utc": 1742653907.0,
          "replies": []
        },
        {
          "id": "mjhx29z",
          "author": "GrayDaysGoAway",
          "body": "While I agree that the pricing here is not good at all, that is definitely not the only advantage of the X1. \n\nIt's also far more powerful than the deck even without an egpu, it has a much larger screen with an actually decent resolution (fuck steam deck's 1280x800 bullshit), and has a detachable controller with better ergonomics than the deck.",
          "score": 5,
          "created_utc": 1742832172.0,
          "replies": []
        },
        {
          "id": "mj42mik",
          "author": "moeka_8962",
          "body": "price wise it is expensive. But, you got keyboard,trackpad, higher RAM, better CPU and GPU and bigger SSD than steam deck. So you got all of those in one package and versatility is a key for this thing.",
          "score": -3,
          "created_utc": 1742628960.0,
          "replies": [
            {
              "id": "mj5ohos",
              "author": "potworzak21",
              "body": "Rog ally also had better gpu, cpu, etc. but the price was not worth small improvement in performance for that cash",
              "score": 2,
              "created_utc": 1742656955.0,
              "replies": [
                {
                  "id": "mjia4un",
                  "author": "GrayDaysGoAway",
                  "body": "You're moving the goal lines. You said egpu is the only advantage of the X1. That is completely and utterly false. And the Rog Ally X is widely considered the best handheld out there today so a lot of people disagree with you on the value proposition too.",
                  "score": 3,
                  "created_utc": 1742836019.0,
                  "replies": [
                    {
                      "id": "mjrgr8i",
                      "author": "competition-inspecti",
                      "body": "Mate, it's still 1600$\n\nRog Ally X is still 1000$\n\nCompared to Steam Deck (1TB OLED is 600$), it's still too expensive to be worth it",
                      "score": 1,
                      "created_utc": 1742952836.0,
                      "replies": [
                        {
                          "id": "mjtmsha",
                          "author": "GrayDaysGoAway",
                          "body": "Price was not part of this discussion, that is moving the goalposts. OP said the onexplayer has no advantages over the deck. That is completely false.",
                          "score": 2,
                          "created_utc": 1742992407.0,
                          "replies": [
                            {
                              "id": "mjtrwon",
                              "author": "competition-inspecti",
                              "body": "> To be honest 1600 *price tag* kills whole idea. \n\n> Steam deck *is way cheaper*, \n\n> only advantage of x1 is egpu support",
                              "score": 1,
                              "created_utc": 1742994309.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mm4re6i",
                      "author": "StanRex",
                      "body": "First time I read that ROG AllyX was considered the best handheld out there ... From an overall usability point of view Steam Deck is king",
                      "score": 1,
                      "created_utc": 1744158982.0,
                      "replies": [
                        {
                          "id": "mm87m7a",
                          "author": "GrayDaysGoAway",
                          "body": "The Steam Deck's hardware is really showing its age at this point. Its CPU/GPU are far weaker than any of its competitors, and that 1280 x 800 90hz screen is downright pathetic compared to the others who are all running at least 1080p 120hz. Plus it still can't do basic things like run gamepass.\n\nEven SteamOS isn't the selling point it once was since most of the other handhelds can now run it too. And the others can dual boot to give you the choice of either that or Windows depending on what you're trying to do at that moment.\n\nThe Deck was a great starting point for this category of gadget, but really the only advantage it has at this point is the track pads. Which others like the Zotac Zone have now adopted as well, so even that's no longer a big deal at all.",
                          "score": 1,
                          "created_utc": 1744213003.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mj5pk31",
      "author": "NotAPreppie",
      "body": "Were they going for a palindrome with that name and missed?",
      "score": 1,
      "created_utc": 1742657298.0,
      "replies": [
        {
          "id": "mj74o2o",
          "author": "miko_smees",
          "body": "Orp 1X ReyalpXeno!",
          "score": 1,
          "created_utc": 1742673489.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mj9504m",
      "author": "bonesnaps",
      "body": "A tablet with controller halves attached. Gross 🤢",
      "score": 1,
      "created_utc": 1742699184.0,
      "replies": []
    },
    {
      "id": "mjqd1il",
      "author": "Supermkcay",
      "body": "Too pricey!",
      "score": 1,
      "created_utc": 1742939895.0,
      "replies": []
    },
    {
      "id": "mj5j6g2",
      "author": "rocket_beer",
      "body": "No one will buy this\n\nNo no, calm your britches OP… no one",
      "score": 1,
      "created_utc": 1742655232.0,
      "replies": []
    }
  ]
}