{
  "post": {
    "title": "Google rolls out surprise farewell update for the Pixel 5a / And with that, it's a wrap for one of Google's most iconic Pixels.",
    "author": "a_Ninja_b0y",
    "id": "1gr02ls",
    "score": 1164,
    "created_utc": 1731571662.0,
    "selftext": "",
    "num_comments": 141,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gr02ls/google_rolls_out_surprise_farewell_update_for_the/"
  },
  "comments": [
    {
      "id": "lx24lbf",
      "author": "None",
      "body": "[deleted]",
      "score": 497,
      "created_utc": 1731573120.0,
      "replies": [
        {
          "id": "lx24u1m",
          "author": "Gr1mmage",
          "body": "Literally the least available pixel ever, only released in two countries",
          "score": 338,
          "created_utc": 1731573286.0,
          "replies": []
        },
        {
          "id": "lx3jlge",
          "author": "Realtrain",
          "body": "I think they got mixed up with the 4a",
          "score": 47,
          "created_utc": 1731597763.0,
          "replies": [
            {
              "id": "lx6px59",
              "author": "InsaneNinja",
              "body": "They’ll do better with the iconic 6a",
              "score": 5,
              "created_utc": 1731633569.0,
              "replies": []
            },
            {
              "id": "lx7sfr2",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1731647457.0,
              "replies": [
                {
                  "id": "lx9pl1c",
                  "author": "None",
                  "body": "Mini tablet? Like a phone?",
                  "score": 1,
                  "created_utc": 1731681427.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lx2aav7",
          "author": "JSA790",
          "body": "Yes, the last one with actually good signal reception and without a tensor chip.",
          "score": 82,
          "created_utc": 1731577029.0,
          "replies": [
            {
              "id": "lx2hv8b",
              "author": "FlattenInnerTube",
              "body": "My 5 had WAY better signal reception than this 8P. This thing is fucking awful in that respect. And it's my second 8P - I replaced my first one after cracking the camera on a table corner. That first one also had shit signal reception.",
              "score": 40,
              "created_utc": 1731581960.0,
              "replies": [
                {
                  "id": "lx2ifz6",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 14,
                  "created_utc": 1731582307.0,
                  "replies": [
                    {
                      "id": "lx664xc",
                      "author": "procor1",
                      "body": "same, way better reception than my 2P",
                      "score": 2,
                      "created_utc": 1731626940.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lx3106z",
                  "author": "TheW83",
                  "body": "I've got the 8P and man I definitely agree on the reception issue. My wife has my old 7P and it's just all around a better phone. The 8P does have a slightly better camera it seems but that's about it IMO.",
                  "score": 6,
                  "created_utc": 1731591153.0,
                  "replies": [
                    {
                      "id": "lx34i9l",
                      "author": "FlattenInnerTube",
                      "body": "There's still an almost $700 trade in on a P9P and I'm tempted to ditch this thing...if the P9P does reception better.",
                      "score": 3,
                      "created_utc": 1731592502.0,
                      "replies": [
                        {
                          "id": "lx3n28r",
                          "author": "arex333",
                          "body": "I believe the 9 series does have much better reception",
                          "score": 6,
                          "created_utc": 1731598862.0,
                          "replies": []
                        },
                        {
                          "id": "lx35qjr",
                          "author": "TheW83",
                          "body": "Idk if I trust the pixels anymore. The 7P was amazing. I loved the curved edges on the screen and it just performed great overall. The 8P was a notable downgrade except for the camera and brightness.",
                          "score": 4,
                          "created_utc": 1731592963.0,
                          "replies": [
                            {
                              "id": "lx4p40f",
                              "author": "Hostillian",
                              "body": "I got my 7P nicked and I've an 8P now. Had the 7P for less than a year. \n\nHaven't really noticed much difference.",
                              "score": 1,
                              "created_utc": 1731610527.0,
                              "replies": []
                            },
                            {
                              "id": "lx3oqrl",
                              "author": "TheGreyFencer",
                              "body": "You like them? I have the 5 and not the 5p specifically because the p has curved edges. I had the og curved edges Samsung s whatever it was. Every single one broke like china in a bull store.",
                              "score": 1,
                              "created_utc": 1731599389.0,
                              "replies": [
                                {
                                  "id": "lx3zl9p",
                                  "author": "TheW83",
                                  "body": "Yeah, had a nice feel and look to it. It's been fine now for 2 years. I only got the 8P because my wife needed a new phone so I gave her the 7P.",
                                  "score": 1,
                                  "created_utc": 1731602776.0,
                                  "replies": [
                                    {
                                      "id": "lx426ls",
                                      "author": "TheGreyFencer",
                                      "body": "It definitely felt nice, but honestly that was always lost with a case and not worth the structural issues. Maybe the new ones are better. But my last curved was the s8 or 9 o think and it was still a huge issue.",
                                      "score": 1,
                                      "created_utc": 1731603564.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lx4jby9",
          "author": "None",
          "body": "One of the most iconic pixel phone sounds like one of the most WiFi router or something 🤷🏻‍♂️",
          "score": 3,
          "created_utc": 1731608775.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lx23gy1",
      "author": "jobbing885",
      "body": "Wait what? A 3 year old phone has EOL?",
      "score": 287,
      "created_utc": 1731572353.0,
      "replies": [
        {
          "id": "lx25glt",
          "author": "notjordansime",
          "body": "I was about to say…. I know people still happily rocking iPhone SE’s from 2020 without issues, still getting software upgrades. Even when the full on iOS updates stop, they won’t just get a “farewell” update; Apple will continue to release security patches for years more. \n\nDidn’t Google *just* commit to 7 years of updates? Or is that only for certain/premium models??",
          "score": 226,
          "created_utc": 1731573719.0,
          "replies": [
            {
              "id": "lx27fbl",
              "author": "kaj-me-citas",
              "body": ">Didn’t Google just commit to 7 years of updates? Or is that only for certain/premium models??\n\nOnly Pixel 8 and newer.",
              "score": 136,
              "created_utc": 1731575064.0,
              "replies": [
                {
                  "id": "lx2zzhh",
                  "author": "Aberracus",
                  "body": "Or while Google wants to, there are hundreds of examples of google exiting the market or abandoning its products before ELO",
                  "score": 63,
                  "created_utc": 1731590746.0,
                  "replies": [
                    {
                      "id": "lx3nw4u",
                      "author": "Purple10tacle",
                      "body": "Google is already pretending that their on-device AI, Gemini Nano, never existed on the Pixel 8 Pro and Software-locked every single new feature powered by it to the Pixel 9 series exclusively. Even though that, and long term, persistent, feature updates, we're one of the 8 Pro's big selling points in their presentation.",
                      "score": 24,
                      "created_utc": 1731599123.0,
                      "replies": [
                        {
                          "id": "lx81o12",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 1,
                          "created_utc": 1731651894.0,
                          "replies": [
                            {
                              "id": "lx89yjo",
                              "author": "Purple10tacle",
                              "body": "And most people don't buy Pixel phones.     \nBut the overlap of those who do and those who care about software (AI) features is significant. It's the Pixels' big selling point after all and Google's marketing is almost solely focused on it.",
                              "score": 1,
                              "created_utc": 1731656368.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lx2b7wn",
                  "author": "koolaidismything",
                  "body": "Don’t even trust that. I bought a 6p cause it came with a lifetime of 100gb google cloud storage. They reneged that within two years and then had the balls to charge my card $20 for that same storage. Pissed me off they did that so I fought it and got the charge removed and told them to eat shit. \n\n\nMy iPhone 11 I bought in 2019 still works and I use it like 6 hours a day. Has iOS 18.1 \n\n\nI’ll never go back to android. Not for me anymore.\n\n\nEdit: whoever below somehow got a bunch of upvotes saying I was wrong and it was like 5gb for a few months is full of shit. I was stuck between it and the new Note.. when I got a google email saying anyone who pre ordered the 6p got “lifetime of 100gb storage in googles cloud services” \n\nI’m realistic.. I didn’t think I’d be on my deathbed with that still in 50 years. I figured I’d get 2…. Maybe 3 years of it though AT LEAST. \n\nNope. Oh and that phone was miserable.. luckily I was able to sell for a good amount.",
                  "score": 83,
                  "created_utc": 1731577657.0,
                  "replies": [
                    {
                      "id": "lx2ls4b",
                      "author": "aleuts",
                      "body": "It pisses me off so much when reviewers keep saying it has a billion years worth of updates. It’s not been long enough for one company to honour it yet. And going by most of their histories as you said they always renege. \n\nI have a iPhone 15 pro max and really want a folding phone but even the current models are months behind on updates so it’s either I keep my phone or just buy the cheapest second hand foldable and hope the hardware isn’t on its last legs where my backup iPhone XR is still working great bar the battery",
                      "score": 30,
                      "created_utc": 1731584219.0,
                      "replies": [
                        {
                          "id": "lx65uw0",
                          "author": "TwoToedSloths",
                          "body": "None of the current models, by Samsung or Google, are behind on monthly updates.",
                          "score": 2,
                          "created_utc": 1731626850.0,
                          "replies": []
                        },
                        {
                          "id": "lx602b3",
                          "author": "FireLucid",
                          "body": "Apple and Google have yet to renege on updates, the other OEM's are a crap shoot. Google has recently upped theirs to 7 years which is great. I guess running their own chips helps a lot, they are not reliant on a 3rd party for firmware stuff.\n\nEven the original Pixel still has unlimited Google photo uploads. I should work out how to do that with my old photos, I still have a Pixel in a drawer.\n\nI thought the Google Photos perk ended with the 5 series?",
                          "score": 1,
                          "created_utc": 1731624979.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lx2hmft",
                      "author": "notjordansime",
                      "body": "Same. Teenage me thought it’d be sick to customize my phone and whatnot. It was fun at first, but then stuff stops working as expected, custom launchers aren’t as snappy, and I just defaulted to.. the default. Then there were other things that just made the whole operating system feel like a jumbled mess, or a house of cards built by 20 people with differing opinions on card-house-architecture. Little things really added up. The final nail in the coffin was reaching out to support (for a different issue) using the Google one app (you have to PAY for support btw). When it opened the support ticket, it did so in an inaccessible window in Google chrome. I could hear the agent join the chat and send a message, then leave the chat about 5 mins later. Then they wouldn’t let me open a new support ticket because that one just closed. It’s not like I was using the Samsung browser or anything (not that that should cause issues as it’s the *default configuration* the phone ships with). I was trying to contact **google** about an issue with one of **google’s** digital products, through **google** support and a **google** browser.  Whole software “pipeline” was Google operated, but it still didn’t work. Bought an iPhone that same day.",
                      "score": 35,
                      "created_utc": 1731581811.0,
                      "replies": []
                    },
                    {
                      "id": "lx4oeur",
                      "author": "Yancy_Farnesworth",
                      "body": "To be fair, it isn't particularly Google's fault as the support window is essentially dictated by Qualcomm. They couldn't support it longer even if they wanted to. All Qualcomm SoC phones have that in common. Which is why the only devices you see with a longer support window are non-Qualcomm SoCs. One of those being iPhones.\n\nLuckily Google is now making their own SoCs starting with the Pixel 7 so Qualcomm can't force them into a shorter support window. I don't know why the Pixel 7's support window is so short though.",
                      "score": 5,
                      "created_utc": 1731610316.0,
                      "replies": []
                    },
                    {
                      "id": "lx2n12h",
                      "author": "DM725",
                      "body": "Android isn't Pixel.  Samsung has a much better product.",
                      "score": -8,
                      "created_utc": 1731584886.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lx6co0l",
                  "author": "void_const",
                  "body": "Google is trash",
                  "score": 2,
                  "created_utc": 1731629103.0,
                  "replies": []
                },
                {
                  "id": "lx4nkdh",
                  "author": "crlogic",
                  "body": "And I’ll only believe it when I see it",
                  "score": 0,
                  "created_utc": 1731610058.0,
                  "replies": [
                    {
                      "id": "lx60fj8",
                      "author": "FireLucid",
                      "body": "I mean, you can look at their published support dates on their website. They have all been correct so far. Now they are not beholden to a 3rd party they can actually do this.",
                      "score": 1,
                      "created_utc": 1731625094.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lx2czgj",
              "author": "None",
              "body": "[removed]",
              "score": 45,
              "created_utc": 1731578844.0,
              "replies": [
                {
                  "id": "lx2ga9x",
                  "author": "notjordansime",
                  "body": "Ha! Wait until I tell you about my $1,000 (Canadian dollar) Samsung Galaxy S8 that got *drumroll* 🥁 TWO whole android updates!! \n\nFirst and only Samsung flagship I’ll ever own. Went back to using an iPhone 6S that was released years before the S8 and still got updates for a couple of years. I’ve used a couple of Samsung beaters that I got for free after my 6S broke, but I refuse to *pay* for another Samsung phone after that debacle.",
                  "score": 34,
                  "created_utc": 1731580985.0,
                  "replies": [
                    {
                      "id": "lx4hwt4",
                      "author": "None",
                      "body": "[removed]",
                      "score": 1,
                      "created_utc": 1731608346.0,
                      "replies": [
                        {
                          "id": "lx4j4ul",
                          "author": "DM725",
                          "body": "[https://www.androidauthority.com/samsung-android-updates-1148888/](https://www.androidauthority.com/samsung-android-updates-1148888/)\n\n![gif](giphy|EoqDZ3Osey9PO)",
                          "score": 0,
                          "created_utc": 1731608716.0,
                          "replies": [
                            {
                              "id": "lx4w1zu",
                              "author": "None",
                              "body": "[deleted]",
                              "score": -1,
                              "created_utc": 1731612645.0,
                              "replies": [
                                {
                                  "id": "lx52fvp",
                                  "author": "DM725",
                                  "body": "If only you were literate enough to read the contents of the article.",
                                  "score": 0,
                                  "created_utc": 1731614609.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lx337mz",
                  "author": "proanimus",
                  "body": "Yeah 5+ years should have been the industry standard a decade ago with how much these things cost, at least at the mid to high end.",
                  "score": 9,
                  "created_utc": 1731592010.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lx4um71",
              "author": "piddydb",
              "body": "People have a lot of legitimate qualms with Apple, but their after purchase support is really hard to deny. Regular years of software support without making a big deal about it, retail stores with technicians to help you and get you warranty repairs if needed. I don’t know what you do if you have a Pixel that stops working under warranty.",
              "score": 11,
              "created_utc": 1731612209.0,
              "replies": [
                {
                  "id": "lxehquh",
                  "author": "free_dead_puppy",
                  "body": "You message Pixel Support on a computer and after talking for a few minutes they send you a new phone.  Then you mail your old one back.",
                  "score": 1,
                  "created_utc": 1731743273.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lx35n5c",
              "author": "reinhardtmain",
              "body": "I’m on an iPhone 11 from 2019 that still works perfectly fine and just got a major OS update. 3 years is wild for updates.",
              "score": 9,
              "created_utc": 1731592927.0,
              "replies": [
                {
                  "id": "lx3y9kd",
                  "author": "notjordansime",
                  "body": "I was trying to compare it to a “budget” model instead of a flagship. But I guess it’s no different because the SE 2020 has the same chip as the iPhone 11",
                  "score": 3,
                  "created_utc": 1731602370.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lx2duxs",
              "author": "happy_church_burner",
              "body": "Remember that Google was \"totally committed\" to online gaming service Stadia and killed it week after that. I don't trust Google with anything other than Gmail and search.",
              "score": 22,
              "created_utc": 1731579417.0,
              "replies": [
                {
                  "id": "lx2fg2l",
                  "author": "dinkpantiez",
                  "body": "And the search is getting very dicey",
                  "score": 27,
                  "created_utc": 1731580452.0,
                  "replies": [
                    {
                      "id": "lx30zz3",
                      "author": "coffeeshopslut",
                      "body": "You mean \"Google ads pushing service\"?",
                      "score": 13,
                      "created_utc": 1731591151.0,
                      "replies": [
                        {
                          "id": "lx3mr48",
                          "author": "dinkpantiez",
                          "body": "With all the latest AI compiled misinformation, yeah",
                          "score": 5,
                          "created_utc": 1731598766.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lx4vdmc",
                      "author": "calcium",
                      "body": "Google search is rat turds now.  DDG is just as good but doesn't sell your data.",
                      "score": 4,
                      "created_utc": 1731612441.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lx4fa88",
                  "author": "None",
                  "body": "skirt sparkle overconfident fanatical dime flag subtract quack tap direful\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                  "score": 2,
                  "created_utc": 1731607545.0,
                  "replies": []
                },
                {
                  "id": "lx3ddnq",
                  "author": "None",
                  "body": "Remember when people were yelling Stadia was going to go under and then acted surprised?",
                  "score": 0,
                  "created_utc": 1731595697.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lx3tl3j",
              "author": "procursive",
              "body": "Part of it is that Android isn't nearly as \"update sensitive\" as iOS is. You could be 5 major Android versions out of date and chances are you'll have a *really* hard time finding a common app that won't work and you'll still be recieving updates for Google Play Services and most system apps. Meanwhile on iOS every single system app only ever gets updated with system updates and once you're a couple of versions out of date some major apps will probably start to dislike your device. OFC that doesn't excuse the pathetic support that most Android phones get, but it's the reason why the whole ecosystem could exist in that state for 15 years without changing.",
              "score": 14,
              "created_utc": 1731600913.0,
              "replies": [
                {
                  "id": "lx4150i",
                  "author": "notjordansime",
                  "body": "You’re absolutely right. All of my last android phones were out of date and it was a nothing burger. Even the security patches were years out of date on the one phone and I had zero issues. Meanwhile using an out of date iPhone (without any sort of newer Apple device to do the stupid “purchased” list workaround thing) SUCKS. Okay for web browsing and using the apps I already had, but like the moment you need a new app it’s just like aghhhhhh KILL me.",
                  "score": 8,
                  "created_utc": 1731603246.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lx6uv5j",
              "author": "Buttersaucewac",
              "body": "I bought an iPhone 9 years ago. Gave it to my husband 7 years later because it finally stopped getting updated to the latest OS. He’s still using it and it’s still getting security and minor feature updates. If you don’t care about always having the latest OS features like he doesn’t, they can last you a decade.",
              "score": 3,
              "created_utc": 1731635236.0,
              "replies": []
            },
            {
              "id": "lx265k6",
              "author": "NotThatPro",
              "body": "7 years only from the pixel 8 series*(thanks for correction!). The older phones have 3 years of official updates, but flashing a custom rom is still possible",
              "score": 7,
              "created_utc": 1731574200.0,
              "replies": [
                {
                  "id": "lx27d4e",
                  "author": "kaj-me-citas",
                  "body": "The 8 series has that too.",
                  "score": 10,
                  "created_utc": 1731575022.0,
                  "replies": []
                },
                {
                  "id": "lx26bfv",
                  "author": "mianbeta",
                  "body": "Pixel 8*",
                  "score": 9,
                  "created_utc": 1731574312.0,
                  "replies": []
                },
                {
                  "id": "lx26azp",
                  "author": "notjordansime",
                  "body": "better late than never, I suppose 🤦🏻‍♀️",
                  "score": 0,
                  "created_utc": 1731574304.0,
                  "replies": []
                },
                {
                  "id": "lx4q6cn",
                  "author": "Yancy_Farnesworth",
                  "body": "> flashing a custom rom is still possible\n\nThat comes with a lot of massive asterisks. It is nowhere near replacing official support and more often than not gives people a false sense of security.\n\nA lot of the time those are essentially skins. They cannot replace the kernel of the OS because that requires either access to the SoC driver source code or reverse engineering it. Which means that you're still running an old out of support OS on your device with associated security issues. Heartbleed a few years ago was a huge issue because patching it required patching the kernel.\n\nThe exceptions are distributions like LineageOS. They reverse engineer the SoC drivers, allowing them to update the kernel. But that is hit or miss because those builds usually don't pass the full suite of tests that Google provides for official builds.",
                  "score": 0,
                  "created_utc": 1731610850.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lx5xocj",
              "author": "mrtruthiness",
              "body": "> Didn’t Google just commit to 7 years of updates? Or is that only for certain/premium models??\n\nIt's not a retroactive 7 years.\n\nThe Pixel 7 series has 5 years of updates.  The Pixel 8 and Pixel 9 series has 7 years of updates.  The Pixel 5 was 3 years (and I don't know about the Pixel 6).",
              "score": 2,
              "created_utc": 1731624224.0,
              "replies": [
                {
                  "id": "lx61yej",
                  "author": "BigLan2",
                  "body": "The 6 has had it's last android version (3 years from launch) but will get security updates for 2 more years (5 years from release.) that's the same as the 7. The 8+9 both get. 7 years of OS and security updates.\n\n\nThe 5 and earlier all got 3 years of android + security (the 1 and 2 might have been even shorter.)",
                  "score": 1,
                  "created_utc": 1731625584.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lx5zlqq",
              "author": "murrzeak",
              "body": "P6 guaranteed updates ended this October.. This phone is still blazing fast. Google just loves to create e-waste it seems",
              "score": 2,
              "created_utc": 1731624830.0,
              "replies": []
            },
            {
              "id": "lx2fo2h",
              "author": "Iwillrize14",
              "body": "I'm still using an s10 without issues",
              "score": 4,
              "created_utc": 1731580595.0,
              "replies": []
            },
            {
              "id": "lx4qa2u",
              "author": "i_suckatjavascript",
              "body": "Even though it doesn’t get updates anymore, I’m still happy with my iPhone 6S Plus with the headphone jack.",
              "score": 1,
              "created_utc": 1731610882.0,
              "replies": []
            },
            {
              "id": "lx2upmq",
              "author": "doyletyree",
              "body": "Soooo I am one of those people.\n\nHad the Pixel 1 before.\n\nAfter the awful battery life of the Pixel and the designed-obsolescence of the OS, I could neither justify the expense nor the e-waste.\n\nThere are things I miss but these two things, along with the rug-pull biz strategy of Google, keep me here.",
              "score": -1,
              "created_utc": 1731588564.0,
              "replies": []
            },
            {
              "id": "lx2wzwm",
              "author": "None",
              "body": "[deleted]",
              "score": -6,
              "created_utc": 1731589534.0,
              "replies": [
                {
                  "id": "lx33p4j",
                  "author": "XxZITRONxX",
                  "body": "That was one time, and only because they were moving into 64-bit",
                  "score": 2,
                  "created_utc": 1731592196.0,
                  "replies": []
                },
                {
                  "id": "lx34rxy",
                  "author": "proanimus",
                  "body": "There are plenty of big apps like TikTok and WhatsApp that still actively support iOS 12 on the 11-year-old iPhone 5S.",
                  "score": 1,
                  "created_utc": 1731592603.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lx4onhr",
          "author": "aeiouLizard",
          "body": "This was the standard for like a decade, where have you been?",
          "score": 1,
          "created_utc": 1731610388.0,
          "replies": []
        },
        {
          "id": "lx3ybgp",
          "author": "-Badger3-",
          "body": "Welcome to Google",
          "score": -2,
          "created_utc": 1731602386.0,
          "replies": []
        },
        {
          "id": "lx4lt3b",
          "author": "RabidSeason",
          "body": "Thankfully I hated the Pixel interface enough to get a Samsung after only a year of owning the 5a.  Feels like a bullet dodged.",
          "score": -2,
          "created_utc": 1731609523.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lx28iw6",
      "author": "Habba84",
      "body": "What makes 5a more iconic than 4a?",
      "score": 64,
      "created_utc": 1731575813.0,
      "replies": [
        {
          "id": "lx3k3qs",
          "author": "None",
          "body": "Last one to use snapdragon before the storm",
          "score": 24,
          "created_utc": 1731597926.0,
          "replies": [
            {
              "id": "lx3yndq",
              "author": "CrocCapital",
              "body": "are the tensor chips bad? sorry, out of the loop",
              "score": 7,
              "created_utc": 1731602489.0,
              "replies": [
                {
                  "id": "lx55xjl",
                  "author": "Strong-Estate-4013",
                  "body": "Terrible for reception until the P9",
                  "score": 8,
                  "created_utc": 1731615692.0,
                  "replies": [
                    {
                      "id": "lxei8ww",
                      "author": "free_dead_puppy",
                      "body": "I HAVE 5G ALL THE TIME FINALLY AND IT IS GLORIOUS",
                      "score": 2,
                      "created_utc": 1731743597.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lx5e78c",
                  "author": "None",
                  "body": "Pixel 6 was horrible but things have improved",
                  "score": 1,
                  "created_utc": 1731618230.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lx6qvuk",
              "author": "rolfraikou",
              "body": "People say they have worse reception. I went from a Pixel 5 to a Pixel 8 and my reception has been exactly the same though.",
              "score": 3,
              "created_utc": 1731633905.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lx45hwt",
          "author": "BaggyOz",
          "body": "They haven't started bricking the wallet functionality on 5a's?",
          "score": 1,
          "created_utc": 1731604587.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lx34x7v",
      "author": "Darwinitan",
      "body": "A good many of them already had an EOL update in the form of motherboard failure. When mine died, Google basically said \"yeah, we know, have a 6a.\"\n\nIt's too bad; as the last Pixel with a headphone jack, I intended to keep the 5afor as long as possible. Which, I guess, I did.",
      "score": 18,
      "created_utc": 1731592658.0,
      "replies": [
        {
          "id": "lx4bya9",
          "author": "DixieMcCall",
          "body": "My 5a did that, I got a 7 for my trouble. I don't miss the headphones jack like I thought I would.",
          "score": 2,
          "created_utc": 1731606542.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lx2dv6z",
      "author": "splittingheirs",
      "body": "I'm still using a 3a and 5a is EOL?",
      "score": 45,
      "created_utc": 1731579422.0,
      "replies": [
        {
          "id": "lx2gw3g",
          "author": "angry_pidgeon",
          "body": "Just looked it up, pixel 5a was released in August 2021 so it's only 3 years old!",
          "score": 24,
          "created_utc": 1731581362.0,
          "replies": []
        },
        {
          "id": "lx3nr7b",
          "author": "assissippi",
          "body": "The 3a is also EOL. It will still work but you stopped getting security updates a while ago. \n\nhttps://support.google.com/nexus/answer/4457705?hl=en",
          "score": 11,
          "created_utc": 1731599080.0,
          "replies": []
        },
        {
          "id": "lx3x8eh",
          "author": "rafabr4",
          "body": "Man I swear my old 3a (still in the drawer) takes better pictures than my base Galaxy S23. I just loved that phone, the squeeze feature to turn on the flashlight, the fingerprint in the back (which can be used for swiping down the notification panel), etc. Definitely the battery was never great though, and the processor started to feel slow after some years.",
          "score": 7,
          "created_utc": 1731602052.0,
          "replies": [
            {
              "id": "lx9izxu",
              "author": "BluePeriod_",
              "body": "This is how I feel about my iPhone 7+ and my Xiaomi Mi 3 (2016 and 2013 respectively) - I look at photos I took with those and they blow every phone I've had since out of the water in day shots. I think's it's all the post processing crap they have on these phones now.",
              "score": 2,
              "created_utc": 1731679180.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lx6emx9",
          "author": "void_const",
          "body": "I bought my Pixel 5 in 2020 and it went EOL in 2023.  Never buying another Android phone again after this.  Terrible company.",
          "score": 2,
          "created_utc": 1731629763.0,
          "replies": []
        },
        {
          "id": "lx3da3r",
          "author": "nthexwn",
          "body": "Same, ha!\n\nI had to upgrade off my iPhone 4 after Apple neutered it via forced slowdown updates (after getting caught they claimed they were doing it for the battery life).  Then I had to upgrade off my Samsung Galaxy 6s when they got caught doing the same thing (they didn't make excuses, but had to pay several million in fines to the EU while continuing to pull the same criminal shit over here).  Now I'm just waiting for Google to go full evil and do it to this phone too.  To their credit, they're letting this perfectly adequate hardware live a lot longer than those other companies ever did...",
          "score": -5,
          "created_utc": 1731595664.0,
          "replies": [
            {
              "id": "lx40nvv",
              "author": "-Badger3-",
              "body": "1. That didn't affect the iPhone 4, it was limited to the iPhone 6, 7, and SE. The iPhone 4 had stopped being supported years before this was even a thing.\n\n2. It literally made people's phones last *longer.* The issue was the degraded batteries not being able to provide enough voltage to prevent the OS from crashing, so they pushed an update that would underclock the processor to a stable speed.",
              "score": 2,
              "created_utc": 1731603102.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lx3sqps",
      "author": "Avenger772",
      "body": "Oh no, I have a pixel 5a\n\nOh well.imgoing to keep it until the battery dies.",
      "score": 14,
      "created_utc": 1731600648.0,
      "replies": []
    },
    {
      "id": "lx34p7g",
      "author": "dude_from_ATL",
      "body": "Just give me back my headphone jack!",
      "score": 14,
      "created_utc": 1731592574.0,
      "replies": [
        {
          "id": "lx45mji",
          "author": "silon",
          "body": "And rear fingerprint sensor.",
          "score": 10,
          "created_utc": 1731604626.0,
          "replies": [
            {
              "id": "lx4hc8x",
              "author": "None",
              "body": "Ooh, my LG G6 had that and I really miss it.",
              "score": 2,
              "created_utc": 1731608173.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lx4rvvx",
          "author": "i_suckatjavascript",
          "body": "I’m still hanging on to my iPhone 6S Plus because of this",
          "score": 1,
          "created_utc": 1731611375.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lx3ajtx",
      "author": "Dragonheadthing",
      "body": "If only my 5a (and the replacement) didn't die after a year due to a known motherboard problem. :( I liked that phone. Had great camera, battery life, interface, and a headphone jack.",
      "score": 6,
      "created_utc": 1731594708.0,
      "replies": []
    },
    {
      "id": "lx257uc",
      "author": "BobbyP27",
      "body": "But I thought it was Apple who were the bad guys for planned obsolescence. My iPhone 6S is still getting security updates.",
      "score": 97,
      "created_utc": 1731573550.0,
      "replies": [
        {
          "id": "lx4qjvi",
          "author": "i_suckatjavascript",
          "body": "How do you still get updates? I thought they stopped",
          "score": 7,
          "created_utc": 1731610966.0,
          "replies": [
            {
              "id": "lx4rpau",
              "author": "BobbyP27",
              "body": "It appears I am a few months out of date. The most recent iOS version the 6S can use is 15, and the last update for that was 15.8.3, that came out in July this year. I guess I need to retire  that phone.",
              "score": 9,
              "created_utc": 1731611318.0,
              "replies": [
                {
                  "id": "lx4s8wo",
                  "author": "i_suckatjavascript",
                  "body": "Nooooooo don’t retire it LOL I just use mine like an iPod touch now to listen to music with the headphone jack and my primary phone is the iPhone 11 Pro Max lol",
                  "score": 3,
                  "created_utc": 1731611486.0,
                  "replies": [
                    {
                      "id": "lx4sowh",
                      "author": "BobbyP27",
                      "body": "It is honestly the best value for money I have ever got out of a phone. It will have a cherished spot in my museum of obsolete tech (my desk drawer).",
                      "score": 3,
                      "created_utc": 1731611623.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lx27lsa",
          "author": "bardnotbanned",
          "body": "Myst be nice to have a secure phone for the 20 minutes you have before your battery dies :-x",
          "score": -56,
          "created_utc": 1731575187.0,
          "replies": [
            {
              "id": "lx29o2a",
              "author": "notjordansime",
              "body": "I had the same model (6S) I replaced the battery myself and it was good as new 🤙\n\nAdmittedly battery swaps aren’t as easy nowadays but I’d argue it doesn’t really matter. I have an iPhone 13 mini that I got used. Mini iPhones have notoriously bad battery lives. When I plugged it in at 3:50 AM, it was at 5%. Currently sitting at 70% at 4:25. 65% charge in 35 mins ain’t friggin bad. I just have a portable power bank in my purse and it’s never been an issue.",
              "score": 28,
              "created_utc": 1731576596.0,
              "replies": []
            },
            {
              "id": "lx27w2e",
              "author": "BobbyP27",
              "body": "Granted the battery life wasn't great, but for the use case I have for it, it's fine. I need a work phone separate from my personal one, so using my old 6S for that purpose is fine. I don't generally need to use it when I don't have ready access to power, so the battery life is not all that important.",
              "score": 23,
              "created_utc": 1731575383.0,
              "replies": []
            },
            {
              "id": "lx2jd09",
              "author": "madjohnvane",
              "body": "Well 2016 was a long time ago, show me another heavily used phone from 2016 with great battery life? Sheesh, what a silly comment",
              "score": 15,
              "created_utc": 1731582847.0,
              "replies": []
            },
            {
              "id": "lx2avqc",
              "author": "nefariousnun",
              "body": "You know batteries can be replaced and don’t cost much right?",
              "score": 21,
              "created_utc": 1731577425.0,
              "replies": [
                {
                  "id": "lx2wn8v",
                  "author": "newsflashjackass",
                  "body": "I get the impression they are an Apple buyer, so they may not know that.",
                  "score": -17,
                  "created_utc": 1731589389.0,
                  "replies": [
                    {
                      "id": "lx31viy",
                      "author": "nefariousnun",
                      "body": "Probably not something most people do but I just got the battery replaced in my iPhone 11 Pro two days ago for €75 by an Apple reseller, so the phone should be good for a few more years",
                      "score": 6,
                      "created_utc": 1731591496.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lx34rdb",
              "author": "SOEsucksbad",
              "body": "You know you can replace the battery yourself... it takes about half an hour.",
              "score": 5,
              "created_utc": 1731592597.0,
              "replies": [
                {
                  "id": "lx3k7v4",
                  "author": "None",
                  "body": "It took about 10 seconds when phones have removable back covers.",
                  "score": -3,
                  "created_utc": 1731597962.0,
                  "replies": [
                    {
                      "id": "lx3mz1y",
                      "author": "SOEsucksbad",
                      "body": "I agree that sucks and wish they'd change that, but short of federal or EU legislation, no one will.",
                      "score": 1,
                      "created_utc": 1731598835.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lx2m4zk",
              "author": "labria86",
              "body": "Weird. I have had my Pixel 6 for 3 years and am surprised how solid the battery is. I assume it's partly because of adaptive charging.",
              "score": 1,
              "created_utc": 1731584413.0,
              "replies": [
                {
                  "id": "lx4duji",
                  "author": "bardnotbanned",
                  "body": "Your Pixel 6 is not an IPhone 6s",
                  "score": 2,
                  "created_utc": 1731607110.0,
                  "replies": []
                },
                {
                  "id": "lx3au5u",
                  "author": "proanimus",
                  "body": "I’ve noticed that the batteries in my family’s phones have also been holding up a little better in recent years compared to our older phones. I assumed the same as you, that the newer charging features have made a difference over time.\n\nMine is at 85% health after more than 700 charge cycles, which I think is pretty great.",
                  "score": 1,
                  "created_utc": 1731594812.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lx3cmmc",
      "author": "None",
      "body": "Was a Pixel/Nexus loyalist since the early Nexus days. I live in a warm country. Upgraded to the 7P and got a 5a from the US as a backup phone. The 7P used to get so hot that it was unbearable to use in 33-35 degree Celsius weather + all the signal issues. The 5a ran perfectly, and is still my backup phone. Moved to using an iPhone, will not go back unless Google gets rid of the Tensor-Samsung trash.",
      "score": 13,
      "created_utc": 1731595440.0,
      "replies": [
        {
          "id": "lx614xp",
          "author": "FireLucid",
          "body": "2025 might be the year for you, Tensor is rumoured to be made in the TSMC next year.",
          "score": 1,
          "created_utc": 1731625319.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lx44ljl",
      "author": "baldersz",
      "body": "\"we must reduce ewaste\"\n\nAlso\n\n\"Your phone is obsolete after 3 years\"\n\nI am still using my pixel 5 and it's perfectly fine 🤦🏻‍♂️",
      "score": 5,
      "created_utc": 1731604312.0,
      "replies": []
    },
    {
      "id": "lx3klgn",
      "author": "sutree1",
      "body": "I have a 7, and I hate this phone so goddamned much. It was a free promotion, and I want my money back.",
      "score": 3,
      "created_utc": 1731598082.0,
      "replies": []
    },
    {
      "id": "lx3fbjc",
      "author": "shiftdrift",
      "body": "My 5a was absolute garbage, it would overheat recording video (no case) in under 2 minutes.",
      "score": 3,
      "created_utc": 1731596351.0,
      "replies": []
    },
    {
      "id": "lx4oiln",
      "author": "cryfest",
      "body": "Dead pixel?",
      "score": 3,
      "created_utc": 1731610347.0,
      "replies": []
    },
    {
      "id": "lx4rjic",
      "author": "thelingererer",
      "body": "Having a dedicated fingerprint reader on the back of the phone along with a headphone jack was great.",
      "score": 3,
      "created_utc": 1731611268.0,
      "replies": []
    },
    {
      "id": "lx4csew",
      "author": "Iluvembig",
      "body": "“Apple has planned obsolescence!”\n\nMeanwhile, 10 year old iPhones still getting major updates.\n\nWhile Google touted “three years of updates guanteed!” As a marketing tactic.\n\nThen kill the phones after 3 years 😂",
      "score": 10,
      "created_utc": 1731606794.0,
      "replies": []
    },
    {
      "id": "lx22hv5",
      "author": "a_Ninja_b0y",
      "body": "TL;DR\n\n\n- The Pixel 5a is reportedly getting a new update, which could be the farewell update Google traditionally rolls out to end-of-life devices.\n\n\n- The update is minor and reportedly includes security improvements and bug fixes.",
      "score": 14,
      "created_utc": 1731571701.0,
      "replies": [
        {
          "id": "lx2rwkn",
          "author": "DragonQ0105",
          "body": "This is the kind of nonsense that makes \"news\" on these trash websites.",
          "score": 17,
          "created_utc": 1731587301.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lx3c6wu",
      "author": "Mr-Klaus",
      "body": "The Pixel 6 Pro on my desk:\n\n![gif](giphy|LRVnPYqM8DLag)",
      "score": 2,
      "created_utc": 1731595290.0,
      "replies": []
    },
    {
      "id": "lx3qphu",
      "author": "Virtual-Stretch7231",
      "body": "I got the original pixel when I came out. Switched from Apple to Google just to try it. Google is the most fickle company ever and after that experience I will never ever buy one of their hardware products again. Switched back to Apple and I’m just kinda with them to stay at this point.",
      "score": 2,
      "created_utc": 1731600006.0,
      "replies": []
    },
    {
      "id": "lx425na",
      "author": "None",
      "body": "Hey. That's my phone",
      "score": 2,
      "created_utc": 1731603556.0,
      "replies": []
    },
    {
      "id": "lx39noc",
      "author": "blacksoxing",
      "body": "This headline was written in the same vein of those \"made you look\" billboards.",
      "score": 3,
      "created_utc": 1731594390.0,
      "replies": []
    },
    {
      "id": "lx610ey",
      "author": "silver_sofa",
      "body": "Must be cool to sell things that you can later destroy by remote control.",
      "score": 3,
      "created_utc": 1731625279.0,
      "replies": []
    },
    {
      "id": "lx34xvw",
      "author": "Captain_Cockerels",
      "body": "I'm still using my pixel 3",
      "score": 2,
      "created_utc": 1731592665.0,
      "replies": [
        {
          "id": "lx4tg0h",
          "author": "pygmy",
          "body": "pixel 2xl crew represent 😅",
          "score": 3,
          "created_utc": 1731611855.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lx5u78v",
      "author": "Osiris_Raphious",
      "body": "every 'last' update i have ever had on a device, has been one designed to make the device so horrible to use that you are driven to buy a new one... Like planned obsolescence. Happened to my Galaxy s2, Note 4, Note 6, Nokia, Iphone 13, Pixel. ..... List goes on and on. \n\nIts like they rely on this illusion of massive improvement because of artificial software manipulation.",
      "score": 2,
      "created_utc": 1731623140.0,
      "replies": [
        {
          "id": "lx8mrxk",
          "author": "MexGrow",
          "body": "Yup, got a 4a here. Amazing phone: long battery life, super good performance. \n\n\nThat is, until Google wouldn't stop pestering me to update to Android 14.I did it because of all the nagging and now my phone is significantly worse.",
          "score": 1,
          "created_utc": 1731664054.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lx3ld5j",
      "author": "KilowogTrout",
      "body": "The last pixel that I enjoyed, despite its many problems. It was my favorite form factor of any pixel phone.",
      "score": 1,
      "created_utc": 1731598327.0,
      "replies": []
    },
    {
      "id": "lx67176",
      "author": "Eldestruct0",
      "body": "I already replaced mine after it randomly died earlier this year and wouldn't boot up.",
      "score": 1,
      "created_utc": 1731627234.0,
      "replies": []
    },
    {
      "id": "lx7szzz",
      "author": "bonebrah",
      "body": "Wait but I'm still using pixel 4a?",
      "score": 1,
      "created_utc": 1731647708.0,
      "replies": [
        {
          "id": "lx831gf",
          "author": "a_Ninja_b0y",
          "body": "It's a sign to finally upgrade, I guess.",
          "score": 0,
          "created_utc": 1731652611.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lx99fwh",
      "author": "None",
      "body": "The 25 customers they ever had are going to be happy",
      "score": 1,
      "created_utc": 1731675635.0,
      "replies": []
    },
    {
      "id": "lxiwq5o",
      "author": "lrp1991",
      "body": "Is there such thing as an iconic pixel? 😂",
      "score": 1,
      "created_utc": 1731806527.0,
      "replies": []
    },
    {
      "id": "lx39v5j",
      "author": "LowDownSkankyDude",
      "body": "Has anyone else noticed the gradual disappearance of actually owning things? Our purchases are either permission to use something, or we buy something that will be near obsolete shortly after we start to actually enjoy it.",
      "score": 0,
      "created_utc": 1731594465.0,
      "replies": []
    },
    {
      "id": "lx4prev",
      "author": "Unrelated_gringo",
      "body": "That's incredibly cheap of them, bunch of greedy bastards.",
      "score": 1,
      "created_utc": 1731610723.0,
      "replies": []
    },
    {
      "id": "lx2srq2",
      "author": "Drogon___",
      "body": "The what now? Didn’t even know it existed.",
      "score": -1,
      "created_utc": 1731587703.0,
      "replies": []
    }
  ]
}