{
  "post": {
    "title": "Sony's A1 II features a dedicated AI processor and refined ergonomics",
    "author": "a_Ninja_b0y",
    "id": "1gv2s08",
    "score": 372,
    "created_utc": 1732037543.0,
    "selftext": "",
    "num_comments": 68,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gv2s08/sonys_a1_ii_features_a_dedicated_ai_processor_and/"
  },
  "comments": [
    {
      "id": "ly1o3f8",
      "author": "dirtfondler",
      "body": "I had a DP show up to a shoot with the gen 1 A1, and I was skeptical. He delivered some truly stunning 8K shots, and I was floored. I’m sure the gen 2 is even better. I know this isn’t built as a cinema camera, but it delivers.",
      "score": 24,
      "created_utc": 1732074510.0,
      "replies": []
    },
    {
      "id": "lxyoazj",
      "author": "martijnonreddit",
      "body": "Seeing how the iPhone employs ‘computational photography’ I consider this a good thing. AI is an awful buzzword but I assume this is not Dall-E in your camera.",
      "score": 148,
      "created_utc": 1732039298.0,
      "replies": [
        {
          "id": "lxytlv1",
          "author": "Xavier9756",
          "body": "It unfortunately has become a massive buzzword.",
          "score": 51,
          "created_utc": 1732040854.0,
          "replies": []
        },
        {
          "id": "lxz3jbz",
          "author": "Blackzone70",
          "body": "The AI processor in Sony cameras have nothing to do with computation photography or HDR. They are solely for more advanced subject detection for improved autofocus on things like humans, birds/animals, insects, and various vehicles.",
          "score": 150,
          "created_utc": 1732043778.0,
          "replies": [
            {
              "id": "lyfbp0q",
              "author": "FarhadTowfiq",
              "body": "Require less skill, open up to a bigger market",
              "score": 1,
              "created_utc": 1732288536.0,
              "replies": [
                {
                  "id": "lygv5ab",
                  "author": "Richard_Butler",
                  "body": "Or deliver an even higher hit-rate to those that do have the requisite skills.",
                  "score": 2,
                  "created_utc": 1732305788.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ly2917i",
          "author": "Projectrage",
          "body": "It has become selfie aware.",
          "score": 11,
          "created_utc": 1732084432.0,
          "replies": []
        },
        {
          "id": "ly3xk0k",
          "author": "Cbergs",
          "body": "Keep any of that iPhone post processing off my cameras. My iPhone photos look like photoshopped images most of the time.",
          "score": 14,
          "created_utc": 1732115500.0,
          "replies": [
            {
              "id": "lyh2wgj",
              "author": "Bridgebrain",
              "body": "For real. Android too. Its nice to have available, but it should be optional. ",
              "score": 1,
              "created_utc": 1732308291.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ly5ri56",
          "author": "PM_ME_CALF_PICS",
          "body": "I wish I could turn off the post processing on my iphone.",
          "score": 3,
          "created_utc": 1732139520.0,
          "replies": [
            {
              "id": "lyaqzf7",
              "author": "BranTheUnboiled",
              "body": "You can't take RAW?",
              "score": 2,
              "created_utc": 1732219094.0,
              "replies": [
                {
                  "id": "lz7l4sf",
                  "author": "PM_ME_CALF_PICS",
                  "body": "Nah 12 mini no raw support. Got it after my iphone x, camera is way worse.",
                  "score": 1,
                  "created_utc": 1732692888.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lxyw19x",
          "author": "JCAMAR0S117",
          "body": "If it's anything like the new Canon R5 II, it'll be a couple half baked features that nobody will ever use, but it won't get in way of the actual photo processing",
          "score": -10,
          "created_utc": 1732041569.0,
          "replies": [
            {
              "id": "ly2tyyw",
              "author": "Adam_Meshnet",
              "body": "It's certainly nothing like that! As mentioned by other commenters, the AI processing chip is used to enhance autofocus. Coming from a smaller APS-C camera, I can safely say that this is a game-changer for shooting videos.",
              "score": 7,
              "created_utc": 1732098023.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lxyloil",
      "author": "dexterthekilla",
      "body": "It's built around the same 50.1mp stacked CMOS sensor as the original",
      "score": 40,
      "created_utc": 1732038531.0,
      "replies": [
        {
          "id": "lxyuqvs",
          "author": "M3msm",
          "body": "That sensor was way ahead of its time. It's also a fantastic sensor and I have no issues that they kept it the same",
          "score": 42,
          "created_utc": 1732041190.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxyw57p",
      "author": "Ivanjatson",
      "body": "I have a D7500 and will say hands down the autofocus is its weakest point, while still not bad. I would welcome this technology to become the baseline in a decade or so.",
      "score": 18,
      "created_utc": 1732041601.0,
      "replies": [
        {
          "id": "lxzgd2v",
          "author": "dc456",
          "body": "The gap between your 7 year old camera and a mid-range mirrorless camera is probably bigger than the gap between mid-range and this camera.\n\nMost of this tech is already readily available - this just refines it. We’re definitely getting into diminishing returns with camera tech now.",
          "score": 33,
          "created_utc": 1732047710.0,
          "replies": [
            {
              "id": "ly2tn9e",
              "author": "HakimeHomewreckru",
              "body": "The one thing holding us back is compressed raw that RED (in hands of Nikon now) is holding hostage behind their patents. It's crazy how a small mirrorless camera like the A7 series can compete with 50k cinema cameras in terms of image quality.",
              "score": 5,
              "created_utc": 1732097809.0,
              "replies": [
                {
                  "id": "ly2tqwu",
                  "author": "dc456",
                  "body": "Can’t imagine that’s much of an issue for someone currently shooting on a D7500, though!",
                  "score": 2,
                  "created_utc": 1732097876.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lyh4d9d",
              "author": "Bridgebrain",
              "body": "Yeah, we peaked at pretty much 20mp at 4k. Sure, you can go bigger and bigger, but what you're really doing is giving yourself room for digital zoom/cropping and eliminating other bottlenecks more than getting an actually better picture. Pretty much no one can distinguish between displays are above 4k, and no one prints above 900dpi, so unless your photo is being shown or printed at a giant scale, its just wasted quality. ",
              "score": 1,
              "created_utc": 1732308759.0,
              "replies": []
            },
            {
              "id": "ly4uomn",
              "author": "AbhishMuk",
              "body": "Are you saying modern mid ranges are very good, or old top models still hold their value? (I’m not very familiar with cameras anymore but I thought the old wisdom was to buy a few years old top model.)",
              "score": 1,
              "created_utc": 1732125774.0,
              "replies": [
                {
                  "id": "ly4urj4",
                  "author": "dc456",
                  "body": "The former.\n\nThe D7500 is neither a few years old, nor a top model.",
                  "score": 2,
                  "created_utc": 1732125799.0,
                  "replies": [
                    {
                      "id": "ly4vede",
                      "author": "AbhishMuk",
                      "body": "Thanks! I guess sensor tech has mostly matured and it’s processing power giving more benefits nowadays?",
                      "score": 1,
                      "created_utc": 1732125993.0,
                      "replies": [
                        {
                          "id": "ly4vt24",
                          "author": "dc456",
                          "body": "It’s more the fundamentally different way that DSLRs and mirrorless handle autofocus. A modern mid-range mirrorless has a wealth of autofocus capabilities and features that are essentially impossible on *any* DSLR, let alone a 7 year old mid range one.",
                          "score": 2,
                          "created_utc": 1732126115.0,
                          "replies": [
                            {
                              "id": "ly4x74j",
                              "author": "AbhishMuk",
                              "body": "Thanks, wasn’t aware of that. IMO I (kinda) hate the absence of an optical viewfinder and was aiming to eventually buy a DSLR… but I’ll probably rethink that when I reach there.",
                              "score": 1,
                              "created_utc": 1732126539.0,
                              "replies": [
                                {
                                  "id": "ly4xfc5",
                                  "author": "dc456",
                                  "body": "I prefer optical viewfinders too, but DSLRs are an evolutionary dead-end, so will always be cut off from a lot of mirrorless features.",
                                  "score": 2,
                                  "created_utc": 1732126608.0,
                                  "replies": [
                                    {
                                      "id": "ly4y6ky",
                                      "author": "AbhishMuk",
                                      "body": "Hmm, just thinking aloud, wouldn’t it be possible to have a DSLR where some light continuously goes to the sensor via something like those partially reflecting mirror-things, allowing mirorless like full-sensor autofocus? Though it probably might make it even bulkier..",
                                      "score": 1,
                                      "created_utc": 1732126837.0,
                                      "replies": [
                                        {
                                          "id": "lyba8wy",
                                          "author": "ml20s",
                                          "body": "This is basically the SLT design from Sony on the A-mount.",
                                          "score": 2,
                                          "created_utc": 1732225012.0,
                                          "replies": [
                                            {
                                              "id": "lyd5zy1",
                                              "author": "AbhishMuk",
                                              "body": "> This is basically the SLT design from Sony on the A-mount.\n\nThanks, wasn’t aware! Any idea if it’s any good in practice?",
                                              "score": 1,
                                              "created_utc": 1732249281.0,
                                              "replies": [
                                                {
                                                  "id": "lygxk0c",
                                                  "author": "Richard_Butler",
                                                  "body": "SLT was essentially the opposite of what you suggested. It had a semi-transparent mirror that directed about 1/3rd of the light (~1/2 stop) to an SLR-style focus module, then the other 2/3rds to the main sensor, which provided a live view stream to an EVF. This meant you got DSLR-standard AF speed in both stills and video, which at the time was the desirable outcome.\n\nBut SLR focus is no longer the benchmark for AF. On-sensor phase detection allows mirrorless cameras to focus across most of the image (not just a few fixed points), and with tracking AF and now subject recognition, this is far more flexible and delivers a much higher hit rate than DSLRs could.\n\nIt sounds like you're proposing something slightly different: directing some of the light to an optical viewfinder, while also allowing some through to the sensor (which sounds more like Canon's Pellicle film SLR). I suspect you'd end up either with a viewfinder that was unacceptably dark or an AF system that struggled in anything less than perfect light.\n\nSLT was an interesting idea (and allowed the continued use of DSLR lenses) but it looks even more like a dead-end, now that mirrorless focus (and lenses designed to be focussed that way) is working at the very highest level.",
                                                  "score": 2,
                                                  "created_utc": 1732306568.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "ly5imly",
                                          "author": "dc456",
                                          "body": "Then the viewfinder is darker.  And the sensor still has less light to work with.",
                                          "score": 1,
                                          "created_utc": 1732133044.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ly2zr3a",
          "author": "None",
          "body": "[deleted]",
          "score": 2,
          "created_utc": 1732101614.0,
          "replies": [
            {
              "id": "ly8vor6",
              "author": "BladudFPV",
              "body": "How is it with flying birds? I have a D3600 I rebuilt and it does really well but tracking birds is basically a coin toss. ",
              "score": 1,
              "created_utc": 1732194737.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ly5shl9",
      "author": "slipperyslope69",
      "body": "You still to have a good scene, natural or created lighting, a narrative, good composition… and many more elements to make a good photo or video. This is an expensive, albeit good, tool, with fancy marketing. Nothing more.",
      "score": 2,
      "created_utc": 1732140222.0,
      "replies": []
    },
    {
      "id": "ly35zoe",
      "author": "Fancyness",
      "body": "This camera is hyperexpensive",
      "score": 2,
      "created_utc": 1732104904.0,
      "replies": [
        {
          "id": "ly3v1l8",
          "author": "KZol102",
          "body": "This is Sony's flagship camera, meant for professionals. So don't expect it to be cheap.",
          "score": 7,
          "created_utc": 1732114665.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ly02wrk",
      "author": "rusmo",
      "body": "A one two, a one two!",
      "score": 1,
      "created_utc": 1732054524.0,
      "replies": [
        {
          "id": "ly06qrp",
          "author": "vixalien",
          "body": "I think it’s supposed to be pronounced one mark two",
          "score": 5,
          "created_utc": 1732055735.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ly01phj",
      "author": "minkaiser",
      "body": "Because can detect some specific shapes and lights, and make the camera adjust based on different situations, they call it AI",
      "score": -1,
      "created_utc": 1732054147.0,
      "replies": [
        {
          "id": "ly80y8i",
          "author": "None",
          "body": "[deleted]",
          "score": 2,
          "created_utc": 1732177205.0,
          "replies": [
            {
              "id": "ly8k910",
              "author": "minkaiser",
              "body": "I doubt it is so advanced",
              "score": -1,
              "created_utc": 1732189484.0,
              "replies": [
                {
                  "id": "ly8kcm5",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 2,
                  "created_utc": 1732189535.0,
                  "replies": [
                    {
                      "id": "ly8kkxt",
                      "author": "minkaiser",
                      "body": "That’s what I mean, advanced as proper AI who can be very intuitive, make awesome edits and amazing pic. Still far from there",
                      "score": -1,
                      "created_utc": 1732189656.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lxyk2v4",
      "author": "Kike328",
      "body": "whyyy",
      "score": -20,
      "created_utc": 1732038061.0,
      "replies": [
        {
          "id": "lxynfsj",
          "author": "skyhighrockets",
          "body": "New features at the same price. Would you prefer they just never made new products?",
          "score": 29,
          "created_utc": 1732039045.0,
          "replies": [
            {
              "id": "lxynoq0",
              "author": "Kike328",
              "body": "i would prefer them to innovate in different ways instead to please their ai sick investors",
              "score": -36,
              "created_utc": 1732039117.0,
              "replies": [
                {
                  "id": "lxyo0aa",
                  "author": "skyhighrockets",
                  "body": "It’s for subject recognition and image stablilization, not any kind of image generation or anything like that. But you would know that if you actually opened the article instead of just commenting out of a blanket hate for AI.",
                  "score": 32,
                  "created_utc": 1732039210.0,
                  "replies": [
                    {
                      "id": "lxypgg0",
                      "author": "Kike328",
                      "body": "eh no, the AI is just for the autofocus. So the main selling point for upgrading this 6500$ camera is literally “AI for 50% performance increase in bird focusing”? xd\n\nIt’s just consumerism at its maximum exponent, companies throwing buzzwords to make you believe are buying the cutting edge when is the same thing. Good luck with your enhanced bird focusing device",
                      "score": -42,
                      "created_utc": 1732039635.0,
                      "replies": [
                        {
                          "id": "lxyrjfj",
                          "author": "skyhighrockets",
                          "body": "Not just for birds lmao. This is a flagship camera where improvements in autofocus, subject detection, better IBIS, better articulating screen, better ergonomics, faster ethernet, etc.  all for the same $6.5k price. Stuff that pros have been wanting.  \n\nBetter yet, the older model is now $1k cheaper, and the used market will probably see the old one drop to 3.5-4k price range. \n\nEven if you dont want the new features, this is great news if you wanted what the first one offered.  \n\nIt's fine if you don't personally need it, but that doesnt mean they shouldnt update their flagship with the features cheaper Sony cameras have had for a little while now.",
                          "score": 24,
                          "created_utc": 1732040247.0,
                          "replies": [
                            {
                              "id": "lxz5496",
                              "author": "M3msm",
                              "body": "You're trying to teach something to an idiot... it is a losing battle.",
                              "score": 17,
                              "created_utc": 1732044300.0,
                              "replies": []
                            },
                            {
                              "id": "lxyrm64",
                              "author": "Kike328",
                              "body": "and the article headline is AI",
                              "score": -22,
                              "created_utc": 1732040269.0,
                              "replies": [
                                {
                                  "id": "lxyx3ap",
                                  "author": "PikaV2002",
                                  "body": "Which is irrelevant to the actual product.",
                                  "score": 14,
                                  "created_utc": 1732041878.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lxzb5b0",
              "author": "None",
              "body": "it’s literally a software update and a flip screen. \n\nthis isn’t a mark ii. \nit’s a cop out.",
              "score": -17,
              "created_utc": 1732046126.0,
              "replies": [
                {
                  "id": "lxze9iz",
                  "author": "skyhighrockets",
                  "body": "It's literally not. There's a new CPU/chip that enables: Better subject detection, faster reliable AF, better IBIS. Also: better EVF, great articulating screen, better ergonomics, faster ethernet, new menus, focus stacking, etc.  \n\nJust because you don't feel its enough new features doesn't make it a \"cop out\".   I don't see any other camera that beats it right now",
                  "score": 14,
                  "created_utc": 1732047074.0,
                  "replies": [
                    {
                      "id": "lxzfom6",
                      "author": "None",
                      "body": "do you own an A1? or more than one?\n\nbecause i do, and these upgrades are a slap in the face to the owners of the original to call this a mark ii. \n\nIBIS and, subject and AF are still far above everyone else in the A1 that any “better” upgrades in this are purely hype upgrades and to say they’re “better”\n\nnew menus omg cool, like how the fx3 and a7siii got like 2yrs ago?\n\nall of these “upgrades” could’ve been a software update but instead we got 2 software updates in the lifetime of the A1 that upgraded literally nothing.\n\nin a real world application these “upgrades” are going to be minutely noticeable, if at all.",
                      "score": -14,
                      "created_utc": 1732047504.0,
                      "replies": [
                        {
                          "id": "lxzior9",
                          "author": "skyhighrockets",
                          "body": "Youre right about some of that, but that's not what you said and not what I was replying to. you said this is just a software update on the same chip, which just isnt true.  The new AF and new IBIS require the new chip. Much of what is new categorically cannot have been software updates.   Also, new EVF, new body design, new articulating screen. \n\nIt can be both true that this update is worth it to some pros AND that Sony should update the original A1 with the few software things that it's chip can and should support. \n\nAlso they've definitely added features via firmware, eg. focus breathing compensation, improved IBIS, better flash performance, C2PA, and a whole bunch of workflow improvements here and there. \n\n\"In the real world\" is going to be different for different working photographers.",
                          "score": 6,
                          "created_utc": 1732048407.0,
                          "replies": [
                            {
                              "id": "lxzlc7b",
                              "author": "None",
                              "body": "i said “it’s a software update and a flip screen”\n\ni didnt mention chips. \n\nthis is ***far*** from a mark ii and these minor updates could’ve been pushed as software updates, instead they kept these small “features” from updates for years to just put into a newer model. \n\nanyone upgrading from an A1 to this is just purely wasting money and glazing for sony.",
                              "score": -8,
                              "created_utc": 1732049201.0,
                              "replies": [
                                {
                                  "id": "lxzlvvz",
                                  "author": "skyhighrockets",
                                  "body": "you keep saying that, but that doesnt make it true. the improvements to the subject detction, AF, IBIS, require the new chip, thats why I talk about chips. \n\nAlso lol at you just continuely ignoring the physical upgrades. We get it, you don't think its worth it. It's obnoxious you think that other's being excited about the update means we're just \"glazing for sony\"",
                                  "score": 7,
                                  "created_utc": 1732049365.0,
                                  "replies": [
                                    {
                                      "id": "ly149ja",
                                      "author": "None",
                                      "body": "it uses the same AI processing unit that’s almost 3yrs old, used in the A9iii, A7RV etc, it has the same grip and button layout as the A9iii.\n\nit doesn’t have groundbreaking or new tech in it. \n\nit’s rehoused with a software update and chip that’s already in other units. \n\nlike what?",
                                      "score": -1,
                                      "created_utc": 1732067241.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lxykw69",
          "author": "a_Ninja_b0y",
          "body": "Why not?",
          "score": 5,
          "created_utc": 1732038301.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ly5hgzy",
      "author": "Ghjjfslayer",
      "body": "Will stick with the canon g7x, these are 3 and 6 times the price",
      "score": -2,
      "created_utc": 1732132687.0,
      "replies": []
    },
    {
      "id": "ly029c7",
      "author": "philstein1",
      "body": "The only thing it actually needs is an internal fan",
      "score": -3,
      "created_utc": 1732054319.0,
      "replies": []
    },
    {
      "id": "ly31872",
      "author": "prnalchemy",
      "body": "This should largely have been a firmware update, except the \"AI Chip\".\n\nBut we know Sony likes to fk over their adopters.",
      "score": -5,
      "created_utc": 1732102454.0,
      "replies": []
    },
    {
      "id": "lxyn6m7",
      "author": "None",
      "body": "[deleted]",
      "score": -8,
      "created_utc": 1732038971.0,
      "replies": [
        {
          "id": "lxyucu6",
          "author": "wantsoutofthefog",
          "body": "Don’t even know how to unpack this one. Sure buddy. Go back to shooting a brownie if that ain’t the point.",
          "score": 6,
          "created_utc": 1732041073.0,
          "replies": []
        },
        {
          "id": "lxynrss",
          "author": "skyhighrockets",
          "body": "It's for subject recognition and image stablilization, not any kind of image generation or anything like that. But you would know that if you actually opened the article instead of just commenting out of a blanket hate for AI.",
          "score": 7,
          "created_utc": 1732039141.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxzzj9i",
      "author": "-Gast-",
      "body": "AI Processor? So you dont have full control of what happens? I hated it when the a7r did apply compression to raw files, which they never changed (in the later models they changed it)",
      "score": -15,
      "created_utc": 1732053473.0,
      "replies": [
        {
          "id": "ly0uvdn",
          "author": "devilishpie",
          "body": "Read the article.",
          "score": 6,
          "created_utc": 1732063962.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ly12hgb",
      "author": "Even_Establishment95",
      "body": "And yet more dumb dumbs will think they are photographers",
      "score": -16,
      "created_utc": 1732066619.0,
      "replies": [
        {
          "id": "ly1v6tz",
          "author": "Carrollmusician",
          "body": "Are they holding a camera and taking a photo intentionally? That’s photography.",
          "score": 6,
          "created_utc": 1732077502.0,
          "replies": []
        }
      ]
    }
  ]
}