{
  "post": {
    "title": "Nintendo taps Samsung to make Switch 2 chips in a move that could ramp up production | The deal could lead to 20 million consoles being sold by March 2026, a report says",
    "author": "a_Ninja_b0y",
    "id": "1kr2rrm",
    "score": 1138,
    "created_utc": 1747741421.0,
    "selftext": "",
    "num_comments": 154,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kr2rrm/nintendo_taps_samsung_to_make_switch_2_chips_in_a/"
  },
  "comments": [
    {
      "id": "mta3w18",
      "author": "Chickat28",
      "body": "It was already on the Samsung node. This isn't news.",
      "score": 208,
      "created_utc": 1747741796.0,
      "replies": [
        {
          "id": "mtd75cd",
          "author": "PM_artsy_fartsy_nude",
          "body": "Seems like you didn't read the article. Samsung is now producing the Nvidia-designed chip for the Switch 2, in addition to the memory and displays that they were already producing.\n\nThis is the first I've heard of any non-TSMC company producing Nvidia chips, so that seems notable.",
          "score": 21,
          "created_utc": 1747776095.0,
          "replies": [
            {
              "id": "mtd9cn0",
              "author": "TheChickenStrip",
              "body": "It's not the first. Nvidia's Ampere (aka RTX 3000) chips were also produced by Samsung. Of course the Switch 2 also uses an Ampere chip, so it makes sense.",
              "score": 54,
              "created_utc": 1747776775.0,
              "replies": [
                {
                  "id": "mtdajdv",
                  "author": "PM_artsy_fartsy_nude",
                  "body": "Okay, less notable then. Still, it is new information. Thus: \"news.\"",
                  "score": 5,
                  "created_utc": 1747777150.0,
                  "replies": [
                    {
                      "id": "mte59vw",
                      "author": "nichijouuuu",
                      "body": "How dare you share something that hasn’t been shared before and call it *news*",
                      "score": 5,
                      "created_utc": 1747787615.0,
                      "replies": []
                    },
                    {
                      "id": "mtderdt",
                      "author": "Chickat28",
                      "body": "Confirmed perhaps but we have long suspected 8nm based on leaks and die shots which made Samsung obvious.",
                      "score": 3,
                      "created_utc": 1747778487.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mtd9dx4",
              "author": "Asgard033",
              "body": "> This is the first I've heard of any non-TSMC company producing Nvidia chips, so that seems notable.\n\n\nThe entire RTX 30 series was on 8nm Samsung",
              "score": 13,
              "created_utc": 1747776787.0,
              "replies": []
            },
            {
              "id": "mtettys",
              "author": "CosmicCreeperz",
              "body": "It was leaked a year ago, so no, not notable.",
              "score": 3,
              "created_utc": 1747796444.0,
              "replies": []
            },
            {
              "id": "mth50mw",
              "author": "StarsMine",
              "body": "It… was already Samsung.\n\nAmpere has always been on Samsung.",
              "score": 1,
              "created_utc": 1747836469.0,
              "replies": []
            },
            {
              "id": "mugg4tq",
              "author": "None",
              "body": "Part of the 10 series and all of the 30 series were on Samsung foundry",
              "score": 1,
              "created_utc": 1748316467.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mtad0gj",
          "author": "SMikahla",
          "body": "I'll buy an OLED upgrade if they make one if I can get a decent price out if my Switch 2 being used a couple of years.",
          "score": -37,
          "created_utc": 1747745444.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mta4z9n",
      "author": "MrPatalchu",
      "body": "At first i thought it says \"traps\" Samsung. What dirt do they have on them?",
      "score": 31,
      "created_utc": 1747742254.0,
      "replies": [
        {
          "id": "mteuta7",
          "author": "98VoteForPedro",
          "body": "They have the princess",
          "score": 6,
          "created_utc": 1747796827.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mta5anf",
      "author": "None",
      "body": "Might be necessary considering a month on in, the official Nintendo store in Europe hasnt even started processing orders for the console",
      "score": 27,
      "created_utc": 1747742386.0,
      "replies": [
        {
          "id": "mtbk2yn",
          "author": "Remy0507",
          "body": "I wouldn't really expect to start seeing orders processed until maybe the week before they actually ship.",
          "score": 7,
          "created_utc": 1747758803.0,
          "replies": []
        },
        {
          "id": "mtb14dn",
          "author": "orangpelupa",
          "body": "Early leaks says it's already on Samsung fabs. So not sure how this will address the supply ",
          "score": 5,
          "created_utc": 1747753230.0,
          "replies": [
            {
              "id": "mtb86gu",
              "author": "Gamebird8",
              "body": "I would have to assume that it perhaps is talking about support processors that are not onboard the main SOC, like VRAM for example.  \n\nBut who knows, maybe this is just someone trying to get clicks because the Switch 2 is a hot button topic",
              "score": 3,
              "created_utc": 1747755295.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mtga59f",
          "author": "repocin",
          "body": "Why would they have? Order policy says they charge your payment method 7-14 days before shipping and we're still a bit off from that.\n\nAnd fwiw, I got an email from them last week saying that they'll start processing my order soon. (ordered from Nintendo DE)",
          "score": 1,
          "created_utc": 1747824806.0,
          "replies": [
            {
              "id": "mtgamug",
              "author": "None",
              "body": "Because on preorder it specifically says payments can start from 31 days before release date. It is normally 7 days, this one time that is not the case",
              "score": 1,
              "created_utc": 1747825043.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mta8oim",
      "author": "Sroemr",
      "body": "Oh so the price will go down then, right?\n\n...right?",
      "score": 23,
      "created_utc": 1747743760.0,
      "replies": [
        {
          "id": "mtaaays",
          "author": "None",
          "body": "[deleted]",
          "score": 18,
          "created_utc": 1747744406.0,
          "replies": [
            {
              "id": "mtda50o",
              "author": "NRMusicProject",
              "body": "I think a lot of people might not buy with the idea that Nintendo just said they can remotely brick your console at their discretion.",
              "score": 9,
              "created_utc": 1747777024.0,
              "replies": [
                {
                  "id": "mtg63fe",
                  "author": "gosukhaos",
                  "body": "Are people new at the whole console thing? Manufacturers bricking consoles for illicit activities has been a thing since the Xbox 360",
                  "score": 3,
                  "created_utc": 1747822680.0,
                  "replies": [
                    {
                      "id": "mtm7hag",
                      "author": "bonesnaps",
                      "body": "Emulation isn't solely used for illicit activities.\n\n\nAnd they can only ban you from online services, bricking your electronics is against the law in civilized nations like the EU (everyone else can get fucked I guess, rip).",
                      "score": 1,
                      "created_utc": 1747898153.0,
                      "replies": [
                        {
                          "id": "mtm85je",
                          "author": "gosukhaos",
                          "body": "Illicit like hacking your console to play pirated games",
                          "score": 1,
                          "created_utc": 1747898552.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mtanjhj",
          "author": "RagefireHype",
          "body": "Hot take: The price is fine. Do people really think it’s a 350 dollar console? They basically added on 50 dollars and accounted for inflation from the original Switch launch which is fair considering it’s 7x more powerful than the Switch.",
          "score": 24,
          "created_utc": 1747749106.0,
          "replies": [
            {
              "id": "mtaun2l",
              "author": "GrayDaysGoAway",
              "body": "I'm not mad about it or anything, but IMO it's more than a bit ridiculous that the Switch 2 costs more than a PS5 does.\n\nOf course it wouldn't be so offensive if they weren't also doing $80 games. Which will *never* go on sale.",
              "score": 4,
              "created_utc": 1747751324.0,
              "replies": [
                {
                  "id": "mtbkyf5",
                  "author": "Remy0507",
                  "body": "It's hard to compare directly like that. Yes, the price is comparable to a base PS5, and yes the PS5 is more powerful. But the Switch is a handheld device. Building a mobile device like that introduces design challenges that aren't present when building a full-sized console. The Switch 2 also has a high quality display built in, which is a non-trivial additional cost. \n\nAnd the Switch 1 cost as much as PS4 at the time it launched, in spite of also being a much less powerful device.",
                  "score": 7,
                  "created_utc": 1747759061.0,
                  "replies": [
                    {
                      "id": "mtby9qy",
                      "author": "GrayDaysGoAway",
                      "body": "Switches aren't really handhelds imo. The undocked performance and battery capacity flat out *suck.* And I was of the opinion that the OG Switch was priced above what it should have been, too.",
                      "score": -6,
                      "created_utc": 1747762856.0,
                      "replies": [
                        {
                          "id": "mtc5ekq",
                          "author": "Remy0507",
                          "body": "It's in a handheld form factor, which is what restricts the power of the components involved. The fact that it runs at higher clock speeds when it's plugged into power doesn't really change all that much about its capabilities. \n\nAnd I don't know what you think an appropriate price would be. A mid-range Android tablet costs as much as a Switch.",
                          "score": 10,
                          "created_utc": 1747764900.0,
                          "replies": [
                            {
                              "id": "mtc9zvn",
                              "author": "GrayDaysGoAway",
                              "body": "> It's in a handheld form factor\n\nWhich goes back to what I said in another comment, Switches are jack of all trades master of none devices. Docked or handheld they're just subpar in virtually every possible way. Every aspect of them is a compromise.\n\nI honestly think the Switch should be around $250-$275. Recent years' iPads go for sub-$300 every day of the week and have vastly superior hardware to the Switch.",
                              "score": -1,
                              "created_utc": 1747766251.0,
                              "replies": [
                                {
                                  "id": "mtcmcka",
                                  "author": "Remy0507",
                                  "body": "I mean if you're argument is that the original Switch should cost less than $300 NOW, then I'd agree. The reason it doesn't? Because people keep buying it.\n\nI don't think $300 at launch was a bad price for it though, and I don't think $450 for the Switch 2 at launch is a bad price either, given the current economic climate.",
                                  "score": 7,
                                  "created_utc": 1747769886.0,
                                  "replies": [
                                    {
                                      "id": "mtcp5om",
                                      "author": "GrayDaysGoAway",
                                      "body": "Oh I'm well aware of why it doesn't go down in price. Same for why Nintendo games never have signifigant discounts. Doesn't mean I'm ok with it though.\n\nYeah $300 at launch for the OG wasn't bad. I do think $450 for the new one is bad, though. Its specs don't come anywhere near justifying that price imo. \n\nAnd the fact that they're double dipping on price increases with the $80 games just makes it that much worse and less acceptable to me.",
                                      "score": 0,
                                      "created_utc": 1747770727.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mtd0pma",
                                      "author": "MerryDingoes",
                                      "body": "I think people also forget that Nintendo usually don't sell consoles at a loss, unlike Sony and Microsoft with their consoles. That's a rather smart financial decisions, on top of them knowing that games sells consoles, which we've known that Microsoft really failed in the past two generations, and Sony seem to recently rebound with the PS5",
                                      "score": 0,
                                      "created_utc": 1747774150.0,
                                      "replies": [
                                        {
                                          "id": "mtd296r",
                                          "author": "Remy0507",
                                          "body": "Yep, Nintendo likes making a profit on everything they sell. And honestly, they're well within their rights to do that! People are obviously willing to buy their products, so there's no reason they should start selling them for a loss. Now, if they start missing their sales targets maybe they need to rethink some things. But they just recently passed $100 billion in market cap for the first time ever, so there really isn't much incentive for them to change their business model at the moment.",
                                          "score": 1,
                                          "created_utc": 1747774599.0,
                                          "replies": [
                                            {
                                              "id": "mtd8jsi",
                                              "author": "PM_artsy_fartsy_nude",
                                              "body": "> Now, if they start missing their sales targets maybe they need to rethink some things.\n\nThey already decided to eat the tariffs on the main console and only raised prices on accessories. It wouldn't surprise me if they're now selling the consoles at a small loss, given that. The consoles are always low margin.",
                                              "score": 2,
                                              "created_utc": 1747776527.0,
                                              "replies": []
                                            },
                                            {
                                              "id": "mtd6rok",
                                              "author": "MerryDingoes",
                                              "body": "Yep, I agree with everything that you said. My friend is learning Japanese atm, and he read the news how Nintendo contributes to something like 3% of Japan's GDP. They don't have the historical influence that Samsung has on Korea, but a lot is still riding on them to be successful",
                                              "score": 1,
                                              "created_utc": 1747775978.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mtbv78d",
                  "author": "None",
                  "body": "The ps5 is going up in price tho?\n\nATP the only affordable way to game is look for used pc builds. You can find something that competes with a ps5 for a decent price when the market gets more stable and the games are dirt cheap.",
                  "score": 8,
                  "created_utc": 1747761992.0,
                  "replies": [
                    {
                      "id": "mtby1jd",
                      "author": "GrayDaysGoAway",
                      "body": "Sony said it *might* be going up in price. But that was in response to ridiculous tariffs which probably aren't going to really be a thing at this point, so I doubt it will.",
                      "score": -3,
                      "created_utc": 1747762790.0,
                      "replies": [
                        {
                          "id": "mtbyptq",
                          "author": "iLaurens",
                          "body": "Prices already went up by 50 euro on April 14th in Europe in response to the US tarrifs. Makes sense right?",
                          "score": 6,
                          "created_utc": 1747762980.0,
                          "replies": [
                            {
                              "id": "mtbzp2d",
                              "author": "GrayDaysGoAway",
                              "body": "Very little about our economic system is making sense to me at this point tbh.",
                              "score": 1,
                              "created_utc": 1747763256.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mtb4wod",
                  "author": "TingleyStorm",
                  "body": "> it’s more than a bit ridiculous that the Switch 2 costs more than a PS5 does.\n\n…what?\n\nA base PS5 is $450 retail for the digital only version, $500 to play physical games. In order to play remotely, you need a $200 accessory that has a 1080p, 60hz LCD screen.\n\nThe Switch 2 is $450 retail and can play physical games. In order to play remotely, you just remove it from its dock to play on a 1080p@60hz/720p@120hz LCD screen. That’s a $250 savings over the PS5",
                  "score": 6,
                  "created_utc": 1747754337.0,
                  "replies": [
                    {
                      "id": "mtbpsmb",
                      "author": "SaltyStU2",
                      "body": "You can remote play your PS5 without an accessory btw. It’s literally a phone app",
                      "score": -3,
                      "created_utc": 1747760449.0,
                      "replies": []
                    },
                    {
                      "id": "mtc3yiu",
                      "author": "flycasually",
                      "body": "i thought the switch 2 doesnt play physical games? when you buy physical games, it just gives you a code to download it online",
                      "score": -4,
                      "created_utc": 1747764481.0,
                      "replies": [
                        {
                          "id": "mtda6zs",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 5,
                          "created_utc": 1747777041.0,
                          "replies": []
                        },
                        {
                          "id": "mtd82wr",
                          "author": "ARGHETH",
                          "body": "That's false, only some are. Notably, Cyberpunk is going to be an actual cartridge, according to a company exec.",
                          "score": 2,
                          "created_utc": 1747776383.0,
                          "replies": [
                            {
                              "id": "mtd8zp2",
                              "author": "flycasually",
                              "body": "So it’s not really false if it’s true for some games at the very least\n\nDon’t know or care enough to look up whether your statement is accurate since I don’t plan on getting the console anyway",
                              "score": -2,
                              "created_utc": 1747776664.0,
                              "replies": [
                                {
                                  "id": "mtda1i9",
                                  "author": "ARGHETH",
                                  "body": "> i thought the switch 2 doesnt play physical games? \n\nThis statement is literally false though",
                                  "score": 3,
                                  "created_utc": 1747776994.0,
                                  "replies": [
                                    {
                                      "id": "mtdmau8",
                                      "author": "flycasually",
                                      "body": "Okay I’ll take your word for it",
                                      "score": 0,
                                      "created_utc": 1747781012.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mtd95gy",
                          "author": "PM_artsy_fartsy_nude",
                          "body": "There was an article pointing out that most of the third party launch titles are going to do that. But most of the third party launch titles are just ports anyway. We'll see if that turns into a common practice.\n\nRegardless, all the titles which do that come with big warnings on the package. So at least you know which games to avoid.",
                          "score": 1,
                          "created_utc": 1747776713.0,
                          "replies": []
                        },
                        {
                          "id": "mtc5zg8",
                          "author": "CrossbowSpook",
                          "body": "You also don't own the console (or games), only the rights to use it. Nintendo can remotely brick modded switch 2's.",
                          "score": -5,
                          "created_utc": 1747765070.0,
                          "replies": [
                            {
                              "id": "mtc7aku",
                              "author": "TingleyStorm",
                              "body": "They could and did do that with the Switch too. That’s nothing new.",
                              "score": 6,
                              "created_utc": 1747765457.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mtb6m0n",
                      "author": "GrayDaysGoAway",
                      "body": "Frankly, I don't care about remote play. If anything it's emblematic of the problems with the Switch 2. It's a jack of all trades master of none. It's mediocre as a docked console, and mediocre as a standalone handheld. But they want top dollar for it and its games. That's not real cool.\n\nAlso, virtually nobody outside of reddit gives a shit about physical media anymore. That is not a selling point for the vast majority of the market.",
                      "score": -15,
                      "created_utc": 1747754837.0,
                      "replies": [
                        {
                          "id": "mtb721x",
                          "author": "TingleyStorm",
                          "body": "No no no, you go back and tell me how a PS5 is somehow cheaper than a Switch 2. That’s what your complaint was and it’s a blatant lie.",
                          "score": 11,
                          "created_utc": 1747754968.0,
                          "replies": [
                            {
                              "id": "mtb79f7",
                              "author": "GrayDaysGoAway",
                              "body": "It literally is lol. I can go buy a PS5 bundle right now for less than the price of a Switch 2.\n\nedit: https://www.walmart.com/ip/PS5-Digital-Bundle-Astrobot/15223609143?wl13=3792&selectedSellerId=0&wmlspartner=wlpa&gStoreCode=3792&gQT=2\n\n$399 for new in box PS5 bundle at Walmart. Sorry you suck at shopping /u/Gamebird8 .",
                              "score": -6,
                              "created_utc": 1747755028.0,
                              "replies": [
                                {
                                  "id": "mtbbsvg",
                                  "author": "Gamebird8",
                                  "body": "On Amazon, everything is more than $500 (which is the cost of a Switch 2 Bundled with Mario Kart)\n\nGameStop there are bundles at 449.99, which ties with the base Switch 2.  So not for less (but there is more value, you are technically correct)\n\nBest Buy - All I can find is an open box, no bundles.\n\nNothing on Target or Walmart that is cheaper.\n\n\nAnd if you wanna pull out the \"They're cheaper used\" card.... Do you even understand the argument here",
                                  "score": 9,
                                  "created_utc": 1747756355.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mtbqdpj",
                  "author": "weegee19",
                  "body": "It's not ridiculous cos you're making the wrong comparison, look up Steam Deck prices and suddenly the price tag ain't so daft. Heck, mobile tech and PC tech are not meant to be compared, cos squeezing power within a smaller form factor is much pricier.",
                  "score": 2,
                  "created_utc": 1747760620.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mtb0i8l",
              "author": "raccoonbrigade",
              "body": "and the ps4 was 10x more powerful than the ps3 but launched at a lower price. slop eaters, all",
              "score": 3,
              "created_utc": 1747753050.0,
              "replies": [
                {
                  "id": "mtbq1dx",
                  "author": "weegee19",
                  "body": "False equivalence, PS4 was launched with barely midrange specs for its time, PS3 launched with a supercomputer-class CPU (from 2001, granted, but still) and at a time when memory was a lot more expensive, oh yeah let's not forget that BluRay was novel tech at the time. As a matter of fact the PS3 was even the cheapest BluRay player in the market at the time too.",
                  "score": 4,
                  "created_utc": 1747760520.0,
                  "replies": [
                    {
                      "id": "mtd2wbn",
                      "author": "MerryDingoes",
                      "body": "Yep. Launch PS3 was $600, which would be more considering today's inflation numbers (not including potential tariff prices, too). Excluding today's economic trade wars, the PS3 would be worth around $950 today.\n\nhttps://money.cnn.com/2006/07/07/technology/gadgets.fortune/index.htm?cnn=yes\n\nFrom the above link, the Samsung BluRay player was released at $1000 ($1580 in today's numbers), Toshiba's HD DVD player was released at $800 ($1270 in today's numbers). The PS3 was insane and ultimately won the longterm with BluRays being the format that won. This is my theory, I think that Sony also tried to pull the same moves with the Vita in its proprietary memory card and charging port, but it lost in that regard",
                      "score": 3,
                      "created_utc": 1747774791.0,
                      "replies": [
                        {
                          "id": "mtdbvyu",
                          "author": "weegee19",
                          "body": "Sony was selling at a loss by $300 per console for a time too, it was a massive gamble that paid off extremely well in the end. PS3 was literally the herald for the next era of gaming in almost every way.",
                          "score": 3,
                          "created_utc": 1747777573.0,
                          "replies": [
                            {
                              "id": "mtj75uz",
                              "author": "poofyhairguy",
                              "body": "How was the PS3 the herald of the next generation of gaming?\n\nIt’s weird CPU was not the direction CPUs went, it’s non-unified shader GPU was dated day one, it’s big push was Blu Rays and now physical media matters less than ever before, and it’s barebones but free online service is not how any console currently operates.\n\nThe 360 on the other hand was the future. It had the first unified shader GPU ever, now every device has one. How it had unified memory is how every current console is designed. How it handled paid online is now what every console company does. How its digital storefront focused on indies and previous generation re-releases is now what fills every console online store.",
                              "score": 0,
                              "created_utc": 1747857777.0,
                              "replies": [
                                {
                                  "id": "mtja8yg",
                                  "author": "weegee19",
                                  "body": "In terms of having major features, namely using the Blu Ray format, HDMI output (360 did not have that until a couple of years later), a multithreaded CPU to name a few the PS3 was ahead. The poor GPU was down to Sony basically placing all of their chips on the Cell processor.",
                                  "score": 2,
                                  "created_utc": 1747858664.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mtb36p2",
              "author": "i7-4790Que",
              "body": ">which is fair considering it’s 7x more powerful than the Switch.\n\nyou really told on yourself adding that in.  \n\nNot so much a hot take.  Just really really stupid one.",
              "score": -6,
              "created_utc": 1747753834.0,
              "replies": [
                {
                  "id": "mtbcoyn",
                  "author": "Gamebird8",
                  "body": "Its hardware specs are 6x as powerful (literally 6x the compute cores)\n\nThe cores are also faster/more efficient, but the real world performance is probably somewhere in the 2-4x range on account of software overhead.\n\nThere are ways that the performance could be far greater if for example, the Switch was hampered by a CPU bottleneck that has been fixed with more and beefier CPU cores but until someone sideloads Linux onto a system and races it against the Switch we won't have concrete numbers in a way where we can define definitive performance gains.",
                  "score": 4,
                  "created_utc": 1747756614.0,
                  "replies": [
                    {
                      "id": "mtda0j7",
                      "author": "PM_artsy_fartsy_nude",
                      "body": "It's not a stupid take because it's wrong, it's a stupid take because it doesn't matter. It's like condemning a motorcycle because it doesn't have as much horsepower as a car. It's just a dumb comparison.",
                      "score": 1,
                      "created_utc": 1747776986.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mtaxcrt",
              "author": "None",
              "body": "[deleted]",
              "score": -3,
              "created_utc": 1747752130.0,
              "replies": [
                {
                  "id": "mtb1fbm",
                  "author": "MeasurementBubbly109",
                  "body": "GTA is gonna set the standard. If gta is 100 buckaroos and companies see parents shell the money anyway it’s joever.",
                  "score": 2,
                  "created_utc": 1747753318.0,
                  "replies": []
                },
                {
                  "id": "mtbsf1f",
                  "author": "Icy-Pay7479",
                  "body": "90s kids shouldn’t be phased. Games were $130 accounting for inflation and some carts were over $100 at the time.\n\nA good game you play for 40-200 hours is cheaper than many things, even with those prices.",
                  "score": -3,
                  "created_utc": 1747761206.0,
                  "replies": [
                    {
                      "id": "mtc707q",
                      "author": "right_there",
                      "body": "That makes absolutely no sense as an argument. There was a thriving rental and used market in the 90s. Almost no one actually bought the games they played brand new. It was such a huge problem for the industry that they were suing rental places to try to get them out of the market. Our legal right to backup our games and emulate also comes from this era of corporate assholery.\n\nFurthermore, the consoles themselves oftentimes dropped in price significantly a year or two after launch, which is when mass adoption happened. It wasn't like today where a lot of the userbase gets it on day one.\n\nNowadays, I'm not aware of any rental market for games and the resell market is being swallowed up by the greedy switch to digital-only--a model where you don't own the games you buy. Nintendo games also NEVER drop in price now, which was not the case in the 90s.\n\nIt's greed and price gouging. That's it. For me, the only reason to buy a Nintendo console now is the fact that they're always easily hackable, which enables me to get the overpriced games (many of which are ports of Wii U games that they want to sell again for $60) that only last for like 20 hours for free. My Switch sat unopened in its box for like 9 months before the first custom firmware came out. They will never get me to pay for their shitty overpriced internet package when I'm *already paying for internet*, so not being able to go online doesn't phase me. Fuck em.",
                      "score": 1,
                      "created_utc": 1747765373.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mtb36zr",
              "author": "i7-4790Que",
              "body": ">which is fair considering it’s 7x more powerful than the Switch.\n\nyou really told on yourself adding that in.  \n\nNot so much a hot take.  Just a really really stupid one.  About the same rationale you'd expect from the same crowd that routinely apologizes for the shit state of the dGPU market.",
              "score": -5,
              "created_utc": 1747753834.0,
              "replies": []
            },
            {
              "id": "mtbh5l0",
              "author": "CaptainDouchington",
              "body": "It absolutely is a 350 dollar console. Anyone thinking otherwise is naive. \n\nPS5 is 500 bucks and far more powerful.\n\nThis shits a glorified tablet. \n\nThey are not even in the same ballpark in terms of power or actual cost to produce.",
              "score": -5,
              "created_utc": 1747757941.0,
              "replies": [
                {
                  "id": "mtbqmtc",
                  "author": "weegee19",
                  "body": "It's priced a bit more than the Steam Deck, with arguably better specs, a much better display, joycon tech AND a dock.",
                  "score": 1,
                  "created_utc": 1747760693.0,
                  "replies": [
                    {
                      "id": "mtcw9q0",
                      "author": "CaptainDouchington",
                      "body": "Arm is not better than steam deck. And are you seriously comparing 3 year old tech to something new? \n\nThe steam deck is an actual PC...the switch is a powerful tablet..\n\nAbsolutely does not have a better display",
                      "score": 1,
                      "created_utc": 1747772850.0,
                      "replies": [
                        {
                          "id": "mtdcvjy",
                          "author": "weegee19",
                          "body": "Switch 2 has a 1080p120Hz HDR display, even the Steam Deck OLED, which costs a tad more, only has a 800p90Hz display, its only advantage being an OLED display. I suggest you double check lmao. Steam Deck also lacks DLSS.",
                          "score": -1,
                          "created_utc": 1747777885.0,
                          "replies": [
                            {
                              "id": "mtdhf7w",
                              "author": "CaptainDouchington",
                              "body": "DLSS is a gimmick that doesn't bring much to the table other than admitting your shit cant really run at 1080p.",
                              "score": 1,
                              "created_utc": 1747779365.0,
                              "replies": [
                                {
                                  "id": "mtdzqnv",
                                  "author": "weegee19",
                                  "body": "I like how you didn't deny the screen specs at least. Secondly, dismissing DLSS tells me that you never intended to debate in good faith in the first place.",
                                  "score": 0,
                                  "created_utc": 1747785628.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mtc8jdf",
                      "author": "right_there",
                      "body": "...Joycon tech which will start stick drifting in a few months that they won't be compelled to repair until a lawsuit forces them to with a completely dead button if you don't pay for their shitty internet services that you can't remap.\n\nAnd the lawsuit may not ever come because when you turn on the system you're forced to accept an arbitration clause so that you can't take them to court.",
                      "score": 1,
                      "created_utc": 1747765821.0,
                      "replies": [
                        {
                          "id": "mtcqntw",
                          "author": "weegee19",
                          "body": "To be fair we have no way of knowing for certain if this issue happens to the new Joycons, but I'm hardly gonna hold my breath.\n\nAnd by tech I mean the motion tech and the mouse function.",
                          "score": 2,
                          "created_utc": 1747771173.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mtaqa5c",
          "author": "Makimgmyselfuseful",
          "body": "The Switch OLED is still sold new at 350, only way it goes down is if that does, it’s really not a bad price only 100 more than the last generation of the system",
          "score": 2,
          "created_utc": 1747749987.0,
          "replies": []
        },
        {
          "id": "mtap7gq",
          "author": "dramafan1",
          "body": "In your dreams. 😂",
          "score": 1,
          "created_utc": 1747749644.0,
          "replies": []
        },
        {
          "id": "mtaji5b",
          "author": "KarmaPanhandler",
          "body": "With all the BS terms attached to it, it will always be overpriced even if they started selling them for $100.",
          "score": -7,
          "created_utc": 1747747750.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mta43q8",
      "author": "Boop0p",
      "body": ">The general rule of thumb is that the smaller the number of nanometers, the more advanced and efficient the technology, but Nintendo reportedly opted for the 8nm technology to ensure cheaper and more reliable production.\n\nWill Nintendo ever drop their withered technology philosophy? I'm guessing not when they can let others focus on the bleeding edge and they can just keep making great games and laugh all the way to the bank.",
      "score": 20,
      "created_utc": 1747741887.0,
      "replies": [
        {
          "id": "mta5ife",
          "author": "e30kid",
          "body": "The rumor is they backported Lovelace features to 8nm. I’m guessing the fab capacity is a lot cheaper than any newer node",
          "score": 29,
          "created_utc": 1747742474.0,
          "replies": [
            {
              "id": "mta81ya",
              "author": "kbn_",
              "body": "The base architecture is Ampere not Lovelace.",
              "score": 0,
              "created_utc": 1747743507.0,
              "replies": [
                {
                  "id": "mta9d4y",
                  "author": "LupusDeusMagnus",
                  "body": "You wouldn’t need to backport if they were using Lovelace ",
                  "score": 26,
                  "created_utc": 1747744038.0,
                  "replies": [
                    {
                      "id": "mtaxxv4",
                      "author": "ChrisFromIT",
                      "body": "Is it backporting, tho? Or could the Ada architecture have those features because they were designed originally for the T239.\n\nIts the latter since the T239 was taped out before Ada's tapeout and release.",
                      "score": 2,
                      "created_utc": 1747752301.0,
                      "replies": []
                    },
                    {
                      "id": "mta9ycr",
                      "author": "kbn_",
                      "body": "Or Blackwell for that matter. Though there wasn’t a Lovelace Tegra and the Blackwell hasn’t been released yet, so in an odd way Ampere actually does make some sense.",
                      "score": 1,
                      "created_utc": 1747744269.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mtacoli",
                  "author": "e30kid",
                  "body": "Yup, agreed, I did not say the base architecture was Lovelace, hence my comment",
                  "score": 7,
                  "created_utc": 1747745322.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mta6n9w",
          "author": "blackicebaby",
          "body": "They're saving the 4nm version for the mid cycle OLED model refresh in 3\\~4 years.",
          "score": 16,
          "created_utc": 1747742943.0,
          "replies": [
            {
              "id": "mtad6ta",
              "author": "CarlosFer2201",
              "body": "On Switch 1 the SoC refresh happened well before the Oled model came out. It was around the time the Lite was released I believe.",
              "score": 12,
              "created_utc": 1747745509.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mtaczzp",
          "author": "throwawayfromcolo",
          "body": "They haven't been focused on that since the GameCube. And why should they? It's not like the other consoles are bleeding edge either. That's what PC gaming is for if you've got the dough.",
          "score": 13,
          "created_utc": 1747745439.0,
          "replies": [
            {
              "id": "mtaz7g7",
              "author": "Snipedzoi",
              "body": "Theyre a lot more bleeding edge than this",
              "score": -1,
              "created_utc": 1747752672.0,
              "replies": [
                {
                  "id": "mtdp1ol",
                  "author": "whoknows234",
                  "body": "nintendo only sells consoles for profit unlike Sony who starts out selling them at a loss.",
                  "score": 3,
                  "created_utc": 1747781937.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mtapijn",
          "author": "RobertdBanks",
          "body": "No one is going into a Nintendo console thinking it will be the most powerful console. They buy it to play Nintendo games.",
          "score": 17,
          "created_utc": 1747749742.0,
          "replies": [
            {
              "id": "mtb6zz0",
              "author": "Roboculon",
              "body": "The niche is simple, it’s *children*. Nintendos are for families with little kids, whereas older teenagers and young adults get PlayStations and Xboxs. \n\nSource, am a father of young kids and idgaf about them accessing bleeding edge graphics; I just want the new generation of Nintendo classics.",
              "score": 2,
              "created_utc": 1747754950.0,
              "replies": [
                {
                  "id": "mtcfpsv",
                  "author": "ResoluteGreen",
                  "body": "> Nintendos are for families with little kids, whereas older teenagers and young adults get PlayStations and Xboxs. \n\nNintendo is certainly the most child and family friendly, but there's plenty there for adults. My gf and I both have one that we play regularly.\n\nThe draw isn't the performance, it's the type of games, the exclusive titles that get you. Plus, with the Switch and Switch 2, the hybrid nature of the console is very appealing.",
                  "score": 8,
                  "created_utc": 1747767919.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mtclzom",
          "author": "m0rogfar",
          "body": "At the end of the day, the Switch 2 is already pushing how high in price conventional wisdom would suggest that you can even go with a mass-market handheld with an HDMI dock, so keeping down BOM is the name of the game.\n\nSure, they could potentially have made a semicustom order with Nvidia to get a premium A725+Blackwell chip, but it'd be at a completely different price tag. And - let's be honest here - how many people who are looking at the Switch 2 and not buying it would buy it if it was, say, $700 and had the technological improvements of Ampere -> Blackwell? I'm sure you could find someone that's psyched enough about frame generation to take that stance, but it's hardly a significant amount compared to the people that you'd almost certainly lose with such a price hike.",
          "score": 3,
          "created_utc": 1747769780.0,
          "replies": []
        },
        {
          "id": "mtau6dv",
          "author": "imaginary_num6er",
          "body": ">The general rule of thumb is that the smaller the number of nanometers, the more advanced and efficient the technology\n\nHow did Intel Cannon Lake turned out? Hmm?",
          "score": 2,
          "created_utc": 1747751185.0,
          "replies": []
        },
        {
          "id": "mtcl04s",
          "author": "gourmetguy2000",
          "body": "They got burnt with the N64 and Game Cube. Since then they didn't bother trying to keep up",
          "score": 1,
          "created_utc": 1747769486.0,
          "replies": []
        },
        {
          "id": "mtdd3ij",
          "author": "master2873",
          "body": ">Will Nintendo ever drop their withered technology philosophy?\n\nIssue is, they've always done this except for a couple of examples which didn't do well (N64 & GameCube),  but the point of using older tech is to make it more affordable. Yet, we're getting 5 year old tech for $450+, and games that run on that tech that will be older than Switch 1's tech on release, for up to $80+, while also allowing publishers to abuse the Key Card system which negates the Switch's plug and play aspect it has over all other platforms, and alianiates users who might be in rural areas, or just in areas that still to this day don't have good internet access. While also including the new, hardly used, and EXPENSIVE SD Express Card that even the company themselves that created it, think it's unnecessary for today's use for the time being.\n\nThen you have the Nintendo president who even admits the hardware is pricey, and you have investors asking many questions about pricing, and other concerns. Nintendo has basically defied their history of being affordable, and innovative with this generation.\n\nYou're right either way with your final statement. They really don't need to concern themselves with bleeding edge tech.\n\nEdit: I should have clarified in the final statement of mine about you being right either way. I should have said, you're not wrong about anything either, just in case it wasn't clear enough. I can be blunt sometimes to the detriment of myself lol.",
          "score": 1,
          "created_utc": 1747777956.0,
          "replies": []
        },
        {
          "id": "mtdvu50",
          "author": "TheTinRam",
          "body": "Doesn’t help how they price games. I saw FFX is still $50? Didnt it come out 6 years ago. And it was already nearly a 20 year old game THEN. And so now a nearly 25 year old game is still $50. I guess it’s technically two games but FFX2 is worth 50¢ at most so still, $49.50 for FFX is criminal",
          "score": 1,
          "created_utc": 1747784263.0,
          "replies": []
        },
        {
          "id": "mta5gy1",
          "author": "StickyThickStick",
          "body": "You’re acting like it always works out the Wii U was a Desaster due to its performance.",
          "score": -9,
          "created_utc": 1747742457.0,
          "replies": [
            {
              "id": "mtaeyr4",
              "author": "reddsteele",
              "body": "The Wii U was a disaster due to marketing. Maybe performance bothered some that actually bought it, but most couldn’t tell if it was another Wii, an accessory, or a new console, or who knows what else.",
              "score": 27,
              "created_utc": 1747746160.0,
              "replies": [
                {
                  "id": "mtapdno",
                  "author": "Kindness_of_cats",
                  "body": "That was a major and probably THE major factor, but there were absolutely others that played significant roles.  Its weak specs and difficulty to port to was a big one that caused early third party support from larger names like Ubisoft to drop it.  EA straight up called the console a piece of crap by the end.\n\nIts library and constant content droughts was another, and compounded by the loss of third party support.  Nintendo was spreading its development resources too thin across the 3DS and the Wii U, which meant you’d go significant periods of time with minimal releases for their home console.  And the releases you did get rarely felt like the tentpole games they were supposed to be.  Hell, the console’s mainline Zelda title for most of its life was a WW remaster; BotW didn’t come out until the Switch launched.",
                  "score": 2,
                  "created_utc": 1747749699.0,
                  "replies": [
                    {
                      "id": "mtc534f",
                      "author": "right_there",
                      "body": "Fortunately, the Wii U being easily hackable and having the gamepad as a screen option makes it an amazing, semi-portable emulation device.\n\nMy Switch is hacked too, but I pull out the Wii U to retro game more because it's just so much more convenient.",
                      "score": 3,
                      "created_utc": 1747764807.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mta6wsf",
              "author": "Boop0p",
              "body": "Weird, I made no such claim.",
              "score": 1,
              "created_utc": 1747743050.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mtaa49z",
          "author": "None",
          "body": "[deleted]",
          "score": -4,
          "created_utc": 1747744334.0,
          "replies": [
            {
              "id": "mtaawit",
              "author": "Boop0p",
              "body": "I wasn't criticising, just making an observation.",
              "score": 3,
              "created_utc": 1747744639.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mtehkmq",
      "author": "monkeyalex123",
      "body": "Bold of them to assume there will be high sales after all the announcements they made for it…",
      "score": 2,
      "created_utc": 1747791966.0,
      "replies": []
    },
    {
      "id": "mta76z1",
      "author": "xyzqsrbo",
      "body": "am I crazy or is 20m after a year isn't that insane for production?",
      "score": 5,
      "created_utc": 1747743162.0,
      "replies": [
        {
          "id": "mta87rj",
          "author": "BrewKazma",
          "body": "Thats a very high number. Ps5 and ps4 both sold about 17 million in first year. Ps2 had just less than 20 million and its one of the best selling systems of all time.",
          "score": 22,
          "created_utc": 1747743573.0,
          "replies": [
            {
              "id": "mta8z63",
              "author": "xyzqsrbo",
              "body": "I agree but the first switch did around that in the first year iirc, so not sure if it's some crazy new production push.",
              "score": 0,
              "created_utc": 1747743879.0,
              "replies": [
                {
                  "id": "mta9a4w",
                  "author": "BrewKazma",
                  "body": "Switch sold 15 million in its first year. Thats a 30% increase (the 20 million), with a significantly more expensive system.",
                  "score": 14,
                  "created_utc": 1747744004.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mtcmi91",
          "author": "brianvan",
          "body": "It would put it at one of the top console releases of all time. \n\nI wouldn’t read anything into it either way. The original Switch is an amazing platform. S2 will be better and will come with competitive launch games and features, which will be both attractive to many and “no rush to upgrade” for many (especially with reports of waiting lists for orders). Over the lifespan of the S2, satisfied S1 owners will likely upgrade. “Console units moved” matters somewhat but if there is some sort of market pullback, they’ll ramp down console production and still sell plenty of physical carts + digital game downloads, including licensed titles where profit risk is borne by another software company. It’s a good business to be in if you are good at marketing while being prepared for both shortages and oversupplies.",
          "score": 1,
          "created_utc": 1747769932.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtacr2v",
      "author": "SlyTheFoxx",
      "body": "Are they selling it or licensing their hardware out?",
      "score": 2,
      "created_utc": 1747745348.0,
      "replies": [
        {
          "id": "mtajpg0",
          "author": "KarmaPanhandler",
          "body": "Licensing of course",
          "score": 1,
          "created_utc": 1747747817.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtcviya",
      "author": "ph30nix01",
      "body": "After their treatment of Palworld and the bullshit patent crap, fuck nintendo.",
      "score": 3,
      "created_utc": 1747772631.0,
      "replies": []
    },
    {
      "id": "mtcq7dz",
      "author": "SchighSchagh",
      "body": "20 million units in 9 months or so? That'd be wild. I seriously don't expect them to sell anywhere close to that many that fast.",
      "score": 2,
      "created_utc": 1747771037.0,
      "replies": []
    },
    {
      "id": "mtd39ce",
      "author": "EnvironmentalFix4502",
      "body": "So 20 million units sold to scalpers that will list it on ebay and amazon for double",
      "score": 2,
      "created_utc": 1747774898.0,
      "replies": []
    },
    {
      "id": "mtd44j9",
      "author": "Practical-Juice9549",
      "body": "Yeah, good luck selling those 20 million units when so many people are pissed off about their big brother controls on the device. I went from wanting to buy one to absolutely not buying one.",
      "score": 2,
      "created_utc": 1747775160.0,
      "replies": []
    },
    {
      "id": "mtdlt6y",
      "author": "Icedvelvet",
      "body": "Switch 2 isn’t selling that much.",
      "score": 1,
      "created_utc": 1747780845.0,
      "replies": []
    },
    {
      "id": "mtaa335",
      "author": "nezeta",
      "body": "Do Nintendo and Samsung have plans to use 4nm or 5nm nodes in the future to reduce power consumption, similar to how Sony and AMD moved to TSMC 6nm node from 7nm to save around 20-30W?",
      "score": 1,
      "created_utc": 1747744321.0,
      "replies": [
        {
          "id": "mtcrh8o",
          "author": "m0rogfar",
          "body": "It doesn't seem too likely in the short term, but never say never I guess?\n\nThe thing with 7nm -> 6nm was that it was a very cheap upgrade. TSMC could upgrade existing 7nm production to 6nm, and 6nm was design-compatible, so AMD barely had to do any work on their end to make things work.\n\nSamsung 8nm is a very different situation, since it doesn't have any real upgrade path. Samsung switched to EUV with 7nm, so the tooling doesn't have any upgrade path on their end, and newer nodes are not design-compatible, so it would require significant work from Nvidia to port it to a newer node. Making matters worse, the Nintendo+Nvidia partnership is Samsung's only major customer on 8nm, which means that Samsung is highly incentivized to offer extremely competitive pricing to keep them as a customer.\n\nThe only reason I wouldn't straight-up rule it out is that it happened with the Switch 1 with the jump from 20nm to 14nm, which had many of the same technical challenges, but even then, there were some pretty unique circumstances there, with TSMC really wanting to get out of the 20nm node due to severe issues with the node, and likely cutting aggressive deals to customers to offer fab space on better nodes to get rid of any obligation to keep it going for many more years.",
          "score": 3,
          "created_utc": 1747771418.0,
          "replies": []
        },
        {
          "id": "mtcah8x",
          "author": "haahaahaa",
          "body": "Doubtful.  NVidia's 3000 series Ampere cards were on Samsung 8nm.  Using that node was far and away the simplest way to go.  AMD has been developing new laptop APU's designed around the same archetectures in the PS5 SOC.  This layed the groundwork to make that move.",
          "score": 2,
          "created_utc": 1747766392.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtchwd8",
      "author": "Jad3nCkast",
      "body": "I’m utterly confused now mainly because I don’t know how this chip stuff works. My understanding is it’s an Nvidia architecture but Samsung is the one actually producing the chips? \n\nSecondly cant Samsung use the “blueprints” so to speak to help design their own chips?",
      "score": 1,
      "created_utc": 1747768568.0,
      "replies": [
        {
          "id": "mtckdgl",
          "author": "m0rogfar",
          "body": "> Secondly cant Samsung use the “blueprints” so to speak to help design their own chips?\n\nPotentially, but with the asterisk that Nvidia's architecture is patented so they couldn't actually ship anything that they'd steal, and trying to do it anyway would essentially cause their >$200 billion investment in chip manufacturing to go up in flames overnight, since no one would ever hire them to make stuff again, so they're not going to do that.",
          "score": 3,
          "created_utc": 1747769300.0,
          "replies": [
            {
              "id": "mtckrl6",
              "author": "Jad3nCkast",
              "body": "I think they could use the Nvidia blueprints to see areas they could improve their chips though without outright stealing right?",
              "score": 1,
              "created_utc": 1747769416.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mtf8g5v",
      "author": "digiorno",
      "body": "And then they’re gonna price it so high that barely anyone can buy it…",
      "score": 1,
      "created_utc": 1747802883.0,
      "replies": []
    },
    {
      "id": "mtax5ox",
      "author": "Letters_to_Dionysus",
      "body": "I don't think they'll need that many chips to be honest. I'm calling it now this one's going to be a flop",
      "score": 1,
      "created_utc": 1747752072.0,
      "replies": [
        {
          "id": "mtbrqje",
          "author": "WTWIV",
          "body": "I kind of agree. The only console I’ve owned since the first PlayStation was the first Switch which I left with an ex, so I was looking forward to getting the Switch 2 but when they said they won’t have an OLED option, I’ve decided to wait until they do or just wait until it comes out and buy the first Switch again at a much lower price",
          "score": 0,
          "created_utc": 1747761011.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mta7yc4",
      "author": "Dio44",
      "body": "Mark my words, they are not going to sell as many as they think.",
      "score": -5,
      "created_utc": 1747743466.0,
      "replies": [
        {
          "id": "mtaaos4",
          "author": "NuclearReactions",
          "body": "Personally nintendo's antics have worn me out. They are so out of touch with the very hobby they created, i am disgusted by their behavior. They can keep switch 2, 1 will be my last.",
          "score": 1,
          "created_utc": 1747744556.0,
          "replies": [
            {
              "id": "mtac3r6",
              "author": "mat145_",
              "body": "I roll my eyes every time I see someone say this, only because I know gamers. \n\nYou have no self control.",
              "score": 15,
              "created_utc": 1747745101.0,
              "replies": [
                {
                  "id": "mtaxeaj",
                  "author": "WorstEpEver",
                  "body": "Never underestimate nerds with money",
                  "score": 2,
                  "created_utc": 1747752143.0,
                  "replies": []
                },
                {
                  "id": "mtacjbv",
                  "author": "NuclearReactions",
                  "body": "That's incredibly silly, i hope you realize it. Generalizing based on one hobby just makes no sense whatsoever. There are people who are 12, others who are 65. People from all over the world. Some make gaming their whole identity, others cringe at the idea of being called \"gamer\".\n\nHell at that point generalize based on my age (I'm 32), at least you got one hard fact to base your assumptions on..\n\nBtw i don't even think you are wrong, sadly. Personally i have strong principles and believe that companies are becoming increasingly hostile and profit driven to the point where customer oriented practices are basically vanishing. Add to that how every major company spent the past 30 years weakening and buying the competition to the point where some don't even have to care about their image. Add to that how modern shareholders are driving every company into the ground (in terms of product quality, not profits of course) in the most short sighted way possible.. it's a problem, gaming is just affected more than others because for everyone who actually cares there's like 50 squeakers that buy every shit they get advertised into buying.",
                  "score": 0,
                  "created_utc": 1747745266.0,
                  "replies": [
                    {
                      "id": "mtaqxmb",
                      "author": "tlst9999",
                      "body": ">That's incredibly silly, i hope you realize it. Generalizing based on one hobby just makes no sense whatsoever. There are people who are 12, others who are 65. People from all over the world. Some make gaming their whole identity, others cringe at the idea of being called \"gamer\".\n\nI know gamers. 20 million of them have no self control.",
                      "score": 2,
                      "created_utc": 1747750193.0,
                      "replies": [
                        {
                          "id": "mtciacd",
                          "author": "neonlights326",
                          "body": "Then why did the Wii U only sell 13 million?",
                          "score": -1,
                          "created_utc": 1747768681.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mtafhzt",
                  "author": "LamonicasHubster",
                  "body": "![gif](giphy|RrFIAkolTgl6HaLv8n)",
                  "score": 1,
                  "created_utc": 1747746349.0,
                  "replies": []
                },
                {
                  "id": "mtc4fwm",
                  "author": "flycasually",
                  "body": "i've been a day 1 console gamer my entire life. i've had most major consoles on day 1, especially a lot of nintendo products. i have ZERO intention of ever buying the switch 2. seems like the biggest waste of money for the most minor upgrades. \n\ni have tons of disposable income ready to spend on gaming consoles. the switch 2 will never be one of them.",
                  "score": -1,
                  "created_utc": 1747764620.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mta6vrc",
      "author": "EarzFish",
      "body": "Maybe Samsung can also make a new shield /s",
      "score": 1,
      "created_utc": 1747743038.0,
      "replies": []
    },
    {
      "id": "mtfapc3",
      "author": "PeaAndHamSoup269",
      "body": "Why anyone is buying a product they don’t truely own is beyond me. Fuck Nintendo.",
      "score": 1,
      "created_utc": 1747804009.0,
      "replies": []
    },
    {
      "id": "mtaiqqf",
      "author": "Portlander",
      "body": "Sold implies that you own it. The current terms of service for the switch 2 clearly State you do not own it. \n\nLeased or licensed would be more appropriate.",
      "score": -5,
      "created_utc": 1747747491.0,
      "replies": []
    },
    {
      "id": "mtahg53",
      "author": "bamila",
      "body": "Switch two is just a bad deal if you want gaming. Just get steam deck that does the exact same but you will save thousands of dollars in long run or any other more powerful handheld that trashes switch 2 ancient hardware. Just in retro perspective the Rog ally 2 with z2 extreme is going to be about 5-6 times more powerful than switch 2.",
      "score": -5,
      "created_utc": 1747747042.0,
      "replies": [
        {
          "id": "mtavoy3",
          "author": "OramaBuffin",
          "body": "What the hell are you on about lol. The main selling point of Nintendo consoles is that you can play Nintendo games. A steam deck does absolutely nothing to address that.\n\nI haven't touched a Nintendo console since the Wii, by the way. I'm a PC gamer but the power advantage of phones and steam decks is literally irrelevant to the discussion.",
          "score": 13,
          "created_utc": 1747751636.0,
          "replies": [
            {
              "id": "mtcikch",
              "author": "neonlights326",
              "body": ">A steam deck does absolutely nothing to address that.\n\n\nThen explain all those people I saw playing Nintendo games on their Steam Decks at the airport, including stuff like BOTW and MK8.",
              "score": 0,
              "created_utc": 1747768763.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mtaj8el",
          "author": "None",
          "body": "[removed]",
          "score": 18,
          "created_utc": 1747747657.0,
          "replies": [
            {
              "id": "mtakxny",
              "author": "MattyRBaps",
              "body": "Especially with nintendo, who is known for their high quality exclusive titles, and strict anti-piracy enforcement",
              "score": 10,
              "created_utc": 1747748239.0,
              "replies": [
                {
                  "id": "mtc9siq",
                  "author": "right_there",
                  "body": "Lol. The Switch 1 shipped with an unpatchable hardware exploit that gave full access to the system. I have a Switch but have no games. I've played every game I was interested in for free with barely any additional hassle.\n\nEvery Nintendo console since the Wii was trivially broken wide open fairly quickly. Even their earlier systems couldn't stop things like flashcarts, flashcards, etc., and their numerous attempts to do so were broken in less than a week in the DS and 3DS era. Their anti-piracy enforcement is toothless. They're so bad at locking down their hardware that they're writing into their terms of service that they have the right to remotely *brick your console that you own*, and you won't even be able to sue when they destroy your property because they force you to accept an arbitration clause.",
                  "score": 1,
                  "created_utc": 1747766192.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mtb90rk",
      "author": "blazze_eternal",
      "body": "Ask them to make some better HDMI ports while they're at it.",
      "score": 0,
      "created_utc": 1747755541.0,
      "replies": []
    },
    {
      "id": "mtfc6gl",
      "author": "pball0010",
      "body": "Do you think that the Switch 2 will throw bloatware on your system like Samsung does with every update?",
      "score": 0,
      "created_utc": 1747804757.0,
      "replies": []
    },
    {
      "id": "mtbxkg7",
      "author": "chief_yETI",
      "body": "20 million consoles being sold? With $500 consoles in this economy? and $80 games?\n\nhehe",
      "score": -2,
      "created_utc": 1747762655.0,
      "replies": [
        {
          "id": "mtcirt0",
          "author": "neonlights326",
          "body": "I dunno man, Pokemon fans are pretty stupid.",
          "score": 1,
          "created_utc": 1747768825.0,
          "replies": [
            {
              "id": "mtcmk33",
              "author": "chief_yETI",
              "body": "can't argue with that 🙊",
              "score": -1,
              "created_utc": 1747769947.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mtbg6lr",
      "author": "Leptonshavenocolor",
      "body": "I hope it flops.",
      "score": -7,
      "created_utc": 1747757652.0,
      "replies": []
    }
  ]
}