{
  "post": {
    "title": "Samsung's 2025 OLED TV lineup will support Nvidia G-Sync | Coming to the new flagship models first, with other 2025 OLEDs following later this year",
    "author": "chrisdh79",
    "id": "1kr3hyn",
    "score": 195,
    "created_utc": 1747743702.0,
    "selftext": "",
    "num_comments": 43,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kr3hyn/samsungs_2025_oled_tv_lineup_will_support_nvidia/"
  },
  "comments": [
    {
      "id": "mtaav2h",
      "author": "TheSchlaf",
      "body": "So they have money to pay for G-Sync licensing, but not Dolby Vision licensing?  Interesting...",
      "score": 124,
      "created_utc": 1747744624.0,
      "replies": [
        {
          "id": "mtb367q",
          "author": "drmirage809",
          "body": "I believe that’s because they got their own fancy HDR standard that they’re trying to push. Not a lot of success on their end, with Dolby Vision quickly becoming the standard for HDR content.",
          "score": 39,
          "created_utc": 1747753831.0,
          "replies": [
            {
              "id": "mtcic2c",
              "author": "Lokon19",
              "body": "They support HDR10+ which is an open standard and free… They are just cheaping out. The good news is that the biggest streaming companies are now offering support for it so it’s not completely dead.",
              "score": 19,
              "created_utc": 1747768695.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mtacxcf",
          "author": "user11711",
          "body": "I was thinking the same thing. What in the actual hell? Really sucks, I don’t even look at Samsung TV’s anymore because of this. I have one from 2016 but at the time it was all new. In the year of the lord 2025 there is no excuse.",
          "score": 24,
          "created_utc": 1747745412.0,
          "replies": [
            {
              "id": "mtadgkg",
              "author": "TheSchlaf",
              "body": "They also dropped DTS passthrough via eARC because of licensing issues.  LG finally added it back in the C4 and later TVs.  Sony has always kept both.",
              "score": 20,
              "created_utc": 1747745609.0,
              "replies": [
                {
                  "id": "mtadm80",
                  "author": "user11711",
                  "body": "Lawddddd yea thank god for RTings literally won’t touch a TV without reading there extensively.",
                  "score": 23,
                  "created_utc": 1747745666.0,
                  "replies": []
                },
                {
                  "id": "mtchy8d",
                  "author": "Lokon19",
                  "body": "LG just got rid of some DTS support on their 2025 models.",
                  "score": 6,
                  "created_utc": 1747768583.0,
                  "replies": []
                },
                {
                  "id": "mtap3hp",
                  "author": "dammerung2010",
                  "body": "LG removed it again on the 5 series OLEDs.",
                  "score": 4,
                  "created_utc": 1747749608.0,
                  "replies": [
                    {
                      "id": "mtaqsf3",
                      "author": "TheSchlaf",
                      "body": "[Yep.](https://www.flatpanelshd.com/news.php?subaction=showfull&id=1743140114)  Stupid.  Why not allow users to pay for the licenses they want?  They already have the programming in the OS.",
                      "score": 3,
                      "created_utc": 1747750148.0,
                      "replies": [
                        {
                          "id": "mtfljrf",
                          "author": "Elon61",
                          "body": "It’s probably more complicated than you’d think, and would probably be substantially more expensive per-license.",
                          "score": 1,
                          "created_utc": 1747809988.0,
                          "replies": [
                            {
                              "id": "mtfy947",
                              "author": "Hitori-Kowareta",
                              "body": "It’d also require the license holders to support that and I imagine they’d much rather every single product in a lineup paid the fee rather than an indeterminate number of end-users.",
                              "score": 1,
                              "created_utc": 1747817914.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mtbcr68",
                  "author": "shhhpark",
                  "body": "I think the reintroduced it in the C4 generation but removed it again in the latest 5 generation lol I haven’t checked on my G5 but think o saw someone mention it",
                  "score": 5,
                  "created_utc": 1747756632.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mtaln34",
              "author": "Emotional_Insect4874",
              "body": "I bought a $4k Samsung tv and the capacitors powering backlight started to fail making the screen flicker like it’s having a seizure, literally a week after the warranty expired. The smart TV cpu is also way underpowered, and laggy and slow AF. \n\nI will never buy another Samsung product ever, that company has jumped the shark. A cheap ass TCL TV I’ve had for 10 years still works better.",
              "score": 6,
              "created_utc": 1747748479.0,
              "replies": [
                {
                  "id": "mtapg95",
                  "author": "The8Darkness",
                  "body": "Wouldnt say the cpu is underpowered the software is just crap bloat.\n\nLike a 2016 flagship samsung tv runs circles around any of the newer ones when it comes to os performance. \n\nLike even bargain bin tvs and like 10-20$ streaming sticks usually feel better performing because their os isnt bloated to hell and beyond.",
                  "score": 5,
                  "created_utc": 1747749722.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mtb7vlf",
              "author": "ScoobiesSnacks",
              "body": "I’ve been team LG for a while now. Doesn’t Samsung have a pretty bad reputation for their products not holding up long term and having poor customer service?",
              "score": 3,
              "created_utc": 1747755207.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mtfdvpa",
          "author": "ECHLN",
          "body": "It’s infuriating because I’m in the market for a new OLED. C5 or S90F. I’ll have to skip Samsung because I’ve seen some owners’ reviews of how their TVs sometimes handle Dolby Vision content and I’m strongly going to avoid them for now.",
          "score": 1,
          "created_utc": 1747805652.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtaa1an",
      "author": "cant-think-of-anythi",
      "body": "What's the advantage?",
      "score": 10,
      "created_utc": 1747744301.0,
      "replies": [
        {
          "id": "mtabxsg",
          "author": "NuPNua",
          "body": "It's just a proprietary VRR format, most top level TVs already support VRR via the standard format.",
          "score": 27,
          "created_utc": 1747745036.0,
          "replies": [
            {
              "id": "mtah7i3",
              "author": "H3LLGHa5T",
              "body": "it's not proprietary any more, just a certification at this point.",
              "score": 13,
              "created_utc": 1747746957.0,
              "replies": []
            },
            {
              "id": "mtdbdju",
              "author": "YertletheeTurtle",
              "body": "The article clarifies that only the monitors are getting G-Sync.\n\nThe TVs are getting G-Sync Compatible (which is incompatible with G-Sync, but supported by most modern GPUs)",
              "score": 3,
              "created_utc": 1747777411.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mtab1s0",
          "author": "Tankerrex",
          "body": "So that the salesman can glaze the product to better convince the family before him to commit to a 24 month payment plan",
          "score": 5,
          "created_utc": 1747744696.0,
          "replies": [
            {
              "id": "mtac053",
              "author": "NuPNua",
              "body": "If you're going to be using your TV for gaming, VRR tech is pretty beneficial.",
              "score": 10,
              "created_utc": 1747745062.0,
              "replies": [
                {
                  "id": "mtbd2rz",
                  "author": "nicuramar",
                  "body": "My Samsung OLED already has VRR, though, at least with the PS5. ",
                  "score": 1,
                  "created_utc": 1747756727.0,
                  "replies": []
                },
                {
                  "id": "mtakcs9",
                  "author": "jack_the_beast",
                  "body": "Vrr tech is, gsync isn't",
                  "score": 0,
                  "created_utc": 1747748040.0,
                  "replies": [
                    {
                      "id": "mtc043q",
                      "author": "BassGaming",
                      "body": "You are getting downvoted while being correct. VRR is very useful. Gsync is just Nvidias implemention where they have to pay for the license and, the thing which makes it interesting for the manufacturers, certification. Freesync for example works just as well. But being able to slap \"Gsync ready\" on the box is a selling point for some reason.\n\nWhat's even funnier, in this case it is literally just the certification. They don't even have gsync hardware integrated. It's literally just the certification to slap it on the box as a feature. There is no advantage for the user.",
                      "score": 1,
                      "created_utc": 1747763377.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mtaay54",
          "author": "TheSchlaf",
          "body": "No screen flickering or weird glitches with Nvidia GPUs in VRR mode.",
          "score": 2,
          "created_utc": 1747744656.0,
          "replies": [
            {
              "id": "mtahne3",
              "author": "BenadrylChunderHatch",
              "body": "G-Sync doesn't fully prevent flickering at low fps in VRR, even with the hardware module.",
              "score": 4,
              "created_utc": 1747747112.0,
              "replies": [
                {
                  "id": "mtajv1j",
                  "author": "TheSchlaf",
                  "body": "No LFC?",
                  "score": 2,
                  "created_utc": 1747747871.0,
                  "replies": [
                    {
                      "id": "mtakdcv",
                      "author": "BenadrylChunderHatch",
                      "body": "LFC?",
                      "score": 2,
                      "created_utc": 1747748045.0,
                      "replies": [
                        {
                          "id": "mtancgp",
                          "author": "TheSchlaf",
                          "body": "Low Framerate Compensation.  Basically, doubling the frames until you get to the lowest Hz that VRR will support.  Looks like you are right and G-Sync doesn't support that. It's up to the monitor manufacturer.",
                          "score": 6,
                          "created_utc": 1747749041.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mtcub3r",
      "author": "slickrasta",
      "body": "My 2022 S90C already does. It's just not \"licensed\". Seems rather pointless.",
      "score": 10,
      "created_utc": 1747772268.0,
      "replies": []
    },
    {
      "id": "mtdcx9w",
      "author": "FoxFisher",
      "body": "Anything that writes “samsung” on it won’t enter my home anymore because anyhing that says “samsung” on it died within the span of 5-7 years.",
      "score": 5,
      "created_utc": 1747777901.0,
      "replies": []
    },
    {
      "id": "mtawfpb",
      "author": "lucky6877",
      "body": "Stopped buying Samsung tv’s when they stopped adopting Dolby vision and switched to LG, never going back to Samsung again until they adopt Dolby vision",
      "score": 8,
      "created_utc": 1747751857.0,
      "replies": [
        {
          "id": "mtgflln",
          "author": "PUMPEDnPLUMP",
          "body": "I switched from 2019 Samsung to 2025 LG this year .. it’s incredible. The only downgrade is slight banding in certain games",
          "score": 1,
          "created_utc": 1747827329.0,
          "replies": [
            {
              "id": "mti22eh",
              "author": "lucky6877",
              "body": "Sorry to hear about the banding issue, I have the C1 which is a couple of years old but touch wood, no issues so far.  In regards to your banding issue, couple of my friends mentioned they bought a high end HDMI cable (expensive ones) and it sorted out the issue. Other friends mentioned they started refreshing the pixels on regular basis and that helped resolve the issue so not sure if that helps.  Cheers",
              "score": 1,
              "created_utc": 1747846065.0,
              "replies": [
                {
                  "id": "mti27zm",
                  "author": "PUMPEDnPLUMP",
                  "body": "I have a good cable and it’s brand new.. I think it’s just the way the screen processes gradients",
                  "score": 3,
                  "created_utc": 1747846108.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mtz6pg7",
              "author": "Stargate_1",
              "body": "What is banding? I have a LG OLED as well hut a monitor, not a TV, and I don't think I experience banding (maybe I do?)",
              "score": 1,
              "created_utc": 1748074571.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mtal56r",
      "author": "SaVaTa_HS",
      "body": "Meanwhile they support FreeSync since 2018. Interesting. Is it just a \" nvidia approved label\", that it works with g-sync or they will have the actual hardware g-sync module?  \nEdit: according to the article it seems that there will be no g-sync hardware involved",
      "score": 5,
      "created_utc": 1747748310.0,
      "replies": []
    },
    {
      "id": "mtcm3pl",
      "author": "kritsku",
      "body": "Bought my first 77\" Samsung OLED last year. Never again. The menus, UX decisions, lag and remote control are shockingly bad. And this wasn't a cheap TV. My cheap 55\" LG 13 years ago was so much better to interact with. Modern LGs are no stellar UX specimens but at least they're not infuriating to interact with. It shocks me that no one talks about how insanely bad the Samsung UI is.\n\nAnd yes, having no Dolby Vision (or DTS) but including gsync is insane.",
      "score": 6,
      "created_utc": 1747769813.0,
      "replies": []
    },
    {
      "id": "mtdeofc",
      "author": "Lumpy_Pain27",
      "body": "glad to see it coming to the flagship model , now just hoping it rolls out to the rest of the line up without too much delay",
      "score": 1,
      "created_utc": 1747778460.0,
      "replies": []
    },
    {
      "id": "mtamenw",
      "author": "None",
      "body": "[deleted]",
      "score": -2,
      "created_utc": 1747748732.0,
      "replies": [
        {
          "id": "mtbd842",
          "author": "nicuramar",
          "body": "I forgot. What are we talking about?",
          "score": 1,
          "created_utc": 1747756771.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtcl4s3",
      "author": "Jad3nCkast",
      "body": "What happened to their quantum dot lol.",
      "score": 0,
      "created_utc": 1747769525.0,
      "replies": []
    },
    {
      "id": "mtaxqra",
      "author": "LifeFiasco",
      "body": "So it will die in 1 month instead of 5…🎉",
      "score": -1,
      "created_utc": 1747752244.0,
      "replies": []
    }
  ]
}