{
  "post": {
    "title": "The Atari 2600 My Play Watch Has No Apps, No Wi-Fi—Just Pure Retro Gaming",
    "author": "diacewrb",
    "id": "1jfstt2",
    "score": 528,
    "created_utc": 1742487859.0,
    "selftext": "",
    "num_comments": 98,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jfstt2/the_atari_2600_my_play_watch_has_no_apps_no/"
  },
  "comments": [
    {
      "id": "mitip3q",
      "author": "None",
      "body": "Looks like a generic watch from Aliexpress with custom firmware and a band with a color swatch of their choosing.",
      "score": 132,
      "created_utc": 1742488210.0,
      "replies": [
        {
          "id": "mitm8ug",
          "author": "PointsOfXP",
          "body": "Yeah. This isn't cool. I'm pretty sure I had a toy watch that had games on it when I was a kid. The marketing will sell to these people who think they don't rent everything and they'll be disappointed",
          "score": 43,
          "created_utc": 1742489248.0,
          "replies": []
        },
        {
          "id": "miwmpru",
          "author": "NotMeniac",
          "body": "It's just a cheap Chinese knockoff with an Atari sticker slapped on it. Same hardware you can get for $10-15, but with \"retro\" markup. Nothing special under the hood.",
          "score": 4,
          "created_utc": 1742522879.0,
          "replies": [
            {
              "id": "mrdhxcd",
              "author": "MDesigner",
              "body": "Is it really a knockoff if it's being sold directly by Atari? 🤔",
              "score": 5,
              "created_utc": 1746769174.0,
              "replies": [
                {
                  "id": "n1zk9rj",
                  "author": "TurbulentMinute4290",
                  "body": "That's a good point",
                  "score": 2,
                  "created_utc": 1751983437.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "miui1w5",
      "author": "APirateAndAJedi",
      "body": "Fun fact: Those games are apps, too.",
      "score": 56,
      "created_utc": 1742498340.0,
      "replies": [
        {
          "id": "miwktoq",
          "author": "GhostMichaelJackson",
          "body": "I had to double guess myself when reading the title. I was like no apps but apps?",
          "score": 13,
          "created_utc": 1742522190.0,
          "replies": []
        },
        {
          "id": "miwq5xc",
          "author": "silentcrs",
          "body": "Well… kind of? They’re built into the OS (whatever it is) and there’s no way to change them out. I don’t know if you can call them apps if you can’t actually manage them like apps.\n\nIt’s like the Calculator program in MacOS 7. It and a few other programs came with the OS. You couldn’t get rid of them. They were just… there.",
          "score": 2,
          "created_utc": 1742524108.0,
          "replies": [
            {
              "id": "miwqlzu",
              "author": "APirateAndAJedi",
              "body": "An application is just software doing specific things. A game is an application, unequivocally. It has nothing to do with how portable it is.",
              "score": 10,
              "created_utc": 1742524266.0,
              "replies": [
                {
                  "id": "miws1zh",
                  "author": "silentcrs",
                  "body": "Right, but there’s a term for this kind of thing (other than applications). In MacOS it was called something like “desk toy”.\n\nEdit: ok I looked it up. It was called a “desk accessory”. It had a very specific configuration under the hood. Pretty interesting. https://apple.fandom.com/wiki/Desk_accessory",
                  "score": 4,
                  "created_utc": 1742524778.0,
                  "replies": [
                    {
                      "id": "miwsuxr",
                      "author": "APirateAndAJedi",
                      "body": "Anything used by an end user to perform a specific task is a computer application. A desk accessory is an application. A game is an application. A clock widget is an application. You are trying to differentiate things from applications that are, in fact, applications. You’re trying to have a semantic argument and you are simultaneously incorrect about the semantics. \n\nThat’s all I was saying.",
                      "score": 6,
                      "created_utc": 1742525066.0,
                      "replies": [
                        {
                          "id": "miwvs9a",
                          "author": "silentcrs",
                          "body": "I’ve been in computing for 40 years. I’m having an architecture discussion, not a semantics discussion. There’s no such thing as an “application” for an embedded system.\n\nNot to mention “applications” as a term only came to popularity with the general public around 2010. Before that, we called them “programs”. Before that, it was just “software”.",
                          "score": 2,
                          "created_utc": 1742526144.0,
                          "replies": [
                            {
                              "id": "mixy3m9",
                              "author": "APirateAndAJedi",
                              "body": "You literally said “right but there’s a different term…”\n\nNot only are you having a semantics argument by your own admission, you’re losing it. \n\nAnd like most tech professionals, you’re absolutely incapable of admitting error, even though everyone can see it in black and white. I’m guessing you’re not a super successful tech professional.",
                              "score": -2,
                              "created_utc": 1742546438.0,
                              "replies": [
                                {
                                  "id": "miypi2p",
                                  "author": "silentcrs",
                                  "body": ">And like most tech professionals, you’re absolutely incapable of admitting error\n\nThat’s... a take. Can you point on the doll to where IT hurt you?",
                                  "score": 0,
                                  "created_utc": 1742560594.0,
                                  "replies": [
                                    {
                                      "id": "miyvn82",
                                      "author": "APirateAndAJedi",
                                      "body": "Prove that take wrong. Point out to everybody here that the link you provided on “Desk accessories” refers to those accessories as applications in the article itself.\n\nTo anybody else reading this, he posted a link to make his semantic argument and he didn’t even bother to read the link. \n\nBut yes, school us all about your “40 years in computing”. Did that really not include basic reading comprehension?",
                                      "score": 1,
                                      "created_utc": 1742562827.0,
                                      "replies": [
                                        {
                                          "id": "mizlqg2",
                                          "author": "silentcrs",
                                          "body": "Again, I'm talking about architecture. Do you know how to talk about technology architecture?\n\nRead the article. Desk accessories ran as drivers. They essentially ran at kernel-level. That's a huge difference from applications, which run in user mode.",
                                          "score": 0,
                                          "created_utc": 1742570951.0,
                                          "replies": [
                                            {
                                              "id": "mizpjjd",
                                              "author": "APirateAndAJedi",
                                              "body": "Now you’re moving the goalposts. You responded to my comment. My comment was about what qualifies as an application. \n\nYou butted in, corrected me, got proven wrong, and then claimed that you were talking about a subject that was not the subject you responded. \n\nYou were wrong. You got busted. Trying to condescend me when everybody can see you fucked this up and then claiming you were talking about something else is just embarrassing. Stop making it worse.\n\nI’m betting you’re used to this though. You’re very lonely, I guarantee it. It’s your fault. It’s because you won’t admit fault. That’s why you’ll continue your sad life. \n\nDon’t bother trying to convince me I didn’t just peg you cold. I know I did. More importantly, you know I did and nothing you say can change that.",
                                              "score": -1,
                                              "created_utc": 1742572070.0,
                                              "replies": [
                                                {
                                                  "id": "mj0r6op",
                                                  "author": "NihilisticAngst",
                                                  "body": "Lol you are projecting so hard. The other user just wanted to discuss the semantics, and to be honest they've got a point, they certainly were never \"proved wrong\". And for some reason you went crazy and decided to refuse communicating like a mature individual and decided to just start throwing insults for no reason. Your quite strange and abnormal level of anger is almost tangible through your comment, but the fact of the matter is that there is really nothing here for you to be mad about other than a perceived challenge to your ego. Your ego is clearly highly fragile. The fact of the matter is that the other commenter was communicating with you respectfully the entire time, the \"trying to condescend me\" thing is just your narcissistic delusion, I don't think they were being condescending whatsoever. They didn't say anything that could even slightly be considered condescending until after you were condescending and insulting first. You should take a good, hard look in a mirror.",
                                                  "score": 1,
                                                  "created_utc": 1742582937.0,
                                                  "replies": [
                                                    {
                                                      "id": "mj0soam",
                                                      "author": "APirateAndAJedi",
                                                      "body": "I mean, everybody can see that isn’t true. There is projecting going on here, but it isn’t by me. \n\n“The other user”. You are probably the other user using an alt, which is just sad. You’d be more believable if your comment resembled the reality it refers to. Everybody can see that it does not.",
                                                      "score": 1,
                                                      "created_utc": 1742583368.0,
                                                      "replies": [
                                                        {
                                                          "id": "mj0vlm8",
                                                          "author": "NihilisticAngst",
                                                          "body": ">everybody can see that isn't true. \n\nWho is this everybody you keep referring to? Are they here with us right now? Because I don't see them.\n\n>You are probably the other user using an alt\n\nClassic, resorting to a conspiracy theory you just pulled out of your ass because you can't believe the possibility that you're in the wrong and multiple other people think so. It just gets more and more hilarious that you criticized someone else for not being able to admit error when that's literally been your MO the whole time. That is the projecting I'm referring to. Also, my writing style is not like the other commenter's, but sure, keep believing your delusions.",
                                                          "score": 0,
                                                          "created_utc": 1742584223.0,
                                                          "replies": [
                                                            {
                                                              "id": "mj0w93e",
                                                              "author": "APirateAndAJedi",
                                                              "body": "Haha, now I KNOW you’re the same person. You are convincing nobody of anything. Keep trying though.",
                                                              "score": 2,
                                                              "created_utc": 1742584417.0,
                                                              "replies": [
                                                                {
                                                                  "id": "mj0y75m",
                                                                  "author": "NihilisticAngst",
                                                                  "body": "🤣 You have issues, please get help.",
                                                                  "score": 0,
                                                                  "created_utc": 1742584995.0,
                                                                  "replies": []
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "miu4myg",
      "author": "triad1996",
      "body": "I still have my Atari 2600 with maybe 10 to 15 game cartridges.  Sure, it was ok fun in the early-mid 80s, but now, those same games are mind-numbingly dull.  Why anyone would want that on a watch is beyond me.",
      "score": 30,
      "created_utc": 1742494481.0,
      "replies": [
        {
          "id": "miu5gs3",
          "author": "-Gramsci-",
          "body": "Yeah they reaallllyyy don’t hold up at all. \n\nJust a handful of titles even worth revisiting at all.",
          "score": 13,
          "created_utc": 1742494719.0,
          "replies": [
            {
              "id": "miub1ow",
              "author": "Lendyman",
              "body": "The vibrant retro gaming community would disagree with you!",
              "score": 7,
              "created_utc": 1742496326.0,
              "replies": [
                {
                  "id": "miuifhb",
                  "author": "StarsMine",
                  "body": "Not really. Gaming in the first and second generation is just dull.",
                  "score": 10,
                  "created_utc": 1742498449.0,
                  "replies": [
                    {
                      "id": "miuux5k",
                      "author": "synkronize",
                      "body": "Nostalgia >>> gameplay come on it dosent take a rocket scientist for this",
                      "score": 3,
                      "created_utc": 1742502008.0,
                      "replies": []
                    },
                    {
                      "id": "miuj3wp",
                      "author": "Lendyman",
                      "body": "Opinions are subjective obviously, but the Atari 2600 has the longest running active homebrew community for a reason.",
                      "score": 2,
                      "created_utc": 1742498643.0,
                      "replies": [
                        {
                          "id": "miuumd5",
                          "author": "G3R4",
                          "body": "I'm not even sure what you're specifically arguing here. Is it that the hardware is solid? That's the common element between older software and modern software.\n\nModern homebrew releases on these older home computers have the benefit of building on the ideas and mechanics we've collectively worked on for 40+ years at this point. The games released in the late 70s and 80s are obviously less likely to have the refinement of anything coming later.\n\nBut those older, unrefined games ARE the games from the 1st and 2nd generation. I don't think the homebrew scene 47 years later has any impact on that fact.",
                          "score": 10,
                          "created_utc": 1742501922.0,
                          "replies": [
                            {
                              "id": "miv0lib",
                              "author": "Lendyman",
                              "body": "Eh. The point is there are plenty of people who love, play and create for old hardware.",
                              "score": 1,
                              "created_utc": 1742503653.0,
                              "replies": [
                                {
                                  "id": "miv3eiz",
                                  "author": "G3R4",
                                  "body": "Well, that's definitely true and I'm glad people are this passionate about older hardware. I tend to emulate, but I'll always appreciate the romhacks and homebrew coming out for the GBA and SNES. And the demoscene stuff, of course.",
                                  "score": 4,
                                  "created_utc": 1742504478.0,
                                  "replies": []
                                },
                                {
                                  "id": "miv4ehm",
                                  "author": "Ok_Track4357",
                                  "body": "I love how you were harped on for your opinion.  Man, Reddit was way better in 1977.",
                                  "score": 1,
                                  "created_utc": 1742504778.0,
                                  "replies": [
                                    {
                                      "id": "miv7xwy",
                                      "author": "Lendyman",
                                      "body": "So was Star Wars. :D\n\nAdd to my other point, there is a market for the old stuff. ATARI wouldn't be making game watches and products like the 2600+ or 7800+ if there wasn't.",
                                      "score": 9,
                                      "created_utc": 1742505849.0,
                                      "replies": [
                                        {
                                          "id": "miwfj7k",
                                          "author": "Particular-Sell1304",
                                          "body": "It’s because it’s not ATARI as we used to know then. It’s just an IP that has been passed around and now a new organisation is in control of it so they want to cash in on their investment.",
                                          "score": 2,
                                          "created_utc": 1742520233.0,
                                          "replies": [
                                            {
                                              "id": "mix1k38",
                                              "author": "Lendyman",
                                              "body": "Well of course it isn't. But the fact that they are able to sell those products and that they are successful products enough that they keep selling more of them and different versions of them, says that there must be a market for it.",
                                              "score": 2,
                                              "created_utc": 1742528422.0,
                                              "replies": [
                                                {
                                                  "id": "mjfpxqv",
                                                  "author": "SolidOshawott",
                                                  "body": "But you're assuming this is a product that took more than $50 and IP ownership to develop",
                                                  "score": 1,
                                                  "created_utc": 1742795384.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "miv86vu",
                                          "author": "Ok_Track4357",
                                          "body": "Agreed!! And at least there WAS a Star Wars in 1977…. ;)",
                                          "score": 2,
                                          "created_utc": 1742505924.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mj4gexh",
                                  "author": "jesonnier1",
                                  "body": "Nobody is loading up Oong or Asteroids as their daily players.",
                                  "score": 1,
                                  "created_utc": 1742638124.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mizo1c3",
                          "author": "try2bcool69",
                          "body": "Because they’re luddites?",
                          "score": 1,
                          "created_utc": 1742571631.0,
                          "replies": [
                            {
                              "id": "mj07xqc",
                              "author": "Lendyman",
                              "body": "Are the people who like mechanical watches luddites? What about people who restore classic cars? Are they luddites?How about people who enjoy 17th century paintings? Or classical music or 50's jazz music? Or classic literature like Shakespeare. Are they luddites too? \n\nLiking old things doesn't make you backwards or behind the times.",
                              "score": 0,
                              "created_utc": 1742577384.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mjfpr68",
                          "author": "SolidOshawott",
                          "body": "The reason = it's just older than any others",
                          "score": 1,
                          "created_utc": 1742795274.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mix5zyb",
                      "author": "SJL174",
                      "body": "Tell me you never played the absolutely riveting tennis for two without telling me.",
                      "score": 1,
                      "created_utc": 1742530319.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "miwfa8z",
                  "author": "Particular-Sell1304",
                  "body": "1st and 2nd gen are a niche even in that community.",
                  "score": 2,
                  "created_utc": 1742520140.0,
                  "replies": []
                },
                {
                  "id": "miy4o71",
                  "author": "Paladia",
                  "body": "I think the bulk of the retro gaming community starts at NES and equivalent. As it has many games that hold up well today.\n\nBefore that, it is mainly a small niche.",
                  "score": 2,
                  "created_utc": 1742550583.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "miw417m",
              "author": "MINKIN2",
              "body": "Nah, I am going to have to disagree. They were largely arcade titles, coin munchers  still good for the most part, but nothing like the 40 hours of story gameplay of games today.",
              "score": 1,
              "created_utc": 1742516093.0,
              "replies": []
            },
            {
              "id": "mjaj7yp",
              "author": "goodoldjefe",
              "body": "Like E.T.?",
              "score": 1,
              "created_utc": 1742727760.0,
              "replies": []
            }
          ]
        },
        {
          "id": "miuut6z",
          "author": "pagerunner-j",
          "body": "Many of them were pretty poor even at the time, but hey, it was a VERY new medium. The games I still have from that time (I had an Atari 400, but a lot of the library overlaps) are things like Pac-Man, Centipede, Q*bert, Frogger…those still definitely hold up. \n\nAlso, the States and Capitals loading music was iconic. Fight me. https://m.youtube.com/watch?v=NeahRatR7eU",
          "score": 3,
          "created_utc": 1742501977.0,
          "replies": []
        },
        {
          "id": "mix39xk",
          "author": "bored_manager",
          "body": "It begs the question what is it that you long for- Atari games, or your that slice of your life when you were playing Atari games?",
          "score": 3,
          "created_utc": 1742529143.0,
          "replies": [
            {
              "id": "miy95iu",
              "author": "triad1996",
              "body": "I don't believe it begs the question.  I believe a good percentage of adults would like to relive part, if not all of their childhood whether they had a video game console or not (if nothing else...maybe do things differently).  IMO, that's not an Earth-shattering take., but that's not me.  Like I said, at the time, since home video games were a relatively new thing, it was kinda fun because that's all we knew.  A block with a line that's supposed to resemble a tank and you have to get past obstacles to shoot at the other player was ok but it wasn't anything special.  I don't think it warrants to have the game on a watch but that...just...me.\n\nIf you want to play Atari 2400 Tank, Pitfall (are Activision games on there as well?), or the janky version of Pac-Man on a watch, please have at it.  I'm in therapy for many things.  Wanting to relive my childhood ain't one of them.",
              "score": 2,
              "created_utc": 1742553134.0,
              "replies": []
            }
          ]
        },
        {
          "id": "miwascy",
          "author": "MrMaryMack",
          "body": "It’s not about the games, it’s about the friends you made along the way",
          "score": 2,
          "created_utc": 1742518499.0,
          "replies": [
            {
              "id": "miy75s7",
              "author": "triad1996",
              "body": "Eh...I was a shy kid.  95% of the time, I was playing Donkey Kong by myself.",
              "score": 5,
              "created_utc": 1742552026.0,
              "replies": []
            }
          ]
        },
        {
          "id": "miwqumb",
          "author": "silentcrs",
          "body": "Eh. I have fond nostalgia and still pick up the games from time to time.\n\nJames Rolfe and Mike Matei put it best when they were going over Atari games in “James and Mike Mondays”. Mad Bomber is a game you play when you want to just turn off your mind and get into a “zone”. Even NES had you thinking with basic stuff like Super Mario Bros. Atari is just you responding to the action. It’s kind of cool that way.",
          "score": 1,
          "created_utc": 1742524350.0,
          "replies": [
            {
              "id": "miy9l45",
              "author": "triad1996",
              "body": "I forgot about the Mad Bomber.  I stand corrected.  I enjoyed that game.",
              "score": 1,
              "created_utc": 1742553370.0,
              "replies": []
            }
          ]
        },
        {
          "id": "miyix12",
          "author": "OingoBoingo9",
          "body": "So they can GAME & Watch…\n\nBahahahaba.",
          "score": 1,
          "created_utc": 1742557891.0,
          "replies": []
        }
      ]
    },
    {
      "id": "miwvacj",
      "author": "CyranoDeBurlapSack",
      "body": "I kickstarted a “gaming smartwatch” that had supposedly been in talks with Atari. Tl;dr i got scammed for over $150. The company never refunded a dime to backers.",
      "score": 5,
      "created_utc": 1742525959.0,
      "replies": [
        {
          "id": "mxx4cfh",
          "author": "RobbMeeX",
          "body": "My Play Watch? Same company.",
          "score": 1,
          "created_utc": 1750000235.0,
          "replies": [
            {
              "id": "myb0h9s",
              "author": "CyranoDeBurlapSack",
              "body": "GameBand",
              "score": 2,
              "created_utc": 1750183754.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "miu4flf",
      "author": "MclovinsHomewrecker",
      "body": " Can I play ET?",
      "score": 10,
      "created_utc": 1742494423.0,
      "replies": [
        {
          "id": "mivd6p3",
          "author": "donaldfranklinhornii",
          "body": "No one can play ET",
          "score": 9,
          "created_utc": 1742507436.0,
          "replies": [
            {
              "id": "mivqcsv",
              "author": "bylebog",
              "body": "I graduated high school in 1992. I had an Atari in my room until graduation. I did beat ET. It's not a good game and there's definitely weird buggy bits.",
              "score": 3,
              "created_utc": 1742511617.0,
              "replies": [
                {
                  "id": "mivqilz",
                  "author": "ExoticMandibles",
                  "body": "There's a patch!\n\nhttp://www.neocomputer.org/projects/et/",
                  "score": 4,
                  "created_utc": 1742511670.0,
                  "replies": [
                    {
                      "id": "miw4z9y",
                      "author": "Fredasa",
                      "body": "I remember that page.  He goes into a lot of detail and theory but doesn't actually bring up the **one bug** that was legitimately meaningful in the game.  In fact the bug isn't even mentioned anywhere in the page so I assume it wasn't addressed.\n\nThat bug is this:\n\n_After you exit a pit and E.T's neck un-extends, E.T. will shift downward by one pixel.  If you happen to have exited a pit from above, **you will fall right back in immediately** due to the downward shift causing a collision._\n\nI know I have to give a lot of leeway to the folks he mercifully refers to as \"novices\" but as a 7 year old kid I frankly had zero difficulty navigating the game's quirks, including that bug.  Yet I can definitely imagine a lot of players simply not \"getting\" what's going on, missing the fact that E.T. is shifting down and then colliding back into the pit again.\n\nOn the other hand, he is _very correct_ to point out that _E.T._ was in fact a trailblazing game.  It's actually one of the top 10 or 15 games ever released on the console.  The bad rap the game has is largely the result of a cumulative series of circumstances, most particularly some fairly modern scapegoating done for entertainment.",
                      "score": 2,
                      "created_utc": 1742516426.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "miyvj0y",
      "author": "fuzzbox000",
      "body": "2600 games are so small and memory is so cheap that there is no excuse for only having 4 games on this thing. I'd be willing to bet that, since it makes no sense to make low-capacity memory chips nowadays, the memory in it is 99.9% empty. \n\nThis should have at least 100-250 games on it. Even if most of them are never played, it would make the customer not feel like they're being taken advantage of.",
      "score": 5,
      "created_utc": 1742562786.0,
      "replies": [
        {
          "id": "mj2pks5",
          "author": "None",
          "body": "[removed]",
          "score": 1,
          "created_utc": 1742605557.0,
          "replies": [
            {
              "id": "mk1g0rp",
              "author": "fuzzbox000",
              "body": "Well, yeah, but I’m sure some programmers or Atari won’t allow it, and for some odd reason, I think consumers would buy “250 games” before “647 games”. (random number, I don’t remember how many 2600 games existed).",
              "score": 1,
              "created_utc": 1743094413.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "miuj5hf",
      "author": "FUTURE10S",
      "body": "aw I was expecting a little physical rotatable joystick (so it can do Atari games and the Breakout games) and a button",
      "score": 2,
      "created_utc": 1742498656.0,
      "replies": [
        {
          "id": "miv91nb",
          "author": "ClumzyMunky",
          "body": "The crown is a paddle controller for breakout.",
          "score": 3,
          "created_utc": 1742506183.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mixxplw",
      "author": "stimpy97",
      "body": "Is this an advertisement?",
      "score": 2,
      "created_utc": 1742546187.0,
      "replies": []
    },
    {
      "id": "miv063a",
      "author": "DigitallyDetained",
      "body": "Aww just Centipede, Missile Command, Pong, and Super Breakout included",
      "score": 2,
      "created_utc": 1742503529.0,
      "replies": [
        {
          "id": "miw3lay",
          "author": "Upper_Rent_176",
          "body": "Berzerk would have been a good one",
          "score": 2,
          "created_utc": 1742515936.0,
          "replies": []
        },
        {
          "id": "miwcvzr",
          "author": "Xorm01",
          "body": "Yars revenge. Megalomania.  Ms PAC Man.",
          "score": 1,
          "created_utc": 1742519261.0,
          "replies": []
        }
      ]
    },
    {
      "id": "miw4i14",
      "author": "losersalwayswin",
      "body": "Do 45+ year olds with atari nostalgia want this?",
      "score": 2,
      "created_utc": 1742516257.0,
      "replies": [
        {
          "id": "miw95xk",
          "author": "Guy954",
          "body": "Not as a watch",
          "score": 2,
          "created_utc": 1742517916.0,
          "replies": []
        },
        {
          "id": "miwrerp",
          "author": "silentcrs",
          "body": "Eh, maybe. Not so much to play but as a collectible. Kind of like those tiny Pac-Man arcade cabinets. You can play the game, but it’s really more for show.",
          "score": 1,
          "created_utc": 1742524551.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmeyosy",
      "author": "JealousRhubarb9",
      "body": "Does it charge you immediately? I may pre order",
      "score": 1,
      "created_utc": 1744303650.0,
      "replies": []
    },
    {
      "id": "mur4nlc",
      "author": "Rando1ph",
      "body": "I got one but I think I am going to try to cancel it, not sure if I will be able to without getting the credit card company involved. It got delayed, and now I've lost interest. Thought my kids might think it was neat, well, not the older two, but the 6-year-old probably would have. But now it is a couple more months out, I'd just rather not mess with it.",
      "score": 1,
      "created_utc": 1748460351.0,
      "replies": []
    },
    {
      "id": "n4kp8hf",
      "author": "TurgidWilly",
      "body": "I received mine today. It's pretty crappy. It feels cheap. I've gotten $20 smartwatches from Temu that felt amazing compared to this. The game suck and are hard to play (except missle command which you just tap to fire). I wish I could return it but I already opened it as well as the extra watch band.",
      "score": 1,
      "created_utc": 1753210088.0,
      "replies": [
        {
          "id": "n4ncd8c",
          "author": "AndyCAPP_LSB",
          "body": "Mine comes tomorrow. Just a neat talking piece, nothing more I am sure.",
          "score": 1,
          "created_utc": 1753240173.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n6fprnq",
      "author": "Civ42O",
      "body": "Just got mine today. I like it because it's bare bones and doesn't need an app. The design is just the cherry on top.",
      "score": 1,
      "created_utc": 1754089482.0,
      "replies": []
    },
    {
      "id": "miv6vq2",
      "author": "BipedalWurm",
      "body": "The 80s we have at home punchline.",
      "score": 1,
      "created_utc": 1742505531.0,
      "replies": []
    },
    {
      "id": "miw4d9e",
      "author": "None",
      "body": "It does have apps dipshit it came free with your fucking turing machine",
      "score": 1,
      "created_utc": 1742516210.0,
      "replies": []
    },
    {
      "id": "miythhb",
      "author": "skyrimisagood",
      "body": "Sorry but Atari 2600 games are unplayable to me. The earliest gaming console I grew up with was NES and there's only a tiny amount of those games I'd actually still want to play in the modern day, and that would be with save states.",
      "score": 1,
      "created_utc": 1742562065.0,
      "replies": []
    },
    {
      "id": "miycxob",
      "author": "other_goblin",
      "body": "Pure AI slop",
      "score": 0,
      "created_utc": 1742555097.0,
      "replies": []
    }
  ]
}