{
  "post": {
    "title": "Sonos’ streaming box is reportedly canceled. Good riddance | Opinion: The long-rumored Sonos streaming box wasn't a good idea anyway.",
    "author": "chrisdh79",
    "id": "1ja0q9a",
    "score": 242,
    "created_utc": 1741829634.0,
    "selftext": "",
    "num_comments": 40,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ja0q9a/sonos_streaming_box_is_reportedly_canceled_good/"
  },
  "comments": [
    {
      "id": "mhi1olz",
      "author": "graesen",
      "body": "The idea of a Sonos streaming box reminds me of another short-lived and end of lifed product... The Spotify Car Thing.",
      "score": 57,
      "created_utc": 1741833233.0,
      "replies": [
        {
          "id": "mhj9gy0",
          "author": "crasscrackbandit",
          "body": "Or The Box from Pied Piper.",
          "score": 20,
          "created_utc": 1741855686.0,
          "replies": [
            {
              "id": "mhjrzxi",
              "author": "Spidaaman",
              "body": "![gif](giphy|xUA7biJu1P8G6BTYYM)",
              "score": 4,
              "created_utc": 1741866029.0,
              "replies": []
            },
            {
              "id": "mhjqwts",
              "author": "MrT0xic",
              "body": "But the box has Gavin Belson’s signature on it —Its Bold!",
              "score": 3,
              "created_utc": 1741865526.0,
              "replies": []
            },
            {
              "id": "mhjq8zt",
              "author": "mountainelven",
              "body": "This is exactly what I was thinking",
              "score": 2,
              "created_utc": 1741865216.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mhjl7bm",
          "author": "megrimlockrocks",
          "body": "Speaking of which, Roku also sells security cameras",
          "score": 2,
          "created_utc": 1741862694.0,
          "replies": []
        },
        {
          "id": "mhpx659",
          "author": "shoefly72",
          "body": "I still don’t even know what it actually was.",
          "score": 2,
          "created_utc": 1741944233.0,
          "replies": [
            {
              "id": "mhzanyb",
              "author": "afcagroo",
              "body": "It was a controller for Spotify. You connected your phone to it via Bluetooth, and the Car Thing would connect to your car's infotainment system (also via Bluetooth). The screen, buttons, and large scroll wheel made it much easier to control Spotify while in the car, rather than messing around on your phone's interface.  \n   \nI have one, and it was rather handy. Before they bailed on it and turned it into a brick.",
              "score": 1,
              "created_utc": 1742071353.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mhi45p2",
      "author": "VerifiedMother",
      "body": "Considering Walmart sells a $20 HDR capable 4k streaming box, this is entirely dumb",
      "score": 29,
      "created_utc": 1741834122.0,
      "replies": [
        {
          "id": "mhijqkr",
          "author": "hamiltonisoverrat3d",
          "body": "Their competition is the Apple TV given their consumer base and they just can’t compete with Apple’s ecosystem and R&D",
          "score": 18,
          "created_utc": 1741840504.0,
          "replies": []
        },
        {
          "id": "mhlkqk0",
          "author": "Kalraken",
          "body": "Not to mention just about every new tv is gonna stream things itself.",
          "score": 1,
          "created_utc": 1741886702.0,
          "replies": [
            {
              "id": "mhm4wab",
              "author": "VerifiedMother",
              "body": "I have 3 smart TVs: an LG with WebOS, a Samsung with Tizen, and a Hisense with Google TV, after using Google TV and WebOS, Tizen makes no fucking sense so I'd probably buy an android box for a Samsung TV again if that wasn't used almost exclusively by someone else in my house",
              "score": 2,
              "created_utc": 1741892396.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mhit3t7",
      "author": "spicymoo",
      "body": "I had 2 perfectly good play 5’s until Sonos decided they were outdated and killed them. Stupid company.",
      "score": 21,
      "created_utc": 1741845387.0,
      "replies": [
        {
          "id": "mhk33kp",
          "author": "aberch",
          "body": "I’m still using my old Play 5s to this day. Sure I use the original Sonos app, but they still work for me and play right along with the rest of my speakers.",
          "score": 4,
          "created_utc": 1741870541.0,
          "replies": [
            {
              "id": "mhq9ymg",
              "author": "StevieG63",
              "body": "I have six legacy Sonos products including a Play 5  and they work perfectly. And always have. It’s the app for the newer devices that sucks.",
              "score": 3,
              "created_utc": 1741951289.0,
              "replies": []
            },
            {
              "id": "mhk9e8k",
              "author": "spicymoo",
              "body": "Lucky or good. I never updated and kept them going but they got unplugged and could not get them operating again.",
              "score": 1,
              "created_utc": 1741872747.0,
              "replies": [
                {
                  "id": "mhlj549",
                  "author": "realribsnotmcfibs",
                  "body": "We have tons of 1st gen no issues.\n\nBad luck I think?\n\nEitherway Sonos needs to fix their shit. \n\nThousands invested all so they can roll…back? their app to the stone ages.",
                  "score": 1,
                  "created_utc": 1741886261.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mhi01jw",
      "author": "titlecharacter",
      "body": "Couldn’t agree more with the article. Utterly unnecessary product with almost no value for the customer over any number of extremely cheap competitors.",
      "score": 8,
      "created_utc": 1741832665.0,
      "replies": []
    },
    {
      "id": "mhjvf1h",
      "author": "realribsnotmcfibs",
      "body": "How about they slow down and fix their trash app. It was so much better years ago and now amongst the worst app in my phone.",
      "score": 8,
      "created_utc": 1741867527.0,
      "replies": []
    },
    {
      "id": "mhkgzzy",
      "author": "Mean_Peen",
      "body": "I dropped out of the Sonos ecosystem when they dropped support for their entire first gen of products. Waste of money and I’ll never buy in again, especially since they’re still cancelling and dropping support for products",
      "score": 4,
      "created_utc": 1741875188.0,
      "replies": []
    },
    {
      "id": "mhjx1kv",
      "author": "cripblip",
      "body": "After experiencing other Sonos software quality. That’s a hard no from me",
      "score": 3,
      "created_utc": 1741868202.0,
      "replies": []
    },
    {
      "id": "mhl1vrz",
      "author": "igobymicah",
      "body": "people are always impressed with my sonos. then i say don’t buy it lol",
      "score": 3,
      "created_utc": 1741881360.0,
      "replies": []
    },
    {
      "id": "mhpvijt",
      "author": "Merciless-Dom",
      "body": "Sonos was a great company with genuinely good products, until they shit the bed with the horrible software updates and a complete lack of care about its customers.",
      "score": 3,
      "created_utc": 1741943183.0,
      "replies": []
    },
    {
      "id": "mhibni0",
      "author": "Student-type",
      "body": "Sonos has mediocre products, with proprietary technology and they brick and strand their customers",
      "score": 4,
      "created_utc": 1741836998.0,
      "replies": [
        {
          "id": "mhzcr4e",
          "author": "afcagroo",
          "body": "That's not completely true. They have some of the best sounding WiFi speaker solutions available, and at one time they were easy to use and fairly reliable.  BUT...They are overpriced. The technology is largely proprietary. And they did totally fuck over a significant fraction of their customer base in a pretty impressive manner. It will eventually be a case study in business schools, if it isn't already. Just an amazing confluence of greed and incompetence. \n  \nThey eventually admitted they fucked up, then finally got rid of the shit CEO (and CTO too, IIRC). The new CEO appears to be trying to right the ship. It remains to be seen how well he will do.  Killing this product is a good sign. \n   \nI would love to find a WiFi sound system that's as good as Sonos used to be. Or maybe an open source software solution that would allow me to continue to use the Sonos hardware I've invested in, but not be fucked over by horrible software. Or for Sonos to get their shit together.",
          "score": 1,
          "created_utc": 1742072021.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhjkwzx",
      "author": "stoneyriver",
      "body": "😂my wiim ultra and Fosi audio amps and dac, alongside my vintage KEF speakers blows the absolute hell out of any of the Sonos gear in terms of sound quality, clarity, detail, all aspects. And I paid less than the cost of one or two Sonos speakers.\n\nI also have full streaming and wifi and Bluetooth and analog connections too - and it works continuously from room to room as I move around.\n\nSonos got greedy, the shafted their customer base and were too expensive for what they were.",
      "score": 4,
      "created_utc": 1741862542.0,
      "replies": [
        {
          "id": "mhjsrdq",
          "author": "Spidaaman",
          "body": "Doesn’t the WiiM Ultra have a dac built in?",
          "score": 1,
          "created_utc": 1741866369.0,
          "replies": [
            {
              "id": "mhopoex",
              "author": "stoneyriver",
              "body": "Yes but I prefer to use external dac. The one included on the wiim is a bit meh 🫤",
              "score": 1,
              "created_utc": 1741921101.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mhjb3is",
      "author": "None",
      "body": "Sonos, when you just didn’t want Bose, but wanted to spend Bose money",
      "score": 2,
      "created_utc": 1741856746.0,
      "replies": []
    },
    {
      "id": "mhmz678",
      "author": "Merwenus",
      "body": "Isn't Sonos the one company who always cancel features after buy?",
      "score": 1,
      "created_utc": 1741900932.0,
      "replies": [
        {
          "id": "mhzefv8",
          "author": "afcagroo",
          "body": "Not historically. But last spring they rolled out new and improved software (that is required to control the speakers). This software was needed to integrate their new, uncompetitive Bluetooth headphones into their ecosystem. \n  \nThe problem is that it was totally half-baked. Not only did it not actually run the Sonos speakers for a large fraction of the customers, it also cut out features that were previously present. As far as I know, they'd never removed significant features before.  \n   \nThey have since fired the CEO, worked on fixing the app and putting back the old features, and shitcanned yet another new product that was unlikely to be competitive.  It remains to be seen if they will completely turn things around. \n   \nThey do seem to recognize that they've managed to alienate many of their users, who previously were mostly pretty happy with the products, and in many cases avid proponents.",
          "score": 1,
          "created_utc": 1742072566.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhnv03m",
      "author": "BestCatEva",
      "body": "I’m banking on the Hoolie Box.",
      "score": 1,
      "created_utc": 1741910653.0,
      "replies": []
    },
    {
      "id": "mhotixt",
      "author": "hlessi_newt",
      "body": "how is this fucking company still in business?",
      "score": 1,
      "created_utc": 1741922590.0,
      "replies": [
        {
          "id": "mhzffz5",
          "author": "afcagroo",
          "body": "Lack of competition.  There really aren't many places you can find good quality WiFi speaker systems that are easy to setup and use and are reliable. It's a product niche that is ripe for someone to do well and dominate the market. I'm kind of amazed that Apple hasn't stepped up and stolen this product category.",
          "score": 1,
          "created_utc": 1742072893.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpym2w2",
      "author": "darksparda4",
      "body": "I think the streaming box was a bad idea but some of the alleged functions like the wireless soundbar connection/hdmi switch would be useful as a separate device especially for those TVs with only 2 hdmi 2.1 ports and multiple hdmi 2.1 devices",
      "score": 1,
      "created_utc": 1746070397.0,
      "replies": []
    },
    {
      "id": "mhi4vyk",
      "author": "adilly",
      "body": "It would be nice if they removed app functionality from the cloud and made it run locally again.",
      "score": 1,
      "created_utc": 1741834390.0,
      "replies": []
    },
    {
      "id": "mhjanh5",
      "author": "None",
      "body": "[deleted]",
      "score": -1,
      "created_utc": 1741856456.0,
      "replies": [
        {
          "id": "mhzhuwl",
          "author": "afcagroo",
          "body": "That might be true if you bought your product just before May 2024 (or after that). That's when they shit the bed with the new app.  \n  \nIt wasn't generally true before that.",
          "score": 1,
          "created_utc": 1742073679.0,
          "replies": []
        },
        {
          "id": "mhkke97",
          "author": "Crandallranch",
          "body": "I’ve had Sonos play 1’s going since 2017",
          "score": 1,
          "created_utc": 1741876225.0,
          "replies": []
        },
        {
          "id": "mhqaeoi",
          "author": "StevieG63",
          "body": "That’s absolute nonsense. I have legacy Sonos products with serial numbers from 2006 and 2008 and they work perfectly. I have 16 total and the newest is five years old. Stop spreading FUD.",
          "score": 1,
          "created_utc": 1741951498.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhy859k",
      "author": "Blunttack",
      "body": "I think the whole problem with Sonos is they try to do their own streaming and voice recognition. Just let Alexa run the whole thing, all the time. Act like a Bluetooth speaker. Not like this sort of different entity I have to bypass to allow Amazon Music to play via Alexa or the laughably bad Sonos app. I think the speakers sound decent and like that I can take the Move to different parts of the house, or away. Mini sub is pretty great in a larger ish kitchen. If everything worked all the time, I couldn’t be happier. It’s doesn’t. And I attribute that to the constant app issues and ridiculous first party streaming and voice control efforts.",
      "score": 0,
      "created_utc": 1742059294.0,
      "replies": []
    }
  ]
}