{
  "post": {
    "title": "Reviewer reports RTX 5080 FE instability — PCIe 5.0 signal integrity likely the culprit",
    "author": "diacewrb",
    "id": "1ieb9dn",
    "score": 714,
    "created_utc": 1738316602.0,
    "selftext": "",
    "num_comments": 65,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ieb9dn/reviewer_reports_rtx_5080_fe_instability_pcie_50/"
  },
  "comments": [
    {
      "id": "ma6iepj",
      "author": "FixSwords",
      "body": "Oh well, at least they aren't outrageously expensive or anything, so no big loss.",
      "score": 393,
      "created_utc": 1738324213.0,
      "replies": [
        {
          "id": "ma6znyq",
          "author": "FrizzIeFry",
          "body": "Don't worry, you wouldn't be able to buy one either way",
          "score": 83,
          "created_utc": 1738331312.0,
          "replies": [
            {
              "id": "ma78loy",
              "author": "FixSwords",
              "body": "Good guy scalpers helping a guy out.",
              "score": 36,
              "created_utc": 1738334331.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mak5ejj",
          "author": "Goosephat",
          "body": "LOL",
          "score": 1,
          "created_utc": 1738507496.0,
          "replies": []
        },
        {
          "id": "ma7zeno",
          "author": "unpopular-dave",
          "body": "do you think $1000 is outrageously expensive for a high-end GPU?\n\nI think they’re pretty fairly priced.\n\nnow, if you’re gonna pay a scalper that’s a different story. But that’s not on Nvidia",
          "score": -81,
          "created_utc": 1738342194.0,
          "replies": [
            {
              "id": "ma84xf4",
              "author": "MateTheNate",
              "body": "Back in my day a []80 Ti card would be the highest end one and cost ~$700 so yeah it is",
              "score": 41,
              "created_utc": 1738343725.0,
              "replies": [
                {
                  "id": "ma8uzit",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -25,
                  "created_utc": 1738351004.0,
                  "replies": [
                    {
                      "id": "mag8fa8",
                      "author": "Sir_Bax",
                      "body": "No it shouldn't. They just shifted numbers by 10 with RTX. 5090 is an outlier in the same way 980 or 1080 was.",
                      "score": 11,
                      "created_utc": 1738448444.0,
                      "replies": [
                        {
                          "id": "magped1",
                          "author": "None",
                          "body": "[deleted]",
                          "score": -9,
                          "created_utc": 1738453950.0,
                          "replies": [
                            {
                              "id": "majmrsw",
                              "author": "Sir_Bax",
                              "body": "Of course it's made up. But it's made up to artificially give an impression of introducing new premium tier while in fact they introduced new super low tier with intention to sell less for more.",
                              "score": 5,
                              "created_utc": 1738500223.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ma8698q",
                  "author": "unpopular-dave",
                  "body": "yep. I’m almost 40. I remember. But instead of adding TI, they changed to the 90 naming system.\n\nCorporations are gonna be greedy. Water is wet. \n\nA wise man once said, \"you’re worth what you have the capability to negotiate\"",
                  "score": -34,
                  "created_utc": 1738344095.0,
                  "replies": [
                    {
                      "id": "ma9rpcw",
                      "author": "Child-0f-atom",
                      "body": "Another wise man said “take your sanctimony and shove it up your ass”",
                      "score": 23,
                      "created_utc": 1738360314.0,
                      "replies": [
                        {
                          "id": "ma9rx9s",
                          "author": "unpopular-dave",
                          "body": "I don’t think sanctimony has anything to do with this conversation",
                          "score": -27,
                          "created_utc": 1738360377.0,
                          "replies": [
                            {
                              "id": "mahgdua",
                              "author": "KamalaWonNoCheating",
                              "body": "There's a lack of competition in the market. If there were more, the prices would come down. Nvidia is certainly taking advantage of that. \n\nIf that's a good or bad thing morally, is the question.",
                              "score": 5,
                              "created_utc": 1738462888.0,
                              "replies": [
                                {
                                  "id": "mahgjvw",
                                  "author": "unpopular-dave",
                                  "body": "I don’t think it’s morally a bad thing.\n\nBut I do wish there was more competition. \n\nIt’s just not really feasible. The initial investment is astronomical. And the ROI is risky at best.",
                                  "score": 1,
                                  "created_utc": 1738462944.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ma80r6j",
              "author": "cantevenwut",
              "body": "But it’s mid-tier in reality as it is slower than the high end cards that came out in 2022. ",
              "score": 19,
              "created_utc": 1738342567.0,
              "replies": [
                {
                  "id": "ma81dpt",
                  "author": "unpopular-dave",
                  "body": "That’s just not true. It’s not midtier. It’s the second best card available anywhere. It blows out the highest tier XTX in everything, and it’s superior to the 4080 in every way.\n\nThe 4090 is an absolute beast. Everybody agrees with that. I didn’t expect it to outperform the 4090. Especially for half the price.\n\nis it as much of a jump as everyone would want? No. But it’s still an amazing card for a great value.\n\nIt’s such a Reddit thing to be negative for the sake of being negative. It’s like people shitting on the model Y which is the best consumer car on the market. (obligatory fuck Elon)",
                  "score": -24,
                  "created_utc": 1738342738.0,
                  "replies": [
                    {
                      "id": "ma83l56",
                      "author": "cantevenwut",
                      "body": "Just speaking to the disappointing reality, not being negative for the sake of it.   \nThe 5080 is positioned as high tier certainly and it is by no means a garbage card (I'd buy one at $999 to replace my aging 3080Ti), but relative to every other generation to generation jump, it has the actual performance uplift one would expect from a 70 series card, aka mid tier. It should have been the 5070 Ti, and a theoretical 5080 could easily have bridged some of the outrageous performance/hardware gap between there and the 5090, even if it had to go back to the previous price point of $1200.",
                      "score": 26,
                      "created_utc": 1738343353.0,
                      "replies": [
                        {
                          "id": "ma83tkq",
                          "author": "unpopular-dave",
                          "body": "that’s a valid argument.\n\nbut calling it mid is why I responded. Because it’s clearly not mid",
                          "score": -2,
                          "created_utc": 1738343418.0,
                          "replies": [
                            {
                              "id": "ma859jv",
                              "author": "cantevenwut",
                              "body": "It's definitely the high end of reasonably priced hardware.",
                              "score": 5,
                              "created_utc": 1738343819.0,
                              "replies": [
                                {
                                  "id": "ma89rto",
                                  "author": "unpopular-dave",
                                  "body": "I would definitely call the second best card on the market high-end.",
                                  "score": 2,
                                  "created_utc": 1738345067.0,
                                  "replies": [
                                    {
                                      "id": "ma8bdvq",
                                      "author": "cantevenwut",
                                      "body": "That is reasonable. \nFor myself, when it comes to the raw power of the card (in this case, as a sim racing in VR user where frame gen and DLSS currently need not apply), it would go 5090 -> 4090 -> 5080.",
                                      "score": 4,
                                      "created_utc": 1738345513.0,
                                      "replies": [
                                        {
                                          "id": "ma8bqzk",
                                          "author": "unpopular-dave",
                                          "body": "Oh of course. I think everybody makes that distinction. It’s more about money than power when coming to that conclusion",
                                          "score": 2,
                                          "created_utc": 1738345616.0,
                                          "replies": [
                                            {
                                              "id": "ma8c5lv",
                                              "author": "cantevenwut",
                                              "body": "Indeed. The 4090 is essentially not on the market anymore in reality.",
                                              "score": 1,
                                              "created_utc": 1738345730.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "macuiqy",
                      "author": "SpeedflyChris",
                      "body": ">and it’s superior to the 4080 in every way.\n\n*Just barely*.\n\nGiven the performance gap to the 5090 and even the 4090, this 5080 is basically a 70-series card with upper 80-series pricing.",
                      "score": 9,
                      "created_utc": 1738406012.0,
                      "replies": [
                        {
                          "id": "maefy14",
                          "author": "unpopular-dave",
                          "body": "barely is a pre-subjective term. 10 to 30% all around.",
                          "score": -4,
                          "created_utc": 1738428867.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ma8ctwb",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 15,
                      "created_utc": 1738345917.0,
                      "replies": [
                        {
                          "id": "ma8dhpr",
                          "author": "unpopular-dave",
                          "body": "I don’t think you understand what mid means. I was being a little facetious. Yes",
                          "score": -5,
                          "created_utc": 1738346101.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ma8drrm",
              "author": "FixSwords",
              "body": "I do, yes. Certainly for something that doesn’t work properly. ",
              "score": 6,
              "created_utc": 1738346178.0,
              "replies": [
                {
                  "id": "ma8e3fb",
                  "author": "unpopular-dave",
                  "body": "interesting perspective.\n\nwhen you want high-end luxury items, you have to pay a premium price unfortunately.",
                  "score": 0,
                  "created_utc": 1738346267.0,
                  "replies": [
                    {
                      "id": "ma8feqp",
                      "author": "FixSwords",
                      "body": "Yes, I don’t think it’s high end or luxury. \n\n5090 priced around here would be fine, but this is overpriced. And as mentioned, it doesn’t work properly. ",
                      "score": 10,
                      "created_utc": 1738346635.0,
                      "replies": [
                        {
                          "id": "ma8gvoh",
                          "author": "unpopular-dave",
                          "body": "One reviewer made a report. That doesn’t mean they all don’t work properly.\n\nIt doesn’t matter what you think is high-end or luxury. It’s what the vast majority of people think. \n\nWhen something is the second best option on the market. That’s the definition of high-end.\n\nWhen it’s used to play video games, that’s the definition of luxury",
                          "score": 0,
                          "created_utc": 1738347050.0,
                          "replies": [
                            {
                              "id": "ma8ix1h",
                              "author": "FixSwords",
                              "body": "Kinda seems that at least on here people agree with my perspective and disagree with yours. \n\nHave a good evening, continuing this isn’t how I plan to spend the rest of mine. ",
                              "score": 6,
                              "created_utc": 1738347624.0,
                              "replies": [
                                {
                                  "id": "ma8jpi5",
                                  "author": "unpopular-dave",
                                  "body": "yep. I concede arguments when I’ve been bested as well. Good evening",
                                  "score": -1,
                                  "created_utc": 1738347845.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ma70z2w",
      "author": "sulivan1977",
      "body": "All 3 people who got one that wasn't a scalper.",
      "score": 141,
      "created_utc": 1738331766.0,
      "replies": [
        {
          "id": "ma8ii09",
          "author": "Same-Effect845",
          "body": "I’m one of the other 3 apparently. Getting it today to find out",
          "score": -56,
          "created_utc": 1738347507.0,
          "replies": [
            {
              "id": "ma9lhj8",
              "author": "ennuionwe",
              "body": "Read the room bro we're dunking here",
              "score": 66,
              "created_utc": 1738358536.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ma6qlwk",
      "author": "Ragnaroknight",
      "body": "Can you just use PCIe 4? If it's anything like 3-4 it probably doesn't make a huge difference anyways.\n\nEdit: Article says yes, that does indeed fix the problem.",
      "score": 74,
      "created_utc": 1738327892.0,
      "replies": [
        {
          "id": "ma9n6vx",
          "author": "flyingthroughspace",
          "body": "Gamers Nexus just did a video on PCIe 3/4/5.  There's almost zero difference between all of them, definitely nothing 99.9% of gamers would ever notice.",
          "score": 49,
          "created_utc": 1738359020.0,
          "replies": [
            {
              "id": "maejvof",
              "author": "Domascot",
              "body": "SO its just more headroom for PCIe 5.0 SSD´s, right? I mean those sharing lanes with the gpu slot on various mainboards.",
              "score": 10,
              "created_utc": 1738430027.0,
              "replies": [
                {
                  "id": "mapymsv",
                  "author": "rurigk",
                  "body": "Yes but no\n\nYes using pcie 5 gives more possibilities on other slots  but the pcie lanes used for the first slot that you use for the graphics card is not shared and it's connected directly to CPU",
                  "score": 3,
                  "created_utc": 1738582367.0,
                  "replies": [
                    {
                      "id": "mas4wl9",
                      "author": "Domascot",
                      "body": "Thats too bad. Do you happen know why? I mean, its pcie-lanes, not slots. One could have 50 on the board (just an example!) and only be able to use those which lead to an actually slotted device, aka \"general purpose lanes\", if you get what i mean. Why isnt that a desired goal?",
                      "score": 2,
                      "created_utc": 1738608188.0,
                      "replies": [
                        {
                          "id": "mb066hq",
                          "author": "rurigk",
                          "body": "Its because those PCIe lanes are physically connected from CPU to the GPU PCIe slot, each pin on the slot is one pin on CPU\n\nThe other PCIe slots some can be also direct connection and some are provided by the chipset\n\nThere is a limit of PCIe lanes when you use different slot modes there is a controller that switch or redirects some lanes to other connectors\n\nAlso the hard limit is imposed by the processor socket, lanes are not virtual, for example if you want more PCIe lanes you use something like a threadripper because it has more cpu pins for the PCIe lanes",
                          "score": 2,
                          "created_utc": 1738708520.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "magzpl4",
              "author": "Opetyr",
              "body": "Yeah and JayzTwoCents doing the exact same copying as GN since we need to have the same coverage twice say\nshowed the same thing.",
              "score": -13,
              "created_utc": 1738457267.0,
              "replies": [
                {
                  "id": "mahypu6",
                  "author": "peoplejustwannalove",
                  "body": "I mean, that is literally how science works, in pursuit of reaching consensus, so I don’t get the whining about people who make videos on the topic, overlap is kinda the point.",
                  "score": 11,
                  "created_utc": 1738469271.0,
                  "replies": []
                },
                {
                  "id": "maiky2f",
                  "author": "meunbear",
                  "body": "Not everyone watches every channel. It’s good to have multiple people doing the same test. Stay in school kids.",
                  "score": 3,
                  "created_utc": 1738478875.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ma835bv",
          "author": "trw419",
          "body": "You can manually set the bandwidth with your MB bios settings. Might also be conflicting with Resizeable BAR",
          "score": 8,
          "created_utc": 1738343230.0,
          "replies": []
        },
        {
          "id": "mac3aca",
          "author": "ArtKun",
          "body": "Just brings it down even closer to 4080S performance. Yay!",
          "score": -4,
          "created_utc": 1738390352.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma9y707",
      "author": "HypeTheory",
      "body": "Optimum talked about this in his video. Blue screens and various other glitches on 5.0, but stable on 4.0.",
      "score": 29,
      "created_utc": 1738362220.0,
      "replies": [
        {
          "id": "macmp0f",
          "author": "cloud12348",
          "body": "His issue came off as a riser one but perhaps it was more than just a riser issue",
          "score": 15,
          "created_utc": 1738401289.0,
          "replies": []
        }
      ]
    },
    {
      "id": "madstda",
      "author": "jktmas",
      "body": "I’m wondering how much the PCB extension board has to do with the signal issues. Guess we’ll have to wait for 3rd party cards to find out.",
      "score": 9,
      "created_utc": 1738421614.0,
      "replies": [
        {
          "id": "maeqnf0",
          "author": "VyseX",
          "body": "So far these reports haven been on the FE only, no? So it has everything to do with the extension board.",
          "score": 1,
          "created_utc": 1738432042.0,
          "replies": [
            {
              "id": "maf5fv9",
              "author": "jktmas",
              "body": "Well, have people really gotten 3rd party cards to test yet?",
              "score": 2,
              "created_utc": 1738436416.0,
              "replies": [
                {
                  "id": "mahaqj3",
                  "author": "grumd",
                  "body": "I'll test on Monday-Tuesday, my mobo supports pcie 5.0 too",
                  "score": 1,
                  "created_utc": 1738460970.0,
                  "replies": []
                },
                {
                  "id": "maqtesr",
                  "author": "grumd",
                  "body": "My AIB 5080 doesn't seem to have any issues with pcie 5.0, I'll update if I see any instability. Everything was smooth so far",
                  "score": 1,
                  "created_utc": 1738594630.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mg2avyq",
              "author": "bites_stringcheese",
              "body": "I had the issue with my MSI 5080 Gaming Trio OC. No riser.",
              "score": 1,
              "created_utc": 1741135433.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "macs7an",
      "author": "nineartsdragon",
      "body": "Same issue on my 5090 FE as well, sometimes it would not boot on Auto or Gen5 for PCIEX16, this is on AM5 with latest BIOS, had to set it at Gen4 so it would consistently boot. Hope this helps anyone with similar issues.",
      "score": 12,
      "created_utc": 1738404598.0,
      "replies": [
        {
          "id": "mcm7jom",
          "author": "Aggressive-Sign-6233",
          "body": "So a PCI-E 5.0 slot doesn't have to be 5.0? I can set it to 4.0 if I have issues? Ordering motherboard today.",
          "score": 1,
          "created_utc": 1739480208.0,
          "replies": [
            {
              "id": "mcmxdmn",
              "author": "nineartsdragon",
              "body": "Yes you can run it 1.1 if you want, here's the performance:\nhttps://www.techpowerup.com/review/nvidia-geforce-rtx-5090-pci-express-scaling/29.html",
              "score": 1,
              "created_utc": 1739487726.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "magk0sb",
      "author": "anapoe",
      "body": "Are we going to have to move away from the traditional PCIe connectors eventually for SI reasons?",
      "score": 1,
      "created_utc": 1738452171.0,
      "replies": []
    },
    {
      "id": "mapoey8",
      "author": "Glidepath22",
      "body": "PCIe 5.0 looks and performs like it was done just to be able to put something down on paper. It has single digit gains in percentage points",
      "score": 1,
      "created_utc": 1738576364.0,
      "replies": []
    },
    {
      "id": "mafr9lt",
      "author": "mikerfx",
      "body": "Good thing it is not affecting everybody.",
      "score": 1,
      "created_utc": 1738443068.0,
      "replies": []
    },
    {
      "id": "ma83yfg",
      "author": "xPerriX",
      "body": "Well, I guess we will be seeing PCIe 6.0 motherboards soon",
      "score": -13,
      "created_utc": 1738343455.0,
      "replies": [
        {
          "id": "ma8dukq",
          "author": "1sttimeverbaldiarrhe",
          "body": "Why? This looks like an Nvidia issue.  As per the article: \n\n>However, switching to PCIe Gen 4.0 eliminated all these problems. Given that other GPUs worked fine in the same setup, by deduction the problem likely lies with the RTX 5080 FE, in particular, its design.",
          "score": 27,
          "created_utc": 1738346199.0,
          "replies": [
            {
              "id": "ma8icxw",
              "author": "SpamingComet",
              "body": "And given that only this one person has had an issue thus far, it seems like just a faulty sample card",
              "score": -4,
              "created_utc": 1738347467.0,
              "replies": [
                {
                  "id": "maasvsy",
                  "author": "chadwicke619",
                  "body": "It’s not only this person. If I recall correctly, that dude who built the tiny SFF build with the 5090 FE also experienced problems that seemed to stem from PCIE5 that were similarly fixed from forcing 4.",
                  "score": 6,
                  "created_utc": 1738372051.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ma8yxui",
              "author": "xPerriX",
              "body": "I agree it’s nvidia issue, and as you pointed out, switching to 4.0 fixed it.  Just like cpu’s (amd) we had problems, they bios fix it, but then come out with a new motherboard chipset such as b440 to b550, to solve some out of the box issues.  Regardless of the issues, we will always see new hardware that will better utilize newly released hardware   Plus, PCIe 6.0 has been talked about and demonstrated since last year.",
              "score": -2,
              "created_utc": 1738352122.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mac5fdy",
      "author": "TheModeratorWrangler",
      "body": "Soooooo… bullish AMD. Got it.",
      "score": -9,
      "created_utc": 1738391457.0,
      "replies": []
    }
  ]
}