{
  "post": {
    "title": "Man sick of desktop crashes sues Intel for allegedly hiding CPU defect(s) — “Intel had a duty to disclose the defect because the defect is material and Intel possessed exclusive knowledge of it.”",
    "author": "a_Ninja_b0y",
    "id": "1gmkobd",
    "score": 2115,
    "created_utc": 1731078485.0,
    "selftext": "",
    "num_comments": 138,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gmkobd/man_sick_of_desktop_crashes_sues_intel_for/"
  },
  "comments": [
    {
      "id": "lw3boxu",
      "author": "Du3zle",
      "body": "Intel is calling Boeing asking “hey we have a problem, can we use your guy?”",
      "score": 434,
      "created_utc": 1731079768.0,
      "replies": [
        {
          "id": "lw3jbjp",
          "author": "None",
          "body": "Boeing’s guy: You want *me*? Did Ashton Kutcher reboot Punk’d",
          "score": 71,
          "created_utc": 1731082019.0,
          "replies": [
            {
              "id": "lw4sc4l",
              "author": "Nalcomis",
              "body": "Ashton is in hiding since his diddler friend got locked up lol",
              "score": 24,
              "created_utc": 1731095189.0,
              "replies": [
                {
                  "id": "lw5trea",
                  "author": "Chogo82",
                  "body": "P diddler",
                  "score": 8,
                  "created_utc": 1731106861.0,
                  "replies": [
                    {
                      "id": "lw82nkm",
                      "author": "svippe",
                      "body": "P fiddler",
                      "score": 2,
                      "created_utc": 1731142715.0,
                      "replies": [
                        {
                          "id": "lw86f1o",
                          "author": "TacTurtle",
                          "body": "P Diddit",
                          "score": 7,
                          "created_utc": 1731145265.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lwsq3zr",
                  "author": "sump_daddy",
                  "body": "Hes going to need to think for a bit in order to to explain how [his company that specializes in abuse prevention](https://www.thorn.org/) completely missed a serial abuser right next to him",
                  "score": 1,
                  "created_utc": 1731440215.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lw5vcp3",
          "author": "None",
          "body": "[deleted]",
          "score": 18,
          "created_utc": 1731107405.0,
          "replies": [
            {
              "id": "lwchwkk",
              "author": "None",
              "body": "Welcome to the internet I guess",
              "score": 1,
              "created_utc": 1731203801.0,
              "replies": []
            },
            {
              "id": "lw8w3ig",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1731159548.0,
              "replies": [
                {
                  "id": "lw8zdo5",
                  "author": "GrotesquelyObese",
                  "body": "The unfortunate part of being a whistleblower is no one wants to hire a whistleblower.\n\nEven if the organization is doing everything right, someone misconstruing something is enough for significant damage. \n\nAlso, coworkers are going to feel jaded even if they knew bad things were going on. People don’t like dirty laundry aired out.\n\nDude’s life was probably ruined.",
                  "score": 3,
                  "created_utc": 1731160878.0,
                  "replies": [
                    {
                      "id": "lw9004v",
                      "author": "Diggy_Soze",
                      "body": "Yeah, that was my thought, too. He tried protecting people he didn’t know and will never meet, and his quality of life went down for it.",
                      "score": 2,
                      "created_utc": 1731161126.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lw73iv0",
          "author": "MarquisDeBoston",
          "body": "Sure. Who do I need to kill?",
          "score": 4,
          "created_utc": 1731123515.0,
          "replies": [
            {
              "id": "lw7gli9",
              "author": "Du3zle",
              "body": "Everyone who has a raptor lake cpu. Is groupon still a thing?",
              "score": 3,
              "created_utc": 1731129432.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw5lkq2",
          "author": "None",
          "body": "Boeing didn't have 'a guy.'\n\nBoeing called their contact at the Department of Defense.  Boeing's human-problem went away almost immediately.  Oh, sorry, I meant: 'committed suicide.'\n\nIntel may supply the US Federal government with chips but they do not supply flying death machines to the US Department of Defense.\n\nSorry Intel.  No support for you.",
          "score": 11,
          "created_utc": 1731104180.0,
          "replies": [
            {
              "id": "lw689nf",
              "author": "None",
              "body": "Serious question:  who supplies the chips for those death machines?  I would have assumed it was intel but i dont actually know.\n\n\nEdit:  intel does manufacture chips for the military\n\n\n\nhttps://www.intel.com/content/www/us/en/newsroom/news/us-dod-picks-intel-foundry-for-ramp-c-phase-three.html \n\n\nhttps://www.investopedia.com/intel-reportedly-gets-usd3-5-billion-contract-to-make-chips-for-the-pentagon-8713225",
              "score": 6,
              "created_utc": 1731111916.0,
              "replies": [
                {
                  "id": "lw7cckq",
                  "author": "mcdithers",
                  "body": "Even flight computers can run on pretty low-spec chips, so I doubt they’re hurting for available options.",
                  "score": 4,
                  "created_utc": 1731127412.0,
                  "replies": [
                    {
                      "id": "lw8jgvw",
                      "author": "AnneOn_AMoose",
                      "body": "It’s amazing how much of the world still uses 3.5” floppy",
                      "score": 1,
                      "created_utc": 1731153606.0,
                      "replies": [
                        {
                          "id": "lw91itl",
                          "author": "GrotesquelyObese",
                          "body": "I’m surprised we are even as advanced as we are today. I think people really underestimate tech proliferation and how baldy most organizations hate changing technology requirements if things are operational. \n\n[Aging, outdated technology leaves air travel at risk of meltdown](https://amp.cnn.com/cnn/2023/01/13/business/airline-meltdowns)\n\nI asked IT to set up a Sharepoint “complaint” form, a list, and automated email (thanks for your submission! Your request number is [X]). I also wanted the list to track whether we opened the form and allowed us to change a choice from request placed, in progress, resolved.  Like a ticket tracker.\n\nHe said that was “a graduate level task.” I said give me the permissions I’ll do it in about 45 minutes. The man was baffled.\n\nIn 2014, I worked for a warehouse that utilized computers that were not advanced enough to use a computer mouse.",
                          "score": 1,
                          "created_utc": 1731161728.0,
                          "replies": [
                            {
                              "id": "lwa4sym",
                              "author": "AnneOn_AMoose",
                              "body": "I’m only over here fervently nodding",
                              "score": 1,
                              "created_utc": 1731174940.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lw5qzn8",
              "author": "KommandoKodiak",
              "body": "They can always call hillary",
              "score": -4,
              "created_utc": 1731105938.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw5o3wb",
          "author": "torjibord",
          "body": "i don’t think they can afford boeings guy anymore lol",
          "score": 3,
          "created_utc": 1731105000.0,
          "replies": []
        },
        {
          "id": "lw5sswa",
          "author": "None",
          "body": "I will accept a golden parachute to be called criminally incompetent by the masses but face no justice.",
          "score": 1,
          "created_utc": 1731106540.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw3ejn5",
      "author": "__420_",
      "body": "I have had nothing but black screens on Raptor Lake, and I'm fed up. Nothing in the bios or settings fix it. At some random point, my computer commits sudoku on itself like someone pulls the plug. Over clocking, undervolting, keeping it bone stock. Nothing. Im done with intel",
      "score": 187,
      "created_utc": 1731080617.0,
      "replies": [
        {
          "id": "lw44p37",
          "author": "AllergicToBullshit24",
          "body": "The CPU is physically damaged no update will save it.  They extended their warranty period for these which is your best option.  New BIOS updates will prevent it from happening again but no way to save a CPU that's already busted.",
          "score": 117,
          "created_utc": 1731088214.0,
          "replies": [
            {
              "id": "lw6brlo",
              "author": "ingrapaleave",
              "body": "Have the issues for the 14th gen chips been resolved? \nI had a 14900 that I ended up RMAing a few months ago. I put my 10th gen hardware into my PC while the RMA was happening but I never ended up putting the new parts back in when the replacement arrived.\nWhat I’m really asking is if I were to put the new parts in and immediately update bios would it function properly now?",
              "score": 5,
              "created_utc": 1731113148.0,
              "replies": [
                {
                  "id": "lw7snx3",
                  "author": "Gammacor",
                  "body": "Roll of the dice. \n\nIt may have process defects. It may not. \n\nIt probably does. \n\nThe process defects may be minor and only degrade the chip notably in four, five, six years. \n\nThe process defects may be major and the CPU may function exactly like your old one. \n\nThe sheer scale of this monumental fuck up is wildly understated. There's no \"fixing\" this.",
                  "score": 3,
                  "created_utc": 1731136222.0,
                  "replies": [
                    {
                      "id": "lw87t0k",
                      "author": "Elon61",
                      "body": "Process defects are FUD, all the proven issues have been addressed now so any new chip is going to be perfectly fine, and older chips will *probably* be fine if they aren’t already experiencing issues. \n\nThe process oxidation thing has *never* been shown to be the cause of *any* issue.",
                      "score": 2,
                      "created_utc": 1731146198.0,
                      "replies": [
                        {
                          "id": "lwak2k6",
                          "author": "Gammacor",
                          "body": "Uh? Absolutely the oxidation is an issue. That's what's accelerating degradation at the high voltages that Intel has been running forever now. That's why the BIOS and microcode updates are so important because they lower the voltage targets across the board. \n\nThe issue is that the barrier material that coats the copper traces was etched too much and non-uniformly, likely because the etchant was contaminated with water, and so you have a significant electromigration issue which leads to metal poisoning.\n\nLike you said, any chips produced in the last few months are fine. Anything before that, spanning at least a year if not more back, are potentially defective. There's no way to know, which was my whole point. The entirety of 13th and most of the production run of 14th Gen was affected.",
                          "score": 3,
                          "created_utc": 1731179820.0,
                          "replies": [
                            {
                              "id": "lwalhts",
                              "author": "Elon61",
                              "body": "I'm sorry but repeating unsubstantiated speculation doesn't make it any less unsubstantiated.\n\nIntel has repeatedly and explicitly claimed it's a non-issue and that the accelerated degradaation is unrelated. What you've repeated here is GN's speculation, based only on the verified fact of there being \"an oxidation issue\". That's all he had to go on before making this whole thing up.\n\nWhat we do know is that the degradation issues were still seen on chips manufactured in 2024... which is a year after the process issues were fixed, according to intel. Tech jesus has a slightly over-active imagination at times.",
                              "score": 0,
                              "created_utc": 1731180280.0,
                              "replies": [
                                {
                                  "id": "lwarvcy",
                                  "author": "Gammacor",
                                  "body": "I work in industry and can corroborate Steve's reporting. \n\nIntel of course says it's a non-issue because that's the corporate playbook.",
                                  "score": 3,
                                  "created_utc": 1731182332.0,
                                  "replies": [
                                    {
                                      "id": "lwascyf",
                                      "author": "Elon61",
                                      "body": "What can you corroborate? the fact that there was an oxidation issue? nobody ever denied that. but unless you work at intel you actually just don't know whether it causes any accelerated aging or anything else really, since there are none of those running with the new bioses and again, new chips running on old bioses still experience the same issues.",
                                      "score": 0,
                                      "created_utc": 1731182493.0,
                                      "replies": [
                                        {
                                          "id": "lwauo9x",
                                          "author": "Gammacor",
                                          "body": "From my knowledge and experience in the semiconductor fab industry, oxidation of the tantalum nitride via water contamination of the etchant (HF) most closely matches the failure analysis results of the independent analysis done by whomever GN used, as well as matches what I have heard and seen through the grapevine personally. We (the industry) know that metal migration (\"poisoning\") is accelerated when the voltage across the diffusion layer, or the contact point between two metals, is higher, just like higher voltage accelerates Galvanic corrosion. Reductively, it's the same principal. \n\nReducing the voltage with the new microcode can slow down this metal migration, and the effect is non-linear.",
                                          "score": 1,
                                          "created_utc": 1731183265.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lw7a3m4",
              "author": "MJBotte1",
              "body": "I just bought a new computer with an Intel Core, i9 I think? Will the updates protecting it be pre installed or will I need to do something to protect it?",
              "score": 0,
              "created_utc": 1731126381.0,
              "replies": [
                {
                  "id": "lw7fx2w",
                  "author": "TooStrangeForWeird",
                  "body": "Zero point in asking. Do all available updates. That's it.",
                  "score": 3,
                  "created_utc": 1731129101.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lw4drvl",
          "author": "ajcp38",
          "body": "To mitigate the issue you need to:\n1. Update BIOS\n2. Use an overclocking voltage\n3. Reduce your clock speeds (5.2-5.3 fixes it usually)\n\nTo actually fix the issue, you need a new CPU. It's cooked, done, literal trash. So, pop that cooler off, and start the RMA process.",
          "score": 29,
          "created_utc": 1731090867.0,
          "replies": [
            {
              "id": "lw7u5g8",
              "author": "Elveno36",
              "body": "Using the most updated bios released roughly a month ago for most motherboard manufactures and setting the cpu profile to Intel default prevents any further issues. Just finished RMAing my 13900k, new one seems to be performing way better than expected. Think I may have won the silicon lottery.",
              "score": 3,
              "created_utc": 1731137154.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw3vngg",
          "author": "submofo2",
          "body": "Overlooking and undervolting tends to make things worse, I would refund it if I can but if you can't try underclocking while keeping voltage up",
          "score": 12,
          "created_utc": 1731085586.0,
          "replies": [
            {
              "id": "lw7fvib",
              "author": "TooStrangeForWeird",
              "body": "This comment is pure nonsense.",
              "score": 4,
              "created_utc": 1731129079.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw5b3hu",
          "author": "oldmaninparadise",
          "body": "Auto correct? Sepaku got changed to soduku? I mean if you computer starts a game of soduku, that is a feature. It is just testing it's memory.",
          "score": 12,
          "created_utc": 1731100889.0,
          "replies": [
            {
              "id": "lw6bqjk",
              "author": "Kerrigore",
              "body": "It’s a pretty common meme to intentionally refer to it as committing Soduku.\n\nhttps://knowyourmeme.com/memes/commit-sudoku",
              "score": 11,
              "created_utc": 1731113138.0,
              "replies": [
                {
                  "id": "lw7gr50",
                  "author": "Stoicmoron",
                  "body": "Some ppl don’t know their memes.",
                  "score": 3,
                  "created_utc": 1731129511.0,
                  "replies": [
                    {
                      "id": "lw7ohfh",
                      "author": "Kerrigore",
                      "body": "How dare they not be as terminally online as me! What is the world coming to???",
                      "score": 2,
                      "created_utc": 1731133711.0,
                      "replies": [
                        {
                          "id": "lw7om2j",
                          "author": "Stoicmoron",
                          "body": "Then again there are only 3 approved memes. Peace sign, bunny ears and….fake wiener",
                          "score": 1,
                          "created_utc": 1731133786.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lw6a3iv",
              "author": "Zamzummin",
              "body": "Your post could use some autocorrect.",
              "score": 2,
              "created_utc": 1731112556.0,
              "replies": []
            },
            {
              "id": "lw6retd",
              "author": "None",
              "body": "I'm depressed and hungry. I think I'm going to commit sushi.",
              "score": 1,
              "created_utc": 1731118803.0,
              "replies": [
                {
                  "id": "lw7dpzs",
                  "author": "VirtuosoLoki",
                  "body": "to cure depression, you need to commit sake too",
                  "score": 1,
                  "created_utc": 1731128050.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lw69qpy",
          "author": "NickConnor365",
          "body": "I uh, think you meant, \"commits seppuku\". Unless you did that intestinally.",
          "score": 8,
          "created_utc": 1731112431.0,
          "replies": [
            {
              "id": "lw8m5cc",
              "author": "Ozmorty",
              "body": "8 pints in this is amazing.",
              "score": 2,
              "created_utc": 1731155025.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw7got3",
          "author": "Stoicmoron",
          "body": "Sudoku? I think you mean sudowoodo",
          "score": 2,
          "created_utc": 1731129478.0,
          "replies": []
        },
        {
          "id": "lw8df9z",
          "author": "powerexcess",
          "body": "Seppuku is ritual suicide\nSoduku is a puzzle game",
          "score": 1,
          "created_utc": 1731149905.0,
          "replies": []
        },
        {
          "id": "lw3k2nw",
          "author": "ElatedOcelot",
          "body": "Fyi, sudoku is a numbers puzzle game, seppuku would be the suicide method",
          "score": -13,
          "created_utc": 1731082241.0,
          "replies": [
            {
              "id": "lw3lj98",
              "author": "MithandirsGhost",
              "body": "r/woooosh",
              "score": 24,
              "created_utc": 1731082665.0,
              "replies": [
                {
                  "id": "lw3nql4",
                  "author": "sdot6186",
                  "body": "Not a wooosh moment here, pal",
                  "score": -38,
                  "created_utc": 1731083307.0,
                  "replies": [
                    {
                      "id": "lw3o98x",
                      "author": "MithandirsGhost",
                      "body": "I'm not your pal, buddy. Commit sudoku is a meme.  https://knowyourmeme.com/memes/commit-sudoku",
                      "score": 34,
                      "created_utc": 1731083456.0,
                      "replies": [
                        {
                          "id": "lw3q5bk",
                          "author": "sdot6186",
                          "body": "I’m not your buddy, guy! (Didn’t know the meme, my bad homie)",
                          "score": 16,
                          "created_utc": 1731084003.0,
                          "replies": [
                            {
                              "id": "lw3qgr9",
                              "author": "MithandirsGhost",
                              "body": "I'm not your guy, dude.  (Don't worry about it.  No harm no foul.)",
                              "score": 21,
                              "created_utc": 1731084094.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lw3jzgo",
          "author": "Son_of_Plato",
          "body": "Eh, you mean seppuku, right?\n\nedit: it's wierd you guys are downvoting me, the dude obviously mixed up seppuku with sudoku.",
          "score": -28,
          "created_utc": 1731082214.0,
          "replies": [
            {
              "id": "lw3p3ei",
              "author": "ajnozari",
              "body": "You missed the meme",
              "score": 16,
              "created_utc": 1731083699.0,
              "replies": [
                {
                  "id": "lw3psvb",
                  "author": "None",
                  "body": "or it's just not that funny",
                  "score": -22,
                  "created_utc": 1731083903.0,
                  "replies": [
                    {
                      "id": "lw69puo",
                      "author": "Zamzummin",
                      "body": "Nope. You lost this one.",
                      "score": 4,
                      "created_utc": 1731112423.0,
                      "replies": [
                        {
                          "id": "lwcvkth",
                          "author": "None",
                          "body": "oh no, not on reddit",
                          "score": 1,
                          "created_utc": 1731209100.0,
                          "replies": []
                        },
                        {
                          "id": "lw7g6xk",
                          "author": "TooStrangeForWeird",
                          "body": "I know the meme. It's really not funny. It's just dumb. Dickbutt has more comedic value.",
                          "score": -1,
                          "created_utc": 1731129234.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lw5inou",
              "author": "unematti",
              "body": "No, that's the joke. Poking fun at people who act like they know a culture but actually only have surface knowledge by deliberately mixing them up",
              "score": 2,
              "created_utc": 1731103255.0,
              "replies": []
            },
            {
              "id": "lw3l4yd",
              "author": "Starfox-sf",
              "body": "Harakiri",
              "score": 2,
              "created_utc": 1731082549.0,
              "replies": [
                {
                  "id": "lw3qml1",
                  "author": "trainbrain27",
                  "body": "The Cubs guy?",
                  "score": 6,
                  "created_utc": 1731084140.0,
                  "replies": [
                    {
                      "id": "lw3tjs4",
                      "author": "xXThreeRoundXx",
                      "body": "HEYYYYYY!",
                      "score": 1,
                      "created_utc": 1731084976.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lw3ta07",
              "author": "SteakandTrach",
              "body": "Like me, you aren’t 100% up to date with a meme known to 3% of the population. \n\nHere, let us metaphorically whack you on the nose with a rolled up newspaper as an out-group signifier because humans love heirarchy!",
              "score": -21,
              "created_utc": 1731084899.0,
              "replies": [
                {
                  "id": "lw3y2h8",
                  "author": "The_Chief_of_Whip",
                  "body": "If you think a downvote is the equivalent of physical assault, you should really get off reddit. Hell, even if you can’t handle people disagreeing with you and downvoting you as intended, you should probably get off reddit.\n\nNo crime has been committed towards you because the number doesn’t go up and nobody thinks you’re clever for having a whinge about it.",
                  "score": 6,
                  "created_utc": 1731086291.0,
                  "replies": [
                    {
                      "id": "lw7gar5",
                      "author": "TooStrangeForWeird",
                      "body": "So.... You don't know what metaphorically means huh?",
                      "score": 1,
                      "created_utc": 1731129287.0,
                      "replies": []
                    },
                    {
                      "id": "lw404n5",
                      "author": "SteakandTrach",
                      "body": "What sanctimonious nonsense. If you can’t handle poking fun at human behavior, you should get off Reddit. Hell, if you can’t handle people having different opinions than you, you should get off reddit. No crime has been committed by pointing out some silliness, and no one thinks you’re clever for whinging about it.",
                      "score": -10,
                      "created_utc": 1731086890.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lw4ja9f",
                  "author": "Aftershock416",
                  "body": "Here, have another swat.",
                  "score": 1,
                  "created_utc": 1731092484.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lw5l0ad",
          "author": "DelfrCorp",
          "body": "I have a 3 or 4+ years old AMD Ryzen laptop. Not first Gen, but definitely behind nowadays.\n\nIt started crashing on a daily basis about a year ago.\n\n\nCan't afford something new yet, but I am genuinely not mad at AMD or the Ryzen Processor Generation.\nI got exactly what I paid for. I wanted performance & was willing to sacrifice longevity for it. At the time, Intel had just started to lose the fight from a performance standpoint, but they still had a history of longevity going for them. That history has now gone out the window.\nIt will take 10 to 20+ years of thorough & successful investments for Intel to get catch up. They're too indentured to Big Banking/Shareholders to fix it\n\n\n\nI've gotten more longevity than expected from my laptop, despite the now increasing & blaring issues, when I get enough money again, I'm buying another AMD build.\n\n\nAMD has built a solid reputation for strength & reliability over the past 10 years, Intel has done nothing but destroy it.",
          "score": -3,
          "created_utc": 1731104001.0,
          "replies": [
            {
              "id": "lw68h31",
              "author": "mockingbird-",
              "body": "I don’t think that the issue has to do with the processor.",
              "score": 7,
              "created_utc": 1731111988.0,
              "replies": [
                {
                  "id": "lwrz3hb",
                  "author": "DelfrCorp",
                  "body": "Don't know for sure. Haven't gotten around to seriously troubleshoot, but those crashes happen because CPU Usage randomly jumps to 100%. Could be the OS. I've been doing a lot of Read/Write over the past year, downloading a ton of data, before transferring to long term storage, I've 100% my secondary non-System SSD so that almost certainly didn't help either. Been using it almost 24/7 for days, weeks of months to do some heavy transcoding with Handbrake, the list of things I've put it through is long.\n\nI suspect that there might be something happening in conjunction with Memory &/or the SSDs. Haven't treated the laptop very well either over the past year so it's not helping.\n\nIt gets a bit hot too, so that's not helping.\n\nMy whole point was, regardless of those issues, whether is caused by the processor or not, even if it is the Processor & it dies tomorrow, I got solid value out of it & was/am impressed.\n\nEvery year, I am more impressed with AMD & ARM & less impressed with Intel.",
                  "score": 1,
                  "created_utc": 1731431964.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lw7g41e",
              "author": "TooStrangeForWeird",
              "body": "Lol. Dude, troubleshoot a little. It could be the RAM or SSD and it would be an easy fix.",
              "score": 2,
              "created_utc": 1731129194.0,
              "replies": [
                {
                  "id": "lw88ytr",
                  "author": "Clean_Livlng",
                  "body": "Can be as easy as removing a stick of RAM to fix it, or even moving the RAM out of one slot and into an empty slot that isn't malfunctioning somehow.",
                  "score": 1,
                  "created_utc": 1731146977.0,
                  "replies": []
                },
                {
                  "id": "lws1u22",
                  "author": "DelfrCorp",
                  "body": "I'm aware. I actually know what I'm doing, I am a Network Professional who's been building my own PCs/Servers & maintaining/repairing my own laptops for well over a decade.\nI've gotten behind on maintaining this one & I have not been feeling well enough to actually dive into it.\n\nI've also put that thing through hell Hardware-Usage wise. I've pushed it a lot so I'm not surprised that it started to go wonky.\n\nWith that being said, that was not the point that I was trying to make.\n\nMy point was that Ryzen are solid Processors/Platforms. Given what I've put it through. I got the performance that I wanted/needed, & while at the time, I was expecting lower longevity or more issues/bugs than with Intel Chips, I had few to no issues & it has lasted longer than expected.\n\nI have gained tremendous respect for AMD through this experience & I have seen nothing but positive News about them.\n\nI have lost most respect for Intel because at the same time, it seems that all of their products have become subpar &/or plagued with issues",
                  "score": 1,
                  "created_utc": 1731432801.0,
                  "replies": [
                    {
                      "id": "lwv7sma",
                      "author": "TooStrangeForWeird",
                      "body": "Out of *literally* thousands of processors, I have had exactly two die. One is a 10th Gen i3, the other was a Pentium III. \n\nProcessors don't \"just die\". Assuming that at all is just ridiculous. That, alone, is why I really can't value your input. It's flawed from the start. \n\nBugs? Maybe. Drivers? Make sense. Longevity? It doesn't make sense. \n\nDid you mean \"future proof\"? The impossible fantasy? Because \"longevity\" means a different thing.",
                      "score": 1,
                      "created_utc": 1731471012.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lw73rnv",
          "author": "MarquisDeBoston",
          "body": "*seppuku",
          "score": 0,
          "created_utc": 1731123617.0,
          "replies": []
        },
        {
          "id": "lw7q8os",
          "author": "rowdymatt64",
          "body": "My 3 year old 5800X is going strong, highly recommend Ryzen!",
          "score": 0,
          "created_utc": 1731134754.0,
          "replies": []
        },
        {
          "id": "lw468n5",
          "author": "SeaworthinessNo1920",
          "body": "planning on switching to mac with apple silicon?",
          "score": -6,
          "created_utc": 1731088656.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw3m6ed",
      "author": "RL_Mutt",
      "body": "Uh. I’m about to purchase a Lenovo Legion PC…should I not?\n\nIt’ll be my first gaming/design rig that isn’t a laptop and I’m concerned I’m going to be investing in a dud.",
      "score": 28,
      "created_utc": 1731082852.0,
      "replies": [
        {
          "id": "lw3nldm",
          "author": "Mochinpra",
          "body": "There are 2 generations of Intel chips to avoid, make sure its not on that list.",
          "score": 41,
          "created_utc": 1731083265.0,
          "replies": [
            {
              "id": "lw3vqqa",
              "author": "borazine",
              "body": ">2 generations of Intel\n\n\nYou mean 2.000000011 generations, yes?",
              "score": 38,
              "created_utc": 1731085613.0,
              "replies": [
                {
                  "id": "lw7eah5",
                  "author": "pspahn",
                  "body": "1.9999999999 - meh good enough",
                  "score": 6,
                  "created_utc": 1731128320.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lw3qsjo",
              "author": "RL_Mutt",
              "body": "Lovely. The Legion I reaaaaaallly want has a 14th gen chip. There goes my 40th birthday gift. 😂",
              "score": 11,
              "created_utc": 1731084188.0,
              "replies": [
                {
                  "id": "lw3r8hm",
                  "author": "Starfox-sf",
                  "body": "Don’t worry you won’t remember about it by next year.",
                  "score": 11,
                  "created_utc": 1731084315.0,
                  "replies": []
                },
                {
                  "id": "lw5fwt5",
                  "author": "mnvoronin",
                  "body": "If you buy it brand new and update bios, you'll be fine.",
                  "score": 2,
                  "created_utc": 1731102398.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lw4r0tp",
              "author": "ChrisFromIT",
              "body": "You don't have to avoid them anymore. The latest bios update prevents the issue from happening.",
              "score": 4,
              "created_utc": 1731094796.0,
              "replies": []
            },
            {
              "id": "lw3yb1u",
              "author": "GSDer_RIP_Good_Girl",
              "body": "What about laptop processors? I'm looking at the Legion 7i laptop with 14th generation i9 - do these have the same problem?",
              "score": 1,
              "created_utc": 1731086360.0,
              "replies": [
                {
                  "id": "lw41stv",
                  "author": "Starfox-sf",
                  "body": "The currently sold laptops/desktops have the “fix” built-in already. The issue was that prior to the fix there existed some over voltage scenarios that made the chips degraded, but those purchasing “new” should not at the penalty of somewhat lower overall performance.",
                  "score": 9,
                  "created_utc": 1731087377.0,
                  "replies": [
                    {
                      "id": "lwbfe6k",
                      "author": "RL_Mutt",
                      "body": "This is what I actually just read this morning, that Intel has effectively found and fixed the problem. \n\nI would be buying from Lenovo direct, and after this thread I may even contact customer service to ask about whether or not they can confirm my machine will have the updated microcode. Thanks.",
                      "score": 1,
                      "created_utc": 1731190085.0,
                      "replies": []
                    },
                    {
                      "id": "lw7gf9a",
                      "author": "TooStrangeForWeird",
                      "body": "Unless you're buying some old stock, which is extremely common. Especially in brick and mortar stores. Don't come out swinging disinformation.",
                      "score": 1,
                      "created_utc": 1731129346.0,
                      "replies": [
                        {
                          "id": "lw7mjv5",
                          "author": "Starfox-sf",
                          "body": "And as soon as it Windows Update it’ll update both the microcode and (for most machines) the firmware/BIOS. So you’re the one spreading FUD.",
                          "score": 2,
                          "created_utc": 1731132599.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lw3ql94",
              "author": "secretqwerty10",
              "body": "and the newest one is not worth it",
              "score": 1,
              "created_utc": 1731084130.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw3ob6c",
          "author": "FacepalmFullONapalm",
          "body": "If you're going pre-built, go with the AMD side for the moment.",
          "score": 9,
          "created_utc": 1731083470.0,
          "replies": [
            {
              "id": "lw5lugg",
              "author": "sylfy",
              "body": "Even if you aren’t going prebuilt, go with the AMD side.",
              "score": 10,
              "created_utc": 1731104267.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw3mnid",
          "author": "batatatchugen",
          "body": "Build your own.",
          "score": 5,
          "created_utc": 1731082991.0,
          "replies": [
            {
              "id": "lwbf51w",
              "author": "RL_Mutt",
              "body": "Man, I would but I’m currently building street/track car and at a certain point I just gotta save myself the stress and spend the money.",
              "score": 1,
              "created_utc": 1731189999.0,
              "replies": [
                {
                  "id": "lwbmru9",
                  "author": "batatatchugen",
                  "body": "Understandable.\n\nAt one point our time and mental energy is worth more than some extra money.",
                  "score": 1,
                  "created_utc": 1731192617.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lw4tjmc",
              "author": "squarerootbear",
              "body": "It’s going to be pretty hard to build your own laptop",
              "score": 2,
              "created_utc": 1731095548.0,
              "replies": [
                {
                  "id": "lw6fn3r",
                  "author": "Issa_7",
                  "body": "continue weather deer fade plate water scary provide quiet placid\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                  "score": 3,
                  "created_utc": 1731114516.0,
                  "replies": []
                },
                {
                  "id": "lw72rjm",
                  "author": "Ok_Minimum6419",
                  "body": "He said not a laptop",
                  "score": 1,
                  "created_utc": 1731123199.0,
                  "replies": []
                },
                {
                  "id": "lw52vsd",
                  "author": "batatatchugen",
                  "body": "Not quite if you buy framework.\nAnd the title talks about desktops, so laptops are irrelevant in this context.",
                  "score": -2,
                  "created_utc": 1731098405.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lw3vgap",
          "author": "Darkone539",
          "body": "If it has warranty you're probably fine, and generally speaking I wouldn't risk it. My 13th gen was fine ... then I hate to fight the rma process.",
          "score": 2,
          "created_utc": 1731085529.0,
          "replies": []
        },
        {
          "id": "lw72pao",
          "author": "Ok_Minimum6419",
          "body": "Build your own",
          "score": 1,
          "created_utc": 1731123173.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw6qfog",
      "author": "skeetleet",
      "body": "Intel is doing RMAs. I did it.",
      "score": 9,
      "created_utc": 1731118438.0,
      "replies": [
        {
          "id": "lxo2xkr",
          "author": "Fabulous_Ad_3559",
          "body": "I did it 2 months ago and now its crashing again",
          "score": 1,
          "created_utc": 1731884950.0,
          "replies": []
        },
        {
          "id": "lw8oy6l",
          "author": "spekky1234",
          "body": "Not enough if they knew about the issue earlier. Class action incoming",
          "score": 1,
          "created_utc": 1731156409.0,
          "replies": [
            {
              "id": "lw8xlon",
              "author": "skeetleet",
              "body": "Cool. Hope you collect your $11.38 in 7 years.",
              "score": 2,
              "created_utc": 1731160161.0,
              "replies": [
                {
                  "id": "lw96490",
                  "author": "spekky1234",
                  "body": "Nah im AMD",
                  "score": 1,
                  "created_utc": 1731163473.0,
                  "replies": [
                    {
                      "id": "lwa9uz8",
                      "author": "heickelrrx",
                      "body": "By that logic amd knew about, Ryzen 7000 soc voltage is not being standardized by them on launch, many people burning their cpu on socket\n\nDo lawsuit coming? 🤔",
                      "score": 2,
                      "created_utc": 1731176550.0,
                      "replies": [
                        {
                          "id": "lwp6bgs",
                          "author": "spekky1234",
                          "body": "Sure",
                          "score": 1,
                          "created_utc": 1731384574.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lw5f8cr",
      "author": "MMA-Guy92",
      "body": "Intel is the new boeing",
      "score": 14,
      "created_utc": 1731102188.0,
      "replies": []
    },
    {
      "id": "lw7lpd5",
      "author": "mdiaz28",
      "body": "That’s is the most boilerplate  cause of action that’s seen commonly in lemon law cases",
      "score": 3,
      "created_utc": 1731132123.0,
      "replies": []
    },
    {
      "id": "lw85fx0",
      "author": "PotentialSpaceman",
      "body": "I recently built my first new PC in most of a decade and I went with an AMD CPU for the first time in my life on a whim, because I'd been hearing some shady stuff about Intel lately\n\nEvery since then I am getting only more and more happy with that decision",
      "score": 3,
      "created_utc": 1731144603.0,
      "replies": []
    },
    {
      "id": "lw6wzcy",
      "author": "Skiingislife42069",
      "body": "My dad’s M1 iMac crashes every single day and all he does on it is play on excel spreadsheets and read the news. Thats literally it and it crashes 2-3 times a day. Geniuses keep making him reinstall from a fresh wipe and it keeps happening.\n\nAll that to say, it’s not just Intel. They all suck.",
      "score": 7,
      "created_utc": 1731120920.0,
      "replies": [
        {
          "id": "lw7git3",
          "author": "TooStrangeForWeird",
          "body": "Probably a dead/dying SSD. It's the most common culprit.",
          "score": 4,
          "created_utc": 1731129396.0,
          "replies": [
            {
              "id": "lw8jovh",
              "author": "mister2forme",
              "body": "Well that's an easy fix, just swa.... Oh....",
              "score": 4,
              "created_utc": 1731153730.0,
              "replies": []
            },
            {
              "id": "lwdoclt",
              "author": "Skiingislife42069",
              "body": "It’s only a year and a half old. That would be ridiculous",
              "score": 1,
              "created_utc": 1731223351.0,
              "replies": [
                {
                  "id": "lwh56dy",
                  "author": "TooStrangeForWeird",
                  "body": "I've seen worse. Sometimes faulty stuff makes it through QA, or it just has an early failure. \n\nIf the techs were worth their salt (which isn't much nowadays, knowing the price of salt) they'd try checking error logs or running diagnostics. \n\nThe other options wouldn't be much better, bad power delivery or something else wrong on the motherboard.",
                  "score": 1,
                  "created_utc": 1731273541.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lw78hxr",
          "author": "Low-HangingFruit",
          "body": "Called the silicon lottery for a reason.",
          "score": 3,
          "created_utc": 1731125663.0,
          "replies": [
            {
              "id": "lw8chyr",
              "author": "Tobias---Funke",
              "body": "My i9 actually got better bench after the bois update! \n\nAnd it does run a lot cooler now.",
              "score": 1,
              "created_utc": 1731149313.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lw6pxz0",
      "author": "Wraithdagger12",
      "body": "Lisa Su: *Now I am the master*",
      "score": 1,
      "created_utc": 1731118254.0,
      "replies": []
    },
    {
      "id": "lw6q3s7",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1731118314.0,
      "replies": [
        {
          "id": "lw7gkpn",
          "author": "TooStrangeForWeird",
          "body": "No, that's why new Intel chips don't have hyper threading.",
          "score": 1,
          "created_utc": 1731129422.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw9flce",
      "author": "None",
      "body": "Maybe the crashing was from all the porn downloads",
      "score": 1,
      "created_utc": 1731166779.0,
      "replies": []
    },
    {
      "id": "lw48ysy",
      "author": "sonicjesus",
      "body": "This has always been the nature of chips. The only difference between an i3, i5, or i7 processor is how well they passed the test. The i3 is like that cousin you have who is very closely related to you genetically but licks doorknobs and thinks clouds are made of mashed potato.",
      "score": -19,
      "created_utc": 1731089455.0,
      "replies": [
        {
          "id": "lw4jz25",
          "author": "TheSpatulaOfLove",
          "body": "Wait…clouds *aren’t* made of mashed potatoes?!!?\n\n\nNext thing you’ll tell me the moon isn’t made of cheese.",
          "score": 4,
          "created_utc": 1731092689.0,
          "replies": [
            {
              "id": "lw4y4je",
              "author": "RealDickGrimes",
              "body": "Stop that, i7.. Whats wrong with you? I5 is more rational than you",
              "score": 3,
              "created_utc": 1731096946.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw5kodt",
          "author": "danielv123",
          "body": "Not quite true anymore - the 14100 has 163mm2 of silicon, the 14900k has 257. Yields are pretty great, they aren't ever losing 70% of their cores and salvaging the chip. Binning is still a thing but usually on products that are closer in the stack.\n\nNvidia 4000 series GPUs for example have 5 different dies used on the consumer side. There have been rare exceptions - 2060 KO was for example a 2060 variant based on the 2080 die, but cut down. Gaming performance was the same but blender perf was close to the bigger chip.",
          "score": 4,
          "created_utc": 1731103895.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw46dnd",
      "author": "SeaworthinessNo1920",
      "body": "macOS 4everrrrr",
      "score": -44,
      "created_utc": 1731088696.0,
      "replies": [
        {
          "id": "lw4c6sh",
          "author": "ericstern",
          "body": "> macOS 4everrrrr\n\nmacOS is an operating system, they’re not complaining about windows operating system, they’re complaining about the buggy processor.\n\nEven then, Mac’s blow hard per dollar. Upgrading basic 2024 components like ssd storage from a shit 256/512MB to 1 or two gigs can cost you $400-600+ when the price of a performance 2gb ssd is known to be around 250. Same with upgrading ram, same with other upgrades that are just aimed to give your Mac some basic specs.\n\nBut most importantly Mac can’t run Skyrim native without fiddling with something like wine or crossover",
          "score": 23,
          "created_utc": 1731090404.0,
          "replies": [
            {
              "id": "lw6p7ud",
              "author": "rnobgyn",
              "body": "Man, we can talk numbers all day but at the end of it, my experience is SO much more smooth and seamless using Mac and I can push my projects a LOT further than on my windows counterparts. If you are able to practice “buy once cry once” then a new MB Pro will keep you running for a decade easy. \n\nFor reference I’m a professional music producer and occasional video/graphic designer.",
              "score": -9,
              "created_utc": 1731117982.0,
              "replies": [
                {
                  "id": "lw7grfi",
                  "author": "TooStrangeForWeird",
                  "body": ">Man, we can talk numbers all day but at the end of it, my experience is SO much more smooth and seamless using Mac\n\nWhat?\n\n>For reference I’m a professional music producer and occasional video/graphic designer.\n\nAh. You have zero clue what you're talking about. Got it lol.",
                  "score": 8,
                  "created_utc": 1731129515.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lw46lma",
          "author": "SeaworthinessNo1920",
          "body": "Macs are just the best now , with the m4,m4 pro, m4 max chips , it supercharges the new mac lineup and performs beyond any pc in the planet",
          "score": -35,
          "created_utc": 1731088761.0,
          "replies": [
            {
              "id": "lw5gk5q",
              "author": "mnvoronin",
              "body": ">performs beyond any pc in the planet^*\n\n^(\\* assessed by comparing the benchmark on Intel Celeron M)",
              "score": 8,
              "created_utc": 1731102598.0,
              "replies": [
                {
                  "id": "lw5kwfy",
                  "author": "danielv123",
                  "body": "*and assuming you either don't care about price or are fine with 16gb ram and 256gb storage",
                  "score": 9,
                  "created_utc": 1731103966.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lw7gwpb",
              "author": "TooStrangeForWeird",
              "body": ">performs beyond any pc in the planet\n\nTell me you have no idea what you're talking about without telling me! \n\nOh wait, you did lol.",
              "score": 1,
              "created_utc": 1731129587.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}