{
  "post": {
    "title": "Low-cost device could allow homeowners to test their own tap water for lead | An experimental new device could soon allow homeowners to check for themselves, instead of waiting for the city to do so.",
    "author": "chrisdh79",
    "id": "1kztums",
    "score": 1838,
    "created_utc": 1748687044.0,
    "selftext": "",
    "num_comments": 82,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kztums/lowcost_device_could_allow_homeowners_to_test/"
  },
  "comments": [
    {
      "id": "mv825ie",
      "author": "GoldenRamoth",
      "body": "For everyone else: Home Depot has mail in kits that will let you do it for free.",
      "score": 249,
      "created_utc": 1748687498.0,
      "replies": [
        {
          "id": "mv8oaa2",
          "author": "Dougaldikin",
          "body": "I have strips I dip in my water that tell me the lead content. Do those not work?",
          "score": 34,
          "created_utc": 1748697513.0,
          "replies": [
            {
              "id": "mv8qjlj",
              "author": "GoldenRamoth",
              "body": "I know swabs are notoriously finicky for paint detection.\n\nIdk about water strips. Though the ones for aquariums aren't as good as drops.",
              "score": 25,
              "created_utc": 1748698351.0,
              "replies": [
                {
                  "id": "mva1ouu",
                  "author": "Dougaldikin",
                  "body": "Thanks for the response I’m glad this let me know there are better options.",
                  "score": 4,
                  "created_utc": 1748713383.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mv99hiv",
              "author": "thisischemistry",
              "body": "They work just fine. They aren't extremely accurate but they are good enough to give you a general idea and see if you need further testing. If they indicate that you might have a higher level of lead then collect a sample and send it to a lab for accurate testing.",
              "score": 9,
              "created_utc": 1748704597.0,
              "replies": [
                {
                  "id": "mva0dr1",
                  "author": "Dougaldikin",
                  "body": "Cool thank you for the response mine showed zero lead and a ton of carbonate which makes sense due to the water clearly being very hard due to the abundance of limestone in our area and it being well water. Central PA.",
                  "score": 9,
                  "created_utc": 1748712984.0,
                  "replies": [
                    {
                      "id": "mva32wh",
                      "author": "thisischemistry",
                      "body": "Yeah, I'd expect a lot of carbonates in that kind of area. An ion exchange resin is probably best for that. Reverse osmosis is also excellent but it's a bit more expensive, as well as energy and water wasteful.",
                      "score": 6,
                      "created_utc": 1748713806.0,
                      "replies": [
                        {
                          "id": "mva8nwt",
                          "author": "Dougaldikin",
                          "body": "Awesome I will look into it thanks again!",
                          "score": 2,
                          "created_utc": 1748715550.0,
                          "replies": [
                            {
                              "id": "mvaa8vl",
                              "author": "thisischemistry",
                              "body": "A well-designed water treatment system is a wonderful thing that will save you money in the long run. Even if you just treat the water that goes to your water heater and such, that will prevent scale and corrosion that tends to destroy such things.",
                              "score": 8,
                              "created_utc": 1748716055.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mv9bbwa",
              "author": "rearwindowpup",
              "body": "Depending on where you got them and the brand they may or may not be accurate.  Theres apparently a lot of test strips and swabs on Amazon that are basically useless.",
              "score": 5,
              "created_utc": 1748705169.0,
              "replies": []
            },
            {
              "id": "mv8wyjv",
              "author": "Runswithchickens",
              "body": "I have a well and wanted to be sure, so I went with this site as it came up in a lot of threads. Wasn’t cheap, but all is well with the well.\n\nhttps://watercheck.com/",
              "score": 5,
              "created_utc": 1748700620.0,
              "replies": [
                {
                  "id": "mva1ije",
                  "author": "Dougaldikin",
                  "body": "I also have a well thank you for the resource.",
                  "score": 2,
                  "created_utc": 1748713329.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mv8bypj",
          "author": "lumberjack_dan",
          "body": "Those are just ads get your info and bombard you with offers to get you to buy a water softener or house water filter. I don't think they actually test it.",
          "score": 63,
          "created_utc": 1748692472.0,
          "replies": [
            {
              "id": "mv8cc2z",
              "author": "GoldenRamoth",
              "body": "They did on mine. I sent my water in and got a water report after a couple of weeks.\n\nBut yes, they do it to sell you the fix.",
              "score": 51,
              "created_utc": 1748692640.0,
              "replies": [
                {
                  "id": "mv8q2bh",
                  "author": "TMQ73",
                  "body": "We do a literal ton of water testing for schools along with other soil, water, and air sampling. There is allot of sketchy stuff that you can get at Home Depot or online.  First are proper sampling bottles/methods used. Does the company have a licensed/certified lab. Regardless if company used  another lab they should send you all the lab reports including chain of custody documents.",
                  "score": 17,
                  "created_utc": 1748698174.0,
                  "replies": [
                    {
                      "id": "mvcbdth",
                      "author": "itsKevv",
                      "body": "Any companies that you recommend for water testing?",
                      "score": 1,
                      "created_utc": 1748740840.0,
                      "replies": [
                        {
                          "id": "mvcbqtl",
                          "author": "TMQ73",
                          "body": "Can only speak to my area. I would look up certified labs in your state and local environmental firms.",
                          "score": 1,
                          "created_utc": 1748740982.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mvbe7z3",
                  "author": "doctorcapslock",
                  "body": "isn't that a conflict of interest",
                  "score": 3,
                  "created_utc": 1748728776.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mv9a3b3",
              "author": "Paxoro",
              "body": "Pretty much this. *Never* get your stuff \"sampled\" by an entity that is invested in getting you to spend money to \"solve\" the issue.\n\nOf course Culligan is going to tell you that there's \"a lot of bad stuff\" in your water - they stand to profit immensely from selling you a solution.\n\nGet a third party entity to test your stuff, or better yet, your municipality/county will probably happily test it for free or low cost. If you go the third party route,  make sure they are certified by your state to run those tests in their lab. And make sure the report they give you is comprehensive and includes all chain of custody forms.\n\nI haven't worked at the state office that handled this stuff in years and I still can remember horror stories of people calling in saying they think they got scammed into buying some expensive equipment.",
              "score": 13,
              "created_utc": 1748704784.0,
              "replies": []
            },
            {
              "id": "mv9einu",
              "author": "BigCommieMachine",
              "body": "I’d check your local university: I bet they’ll do it for free",
              "score": 3,
              "created_utc": 1748706156.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mv95wgy",
          "author": "ohiocodernumerouno",
          "body": "you dont get any results from those tests. just an idiot that shows up and says we can fix your water but it will be expensive.",
          "score": 3,
          "created_utc": 1748703483.0,
          "replies": []
        },
        {
          "id": "mv994uf",
          "author": "thisischemistry",
          "body": "I don't know about free but you can buy one for $22 that gets you the result in 10 minutes:\n\nhttps://www.homedepot.com/p/Safe-Home-Do-it-Yourself-Lead-in-Water-Test-Kit-SH-PBDIY1/308899171",
          "score": 3,
          "created_utc": 1748704487.0,
          "replies": []
        },
        {
          "id": "mv88769",
          "author": "sravin19",
          "body": "How to get this?",
          "score": 1,
          "created_utc": 1748690689.0,
          "replies": [
            {
              "id": "mv8btyj",
              "author": "GoldenRamoth",
              "body": "Walk down the plumbing or filtration aisle, I don't remember which. They're usually hanging on the walls\n\nOr, you can just ask customer service where they are.\n\nOr check here: https://www.homedepot.com/services/c/water-treatment/879700ce6\n\nKeep in mind, their goal is to sell you the equipment to fix any issues you find. So they are incentives to give you the water check for free. Mine was tested good, so they didn't any of my money heh",
              "score": 16,
              "created_utc": 1748692412.0,
              "replies": [
                {
                  "id": "mv8fx4a",
                  "author": "samarnold030603",
                  "body": "At the store near me they have them on a free standing display basically blocking the exit that you have to walk around 🙄",
                  "score": 5,
                  "created_utc": 1748694204.0,
                  "replies": []
                },
                {
                  "id": "mv9a1g1",
                  "author": "thisischemistry",
                  "body": "They will spam your email, regular mail, and phone for years afterwards, though.\n\nI'd just buy the $20 DIY test kit they sell, it's worth it.\n\nhttps://www.homedepot.com/p/Safe-Home-Do-it-Yourself-Lead-in-Water-Test-Kit-SH-PBDIY1/308899171",
                  "score": 5,
                  "created_utc": 1748704768.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mvdiq47",
          "author": "sparklestarshine",
          "body": "Yep, just after the registers on your way out in my store!  I somehow have excess copper in my blood, so I’ve been testing anything and everything and figured I’d do a lead test as well. Radon detectors, too!",
          "score": 1,
          "created_utc": 1748760181.0,
          "replies": []
        },
        {
          "id": "mvf9q6f",
          "author": "billythygoat",
          "body": "The internet said those are sketchy and they mostly just want to upsell you shit.",
          "score": 1,
          "created_utc": 1748789650.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mv8asfz",
      "author": "shitposts_over_9000",
      "body": "unless someone is messing up the pH of your water or you have recently done work on lead pipes without replacing them (naughty naughty) there is little need for persistent testing if you are on municipal water.\n\npre-ban lead pipes are old enough that effectively zero reactive lead is still in contact with the water supply",
      "score": 51,
      "created_utc": 1748691934.0,
      "replies": [
        {
          "id": "mvanmju",
          "author": "mysecondaccountanon",
          "body": "*glances at Pittsburgh’s lead crisis*\n\nI’m glad to have gotten ours fixed by the water authority, but my gosh it has been such an issue for my whole life. Growing up we were told do not drink from the faucet by the county health dept and even all these years later with our house now fixed, I still feel weird doing it, I really don’t still.",
          "score": 11,
          "created_utc": 1748720321.0,
          "replies": []
        },
        {
          "id": "mvf9vtq",
          "author": "billythygoat",
          "body": "I feel like a test every 10 years should be nice.",
          "score": 2,
          "created_utc": 1748789696.0,
          "replies": [
            {
              "id": "mvhs9ya",
              "author": "shitposts_over_9000",
              "body": "municipal water is typically tested far more frequently than that, in my state at least quarterly for items like lead and weekly or even multiple times a day in some cases for the conditions that would result in lead leaching (my city claims they average a test every 10 minutes from somewhere in the system)\n\nif your municipal water authority is incompetent you would need to test every few months, if your water authority is competent then the conditions for raiding lead levels are going to be caught by them far before a 10 year testing cycle is going to catch them.",
              "score": 3,
              "created_utc": 1748817441.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mvdbmju",
          "author": "GooseSongComics",
          "body": "Isn’t it the friction due to hardness or minerals, of the water removing lead particles which then go into your glass? Regardless of the lead being reactive or not.",
          "score": 1,
          "created_utc": 1748756261.0,
          "replies": [
            {
              "id": "mvecqfz",
              "author": "shitposts_over_9000",
              "body": "kind of the opposite.\n\nthe US banned lead in drinking water plumbing in the safe drinking water amendments of 1986.  most locations stopped using pure lead pipes far, far before that and this ban only made the tiny trace amounts in brass fittings illegal.  pretty much all water in the US has dissolved mineral content and those minerals will deposit very solidly on fresh metal surfaces like lead or copper, if your water is particularly hard this can be in as little as a month.\n\nwater gets lead leached into it primarily through corrosion and the mineral lining prevents that corrosion.  The prime risk is the lack of flowing water combined with the water being too soft and too acidic is the highest risk for that happening.  That is why most states have the EPA and/or health department advising that it you have 80s plumbing or earlier that you should flush your tap for 3-5 minutes before you first use the water for drinking or cooking for the day.\n\nFlint and Pittsburg made their water acidic.  when water that is acidic sits in the pipe unmoving it very slowly dissolves whatever it is in contact with.  for the first weeks or months this is the mineral deposits, after that it is the lead.  when you wake up in the morning and have your first glass of water eventually the trace amounts of lead rise above the level present in the water naturally.\n\nYou cannot completely avoid lead, even without manmade sources it is present in the natural environment, but it has significant and long lasting effects in relatively low levels so minimizing unnecessary exposure where practical is important to consider, but in most cases there is not all that much more risk with normal water if nothing is being worked on in the system.",
              "score": 3,
              "created_utc": 1748777518.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mv9bkwn",
          "author": "Agreeable_Sound_7724",
          "body": "Everyone on municipal water should get their intake tested.  Putting aside canal or well water sources which have the potential to be worse. Depending on where you live in the US, municipal water can obtain many contaminants. Arsenic, chlorine, and mercury are used to \"kill\" bacteria at large scale for some water districts, but you don't want to drink those. Fluoride is also common in municipal water, which is great for tooth enamel support but like mouth wash you don't want to drink that outright either. And this is before we even mention lead or hexavalent chromium levels. Don't trust the bare minimum by local governments to make municipal water a slow poison. \n\nFood for thought, you not only drink tap water but when you shower or bathe your largest organ (skin) absorbs it, then if it's a hot shower like some enjoy or you have a mist setting on your shower head you are also breathing it in. Bottled water is also an OK workaround, but never forget microplastic leeching happens to EVERY plastic bottle. Get your water comprehensively tested. Eco Water is one company that will do it for free. I do not work for Eco Water. Don't do this for me, do it for YOU and your loved ones.",
          "score": -14,
          "created_utc": 1748705248.0,
          "replies": [
            {
              "id": "mv9f2cy",
              "author": "EpicForevr",
              "body": "man, respectfully there’s a point where you are schizo-posting, and i think this has passed that point. you just can’t compare tap water to mouthwash. you lose all credence.",
              "score": 17,
              "created_utc": 1748706325.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mvcqfbt",
      "author": "Tankninja1",
      "body": "As opposed to the water test strips that you can buy at any hardware store where you can get like 100 test strips for $10?",
      "score": 8,
      "created_utc": 1748746539.0,
      "replies": []
    },
    {
      "id": "mv89ey4",
      "author": "Any_Wrangler_4822",
      "body": "Low cost to test high cost to fix.",
      "score": 5,
      "created_utc": 1748691284.0,
      "replies": []
    },
    {
      "id": "mv8495v",
      "author": "Lopsided_Speaker_553",
      "body": "For people living in a country with adequate standards: no need to test water for lead 👍",
      "score": 30,
      "created_utc": 1748688657.0,
      "replies": [
        {
          "id": "mv861jl",
          "author": "lidelle",
          "body": "Is that list longer than 10 countries? Do they regularly update the pipes delivering water to residential homes? I’m curious not trying to be an ass. One of the issues with lead in our system has to do with the pipes that deliver the water to homes. We can replace the pipes all the way to the street but the city/county/state maintains the lines to and from the water facilities.",
          "score": 28,
          "created_utc": 1748689594.0,
          "replies": [
            {
              "id": "mv8kvd7",
              "author": "cafk",
              "body": "Replacing them with modern pipes has been mandatory since ~1970-1980 for the UK & Germany from what i managed to quickly look up.  \nSo if an old broken mains line was lead based - it has to be replaced for the past ~40-50 years, instead of fixing the broken pipe (assuming segment).\n  \nAnd drinking water Directives in place since late 90s required mitigations if lead levels were above 25ug/L, since 2010 10um/L and since 2020 it's been reduced to 5ug/L.  \n  \nBased on an older study from 2009, around 25% of households back then still had lead pipes somewhere in the whole chain.",
              "score": 9,
              "created_utc": 1748696211.0,
              "replies": [
                {
                  "id": "mv8nwdy",
                  "author": "lidelle",
                  "body": "Man. First world countries must be nice! (Im in the US)",
                  "score": 10,
                  "created_utc": 1748697370.0,
                  "replies": [
                    {
                      "id": "mv98hxx",
                      "author": "Blurgas",
                      "body": "Something to remember that Germany could fit within the space Wisconsin, Illinois, Indiana, and Michigan take up.  \nUK would fit within Wisconsin, Illinois, and Indiana  \nThe US also has about 4x the population of Germany and nearly 5x that of the UK.  \n  \nAlso the EPA is requiring utility companies to find and replace all lead pipes within 10 years.  Whether or not that will actually happen with current events I couldn't tell you.",
                      "score": 12,
                      "created_utc": 1748704288.0,
                      "replies": [
                        {
                          "id": "mv9uq2s",
                          "author": "lidelle",
                          "body": "Bro. It’s not even safe to drink the water here anywhere and that is controlled by state government. So the states lack the funding and initiative to fix anything for our citizens. Water quality isn’t a fed responsibility. I called to get a water report from the state monopoly on water and they started questioning me about why I wanted to know and who I worked for. This place is abysmal. The fed does very little to protect our water rights. Btw: my ONE cause I donate to is the state water conservation group. The EPA continues to roll back protections allowing states/companies to poison our water. We are large nation, but the size isn’t the issue. It’s the corruption.",
                          "score": 2,
                          "created_utc": 1748711259.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mv8jvx8",
              "author": "Lopsided_Speaker_553",
              "body": "Yes. That list is surely longer than 10.\n\nLead pipes are known to be hazardous since about 2 millenia now. My country phased them out around 50 years ago. At every level.\n\nThe only reason countries still have them today is lack of money or lack of morals, imo.\n\nIt's expensive to replace them, and when your government has no health standards that would cost big corps extra money, it will take another century before they have been replaced.",
              "score": -2,
              "created_utc": 1748695828.0,
              "replies": [
                {
                  "id": "mv8xuzi",
                  "author": "WarningPleasant2729",
                  "body": "I got a letter from my city last summer saying we had lead service lines supplying my house.  but it’s all good don’t freak out the water is fine trust me bro. \n\nHate it here",
                  "score": 0,
                  "created_utc": 1748700925.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mv9zuxn",
      "author": "TEOsix",
      "body": "Like my fridge, this would say replace filter a few months after installation until I move out, the fridge dies, or I die.",
      "score": 2,
      "created_utc": 1748712824.0,
      "replies": []
    },
    {
      "id": "mvbripd",
      "author": "Gheekers",
      "body": "Scottish tap water is unreal .",
      "score": 2,
      "created_utc": 1748733432.0,
      "replies": []
    },
    {
      "id": "mvdxjfi",
      "author": "Statharas",
      "body": "After the Veritasium video I no longer fear lead as much, tbh...",
      "score": 2,
      "created_utc": 1748768959.0,
      "replies": []
    },
    {
      "id": "mv8f6g3",
      "author": "Zerocoolx1",
      "body": "What kind of shitty country still has this problem?",
      "score": 6,
      "created_utc": 1748693887.0,
      "replies": [
        {
          "id": "mvc1ohg",
          "author": "johnson7853",
          "body": "I’m in Canada and have lead pipes.",
          "score": 9,
          "created_utc": 1748737140.0,
          "replies": [
            {
              "id": "mvnhb6q",
              "author": "Neo_Techni",
              "body": ":O",
              "score": 1,
              "created_utc": 1748896113.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mvb0akv",
          "author": "DramaticStability",
          "body": "The UK, in certain areas. It's becoming an increasingly recognised issue.",
          "score": 7,
          "created_utc": 1748724290.0,
          "replies": []
        },
        {
          "id": "mvaf9ay",
          "author": "pkinetics",
          "body": "Unfortunately, you'd be surprised at the number of first world countries that still have lead service lines connecting from the water mains to the properties. It's an old problem that people rarely want to address\n\nLead plumbing inside houses isn't going to be replaced without substantial costs.",
          "score": 10,
          "created_utc": 1748717662.0,
          "replies": []
        },
        {
          "id": "mv8xyth",
          "author": "WarningPleasant2729",
          "body": "‘Merica",
          "score": 8,
          "created_utc": 1748700960.0,
          "replies": [
            {
              "id": "mv9n87o",
              "author": "Zerocoolx1",
              "body": "Ah yes, the most advanced and powerful country in the world. The country that says it’s number 1 (really it’s just a number 2), the land of the free.",
              "score": 3,
              "created_utc": 1748708907.0,
              "replies": [
                {
                  "id": "mvdj4fm",
                  "author": "renohockey",
                  "body": "The same country that did the job so well 100 year old mains are still functional and don't leach unless disturbed. Oh, and the same country that, like it or not, is responsible for your comment not being in German.",
                  "score": 2,
                  "created_utc": 1748760409.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mv8j7no",
      "author": "preparingtodie",
      "body": "I wonder if this could be used to test for lead in foods or spices.  Like, grind up whatever you want to test, mix it in distilled water, and test that.",
      "score": 2,
      "created_utc": 1748695564.0,
      "replies": [
        {
          "id": "mv8u734",
          "author": "daxon42",
          "body": "It’s beyond time to test all spices snd supplements in the food supply.",
          "score": 1,
          "created_utc": 1748699667.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mvaj98a",
      "author": "mountaindoom",
      "body": "And then do what about it?",
      "score": 1,
      "created_utc": 1748718941.0,
      "replies": []
    },
    {
      "id": "mve6qx4",
      "author": "the_storm_rider",
      "body": "Let me guess - the founder’s name is Holmes?",
      "score": 1,
      "created_utc": 1748774425.0,
      "replies": []
    },
    {
      "id": "mvglm12",
      "author": "bacon_greece",
      "body": "While cool it still feels like turbotax for water. Where’s my taxes going?",
      "score": 1,
      "created_utc": 1748803902.0,
      "replies": []
    },
    {
      "id": "mvwe8lu",
      "author": "DontWreckYosef",
      "body": "Detroit is going to light up like a Christmas tree",
      "score": 1,
      "created_utc": 1749012764.0,
      "replies": []
    },
    {
      "id": "mv8h3b5",
      "author": "JMJimmy",
      "body": "Or just take a water sample to your local municipal facility where they'll test it for 300+ different things for $60",
      "score": 0,
      "created_utc": 1748694696.0,
      "replies": []
    },
    {
      "id": "mv9ha3k",
      "author": "Soulpatch7",
      "body": "i’ve been wondering when this will be true for home x-rays",
      "score": 1,
      "created_utc": 1748707012.0,
      "replies": []
    },
    {
      "id": "mvanped",
      "author": "MisterRipster",
      "body": "every public library should have one for check out",
      "score": 1,
      "created_utc": 1748720346.0,
      "replies": [
        {
          "id": "mvngm6z",
          "author": "Neo_Techni",
          "body": "why would anyone downvote this?",
          "score": 1,
          "created_utc": 1748895916.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mv9n78k",
      "author": "gwalliss18",
      "body": "Ah yes, America: where even your lead poisoning test comes with a sales pitch and a coupon for a water softener.",
      "score": 1,
      "created_utc": 1748708898.0,
      "replies": []
    },
    {
      "id": "mv8fweh",
      "author": "b_a_t_m_4_n",
      "body": "To what end when no-one that has to rely on low cost devices can afford to replace their water pipes?",
      "score": 0,
      "created_utc": 1748694196.0,
      "replies": []
    },
    {
      "id": "mv9cubk",
      "author": "checker280",
      "body": "Great. So now we know we are fucked while the city refuses to fix the problem.",
      "score": 0,
      "created_utc": 1748705637.0,
      "replies": []
    },
    {
      "id": "mv8kqxo",
      "author": "JohnTitorsdaughter",
      "body": "This represents a complete failure of government.",
      "score": -1,
      "created_utc": 1748696163.0,
      "replies": []
    },
    {
      "id": "mvc1myu",
      "author": "VikingBlade",
      "body": "Now how to we get our fluoride back in it safely?",
      "score": 0,
      "created_utc": 1748737124.0,
      "replies": []
    },
    {
      "id": "mv911hz",
      "author": "DJKGinHD",
      "body": "This is great, but I wonder if they're single-use and going to create a lot of additional plastic waste.",
      "score": -1,
      "created_utc": 1748701949.0,
      "replies": []
    },
    {
      "id": "mvgs0vb",
      "author": "asdwarrior2",
      "body": "Oh the joys of capitalism",
      "score": 0,
      "created_utc": 1748805850.0,
      "replies": [
        {
          "id": "mvnghih",
          "author": "Neo_Techni",
          "body": "saving lives? Yes, I agree",
          "score": 1,
          "created_utc": 1748895879.0,
          "replies": [
            {
              "id": "mvpfm81",
              "author": "asdwarrior2",
              "body": "Lol you are in deep. The water should be government's job. In my country the tap water is so clean that this kind of product is a waste of money",
              "score": 1,
              "created_utc": 1748919662.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mv9gdzo",
      "author": "glass_gravy",
      "body": "and then…",
      "score": -1,
      "created_utc": 1748706732.0,
      "replies": []
    },
    {
      "id": "mvbirpu",
      "author": "mover999",
      "body": "And trump will ban these also",
      "score": -2,
      "created_utc": 1748730361.0,
      "replies": []
    }
  ]
}