{
  "post": {
    "title": "Playdate is getting a second season of games in 2025",
    "author": "AliTVBG",
    "id": "1ggnkgn",
    "score": 1136,
    "created_utc": 1730404788.0,
    "selftext": "",
    "num_comments": 135,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ggnkgn/playdate_is_getting_a_second_season_of_games_in/"
  },
  "comments": [
    {
      "id": "lus9xah",
      "author": "blackbright22",
      "body": "I do like my Playdate but I wish there was a way to turn it off properly so that the battery doesn't constantly just drain all the time.",
      "score": 198,
      "created_utc": 1730421296.0,
      "replies": [
        {
          "id": "lushd40",
          "author": "verdeverdes",
          "body": "For real! I barely play it but I spend most of the time recharging the damn thing.",
          "score": 71,
          "created_utc": 1730424093.0,
          "replies": []
        },
        {
          "id": "lut8d3q",
          "author": "None",
          "body": "[removed]",
          "score": 24,
          "created_utc": 1730435767.0,
          "replies": [
            {
              "id": "lutcoew",
              "author": "blackbright22",
              "body": "I basically let it drain fully empty most of the time and only charge it before I am actually going to play a game on there. Not great for spontaneous gaming but less bothersome than constant charging.",
              "score": 12,
              "created_utc": 1730438230.0,
              "replies": [
                {
                  "id": "lutpuhb",
                  "author": "Abba_Fiskbullar",
                  "body": "Leaving lithium batteries at a low state of charge degrades their capacity pretty quickly.",
                  "score": 15,
                  "created_utc": 1730447431.0,
                  "replies": [
                    {
                      "id": "luv8240",
                      "author": "leaky_wires",
                      "body": "Fully charged storage also degrades their capacity fairly rapidly.\n\nI don't think there's a winning play. \n\nDevices should be able to be turned off.",
                      "score": 7,
                      "created_utc": 1730473377.0,
                      "replies": [
                        {
                          "id": "luw09zm",
                          "author": "None",
                          "body": "Nahhhh leaving then full isn't anywhere near as damaging as leaving then dead flat. You will never properly recover a flat battery.",
                          "score": 2,
                          "created_utc": 1730482256.0,
                          "replies": []
                        },
                        {
                          "id": "luwoy9n",
                          "author": "Abba_Fiskbullar",
                          "body": "Most recommendations I see are to keep powered off devices around 60%.",
                          "score": 1,
                          "created_utc": 1730489972.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "luwo4bn",
          "author": "Sethithy",
          "body": "If only the crank charged it while you play...",
          "score": 9,
          "created_utc": 1730489706.0,
          "replies": [
            {
              "id": "luwpxy9",
              "author": "blackbright22",
              "body": "Lol that is genius.",
              "score": 3,
              "created_utc": 1730490282.0,
              "replies": []
            },
            {
              "id": "lux1kv0",
              "author": "Got_2_Git_Schwifty",
              "body": "I’ve never heard of this and I legit thought that’s what the crank is for. What’s the crank actually do?",
              "score": 2,
              "created_utc": 1730494006.0,
              "replies": [
                {
                  "id": "luz9es4",
                  "author": "_RADIANTSUN_",
                  "body": "It's an input mechanism.",
                  "score": 2,
                  "created_utc": 1730526494.0,
                  "replies": [
                    {
                      "id": "lve1t15",
                      "author": "Got_2_Git_Schwifty",
                      "body": "For a fishing game? I’m seriously asking. Don’t make me google it.",
                      "score": 1,
                      "created_utc": 1730745610.0,
                      "replies": [
                        {
                          "id": "lvf28d4",
                          "author": "_RADIANTSUN_",
                          "body": "Anything where smooth rotational input makes sense. \n\nE.g. there's one game where a ball is rolling on top of a rod. The rod has solid \"discs\" along its length, each disk has \"gaps\" where the ball can pass through. You have to rotate the crank, to rotate the rod. So the disks rotate to align with the ball, so the ball can pass through to the end.",
                          "score": 1,
                          "created_utc": 1730756391.0,
                          "replies": [
                            {
                              "id": "lvfsdnp",
                              "author": "Got_2_Git_Schwifty",
                              "body": "I know all of these words, but the order you put them in… Wut?\n\nAi or nd??",
                              "score": 1,
                              "created_utc": 1730764850.0,
                              "replies": [
                                {
                                  "id": "lvfuu8n",
                                  "author": "_RADIANTSUN_",
                                  "body": "Idk, maybe you have a reading comprehension issue. I thought it was a pretty straightforward description, here is the game (apologies for annoying nerd review guy):\n\nhttps://youtu.be/9K1ouh_qIEI",
                                  "score": 2,
                                  "created_utc": 1730765692.0,
                                  "replies": [
                                    {
                                      "id": "lvzbmaw",
                                      "author": "Got_2_Git_Schwifty",
                                      "body": "Ok…after seeing the visual it makes so much sense. You actually described it perfectly. I do have issues with reading comprehension tho. Until I grasped the concept in a spatial sense I was lost af. Thought you were a bot, but it was me not visually constructing your words! Cheers!",
                                      "score": 1,
                                      "created_utc": 1731019586.0,
                                      "replies": [
                                        {
                                          "id": "lw2yfhv",
                                          "author": "_RADIANTSUN_",
                                          "body": "No prob, glad to clear it up!",
                                          "score": 1,
                                          "created_utc": 1731075550.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lyz0eim",
          "author": "internetlad",
          "body": "I wish it wasn't $300 with no backlight.",
          "score": 3,
          "created_utc": 1732570379.0,
          "replies": []
        },
        {
          "id": "luugk45",
          "author": "None",
          "body": "[removed]",
          "score": 5,
          "created_utc": 1730463578.0,
          "replies": [
            {
              "id": "luuumhu",
              "author": "blackbright22",
              "body": "Sounds like from the article Season 2 will cost something.\n\nPlaydate are currently having a sale on most of their games by the way so it's a good time to get some other titles.",
              "score": 2,
              "created_utc": 1730468953.0,
              "replies": []
            }
          ]
        },
        {
          "id": "luurqdi",
          "author": "Barrel_Titor",
          "body": "Yeah. I only really go back to it every few months and at that point the battery is flat and you need to charge it for a few hours before it will even switch on.",
          "score": 2,
          "created_utc": 1730467944.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lur7o8t",
      "author": "AramFingalInterface",
      "body": "There’s a crank!!!",
      "score": 73,
      "created_utc": 1730407258.0,
      "replies": [
        {
          "id": "lurlr00",
          "author": "moriero",
          "body": "WHERE MY CRANKBOIS AT?!",
          "score": 29,
          "created_utc": 1730412073.0,
          "replies": [
            {
              "id": "lurxtcf",
              "author": "NeoTechni",
              "body": "Cranking it.",
              "score": 21,
              "created_utc": 1730416624.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lur71l7",
      "author": "Zyrobe",
      "body": "With so many companies taking the money and running it's refreshing to see someone actually honoring their promise lol",
      "score": 83,
      "created_utc": 1730407055.0,
      "replies": []
    },
    {
      "id": "lut7gjp",
      "author": "PatSajaksDick",
      "body": "The PD is a beautiful device but I honestly have a hard time using it because of not having a backlight. You gotta do like the old game boy days and rig a light to it if you want to play in bed or somewhere that it isn’t getting direct light.",
      "score": 12,
      "created_utc": 1730435280.0,
      "replies": [
        {
          "id": "luvdmk4",
          "author": "ill_thrift",
          "body": "this is the biggest thing that has prevented me from getting one. My eyes are already bad enough, probably honestly no thanks to spending so much time squinting at an unlit gameboy screen as a kid, and ultimately I'm not looking for a device that gives me eyestrain or where I'm constrained by external light. \n\nI know that business-wise, it's probably important for the playdate games to remain exclusive to the playdate ecosystem to drive sales of the device, but I still sort of wish that it made financial sense for there to be a licensing scheme or something that meant devs could release on other platforms as well - these games would be so, so nice on little emulation handhelds with backlit screens, I've been playing UFO50 on one and it's been so fun. \n\nI'm also following news about the in-progress frontlight mod with a lot of interest",
          "score": 6,
          "created_utc": 1730475164.0,
          "replies": [
            {
              "id": "luvdz3v",
              "author": "PatSajaksDick",
              "body": "I think you'll be mildly frustrated with the playdate I think if that's the case",
              "score": 2,
              "created_utc": 1730475274.0,
              "replies": [
                {
                  "id": "luvf11j",
                  "author": "ill_thrift",
                  "body": "yeah, it's cool but I don't think it's for me",
                  "score": 1,
                  "created_utc": 1730475607.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "luscu93",
      "author": "NotAnADC",
      "body": "I don’t own one of these, and I think the price is high, but:\n\nI appreciate that they seem to be making games for the love of making games. Games used to be more of an art and passion before corporate got involved. The sad reality is that life is expensive, especially when catering to a niche. If I had more disposable income I’d pick one up. \n\nTo each their own though, no one is forcing anyone to buy these.",
      "score": 64,
      "created_utc": 1730422403.0,
      "replies": [
        {
          "id": "lut7sg0",
          "author": "WonderGoesReddit",
          "body": "Much cheaper then some of ours monthly spending on the predatory mobile games nowadays…\n\nIts hard as heck to find any game on the App Store that doesn’t have ads every 40 seconds or micro transactions every day",
          "score": 12,
          "created_utc": 1730435457.0,
          "replies": [
            {
              "id": "luunko4",
              "author": "NarrativeNode",
              "body": "It’s because people refuse to pay a fair price upfront, but can easily be tricked to spend far more piece by piece. It’s such an annoying flaw in our brains.",
              "score": 5,
              "created_utc": 1730466424.0,
              "replies": [
                {
                  "id": "luv076m",
                  "author": "TravestyTravis",
                  "body": "Balatro is amazing and absolutely worth the up front price. (If anyone is looking for a fantastic mobile experience...)",
                  "score": 2,
                  "created_utc": 1730470826.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "luuniai",
          "author": "erix84",
          "body": "Couple people on a podcast I've listened to for years love theirs... makes me wanna try one. Obviously it's not something you're going to pick up and play for hours but if you've got 15 minutes here, 30 there, it could be a cool distraction.",
          "score": 1,
          "created_utc": 1730466399.0,
          "replies": []
        },
        {
          "id": "lzit06t",
          "author": "Beastw1ck",
          "body": "It is absolutely for the love of niche indie games. There’s a great podcast where they talk to the developers of all their season one games so you get to learn about their design choices and process. There’s a free SDK. There’s a web-browser based game making toolkit for people who can’t code. As a result there’s something like 1,000 games on itch for this thing now. It’s not everyone’s cup of tea but as a sort of gigantic group project it’s awesome.",
          "score": 1,
          "created_utc": 1732859828.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lusfcdg",
      "author": "eist5579",
      "body": "The small games weren’t doing it for me.  They were fun in like 5min bursts maybe.  Plus the super small package has awkward ergonomics as far as holding the damn thing w man hands.  So I sold mine after a month.  Glad I got to try it though.\n I’m sure it went to a loving household.",
      "score": 15,
      "created_utc": 1730423339.0,
      "replies": []
    },
    {
      "id": "lur3hwl",
      "author": "goat_screamPS4",
      "body": "Still too expensive for what it is.",
      "score": 105,
      "created_utc": 1730405907.0,
      "replies": [
        {
          "id": "lusfsea",
          "author": "None",
          "body": "\"but it has a crank!\"",
          "score": 28,
          "created_utc": 1730423505.0,
          "replies": []
        },
        {
          "id": "lusyvd8",
          "author": "Jos3ph",
          "body": "Sold mine. It was cute but the games just didn’t do it for me.",
          "score": 12,
          "created_utc": 1730431099.0,
          "replies": []
        },
        {
          "id": "lus3d43",
          "author": "PhasmaFelis",
          "body": "Enh. Electronics ain't that cheap when you expect to sell less than 100K units. The price point is probably reasonable given their expenses.\n\nIs it worth it *to you?* Up to you, and I won't argue if your answer is no. For me, compared to spending that $200 on movies and restaurant meals, I got my money's worth.",
          "score": 37,
          "created_utc": 1730418750.0,
          "replies": [
            {
              "id": "lusmbf9",
              "author": "Mindless_Shame_4334",
              "body": "Did you make sure to skip the equivalent in movies and restaurant meals?",
              "score": 16,
              "created_utc": 1730425980.0,
              "replies": [
                {
                  "id": "lut8xm9",
                  "author": "-Badger3-",
                  "body": "“Hey man, we’re all going out tonight, are you coming?”\n\n*looks at excel spreadsheet*\n\n*sigh* “No, not yet…”",
                  "score": 22,
                  "created_utc": 1730436078.0,
                  "replies": [
                    {
                      "id": "lutbrg7",
                      "author": "Mindless_Shame_4334",
                      "body": "*crosses off one “movie time” line*",
                      "score": 10,
                      "created_utc": 1730437683.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "luuhr0b",
              "author": "Toincossross",
              "body": "So you’d rather stay at home and crank it, got it! 😉",
              "score": 4,
              "created_utc": 1730464088.0,
              "replies": [
                {
                  "id": "luuq0io",
                  "author": "PhasmaFelis",
                  "body": "It's portable. I can crank it in public. For hours, sometimes.",
                  "score": 4,
                  "created_utc": 1730467331.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lusy0o8",
              "author": "None",
              "body": ">compared to spending that $200 on movies and restaurant meals, I got my money's worth.\n\nApples and oranges.\n\n> I got my money's worth.\n\nThe handheld market is OVERSATURATED. I don't even think you believe that the Playdate is better than ANY of the 40 dollar ones, let alone the 200 dollars. It's just cuter and it's fair if you want to buy a gadget that looks neat. But use it's neatness to justify it don't try to justify it on it's value, which is objectively horrible.",
              "score": -5,
              "created_utc": 1730430727.0,
              "replies": [
                {
                  "id": "lutdtyb",
                  "author": "guyblade",
                  "body": "I dislike it when people use the word \"objectively\" to judge something that is inherently subjective.\n\n When I bought a PS Vita, over a decade ago, I bought it to play _Persona 4 Golden_. After I'd completed it, I told someone that I thought **that one game** was sufficient rationale for owning a Vita--because it was to me. I played other games on the console, and it is still my travelling console most of the time, but if the only game that had ever come out for the console was _P4G_, I'd still argue the console was worth owning. But I freely admit that that's a subjective opinion, not a statement of cold fact.\n\nNearly all measures of value are subjective--especially when it comes to entertainment.",
                  "score": 5,
                  "created_utc": 1730438943.0,
                  "replies": [
                    {
                      "id": "lutepzm",
                      "author": "None",
                      "body": ">I dislike it when people use the word \"objectively\" to judge something that is inherently subjective.\n\nI grant you that, I use the word objectively carelessly to emphasize my point\n\nHaving said that, I think that you if we were to turn value into an objective matter, by all objective metrics in which we judge game consoles the Playdate would be last.\n\nIf we were to include, nostalgia, how they make us feel, how we value money, and other more subjective matters, then I'm sure then it doesn't matter.\n\n>that one game was sufficient rationale for owning a Vita\n\nI literally said the same thing about the 3ds and Fire Emblem awakening. So I get you. Back then there weren't many handhelds consoles. So it was easier to justify the value in objective metrics. If I were to judge the 3DS now, against phones, retro handheld consoles? I'm confident in saying it's objectively a horrible value. Even if I would still want one 3DS with Fire Emblem on it. Especially not now that the market is flooded with Retro consoles.",
                      "score": 2,
                      "created_utc": 1730439507.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lut19e4",
                  "author": "Ambitious-Tower5751",
                  "body": "Hey man I just want to congratulate you for going that intensely personal on essentially a lukewarm Amazon review.",
                  "score": 5,
                  "created_utc": 1730432178.0,
                  "replies": [
                    {
                      "id": "lut2boe",
                      "author": "None",
                      "body": "I got tot admit, that comment was clever and funny. I'm going to have to upvote you and I'll edit my comment.",
                      "score": -2,
                      "created_utc": 1730432679.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "luul4bk",
                  "author": "sethsez",
                  "body": "> I don't even think you believe that the Playdate is better than ANY of the 40 dollar ones, let alone the 200 dollars.\n\nPeople buy the Playdate for the platform, not the specs. I'm a big fan of the Chinese emulation handheld market but there's dozens of different devices than play PS1 and below with a 640x480 screen, and only one device that plays the games offered on the Playdate.\n\nAre those games *worth it*? That's entirely subjective, though I think it's fair to say there's obviously a premium involved compared to other platforms due to the small size of the company and the level of game dev talent it's trying to attract. But it's not playing in the same space as everyone trying to sell another way to play Chrono Trigger.",
                  "score": 1,
                  "created_utc": 1730465472.0,
                  "replies": [
                    {
                      "id": "luuoxqx",
                      "author": "None",
                      "body": ">there's dozens of different devices than play PS1 and below with a 640x480 screen,\n\nAnd useful screens at that, not screens that you can't use in low light. And for 150 bucks you get a 720p screen and PS2 game support and Android games.\n\n\n>Are those games worth it? That's entirely subjective, though\n\nNot completely. The sales numbers aren't subjective. The budget of those games aren't subjective. The complexity of those games aren't subjective. The media coverage of those games aren't subjective.\n\nTo pretend the exclusivity is some sort of subjective playing field is being a liar.\n\nBesides even among the lovers of the console. The reviews show clearly it's NOT about the games.\n\n> and the level of game dev talent it's trying to attract.\n\nWell that's 0.\n\n>But it's not playing in the same space as everyone trying to sell another way to play Chrono Trigger.\n\nIf you mean it's not playing in the handheld console game, then I agree. It's so bad it doesn't compete. \n\nIt does a lot of great things, is a beautiful device, that brings nostalgia to people and they love. Like it's handeld design turned into art. Again I don't have a playdate, but I have bought things equally stupid. The market, the end goal, is the equivalent of selling you the boutique experience of a new retro handheld. The device it's trash; but it's pretty nostalgic, a work of art etc.",
                      "score": 0,
                      "created_utc": 1730466932.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lut98gn",
                  "author": "Accide",
                  "body": "> which is objectively horrible.\n\nSeems like it isn't objectively horrible if they have another season of games planned to come out for it. Enough people seem to want to buy what is clearly more of a bespoke product rather than something meant to be a household name.",
                  "score": 1,
                  "created_utc": 1730436247.0,
                  "replies": [
                    {
                      "id": "lutbry3",
                      "author": "None",
                      "body": "That's a fair point. My mistake I didn't clarify what I meant by value. There's value to it. And I didn't show the facts of my point across.  By value I meant as a gaming console. The value isn't because of it's features as a gaming console nor the mediocrity of its games. Not even one bit.\n\nFor example, I could say that the 30,000 dollar Birkin bag is objectively horrible as a bag. That doesn't mean it doesn't have value. It just isn't the bag part. As a bag, it's heavy, fragile and not very pratical. It's the luxury item part that brings value.\n\nThe Playdate it's the same. It's factually horrible as a console and in the games. \n\nHowever is a luxury gadget that's freaking cool, it brings up joy in it's user through its quirky aesthetics and the nostalgia behind it. THAT may be worth 200 dollars to people.",
                      "score": 3,
                      "created_utc": 1730437691.0,
                      "replies": [
                        {
                          "id": "lutc76f",
                          "author": "Accide",
                          "body": "I suppose, but that initial commentor mentioned they got their money's worth, so I feel like the point is a little moot talking about the handheld market being oversaturated and being objectively worse than other consoles at that price point - Since they're in that camp of people who like it as the luxury gadget\n\nIt's also entirely possible that I might have missed some context between what you initially had and the edit to your comment, so I could be a little off lol. I get what you're saying though\n\n*Quick edit, I don't think that their comparison is apples and oranges, they can very easily have an \"Entertainment/Fun\" budget for seeing movies, going out to eat, gaming purchases, etc",
                          "score": 2,
                          "created_utc": 1730437942.0,
                          "replies": [
                            {
                              "id": "lutdxvs",
                              "author": "None",
                              "body": ">I suppose, but that initial commentor mentioned they got their money's worth, so I feel like the point is a little moot talking about the handheld market being oversaturated and being objectively worse than other consoles at that price point\n\nYou are correct that I'm arguing for arguing sake. I made a mistake and took it too seriously. The guy made a value assesment regarding movie and tickets and I blew it out of proportion.\n\n\n>*Quick edit, I don't think that their comparison is apples and oranges, they can very easily have an \"Entertainment/Fun\" budget for seeing movies, going out to eat, gaming purchases, etc\n\n\nIt's rhetoric to justify purchases. I dislike that type of rhetoric because it's useless in analyzing a product AND because it's dishonest for taking things OUT of context.\n\nThink of it the oppsite way, I could say, for that money you could get a Disneyland ticket for you and someone you love and live an experience that would last you a lifetime. How freaking relevant is that? If I told you the things you could do. \n\nOr even exactly what he said, 200 dollars is a lot! For that money, I would take my partner for a romantic dinner followed by a movie, buy them flowers and have finally a proper date after a while and build memories with my partner that would last a lifetime.\n\nOr I could say the Miyoo mini plus which has better games, better hardware, a better screen, better buttons all for 50 dollars. Now that's relevant.",
                              "score": 2,
                              "created_utc": 1730439013.0,
                              "replies": [
                                {
                                  "id": "lutefwv",
                                  "author": "Accide",
                                  "body": "Yeah I got you. Rereading it I didn't add anything of value honestly, the person already said they knew their opinion was a personal thing and wouldn't fight you on it haha\n\nSo again, totally get what you're saying but I feel more in line with what the initial commentor thought. They gave their two cents and maybe it's only relevant/useful/etc for anyone else who might compare apples to oranges because they're both fruit, rather than the exact same fruit",
                                  "score": 2,
                                  "created_utc": 1730439331.0,
                                  "replies": [
                                    {
                                      "id": "lutf7x8",
                                      "author": "None",
                                      "body": ">Rereading it I didn't add anything of value honestly,\n\nNah. You did to me. People think of this platform in a matter of upvotes and posting things that are valuable to anyone. For me, this platform is about personal 1 on 1 conversations that anyone can listen to. And on that I appreciate you taking your time speaking to me.\n\n>So again, totally get what you're saying but I feel more in line with what the initial commentor thought.\n\nYeah, I was out of line it's fair. This was not the place for this conversation.",
                                      "score": 2,
                                      "created_utc": 1730439829.0,
                                      "replies": [
                                        {
                                          "id": "lutg05k",
                                          "author": "Accide",
                                          "body": "All good! I'm glad. Honestly feel the same way, I hardly ever have this consistently pleasant of an interaction/comment chain at all.\n\nGlad we had the conversation, because it's one of those things where I probably wouldn't have thought much about it since I feel so much closer to that first comment. Admittedly I was arguing for arguing's sake as well. I don't have a horse in this race at all other than seeing when Playdate launched and going \"Oh cool\" haha",
                                          "score": 1,
                                          "created_utc": 1730440347.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lus6m7c",
              "author": "ObsydianDuo",
              "body": "Ehhh",
              "score": -14,
              "created_utc": 1730420018.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lurqqed",
          "author": "None",
          "body": "[deleted]",
          "score": 11,
          "created_utc": 1730413930.0,
          "replies": [
            {
              "id": "lurruje",
              "author": "casualsax",
              "body": "I have one. I'm a game design nerd and the limitations combined with the opportunities of the crank make it really interesting. It's not an object I'd recommend for maximizing entertainment but it's a unique space and gives similar but distinct vibes to UFO 50.",
              "score": 21,
              "created_utc": 1730414354.0,
              "replies": [
                {
                  "id": "luten95",
                  "author": "SloppyCheeks",
                  "body": "I've been curious about this thing since launch, and the UFO 50 comparison might've just pushed me over the edge.",
                  "score": 3,
                  "created_utc": 1730439459.0,
                  "replies": []
                },
                {
                  "id": "lurujnl",
                  "author": "GranolaCola",
                  "body": "White Water Wipeout may genuinely be one of the best games ever made. It’s a great little console.",
                  "score": 5,
                  "created_utc": 1730415377.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lurru5c",
              "author": "_RADIANTSUN_",
              "body": "It's a fun little game console where the main point is that you get novel, bespoke games made for it. It does that well enough to be a successful tiny indie platform so I don't mind, I just won't buy one but I can see exactly the kind of person who would... I remember when this was first revealed, I wanted it myself. I just don't play games like this too much any more.",
              "score": 12,
              "created_utc": 1730414350.0,
              "replies": []
            },
            {
              "id": "lursrzw",
              "author": "Woland77",
              "body": "Just because you don't like something doesn't make it stupid",
              "score": 8,
              "created_utc": 1730414705.0,
              "replies": [
                {
                  "id": "lurtfld",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -3,
                  "created_utc": 1730414952.0,
                  "replies": [
                    {
                      "id": "lurtk6l",
                      "author": "Woland77",
                      "body": "It's art that people use to experience art. That's valuable.",
                      "score": 6,
                      "created_utc": 1730415002.0,
                      "replies": [
                        {
                          "id": "lurtxd9",
                          "author": "None",
                          "body": "[deleted]",
                          "score": -3,
                          "created_utc": 1730415140.0,
                          "replies": [
                            {
                              "id": "lurv33q",
                              "author": "GranolaCola",
                              "body": "Tf you mean it’s not a game console lmao. It’s a handheld device that does literally nothing but play video games, supported by some noteworthy indie devs including the creator of Katamari Damacy and the creator of Papers, Please and Return of the Obra Dinn. Has a pretty dedicated developer and player community.",
                              "score": 4,
                              "created_utc": 1730415580.0,
                              "replies": [
                                {
                                  "id": "lurvy2u",
                                  "author": "None",
                                  "body": "[deleted]",
                                  "score": -2,
                                  "created_utc": 1730415912.0,
                                  "replies": [
                                    {
                                      "id": "lurygiy",
                                      "author": "GranolaCola",
                                      "body": "You can play *new* games",
                                      "score": 5,
                                      "created_utc": 1730416868.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lurx3wv",
              "author": "None",
              "body": "You might not be the target audience",
              "score": 1,
              "created_utc": 1730416354.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lutah9e",
          "author": "YouveRoonedTheActGOB",
          "body": "I pre ordered one, totally forgot about it, and it showed up over a year later. Looked at the prices they were getting on eBay, and sold it.",
          "score": 2,
          "created_utc": 1730436941.0,
          "replies": []
        },
        {
          "id": "lut7dws",
          "author": "WonderGoesReddit",
          "body": "Is it though?\n\nSome people spend $200+ a month on mobile games.\n\nThis is more fun with less predatory / manipulative mechanics.",
          "score": 4,
          "created_utc": 1730435240.0,
          "replies": []
        },
        {
          "id": "lus6rh1",
          "author": "AppropriateTouching",
          "body": "Just looked it up. 200 bucks for this fucking thing?!",
          "score": 8,
          "created_utc": 1730420075.0,
          "replies": []
        },
        {
          "id": "lusrqqo",
          "author": "Tacotuesday8",
          "body": "Eh, it has been very entertaining for me.",
          "score": 4,
          "created_utc": 1730428152.0,
          "replies": []
        },
        {
          "id": "lusjxgb",
          "author": "Shawnj2",
          "body": "That’s like complaining a sports car is too expensive and doesn’t have enough space for an average family. It’s not a thing meant for the average consumer, and it’s fairly priced for the niche audience of people who want this.",
          "score": 3,
          "created_utc": 1730425075.0,
          "replies": [
            {
              "id": "lut5qyn",
              "author": "JukePlz",
              "body": "But this is not the \"sports car\" of gaming devices, it's completely underpowered for a product in the premium price range of modern handhelds it competes with (basically all Chinese SBCs)",
              "score": 2,
              "created_utc": 1730434386.0,
              "replies": [
                {
                  "id": "luticnu",
                  "author": "Shawnj2",
                  "body": "It's a kitschy toy with a unique control scheme and a unique screen for people who appreciate the screen and the gimmick. For price to performance you could grab a  Switch Lite for like $180 and it would utterly destroy it on value completely but that's irrelevant for the target audience. \n\nIt's much closer to like a concept of a game console or a preproduction device than a real one and the price reflects this. It was never going to sell very well but the specific people who wanted something like this will write rave reviews and treasure these because this type of thing doesn't come out very often on account of how they go against any rational sense for a normal person to buy on value.\n\nA better comparison is like saying a Miata is worse than a Model 3 because a Miata is slower, has worse interior materials, has worse technology, costs more in gas, and has less space than a Model 3 (going by used prices I think they're pretty comparable in price right now). The people who buy Miatas don't care about any of those things because the Miata is a very targeted product for a specific audience and the lack of practicality of one is irrelevant to their decision to get one.",
                  "score": 3,
                  "created_utc": 1730441971.0,
                  "replies": []
                },
                {
                  "id": "lutmccf",
                  "author": "NeoTechni",
                  "body": "In fairness, it's the easiest system to develop for. To the point where I've been making an engine for GBA for over a year now, that took me 2 weeks to make on the PlayDate.",
                  "score": 2,
                  "created_utc": 1730444839.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "luuqb7n",
              "author": "None",
              "body": "A handheld console without a backlight could hardly be called the equivalent of a ‘sports car’.",
              "score": 1,
              "created_utc": 1730467439.0,
              "replies": [
                {
                  "id": "luvm87f",
                  "author": "Shawnj2",
                  "body": "Maybe not like a real sports car, maybe like a GR Corolla or something niche",
                  "score": 1,
                  "created_utc": 1730477868.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lus2wrw",
          "author": "Amazing_Fantastic",
          "body": "Nah shit is fire. Go buy one",
          "score": 3,
          "created_utc": 1730418575.0,
          "replies": [
            {
              "id": "lusd8kz",
              "author": "billbaggins",
              "body": "How much is it?",
              "score": 4,
              "created_utc": 1730422560.0,
              "replies": [
                {
                  "id": "lustmkt",
                  "author": "human_one",
                  "body": " $ 199.00 USD",
                  "score": 2,
                  "created_utc": 1730428923.0,
                  "replies": [
                    {
                      "id": "lut3ysk",
                      "author": "roial_with_cheeze",
                      "body": "Holy shit, I can buy more than 100 Steam games with that kind of money.",
                      "score": 7,
                      "created_utc": 1730433484.0,
                      "replies": [
                        {
                          "id": "lut7jdc",
                          "author": "WonderGoesReddit",
                          "body": "This isn’t a stems competitor though…\n\nThis competes with mobile games, which some of us easily spend $200/month on.\n\nAnd this doesn’t have predatory mechanics or micro transactions.",
                          "score": -4,
                          "created_utc": 1730435321.0,
                          "replies": [
                            {
                              "id": "lutakym",
                              "author": "YouveRoonedTheActGOB",
                              "body": "Who the fuck “easily” spends $200/month on a mobile game? Jesus christ.",
                              "score": 13,
                              "created_utc": 1730436999.0,
                              "replies": []
                            },
                            {
                              "id": "lut99c9",
                              "author": "roial_with_cheeze",
                              "body": "Ain't no way this is competing with mobile games. It doesn't even have a touch screen nor a backlight. This looks more like a novelty for those with money to burn than anything. Not hating on the thing, but seriously, for the same price, you can get a [Switch Lite](https://www.nintendo.com/us/store/products/nintendo-switch-lite-blue/) and get more out of the free game demos and F2P games than all the games this device will ever get combined.",
                              "score": 10,
                              "created_utc": 1730436260.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lush16c",
              "author": "peterosity",
              "body": "if shit’s on fire better stay away",
              "score": 3,
              "created_utc": 1730423966.0,
              "replies": [
                {
                  "id": "lusudld",
                  "author": "MrP00PER",
                  "body": "Leave me be, devil woman!",
                  "score": 0,
                  "created_utc": 1730429214.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lur4mow",
      "author": "gorramfrakker",
      "body": "Shit, I forgot I had one of these!",
      "score": 17,
      "created_utc": 1730406275.0,
      "replies": [
        {
          "id": "lus6aka",
          "author": "froyolobro",
          "body": "That’s…not a good sign",
          "score": 16,
          "created_utc": 1730419892.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lur4inq",
      "author": "fahrenheit1221",
      "body": "Still waiting on the GameCast.\n\nNot that I’ll be able to afford it.",
      "score": 13,
      "created_utc": 1730406237.0,
      "replies": [
        {
          "id": "lurc85d",
          "author": "playdoughfaygo",
          "body": "![gif](giphy|3oEduQ3OiH7kZQj3a0)",
          "score": 6,
          "created_utc": 1730408759.0,
          "replies": [
            {
              "id": "lurowfg",
              "author": "contactlite",
              "body": "![gif](giphy|nkUcca2CQ7VT2)",
              "score": 2,
              "created_utc": 1730413245.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luru8i2",
      "author": "GranolaCola",
      "body": "IT’S HAPPENING!",
      "score": 6,
      "created_utc": 1730415259.0,
      "replies": []
    },
    {
      "id": "lut9ex9",
      "author": "Halcyon520",
      "body": "Any one else having mechanical problems with theirs? My A button won’t activate consistently. I can see this when I go settings and do the button tests. Is this  common issue?",
      "score": 3,
      "created_utc": 1730436344.0,
      "replies": []
    },
    {
      "id": "lutf4ew",
      "author": "Price-x-Field",
      "body": "$200 for this?",
      "score": 3,
      "created_utc": 1730439768.0,
      "replies": []
    },
    {
      "id": "luttjyl",
      "author": "Another_Road",
      "body": "I want one of these but I’m also like 95% sure it would end up collecting dust.",
      "score": 3,
      "created_utc": 1730450181.0,
      "replies": []
    },
    {
      "id": "luskciv",
      "author": "AimlessPeacock",
      "body": "As someone who likes gadgets and gaming, this thing has a huge amount of appeal for me. I grew up playing a lot of portable games, so even the smaller scale games seem interesting. That said, I never looked into any reviews about the games, so I have no idea if they actually are worth checking out, even as bite sized experiences.",
      "score": 4,
      "created_utc": 1730425232.0,
      "replies": [
        {
          "id": "luspju7",
          "author": "Odd-Section8044",
          "body": "Don’t support Panic. They suck.",
          "score": 1,
          "created_utc": 1730427259.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lur4d1h",
      "author": "ThingCalledLight",
      "body": "Oh, Playdate.",
      "score": 7,
      "created_utc": 1730406186.0,
      "replies": []
    },
    {
      "id": "lus50ey",
      "author": "Fuzzy_Straitjacket",
      "body": "Cheaper with a backlight, please",
      "score": 3,
      "created_utc": 1730419391.0,
      "replies": []
    },
    {
      "id": "luspo73",
      "author": "Dustinisgood",
      "body": "I keep mine in my pocket at all times. Great for the subway rides or when I’m at the dog park. There so many great games.",
      "score": 3,
      "created_utc": 1730427308.0,
      "replies": [
        {
          "id": "lutphko",
          "author": "KAKYBAC",
          "body": "The mini game dev scene on it is beautiful to behold. And hey, some of the games on there are crazy creative.\n\nIt is truly a gamer's device.",
          "score": 5,
          "created_utc": 1730447164.0,
          "replies": []
        },
        {
          "id": "lusyvup",
          "author": "None",
          "body": ">There so many great games.\n\nWith the existence of hundreds of retro consoles and you know, phones. I don't understand how it is not a lie.\n\nThis is a 200 dollar neat and cool console gadget design collectible.",
          "score": -1,
          "created_utc": 1730431104.0,
          "replies": [
            {
              "id": "luurufs",
              "author": "Dustinisgood",
              "body": "The games on the playdate can only be played on the playdate and they are super unique and creative. I play it way more often than my miiyoo mini “retro console”.",
              "score": 2,
              "created_utc": 1730467985.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lur5k6z",
      "author": "fshstik",
      "body": "oh neat, excited to see what'll be there when I remember to dust it off.",
      "score": 3,
      "created_utc": 1730406576.0,
      "replies": []
    },
    {
      "id": "lutbcva",
      "author": "rickjamesia",
      "body": "I am still sad that I never got mine. It got delivered to my old apartment when I needed to move on short notice and it didn’t get forwarded. Managed to reach the management and the new tenants before it got there when I realized what was happening, but the tenants just kept it. Maybe they are enjoying it or managed to develop for it like I wanted to get into.",
      "score": 2,
      "created_utc": 1730437444.0,
      "replies": [
        {
          "id": "luu8uay",
          "author": "BlueChamp10",
          "body": "Plot twist, you bought one for a higher price on ebay and the seller was the new tenant",
          "score": 1,
          "created_utc": 1730459909.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lusppkb",
      "author": "Odd-Section8044",
      "body": "These things suck. The screens are hard to see, the cranks break, and the company discriminates against non-Americans. Stay away from Panic.",
      "score": 3,
      "created_utc": 1730427323.0,
      "replies": [
        {
          "id": "lut9xav",
          "author": "roial_with_cheeze",
          "body": "And it cost as much as a new Nintendo Switch Lite 🤣    \nThis thing is just a novelty for those with no sense and money to burn.",
          "score": 2,
          "created_utc": 1730436631.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lusllt0",
      "author": "iyqyqrmore",
      "body": "I have one of these. The games are great and the system is very durable and awesome. The crank is a controller, adds a new way to play. \nHighly recommend.[video](https://youtu.be/1ENr10wuk5c?feature=shared)",
      "score": 2,
      "created_utc": 1730425712.0,
      "replies": [
        {
          "id": "lusnayw",
          "author": "angraecumshot",
          "body": "Ok that video was really completely useless.",
          "score": 8,
          "created_utc": 1730426368.0,
          "replies": [
            {
              "id": "lut2jt1",
              "author": "iyqyqrmore",
              "body": "Lol",
              "score": 0,
              "created_utc": 1730432787.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luvx3sw",
      "author": "ihateduckface",
      "body": "Just get the Amazon versions for $50",
      "score": 1,
      "created_utc": 1730481284.0,
      "replies": []
    },
    {
      "id": "lut12dk",
      "author": "i_am_banished",
      "body": "This came out? I had no idea.",
      "score": 1,
      "created_utc": 1730432088.0,
      "replies": []
    },
    {
      "id": "lurxohh",
      "author": "Blakelock82",
      "body": "I say bring the games to Xbox like they did with with The Fall of Elena Temple. Great little game, but I’m not buying the handheld for the rest of the library.",
      "score": 0,
      "created_utc": 1730416572.0,
      "replies": []
    },
    {
      "id": "luss8k8",
      "author": "mletourn",
      "body": "So glad I sold mine",
      "score": -2,
      "created_utc": 1730428353.0,
      "replies": [
        {
          "id": "lutpchn",
          "author": "KAKYBAC",
          "body": "So glad I bought mine.",
          "score": 4,
          "created_utc": 1730447063.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lus08ux",
      "author": "ryeguymft",
      "body": "why pay so much for ancient technology that has games worse than what was made in the era they’re trying to mimic?",
      "score": -3,
      "created_utc": 1730417551.0,
      "replies": [
        {
          "id": "lut1lw8",
          "author": "tonjohn",
          "body": "Have you seen Mars After Midnight? It’s pretty freaking awesome.",
          "score": 6,
          "created_utc": 1730432338.0,
          "replies": []
        },
        {
          "id": "lus2vph",
          "author": "Roguespiffy",
          "body": " “There’s a crank.”",
          "score": 4,
          "created_utc": 1730418563.0,
          "replies": []
        },
        {
          "id": "lutpl6g",
          "author": "KAKYBAC",
          "body": "Hah, this really isn't for you. You really don't get the appeal.",
          "score": 1,
          "created_utc": 1730447238.0,
          "replies": [
            {
              "id": "luvjvfa",
              "author": "ryeguymft",
              "body": "it’s 2024 and this thing doesn’t even have a backlit screen. $200 for this is wild",
              "score": 2,
              "created_utc": 1730477127.0,
              "replies": [
                {
                  "id": "luwvvf6",
                  "author": "KAKYBAC",
                  "body": "It was purposefully designed that way to hark back to the feeling and essence of the original Game Boy.\n\nYeah having a backlight in the Playdate would be nice for QoL but for how I use it, it really doesn't need one. I actually view it as something which makes it stand out; it's retro cool.",
                  "score": 1,
                  "created_utc": 1730492169.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lutif7j",
      "author": "None",
      "body": "[deleted]",
      "score": 0,
      "created_utc": 1730442022.0,
      "replies": [
        {
          "id": "lutpnno",
          "author": "KAKYBAC",
          "body": "How to spot the softcore gamer bro.",
          "score": -1,
          "created_utc": 1730447289.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luucc8p",
      "author": "apan94",
      "body": "If you own this you are the worst kind of hipster",
      "score": 0,
      "created_utc": 1730461658.0,
      "replies": []
    },
    {
      "id": "lur9czp",
      "author": "ObiWanRyobi",
      "body": "If someone can make a world clock app that shows more than one time zone, then that would be an instant buy. I’m tempted to buy a whole other play date to have time zones at my desk, but that’s too rich.",
      "score": -3,
      "created_utc": 1730407809.0,
      "replies": []
    }
  ]
}