{
  "post": {
    "title": "Maker turns old Roomba vacuum into a Raspberry Pi-powered AI dog-feeding robot | Because keeping the floors clean wasn't impressive enough.",
    "author": "chrisdh79",
    "id": "1i588tz",
    "score": 899,
    "created_utc": 1737318777.0,
    "selftext": "",
    "num_comments": 31,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i588tz/maker_turns_old_roomba_vacuum_into_a_raspberry/"
  },
  "comments": [
    {
      "id": "m81mu3v",
      "author": "robbedoes-nl",
      "body": "It is clear that I am spoiled by big youtubers that build stuff with expensive machines, but I was a bit disappointed by the cup.",
      "score": 78,
      "created_utc": 1737319653.0,
      "replies": [
        {
          "id": "m81obbu",
          "author": "elMurpherino",
          "body": "lol that video was disappointing.  Feeding your dog by dropping random bits of dog food on the floor doesn’t seem useful lol.",
          "score": 44,
          "created_utc": 1737320073.0,
          "replies": [
            {
              "id": "m82hump",
              "author": "CreaminFreeman",
              "body": "#MESS MAKER 3000!!!!!",
              "score": 26,
              "created_utc": 1737328717.0,
              "replies": [
                {
                  "id": "m89gyfl",
                  "author": "PizzaWhole9323",
                  "body": "What do you need to take care of that mess! The mess maker 3000 cleaner upperer of course!",
                  "score": 2,
                  "created_utc": 1737419440.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m85iys9",
              "author": "bungojot",
              "body": "Yeah if I had one of those at home, I'd get back from work one day to find that the cat and dog had worked together to disembowel it and devour its contents.",
              "score": 3,
              "created_utc": 1737377875.0,
              "replies": []
            },
            {
              "id": "m85nc71",
              "author": "GratefulSenior1982",
              "body": "I bet the dog approves of random bits of good on floor.",
              "score": 3,
              "created_utc": 1737379714.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m846hld",
          "author": "I_Automate",
          "body": "Michael Reeves would like a word",
          "score": 1,
          "created_utc": 1737350400.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m82vjtt",
      "author": "njsullyalex",
      "body": "Best use of a Roomba in my opinion is having an iPod speaker dock and iPod taped to the top.",
      "score": 14,
      "created_utc": 1737333163.0,
      "replies": [
        {
          "id": "m8363a6",
          "author": "punktual",
          "body": "DJ Roomba!",
          "score": 10,
          "created_utc": 1737336575.0,
          "replies": [
            {
              "id": "m83704d",
              "author": "njsullyalex",
              "body": "![gif](giphy|8xzexownbkMxBpOGOy)",
              "score": -1,
              "created_utc": 1737336879.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m83xb8w",
          "author": "Miguel-odon",
          "body": "So, your music source wanders around?",
          "score": 3,
          "created_utc": 1737346347.0,
          "replies": []
        },
        {
          "id": "m84s5oa",
          "author": "RedHal",
          "body": "Trés Retro! Does it play [this](https://youtu.be/PGNiXGX2nLU) when it starts up?",
          "score": 2,
          "created_utc": 1737362290.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m83j5w2",
      "author": "MissusNesbitt",
      "body": "Yeah but does it scream when it runs into things?",
      "score": 6,
      "created_utc": 1737340931.0,
      "replies": [
        {
          "id": "m86j26q",
          "author": "None",
          "body": "Came here for this. Like, you’re years too late to make the coolest Roomba enhancement.",
          "score": 1,
          "created_utc": 1737389952.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m82tdv8",
      "author": "Devils_Advocate-69",
      "body": "I love stepping on kibble",
      "score": 6,
      "created_utc": 1737332483.0,
      "replies": []
    },
    {
      "id": "m82dfse",
      "author": "h0dgep0dge",
      "body": "A dog feeder doesn't need ai, it doesn't even need wheels, these things can only make it worse",
      "score": 6,
      "created_utc": 1737327359.0,
      "replies": [
        {
          "id": "m83t4k3",
          "author": "_RADIANTSUN_",
          "body": "More broadly unless the point of the product itself is to do like 50+ things in one, I don't see how AI integration is useful for almost *any* products delivered to end users. \n\nI remember growing up in my country, dishwashing machines were not common. So when I was a kid and someone said \"dishwashing machine\", I thought of like a pair of robot arms and a camera attached to the backsplash which can do all the scrubbing etc. Then when I found out how real dishwashers work and how effective they are, it was kind of wonderful because the reality was much more simple than I imagined.\n\nSimilarly I remember someone writing about many modern higher end expensive robot vacuums with more sensors (camera, LIDAR etc) vs a cheap Chinese Roomba knockoff which has 3 modes (straight line/follow an edge/go in a little spiral) it varied randomly then when it ran low on battery it retraced its path to the charging base... Apparently the cheap Chinese knockoff got like 95% as effective coverage for like 1/10th the cost.\n\nI think in most practical cases there is just some simple solution available that effectively covers a majority of the bases and makes even the more complex non-AI solutions pointless. Let alone involving AI. I think AI will in the near term be more useful for finding or implementing those kinds of solutions rather than actually being part of them, until we get more general purpose robots.\n\nIt's also kind of fascinating that despite the fact that we already have dishwashers, gross people still let their dishes pile up in the sink. Maybe if someone with a robot from the future came back they could solve that problem by having the robot automatically load the dishwasher for them. But long before that robot will be invented, this problem is already basically solved: you can just rinse and place your dirty dishes directly in the dishwasher rack. That's the kind of problem I see with a lot of AI products, they are like building a sink-to-dishwasher-loading robot. I only want such a thing if loading the dishwasher is one of the 1000 things it can do because there's actually probably something else I'd rather have it do to cut that part out entirely anyway e.g. take my dishes from me at my table and go put them into the dishwasher directly. So that function can be made pointless in a bunch of different ways. Unless they can do that... Just make a better dishwasher and I will load it directly.",
          "score": 1,
          "created_utc": 1737344642.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m82uml9",
      "author": "Traditional_Cat_60",
      "body": "What I need is an AI water turret gun that will spray my cats *before* they jump up on certain counters and tables. Same with my dog trying to steal food off the counters. The cheap model is stationary. The high end model is a drone that can stealthily follow my little destroyers and correct their savage tendencies.",
      "score": 2,
      "created_utc": 1737332877.0,
      "replies": [
        {
          "id": "m833bfa",
          "author": "skylarmt_",
          "body": ">stealthy drone\n\nIndoors? Nah.  Ceiling mounted rails it can slide on though...",
          "score": 3,
          "created_utc": 1737335652.0,
          "replies": []
        },
        {
          "id": "m8566jg",
          "author": "sillypicture",
          "body": "Cat learns and incapacitates Roomba before jumping.\n\nRoomba adapts and now the kitchen is a perpetual fight ring until one of them has to eat or recharge.",
          "score": 1,
          "created_utc": 1737371172.0,
          "replies": []
        },
        {
          "id": "m85qsjk",
          "author": "BobSacramanto",
          "body": "I saw a video on Instagram of a guy who did this with a nerf gun. He had it shooting balloons he taped to the wall based on the color he said in his verbal commands.\n\nPretty neat .",
          "score": 1,
          "created_utc": 1737381058.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m85gksm",
      "author": "dickonajunebug",
      "body": "How is this literally at the very top of my news feed? \n\nNothing else is happening today.",
      "score": 2,
      "created_utc": 1737376794.0,
      "replies": [
        {
          "id": "m87o69r",
          "author": "just-readingit",
          "body": "Oh it’s happening.  We’re just not talking about it.",
          "score": 2,
          "created_utc": 1737401076.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8bbpyk",
      "author": "BenefitOfTheDoubt_01",
      "body": "This got me thinking. \n\nWhat if I built one with a solar panel and rain catch system to charge itself and wander around the city feeding stray dogs/cats. It would have a sign that said please refill me and three bins for water, cat & dog food. Sensors could determine from a distance if the stray animal was a dog or cat, stop, call out to the animal, and dispense food/extend a water bowl. If it's running low on food, it could call out to humans to please refill it with food...\n\nI could make an app so people could see where it goes. People that are into it could revisit it to restock it with food. The app would allow people to check food/water levels. The bot could snap pictures of animals it encountered and maybe even scan their chip for help with lost animals.",
      "score": 2,
      "created_utc": 1737444964.0,
      "replies": []
    },
    {
      "id": "m829oiz",
      "author": "vharguen",
      "body": "If he added big red lights, it will try to kill him.",
      "score": 1,
      "created_utc": 1737326232.0,
      "replies": []
    },
    {
      "id": "m82l3qv",
      "author": "hendawg86",
      "body": "Ok but I have a room a I got in the iSelect program that is essentially bricked because toomba discontinues service to it making it no longer operational once I stopped my membership. I wish I could do something with it",
      "score": 1,
      "created_utc": 1737329784.0,
      "replies": []
    },
    {
      "id": "m82tbpn",
      "author": "multisubcultural1",
      "body": "My dog says “nope!”.",
      "score": 1,
      "created_utc": 1737332463.0,
      "replies": []
    },
    {
      "id": "m83b1b7",
      "author": "HighlyUnrepairable",
      "body": "Poor Spuds there doesn't know what to think... Lmao\n\n\"Lemme get this straight, now my foods comes from the *worst* *appliance* *EVER*?!\"",
      "score": 1,
      "created_utc": 1737338223.0,
      "replies": []
    },
    {
      "id": "m83g21z",
      "author": "bigmikekbd",
      "body": "Halfway through the title I expected to see that somebody was playing Doom on a Roomba",
      "score": 1,
      "created_utc": 1737339920.0,
      "replies": []
    },
    {
      "id": "m85hjhh",
      "author": "caribbean_caramel",
      "body": "Ngl that's pretty useful.",
      "score": 1,
      "created_utc": 1737377240.0,
      "replies": []
    },
    {
      "id": "m85wh7c",
      "author": "EMAW2008",
      "body": "Does it run doom?",
      "score": 1,
      "created_utc": 1737383106.0,
      "replies": []
    }
  ]
}