{
  "post": {
    "title": "The Raspberry Pi 5 now works as a smaller, faster kind of Steam Link",
    "author": "Sariel007",
    "id": "1h65pjq",
    "score": 1889,
    "created_utc": 1733280212.0,
    "selftext": "",
    "num_comments": 136,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1h65pjq/the_raspberry_pi_5_now_works_as_a_smaller_faster/"
  },
  "comments": [
    {
      "id": "m0b6pv0",
      "author": "OffbeatDrizzle",
      "body": "pretty sure the pi 3 and 4 were capable of this also. it only has to be able to decode some video....",
      "score": 420,
      "created_utc": 1733281443.0,
      "replies": [
        {
          "id": "m0blmus",
          "author": "Guzabra",
          "body": "I think the big news here is that they semi officially worked with Valve on the implementation. Not sure if the pi 3 and 4 had a similar collaboration.\n\n\" Sam Lantinga from Valve worked with the Raspberry Pi team on optimizing for the Raspberry Pi 5 hardware.\"",
          "score": 201,
          "created_utc": 1733287541.0,
          "replies": [
            {
              "id": "m0c484s",
              "author": "hi_im_bored13",
              "body": "The previous steam link for linux was also optimized for the 3b, but even wired it struggled with anything past 1080 and/or higher bitrates.\n\nAnd then I could never get it stable on the pi4 for whatever reason, h265 or not - though I switched to moonlight + sunshine which I find better than steam link in general.",
              "score": 80,
              "created_utc": 1733297437.0,
              "replies": [
                {
                  "id": "m0d62if",
                  "author": "Kichigai",
                  "body": "It's probably because Valve decided on backing Wayland over X. X has been around for decades and I remember getting it going on a 386 laptop with a 4-bit grayscale display and like 16MB of RAM. Something tells me Wayland is a little more demanding than X.",
                  "score": 5,
                  "created_utc": 1733319299.0,
                  "replies": [
                    {
                      "id": "m0g3khf",
                      "author": "darkriftx2",
                      "body": "Wayland uses the GPU for compositing and this puts a strain on older Pi models.  The GPU also uses more of the shared system memory to perform these tasks.",
                      "score": 5,
                      "created_utc": 1733352242.0,
                      "replies": []
                    },
                    {
                      "id": "m0g6njy",
                      "author": "WestCV4lyfe",
                      "body": "Moonlight can run without X as well. I have it running on a pi5 with a dpi24 vga gpio hat to a CRT. Easier than trying to get Crtemudriver working. And it's insanely fast without x https://github.com/forkymcforkface/RGBPi-Ports/tree/main/moonlight",
                      "score": 1,
                      "created_utc": 1733353264.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0e01g0",
                  "author": "Guzabra",
                  "body": "Moonlight/Sunshine has been the most impressive streaming option I've used.",
                  "score": 2,
                  "created_utc": 1733329533.0,
                  "replies": [
                    {
                      "id": "m0e6l6a",
                      "author": "Sv_gravlty",
                      "body": "Currently playing wow 3440x1440p hdr 60hz over ethernet to a pi5 with moon/sun, this shit is amazing",
                      "score": 2,
                      "created_utc": 1733331523.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0caod1",
                  "author": "defineReset",
                  "body": "Does it work well on the pi?",
                  "score": 5,
                  "created_utc": 1733301659.0,
                  "replies": [
                    {
                      "id": "m0capyt",
                      "author": "hi_im_bored13",
                      "body": "1080p60 h264 worked well on the 3b",
                      "score": 6,
                      "created_utc": 1733301691.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m0f4081",
              "author": "transiit",
              "body": "Still think of him as “Sam Latinga, creator of SDL” or “Sam Latinga of Loki Software”. I must be getting old.",
              "score": 3,
              "created_utc": 1733341562.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0bffvv",
          "author": "theArtOfProgramming",
          "body": "They were. I’ve been doing it for years on my rpi 3. Steam Link has a linux program",
          "score": 54,
          "created_utc": 1733284860.0,
          "replies": [
            {
              "id": "m0c3cax",
              "author": "GimpyGeek",
              "body": "Yep, they launched the pi version shortly after the Steam Link hardware was discontinued on purpose",
              "score": 14,
              "created_utc": 1733296886.0,
              "replies": []
            },
            {
              "id": "m0co3bm",
              "author": "TheTerrasque",
              "body": "I have both steam link and raspi 3. And steam link on the lg tv os, and on the fire stick. I always go back to the actual steam link box because it just works much better.\n\nMaybe now it's finally time to retire it.",
              "score": 2,
              "created_utc": 1733310571.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0bybgn",
          "author": "Hypno--Toad",
          "body": "Pi 4 did with certain builds pi 5 just has the grunt we expected in the pi 4\n\nPeople still don't know how to run 4k on pi 4 when I make it clear they need x265 not x264 encoding. \n\nThe pi 5 power management is so much better than 4",
          "score": 14,
          "created_utc": 1733293903.0,
          "replies": [
            {
              "id": "m0c215q",
              "author": "Mat_alThor",
              "body": "What's the difference on the pi 5 power management?",
              "score": 3,
              "created_utc": 1733296083.0,
              "replies": [
                {
                  "id": "m0c24op",
                  "author": "Hypno--Toad",
                  "body": "They have an actual chip handling it and an on off button",
                  "score": 14,
                  "created_utc": 1733296141.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0c85i8",
          "author": "Plank_With_A_Nail_In",
          "body": "The pi3 could not do it well. I remember when top tier CPU's struggled with decoding DVD's.",
          "score": 6,
          "created_utc": 1733299963.0,
          "replies": [
            {
              "id": "m0chhsz",
              "author": "anomaly256",
              "body": "That's because those top tier CPUs back then didn't have MPEG2 decoding hardware.  The pi3 actually did, but you needed to configure it and purchase a license to enable it",
              "score": 9,
              "created_utc": 1733306346.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0d953d",
          "author": "SaltwaterC",
          "body": "I am using RPi 4 as Steam Link. It's capable enough.",
          "score": 2,
          "created_utc": 1733320499.0,
          "replies": [
            {
              "id": "mk4pach",
              "author": "Training-Ear-614",
              "body": "Happy cake day!",
              "score": 1,
              "created_utc": 1743134090.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0bmoxx",
          "author": "correctingStupid",
          "body": "True. I had this functional on a RetroPie setup on a 3",
          "score": 1,
          "created_utc": 1733288021.0,
          "replies": []
        },
        {
          "id": "m0e1nux",
          "author": "theL0rd",
          "body": "May have some optimizations for low latency",
          "score": 1,
          "created_utc": 1733330033.0,
          "replies": []
        },
        {
          "id": "m0h6qay",
          "author": "LukesFather",
          "body": "For the same price as a 5 you can also get a used Apple TV 4K. Pair some Xbox controllers and download the app it’s fantastic.",
          "score": 1,
          "created_utc": 1733366103.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0bcou8",
      "author": "protekt0r",
      "body": "I kinda gave up on this stuff because of latency.  Now my gaming PC is downstairs with my biggest TV and I just remote into it from my laptop when I need to.",
      "score": 162,
      "created_utc": 1733283754.0,
      "replies": [
        {
          "id": "m0bkvqs",
          "author": "Guzabra",
          "body": "Give Moonlight/Sunshine a shot.",
          "score": 94,
          "created_utc": 1733287198.0,
          "replies": [
            {
              "id": "m0c5lqp",
              "author": "Ulrar",
              "body": "HDR is kind of hit or miss with it, but it's pretty good if you're willing to leave it off.",
              "score": 20,
              "created_utc": 1733298314.0,
              "replies": [
                {
                  "id": "m0dw3ly",
                  "author": "Framed-Photo",
                  "body": "Using my phone as the client, HDR has been flawless tbh.\n\nI have issues when I try to use my laptop though. Good ol windows HDR implementation I guess.",
                  "score": 3,
                  "created_utc": 1733328315.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0dacw2",
              "author": "beefstenders",
              "body": "Moonlight/Sunshine allows for some truly edge case bullshit. I've got Sunshine set up to allow 2 connections to the host literally so I can have 1 session streaming to my TV and a second session to a laptop sat next to me with specific wired peripherals plugged in (a Logitech G600 and a G13) because I cannot play FFXIV with a pad to save my life. Thinking about it I could probably do it with a Pi and fire a command over SSH to initiate the second connection.",
              "score": 7,
              "created_utc": 1733320965.0,
              "replies": [
                {
                  "id": "m0ejqvc",
                  "author": "mxrider108",
                  "body": "Check out Virtual Here as a way of doing USB over Ethernet",
                  "score": 2,
                  "created_utc": 1733335493.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0bx50n",
          "author": "dandroid126",
          "body": "With sunshine/moonlight, if both ends are wired ethernet, the latency is manageable imo. There is definitely some added latency, but unless I'm playing a competitive FPS game, it's totally fine. For single player games, I hardly even notice it unless I'm looking for it.",
          "score": 46,
          "created_utc": 1733293239.0,
          "replies": [
            {
              "id": "m0c0lb3",
              "author": "TooStrangeForWeird",
              "body": "My PC is wired and I sit right next to a 5G router with my phone. Moonlight says something like 14-15ms delay.",
              "score": -8,
              "created_utc": 1733295217.0,
              "replies": [
                {
                  "id": "m0cwlzf",
                  "author": "danielv123",
                  "body": "5G router? You mean wifi access point?",
                  "score": 13,
                  "created_utc": 1733315196.0,
                  "replies": [
                    {
                      "id": "m0ekhow",
                      "author": "mxrider108",
                      "body": "I think they mean a 5GHz access point",
                      "score": 1,
                      "created_utc": 1733335720.0,
                      "replies": [
                        {
                          "id": "m0gd5ot",
                          "author": "TooStrangeForWeird",
                          "body": "5Ghz router if you want to be all technical about it. It's not an access point, it's a router. There is a hardwired access point on the other side of the house, but the one I'm talking about is the router.",
                          "score": 1,
                          "created_utc": 1733355526.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m0gd04z",
                      "author": "TooStrangeForWeird",
                      "body": "It's not an AP, though it can be configured as one. It's the main router.",
                      "score": 1,
                      "created_utc": 1733355472.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m0bo138",
          "author": "primaryrhyme",
          "body": "I thought the same based on previous attempts, but just tried it with steam deck today and it was amazing. Actually feels smoother than native steam deck for RDR2 (as the deck can only run it at 30-40 fps), latency wasn’t noticeable.",
          "score": 15,
          "created_utc": 1733288645.0,
          "replies": [
            {
              "id": "m0cnguf",
              "author": "Zephyrical16",
              "body": "I just got a steam deck to replace my steam link. Gonna have to try this. Been loving the deck for streaming shows so far.",
              "score": 3,
              "created_utc": 1733310185.0,
              "replies": [
                {
                  "id": "m0dcpr5",
                  "author": "primaryrhyme",
                  "body": "Native is still preferable on titles where it makes sense but for modern AAA titles it’s a great option, make sure your main PC is on Ethernet if you can.\n\nAdded benefit is that you get 4x battery life on the deck since it’s just streaming.",
                  "score": 1,
                  "created_utc": 1733321857.0,
                  "replies": [
                    {
                      "id": "m0gkr2j",
                      "author": "Zephyrical16",
                      "body": "Wow it's insane how much better the Steam Deck is than the Steam Link at that.  Steam Link was basically unplayable for all games even with both on ethernet.  Steam Deck both on ethernet worked wonderfully for a quick test on the two games I tried, Northgard and Hades.",
                      "score": 1,
                      "created_utc": 1733358213.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m0c3k5w",
          "author": "GimpyGeek",
          "body": "There's definitely considerations. Network conditions are very important, ethernet is the most solid way to handle it. Anything wifi is asking for trouble, but if it's connected to 2.4ghz instead of 5ghz it's likely to get interference and get screwed up real easily",
          "score": 6,
          "created_utc": 1733297020.0,
          "replies": []
        },
        {
          "id": "m0bhpr9",
          "author": "CatProgrammer",
          "body": "And Steam Deck > Steam Link on your phone (assuming you can afford one).",
          "score": 8,
          "created_utc": 1733285812.0,
          "replies": [
            {
              "id": "m0bmta0",
              "author": "JukePlz",
              "body": "Latency has always pretty much been a \"dump more money into it to solve it\" problem.",
              "score": 9,
              "created_utc": 1733288077.0,
              "replies": [
                {
                  "id": "m0bw14p",
                  "author": "im_thatoneguy",
                  "body": "Unfortunately we’ve kinda plateaued. The encode decode time actually is greater than most wired LAN connections by like 20x and decoding YouTube or Netflix faster isn’t a high priority investment for GPUs.   My parsec streams are about the same latency on an integrated Qualcomm soc as they are on an Nvidia 3090.",
                  "score": 10,
                  "created_utc": 1733292633.0,
                  "replies": [
                    {
                      "id": "m0f0aew",
                      "author": "JukePlz",
                      "body": "I was talking about rendering latency, that happens before anything even hits the encoding phase, and has been tested to be significantly impacted by high CPU and GPU utilization.\n\nBut yeah, once you get to a certain limit, you can't just cut off anymore of the latency related to encoding and network transport.",
                      "score": 1,
                      "created_utc": 1733340446.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0bnmp5",
                  "author": "gramathy",
                  "body": "put everything on wires, stop trying to use wireless",
                  "score": 28,
                  "created_utc": 1733288456.0,
                  "replies": [
                    {
                      "id": "m0bwcmi",
                      "author": "dakoellis",
                      "body": "Doesn't really make sense to wire up a steam deck or similar handheld device",
                      "score": 3,
                      "created_utc": 1733292806.0,
                      "replies": [
                        {
                          "id": "m0cjpmk",
                          "author": "kryst4line",
                          "body": "Why not? Docks exist for this reason. Want to connect it to the TV? Then put it on the dock. And now that we're already wired why not just to invest in connecting it through ethernet?",
                          "score": 6,
                          "created_utc": 1733307805.0,
                          "replies": [
                            {
                              "id": "m0dax09",
                              "author": "dakoellis",
                              "body": "If you're just going to use it docked, why spend the money on something like a steam deck instead of just getting a steam link?",
                              "score": 2,
                              "created_utc": 1733321178.0,
                              "replies": [
                                {
                                  "id": "m0dtrfy",
                                  "author": "kryst4line",
                                  "body": "Who said it was only to use it docked? I fail to see where it was mentioned.",
                                  "score": 0,
                                  "created_utc": 1733327589.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m0d0krb",
                          "author": "Plank_With_A_Nail_In",
                          "body": "The link needs to be wired. If both are wired latency is going to be shit always. The link being wired solves most of the issue.",
                          "score": 1,
                          "created_utc": 1733317011.0,
                          "replies": [
                            {
                              "id": "m0dasgy",
                              "author": "dakoellis",
                              "body": "I asume you mean if both are wireless, but I'm not talking about a link I'm talking about handheld devices. the point of them is to be mobile, not tethered in a specific spot",
                              "score": 1,
                              "created_utc": 1733321131.0,
                              "replies": []
                            },
                            {
                              "id": "m0gtf4y",
                              "author": "Zephyrical16",
                              "body": "The link was unplayable even when wired.  I had two and this was across three different places I've lived.\n\nJust got a Steam Deck to replace it and it's a night and day difference in latency.  Added bonus of not needing my power hungry PC with monitors on to play something like Balatro in my living room or to stream some content.",
                              "score": 1,
                              "created_utc": 1733361306.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m0ezgb2",
                      "author": "JukePlz",
                      "body": "Latency is not just a networking issue tho. That's only one part of it, you still need CPU and GPU power to minimize rendering latency, which is mainly what I was hinting at.",
                      "score": 1,
                      "created_utc": 1733340194.0,
                      "replies": [
                        {
                          "id": "m0gayts",
                          "author": "gramathy",
                          "body": "Yeah but if you're streaming it from a PC to a handheld as described you're not going to change the rendering performance. The biggest latency increase that computer hardware has an impact on is video encode/decode (can be up to a whole frame of extra latency before you start effectively dropping frames) which can be very fast with low latency settings like what you'd use for this application.",
                          "score": 1,
                          "created_utc": 1733354756.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m0bvymk",
          "author": "TheDreamWoken",
          "body": "Yeah I found that to be the most effective",
          "score": 2,
          "created_utc": 1733292595.0,
          "replies": []
        },
        {
          "id": "m0c0isl",
          "author": "redkeyboard",
          "body": "I use 100 ft HDMI cables lol. Wireless will never compete but things like moonlight sure are nice.",
          "score": 3,
          "created_utc": 1733295176.0,
          "replies": [
            {
              "id": "m0cxljt",
              "author": "GrosBof",
              "body": "And also a 100ft USB cable for your controllers? ><",
              "score": 3,
              "created_utc": 1733315666.0,
              "replies": [
                {
                  "id": "m0dgk7s",
                  "author": "redkeyboard",
                  "body": "Centrally located USB hub that works anywhere in my house, including outside for Bluetooth after getting a USB Bluetooth adapter with giant adapters",
                  "score": 1,
                  "created_utc": 1733323252.0,
                  "replies": [
                    {
                      "id": "m0drl4f",
                      "author": "Hiddenaccount1423",
                      "body": "You by any chance have link to to the hub and adapters?",
                      "score": 1,
                      "created_utc": 1733326905.0,
                      "replies": [
                        {
                          "id": "m0dz12n",
                          "author": "redkeyboard",
                          "body": "The hub is an Amazon basics USB 2.0 hub that is powered. I recommend a powered hub for sure and USB 2.0 unless you really need 3.0 (in that case I got a 50ft fiber optic active cable that was more expensive than long HDMI cables haha)\n\nI use it with regular dongles like Logitech, Microsoft, etc. my Bluetooth dongle is from ali-express, I believe links get scrutinized but it's just a USB dongle with 2 big screw on antennas. There should be many sellers for it. Cost me like $6.",
                          "score": 2,
                          "created_utc": 1733329225.0,
                          "replies": [
                            {
                              "id": "m0e1dvf",
                              "author": "Hiddenaccount1423",
                              "body": "Thanks for the info! Yea, sheesh the 50ft fiber optic active cable are pricey.",
                              "score": 1,
                              "created_utc": 1733329946.0,
                              "replies": [
                                {
                                  "id": "m0eewqm",
                                  "author": "redkeyboard",
                                  "body": "This is what the bluetooth adapter looks like to help with your search. It's crazy I can literally play wii games directly connected to it on my patio (thanks to Moonlight, but one day I'll hardwire it!) Garage works flawlessly too.\n\nhttps://imgur.com/a/VYHbmeK",
                                  "score": 1,
                                  "created_utc": 1733334047.0,
                                  "replies": []
                                },
                                {
                                  "id": "m0efm5e",
                                  "author": "redkeyboard",
                                  "body": "yeah actually I didn't get a fiber optic one, see 2nd image. Still, you can now get hdmi 2.1 cables that are 48gbps for cheaper, especially from china websites and such!\n\nhttps://imgur.com/a/VYHbmeK\n\nI also use an HDMI splitter so it works on multiple TVs, the latest one I got also downscales if a TV doesn't support the resolution/framerate (its not perfect but its useful for sure)",
                                  "score": 1,
                                  "created_utc": 1733334260.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m0d29fj",
              "author": "zil",
              "body": "I wish there was an affordable wireless HDMI solution... every few years I look into it and find that there's no innovation.",
              "score": 2,
              "created_utc": 1733317736.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0c7kwv",
          "author": "phyraks",
          "body": "I sadly spent far too much time trying to get in-home streaming to work with all kinds of different devices and apps.\n\nI eventually got moonlight + sunshine working pretty well, but it was still never convenient with any peripherals, such as headphones.",
          "score": 1,
          "created_utc": 1733299587.0,
          "replies": []
        },
        {
          "id": "m0dpcz2",
          "author": "jaymz168",
          "body": "I still have a Steam Link around somewhere.  When I lived in a big shared house I'd fire it up for party games when we had friends over.",
          "score": 1,
          "created_utc": 1733326191.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0bntil",
      "author": "LogicalFlakes",
      "body": "Neat. But I just bought a Steam Link for $10 for my Samsung TV since it can't support parsec.",
      "score": 21,
      "created_utc": 1733288546.0,
      "replies": [
        {
          "id": "m0c1oxv",
          "author": "MontyDyson",
          "body": "Yeh and the Pi isnt cheap any more.",
          "score": 16,
          "created_utc": 1733295878.0,
          "replies": [
            {
              "id": "m0d0xb8",
              "author": "Plank_With_A_Nail_In",
              "body": "The old pi's are all still sold, you can buy a pi3 for the same price its always been same with a pi4. You don't have to buy a pi5. Also adjusted for inflation a Pi5 is cheaper than the pi2 was when it released.\n\nA Pi Zero 2 W is like $14 and it can do 99% of the projects a pi5 can do.",
              "score": 4,
              "created_utc": 1733317163.0,
              "replies": [
                {
                  "id": "m0e8rbj",
                  "author": "Tig992",
                  "body": "It’s always fun seeing someone want a top spec’ed current gen Pi, you ask them what they’re gonna do with it, and they say it’s gonna be their dedicated PiHole. And then you (ideally gently) tell em that they can do that for a fraction of the price with a Pi Zero and life gets so much nicer.",
                  "score": 4,
                  "created_utc": 1733332189.0,
                  "replies": [
                    {
                      "id": "m0evw79",
                      "author": "ThoseThingsAreWeird",
                      "body": "> top spec’ed current gen Pi ... they say it’s gonna be their dedicated PiHole\n\nLook... I'm just busy, y'know? I'll get around to doing something with it eventually... Like... not this year... but maybe next year... some time... probably...\n\nOk fine it's just a PiHole 😭😭😭",
                      "score": 3,
                      "created_utc": 1733339126.0,
                      "replies": []
                    },
                    {
                      "id": "m1c470n",
                      "author": "PM_ME_HOT_FURRIES",
                      "body": "Yeah I'd like to compile the GHC Haskell compiler on it and generally compile software for ARM on it...",
                      "score": 0,
                      "created_utc": 1733823340.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m0bevx7",
      "author": "None",
      "body": "[deleted]",
      "score": 25,
      "created_utc": 1733284633.0,
      "replies": [
        {
          "id": "m0bw27g",
          "author": "TheDreamWoken",
          "body": "Do you still do so ?",
          "score": 4,
          "created_utc": 1733292650.0,
          "replies": [
            {
              "id": "m0d0paw",
              "author": "Plank_With_A_Nail_In",
              "body": "No because it was shit.",
              "score": 5,
              "created_utc": 1733317065.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0beazu",
      "author": "None",
      "body": "What do I with the two steam links I still have?",
      "score": 36,
      "created_utc": 1733284398.0,
      "replies": [
        {
          "id": "m0bkd4p",
          "author": "furculture",
          "body": "Keep them. Cherish them. Tuck them in at night and read them a bed time story. You know. Simple stuff like that.",
          "score": 48,
          "created_utc": 1733286965.0,
          "replies": [
            {
              "id": "m0bklo2",
              "author": "None",
              "body": "I’m trying, but one of them keeps sneaking out at night and running with a bad crowd.",
              "score": 25,
              "created_utc": 1733287071.0,
              "replies": [
                {
                  "id": "m0hedpp",
                  "author": "solidaritystorm",
                  "body": "It keeps flirting with ea origin and epic games",
                  "score": 3,
                  "created_utc": 1733368958.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0bhlyc",
          "author": "CatProgrammer",
          "body": "Put one in each room of your living space.",
          "score": 7,
          "created_utc": 1733285767.0,
          "replies": [
            {
              "id": "m0d02nr",
              "author": "dpmills",
              "body": "A dedicated bathroom Steam Link ruined my second marriage, be careful",
              "score": 6,
              "created_utc": 1733316791.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0eoz09",
          "author": "MyNuts2YourFistStyle",
          "body": "I'll take one off your hands",
          "score": 1,
          "created_utc": 1733337060.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0b5dm0",
      "author": "AlexHimself",
      "body": "So is this basically to compete with gaming consoles? Like if you want to have a bunch of random steam games and play them on your TV with the controller or something? \n\nOr do you actually use a keyboard and mouse connected to this thing while using your TV? \n\nIs this for retro games or controller games? What's the target audience? \n\nI'd imagine if I was playing an intense PC game, I would need the keyboard and mouse. But if I were playing some casual games, controller would be nice.",
      "score": 36,
      "created_utc": 1733280945.0,
      "replies": [
        {
          "id": "m0bm1r9",
          "author": "Guzabra",
          "body": "No, its more of an extension to your main gaming PC allowing to use it more as a console (that you gan move around your house).\n\nIt has dedicated OS to connect to your PC and load the steam library to stream the games over the network.\n\nI have a Steam Link and it was a wonderful device but the wifi streaming was hit or miss.\n\nHardwired I never had issues.",
          "score": 19,
          "created_utc": 1733287729.0,
          "replies": [
            {
              "id": "m0dyihb",
              "author": "StonebellyMD",
              "body": "So are any of these options better than just an HDMI cable run from PC to TV combined with an HDMI switch to swap between my comp monitors and my tv?",
              "score": 2,
              "created_utc": 1733329068.0,
              "replies": [
                {
                  "id": "m0dzefc",
                  "author": "Guzabra",
                  "body": "Nope. I've tried a bunch, and if you can do it/spouse allows it an HDMI cable has always been better.",
                  "score": 1,
                  "created_utc": 1733329338.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0b5vs5",
          "author": "zenlizard1977",
          "body": "It’s for using a keyboard and mouse on the tv downstairs from your gaming PC upstairs\n\nEdit: from not on",
          "score": 29,
          "created_utc": 1733281133.0,
          "replies": []
        },
        {
          "id": "m0dzkpm",
          "author": "Ahnteis",
          "body": "I have 2 of the old steamlink boxes.  They're great for playing PC games on a big screen.   I have a keyboard + mouse if needed, but most of the time I'm using xbox controllers.  We tend to use it mostly for split-screen games, but I do play the occasional SP game as well when I want to enjoy the (much) larger screen and better sound.\n\nThis is really where Steam's Big Picture interface shines BTW - it's made for this use.",
          "score": 5,
          "created_utc": 1733329391.0,
          "replies": [
            {
              "id": "m0e1eze",
              "author": "AlexHimself",
              "body": "Woa tell me more about the split screen games. Are you saying I can play some PC games with two players in split screen with my keyboard/mouse somehow??? And then if I had one of these devices, I could get a couple XBox controllers and play with a friend in my living room?",
              "score": 1,
              "created_utc": 1733329956.0,
              "replies": [
                {
                  "id": "m0e7gvq",
                  "author": "Ahnteis",
                  "body": "Look for games with splitscreen or couch coop tags.\nE.G. https://store.steampowered.com/app/1599660/Sackboy_A_Big_Adventure/\n\nEDIT: Most multiplayer games won't let 2 players be on same input - so only 1 could use mouse+keyboard.  Other would need a controller (or both using separate controllers)",
                  "score": 1,
                  "created_utc": 1733331793.0,
                  "replies": [
                    {
                      "id": "m0n0158",
                      "author": "That-Maintenance1",
                      "body": "Oh damn, I didn't realize SABA came to PC, I thought all LBP property was locked on PlayStation",
                      "score": 1,
                      "created_utc": 1733449355.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0iddc0",
                  "author": "Fgtfv567",
                  "body": "You can use remote play together and do split screen over the internet. You just open the steam overlay and invite your friend to remote play",
                  "score": 1,
                  "created_utc": 1733386630.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0b7erk",
          "author": "Trustoryimtold",
          "body": "Not so much. It’s just Remote Desktop software which has been around since before the first xbox had software for it. Situationally useful depending on what you want to do, but with limitations due to the nature of the multiple devices interacting over distances\n\nHow you wanna control it is up to you, you can give em Bluetooth, ir, usb w/e. Wanna use your pa5 controller and an on screen keyboard? Have at it",
          "score": 8,
          "created_utc": 1733281702.0,
          "replies": []
        },
        {
          "id": "m0ctus4",
          "author": "Fgtfv567",
          "body": "Streaming games lets you play them on your TV but you don't need to buy a console or HTPC to do so. Nor do you need to haul your desktop/laptop to the TV or figure out a path for a super long HDMI cable. An underrated bonus is that you don't have to wait to download games or updates again since that's all done once on your desktop.\n\nYou can play literally whatever game you want and ideally you would use a controller. Steam input is fantastic to create custom profiles for games that don't work too well with controllers natively. For example FPS games where aim assist and joystick aim can be replaced with gyro aim and flick stick.\n\nIf you really want to bring a mouse and keyboard you can, but it'll be a little awkward if you don't bring a little table to use it on",
          "score": 2,
          "created_utc": 1733313827.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0bfa2u",
      "author": "Stork538",
      "body": "Explain this to me like I’m 10",
      "score": 13,
      "created_utc": 1733284793.0,
      "replies": [
        {
          "id": "m0bkr1l",
          "author": "furculture",
          "body": "Smaller computer running software to connect to bigger, better computer over your home internet to play your bigger, better computer on a TV while in a different room. Smaller computer talked about is much more powerful now than older smaller computers used before. Software is updated for smaller computer to run almost like bigger computer is there.",
          "score": 49,
          "created_utc": 1733287139.0,
          "replies": [
            {
              "id": "m0d0lx0",
              "author": "dpmills",
              "body": "Somehow you skipped straight to r/explainlikeimfive but it absolutely got the point across",
              "score": 7,
              "created_utc": 1733317025.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0bl77e",
          "author": "Guzabra",
          "body": "The Pi works as a remote PC to stream the content , the heavy lifting is being done by your main (assume gaming performance) PC.\n\nThe use case would be say playing your PC games in the living room with out cables.",
          "score": 11,
          "created_utc": 1733287343.0,
          "replies": []
        },
        {
          "id": "m0bh1bv",
          "author": "Albert_Borland",
          "body": "Eat your veggies, go to bed and let mom and dad take care of the big words",
          "score": 12,
          "created_utc": 1733285524.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0ca9uf",
      "author": "adamcoe",
      "body": "I have a Steam Link (and controller) that has been sitting in a drawer for years if anyone wants them. Make me an offer. The controller got used for perhaps a week, and the Link was plugged in twice.",
      "score": 3,
      "created_utc": 1733301382.0,
      "replies": []
    },
    {
      "id": "m0hr9sy",
      "author": "Gustein",
      "body": "TIL: what steam link is and have been up until now using wireless HDMI dongles to get my PC on my TV.",
      "score": 2,
      "created_utc": 1733374357.0,
      "replies": []
    },
    {
      "id": "m0bjx6o",
      "author": "young_mummy",
      "body": "Now? Im pretty sure I was doing this in 2016 on a Pi 2.",
      "score": 3,
      "created_utc": 1733286767.0,
      "replies": [
        {
          "id": "m0bw3fm",
          "author": "TheDreamWoken",
          "body": "Do you still do so ?",
          "score": 1,
          "created_utc": 1733292668.0,
          "replies": [
            {
              "id": "m0c7k6b",
              "author": "young_mummy",
              "body": "No. No need for it anymore.",
              "score": 0,
              "created_utc": 1733299573.0,
              "replies": [
                {
                  "id": "m0cdcyl",
                  "author": "TheDreamWoken",
                  "body": "Then your point does not stand",
                  "score": -3,
                  "created_utc": 1733303502.0,
                  "replies": [
                    {
                      "id": "m0d60fu",
                      "author": "young_mummy",
                      "body": "Funny because it was a smaller, faster steam link back then, and my point was this isn't a new concept that you can only \"now\" do. So how on earth would it not stand?\n\nI was literally using moonlight game streaming back then. Doing exactly what the article is talking about. Please explain, Einstein.",
                      "score": 2,
                      "created_utc": 1733319275.0,
                      "replies": [
                        {
                          "id": "m0dw6u6",
                          "author": "TheDreamWoken",
                          "body": "No",
                          "score": -1,
                          "created_utc": 1733328343.0,
                          "replies": [
                            {
                              "id": "m0ean0p",
                              "author": "young_mummy",
                              "body": "Yeah. Because you're talking out of your ass and have no idea what is going on.",
                              "score": 1,
                              "created_utc": 1733332761.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m0bo13x",
      "author": "bobre737",
      "body": "What is steam link?",
      "score": 2,
      "created_utc": 1733288645.0,
      "replies": [
        {
          "id": "m0btupn",
          "author": "lolheyaj",
          "body": "Let's you remote play Steam games installed on your computer from another device like a smartphone, smart tv, or a raspberry pi.",
          "score": 6,
          "created_utc": 1733291476.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0bij3d",
      "author": "Feral_Nerd_22",
      "body": "I actually have a few PI 4s I use for LAN Gaming setups  when I don't feel like unhooking my gaming rig. It works pretty well with Moonlight.\n\nI have them attached to the back of extra monitors using a 3D printed VESA case.",
      "score": 1,
      "created_utc": 1733286161.0,
      "replies": []
    },
    {
      "id": "m0bx5q9",
      "author": "LargeGuidance1",
      "body": "Wait how can you do this? I’ve always wanted a steam link and missed the window",
      "score": 1,
      "created_utc": 1733293250.0,
      "replies": [
        {
          "id": "m0c3kp7",
          "author": "Caughtnow",
          "body": "What window? The thing you are typing this message on can likely stream games to, it takes very little to run steam link. Ive a 10 year old TV that you can stream to without any additional hardware.\n\nHow your devices are linked play a bigger role. If your PC is hardwired and you have a strong wifi (preferably 6 or newer) signal on the receiving end (phone/tablet/deck/whatever), you are good to go.",
          "score": 3,
          "created_utc": 1733297030.0,
          "replies": [
            {
              "id": "m0cvw46",
              "author": "IllllIIIllllIl",
              "body": "Anecdotal but my experience with the Steam Link app is that no matter the hardware or network involved, it just runs like such absolute dogshit that I’m unsure Valve is even still updating or doing anything with it. Direct wired connections experiencing frequent and extreme latency spikes.\n\nMoonlight/Sunshine on the same connection works absolutely flawlessly though. ",
              "score": 4,
              "created_utc": 1733314848.0,
              "replies": [
                {
                  "id": "m0eed2c",
                  "author": "SovietMacguyver",
                  "body": "You're doing something very wrong in your network, then. I've been using a Steam Link for almost a decade now via WiFi and it's been flawless.",
                  "score": 1,
                  "created_utc": 1733333884.0,
                  "replies": [
                    {
                      "id": "m0eio8e",
                      "author": "IllllIIIllllIl",
                      "body": "I’m very much not doing anything *wrong* as it’s quite difficult to fuck up a direct Ethernet connection. I don’t know if it’s an issue the NVIDIA Shield in particular has with the Steam Link app, but a wired connection between my PC and Shield via a single gigabit switch and functioning Cat6 cables results in such severe latency issues it’s unusable, while Moonlight works perfectly. I’m far from the only person you’ll find with this experience. \n\nIt is what it is and I have a working solution, but Steam Link just doesn’t function in any meaningful way for me, and even if it did it’s lacking in options for high frame rate and occasionally has issues recognizing my controller. ",
                      "score": 2,
                      "created_utc": 1733335169.0,
                      "replies": [
                        {
                          "id": "m0gu4r1",
                          "author": "Zephyrical16",
                          "body": "Yeah I also had the same issue.  Steam Link worked wonderfully for HTPC type things like streaming shows and such.  Boot up a game and the latency with inputs was unbearable.\n\nJust got a Steam Deck and the latency wasn't noticeable when streaming stuff from my PC to the Deck.  Only messed around with it a bit but it's a night and day difference.  The Steam Link just simply wasn't strong enough to decode everything in a timely manner, even at time of release.",
                          "score": 2,
                          "created_utc": 1733361558.0,
                          "replies": []
                        },
                        {
                          "id": "m0f54ds",
                          "author": "SovietMacguyver",
                          "body": "Then you all have something in common, and that is your networks misconfiguration. Works fine for everyone else.",
                          "score": -2,
                          "created_utc": 1733341897.0,
                          "replies": [
                            {
                              "id": "m1kybae",
                              "author": "dysentery",
                              "body": "He's doing nothing wrong didnt you see? It's just his network doesn't work and has performance issues.",
                              "score": 1,
                              "created_utc": 1733948930.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m0c897i",
      "author": "havingpun",
      "body": "Is this able to run Chiaki or Xbox Remote Play?",
      "score": 1,
      "created_utc": 1733300030.0,
      "replies": []
    },
    {
      "id": "m0cdlr5",
      "author": "BigPhilip",
      "body": "I will surely give this thing a shot",
      "score": 1,
      "created_utc": 1733303671.0,
      "replies": []
    },
    {
      "id": "m0cva9o",
      "author": "katiekat4444",
      "body": "Pi4 with retropie had a steamlink app that was actually very solid 8/10 new one should smoke it",
      "score": 1,
      "created_utc": 1733314552.0,
      "replies": []
    },
    {
      "id": "m0ec7wt",
      "author": "lesstalkmorescience",
      "body": "The Steamlink cost me less than an RP5 and required zero setup.",
      "score": 1,
      "created_utc": 1733333238.0,
      "replies": []
    },
    {
      "id": "m0ewuse",
      "author": "hamsterkill",
      "body": "Hm. I didn't think the pi5 had the necessary hardware media decoders for this.\n\nEd. Oh, it's still just using h264.",
      "score": 1,
      "created_utc": 1733339416.0,
      "replies": []
    },
    {
      "id": "m0ge0i6",
      "author": "xLeopoldinho",
      "body": "These things are faulty af. I wonder if they finally fixed the HDMI issues that plagued the Pi 4...",
      "score": 1,
      "created_utc": 1733355826.0,
      "replies": []
    },
    {
      "id": "m1tiorf",
      "author": "dztruthseek",
      "body": "Oh thank the lords. I thought I would have to buy a mini PC because connecting wirelessly to my TV has been terrible.",
      "score": 1,
      "created_utc": 1734069197.0,
      "replies": []
    },
    {
      "id": "m0boihi",
      "author": "SUPREMACY_SAD_AI",
      "body": "always has",
      "score": 1,
      "created_utc": 1733288871.0,
      "replies": []
    },
    {
      "id": "m0cayyy",
      "author": "kaisurniwurer",
      "body": "How is this different from a remote desktop connection?\n\nJust an ability to use a device without necessary software?",
      "score": -1,
      "created_utc": 1733301864.0,
      "replies": [
        {
          "id": "m0ckvte",
          "author": "picardo85",
          "body": "refresh rate and latency is less shit. That's the main difference. Input options are also better.\n\nRDP is fine for desktop activities, but it's aboslutely dog shit for gaming related activities. Steamlink is fine for quite a few gaming activities. I wouldn't try playing FPS games over it though.",
          "score": 3,
          "created_utc": 1733308571.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0d5r3g",
      "author": "jradio",
      "body": "Oh look, another ad on /r/gadgets",
      "score": 0,
      "created_utc": 1733319171.0,
      "replies": []
    },
    {
      "id": "m0bj8au",
      "author": "Ok_Aside8490",
      "body": "Cool if you need that, or just if you have any computer including Mac’s/iPads. Hook it up to your tv and download steam link",
      "score": -1,
      "created_utc": 1733286465.0,
      "replies": []
    }
  ]
}