{
  "post": {
    "title": "Fujifilm Suspends Some US Camera Orders Due to Tariffs",
    "author": "diacewrb",
    "id": "1k541x9",
    "score": 2704,
    "created_utc": 1745321692.0,
    "selftext": "",
    "num_comments": 70,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1k541x9/fujifilm_suspends_some_us_camera_orders_due_to/"
  },
  "comments": [
    {
      "id": "mof57lw",
      "author": "gabezermeno",
      "body": "Jesus christ i'm never getting an XM5",
      "score": 184,
      "created_utc": 1745325119.0,
      "replies": [
        {
          "id": "moj7ffq",
          "author": "noor2436",
          "body": "This is the worst news I've heard all year",
          "score": 16,
          "created_utc": 1745370781.0,
          "replies": []
        },
        {
          "id": "mojsitd",
          "author": "Praefectus27",
          "body": "I bought one from Best Buy a few months ago. Arrived a couple of days later.  Looks like they’re out of stock now but check there. \n\nPs the cameras sooo great. I use it for family and action shots. Nothing crazy and it’s such a huge upgrade from a cell phone.",
          "score": 11,
          "created_utc": 1745378453.0,
          "replies": []
        },
        {
          "id": "moiiphc",
          "author": "None",
          "body": "[removed]",
          "score": -41,
          "created_utc": 1745362328.0,
          "replies": [
            {
              "id": "moissz9",
              "author": "Dan_Felder",
              "body": "You're just sad.",
              "score": 11,
              "created_utc": 1745365717.0,
              "replies": [
                {
                  "id": "moiwd2t",
                  "author": "0002millertime",
                  "body": "I mean... I'm sad.",
                  "score": 2,
                  "created_utc": 1745366912.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mojo9hh",
              "author": "None",
              "body": "Some of us here are photographers and collectors and you are a sad, sorry excuse for a human being for judging others on what they enjoy.",
              "score": 7,
              "created_utc": 1745376809.0,
              "replies": []
            },
            {
              "id": "mojoyxs",
              "author": "angrygirl65",
              "body": "I wonder what cool thing you won’t be able to get in the future?",
              "score": 3,
              "created_utc": 1745377072.0,
              "replies": []
            },
            {
              "id": "moivnts",
              "author": "C-C-X-V-I",
              "body": "Pathetic",
              "score": 2,
              "created_utc": 1745366671.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mofioyz",
      "author": "HippityHoppityBoop",
      "body": "lol US speed running into the closed economies the developing world *used to* have. They learnt their lessons and realized how quality of life and quality of products drops with protectionism and opened up their economies, while the US is going the other way. On the bright side some more deserving country/ies will take up the mantle of global economic leadership.",
      "score": 211,
      "created_utc": 1745329914.0,
      "replies": [
        {
          "id": "mofvn1r",
          "author": "dw444",
          "body": "This requires more nuance. Developing countries actually need protectionism, and every single developing country that has transitioned to developed since WW2 has done so with heavily protected economies. The only exception to this is Hong Kong. Protectionism for developing countries and devleoped ones is not the same, and doesn’t serve the same purpose.\n\nToo many people claim China/Korea/Japan/*insert similar country here* developed through free trade, which is false. They all liberalized and heavily promoted export regimes while basically shutting off their domestic economies to most imports that weren’t capital goods.",
          "score": 44,
          "created_utc": 1745333911.0,
          "replies": [
            {
              "id": "mogvd6h",
              "author": "Jusanden",
              "body": "Tariffs do have a place and purpose. To protect domestic industries as they develop and become cost competitive with the world. If the US wants to rekindle a manufacturing base, then tariffs would be one tool out of many that could be leveraged to do so. Whether or not that even makes sense to do when the US is a largely service based economy nowadays is a different story. \n\nThe way the current tariffs has been rolled out however, is a fucking disaster.",
              "score": 33,
              "created_utc": 1745344255.0,
              "replies": [
                {
                  "id": "mohors0",
                  "author": "Zaptruder",
                  "body": "This. You talk to your industries and figure out what level of protection and subsidy they need on what time frame in order to encourage the accelerating development of that industry.\n\nTrump otoh is simply using tarriffs to implode the American economy and global trade is collateral to that. So that his billionaire buddies can carve up and divide America into techno-facist-monarchies.",
                  "score": 12,
                  "created_utc": 1745352947.0,
                  "replies": [
                    {
                      "id": "moj6784",
                      "author": "dw444",
                      "body": "If you do that, you end up with rent seeking industries and in a middle income trap like Malaysia or India. You tell your industries that they get x level of protection for y number of years, after which they’re on their own. During that time you shut down all foreign competition in the domestic market, allow imports of capital goods on preferential terms, and pray that they make something of it.",
                      "score": -1,
                      "created_utc": 1745370344.0,
                      "replies": [
                        {
                          "id": "mojt4tw",
                          "author": "Zaptruder",
                          "body": "Yeah, correct, you gotta reel it back too.",
                          "score": 1,
                          "created_utc": 1745378700.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mogysnf",
                  "author": "HippityHoppityBoop",
                  "body": "Only when they’re a time limited part of industrial policy, not this broad based trade policy train wreck",
                  "score": 3,
                  "created_utc": 1745345238.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mohcxva",
          "author": "fire2day",
          "body": "> speed running into the closed economies the developing world used to have\n\nI mean, they're making it great *again*, so clearly they had some time period in mind.",
          "score": 5,
          "created_utc": 1745349438.0,
          "replies": []
        },
        {
          "id": "monza83",
          "author": "ArrogantAnalyst",
          "body": "And the funny thing is: if there’s one big winner of globalization it would be the US.\nThe US and my country (Germany) did profit like crazy from the international economy that formed after WWII.\nAnd the US did not only become the biggest economical powerhouse, it also became a huge cultural leader.\nAll this power, hard and soft, currently gets thrown out of the window with both hands. It’s crazy to watch.",
          "score": 2,
          "created_utc": 1745438068.0,
          "replies": []
        },
        {
          "id": "mofk2wl",
          "author": "None",
          "body": "[deleted]",
          "score": -18,
          "created_utc": 1745330362.0,
          "replies": [
            {
              "id": "mofoeag",
              "author": "germanthoughts",
              "body": "While every president should obviously take care of the US first and foremost it is a dangerous game to piss everyone else off. We are a very connected world and diplomacy and soft touch has its place. If the US goes too far with the protectionism the other economies of the world will stop using the $ as the default trade currency and other players will step in. That would be fatal for the US long term. It’s a big an important country (partly because of all of the influence is has around the world) but it can’t just stand alone.",
              "score": 13,
              "created_utc": 1745331732.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "moeyomx",
      "author": "darklordenron",
      "body": "Are people still unable to purchase the x100vi? I received mine back in August last year but I looked at B&H out of curiosity the other day and it was STILL out of stock. Unreal.",
      "score": 59,
      "created_utc": 1745322441.0,
      "replies": [
        {
          "id": "moez6x0",
          "author": "MadOrange64",
          "body": "I never seen it in stock since launch.",
          "score": 36,
          "created_utc": 1745322658.0,
          "replies": [
            {
              "id": "mof0jz0",
              "author": "Bloated_Plaid",
              "body": "I got mine from Amazon in March.",
              "score": 5,
              "created_utc": 1745323232.0,
              "replies": [
                {
                  "id": "mof0zyw",
                  "author": "MadOrange64",
                  "body": "At MSRP or did you have to pay more?",
                  "score": 5,
                  "created_utc": 1745323420.0,
                  "replies": [
                    {
                      "id": "mofbtwo",
                      "author": "darklordenron",
                      "body": "Oh, I got mine at MSRP. I ordered at like 1am launch morning but still had to wait quite awhile. Ordered Feb 20, delivered Aug 16 of 2024 so about 6 months.",
                      "score": 7,
                      "created_utc": 1745327573.0,
                      "replies": [
                        {
                          "id": "mol5wnp",
                          "author": "MangoSalsaDuck",
                          "body": "I would have forgotten I ordered at that point and have been pleasantly surprised when it did show up.",
                          "score": 1,
                          "created_utc": 1745405832.0,
                          "replies": [
                            {
                              "id": "mop4boa",
                              "author": "darklordenron",
                              "body": "That would have happened had it not been for the fact that I specifically bought this camera to help capture my first child’s first year on the planet, I was very invested in receiving it and had eyes on it every few weeks checking progress. Unfortunately, it came like five months after she was already here. Fucking Fuji, they lost my trust with that botched release. I wish my x100f never fell off that mountainside.",
                              "score": 3,
                              "created_utc": 1745450829.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mof7jhr",
                      "author": "Bloated_Plaid",
                      "body": "MSRP. Shipped and Sold by Amazon.",
                      "score": 2,
                      "created_utc": 1745326008.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mofbv5f",
              "author": "darklordenron",
              "body": "That’s wild af.",
              "score": 1,
              "created_utc": 1745327585.0,
              "replies": []
            },
            {
              "id": "mojyx1f",
              "author": "sundeigh",
              "body": "If that’s the case you really haven’t tried tbh. Best Buy has been easy",
              "score": 1,
              "created_utc": 1745381139.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mog3whr",
          "author": "Turgid-Derp-Lord",
          "body": "Scarcity for their digital cameras is fujifilm's business model -- they've basically said they never want a camera to go on sale due to overproduction, so always manufacture slightly less than demand.",
          "score": 12,
          "created_utc": 1745336343.0,
          "replies": [
            {
              "id": "mp4k837",
              "author": "darklordenron",
              "body": "Well that’s weird.. You used to always be able to grab older x100’s or XT1’s anywhere you looked, any day of the week. Must be somewhat of a newer philosophy they’re taking on.",
              "score": 1,
              "created_utc": 1745664783.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mofgzim",
          "author": "fryingchicken",
          "body": "I was in Japan recently and I couldn’t find any for sale at large camera stores like Yodobashi",
          "score": 5,
          "created_utc": 1745329356.0,
          "replies": [
            {
              "id": "mohmi05",
              "author": "KoksundNutten",
              "body": "That's because they hardly sell them in Japan anyways",
              "score": 1,
              "created_utc": 1745352281.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mogre6r",
          "author": "najibs172r",
          "body": "I’m in Canada and just bought one a week ago. They’re trickling into Canada. Maybe they’re redirecting them here instead of sending to the US 🤪",
          "score": 4,
          "created_utc": 1745343119.0,
          "replies": []
        },
        {
          "id": "mogmcst",
          "author": "canuckis",
          "body": "I was able to order one through B&H about a month ago. I signed up for the alerts. It shipped Monday!",
          "score": 2,
          "created_utc": 1745341691.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mof84hf",
      "author": "bannedin420",
      "body": "Thank god I live in Canada. I love my xt-3 and was thinking of upgrading to an xt-5 and get some new glass",
      "score": 40,
      "created_utc": 1745326226.0,
      "replies": [
        {
          "id": "moffiz3",
          "author": "NickCharlesYT",
          "body": "I also love my X-T3 and was planning on upgrading to the X-T6 when it came out. As a US citizen though that's looking like a virtual impossibility at this point.",
          "score": 7,
          "created_utc": 1745328861.0,
          "replies": []
        },
        {
          "id": "mojbhh6",
          "author": "SoLuscious",
          "body": "Canadian here too. XT-3 is a solid camera, and the XT-5 looks like a sweet upgrade. Those Fuji prices might actually look better up here with the current exchange rate.",
          "score": 1,
          "created_utc": 1745372233.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mofsf87",
      "author": "None",
      "body": "This is starting to happen to not JUST Fujifilm but most camera brands. I’ve talked to Sony and Leica ADs and they’ve also spoken how they have zero idea what prices will be.\n\nI’m glad I got my A7CR before this nonsense but can’t imagine the pain of trying to buy one in the coming months. Hell, even old Leica Q models are going for above what they should be.",
      "score": 16,
      "created_utc": 1745332956.0,
      "replies": [
        {
          "id": "moi4t2q",
          "author": "zkareface",
          "body": "Well reports from people in the shipping industry is reporting a ~70% loss in volume towards the US. \n\nEverything is stoppping soon.",
          "score": 6,
          "created_utc": 1745357768.0,
          "replies": [
            {
              "id": "moia9x8",
              "author": "None",
              "body": "Welp good luck to y’all trying to get new or upgraded camera bodies. 🫡\n\nI’m fully planning to take my Japan/Korea trip to pick up some lenses as I’ve already seen a couple that are jumping in price.",
              "score": 3,
              "created_utc": 1745359503.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mofh9wz",
      "author": "Logical007",
      "body": "Are we winning yet?",
      "score": 35,
      "created_utc": 1745329449.0,
      "replies": [
        {
          "id": "mogpebz",
          "author": "drconniehenley",
          "body": "So much winning. Glad to be Canadian right now.",
          "score": 11,
          "created_utc": 1745342556.0,
          "replies": [
            {
              "id": "moh30cy",
              "author": "mytransthrow",
              "body": "Californian here can I join you??? Are you guy accepting asylum for trans people yet? I work in healthcare",
              "score": 4,
              "created_utc": 1745346485.0,
              "replies": [
                {
                  "id": "mohfu5z",
                  "author": "drconniehenley",
                  "body": "Newsome did a direct appeal to British Columbia. It was really thoughtful and welcoming as we have so much in common, but ultimately, we’re really distrustful of the borders. \n\nTime to create r/cascadia",
                  "score": 9,
                  "created_utc": 1745350304.0,
                  "replies": [
                    {
                      "id": "mohiqnc",
                      "author": "mytransthrow",
                      "body": "I agree. but Newsom is not to be trusted. He does podcasts with the alt-right. Ultmately he is one those corpo dems. \n\nAlso if I was canadian. I wouldnt trust US right now not for a long time when it comes to visiting. I dont even know if I will be able to escape when its actually time to flee and I can legit get asylum for being trans. Because of camps.",
                      "score": 4,
                      "created_utc": 1745351176.0,
                      "replies": [
                        {
                          "id": "mohmmw2",
                          "author": "drconniehenley",
                          "body": "Interesting. Initially, my view of him was pretty favourable as he seemed like one of the few unwilling to kiss the ring and vocally push back. \n\nIt’s a shame, as I’ve spent a lot of time in WA, ORE and CA, but I won’t be back so long as the orange demagogue remains in his throne.",
                          "score": 1,
                          "created_utc": 1745352321.0,
                          "replies": [
                            {
                              "id": "moiubsv",
                              "author": "AwakenedSheeple",
                              "body": "As a Californian, yeah, Newsom is just another typical politician with the usual hypocrisy and probably corruption. So the usual, really. At least that makes him a stable and predictable politician and not... whatever the hell we got running in the White House.",
                              "score": 0,
                              "created_utc": 1745366222.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mohfa92",
                  "author": "drconniehenley",
                  "body": "You’re in.",
                  "score": 0,
                  "created_utc": 1745350137.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "moggsgv",
          "author": "Auto_Phil",
          "body": "Yes. The US won. Now can we pls have that nice black lady back? Please?",
          "score": 4,
          "created_utc": 1745340090.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mogw4y6",
      "author": "Infinitehope42",
      "body": "Yay cameras got even more unaffordable! :D",
      "score": 6,
      "created_utc": 1745344473.0,
      "replies": []
    },
    {
      "id": "mohz8fr",
      "author": "Do-you-see-it-now",
      "body": "Less and less choice and more and more expensive.   This is awesome!",
      "score": 3,
      "created_utc": 1745356035.0,
      "replies": []
    },
    {
      "id": "mofkbku",
      "author": "nunnapo",
      "body": "Ironically the x100 will now cost 100 times more.",
      "score": 5,
      "created_utc": 1745330440.0,
      "replies": []
    },
    {
      "id": "moj0xyb",
      "author": "SoCal_GlacierR1T",
      "body": "Fucking Cheeto Benito and his Turd Reich.",
      "score": 2,
      "created_utc": 1745368509.0,
      "replies": []
    },
    {
      "id": "mofgw13",
      "author": "whoaaintitfun",
      "body": "Glad I got my X-M5 when I did.",
      "score": 1,
      "created_utc": 1745329323.0,
      "replies": []
    },
    {
      "id": "mogr6sw",
      "author": "fraghead5",
      "body": "Glad I got my X-M5 last week",
      "score": 1,
      "created_utc": 1745343060.0,
      "replies": []
    },
    {
      "id": "moh551t",
      "author": "Solar-MarSpawn",
      "body": "I wanted to get a camera and start taking pics off of my phone but 🤷🏻‍♀️",
      "score": 1,
      "created_utc": 1745347119.0,
      "replies": [
        {
          "id": "mpnznh0",
          "author": "fleemfleemfleemfleem",
          "body": "Used cameras will work just fine and save you a lot of money. \n\nYou wouldn't be able to tell the difference between a picture taken on a five year old camera and a new one.",
          "score": 1,
          "created_utc": 1745937366.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mohv2iz",
      "author": "Leggo213",
      "body": "Bum bum bum",
      "score": 1,
      "created_utc": 1745354792.0,
      "replies": []
    },
    {
      "id": "moiiwi1",
      "author": "ProgandyPatrick",
      "body": "Damn, fujifilm was already a bit pricey, now it’ll only get worse.",
      "score": 1,
      "created_utc": 1745362393.0,
      "replies": []
    },
    {
      "id": "moldqgy",
      "author": "Spicy_Pickle_6",
      "body": "But it’s ok because Fujifilm is rushing to open a factory in the states to accommodate all US buyers.",
      "score": 1,
      "created_utc": 1745409365.0,
      "replies": [
        {
          "id": "moz6wnc",
          "author": "Basic_Friend8444",
          "body": "A factory in which, probably, nobody will want to work anyway.",
          "score": 1,
          "created_utc": 1745591922.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mog6f4n",
      "author": "chompar",
      "body": "Shoulda preordered the 100RF, dammit.",
      "score": 0,
      "created_utc": 1745337061.0,
      "replies": []
    },
    {
      "id": "moh4v42",
      "author": "wiggetsf",
      "body": "guess ill keep using my 9 year old GX85 lol. I wanted one of these but the resale price is too much to stomach",
      "score": 0,
      "created_utc": 1745347035.0,
      "replies": []
    },
    {
      "id": "mogdi95",
      "author": "None",
      "body": "[removed]",
      "score": -18,
      "created_utc": 1745339126.0,
      "replies": []
    }
  ]
}