{
  "post": {
    "title": "Apple may launch the first foldable iPhone next year: Here’s what we know so far",
    "author": "a_Ninja_b0y",
    "id": "1i9u7l0",
    "score": 0,
    "created_utc": 1737831703.0,
    "selftext": "",
    "num_comments": 25,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i9u7l0/apple_may_launch_the_first_foldable_iphone_next/"
  },
  "comments": [
    {
      "id": "m94ypwc",
      "author": "Cactuszach",
      "body": "They already did. It was the [iPhone 6](https://www.theverge.com/circuitbreaker/2018/5/24/17389220/apple-bendgate-internal-documents-iphone-6-plus).",
      "score": 20,
      "created_utc": 1737832170.0,
      "replies": []
    },
    {
      "id": "m94y53i",
      "author": "Macshlong",
      "body": "Here’s what we know so far/\n\nIt’ll be a foldable phone.",
      "score": 13,
      "created_utc": 1737832003.0,
      "replies": [
        {
          "id": "m94yvgm",
          "author": "sarduchi",
          "body": "Unless it’s not.",
          "score": 3,
          "created_utc": 1737832215.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m94xmgm",
      "author": "None",
      "body": "Really hope they don’t",
      "score": 15,
      "created_utc": 1737831852.0,
      "replies": [
        {
          "id": "m953d00",
          "author": "TapTapTapTapTapTaps",
          "body": "Yep, this will show Apple has completely lost their way. Just following niche trends and having no competitive advantage to doing so.",
          "score": 3,
          "created_utc": 1737833519.0,
          "replies": [
            {
              "id": "m953ljh",
              "author": "watduhdamhell",
              "body": "Apple is not known to innovate, just to do what \"works.\" So I agree. Don't innovate, apple! Stick to what works after others figure it out.",
              "score": 2,
              "created_utc": 1737833588.0,
              "replies": [
                {
                  "id": "m953uq8",
                  "author": "TapTapTapTapTapTaps",
                  "body": "They do what’s already been done, but “usually” way better and innovate on what’s been done. There was already an iPhone like device, tablet device, etc. they did it better. \n\nThere is nothing about fold screens that’s going to be done better to a point that people will care.",
                  "score": 3,
                  "created_utc": 1737833663.0,
                  "replies": []
                },
                {
                  "id": "m9cx5zw",
                  "author": "Lumanus",
                  "body": "They do everything better. Still no competition for FaceID (or even TouchID for that matter), LiDAR is insane on iPhones, integration with accessories (like airpods and apple pencil etc) is great etz.",
                  "score": 0,
                  "created_utc": 1737934841.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m950f7a",
      "author": "WarLawck",
      "body": "Here's what we know so far: Samsung already did it.",
      "score": 2,
      "created_utc": 1737832667.0,
      "replies": []
    },
    {
      "id": "m94ycbg",
      "author": "Hextorz",
      "body": "I still haven’t seen anyone actually using a foldable phone out in the wild. Who’s even asking for this tech?",
      "score": 1,
      "created_utc": 1737832060.0,
      "replies": [
        {
          "id": "m94zxnf",
          "author": "RhetoricalOrator",
          "body": "I've got a couple friends with them who like them. Now that I'm semi-retired and not doing rough work that would immediately destroy one, I would actually consider a foldable. Not Apple, but someone with a good foldable that gives me more screen real estate with an equivalent footprint in my pocket than a slab phone.",
          "score": 4,
          "created_utc": 1737832525.0,
          "replies": [
            {
              "id": "m950s1p",
              "author": "Hextorz",
              "body": "Good insight thanks. Have they figured out the crease in the screens over time?",
              "score": 1,
              "created_utc": 1737832769.0,
              "replies": [
                {
                  "id": "m951o32",
                  "author": "RhetoricalOrator",
                  "body": "I can't speak for all models but just looking at the Samsung Fold, it's looked like they've made significant improvements to the crease from the first gen to current gen. And I'm not sure that they are the best. Mrwhostheboss has shown some foldables that may just be available in the Chinese or EU markets that look way better than anything Samsung has.",
                  "score": 3,
                  "created_utc": 1737833028.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m95g4m4",
          "author": "puf",
          "body": "17+ month user of the Motorola Razr+ 2023 model here. 👋\n\nI simply love the form factor of my phone. It fits comfortably in my pockets, I can pay without opening it, and scanning notifications on the external screen is a breeze.\n\nThat said, there are plenty of cons too. The cameras on this model are not great, the processor is slower than what I was used to from Pixels before that, and the usage of the external display is suboptimal (seriously: it's shameful how bad Google Maps uses the available space on it).\n\nOver the time I've had the phone the crease has come *very* noticeable and by now the phone doesn't fully open flat anymore. Neither hinders my usage of it, but YMMV. \n\nI've said since I got this phone that I love the flip form factor and am glad Motorola is providing good options, but the moment Apple or Google makes one I'd switch to that.",
          "score": 3,
          "created_utc": 1737837374.0,
          "replies": []
        },
        {
          "id": "m950fxa",
          "author": "None",
          "body": "[deleted]",
          "score": 2,
          "created_utc": 1737832672.0,
          "replies": [
            {
              "id": "m953zi3",
              "author": "watduhdamhell",
              "body": "I mean, they were. The current gen is pretty sleek and slim imo.",
              "score": 1,
              "created_utc": 1737833702.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m98kfhi",
          "author": "highgravityday2121",
          "body": "China’s top phone sellers are all foldable. They’re a huge market for Apple.",
          "score": 1,
          "created_utc": 1737880547.0,
          "replies": []
        },
        {
          "id": "m9fzao3",
          "author": "Leftieswillrule",
          "body": "My friend has the pixel fold and he loves it, but it seems to have a pretty limited applicability. Hard to get excited about a screen twice the size of a normal smartphone when it's still smaller than an ipad and I spend all my time around 27\" monitors and 55\" TVs anyway",
          "score": 1,
          "created_utc": 1737982129.0,
          "replies": []
        },
        {
          "id": "m94zycs",
          "author": "CatPhysicist",
          "body": "It’s gimmicky at best but you know Apple has toyed with designs and has some prototypes.",
          "score": 0,
          "created_utc": 1737832531.0,
          "replies": []
        },
        {
          "id": "mf0shy6",
          "author": "highgravityday2121",
          "body": "China’s most popular phones are all foldable.",
          "score": 0,
          "created_utc": 1740632492.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m94ykep",
      "author": "MetalBawx",
      "body": "What we actually know. Apples sales have taken a small dip and they belive it to be due to rival's putting out foldable phones. So a foldable iPhone is on the way.",
      "score": 1,
      "created_utc": 1737832126.0,
      "replies": [
        {
          "id": "m954e8p",
          "author": "watduhdamhell",
          "body": "Just like they did with moving away from *refusing* to make large phones to *only* making large phones when their sales were slumping in 2012 as a direct result of Android moving that direction.\n\nApple has long been a follower in this space, at least since the iPhone 4.",
          "score": 1,
          "created_utc": 1737833822.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9d4tcx",
      "author": "anonymousjeeper",
      "body": "Bring back the 3GS form factor! Phones are too damned large.",
      "score": 1,
      "created_utc": 1737937107.0,
      "replies": []
    },
    {
      "id": "m94yzyt",
      "author": "mbelmin",
      "body": "Does anyone think Apple wants to make premium device with a plastic screen?",
      "score": -1,
      "created_utc": 1737832252.0,
      "replies": [
        {
          "id": "m950afh",
          "author": "RhetoricalOrator",
          "body": "I'm probably too optimistic, but I'm hoping when they finally release their take on foldables, it'll be something innovative with something significantly more durable than the current foldables, which can be scratched by fingernails.",
          "score": 2,
          "created_utc": 1737832629.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m98exj3",
      "author": "bakabakababy",
      "body": "But why",
      "score": 0,
      "created_utc": 1737877253.0,
      "replies": []
    }
  ]
}