{
  "post": {
    "title": "Asus, Samsung, and MSI announce world’s first 27-inch 4K OLED 240Hz monitors | New gaming monitors promise high refresh rate 4K OLED gaming without the need for a 32-inch panel.",
    "author": "chrisdh79",
    "id": "1hruuq7",
    "score": 928,
    "created_utc": 1735827987.0,
    "selftext": "",
    "num_comments": 150,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hruuq7/asus_samsung_and_msi_announce_worlds_first_27inch/"
  },
  "comments": [
    {
      "id": "m50fp8i",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1735827988.0,
      "replies": []
    },
    {
      "id": "m51fx7u",
      "author": "GaussToPractice",
      "body": "I still dont get why this segment is so slow to get price dragged down. Its been 10 years for both 4k and OLED technologies. and we have 2k panels for 6 inch smarthpones printed left and right. Is it panel yields? every 50 dollars of discount we have from new panels 1080p IPS es go down 100 dollars.\n\nI hope Xiaomis new monitors keep coming to drag the prices down.",
      "score": 183,
      "created_utc": 1735839733.0,
      "replies": [
        {
          "id": "m52qpbu",
          "author": "Shoelebubba",
          "body": "Iirc it was the yields, but specifically the sizes of the mother glass that OLED panels are cut out of and keeping waste down to a minimum.    \n     \nSo yields for OLEDs have been pretty good (for LG, I don’t really kept track of Samsung) but the “problem” has been the size of the mother glass and how it’s cut.    \n     \nIt’s also why the 83” models are priced so much higher than 77” per…square inch of screen size.     \n     \nLike a pane of mother glass can neatly cut out 3x 65” and 6x 32” panels to keep the “lost” glass down to about 90%. Or that same glass can cut out 6x 55” panels.     \n     \nOr you could cut out a single 83” panel and a couple of 27” panels. Or 2 77” panels.     \n     \nThat’s been the problem; the big numbers are in the smart phone sized panels or TV sized panels. It makes sense to prioritize cutting mother glass panels to sell those, while the odd 27”, 32”, 42” sizes are oddly expensive.     \n    \nOnly reason I even looked into it was I found it really odd 42” and 48” OLEDs were so similar in price and so were the 55” and 65”.",
          "score": 40,
          "created_utc": 1735853916.0,
          "replies": [
            {
              "id": "m540zrc",
              "author": "PatSajaksDick",
              "body": "I just like the term mother glass",
              "score": 31,
              "created_utc": 1735868494.0,
              "replies": []
            },
            {
              "id": "m53n1bl",
              "author": "hako_london",
              "body": "But surely the demand is there for gaming and workstation PCs to make a billion mother glass pieces of the monitor size?!",
              "score": 2,
              "created_utc": 1735863931.0,
              "replies": [
                {
                  "id": "m54le28",
                  "author": "Shoelebubba",
                  "body": "No.    \nA workstation PC will not need this, what office worker is gonna need OLED?   \nAnyone working in video, images or graphics, sure. But realistically they’re taking higher color accuracy monitors over the high refresh rate monitors and they’re happy to pay the premium for said color accuracy.     \n      \nThe other is there is still an inherit danger of burn in with OLED. There will always be a risk of burn in, anything Organic (the O in OLED) is going to degrade with time. You can put as many preventative and life extending features but it will eventually happen.    \n    \nThat is always gonna be a problem for mass adoption. MicroLED is gonna be OLED without the burn in but that tech is at least 5 years away (also I read it was 5 years away in 2020 lol).    \n     \nSo, what’s why people were waiting for the 10.5G factories (currently 8.5G) so bigger than 97” OLEDs could be made but more importantly more 27” could be cut at the same time.     \n     \nDon’t know anything else beyond that.   \nIMO LG/Samsung are making more money per mother glass prioritizing TV sizes. If their research suggested they’d make more money selling 27”-32” monitors, you betcha they’d immediately start trying to sell as many as possible.",
                  "score": 11,
                  "created_utc": 1735875851.0,
                  "replies": [
                    {
                      "id": "m57e1m4",
                      "author": "hako_london",
                      "body": "Burn is sounds like a real problem to overcome. I see it my OLED TV and it's hardly on the menu.",
                      "score": 2,
                      "created_utc": 1735922487.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m52b7ie",
          "author": "TrptJim",
          "body": "I wonder how much of it is just sheer volume. HDTVs sell in much larger numbers, and the market there is super competitive with a lot of options.",
          "score": 35,
          "created_utc": 1735849323.0,
          "replies": [
            {
              "id": "m53hb67",
              "author": "OMGItsCheezWTF",
              "body": "There's also the software side of TVs, they can offset the cost of the panels by loading the TV with paid services, app stores and adverts, not to mention mass data collection.\n\nThey can't do any of that with a monitor.",
              "score": 22,
              "created_utc": 1735862157.0,
              "replies": [
                {
                  "id": "m53i988",
                  "author": "TrptJim",
                  "body": "[Yeah, about that... Tizen monitors incoming](https://tftcentral.co.uk/news/samsung-unveil-2025-qd-oled-monitor-line-up-including-a-27-4k-and-a-500hz-display-plus-others) from CES 2025, Samsung's got you covered!",
                  "score": 10,
                  "created_utc": 1735862458.0,
                  "replies": [
                    {
                      "id": "m53ya9y",
                      "author": "karateninjazombie",
                      "body": "And that's why you don't buy a Samsung panel 🤷‍♂️",
                      "score": 9,
                      "created_utc": 1735867567.0,
                      "replies": [
                        {
                          "id": "m55pwk1",
                          "author": "RenegadeUK",
                          "body": "Is Tizen Software a No-Go ?",
                          "score": 2,
                          "created_utc": 1735896721.0,
                          "replies": [
                            {
                              "id": "m58vkpm",
                              "author": "karateninjazombie",
                              "body": "Not so much a no go. The panels and picture are o.k like all the big actually decent brands and price points compared. \n\nBut as above. They embed shit into the menu software you cannot remove that has ads in. As well as data scraping etc.",
                              "score": 2,
                              "created_utc": 1735938485.0,
                              "replies": [
                                {
                                  "id": "m5a0wee",
                                  "author": "RenegadeUK",
                                  "body": "Thanks for notifying.",
                                  "score": 1,
                                  "created_utc": 1735951892.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m5464j2",
                  "author": "DIYThrowaway01",
                  "body": "Love my non smart tv",
                  "score": 2,
                  "created_utc": 1735870299.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m51xbpe",
          "author": "Plank_With_A_Nail_In",
          "body": "Because people pay the high prices.",
          "score": 33,
          "created_utc": 1735845056.0,
          "replies": []
        },
        {
          "id": "m9h9qgc",
          "author": "WolfgangK",
          "body": "What are you talking bout? Prices have come down fast within the past 2 years.",
          "score": 1,
          "created_utc": 1737997047.0,
          "replies": []
        },
        {
          "id": "m521vlh",
          "author": "waxwayne",
          "body": "Because people will pay it.",
          "score": 0,
          "created_utc": 1735846564.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m50xaz0",
      "author": "Foodstamps4life",
      "body": "Unfortunately the pricing is going to be astronomical. My hope is that at some point I can get a 32 inch OLED for 4-5 hundred. Spending 65 inch oled money for a monitor is unappealing.",
      "score": 90,
      "created_utc": 1735834003.0,
      "replies": [
        {
          "id": "m511lm8",
          "author": "Onceforlife",
          "body": "After stacking discount and rakuten I got my 32 inch Alienware 240hz oled momitor down to 800 Canadian buckaroos. Which is around 560 USD. I guess it’s still a bit higher than your range, but it was good enough for me",
          "score": 27,
          "created_utc": 1735835352.0,
          "replies": [
            {
              "id": "m5286gs",
              "author": "Helpmehelpyoulong",
              "body": "sounds pretty good to me. That’s about what I paid for an FV43U.",
              "score": 3,
              "created_utc": 1735848416.0,
              "replies": []
            },
            {
              "id": "m53190l",
              "author": "MattLogi",
              "body": "Really?! I’ve been hovering bapcsales and RFD and closest I saw was just under 1k before tax….where on earth did you find it for $800?",
              "score": 3,
              "created_utc": 1735857081.0,
              "replies": [
                {
                  "id": "m536d2u",
                  "author": "Onceforlife",
                  "body": "Lmao it was on rfd and the bapcsales subreddit, around Black Friday, you need to read in the thread, where 1 or 2 of the days monitors had 20% rakuten and the 10% rewards coupon on top of an existing 10% off.",
                  "score": 2,
                  "created_utc": 1735858661.0,
                  "replies": [
                    {
                      "id": "m58m7ew",
                      "author": "MattLogi",
                      "body": "Oh yeah I see it now and remember that sale. I mean it’s $840 and ~$100 was Dell Rewards which unless you are buying another monitor isn’t that useful.",
                      "score": 1,
                      "created_utc": 1735935623.0,
                      "replies": [
                        {
                          "id": "m58qijd",
                          "author": "Onceforlife",
                          "body": "My invoice after taxes was $1118 after tax in Ontario, I got $198 from rakuten, so if we work backwards, 1118-198=920, and if we take out taxes we have 920/1.13=814.159 CAD pre tax in Ontario.\n\nI’m not sure what you mean by $100 in Dell rewards, I got an 10% off Alienware monitors when I signed up for a new account with Dell rewards. This promo was stackable on top of the existing 10% off. And this was only available for a short time before they discontinued it.",
                          "score": 1,
                          "created_utc": 1735936949.0,
                          "replies": []
                        },
                        {
                          "id": "m58rvex",
                          "author": "Onceforlife",
                          "body": "Also the 800 number I had earlier is based on how you calculate the tax, since rakuten is calculated for the price before taxes, some people deduct the entire tax amount from the final price to work backwards towards the pre tax amount. \n\nIMO, 814 is the more realistic adjusted pre tax number, but most people would deduct the entire tax amount from the final bill to arrive at 800 Not sure if this made sense. You’d know if you dealt with rakuten.",
                          "score": 1,
                          "created_utc": 1735937363.0,
                          "replies": [
                            {
                              "id": "m58ska9",
                              "author": "MattLogi",
                              "body": "Ohh so the 10% was off the price not in Dell reward points. Did you also get Dell reward point on the purchase? That’s a really good deal for that monitor",
                              "score": 1,
                              "created_utc": 1735937572.0,
                              "replies": [
                                {
                                  "id": "m5asuvq",
                                  "author": "Onceforlife",
                                  "body": "Yea you also get Dell rewards for the purchase. But I won’t be using it any time soon lol",
                                  "score": 1,
                                  "created_utc": 1735962000.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m54eaw3",
              "author": "ArchusKanzaki",
              "body": "If not for the curved screen, I would take Alienware's.... That pricing is so good for the screen you get.\n\nInstead, I took G80SD. My best pricing for G80SD is 1500 SGD, which is basically 1500 CAD equivalent. It's now sold-out on the Samsung store lol.",
              "score": 1,
              "created_utc": 1735873216.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m515odx",
          "author": "Morrisahn",
          "body": "Got the 49 inch oled ultrawide 144 hd the other day for $384 with cash back like $580 before cash back direct from Samsung. These things are finally starting to get cheaper",
          "score": 5,
          "created_utc": 1735836619.0,
          "replies": [
            {
              "id": "m51sp4t",
              "author": "RX-Vortex",
              "body": "Could you tell me how you got this deal?",
              "score": 3,
              "created_utc": 1735843548.0,
              "replies": [
                {
                  "id": "m53y40k",
                  "author": "Morrisahn",
                  "body": "It was a Samsung edu deal I saw on slickdeals the other night",
                  "score": 1,
                  "created_utc": 1735867508.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m51bjxx",
              "author": "Foodstamps4life",
              "body": "Great deal, but I cant use ultrawides because of my work.",
              "score": 2,
              "created_utc": 1735838423.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m51cpxq",
          "author": "CiraKazanari",
          "body": "Price always goes down as time goes on.",
          "score": 3,
          "created_utc": 1735838778.0,
          "replies": [
            {
              "id": "m52502t",
              "author": "fahimhasan462",
              "body": "Meh, very very slow in case of OLED",
              "score": 5,
              "created_utc": 1735847478.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m50zsdm",
          "author": "clueless_as_fuck",
          "body": "And you need a god tier PC to get all the bang out of that monitor.",
          "score": 5,
          "created_utc": 1735834784.0,
          "replies": []
        },
        {
          "id": "m51b5sy",
          "author": "Goose-Suit",
          "body": "Even if it was capped at 180hz that would be perfect for me. I don’t play highly competitive games anymore so I really only need at most 120 hz.",
          "score": 3,
          "created_utc": 1735838304.0,
          "replies": [
            {
              "id": "m51x623",
              "author": "Plank_With_A_Nail_In",
              "body": "4k 120hz OLEDS have been available for years now.",
              "score": 2,
              "created_utc": 1735845003.0,
              "replies": [
                {
                  "id": "m5248ag",
                  "author": "Goose-Suit",
                  "body": "They’re usually a lot bigger though like 42 inches and bigger. I’d rather have a 27-32 inch monitor.",
                  "score": 9,
                  "created_utc": 1735847253.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m51ucn0",
          "author": "None",
          "body": "[removed]",
          "score": 2,
          "created_utc": 1735844082.0,
          "replies": [
            {
              "id": "m54ceq7",
              "author": "ArchusKanzaki",
              "body": "Its 1200$ retail for the new ASUS it seems. It probably will go down though, probably around Black Friday. That's pretty good starting price imo.",
              "score": 1,
              "created_utc": 1735872542.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m54dsxl",
          "author": "ArchusKanzaki",
          "body": "Last year's 32\" flat OLED monitor already reaching 700$. The curved 32\" like Alienware can be got for even cheaper. You can definitely buy OLED for around that price with discounts stacking and everything. Also, the new ROG seems to will retail at 1200$. That's pretty cheap compared to what used to be OLED starting price. I can bet MSI will make cheaper version too, probably with reduced refresh rate like their MAG32UP vs MAG32URX\n\nAnd sure, you can probably get 43 inches of screen if you go for TV for same amount of money.... But you will also will have 43 inches of TV for a monitor and not everyone wants that",
          "score": 1,
          "created_utc": 1735873035.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m50mqte",
      "author": "KatsHubz87",
      "body": "Awesome!\n\nI will say 4K at 27” is too tiny for my 37 year-old old bespectacled eyes. 32” is perfect for me. I imagine 27” will be perfect for others.\n\nSigned, an old GeForce FX 5600 gamer. \n\n(Currently running an RTX 3090)",
      "score": 125,
      "created_utc": 1735830530.0,
      "replies": [
        {
          "id": "m50ycdd",
          "author": "sixfourtykilo",
          "body": "While I agree with you on the old age issue, having a screen that large in front of my face is just too all consuming. \n\nPlus those 30\"+ screens take a lot of real estate and I run three screens.",
          "score": 26,
          "created_utc": 1735834330.0,
          "replies": [
            {
              "id": "m527u8j",
              "author": "Helpmehelpyoulong",
              "body": "You’d hate my setup. I have a 43” with a 27” on the side flipped vertically haha.",
              "score": 4,
              "created_utc": 1735848314.0,
              "replies": [
                {
                  "id": "m52j33q",
                  "author": "sixfourtykilo",
                  "body": "I have a 46\" TV hooked up as an external display but it's like 5' from my face lol",
                  "score": 2,
                  "created_utc": 1735851681.0,
                  "replies": [
                    {
                      "id": "m567nrn",
                      "author": "blither86",
                      "body": "Same but with 65\". 4k and only 60hz",
                      "score": 1,
                      "created_utc": 1735907070.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m54c7nt",
                  "author": "ArchusKanzaki",
                  "body": "I have a 32\" with a 24\" flipped vertically on the left because I want second monitor but no desk space. Yours is basically me but even bigger screen combo lol.",
                  "score": 2,
                  "created_utc": 1735872471.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m518j6p",
              "author": "uncoolcentral",
              "body": "Yeah… I have the combo of: old, and three monitors. My desk is 6 feet wide and my 3 27-inch monitors spill out over the side even though they are curved in toward me because my main monitor is r1000. \n\n¯\\\\\\_(ツ)\\_/¯",
              "score": 1,
              "created_utc": 1735837495.0,
              "replies": [
                {
                  "id": "m52f4gf",
                  "author": "ruffznap",
                  "body": "I'm still rockin a 23-24\" triple monitor setup.\n\nI've used a single 27\" monitor in a work capacity before, and they're nice, but 3 would just be too much.\n\nAnd I'm saying all this as a professional designer who constantly is working on web, graphic design, and video projects that benefit from monitors and screen sizes, but even so it's still just too overwhelming to have multiple monitors over that 24\" mark for me personally.",
                  "score": 5,
                  "created_utc": 1735850505.0,
                  "replies": [
                    {
                      "id": "m52gu61",
                      "author": "cromag5150",
                      "body": "As someone using three 27\" monitors I can tell you its bliss.",
                      "score": 2,
                      "created_utc": 1735851013.0,
                      "replies": []
                    },
                    {
                      "id": "m537il8",
                      "author": "uncoolcentral",
                      "body": "I do have occasional minor regrets moving from 24 to 27 four years ago, but I feel like it’s a net gain.",
                      "score": 1,
                      "created_utc": 1735859028.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m51adpz",
              "author": "KatsHubz87",
              "body": "I like my gaming experiences to be immersive lol. A big fan of VR too.",
              "score": 1,
              "created_utc": 1735838066.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m50su3x",
          "author": "pragmatick",
          "body": "You can still use scaling when not inside a game. I use 125% on my 32\".",
          "score": 33,
          "created_utc": 1735832566.0,
          "replies": [
            {
              "id": "m50t92g",
              "author": "KatsHubz87",
              "body": "True. But I’ve played some indie games where the Windows scaling messes up the game and it’s annoying to flip flop the setting all the time. A larger screen is just my preference.",
              "score": 24,
              "created_utc": 1735832701.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m52kiug",
          "author": "velociyabster",
          "body": "5k at 2x on a 27\" monitor is the perfect resolution. Everything is readable even when i'm not wearing my glasses. Non integer scaling looks terrible to me no matter what anyone says, and scaling everything 2x on a 4k 27\" makes everything too big, and there's not enough room two documents side by side. Its a shame the only 5k options are unreliable or terribly expensive.",
          "score": 3,
          "created_utc": 1735852106.0,
          "replies": [
            {
              "id": "m5a9j4d",
              "author": "postconsumerwat",
              "body": "Tempted to get a 5k for photo work, but it seems like 4k just got affordable... I guess 3 years from now 5k will be more affordable... \n\nWide-screen displays are good for movies. Square displays are expensive too... \n\nToo bad nothing good to watch w these Wide-screen",
              "score": 1,
              "created_utc": 1735954883.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m54gmgx",
          "author": "rolfraikou",
          "body": "I've been pretty keen on the 108.79 PPI you get with 2560x1440 at 27\". If I go to 4k I'd prefer 41\" or 40\" because it would keep it closer to the same PPI. \n\nFor me it's the perfect blend of - If I sit at a suggested distance from the monitor, I can't see pixels. But if I lean in, I can.",
          "score": 2,
          "created_utc": 1735874060.0,
          "replies": []
        },
        {
          "id": "m50snma",
          "author": "CaterpillarReal7583",
          "body": "How far do you sit from your pc monitor?",
          "score": 1,
          "created_utc": 1735832508.0,
          "replies": [
            {
              "id": "m50tfhx",
              "author": "KatsHubz87",
              "body": "A 36” width desk seated position away.",
              "score": 3,
              "created_utc": 1735832758.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m5461ld",
          "author": "Nervous_Contract_139",
          "body": "Your head turn latency is why you have a .06 KD ratio.",
          "score": 1,
          "created_utc": 1735870270.0,
          "replies": []
        },
        {
          "id": "m531dr7",
          "author": "matycauthon",
          "body": "i don't get the obsession people have had for 27 inch 4k ppi either, 32 is definitely enough. anyone that's actually seen a dead pixel on a 1440p 27 inch panel will tell you it's smaller than most needles",
          "score": 1,
          "created_utc": 1735857122.0,
          "replies": []
        },
        {
          "id": "m52e5x9",
          "author": "theBdub22",
          "body": "I wish 30\" was a thing. I went from a 27 inch 1440p IPS to a 32\" 4K IPS, and sometimes the screen feels a little too big, especially when playing FPS games, but it feels perfect for Indiana Jones. A 30\" display would be a great compromise.",
          "score": 1,
          "created_utc": 1735850218.0,
          "replies": []
        },
        {
          "id": "m50u4jy",
          "author": "themastersmb",
          "body": "Smartphones have a far greater ppi density. People seem to recognize lower resolutions for a small screen like that.",
          "score": -2,
          "created_utc": 1735832984.0,
          "replies": [
            {
              "id": "m512p82",
              "author": "Britz10",
              "body": "Phones are a lot closer to a user's face than a monitor.",
              "score": 10,
              "created_utc": 1735835694.0,
              "replies": [
                {
                  "id": "m51cmq7",
                  "author": "CiraKazanari",
                  "body": "Says you. My nose always touches my monitor.",
                  "score": 1,
                  "created_utc": 1735838751.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m5108m0",
      "author": "sometipsygnostalgic",
      "body": "This is great but what games are you running at 4k 240hz? 1440p seems a better balance for small monitors.",
      "score": 26,
      "created_utc": 1735834925.0,
      "replies": [
        {
          "id": "m52v849",
          "author": "Argomer",
          "body": "Old ones. They look better too.",
          "score": 5,
          "created_utc": 1735855250.0,
          "replies": [
            {
              "id": "m5auzxs",
              "author": "hotmilfenjoyer",
              "body": "Yeah I would tear up some 4k 240hz battlefield 1",
              "score": 2,
              "created_utc": 1735962834.0,
              "replies": []
            },
            {
              "id": "m533fxp",
              "author": "nox_n2o_93",
              "body": "Playing Half Life 2 at 4K 240Hz on my monitor is absolutely incredible",
              "score": 1,
              "created_utc": 1735857744.0,
              "replies": [
                {
                  "id": "m55s41w",
                  "author": "Argomer",
                  "body": "Oblivion, Dawn of War and other childhood games too :D  \nAfter playing them on a potato as a kid with 1-15 fps it is indeed mindblowing.",
                  "score": 1,
                  "created_utc": 1735898127.0,
                  "replies": [
                    {
                      "id": "m55sl2o",
                      "author": "nox_n2o_93",
                      "body": "Absolutely! Even more recent (sort of) games like Fallout 4/Skyrim, New Vegas or MGSV run brilliantly with at least 144+fps on my 3080 in native 4K.",
                      "score": 2,
                      "created_utc": 1735898426.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m535rxx",
                  "author": "TuggMaddick",
                  "body": "Take sugar pills while you do it for a truly amazing experience",
                  "score": -3,
                  "created_utc": 1735858474.0,
                  "replies": [
                    {
                      "id": "m55sh63",
                      "author": "Argomer",
                      "body": "You're saying old games don't look better on new hardware?",
                      "score": 1,
                      "created_utc": 1735898359.0,
                      "replies": []
                    },
                    {
                      "id": "m53w7xf",
                      "author": "nox_n2o_93",
                      "body": "Nah, sugar pills hit better when I boof ‘em by the handful",
                      "score": 0,
                      "created_utc": 1735866873.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m51xjhf",
          "author": "Plank_With_A_Nail_In",
          "body": "PC's can be used to do things other than playing games on. Additionally monitors should last you many many years so a lot will change during their lifetimes.",
          "score": 12,
          "created_utc": 1735845129.0,
          "replies": []
        },
        {
          "id": "m539kzo",
          "author": "jubjubninja",
          "body": "You can already do this with a 4090 and medium settings, it will only be easier once 50 series is out.",
          "score": 1,
          "created_utc": 1735859676.0,
          "replies": []
        },
        {
          "id": "m53f1gu",
          "author": "turbinedriven",
          "body": "For me the real benefit is 4k productivity with great pq while being able to game at a 120hz.",
          "score": 1,
          "created_utc": 1735861426.0,
          "replies": []
        },
        {
          "id": "m51kqe4",
          "author": "kobriks",
          "body": "With frame generation you can hit it in some games.",
          "score": -8,
          "created_utc": 1735841149.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m52wxef",
      "author": "Shapes_in_Clouds",
      "body": "I picked up a 32” 4K OLED last year and I enjoy it, but the pixel density on 27” must be absolutely glorious.  It’s pretty sharp at 32”, better than I thought it would be, but you can still see a faint pixel grid on occasion.",
      "score": 4,
      "created_utc": 1735855769.0,
      "replies": []
    },
    {
      "id": "m50xzw4",
      "author": "PM_YOUR_BOOBS_PLS_",
      "body": "Fucking finally!  Been waiting for forever for 27\" **4K** OLED.  But damn.  I'm probably going to have to spend a small fortune on one of these now...",
      "score": 15,
      "created_utc": 1735834221.0,
      "replies": [
        {
          "id": "m510d0j",
          "author": "sometipsygnostalgic",
          "body": "i have a 27 inch 1440p 240hz oled from msi...",
          "score": 0,
          "created_utc": 1735834964.0,
          "replies": [
            {
              "id": "m51dt31",
              "author": "PM_YOUR_BOOBS_PLS_",
              "body": "I meant 27\" 4K OLED.  Smallest 4K OLED has been 32\" for a couple of years now.",
              "score": 8,
              "created_utc": 1735839102.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m521o2h",
      "author": "Horvat53",
      "body": "Would love to get an OLED monitor, but the pricing is way too high.",
      "score": 3,
      "created_utc": 1735846501.0,
      "replies": [
        {
          "id": "m54fy0u",
          "author": "ArchusKanzaki",
          "body": "27\" 1440p OLED monitor is reaching 600 USD now. Its getting cheaper than ever.",
          "score": 4,
          "created_utc": 1735873813.0,
          "replies": []
        },
        {
          "id": "m54xogf",
          "author": "Cheezewiz239",
          "body": "Some went down to the $400-$500 range recently.",
          "score": 3,
          "created_utc": 1735880914.0,
          "replies": [
            {
              "id": "m55jvk5",
              "author": "TacoOfGod",
              "body": "Thew KTC monitor I just bought is [$536 after taxes on Amazon](https://www.amazon.com/gp/product/B0DK4J3SKT/) right now. Though it's weirdly being sold for [$617 after taxes and coupon on another listing](https://www.amazon.com/gp/product/B0DK329CH7/r) and the listing I actually purchased under is now [$585 after taxes](https://www.amazon.com/gp/product/B0CRDRL92Z/).\n\nWhen I bought, it was $600 with a $100 coupon.",
              "score": 1,
              "created_utc": 1735892876.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m50pqp0",
      "author": "Placed-ByThe-Gideons",
      "body": "An HDR400 QD-OLED panel? That tells me all I need to know. It's 2025 they gotta do better.",
      "score": 16,
      "created_utc": 1735831542.0,
      "replies": [
        {
          "id": "m50r30v",
          "author": "random_reddit_user31",
          "body": "That's HDR True black which is a different certification. Current QD-OLED panels have a peak of 1000 nits so I'd imagine these are the same or more.",
          "score": 30,
          "created_utc": 1735831989.0,
          "replies": [
            {
              "id": "m52bc7e",
              "author": "Placed-ByThe-Gideons",
              "body": "I know that. My point is it's not good enough many other panels also carry the same certification and are way too dim. \n\nOff the top of my head, the 27GS93QE-B.",
              "score": -1,
              "created_utc": 1735849362.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m50rdi6",
          "author": "random_beard_guy",
          "body": "HDR True Black 400 is not the same standard as HDR400 for LCDs. The highlights are 1000 nits in OLED panels with that VESA standard.",
          "score": 18,
          "created_utc": 1735832087.0,
          "replies": [
            {
              "id": "m5184fi",
              "author": "AuryGlenz",
              "body": "Well that’s not confusing.",
              "score": 10,
              "created_utc": 1735837368.0,
              "replies": [
                {
                  "id": "m51cxp9",
                  "author": "CiraKazanari",
                  "body": "That’s why standards exist! To make things… confusing?",
                  "score": 7,
                  "created_utc": 1735838843.0,
                  "replies": [
                    {
                      "id": "m51gehi",
                      "author": "arguing_with_trauma",
                      "body": "Superspeed confusing",
                      "score": 4,
                      "created_utc": 1735839877.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m54frya",
          "author": "ArchusKanzaki",
          "body": "Its probably to reduce burn-ins that they are going only for HDR TrueBlack 400. Brighter backlight means hotter screen means higher chance for burn-in. Its good enough for almost any scenario even with more or less direct sunlight, especially with the added contrast.\n\nIf you absolutely need the monitor to fight sunlight, I suggest going for Matte coating like G80SD. Its really damn good.",
          "score": 1,
          "created_utc": 1735873753.0,
          "replies": [
            {
              "id": "m56ys01",
              "author": "sqrlmasta",
              "body": "OLEDs don't have a backlight, each individual pixel provides its own light",
              "score": 1,
              "created_utc": 1735917727.0,
              "replies": [
                {
                  "id": "m5714uv",
                  "author": "ArchusKanzaki",
                  "body": "Well, its to increase the life of each individual OLED then.",
                  "score": 1,
                  "created_utc": 1735918491.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m53kgmb",
          "author": "ToeKnail",
          "body": "Can anyone with an expertise in electronics tell me something: isn't there a limit to how much the eye and brain can perceive, and at what point will the making of higher resolution or faster performing monitors simply be pointless?",
          "score": 0,
          "created_utc": 1735863148.0,
          "replies": [
            {
              "id": "m54n9kk",
              "author": "StarChaser1879",
              "body": "https://youtu.be/e_CbbAbf7gE?si=p9RAqHEKGSg80mao",
              "score": 1,
              "created_utc": 1735876580.0,
              "replies": [
                {
                  "id": "m54wdeh",
                  "author": "ToeKnail",
                  "body": "So basically, the software companies creating games with greater and greater demands on graphics card performance are in bed with the monitor manufacturers...and so on and so on.",
                  "score": 2,
                  "created_utc": 1735880350.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m54q9ia",
              "author": "Thedanielone29",
              "body": "We’re already seeing quickly diminishing returns from 1440p to 4k. I reckon there’s no real good point to go beyond 8k and 580 fps. At that point, our brain wires will cause as much latency as the monitor and the resolution will be high enough such that anti-aliasing would likely be unnecessary. 4k 240fps is basically already there imo",
              "score": 1,
              "created_utc": 1735877783.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m55fqqu",
      "author": "DasGaufre",
      "body": "Yeah, but I WANT a 32 inch panel no point imo to have such a small screen at 4k.",
      "score": 3,
      "created_utc": 1735890302.0,
      "replies": []
    },
    {
      "id": "m5500df",
      "author": "llathosv2",
      "body": "Been running on a 120Hz LG 42\" OLED for 2 years.  It's glorious and cost about $600 back then...",
      "score": 2,
      "created_utc": 1735881974.0,
      "replies": []
    },
    {
      "id": "m5237ub",
      "author": "FlaccidRazor",
      "body": "What I really need is a smaller monitor with the same features said any gamer ever?",
      "score": 5,
      "created_utc": 1735846957.0,
      "replies": [
        {
          "id": "m54eunu",
          "author": "ArchusKanzaki",
          "body": "Well, not everyone is rocking a 43\" screen even after it drops to around same pricing or even cheaper than 32\" don't they?",
          "score": 5,
          "created_utc": 1735873416.0,
          "replies": [
            {
              "id": "m54u3zr",
              "author": "FlaccidRazor",
              "body": "Meh, I'm old, size make more sense to me than resolution. 27\" to 32\" is such a small difference. It might make a ton of sense for someone who just can't fit a 32\" monitor height-wise, but for someone who needs that 3/4 of an in less height, boom!",
              "score": 1,
              "created_utc": 1735879382.0,
              "replies": [
                {
                  "id": "m55coto",
                  "author": "ArchusKanzaki",
                  "body": "27 to 32 is big difference.... because I did not buy 27 1440p despite it being alot cheaper than 32 4K. I don't particularly care for 4K or 240Hz. The size play bigger role in my decision-making, especially because my previous monitor is already 32\".",
                  "score": 1,
                  "created_utc": 1735888497.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m54k6hw",
          "author": "ckelley87",
          "body": "To me, 27” is the optimal monitor size, and not being able to get a 4K version in OLED has been annoying. I don’t care about the high refresh rate part of this but I am so glad to see that resolution in this space here.\n\nThat said, for me to use one monitor for both my PC and Mac I’d need it to be 5K, and there’s luckily a few new models coming out soon, though not OLED.",
          "score": 4,
          "created_utc": 1735875388.0,
          "replies": [
            {
              "id": "m54uhcj",
              "author": "FlaccidRazor",
              "body": "4k already can display more colors than any human eye can distinguish, and more resolution than the average eye can fully appreciate. Making shit bigger is the only reason to increase resolution.",
              "score": -2,
              "created_utc": 1735879539.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m51l3mi",
      "author": "wicktus",
      "body": "I’ll wait for more breakthrough like dual stacked oled, broghter panels, even more burn-in mitigations etc before thinking of changing my oled\n\nAbsolutely love our qd-oled, one of the best purchase I did last year given how much we are enjoying using it",
      "score": 2,
      "created_utc": 1735841257.0,
      "replies": []
    },
    {
      "id": "m54m2tb",
      "author": "ohiocodernumerouno",
      "body": "5090 Will never hit 240hz at 4k. You'll be playing pybg at 2560 like the rest of us.",
      "score": 2,
      "created_utc": 1735876116.0,
      "replies": []
    },
    {
      "id": "m55bs50",
      "author": "networkn",
      "body": "I dont understand the desire for 4k at 27 inches. Crazy.",
      "score": 2,
      "created_utc": 1735887995.0,
      "replies": []
    },
    {
      "id": "m519mbx",
      "author": "jmacman12",
      "body": "Not sure what pricing will be but hopefully it's not far off what Dough priced their 27\" 4K OLED (which is also 240hz). I believe it starts at $650",
      "score": 1,
      "created_utc": 1735837832.0,
      "replies": [
        {
          "id": "m54gezj",
          "author": "ArchusKanzaki",
          "body": "I don't think 27\" 4K OLED exist before. Not until these monitors launch. There is only a 27\" QHD or 32\" 4K.",
          "score": 2,
          "created_utc": 1735873984.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m51aykh",
      "author": "Influence_X",
      "body": "I prefer 27 2k I have their earlier OLED",
      "score": 2,
      "created_utc": 1735838243.0,
      "replies": []
    },
    {
      "id": "m51n33p",
      "author": "Konjo888",
      "body": "![gif](giphy|xTiTnqUxyWbsAXq7Ju)\n\nIf true",
      "score": 1,
      "created_utc": 1735841837.0,
      "replies": []
    },
    {
      "id": "m52r659",
      "author": "GodZillaBlazinDong99",
      "body": "I’m still using my 27” inch Apple Cinema Monitor for gaming and it’s beautiful. How does it compare to these new and modern gaming monitors of today?",
      "score": 1,
      "created_utc": 1735854053.0,
      "replies": [
        {
          "id": "m52sz9b",
          "author": "matrixhaj",
          "body": "Compared to gaming display its most likely super slow and \"laggy\". Also missing hdr capabilities. Otherwise, image quality is probably good",
          "score": 2,
          "created_utc": 1735854588.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m531l2a",
      "author": "nugymmer",
      "body": "Any changes to the pixel layout?",
      "score": 1,
      "created_utc": 1735857184.0,
      "replies": []
    },
    {
      "id": "m53212b",
      "author": "Persian2PTConversion",
      "body": "Can't wait to pay 10,000 CAD for it in Canada xD",
      "score": 1,
      "created_utc": 1735857320.0,
      "replies": []
    },
    {
      "id": "m53emuy",
      "author": "Majorjim_ksp",
      "body": "I bet it looks crispy in the dark.",
      "score": 1,
      "created_utc": 1735861296.0,
      "replies": []
    },
    {
      "id": "m53npl6",
      "author": "unlimitedcode99",
      "body": "Still waiting for a reasonably priced OLED... as much as reasonably priced SSDs as much as HDD in per TB price...\n\nAlso 4k is still stupidly expensive to run, where neither Nvidia nor AMD gives enough GPU power to run these monitors on a budget. You need at least a X070 Ti/Super/Ti Super class card to run them reliably...",
      "score": 1,
      "created_utc": 1735864143.0,
      "replies": [
        {
          "id": "m54hi60",
          "author": "ArchusKanzaki",
          "body": "Well, 1440p 27\" OLED existed, and its cheaper than ever. You can get it now at 600$ if you want to.\n\nThis is for those that want 4K for movie viewing or console gaming.",
          "score": 2,
          "created_utc": 1735874383.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m54c0q1",
      "author": "ArchusKanzaki",
      "body": "My friend was looking for 4K 27 inch panel recently, and gave up when it just does not exist yet so he bought LG C2 instead since it was quite cheap back then.\n\nHe just need to wait for few months lol. And just need to wait for end of the year for black friday discount.\n\nAnyway, good for 27\" folks. I'm happier with 32\" so I am pretty happy with my G80SD that I got end of last year. Fits all my checklist for my \"next monitor upgrade\" perfectly. I still think 4K is unnecessary and even 240Hz.... But I just need to live with not maxing it out until like 5 years later lol.",
      "score": 1,
      "created_utc": 1735872403.0,
      "replies": []
    },
    {
      "id": "m54kgpl",
      "author": "runnybumm",
      "body": "At the cost of dsc which prevents you from using any kind of dldsr or dsr resolutions",
      "score": 1,
      "created_utc": 1735875498.0,
      "replies": []
    },
    {
      "id": "m55j6dw",
      "author": "TacoOfGod",
      "body": "Can I get a 240hz TV? OLED, Mini-LED with 5888 dimming zones, I don't care, I just want one in 55 inches and above.",
      "score": 1,
      "created_utc": 1735892435.0,
      "replies": []
    },
    {
      "id": "m56d57f",
      "author": "Kwinza",
      "body": "I currently run two 27'' 1080p 144hz screens.\n\n27'' is the perfect size for me, so the only logical upgrades are to 240hz and to 4k.\n\nSo if these aren't wildly priced, could be very good for yours truely.",
      "score": 1,
      "created_utc": 1735909622.0,
      "replies": []
    },
    {
      "id": "m56oddk",
      "author": "Zou__",
      "body": "It’s crazy 32 inch’s doesn’t feel that bad",
      "score": 1,
      "created_utc": 1735914117.0,
      "replies": []
    },
    {
      "id": "m59v20y",
      "author": "Shonorok",
      "body": "I think they should be 2880p 240hz at 27 inch.\nFor 220 and 110 ppi.\n480hz 1440p would also be better.",
      "score": 1,
      "created_utc": 1735949918.0,
      "replies": []
    },
    {
      "id": "m51e66q",
      "author": "krectus",
      "body": "Ok great. But really just 60hz or 120hz would be great. 27inch 4K OLED just isn’t a thing and all of a sudden we get 240hz version that is probably way too expensive.",
      "score": 2,
      "created_utc": 1735839211.0,
      "replies": [
        {
          "id": "m541nf1",
          "author": "None",
          "body": "[removed]",
          "score": 1,
          "created_utc": 1735868727.0,
          "replies": [
            {
              "id": "m54gur1",
              "author": "ArchusKanzaki",
              "body": "Yes, its updated. LTT have sponsored video for ROG's, and they go for DisplayPort 2.1 UHBR so it can drive 4K240 without DSC. \n\nYou will need the (rumored) 5090 though to do it. Its the GPU now that's the problem lol",
              "score": 2,
              "created_utc": 1735874143.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m50q1wh",
      "author": "MadOrange64",
      "body": "27” is too small for 4K",
      "score": -6,
      "created_utc": 1735831645.0,
      "replies": [
        {
          "id": "m50rcq2",
          "author": "NeverComments",
          "body": "At that size and resolution you’d still need to sit at least two feet from the display to avoid seeing pixels. We’re talking about ~160 PPI here. ",
          "score": 6,
          "created_utc": 1735832080.0,
          "replies": []
        },
        {
          "id": "m51h1wh",
          "author": "lostcartographer",
          "body": "iMac 27 inch 5K displays….. what are you even on about?",
          "score": 3,
          "created_utc": 1735840073.0,
          "replies": [
            {
              "id": "m52lwdi",
              "author": "velociyabster",
              "body": "iMac displays are scaled 2x effectively making things sized as if they were on a 2560p monitor but with 4x the sharpness. It's perfect that way, IMO. Natively running 5k or even 4k on a 27\" monitor, everything is tiny and nearly unreadable.",
              "score": 1,
              "created_utc": 1735852515.0,
              "replies": []
            },
            {
              "id": "m51magd",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1735841605.0,
              "replies": [
                {
                  "id": "m51qvfu",
                  "author": "pripyaat",
                  "body": "I agree. I don't think anything higher than 1440p would look that much better as to justify the performance hit.",
                  "score": 1,
                  "created_utc": 1735842982.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m50vw0f",
          "author": "huyanh995",
          "body": "It's perfect for 4K IMO. Look good on both Mac and Windows. I have 4K 32\" at work and text is blurrier than 27\".",
          "score": 4,
          "created_utc": 1735833547.0,
          "replies": []
        },
        {
          "id": "m54m4qu",
          "author": "papabeard88",
          "body": "Same energy as \"the human eye can only see 60hz\".",
          "score": -1,
          "created_utc": 1735876137.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m52iown",
      "author": "oandakid718",
      "body": "Anyone know who manufactures the panel?",
      "score": 0,
      "created_utc": 1735851565.0,
      "replies": []
    },
    {
      "id": "m52jyc7",
      "author": "mxlun",
      "body": "Can you even see 4k at 27 inches at a normal desk viewing distance?",
      "score": 0,
      "created_utc": 1735851939.0,
      "replies": [
        {
          "id": "m52verb",
          "author": "Argomer",
          "body": "Easily. Way sharper image.",
          "score": 5,
          "created_utc": 1735855306.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m51iqjt",
      "author": "spoonedBowfa",
      "body": "Find me a gpu that can run any modern game on ultra settings with 4k 240hz 🤣",
      "score": -5,
      "created_utc": 1735840570.0,
      "replies": [
        {
          "id": "m51y9tt",
          "author": "kelin1",
          "body": "Conflating two ideas. I don’t think anyone buying this is expecting to hit 4K 240 on all games. To me, this is the do everything option. Small enough for most for comp fps even on a small desk. You can get 240 on 4K in Valorant, CS, etc. for the rest of it, you’re willing to accept not 240 in single player titles. \n\nI’ve got a 32” version, and while I wish I had waited for this, it’s not as much of a draw for me right now. Maybe the rumored LG OLEDS with true RGB end of this year will be a more marked improvement (brighter).",
          "score": 5,
          "created_utc": 1735845375.0,
          "replies": []
        },
        {
          "id": "m55k4bz",
          "author": "TacoOfGod",
          "body": "No one is expecting to run games at 4k ultra at 240hz. We'd all be better served if people stopped acting like every game needs to be ran on ultra, regardless of resolution, when there's not nearly enough of a quality jump across all settings to make it worth dumping them all to the max. Turn some stuff down, be comfortable in not being able to tell the difference between high, very high, and ultra shadows, and enjoy the extra frames.",
          "score": 1,
          "created_utc": 1735893032.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m50r51a",
      "author": "_DragonReborn_",
      "body": "No thanks, I’ll stick with my AW3225QF…",
      "score": -6,
      "created_utc": 1735832008.0,
      "replies": []
    }
  ]
}