{
  "post": {
    "title": "Samsung set to unveil tri-fold phone that transforms into 10-inch tablet | G-shaped tri-fold design opens into a 9.96-inch tablet display",
    "author": "chrisdh79",
    "id": "1ipa4qo",
    "score": 479,
    "created_utc": 1739538324.0,
    "selftext": "",
    "num_comments": 184,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ipa4qo/samsung_set_to_unveil_trifold_phone_that/"
  },
  "comments": [
    {
      "id": "mcrecyx",
      "author": "AmNoSuperSand52",
      "body": "My only concern is the weight. It could be like the weight of a normal IPhone/Galaxy or its going to be twice as much\n\nWhich doesn’t sound like a big deal until you’re wearing anything other than tight pants with a belt holding them up",
      "score": 31,
      "created_utc": 1739553575.0,
      "replies": [
        {
          "id": "mcvlp09",
          "author": "Sakkarashi",
          "body": "It'll probably be about the same as a normal phone similar to the other trifold on the market",
          "score": 13,
          "created_utc": 1739611453.0,
          "replies": [
            {
              "id": "mcxqm4f",
              "author": "AmNoSuperSand52",
              "body": "But what’s a normal phone weight? A Galaxy Fold Z weighs 33% more than an iPhone pro. That’s a hefty gain and that’s just one additional hinge, not two",
              "score": 5,
              "created_utc": 1739642813.0,
              "replies": [
                {
                  "id": "mcxtvj5",
                  "author": "Sakkarashi",
                  "body": "Iphone 16 pro max weighs 227 grams, Huawei mate xt weighs 297. For 3x the screen realistate and a similar footprint when folded, that's not that much more.",
                  "score": 4,
                  "created_utc": 1739643797.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mcy64sa",
          "author": "RoxoRoxo",
          "body": "my samsung fold is noticably heavier than any phone ive had before",
          "score": 2,
          "created_utc": 1739647505.0,
          "replies": []
        },
        {
          "id": "mcyk61r",
          "author": "PrimeTinus",
          "body": "My only concern is the price",
          "score": 1,
          "created_utc": 1739651820.0,
          "replies": [
            {
              "id": "mcymuok",
              "author": "AmNoSuperSand52",
              "body": "Yeah I forgot about the fact that these foldables also cost 50% more",
              "score": 2,
              "created_utc": 1739652645.0,
              "replies": []
            }
          ]
        },
        {
          "id": "md19g03",
          "author": "criticalt3",
          "body": "Regardless it's going to be able to be ruined by a fingernail and cost more than buying a new phone and tablet combined. \n\nI get the appeal but it's impractical even still because of how fragile these foldable displays are.",
          "score": 1,
          "created_utc": 1739687363.0,
          "replies": [
            {
              "id": "n18zgfz",
              "author": "JohnnyTwoLegs",
              "body": "I've been using the Z fold for a few years now. I almost exclusively use the inner fold screen (I'm typing this on it now). As long as your fingernails aren't ridiculously long and pointy, there's no risk. I sometimes put off clipping my nails because I'm lazy like that. My Fold 4 screen is still in perfect condition despite heavy daily use.",
              "score": 1,
              "created_utc": 1751601471.0,
              "replies": [
                {
                  "id": "n19bwff",
                  "author": "criticalt3",
                  "body": "Inner screen cracking from daily use is a known issue with the Z Fold & Flip, and it's been demonstrated that a finger nail can leave permanent damage. If you're lucky enough to have yours hold up all this time I'm happy for you, but it's not a risk the average consumer is going to take, which was my only point. I baby my electronics and I still wouldn't consider getting one due to hinge and wear problems over time that has been observed.",
                  "score": 1,
                  "created_utc": 1751607183.0,
                  "replies": [
                    {
                      "id": "n19izqj",
                      "author": "JohnnyTwoLegs",
                      "body": "Maybe it's a known issue because the average user treats their devices like shit. I've also never broken a phone screen and I can't understand how so many people do. Perhaps the key is just treating the device as if it was fragile and you want to trade it in in near perfect condition when the time comes to upgrade. 🤷‍♂️",
                      "score": 2,
                      "created_utc": 1751610803.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "md81sqm",
          "author": "spudddly",
          "body": "Also while you'll be packing a 10-incher that can fold down into 3 it'll be so girthy it'll be hard to find any pants that can comfortably hold it.",
          "score": 1,
          "created_utc": 1739784617.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcqcjm8",
      "author": "EmeraldFox23",
      "body": "What's with these surface level comments shitting in it, and every reply defending it? It's so weird and unusual",
      "score": 74,
      "created_utc": 1739541896.0,
      "replies": [
        {
          "id": "mcua3v3",
          "author": "unfugu",
          "body": "Tbf most phones released in the past 20 years can't be shat in.",
          "score": 13,
          "created_utc": 1739586969.0,
          "replies": [
            {
              "id": "mcv77bz",
              "author": "sicurri",
              "body": "They can be shat upon though, just not inside of them. Although, knowing the internet, someone will try. \n\nAlso, with Samsungs current level of how thin they've gotten their phones, won't this tri-fold phone still be almost half an inch thick when it's folded up?\n\nAlso, also, if they don't do a team up with Nintendo for a Legend Of Zelda Tri Force phone, missed opportunity...",
              "score": 5,
              "created_utc": 1739602387.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqmpxr1",
          "author": "RhubarbSimilar1683",
          "body": "Dead internet theory ",
          "score": 1,
          "created_utc": 1746406340.0,
          "replies": []
        },
        {
          "id": "mcqggz5",
          "author": "F-Lambda",
          "body": "it's also weird that the post is fully at 0 upvotes. since when did people start hating Samsung so vehemently?\n\nThis whole post is weird...",
          "score": 1,
          "created_utc": 1739543272.0,
          "replies": [
            {
              "id": "mcv3v00",
              "author": "tminus7700",
              "body": "I just hate any phone that folds. Just a weak spot to get failures at.",
              "score": 3,
              "created_utc": 1739600476.0,
              "replies": [
                {
                  "id": "mcyr5v3",
                  "author": "LeLefraud",
                  "body": "I've had mine for 6 years and dropped it about 100 times with no case and it still functions perfectly\n\nThe only thing to avoid is closing the screen if there is something in between",
                  "score": 3,
                  "created_utc": 1739653980.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mcuemwd",
              "author": "Juststandupbro",
              "body": "Since they have one of the worse customer service out of most tech companies which is saying a lot. Good luck trying to get support for any of their products or getting a warranty honored it’s like pulling teeth. We stopped ordering Samsung monitors at work because of it.",
              "score": 5,
              "created_utc": 1739588768.0,
              "replies": []
            },
            {
              "id": "mcr2ykr",
              "author": "Furt_III",
              "body": "I mean I switched from Samsung because their bloatware was overbearing, but that was 10 years ago... Even that is kinda minor for vehement hate.",
              "score": 5,
              "created_utc": 1739550255.0,
              "replies": []
            },
            {
              "id": "mcs16hb",
              "author": "Bloorajah",
              "body": "A lot of redditors are bots these days.",
              "score": 2,
              "created_utc": 1739560267.0,
              "replies": [
                {
                  "id": "mctabva",
                  "author": "fusiondynamics",
                  "body": "A lot are numbskulls these days.",
                  "score": 3,
                  "created_utc": 1739573945.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mcqhu1w",
              "author": "Revenge_of_the_User",
              "body": "I basically just asked \"....why?\" and got downvoted to hell. Somethings up here ....",
              "score": 2,
              "created_utc": 1739543734.0,
              "replies": [
                {
                  "id": "mcsbyti",
                  "author": "Practical-Custard-64",
                  "body": "Welcome to Reddit!",
                  "score": -3,
                  "created_utc": 1739563429.0,
                  "replies": [
                    {
                      "id": "mcwmn6h",
                      "author": "Revenge_of_the_User",
                      "body": "Been here 9 years and every morning its a new shit show",
                      "score": 1,
                      "created_utc": 1739630240.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mcs5czp",
      "author": "helbnd",
      "body": "Can they make a reliable bifold phone yet?\n\nMy wife's Z Flip 3 cracked along the fold every 6 months like clockwork, as did my Z Fold 4 every 11 months.\n\nGot tired of fighting to have them repaired, would never buy another Samsung, let alone one of their folders.",
      "score": 32,
      "created_utc": 1739561487.0,
      "replies": [
        {
          "id": "mctwztz",
          "author": "BadgerDC1",
          "body": "I had an issue with the flip 4 and needed a warranty replacement. The Fold 5 is going strong after 1.5 years and the hinge feels like new.",
          "score": 7,
          "created_utc": 1739581983.0,
          "replies": [
            {
              "id": "mczgst5",
              "author": "Lexxxapr00",
              "body": "My finances fold 4 had to be replaced twice due to screen issues at the fold. He’s had the flip 5 now for awhile and has had no issues. They seemed to have actually fixed the screen issues with the 5, at least with our personal experience.",
              "score": 1,
              "created_utc": 1739662197.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mctz73w",
          "author": "CosmicOwl47",
          "body": "This is why I’m not excited about these yet. The potential is there, but I kept my last iPhone for 6 years and it worked great until the last few months and it felt like the right time to upgrade. Until one of these foldables can last multiple years without screen damage, I’m gonna stick with solid phones.",
          "score": 8,
          "created_utc": 1739582805.0,
          "replies": []
        },
        {
          "id": "mcxn1qa",
          "author": "ILikeCutePuppies",
          "body": "I have had issues with 3/4 but it's too useful.  I just buy it with a warranty.  This one has lasted a year and a half so far. \n\nZ3 cracked along the fold.  Z4 stopped opening all the way (and the didn't appear to be anything along the crack).  Both those lasted over a year.",
          "score": 1,
          "created_utc": 1739641748.0,
          "replies": []
        },
        {
          "id": "mv3t7eo",
          "author": "jaxscorpio80",
          "body": "I've never had a problem with my 6. I've had it for about a year and no lines on the fold or any issues",
          "score": 1,
          "created_utc": 1748626855.0,
          "replies": []
        },
        {
          "id": "mcucyn5",
          "author": "killingtime1",
          "body": "You mean single fold. This is the bifold (2 folds). Title is wrong, it's not 3 folds, it's 2 folds, 3 screen segments. To answer your question sort of. I've had three Z Folds in span of 2 years. Fold 4 was very unreliable. Fold 5 has been great so far",
          "score": 1,
          "created_utc": 1739588104.0,
          "replies": [
            {
              "id": "mcuuhv0",
              "author": "joe_bibidi",
              "body": "Two halves that fold together is called a \"Bifold.\" Google \"bifold wallet\" and \"trifold wallet.\" Bifolds have one fold, two sections. Trifolds have two folds, three sections. Similarly google \"bifold door\" or \"trifold pamphlet.\" The count refers to the number of sections, not the number of folding points.",
              "score": 10,
              "created_utc": 1739595616.0,
              "replies": [
                {
                  "id": "mcv2hxb",
                  "author": "killingtime1",
                  "body": "Fair enough. I guess you didn't invent it but it is kind of confusing to call a single screen folded once bifold (2).",
                  "score": 0,
                  "created_utc": 1739599724.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mcuedzl",
              "author": "helbnd",
              "body": "Ha. I do too.\n\nSomeone else has mentioned their 5 is doing well so far too so fingers crossed.\n\nStill not buying another but not because I didn't love the form factor.",
              "score": 2,
              "created_utc": 1739588669.0,
              "replies": [
                {
                  "id": "mcxnmay",
                  "author": "ILikeCutePuppies",
                  "body": "It's only been out for a year and a half.  Although I must say a good warranty does solve the breaking problem and 4 was better than 3 for me.",
                  "score": 1,
                  "created_utc": 1739641921.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mcw1wmv",
              "author": "Mental_Medium3988",
              "body": "i had the fold 3 and other than it not opening full i never had a problem. my mom had the flip 3 and the only problem she had was when she accidentally dropped it face down onto the edge of the dogs water bowl, and that was after 2 years of use. she had to have the screen replaced on her flip 5 because the crease cracked. my fold 5 has been extremely durable. the screen protector is peeling in the middle so i need to get that fixed otherwise i have zero problems. it still opens fully.",
              "score": 2,
              "created_utc": 1739621506.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mctaamb",
      "author": "HanzoNumbahOneFan",
      "body": "Oh nice, when Huawei's came out I saw the benefits of it over a dual fold. Cause it doesn't add an extra screen, it just utilizes the outside screen with the inner ones. And the form factor when folded is way more useful than a dual fold. Like movies don't really work with the dual fold's aspect ratio, there's still large black bars.\n\nThat being said, this is probably gonna cost like $2200+ considering the fold costs like $1800. I wouldn't even be surprised if it was closer to $2500.",
      "score": 11,
      "created_utc": 1739573934.0,
      "replies": []
    },
    {
      "id": "mcqlkax",
      "author": "wotton",
      "body": "Why stop at tri-fold? I WANT MORE, MORE I SAY!",
      "score": 26,
      "created_utc": 1739544966.0,
      "replies": [
        {
          "id": "mcsgest",
          "author": "Kriztauf",
          "body": "PENTAFOLD! PENTAFOLD!",
          "score": 9,
          "created_utc": 1739564747.0,
          "replies": [
            {
              "id": "md0efv5",
              "author": "Esternaefil",
              "body": "Pentafold Cero Miedo!",
              "score": 1,
              "created_utc": 1739673940.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mcqtrm5",
          "author": "iMightBeWright",
          "body": "Wake me when Samsung can achieve more than **n = 0.96 ln (w/t)** folds.\n\n**Edit:** wrong coefficient. How embarrassing.",
          "score": 5,
          "created_utc": 1739547529.0,
          "replies": [
            {
              "id": "mcrykq6",
              "author": "MaygarRodub",
              "body": "I'm guessing this is a formula for not being able to fold anything more than 8 times?",
              "score": 2,
              "created_utc": 1739559498.0,
              "replies": [
                {
                  "id": "mcrzw1r",
                  "author": "iMightBeWright",
                  "body": "Yeah that's the formula for (**n**) number of folds based on thickness (**t**) & width (**w**), according to some physics professor at W Texas A&M. According to him, standard letter sized paper actually caps out at 7 folds. But if you made the sheet half as thick, you could squeeze in an 8th fold.",
                  "score": 3,
                  "created_utc": 1739559887.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mcvcvq2",
          "author": "iamapizza",
          "body": "Give us origami fortune teller fold.",
          "score": 1,
          "created_utc": 1739605831.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcufrnt",
      "author": "appasgun",
      "body": "But how good is the porn on that thing?",
      "score": 4,
      "created_utc": 1739589221.0,
      "replies": []
    },
    {
      "id": "mcyj8ae",
      "author": "JohnnyDollar123",
      "body": "Gonna charge a thousand per fold",
      "score": 4,
      "created_utc": 1739651527.0,
      "replies": []
    },
    {
      "id": "mcq6ncg",
      "author": "Lyndon_Boner_Johnson",
      "body": "Wow, now it’ll have two giant creases going down the screen instead of one.",
      "score": 26,
      "created_utc": 1739539749.0,
      "replies": [
        {
          "id": "mcq8akp",
          "author": "NervyDeath",
          "body": "The crease is barely visible at a direct viewing angle on the fold 6.",
          "score": 40,
          "created_utc": 1739540367.0,
          "replies": [
            {
              "id": "mcqaqle",
              "author": "UnsorryCanadian",
              "body": "It took 5 iterations for them to not have a crease in the screen?\n\n\nEdit: Why are people downvoting me for having a question. I've never seen a single foldable phone in person and I've only ever seen a review of the Z Fold 1. I didn't even know they made a 3rd one. Let alone a *fourth and fifth* iteration",
              "score": -52,
              "created_utc": 1739541250.0,
              "replies": [
                {
                  "id": "mcqcibs",
                  "author": "Miraclefish",
                  "body": "Yes, because materials science is tricky and creating a screen, hinge and mechanisms that can fold and also 'reverse' the crease exactly enough to cover it up without causing damage or causing it to bend outwards instead of in is, in fact, really difficult to do.",
                  "score": 28,
                  "created_utc": 1739541884.0,
                  "replies": []
                },
                {
                  "id": "mcqmtc9",
                  "author": "Yalkim",
                  "body": "You say you are downvoted for having a question. But some questions are loaded questions. They carry some internal judgement. Are you so stupid that you dont know that? <--- Note that this is just a question too, so dont downvote me.",
                  "score": 20,
                  "created_utc": 1739545373.0,
                  "replies": [
                    {
                      "id": "mcriwa4",
                      "author": "Chemistry11",
                      "body": "Is that a loaded question? I’m just learning this detail now, myself, and my initial thought was, “jeez - it took 5 releases to get it right?!” Lord knows how many prototypes they went through.",
                      "score": -1,
                      "created_utc": 1739554904.0,
                      "replies": [
                        {
                          "id": "mcrqoqj",
                          "author": "Frenzie24",
                          "body": "Android fana are sensitive",
                          "score": -2,
                          "created_utc": 1739557198.0,
                          "replies": [
                            {
                              "id": "mcuo5ot",
                              "author": "Thelongdong11",
                              "body": "IPhone fans can't spell",
                              "score": 1,
                              "created_utc": 1739592702.0,
                              "replies": [
                                {
                                  "id": "mcuogjz",
                                  "author": "Frenzie24",
                                  "body": "Neither can you, but you can thanks android for all the weird autocorrect bullshit lol\n\nPosting from it rn\n\nAndroid is such trash I needs ardent defenders in /r/gadgets apparently",
                                  "score": -2,
                                  "created_utc": 1739592834.0,
                                  "replies": [
                                    {
                                      "id": "mcuoooz",
                                      "author": "Thelongdong11",
                                      "body": "Thank* make sure your iPhone autocorrect is turned on. You need it.",
                                      "score": 1,
                                      "created_utc": 1739592934.0,
                                      "replies": [
                                        {
                                          "id": "mcuqnpx",
                                          "author": "Frenzie24",
                                          "body": "I just told you I'm on android right now.  Reading comprehension is tough.\n\n\nI leave the mistakes android CREATES in its autocorrect on purpose.  The ecosystem is still as shitty as it was in 2012.\n\nFinal edit: I'm not a fan of any OS.  I am a fan of the user.  This is just wild to me that there are people who care about phone OS so much.\n\nHere android fans: I think swipe to type is infinitely better on android than iOS.  I also like that I can remove the manufacturer OS and replace it with something else if it frustrates me enough",
                                          "score": 2,
                                          "created_utc": 1739593823.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mcs2x53",
                      "author": "daretobedifferent33",
                      "body": "We’re talking phones here not politics or religion 😂",
                      "score": -5,
                      "created_utc": 1739560776.0,
                      "replies": [
                        {
                          "id": "mcs7bkd",
                          "author": "Yalkim",
                          "body": "If you are asking why I am having a heated discussion that is not about those two, then you are in for a big surprise. You will find a lot of people that have passions outside hating Trump and religion. I for one, have a deep appreciation for engineering. So when ungrateful couch potatoes complain about their technologies not improving fast enough, I take issue with that.",
                          "score": 0,
                          "created_utc": 1739562065.0,
                          "replies": [
                            {
                              "id": "mcs85uj",
                              "author": "daretobedifferent33",
                              "body": "Oke to each it’s own.. i respect your point of view… but i still find foldable phones redundant 🤭👍",
                              "score": -1,
                              "created_utc": 1739562313.0,
                              "replies": [
                                {
                                  "id": "mcsb82w",
                                  "author": "RobHolding-16",
                                  "body": "I find your entire comment chain redundant.",
                                  "score": 0,
                                  "created_utc": 1739563209.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mcqvd27",
                      "author": "UnsorryCanadian",
                      "body": "I only knew about the first 2 Z Folds and they had bad creasing. Someone could've said \"They fixed it on the Z Fold 3\" instead of downvoting me.",
                      "score": -15,
                      "created_utc": 1739548006.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mcqpr3q",
                  "author": "jsdjhndsm",
                  "body": "Even on my fold 3, the crease was quite easily ignored if you faced the screen straight.\n\nThe crease isn't really that bad imo, and they're only getting better. A lot of people hate on them, but I had  a great experiance with mine.\n\nOnly bought it because I managed to get it for £900 total on contract, and it was a great device. \n\nThey're a little too expensive, but so are top end Samsung ultras.",
                  "score": 4,
                  "created_utc": 1739546310.0,
                  "replies": []
                },
                {
                  "id": "mcqb118",
                  "author": "NervyDeath",
                  "body": "No idea, this is my first foldable.",
                  "score": 2,
                  "created_utc": 1739541350.0,
                  "replies": []
                },
                {
                  "id": "mcqffjf",
                  "author": "nekolas564",
                  "body": "Yes, there is still a crease, but it isn't visible when using it from a direct angle.. And that was also the case on my Fold 2",
                  "score": 2,
                  "created_utc": 1739542915.0,
                  "replies": []
                },
                {
                  "id": "mcrqib6",
                  "author": "Frenzie24",
                  "body": "Android fanboys are weird.\n\nI just moved to android from iOS and holy shit it's fucking terrible.  Google maps crashed twice during my road trip to pick up medications this week.  I didn't notice for 20 minutes the first time.\n\nEven flagship android phones feel so plastic and cheap it's like those weird 3rd party controllers that are light as a feather lol",
                  "score": -3,
                  "created_utc": 1739557147.0,
                  "replies": [
                    {
                      "id": "mcrultk",
                      "author": "UnsorryCanadian",
                      "body": "Which phone?\n\n\nI don't use maps very frequently, but some brands are notorious for killing your apps while idle",
                      "score": 1,
                      "created_utc": 1739558343.0,
                      "replies": [
                        {
                          "id": "mcrx3uc",
                          "author": "Frenzie24",
                          "body": "Its a Nokia model I bought for development trying to aim for lowest common denominator.  I don't remember the series.  300 something?\n\n\nPlanning to root and see if it helps",
                          "score": -3,
                          "created_utc": 1739559071.0,
                          "replies": [
                            {
                              "id": "mcsj2me",
                              "author": "youzongliu",
                              "body": "Well that's your own fault for comparing an android phone that costs 5 times less than an iPhone.",
                              "score": 2,
                              "created_utc": 1739565542.0,
                              "replies": [
                                {
                                  "id": "mcsmg0m",
                                  "author": "UnsorryCanadian",
                                  "body": "I didn't even know Nokia still bothered with phones after Windows Phone died",
                                  "score": 0,
                                  "created_utc": 1739566542.0,
                                  "replies": []
                                },
                                {
                                  "id": "mcuo70p",
                                  "author": "Frenzie24",
                                  "body": "My iPhone is 4 years old and runs better than a Nokia that is comparable in price to the lowest spec iPhone available in retail.\n\nWhy are their so many android simps here?  Are y'all paid?",
                                  "score": -1,
                                  "created_utc": 1739592718.0,
                                  "replies": [
                                    {
                                      "id": "mcuu2ur",
                                      "author": "youzongliu",
                                      "body": "I'm an android simp and you're an iPhone simp, same difference.",
                                      "score": 2,
                                      "created_utc": 1739595417.0,
                                      "replies": [
                                        {
                                          "id": "mcuucrn",
                                          "author": "Frenzie24",
                                          "body": "Yeah I'm not.  You're weird lol\n\nIt's an OS, not a sports team lol.  Androids budget devices are so low quality they probably shouldn't be sold.  Since they have trouble running Google suite.\n\nLike I said I'm planning to root and see if it helps.",
                                          "score": -1,
                                          "created_utc": 1739595549.0,
                                          "replies": [
                                            {
                                              "id": "mcv0d6t",
                                              "author": "youzongliu",
                                              "body": "Lol totally, good luck then",
                                              "score": 1,
                                              "created_utc": 1739598580.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mctt8pz",
                              "author": "Krimsonrain",
                              "body": "So you buy a low spec device and complain that it doesn't run well? Tell me more",
                              "score": -1,
                              "created_utc": 1739580614.0,
                              "replies": [
                                {
                                  "id": "mcunzq5",
                                  "author": "Frenzie24",
                                  "body": "You think it's ok to buy a phone in 2025 that can't reliably run Google maps?  This was bought new from best buy in January.\n\n\nWhat's it like only breathing through your mouth",
                                  "score": -1,
                                  "created_utc": 1739592628.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mcqoiip",
                  "author": "Koskani",
                  "body": "I recently got the fold 4 because in poor and i don't notice the crese at all when watching videos or gaming.",
                  "score": -1,
                  "created_utc": 1739545921.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mcrrpko",
              "author": "UnsorryCanadian",
              "body": "They way you worded that made it seem like the 5 had a visible crease and not the 6 and now people are mad at me for interpreting it that way\n\n\nInternet is weird",
              "score": -8,
              "created_utc": 1739557497.0,
              "replies": [
                {
                  "id": "mcrsr8o",
                  "author": "NervyDeath",
                  "body": "I worded it like that because the user I replied to made it seem like it was still an issue on modern foldables",
                  "score": 7,
                  "created_utc": 1739557802.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mcygp8j",
      "author": "ArchonTheta",
      "body": "God I hate these gimmicky phones",
      "score": 4,
      "created_utc": 1739650745.0,
      "replies": [
        {
          "id": "mk1ohja",
          "author": "TerrabyteX3",
          "body": "whats the gimmick ?  is it a 1.5\" lcd on the back of the phone ? a fan to cool the phone off ? hmm what is the gimmick on this one ? I don't see it ?",
          "score": 1,
          "created_utc": 1743096774.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcqpe2t",
      "author": "Bloorajah",
      "body": "Is anyone really that excited for a folding phone? I just kinda… don’t care?",
      "score": 15,
      "created_utc": 1739546196.0,
      "replies": [
        {
          "id": "mcsxcdk",
          "author": "Abigail716",
          "body": "Folding phones are kind of boring but trifolding phones are absolutely a great idea. \n\nA standard folding phone requires two separate screens, the smaller front one for when it's closed and then the larger internal one. Otherwise it requires the back to have a screen that's exposed. When it's open it's not really a good screen ratio for anything either. \n\nIf it's triple folding it means you can use one long screen with the other two folds being tucked inside each other for protection. It also means when it's open the ratio is more akin to a tablet.",
          "score": 4,
          "created_utc": 1739569817.0,
          "replies": []
        },
        {
          "id": "mcrzpgf",
          "author": "Stingray88",
          "body": "Clearly some people are. Personally I’ve never been interested. These phones end up being way too thick for my pocket. But I’m also a weird one that never uses cases either due to the increase in thickness/weight. Love a thin/light phone, never had issues with breaking them in over 15 years of caseless iPhones.",
          "score": 3,
          "created_utc": 1739559832.0,
          "replies": [
            {
              "id": "mcvc9so",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1739605451.0,
              "replies": [
                {
                  "id": "mcve9bf",
                  "author": "Stingray88",
                  "body": "Yes really. When folded they are literally twice the thickness of my phone. That’s a huge lump in my pocket.",
                  "score": 1,
                  "created_utc": 1739606692.0,
                  "replies": [
                    {
                      "id": "mcvl5bk",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1739611106.0,
                      "replies": [
                        {
                          "id": "mcwvv01",
                          "author": "Stingray88",
                          "body": "I looked up the dimensions before writing my original comment. My iPhone 15 Pro is 8mm thick, and even this is thick for an iPhone, previous models have been a little bit thinner.\n\n16mm is way too thick. Literally twice as thick as my phone. I don’t use cases and never have, I hate them.",
                          "score": 1,
                          "created_utc": 1739633351.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mcqq48d",
          "author": "zelman",
          "body": "I like my RAZR 🤷‍♂️",
          "score": 7,
          "created_utc": 1739546422.0,
          "replies": [
            {
              "id": "mcqqppu",
              "author": "Bloorajah",
              "body": "glad you like it, is there really that much of a gain from having the folding screen thing? It’s always just seemed unnecessary to me. \n\nThen again I’m not really wanting for a larger screen so that makes sense",
              "score": -5,
              "created_utc": 1739546605.0,
              "replies": [
                {
                  "id": "mcr60dx",
                  "author": "The__Amorphous",
                  "body": "I honestly don't think I can go back to a slab after using my Fold6 the last few months. I won't necessarily buy another Samsung, but foldables are the way forward for me.",
                  "score": 11,
                  "created_utc": 1739551145.0,
                  "replies": [
                    {
                      "id": "mcrk2dx",
                      "author": "locofspades",
                      "body": "Same here, had the fold4, now have the fold6 and im living that fold life as long as possible.  Theses folds are fantastic",
                      "score": 1,
                      "created_utc": 1739555246.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mctammh",
                  "author": "fusiondynamics",
                  "body": "It's great to be able to fold and pocket it easier.",
                  "score": 2,
                  "created_utc": 1739574045.0,
                  "replies": []
                },
                {
                  "id": "mcre460",
                  "author": "AmNoSuperSand52",
                  "body": "If you’re a woman with tiny pockets then the Flip style foldables is probably a nice thing to have",
                  "score": 2,
                  "created_utc": 1739553504.0,
                  "replies": []
                },
                {
                  "id": "mcqr5u9",
                  "author": "zelman",
                  "body": "I think it’s novel/silly/fun mostly. The best practical aspect is that stuff in my pocket can’t scratch the screen while it’s shut.",
                  "score": 1,
                  "created_utc": 1739546741.0,
                  "replies": [
                    {
                      "id": "mcqwwko",
                      "author": "Bloorajah",
                      "body": "That’s definitely a pro that I wouldn’t have considered. I usually use a screen protector but that’s like 25$ I would to have to spend. Plus replacing them can be a pain",
                      "score": 0,
                      "created_utc": 1739548466.0,
                      "replies": [
                        {
                          "id": "mcrk8jf",
                          "author": "locofspades",
                          "body": "You still have an outer screen, which benefits from a protector",
                          "score": 0,
                          "created_utc": 1739555297.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mcqrj66",
          "author": "mixedpatch85",
          "body": "Love my Pixel Fold 9 Pro",
          "score": 10,
          "created_utc": 1739546854.0,
          "replies": [
            {
              "id": "mcrjyun",
              "author": "worstkindagay",
              "body": "Same! I was a lifelong apple user and switching to the Pixel Fold 9 made me realize Apple products and their ecosystem are so fucking limiting.",
              "score": 2,
              "created_utc": 1739555218.0,
              "replies": [
                {
                  "id": "mcs3sod",
                  "author": "fvck_u_spez",
                  "body": "It's wild that they essentially hinder you from getting the most out of your devices unless you give up anything by any other brand and only buy their overpriced stuff. I'm not going to give up my Linux Workstation or my Windows Gaming machine, and an iPhone won't allow me to read my text messages or automatically sync files to those systems, so an iPhone will never be the right phone for me. No physical limitation, and as Android has proved, these are problems can be solved easily and quite well using 3rd party software. But Apple has to flex and prove that you don't actually own the device that you paid a thousand dollars for.",
                  "score": 0,
                  "created_utc": 1739561032.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mcrjvbn",
          "author": "locofspades",
          "body": "Yup, had the zfold4, now have the fold6.  Everyone i know who has a fold, loves them.  Ill never go back, as long as they are available.",
          "score": 4,
          "created_utc": 1739555189.0,
          "replies": []
        },
        {
          "id": "mcsex6b",
          "author": "youzongliu",
          "body": "I mean it's the same phone but also has the option to be bigger, I don't see a downside here.",
          "score": 2,
          "created_utc": 1739564306.0,
          "replies": []
        },
        {
          "id": "mcsxaxj",
          "author": "malkauns",
          "body": "replying to you on my folding phone. I can't go back to candybar phones.",
          "score": 1,
          "created_utc": 1739569805.0,
          "replies": []
        },
        {
          "id": "mcscyw5",
          "author": "Practical-Custard-64",
          "body": "I've been using foldables since the days of the Samsung Z-Flip 5G (the one that came out before the Z-Flip 3). Currently using a Pixel 9 Pro Fold because I prefer the \"book\" style foldable.\n\nThis kind of tri-fold though, with part of the flexible panel permanently exposed to the elements, just gives me the heebie-jeebies. I can't see it being very durable.",
          "score": 1,
          "created_utc": 1739563727.0,
          "replies": []
        },
        {
          "id": "mctj9z0",
          "author": "redsterXVI",
          "body": "One day, when they can make a trifold that has the same specs as their ultra, without costing two fortunes, yea",
          "score": 1,
          "created_utc": 1739577053.0,
          "replies": []
        },
        {
          "id": "mcv5sr9",
          "author": "damianh",
          "body": "Absolutely love my Fold 5. Wish it was a bit bigger actually. Great for work. Will almost certainly get this.",
          "score": 1,
          "created_utc": 1739601569.0,
          "replies": []
        },
        {
          "id": "mcs8tls",
          "author": "None",
          "body": "I’d love to have a folding phone. I carry an iPad and a phone. This could cut it down to just 1 device",
          "score": 1,
          "created_utc": 1739562507.0,
          "replies": []
        },
        {
          "id": "mcqv8p3",
          "author": "Mbanicek64",
          "body": "I would buy this in a heartbeat if it was like $600. The durability concerns means I can't take that kind of risk.",
          "score": 1,
          "created_utc": 1739547970.0,
          "replies": []
        },
        {
          "id": "mcsu7i2",
          "author": "AccomplishedIgit",
          "body": "I stare at big screens all day I want my phone to be smaller. Not bigger.",
          "score": 1,
          "created_utc": 1739568867.0,
          "replies": []
        },
        {
          "id": "mcs2ki8",
          "author": "daretobedifferent33",
          "body": "For me it’s not practicle since i have my phone in my pocket to warm my balls.. the screensize would be nice but that’s what a tab or pad is for.. so i see no practical use at the moment",
          "score": 0,
          "created_utc": 1739560672.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcztxtu",
      "author": "cecil721",
      "body": "For the low low price of $3000",
      "score": 2,
      "created_utc": 1739666658.0,
      "replies": []
    },
    {
      "id": "mczy1tl",
      "author": "Toke_A_sarus_Rex",
      "body": "Ive had ever gen of the Samsung folding phones, each is better, the last one is amazing and I use it for everything. Especially with DEX as a work laptop replacement. \n\n\nIll sign up for this in a heart beat, I pair it now with a BT ps5 controller to stream xbox and ps5 games and with the current screen its amazing, I could see this being even better with a tri fold.",
      "score": 2,
      "created_utc": 1739668072.0,
      "replies": []
    },
    {
      "id": "mcrd2sh",
      "author": "P_Ston",
      "body": "Check the reviews of the other phones with these and their issues. Samsung is notorious for their batteries being attached to the screens so you replace it all at once, now how about the cost of replacing 10\" of screen and battery?",
      "score": 4,
      "created_utc": 1739553204.0,
      "replies": [
        {
          "id": "mct9o0i",
          "author": "fmaz008",
          "body": "I think for a tri-fold you would need to have the battery(ies) separate from the screen. The 3 \"layers\" are really not that thick.",
          "score": 2,
          "created_utc": 1739573727.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcrkomq",
      "author": "locofspades",
      "body": "Love how many people commemt \"nobody wants this\" when everyone i know with a fold, loves them, myself included.  I absolutely DO want this!",
      "score": 11,
      "created_utc": 1739555427.0,
      "replies": [
        {
          "id": "mctb6c9",
          "author": "trebor88",
          "body": "I dont know anyone with a folding phone IRL. I’ve seen maybe two razr’s in the wild and nobody seems to give them a second look.",
          "score": 7,
          "created_utc": 1739574231.0,
          "replies": []
        },
        {
          "id": "mcvgjfx",
          "author": "-Badger3-",
          "body": "I think the technology is super cool, I just don’t don’t have a use for it.\n\nOn the occasions where I’m doing something on my phone and find myself wishing I had more screen real estate, what I’m actually wanting in that moment is a full computer.",
          "score": 1,
          "created_utc": 1739608129.0,
          "replies": []
        },
        {
          "id": "mcvwsby",
          "author": "NegrosAmigos",
          "body": "I also want this.",
          "score": 1,
          "created_utc": 1739618527.0,
          "replies": []
        },
        {
          "id": "mcsgnd1",
          "author": "dapala1",
          "body": "All the \"nobody wants this\" are getting downvoted, lol. No, sir, *you* don't want this. Plenty of people actually want this and that's why they're making them. \n\nI want one for sure but I'm only gonna get one when they get perfected.",
          "score": 1,
          "created_utc": 1739564819.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcq6jrq",
      "author": "thomas_brock13190",
      "body": "Nope",
      "score": 8,
      "created_utc": 1739539712.0,
      "replies": []
    },
    {
      "id": "mcr3ajc",
      "author": "imakesawdust",
      "body": "Might be alright if you carry a knapsack with you but I would think a tri-fold phone would be uncomfortably thick for a pocket, especially if they figure out how to do a tri-fold bumper case.",
      "score": 3,
      "created_utc": 1739550353.0,
      "replies": [
        {
          "id": "mcri89h",
          "author": "_Rand_",
          "body": "As a folding tablet that is just easier to carry around in a bag than a 10” slab I see the use, but yeah as a phone this seems like it will be WAY too thick.",
          "score": 2,
          "created_utc": 1739554706.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcsjsmx",
      "author": "mr_ji",
      "body": "![gif](giphy|HQRgg6ks7nkyY|downsized)",
      "score": 2,
      "created_utc": 1739565755.0,
      "replies": []
    },
    {
      "id": "mcsroov",
      "author": "yarash",
      "body": "I just want a keyboard",
      "score": 2,
      "created_utc": 1739568109.0,
      "replies": []
    },
    {
      "id": "mcskapu",
      "author": "SoftlySpokenPromises",
      "body": "I don't like having a device that has multiple layers of points of failure, and to double it is concerning.  Good on em if it works well, but I just don't trust foldable phones as a concept to have good longevity.",
      "score": 1,
      "created_utc": 1739565904.0,
      "replies": []
    },
    {
      "id": "mcs8uol",
      "author": "johnjmcmillion",
      "body": "Every day brings us [closer to Westworld](https://www.theverge.com/2018/11/14/18088620/samsung-foldable-phone-science-fiction-movies-television-westworld-star-trek).",
      "score": 1,
      "created_utc": 1739562516.0,
      "replies": []
    },
    {
      "id": "mctyru5",
      "author": "2001zhaozhao",
      "body": "Definitely interesting for web and media consumption but that size might just be bad for productivity as it's too big to type on. The current Fold screen size is perfect for typing with two thumbs, but it can't really get any wider without forcing you to split the keyboard.",
      "score": 1,
      "created_utc": 1739582645.0,
      "replies": []
    },
    {
      "id": "mcutgc8",
      "author": "Sdn61387",
      "body": "Cool and all but can't be too excited about it. It'll take them 4 or 5 iterations to work out glaring issues involving the screen, and it will probably also cost like 2000-2500 dollars. By the time they perfect it the pentafold will be announced, which unfolds into a tablet which unfolds into a 55 inch tv.",
      "score": 1,
      "created_utc": 1739595117.0,
      "replies": []
    },
    {
      "id": "mcvqxct",
      "author": "Orangesteel",
      "body": "This might lure me from apple. It’s an awesome idea",
      "score": 1,
      "created_utc": 1739614833.0,
      "replies": []
    },
    {
      "id": "mcw1i4e",
      "author": "Mental_Medium3988",
      "body": "ok. cool. can we get some innovation on the folds that exists already. youve released the same phone with slightly better hinges for 3 years now. better cameras, better battery, something.",
      "score": 1,
      "created_utc": 1739621289.0,
      "replies": []
    },
    {
      "id": "mcy4iiu",
      "author": "NickMalo",
      "body": "Is it innovative or just more of the same but bigger? Phones are boring anymore.",
      "score": 1,
      "created_utc": 1739647009.0,
      "replies": []
    },
    {
      "id": "md1a3zs",
      "author": "ECore",
      "body": "Why",
      "score": 1,
      "created_utc": 1739687733.0,
      "replies": []
    },
    {
      "id": "md4p7nu",
      "author": "Neo_Techni",
      "body": "*bifold. There are two folds. We didn't call single-fold devices \"bifolding\".",
      "score": 1,
      "created_utc": 1739737181.0,
      "replies": []
    },
    {
      "id": "md9188r",
      "author": "Zeov",
      "body": "Explain tri-fold to me OP",
      "score": 1,
      "created_utc": 1739802015.0,
      "replies": []
    },
    {
      "id": "mem4b1q",
      "author": "pjn768",
      "body": "Cool...I guess. Not a fan of the folding phones, but I'm sure this is exciting for those who like them.",
      "score": 1,
      "created_utc": 1740441997.0,
      "replies": []
    },
    {
      "id": "mv4w4m9",
      "author": "aaronmcnips",
      "body": "Mythbusters says they cant fold more than 7 times. Can they do it?",
      "score": 1,
      "created_utc": 1748638216.0,
      "replies": []
    },
    {
      "id": "n6a5qsi",
      "author": "Existing-Molasses-45",
      "body": "not yet",
      "score": 1,
      "created_utc": 1754015770.0,
      "replies": []
    },
    {
      "id": "mcqcb1y",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1739541811.0,
      "replies": [
        {
          "id": "mcqhlkb",
          "author": "None",
          "body": "[deleted]",
          "score": 13,
          "created_utc": 1739543655.0,
          "replies": [
            {
              "id": "mcsfx2e",
              "author": "dapala1",
              "body": "Blackberry and Nokia did smartphones first.",
              "score": 3,
              "created_utc": 1739564601.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mcqcu8y",
          "author": "UnsorryCanadian",
          "body": "Sony did too\n\n\nAnd according to wikipedia, a lot of companies",
          "score": 6,
          "created_utc": 1739542003.0,
          "replies": []
        },
        {
          "id": "mcrgrdx",
          "author": "samtherat6",
          "body": "Huawei only has one screen, and folded up, the outside screen is exposed. Based on the article, this will have a secondary normal screen only on the outside. But if you get a little bit of dust on the third part, I feel like it risks scratching the screen on the first part.",
          "score": 2,
          "created_utc": 1739554273.0,
          "replies": []
        },
        {
          "id": "mcr3to8",
          "author": "KappaKintama",
          "body": "Yeah but Huawei is shit loaded with spyware",
          "score": 6,
          "created_utc": 1739550508.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mct548l",
      "author": "R1talynn",
      "body": "Who cares about folding shit. Still has creases.",
      "score": 1,
      "created_utc": 1739572244.0,
      "replies": []
    },
    {
      "id": "mcskt9e",
      "author": "sanesociopath",
      "body": "Do people like these folding screens? And enough to now fold out into 3?\n\nAm I now such a boomer I just can't get past thinking about how easily it can break or wear and tear into not working well?",
      "score": 1,
      "created_utc": 1739566059.0,
      "replies": []
    },
    {
      "id": "mcsnto9",
      "author": "nihilishim",
      "body": "Well, i know what I'm not wasting my money on.",
      "score": 1,
      "created_utc": 1739566954.0,
      "replies": []
    },
    {
      "id": "mcuxfkf",
      "author": "ztate",
      "body": "[https://theonion.com/fuck-everything-were-doing-five-blades-1819584036/](https://theonion.com/fuck-everything-were-doing-five-blades-1819584036/)",
      "score": 1,
      "created_utc": 1739597059.0,
      "replies": [
        {
          "id": "mcw8rdj",
          "author": "Way2trivial",
          "body": "r/nottheonion \n\nhttps://gillette.com/en-us/products/gillette-labs/heated-razor-by-gillette",
          "score": 3,
          "created_utc": 1739624854.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcrpwjp",
      "author": "Frenzie24",
      "body": "Did they fix the weird creases yet?  Till then I don't see how anyone buys these and enjoys it more than an hour.",
      "score": -1,
      "created_utc": 1739556967.0,
      "replies": [
        {
          "id": "mcv65b2",
          "author": "damianh",
          "body": "One doesn't notice the crease when looking at the screen straight on.",
          "score": -1,
          "created_utc": 1739601768.0,
          "replies": [
            {
              "id": "mcvwskq",
              "author": "None",
              "body": "So, only when you're looking at your phone *in every other direction*.",
              "score": 1,
              "created_utc": 1739618531.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mcq9brf",
      "author": "None",
      "body": "[deleted]",
      "score": -5,
      "created_utc": 1739540742.0,
      "replies": [
        {
          "id": "mcqc1vi",
          "author": "juh4z",
          "body": ">Who is this phone for? What will it do better that other devices cant? Im not seeing it.\n\nIt's a tablet and a phone in one. That's it. If that doesn't sound useful to you that's fine but it definitely is very useful to some people, hell I don't see the point of the z fold cause even open the screen isn't that much bigger, but this is something I might consider instead of buying both a s ultra and a tab s",
          "score": 9,
          "created_utc": 1739541719.0,
          "replies": [
            {
              "id": "mcqdhl9",
              "author": "None",
              "body": "[deleted]",
              "score": -1,
              "created_utc": 1739542235.0,
              "replies": [
                {
                  "id": "mcqg8f1",
                  "author": "PikaV2002",
                  "body": "… tablets and phones have different use cases because of the size. \n\nNo one is using sheets or excel on a phone.",
                  "score": 4,
                  "created_utc": 1739543191.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mcqooij",
      "author": "dswpro",
      "body": "I'm thinking it's as thick as a brick when folded?",
      "score": 0,
      "created_utc": 1739545973.0,
      "replies": []
    },
    {
      "id": "mcu7tsp",
      "author": "saifland",
      "body": "So it folds from a phone to a desktop ?",
      "score": 0,
      "created_utc": 1739586083.0,
      "replies": []
    },
    {
      "id": "mcu8j45",
      "author": "IolausTelcontar",
      "body": "Until we get to the devices from Earth:Final Conflict I’m not interested.",
      "score": 0,
      "created_utc": 1739586357.0,
      "replies": []
    },
    {
      "id": "mcucv4r",
      "author": "DatElNino",
      "body": "I have used a galaxy fold, ones plus open and now a razr+ I enjoyed the razr+ the most.  It fits my needs and it can be a fun little phone.  However, I do see the appeal of the bi or tri folds.  Unfortunately, I am a bit old school and prefer using my larger tablet.",
      "score": 0,
      "created_utc": 1739588065.0,
      "replies": []
    },
    {
      "id": "mcukusd",
      "author": "Cloud_Fortress",
      "body": "No",
      "score": 0,
      "created_utc": 1739591282.0,
      "replies": []
    },
    {
      "id": "mcutct1",
      "author": "Underwater_Karma",
      "body": "I assume it's.. what, about 3\" thick when folded?",
      "score": 0,
      "created_utc": 1739595070.0,
      "replies": []
    },
    {
      "id": "mcuy6uc",
      "author": "Trajan_pt",
      "body": "Wow, so much gimmick",
      "score": 0,
      "created_utc": 1739597445.0,
      "replies": []
    },
    {
      "id": "mcuyhxc",
      "author": "Groundbreaking_Pea_3",
      "body": "Can't wait for a phone that's a cube that won't fit in anybodies pocket or purse because its too damn thick but unfolds into a 36 inch TV",
      "score": 0,
      "created_utc": 1739597605.0,
      "replies": []
    },
    {
      "id": "mcvpndh",
      "author": "santz007",
      "body": "But it will STILL have shutter lag and  blurry photos",
      "score": 0,
      "created_utc": 1739614011.0,
      "replies": []
    },
    {
      "id": "mcra9o4",
      "author": "FUThead2016",
      "body": "No One: We need folding phones \n\nSamsung: Here is our seventh generation of folding phones",
      "score": -12,
      "created_utc": 1739552379.0,
      "replies": [
        {
          "id": "mcrvwxw",
          "author": "Jefftheflyingguy",
          "body": "I really want a phone that unfolds into a tablet, unfortunately I’m on iOS so i guess I’ll be awaiting a while..",
          "score": 1,
          "created_utc": 1739558724.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcq3oh0",
      "author": "JustScubaMac73",
      "body": "Nobody wants this product… just stop it already.",
      "score": -43,
      "created_utc": 1739538590.0,
      "replies": [
        {
          "id": "mcq5ndt",
          "author": "MadOrange64",
          "body": "I want it but it all depends on the price.",
          "score": 21,
          "created_utc": 1739539370.0,
          "replies": [
            {
              "id": "mcqjd89",
              "author": "DidItForButter",
              "body": "$2500, or after a trade in with your preferred carrier on promotion, 24 monthly payments of $114",
              "score": 1,
              "created_utc": 1739544245.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mcq968o",
          "author": "majorziggytom",
          "body": "I want this product. Finally some innovation again in the stale smartphone market...",
          "score": 10,
          "created_utc": 1739540687.0,
          "replies": [
            {
              "id": "mcqe1ga",
              "author": "UnsorryCanadian",
              "body": "Innovation? The concept is 19 years old. Polymer Vision Readius, 2006. Then the Kyocera Echo in 2011.\n\n\n\nWe're just recycling old concepts again.\n\n\nEdit: *Now people are upset I'm right.* Foldables aren't new at all, we've been trying for almost 20 years. It just took that long to get it right",
              "score": -13,
              "created_utc": 1739542429.0,
              "replies": [
                {
                  "id": "mcqp5f8",
                  "author": "majorziggytom",
                  "body": "😂",
                  "score": 3,
                  "created_utc": 1739546121.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mcsjrcf",
          "author": "terribilus",
          "body": "You're not the Lorax and we aren't trees",
          "score": 2,
          "created_utc": 1739565744.0,
          "replies": []
        },
        {
          "id": "mcqaal4",
          "author": "NuPNua",
          "body": "I actually want a phone like this more than the current size of foldables.",
          "score": 2,
          "created_utc": 1739541091.0,
          "replies": []
        },
        {
          "id": "mcqgpk3",
          "author": "WolfieVonD",
          "body": "I want it, but after a generation or two lol",
          "score": 4,
          "created_utc": 1739543352.0,
          "replies": []
        },
        {
          "id": "mcq4rlh",
          "author": "Nobanob",
          "body": "They are so ugly. I know a few people with flip phones and the screen protectors always make the phone look so shitty.",
          "score": -24,
          "created_utc": 1739539026.0,
          "replies": [
            {
              "id": "mcqahsl",
              "author": "NuPNua",
              "body": "As if most people don't ruin every phones looks with cases and screen protectors anyway.",
              "score": 2,
              "created_utc": 1739541163.0,
              "replies": [
                {
                  "id": "mcqmkyt",
                  "author": "Nobanob",
                  "body": "Buy a quality screen protector and case and your phone looks great for years. \n\nI sold cell phones for 15 years, it's truly not difficult to keep your phone looking good. Get a durable case, and not one of those shit glass screens and you'll be fine. I use ghost armor, but an equivalent applied with an alcohol spray screen protector will last a long time without ever looking bad.",
                  "score": 0,
                  "created_utc": 1739545297.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mcqctsn",
      "author": "GODLAND",
      "body": "![gif](giphy|12P6AnN6DcQj1S|downsized)",
      "score": -18,
      "created_utc": 1739541999.0,
      "replies": []
    },
    {
      "id": "mcv4cdp",
      "author": "Plasticjesus504",
      "body": "Like I am good. I will just have this IPhone 13 as long as I can lol. I want a dumber phone not a more complicated one.",
      "score": -3,
      "created_utc": 1739600744.0,
      "replies": []
    }
  ]
}