{
  "post": {
    "title": "Four years after its launch, US sales of Xbox Series X/S are trailing behind those of its predecessor, Xbox One, at the same point in the consoles' life time. Sales of PlayStation 5, however, are now firmly outpacing PlayStation 4.",
    "author": "a_Ninja_b0y",
    "id": "1i9v5s5",
    "score": 389,
    "created_utc": 1737834160.0,
    "selftext": "",
    "num_comments": 295,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i9v5s5/four_years_after_its_launch_us_sales_of_xbox/"
  },
  "comments": [
    {
      "id": "m98vng8",
      "author": "tanbug",
      "body": "MS said themselves that they lost the most important gen, the previous, because online accounts make people bound to either company in practice. People won't shelf their PS4 games/data and start over on a series X.",
      "score": 191,
      "created_utc": 1737887402.0,
      "replies": [
        {
          "id": "m99l13m",
          "author": "cntmpltvno",
          "body": "I’m one of these people. The PS4 got me at a time when I didn’t currently have a game system. I got the PS4 because I had a buddy who had AC Black Flag, and I was dying to play it through. Fast forward a few years, and I was once again without a console. I tried going back to Xbox (because that’s what I grew up on) and just couldn’t fall back in love with it. My friends, games, everything were all on PlayStation. So I sold my Xbox Series X three weeks after buying it and bought my PS5 the same day.\n\nHonestly when I bought the Xbox it seemed like a massive downgrade from even the PS4. Mostly shooters, while games like the Last of Us, Metro, Horizon Zero Dawn, etc were all PlayStation exclusives. Sony’s got me lock, stock, and barrel.",
          "score": 57,
          "created_utc": 1737900045.0,
          "replies": [
            {
              "id": "m9aexve",
              "author": "ye_olde_green_eyes",
              "body": "Metro's on Xbox, but yeah.",
              "score": 6,
              "created_utc": 1737909552.0,
              "replies": []
            },
            {
              "id": "m9d2san",
              "author": "skrimpbizkit",
              "body": "I went the other way. Grabbed a Ps5 and played it at launch, but with news of Starfield and Call of Duty being a part of Game Pass, I decided to get a Series X.\n\n\nFast forward a year and I haven't turned my PS5 on since. What I get I get with Xbox is simplicity. I can play some of the simpler Game Pass games on my old laptop, or cloud stream newer ones on my phone. Ultimate is under $10 a month if you don't buy directly from Microsoft and and the catalogue rotates enough to have me checking back for new things. \n\n\nMicrosoft got me with their subscription model because it just works better for my lifestyle. I don't really have time to deep dive into game reviews to buy the latest and greatest for $70. The last real Playstation game I bought at release was Final Fantasy XVI, and it left such a bitter taste in my mouth. ",
              "score": 4,
              "created_utc": 1737936526.0,
              "replies": [
                {
                  "id": "m9ee6yk",
                  "author": "Pop_quiz_hotshot",
                  "body": "Where are you getting ultimate for less than $10/month?",
                  "score": 1,
                  "created_utc": 1737951505.0,
                  "replies": [
                    {
                      "id": "m9f3yt1",
                      "author": "skrimpbizkit",
                      "body": "I probably can't link here, but cdkeys. I've used it for about a year, but definitely do your own research on the topic. ",
                      "score": 1,
                      "created_utc": 1737964434.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m9d30of",
                  "author": "cntmpltvno",
                  "body": "I won’t lie, Starfield was awesome. It’s one of the things I played while I had it",
                  "score": 0,
                  "created_utc": 1737936594.0,
                  "replies": [
                    {
                      "id": "m9e0iy6",
                      "author": "Wolventec",
                      "body": "well phil recently said [starfield isnt going to stay exclusive](https://xcancel.com/DestinLegarie/status/1883243143342231655) so its probably coming to ps5 soon",
                      "score": 3,
                      "created_utc": 1737946666.0,
                      "replies": []
                    },
                    {
                      "id": "m9d3o8k",
                      "author": "skrimpbizkit",
                      "body": "Agreed, it scratched the Bethesda itch. I kind of figured the launch would be rough, but I had fun on my first playthrough.\n\n\nI'm still confident that in a few years, once all the DLC and patches drop, and the modding community really get going, the game is going to be a classic akin to Elder Scrolls and Fallout games. ",
                      "score": 2,
                      "created_utc": 1737936784.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9f09jl",
              "author": "SolidOshawott",
              "body": "\"Mostly shooters, while [these other shooters] are PlayStation exclusives\"\n\nNot judging, so many games are shooters anyway :)",
              "score": 1,
              "created_utc": 1737962222.0,
              "replies": [
                {
                  "id": "m9iow6x",
                  "author": "cntmpltvno",
                  "body": "Metro is the only one of the titles I named that I would really consider a shooter. It’s all bows and arrows in Zero Dawn, and the Last of Us uses guns yeah, but when I say shooter I’m thinking more like COD, Halo, Fortnite kind of stuff. Assault weapons and stuff",
                  "score": 1,
                  "created_utc": 1738011330.0,
                  "replies": [
                    {
                      "id": "m9lmgt2",
                      "author": "SolidOshawott",
                      "body": "I know. But you're being a bit reductive either way since Xbox has many first-party games that are not shooters — and PlayStation also has a specific style for their first-party games that I personally find a bit repetitive as well.\n\nUltimately, you want real variety, you're not getting it from those two companies. One big advantage Xbox has is that Game Pass has a better/wider selection of indies than PS+.",
                      "score": 1,
                      "created_utc": 1738048223.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m9a0cty",
          "author": "Gnash_",
          "body": "They lost because they didn’t have strong enough exclusives.",
          "score": 40,
          "created_utc": 1737905261.0,
          "replies": [
            {
              "id": "m9a7jum",
              "author": "burnSMACKER",
              "body": "They lost because of their Xbox One E3 presentation",
              "score": 83,
              "created_utc": 1737907396.0,
              "replies": [
                {
                  "id": "m9aaw77",
                  "author": "RealCrusader",
                  "body": "Or, the xbox was just never massive outside of north America? Why the ps3 with its issues could launch a year later and still sell more? \n\n\nYanks act like there was some big console war. Xbox was never more popular outside of America. \n\n\nMen lie, woman lie, numbers don't. ",
                  "score": 28,
                  "created_utc": 1737908380.0,
                  "replies": [
                    {
                      "id": "m9c6yxo",
                      "author": "Dracogame",
                      "body": "There’s actually a really cool video analyzing that… that I can’t find.\n\nPoint is: Sony did a lot of good things and learned a lot from the initial failure of the PS3, they bounced back really well.\n\nMicrosoft did the opposite, it did some things well at the beginning but managed to fuck it all up later on, and never recovered. \n\nThe Xbox One was pathetic compared to the PS4. Comparable online infrastructure, worst and less exclusives, 100$ more expensive, consistently worse on multi-platform games. ",
                      "score": 13,
                      "created_utc": 1737927390.0,
                      "replies": [
                        {
                          "id": "m9c8qwc",
                          "author": "Abba_Fiskbullar",
                          "body": "Xbox put all of their eggs in the motion control and media player basket. You could feel from their E3 presentation how secondary actually playing games was to being an all in one set top box, and all the sweet, sweet user telemetry they could grab from that using the Kinect's ability to see who was watching what, and when.",
                          "score": 6,
                          "created_utc": 1737927870.0,
                          "replies": [
                            {
                              "id": "m9fd4iw",
                              "author": "luttman23",
                              "body": "And they initially said it was going to require always online access to do anything, including single player games. The backlash from that made them scrap the idea but damage had been done.",
                              "score": 2,
                              "created_utc": 1737970180.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m9bxtpn",
                      "author": "bran_the_man93",
                      "body": "I don't think we're thinking about overseas when talking about this \"console war\" - it always been a domestic discussion",
                      "score": 4,
                      "created_utc": 1737924946.0,
                      "replies": []
                    },
                    {
                      "id": "m9cnd2r",
                      "author": "DigitalSchism96",
                      "body": "And? The fact the 360 sold only a few million less than the PS3 shows it was a very real competitor in the US market.\n\nAs you said, it never had popularity elsewhere. But it didn't need it. It was doing better in the domestic market which was their main focus. \n\nThey lost that market with the Xbox One and never recovered. The console war was very real for the 10s of millions of US gamers.",
                      "score": 2,
                      "created_utc": 1737931968.0,
                      "replies": [
                        {
                          "id": "m9cuia9",
                          "author": "RealCrusader",
                          "body": "The US isn't the world. And not where people focus. Why xbox has never won a generation. ",
                          "score": 2,
                          "created_utc": 1737934041.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m9abt98",
                      "author": "Dank-Drebin",
                      "body": "PS3 was able to catch up because of the RRoD, and even then, it was by a nose.",
                      "score": -11,
                      "created_utc": 1737908647.0,
                      "replies": [
                        {
                          "id": "m9ad6t7",
                          "author": "RealCrusader",
                          "body": "It was millions with a year later launch. The only time Xbox ever got close but it's never been a race. Xbox always loses especially outside of north America. \n\n\nSource. I don't live in America anymore (thank fuck)",
                          "score": 1,
                          "created_utc": 1737909047.0,
                          "replies": [
                            {
                              "id": "m9alibm",
                              "author": "Dank-Drebin",
                              "body": "The Xbox didn't \"get close.\" The 360 was ahead for most of the console life cycle. There were webcomics about the low sales of the PS3. There were memes on Digg and Fark. \n\n\nIt wasn't until the slim release (after they removed PS2 backwards-compatibility and lowered the price) that they started to make up the difference. \n\n\nI owned a PS3, and I own a PS5, btw, in case you think I'm arguing because of bias.",
                              "score": 7,
                              "created_utc": 1737911439.0,
                              "replies": []
                            },
                            {
                              "id": "m9asrz3",
                              "author": "sometipsygnostalgic",
                              "body": "it's not millions. it's one million lol\n\nps3 had a much better end of life cycle than xbox, what with Last of Us coming out so late. it was also a more popular console in japan, like you say, and the japanese are power gamers so it made a difference.",
                              "score": 1,
                              "created_utc": 1737913510.0,
                              "replies": [
                                {
                                  "id": "m9avntv",
                                  "author": "latunza",
                                  "body": "Thats because MSFT practically gave up around 2010 - 2011. I remember they shot their load with the last Halo game and around 2012 came out with Gears Judgement. That was it.\n\nMeanwhile, Sony kept pumping out game after game even if they weren't the highest of quality to the point that between 2011-2012 it seemed like an exclusive, via 1st or 2nd party, was coming out every other week. Games like God of War Ascension, Sly Cooper, Killzone 3, The last of Us, Journey, Ni No Kuni, Motorsport Apocalypse, etc. and I could keep going. There was a game for every type of gamer.\n\non top of that, PSN was free and because of their data breach fiasco they were giving away real games or if you signed up for PS+ you were getting better games then gold. I remember getting BioShock Infinite on PS+ a couple of months after it released.\n\nThe PS3 launched a year later that Xbox and Wii, struggled between '06-'09 but by the end of '09 with the slim PS3, games like uncharted 2, and a more friendly advertising campaign, that thing gave a MSFT a wallop in one of the most ball drop moves I've ever seen a company do. It might just be 2 million sales difference in the end, but had Sony launched a year later then it would've probably been the winner by even larger margins.\n\nThe install base on the 360 was dominant and they just rested on their laurels like if gamers didn't get bored, shifted priorities to the Xbox one with almost minor reasons for us to upgrade.",
                                  "score": 2,
                                  "created_utc": 1737914317.0,
                                  "replies": [
                                    {
                                      "id": "m9ay2te",
                                      "author": "RealCrusader",
                                      "body": "A whole lot of words to say xbox has never won a generation ",
                                      "score": 5,
                                      "created_utc": 1737914997.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "m9aycw3",
                                  "author": "RealCrusader",
                                  "body": "So what you're saying is despite a year headstart xbox best couldn't outsell sonys worst?",
                                  "score": 2,
                                  "created_utc": 1737915075.0,
                                  "replies": [
                                    {
                                      "id": "m9bru1z",
                                      "author": "sometipsygnostalgic",
                                      "body": "Sure",
                                      "score": 0,
                                      "created_utc": 1737923311.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m9alyk2",
                      "author": "notred369",
                      "body": ">Or, the xbox was just never massive outside of north America? Why the ps3 with its issues could launch a year later and still sell more? \n\nthe cost of releasing a full year early really bit them on the ass though. even after that, the later years of the 360 was just full of slop.\n\nall of this unfortunately culminating during the housing recession was the one-two punch",
                      "score": -5,
                      "created_utc": 1737911566.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9bwu7k",
              "author": "SUPREMACY_SAD_AI",
              "body": "advocating for platform exclusivity is cringe",
              "score": 1,
              "created_utc": 1737924675.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9a2545",
          "author": "zefiax",
          "body": "This is a bs excuse. The Nintendo also has the WiiU launched at that time and recovered. The reason they lost is because they did not have good enough exclusives and they continued to not have them. And by the time they got them, their execs had already given up and gone multiplatform.",
          "score": 10,
          "created_utc": 1737905799.0,
          "replies": [
            {
              "id": "m9atdoa",
              "author": "sometipsygnostalgic",
              "body": "nintendo did not recover until they made the nintendo switch, which did a much better job captivating players than the xbox one s/x or the series s/x.\n\nin some ways it's not comparable because people simply don't choose to get games on switch instead of console. they get the switch for switch exclusives, or former pc exclusive indie games, and then they use their console for everything else. there is a symbiotic relationship rather than people choosing switch over the other two, which is why  ps4/ps5 sales can be so high when the switch sales are this high. whereas ps5 and xbox eat into each other's sales.",
              "score": 14,
              "created_utc": 1737913679.0,
              "replies": [
                {
                  "id": "m9b57f8",
                  "author": "i_need_a_moment",
                  "body": "Nintendo has no, or at least didn’t have any before 2020, competition. People don’t realize this has actual ramifications in that they can more easily bounce back.",
                  "score": 2,
                  "created_utc": 1737916968.0,
                  "replies": [
                    {
                      "id": "m9bs1h4",
                      "author": "sometipsygnostalgic",
                      "body": "thats right, their only competition is themselves. thats why they had to get rid of the 3ds after the switch came out",
                      "score": 3,
                      "created_utc": 1737923367.0,
                      "replies": [
                        {
                          "id": "m9cgwqy",
                          "author": "Maktesh",
                          "body": "It's always why they've done a poor job of remastering, porting, and making their games continuously available. \n\nI was born and raised on Nintendo. \n\nThen I was given a 360 and free Xbox Live Gold. The amount of free (or nearly free) digital titles that quickly populated my account was insane. \n\nI still have all of those games available on my Series X, and I still plan to play several of them that I have yet to get to nearly 20 years later. \n\nI enjoy my Switch. But the fact that I can't boot up old titles of yesteryear is a major strike.",
                          "score": 2,
                          "created_utc": 1737930164.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9a5y71",
              "author": "GoldenRamoth",
              "body": "Nintendo is a bit different \n\nIt's the family and kids console. So it has a different market than PS and Microsoft, though they're starting to overlap again as they get more 3rd parties.",
              "score": 6,
              "created_utc": 1737906929.0,
              "replies": [
                {
                  "id": "m9a6dge",
                  "author": "zefiax",
                  "body": "Similar recoveries have happened in the past. PS3 was a disaster at launch, yet they focused on good games and exclusives and ultimately ended up surpassing the 360.\n\nUltimately it's games that sell no matter how much Phil tries to claim otherwise.",
                  "score": 5,
                  "created_utc": 1737907053.0,
                  "replies": [
                    {
                      "id": "m9bqh7n",
                      "author": "i0pj",
                      "body": "What is Phil claiming? My understanding is that Phil always understood this and was quite open about it. That’s the reason why Microsoft went all in on buying gaming studios, it however hasn’t produced the games they want.",
                      "score": 1,
                      "created_utc": 1737922941.0,
                      "replies": [
                        {
                          "id": "m9gbrjw",
                          "author": "zefiax",
                          "body": "Phil has repeated said exclusives don't matter or games don't matter.\n\nhttps://www.thegamer.com/why-did-phil-spencer-say-great-games-wont-shift-xbox-sales-when-they-obviously-would/\n\nhttps://www.kitguru.net/channel/generaltech/damien-cox/xbox-boss-phil-spencer-doesnt-like-exclusives/",
                          "score": 1,
                          "created_utc": 1737986851.0,
                          "replies": [
                            {
                              "id": "m9hs57x",
                              "author": "i0pj",
                              "body": "Welp, that explains a lot then. I honestly thought he had the right intentions with purchasing better studios, but I can’t believe he thinks games won’t win people over.",
                              "score": 1,
                              "created_utc": 1738002157.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m9abrbh",
                      "author": "RealCrusader",
                      "body": "Of course it did. Of the 3 people i knew who had an Xbox they all had to send it back multiple times due to red ringing.  Xbox has never had a chance globally. Did well in north America but nobody really wanted one in proper parts of the world",
                      "score": -3,
                      "created_utc": 1737908631.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m9ashlq",
          "author": "sometipsygnostalgic",
          "body": "ehh, i got an xbox one but did make the swap over to ps4. but i havent been building up my playstation collection at all. ive made a full swap over to PC. it is just way more consumer friendly to go with PC.",
          "score": 2,
          "created_utc": 1737913431.0,
          "replies": []
        },
        {
          "id": "m9cr8ud",
          "author": "Remy0507",
          "body": "They're own model of pushing GamePass also makes it easier to *not* get fully invested in their ecosystem, because you don't own any of it anyway. As soon as you cancel your subscription, it's all gone. It's like cancelling Netflix or Spotify.  If a different service offers something better, there's really nothing holding you back from switching.",
          "score": 3,
          "created_utc": 1737933083.0,
          "replies": []
        },
        {
          "id": "m9fyycn",
          "author": "kizzgizz",
          "body": "Tbh though from now on the way they're building consoles, it wouldn't be a problem alternating which console you pick up, as they're fully embracing backwards compatibility.\n\nI skipped the ps4 but bought a ps5. Any games I missed on the 4 I can now play at a cheaper cost if picking up a 2nd hand disc. I use my series x more as that's where my friends are, but I could easily skip the next xbox and pick up the one after (depending on what the console market looks like then).\n\nOr I could skip the ps6 and get the 7. Same principle.\nBut this gen i ended up getting both, and imo having both gamepass and ps+ has had me covered game wise for the last 8 months",
          "score": 1,
          "created_utc": 1737981983.0,
          "replies": []
        },
        {
          "id": "m9963pr",
          "author": "Appropriate_Status42",
          "body": "https://youtu.be/J_JVVUnCWnY?si=CUo960x9KLxNrKq7\n\nhttps://youtu.be/HXaS80iCLQc?si=gaHkM1svOge8nXDZ\n\n\nhttps://youtu.be/kWSIFh8ICaA?si=wCiytgQw9f6fQSch\n\nppl will never forget who tried to impose strict no game share policy on their system.",
          "score": -4,
          "created_utc": 1737893478.0,
          "replies": []
        },
        {
          "id": "m9b5fjv",
          "author": "None",
          "body": "[deleted]",
          "score": -4,
          "created_utc": 1737917031.0,
          "replies": [
            {
              "id": "m9b9llc",
              "author": "tanbug",
              "body": "So this article is just fake news, or?\n\nhttps://fortune.com/2023/05/05/microsoft-exec-phil-spencer-admits-the-console-war-lost-sony-playstation-nintendo-switch/",
              "score": 2,
              "created_utc": 1737918188.0,
              "replies": [
                {
                  "id": "m9bqc71",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 0,
                  "created_utc": 1737922903.0,
                  "replies": [
                    {
                      "id": "m9csgse",
                      "author": "Remy0507",
                      "body": "You're not getting the point. He didn't say they lost if because of online accounts. He said that it was the *worst generation* to lose, because it was the one where people built their digital libraries and got \"locked in\" to an ecosystem. \n\nHowever I think he's using that as a bit of an excuse, because the Xbox Series X still could have had a good chance. People were optimistic about it before launch. It was their own failures with the current generation itself that lost them this one.",
                      "score": 1,
                      "created_utc": 1737933439.0,
                      "replies": [
                        {
                          "id": "m9cwbie",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 1,
                          "created_utc": 1737934585.0,
                          "replies": [
                            {
                              "id": "m9cwwx1",
                              "author": "Remy0507",
                              "body": "No...you're actually not getting it. He said it was the worst generation *to lose* because of online accounts\n. He did NOT say that they lost it *because* of online accounts.",
                              "score": 1,
                              "created_utc": 1737934765.0,
                              "replies": [
                                {
                                  "id": "m9cx86k",
                                  "author": "None",
                                  "body": "[deleted]",
                                  "score": 1,
                                  "created_utc": 1737934859.0,
                                  "replies": [
                                    {
                                      "id": "m9cyojo",
                                      "author": "Remy0507",
                                      "body": "But the issue your disagreement was based on (saying that Xbox had better online support than PlayStation) shows you didn't actually understand what he meant. And this isn't some Reddit user's random opinion, this was based on what Phil Spencer himself said...\n\n*\"We lost the worst generation to lose in the Xbox One generation, where everybody built their digital library of games.\"*\n\nThat's a direct quote from Phil Spencer. Maybe the person you responded to could have worded it better, but when he said \"online accounts\" he is as talk about the digital libraries that Phil is referring to in that quote.\n\nIt's not about whether they had better online services or not. It's the fact that it was the generation where everyone got fully invested into one online ecosystem or the other.",
                                      "score": 1,
                                      "created_utc": 1737935298.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m99g3ar",
          "author": "coinblock",
          "body": "Which is hilarious because they won the previous generation",
          "score": -16,
          "created_utc": 1737898122.0,
          "replies": [
            {
              "id": "m99l0iu",
              "author": "tanbug",
              "body": "\"Don't you guys want to watch TV and sports?!\"",
              "score": 12,
              "created_utc": 1737900039.0,
              "replies": []
            },
            {
              "id": "m99nnkw",
              "author": "Kwinza",
              "body": "They did not. \n\nThe lifetime sales of the PS3 were over 4 million higher than the Xbox 360  \nThe lifetime sales of the PS4 were over 60 million higher than the Xbox One  \nThe current lifetime sales of the PS5 are 20 million higher than the Xbox x/s",
              "score": 10,
              "created_utc": 1737901014.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m99mqxw",
      "author": "Darkray117",
      "body": "Xbox games will be coming to PlayStation. What’s the point of buying an Xbox?",
      "score": 73,
      "created_utc": 1737900684.0,
      "replies": [
        {
          "id": "m99wbss",
          "author": "pkkthetigerr",
          "body": "Better backwords compatibility. Ps5 doesn't even do 60 fps unlocks for ps4 games.",
          "score": 18,
          "created_utc": 1737904005.0,
          "replies": [
            {
              "id": "m9aj5w8",
              "author": "None",
              "body": "If you care about those things you probably play on pc",
              "score": 57,
              "created_utc": 1737910762.0,
              "replies": [
                {
                  "id": "m9bc1um",
                  "author": "None",
                  "body": "What if I dnt wanna get a pc?",
                  "score": 1,
                  "created_utc": 1737918877.0,
                  "replies": [
                    {
                      "id": "m9bhml1",
                      "author": "None",
                      "body": "Then you either get an Xbox, wait for switch 2, or deal with whatever Sony decides to do",
                      "score": -1,
                      "created_utc": 1737920438.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m9ch5au",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 2,
                  "created_utc": 1737930234.0,
                  "replies": [
                    {
                      "id": "m9dnd4u",
                      "author": "NiteFyre",
                      "body": "Ignoring the fact that you could simply...set up your PC where you intend to use it.\n\nThis is like saying \"yeah i prefer to watch tv in my living room and not on a huge 40 inch screen in a cramped bathroom.\" Like its not on you for cramming a tv in the bathroom....",
                      "score": 5,
                      "created_utc": 1737942693.0,
                      "replies": [
                        {
                          "id": "m9drajx",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 4,
                          "created_utc": 1737943907.0,
                          "replies": [
                            {
                              "id": "m9dssjo",
                              "author": "Nova_Nightmare",
                              "body": "Rog Ally (or similar) with a dock. \"PC Console\"",
                              "score": 4,
                              "created_utc": 1737944332.0,
                              "replies": []
                            },
                            {
                              "id": "m9e1kuz",
                              "author": "NiteFyre",
                              "body": "There are literally devices to stream your games to your TV...and Im not talking awful cloud gaming...you can stream them locally from your PC\n\nYour entire argument when you really boil it down is you just wanna plug and play and graphic fidelity doesnt really matter unless its at the convenient touch of a button.\n\nAnd thats fine.  If you want worse graphics on a console thats been outclassed by PC for years cause you can plug it in and it costs $500 just say so.\n\nSure my PC cost twice as much but I can use it for things other than games and my setup will last longer than the PS5...",
                              "score": 2,
                              "created_utc": 1737946987.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m9c7g0t",
                  "author": "pkkthetigerr",
                  "body": "I have a pc, the gpu broke down and the mobo might be dead so i bought a ps5 as a cheaper option. Expecting my console to run old games in 60 fps in 2020 onwards is pretty standard. Xbox does it with almost 700 games.",
                  "score": 1,
                  "created_utc": 1737927517.0,
                  "replies": [
                    {
                      "id": "m9cw79l",
                      "author": "Remy0507",
                      "body": "Where are you getting that number from? According to this list there are about 130 previous gen games that got boosted to 60 or 120 fps on the Series X.\n\nEdit: I can't post the link because links to the site I found it on (Tech Radar) are banned on this sub. But if you Google it you'll find it. \n\nI'm sure the number of PS4 games that were updated (or had unlocked framerates) for 60fps on PS5 is pretty similar in size.",
                      "score": 8,
                      "created_utc": 1737934549.0,
                      "replies": []
                    },
                    {
                      "id": "m9cuoqp",
                      "author": "None",
                      "body": "[removed]",
                      "score": 1,
                      "created_utc": 1737934094.0,
                      "replies": [
                        {
                          "id": "m9cuou9",
                          "author": "AutoModerator",
                          "body": "Hello, /u/Remy0507! Thanks for contributing. However, your comment has been automatically removed. techradar.com is banned from /r/gadgets due to placement of malicious advertising.\n\n\"Malicious advertisments\" include, but are not limited to:\n\n* Unexpected redirection to other sites, or unexpected opening of additional background tabs\n\n* Ads for scams or malware, such as \"you've won the lottery\" or \"virus detected\".\n\n* Advertisements that run malicious script.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
                          "score": 1,
                          "created_utc": 1737934094.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m9ckz2g",
                      "author": "None",
                      "body": "Then you gotta deal with how Sony runs things.",
                      "score": -1,
                      "created_utc": 1737931325.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9cspiw",
              "author": "Remy0507",
              "body": "I mean a lot of PS4 games do run at 60fps on PS5. And Xbox Series X doesn't automatically run previous gen games at 60fps either, the game has to support it there too.",
              "score": 2,
              "created_utc": 1737933511.0,
              "replies": [
                {
                  "id": "m9nso9v",
                  "author": "pkkthetigerr",
                  "body": "Xbox made devs support it atleast. PS did nothing, ac black flag, arkham knight still running at 30 fps",
                  "score": 0,
                  "created_utc": 1738082385.0,
                  "replies": [
                    {
                      "id": "m9ntasw",
                      "author": "Remy0507",
                      "body": "Arkham Knight runs at 30fps on Series X also...Xbox didn't \"make\" any devs do anything. Why doesn't RDR2 run at 60fps on Series X if that were the case?",
                      "score": 2,
                      "created_utc": 1738082560.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9b2fys",
              "author": "exotener",
              "body": "Cries in Bloodborne 😭",
              "score": 0,
              "created_utc": 1737916201.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9aikqi",
          "author": "kenshinakh",
          "body": "I had the same thoughts but then I realized something. If I have a PC, it'll get Playstation games eventually and I never have to buy the next gen Playstation again because it's already fast enough for next gen. And Xbox functions well as a game pass console or a general console that can share games between my PC and TV...",
          "score": 2,
          "created_utc": 1737910593.0,
          "replies": [
            {
              "id": "m9cwx4z",
              "author": "VoidMageZero",
              "body": "Microsoft did an ad recently where they said basically any gaming device is an “Xbox” which kinda reminded me of Intel’s “I’m a gamer” ad from a decade ago. I think Microsoft is gonna basically rebrand gaming PCs and/or do a deal with Steam to make dockable handheld Steam Deck clones into “Xbox” and then eventually kill the Xbox console itself. That’s why they’re willing to port games to Nintendo Switch 2, the dedicated Xbox console market itself will get squeezed out and Xbox will just become Microsoft’s gaming brand.",
              "score": 1,
              "created_utc": 1737934767.0,
              "replies": [
                {
                  "id": "m9dqt6d",
                  "author": "Peteostro",
                  "body": "They won’t do a “deal with steam” they will probably make their own version of windows optimized for gaming pc’s & hand helds. It will have instant resume and joystick friendly interface. Work with Xbox/PC game pass (games can be installed and played without internet] but also steam client and others can be installed. All of Microsoft exclusive games will be on game pass. 3rd parties will make the hardware but I wouldn’t be surprised is MS made their own hand held to be the “base” system which 3rd parties will build upon.",
                  "score": 1,
                  "created_utc": 1737943771.0,
                  "replies": [
                    {
                      "id": "m9dtokz",
                      "author": "VoidMageZero",
                      "body": "I don't think so because last year Valve seems to have decided against making a full console and just sticking with the Steam library and the Steam Deck. They don't want to compete directly, better for Microsoft, Valve, Nintendo, etc. to work together and grow the overall pie instead of fighting over their pie slices.\n\nIt will be Valve's Steam library + OEM hardware (e.g. Lenovo, Dell, etc.) + AMD/Nvidia GPU + Microsoft facilitating the whole ecosystem and calling it \"Xbox\" to get a cut without having to do much work, just like they are backing OpenAI to do the work in artificial intelligence. They can run Game Pass like you said but competing directly with Steam is a hard and uphill battle for Microsoft.",
                      "score": 1,
                      "created_utc": 1737944596.0,
                      "replies": [
                        {
                          "id": "m9durno",
                          "author": "Peteostro",
                          "body": "That’s why I said Microsoft will do this. Valve will have nothing to do with it. Steam will just work because its windows. Microsoft will make money off the windows licensing and game pass. It’s not hard to see. There are already windows handhelds, MS just need to optimize windows for gaming, and controller UI. I wouldn’t count MS out of the handheld hardware either.",
                          "score": 1,
                          "created_utc": 1737944940.0,
                          "replies": [
                            {
                              "id": "m9dvqrj",
                              "author": "VoidMageZero",
                              "body": "Microsoft can do the custom gaming version of Windows like you said, the deal can simply be to preload the Steam app on the Xbox handheld console. That way Valve's OS and Steam Deck market share is reduced in exchange for using the Steam library, and Microsoft's OS benefits in exchange for the game library:\n\n* Microsoft OS + Valve game library + OEM hardware\n\nOtherwise I don't see why Microsoft would open up their games to porting for Nintendo on the Switch 2. I think Microsoft is moving away from hardware and focusing more on pure software, which is their area of expertise.\n\nSure, Microsoft can do their own hardware too like Google makes the Pixel in the smartphone market, but we're not talking about big money here. It would be like the Surface lineup, kind of a niche product just to stay in the game.",
                              "score": 1,
                              "created_utc": 1737945236.0,
                              "replies": [
                                {
                                  "id": "m9dvxyy",
                                  "author": "Peteostro",
                                  "body": "They 1000000000000000000% will not do a deal with steam. Steam will work because its windows but it will not be installed.",
                                  "score": 1,
                                  "created_utc": 1737945300.0,
                                  "replies": [
                                    {
                                      "id": "m9dwqrl",
                                      "author": "VoidMageZero",
                                      "body": "Alright, we'll see who is right in the next few years. I remember Lenovo invited both Valve and Microsoft for their recent handheld launch. My guess is they're already talking on a possible business deal.",
                                      "score": 0,
                                      "created_utc": 1737945548.0,
                                      "replies": [
                                        {
                                          "id": "m9dy3ez",
                                          "author": "Peteostro",
                                          "body": "Lenovo is already making handhelds with windows on them. They pay for windows. Lenovo is also making a steamOS handheld. Would make sense for both those companies to be there!",
                                          "score": 1,
                                          "created_utc": 1737945973.0,
                                          "replies": [
                                            {
                                              "id": "m9dz1pc",
                                              "author": "VoidMageZero",
                                              "body": "Yeah, and that's redundant. Which customer is going to buy a Windows handheld + Steam handheld + Nintendo handheld ?\n\nIf everyone competes on everything like both Microsoft and Valve both go for handheld console hardware + OS + games library, they're going to be fighting on every segment which is going to fragment the market and hurt profits. If Microsoft focuses on winning the OS and Valve specializes on the library, they both win at the same time without having to compete directly.",
                                              "score": 0,
                                              "created_utc": 1737946253.0,
                                              "replies": [
                                                {
                                                  "id": "m9dz61v",
                                                  "author": "Peteostro",
                                                  "body": "Yeah nope, not going to happen",
                                                  "score": 1,
                                                  "created_utc": 1737946285.0,
                                                  "replies": [
                                                    {
                                                      "id": "m9e08xy",
                                                      "author": "VoidMageZero",
                                                      "body": "Ok cool. It will be interesting to see what happens.",
                                                      "score": 1,
                                                      "created_utc": 1737946583.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m99npi5",
          "author": "MobileVortex",
          "body": "Play anywhere and game resume are features that are better than anything Sony has to offer",
          "score": 11,
          "created_utc": 1737901035.0,
          "replies": [
            {
              "id": "m9agw5l",
              "author": "jwhudexnls",
              "body": "As a guy who's been on the newer Xbox for a while I'm surprised to hear the love for Quick Resume. I mainly play online games and I feel like 50% of the time I end up having to close the game out and restart it anyway.\n\n\nI truly wish there was a way to disable it.",
              "score": 7,
              "created_utc": 1737910111.0,
              "replies": [
                {
                  "id": "m9aosf7",
                  "author": "khan800",
                  "body": "I agree that there should be a way to disable it, but re-connecting to a server when using quick resume is on the developers. Rocket League can do it, others should be able to, as well.",
                  "score": 2,
                  "created_utc": 1737912377.0,
                  "replies": []
                },
                {
                  "id": "m9b4qvh",
                  "author": "MobileVortex",
                  "body": "It's not any faster in most games to have the game closed. For the few that it is. I quit the game before opening it. Currently I only need to do this for Valorant.",
                  "score": 1,
                  "created_utc": 1737916840.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m99ohxq",
              "author": "Darkray117",
              "body": "Play anywhere is streaming, which isn’t 100% lag-free. Quick resume saves you a few seconds when opening a game, it’s not a reason to buy a whole ecosystem.",
              "score": -7,
              "created_utc": 1737901321.0,
              "replies": [
                {
                  "id": "m9a5h80",
                  "author": "6Kaliba9",
                  "body": "Play anywhere isn’t streaming. It means you can buy the game on any Xbox platform (Xbox one, Series X/S and PC) and you can play it on any of those platform without having to pay extra for that platforms version. And that’s great and something Sony charges for extra or sometimes does as a bundle for some select games on PS4 and PS5, not PC",
                  "score": 11,
                  "created_utc": 1737906788.0,
                  "replies": []
                },
                {
                  "id": "m99xe8q",
                  "author": "wingspantt",
                  "body": "Man whenever I play games on non Xbox I'm very upset to remember there's no quick resume",
                  "score": 7,
                  "created_utc": 1737904341.0,
                  "replies": []
                },
                {
                  "id": "m99pqeq",
                  "author": "MobileVortex",
                  "body": "Play anywhere is the ability to play the same save between PC/ Xbox/Cloud seamlessly. I buy every multiplatform on Xbox for this reason. Xbox cloud is streaming.\n\nQuick resume shaves minutes off vs PS5",
                  "score": 11,
                  "created_utc": 1737901763.0,
                  "replies": [
                    {
                      "id": "m99xkk0",
                      "author": "silentcrs",
                      "body": "I don’t know why you’re being downvoted. You’re correct.",
                      "score": 10,
                      "created_utc": 1737904396.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m9a4t9b",
                  "author": "Sagemel",
                  "body": "Most modern games can take several minutes to get you into the game and actually playing, after loading and company logos at the beginning. Being able to click on a game and be playing a couple seconds later is incredible",
                  "score": 2,
                  "created_utc": 1737906590.0,
                  "replies": []
                },
                {
                  "id": "m99xqd5",
                  "author": "silentcrs",
                  "body": "Play anywhere and streaming are separate. It’s confusing, but play anywhere is the ability to sink your saves to multiple platforms.",
                  "score": 2,
                  "created_utc": 1737904448.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9a8j52",
              "author": "Rosta_Roc",
              "body": "Own an XSX, love the idea of Quick Resume, despise it in practice as a mostly online multiplayer gamer, love it for the random single player game I'll end up playing once a year.",
              "score": -3,
              "created_utc": 1737907683.0,
              "replies": [
                {
                  "id": "m9b4f3t",
                  "author": "MobileVortex",
                  "body": "As a multiplayer player I feel like it allows me to actually play single player games. I can just jump on and play for a bit quickly. I skip most dialogue in all games so just being able to jump in and out of a game is great.",
                  "score": 2,
                  "created_utc": 1737916749.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9b9k1z",
          "author": "spaceraingame",
          "body": "Gamepass and basically nothing else.",
          "score": 2,
          "created_utc": 1737918176.0,
          "replies": []
        },
        {
          "id": "m9cdiam",
          "author": "WaffleMints",
          "body": "Because u like it and gamepass?",
          "score": 1,
          "created_utc": 1737929197.0,
          "replies": []
        },
        {
          "id": "m9bj2pq",
          "author": "militantcookie",
          "body": "At the same time what's the point of PlayStation? If most games are available even on other devices like smart TVs, Microsoft makes money and Sony loses money. The long play here is that consoles will be obsolete and the ones with most content will win the race. Sony will eventually be forced to make a service for streaming games to any device. Seems like Microsoft is more forward thinking while Sony is trying to keep the old model alive as long as possible.",
          "score": 0,
          "created_utc": 1737920850.0,
          "replies": [
            {
              "id": "m9cv4or",
              "author": "Remy0507",
              "body": "That's assuming that gamers actually want to move everything to a streaming model. There are a lot of downsides to doing that. You need fast internet, any issues with your connection are going to interfere with your ability to play, input lag is going to be an issue, a lot of gamers aren't going to like the idea that they could lose access to a game at any time, etc.",
              "score": 1,
              "created_utc": 1737934226.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9a1nw2",
      "author": "matteoarts",
      "body": "Terrible ideas from the onset with Xbox One with the always-online, stupid fucking confusing names with One and Series X/S, and then you mismanaged your flagship title of Halo for over 10 years when it was the very game that sold people on Xbox and made you a competitor. Yeah, I can see why Xbox has failed.",
      "score": 33,
      "created_utc": 1737905655.0,
      "replies": [
        {
          "id": "m9bno8k",
          "author": "chostax-",
          "body": "I firmly believe the downfall of halo was the downfall of Xbox as a console. Astonishing how badly they ruined it.",
          "score": 20,
          "created_utc": 1737922164.0,
          "replies": []
        },
        {
          "id": "m9cbxaq",
          "author": "Firebug160",
          "body": "Can you tell the difference between a switch and a wiiu? Everyone loves complaining about exactly 2 gens of non-sequential Xbox names but can name the past 5 generations of Nintendo consoles in order. You’re a whiner. The names are the least consequential non-issue ever, find something of substance to complain about",
          "score": -12,
          "created_utc": 1737928749.0,
          "replies": [
            {
              "id": "m9duqdd",
              "author": "buttchuggs",
              "body": "It killed sales",
              "score": 2,
              "created_utc": 1737944930.0,
              "replies": [
                {
                  "id": "m9duv1k",
                  "author": "Firebug160",
                  "body": "It was a rhetorical question dumbass",
                  "score": -4,
                  "created_utc": 1737944968.0,
                  "replies": [
                    {
                      "id": "m9kh0ph",
                      "author": "buttchuggs",
                      "body": "ur mad",
                      "score": 1,
                      "created_utc": 1738030953.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9g8eap",
              "author": "woutva",
              "body": "I disagree, I think the whole series X and shit makes no sense. As for the wii u, part of its crappy sales was the confusion with the wii in the first place. The name matters.",
              "score": 1,
              "created_utc": 1737985653.0,
              "replies": [
                {
                  "id": "m9g9plh",
                  "author": "Firebug160",
                  "body": "PlayStation has been doing “base model + enhanced model” shit since forever, the exact same as Xbox. If you think it makes no sense then you ought to criticize more than just Xbox.",
                  "score": -2,
                  "created_utc": 1737986122.0,
                  "replies": [
                    {
                      "id": "m9gx9yn",
                      "author": "woutva",
                      "body": "Thats the whole problem, the wii u wasnt an enhanced model, it was the next generation. Parents didnt buy it because they \"already had a Wii\".",
                      "score": 1,
                      "created_utc": 1737993547.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9bcwvz",
      "author": "spaceraingame",
      "body": "Microsoft basically gave up on Xbox having console exclusives. So this was bound to happen.",
      "score": 7,
      "created_utc": 1737919118.0,
      "replies": []
    },
    {
      "id": "m9d68x6",
      "author": "nuclearwinterxxx",
      "body": "We are *STILL* playing the same games as the previous gen.",
      "score": 6,
      "created_utc": 1737937538.0,
      "replies": []
    },
    {
      "id": "m98ess7",
      "author": "FixSwords",
      "body": "I have an Xbox One X. Saw no point whatsoever in the Series S/X. \n\nWithout a new big game like TES6 or GTA6, what’s the new console supposed to offer me? Plus for the first year or so they were all owned by scalpers and the prices were ridiculous. \n\nIf Microsoft want me to buy another console, give me an incentive and make it accessible to me around launch. ",
      "score": 29,
      "created_utc": 1737877173.0,
      "replies": [
        {
          "id": "m99dlpo",
          "author": "hungry4pie",
          "body": "Wait, so Xbox One X is not the same as an Xbox One Series X?",
          "score": 8,
          "created_utc": 1737897091.0,
          "replies": [
            {
              "id": "m99g6s0",
              "author": "coinblock",
              "body": "It’s just “Xbox Series X” and no",
              "score": 33,
              "created_utc": 1737898161.0,
              "replies": [
                {
                  "id": "m9azpsq",
                  "author": "eriverside",
                  "body": "I haven't been in the market for a console since PS3. One thing that never made sense to me was the branding.\n\n X Box - weird name, but ok \n\nX Box 360 - not XB2? Would have saved \"360\" for the 3rd iteration if anything. It's kind of confusing \n\nX Box One - what?... What? I don't get it. \n\nI stopped following after that because I only heard of headlines for the next PS which were sequential, so that made sense. I honestly didn't really know there was more after the One because how the fuck would I tell them apart with such shitty branding.",
                  "score": 6,
                  "created_utc": 1737915450.0,
                  "replies": [
                    {
                      "id": "m9bkzpv",
                      "author": "_PurpleInk",
                      "body": "Imagine launching Xbox 2 alongside Playstation 3. People shopping for a console will just pick the higher number",
                      "score": 5,
                      "created_utc": 1737921395.0,
                      "replies": [
                        {
                          "id": "m9etch9",
                          "author": "FixSwords",
                          "body": "Why did they launch the Xbox One to compete with the PS4, then?",
                          "score": 5,
                          "created_utc": 1737958400.0,
                          "replies": []
                        },
                        {
                          "id": "m9c5tn5",
                          "author": "eriverside",
                          "body": "I'm not sure I believe that. And it certainly better than the uncertainty of their current naming convention (no convention)",
                          "score": 1,
                          "created_utc": 1737927083.0,
                          "replies": [
                            {
                              "id": "m9c6cq5",
                              "author": "_PurpleInk",
                              "body": "100% it would have impacted sales for the average Joe looking for a console, or a parent buying one for their child. Marketing suicide",
                              "score": 2,
                              "created_utc": 1737927226.0,
                              "replies": [
                                {
                                  "id": "m9de3ul",
                                  "author": "eriverside",
                                  "body": "And now? I'm just finding out there's something after One, and I don't know which one it is. At least with PS it's very clear what's out and what's next.",
                                  "score": 1,
                                  "created_utc": 1737939830.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m9flvqw",
                      "author": "hungry4pie",
                      "body": "The original proof of concept used to sell the idea of a gaming console to the Microsoft big wigs was a repurposed/modified dell laptop that they called the DirectX Box. I guess the powers that be thought the concept was a winner, not so much the name.",
                      "score": 1,
                      "created_utc": 1737975494.0,
                      "replies": [
                        {
                          "id": "m9fz8q4",
                          "author": "eriverside",
                          "body": "X Box as a name is fine. Their branding with the green and black did a good job selling it as the \"X\" box. It's the numbering that's just nutty.",
                          "score": 1,
                          "created_utc": 1737982107.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m99thwh",
              "author": "kirsion",
              "body": "The Xbox One X is the mid generation refresh.",
              "score": 9,
              "created_utc": 1737903066.0,
              "replies": []
            },
            {
              "id": "m9awwet",
              "author": "xeenexus",
              "body": "And here is the perfect example of why Xbox is swimming against the current. The Microsoft marketing department needs to be completely fired. There is so much confusion on their branding.",
              "score": 8,
              "created_utc": 1737914667.0,
              "replies": [
                {
                  "id": "m9b3jye",
                  "author": "VanillaSoftArtist",
                  "body": "Microsoft and Nintendo love competing for the stupidest names. New Nintendo 3DS (yes, I get that works in non-English languages, but it's confusing as hell in the biggest market).\n\nSony got it right with numbers.",
                  "score": 3,
                  "created_utc": 1737916510.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m99xbbo",
          "author": "silentcrs",
          "body": "Game Pass. Until it comes to PS, I’m owning an Xbox (and PC).",
          "score": 2,
          "created_utc": 1737904316.0,
          "replies": [
            {
              "id": "m9dd4it",
              "author": "TopdeckIsSkill",
              "body": "I want to play games I like, not looking for the cheapest way to play.\n\nI made gamepass for 2€/month, and I won't do it again. Yes, there are good games, but I can usually buy them on sales. 200€/year at full price is a lot for just renting",
              "score": 3,
              "created_utc": 1737939556.0,
              "replies": [
                {
                  "id": "m9do0s5",
                  "author": "silentcrs",
                  "body": "I’ve not seen anything exclusive appealing on PS5 aside from Astrobot. Every good “exclusive” on PS5 is on also on PC.\n\nI own PS5, Series X, PC and Switch. Series X gets the most playtime - Game Pass and hundreds of titles I bought for 360 and One that are backwards compatible. PC gets the second most playtime. Largest library, Game Pass (again) with Play Anywhere syncing my saves with Xbox, and a handful of PS exclusives. Switch gets 3rd for Nintendo exclusives and when I want to play on the run. PS gets dead last. I used it last year to play Astrobot and that’s about it. If anything, I’m ditching the PS next generation. Simply not enough reason to get one.",
                  "score": -2,
                  "created_utc": 1737942896.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9a3d5l",
              "author": "FixSwords",
              "body": "But I already have that, and I can play games in the cloud on it. So what do I need the Series X for?",
              "score": 3,
              "created_utc": 1737906163.0,
              "replies": [
                {
                  "id": "m9a4f60",
                  "author": "silentcrs",
                  "body": "Better performance. Cloud streaming still has unacceptable latency in some situations.",
                  "score": 2,
                  "created_utc": 1737906473.0,
                  "replies": [
                    {
                      "id": "m9acdvv",
                      "author": "OTrevelin",
                      "body": "Not to mention the wait times sometimes",
                      "score": 2,
                      "created_utc": 1737908815.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m99g4n5",
          "author": "snan101",
          "body": "I cant host Palworld games on my one X 😒🤣",
          "score": 1,
          "created_utc": 1737898137.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9d8cis",
      "author": "Aok_al",
      "body": "There's really no point in buying an Xbox when their games are all available on PC and soon to be available on PlayStation. Starfield before the disappointment settled in was the motivation for me to get a PC and it's kind of a problem for them when their game makes me want to get a PC instead of an Xbox.",
      "score": 3,
      "created_utc": 1737938169.0,
      "replies": []
    },
    {
      "id": "m9833ln",
      "author": "bizarro_kvothe",
      "body": "Not really a PlayStation guy but aren’t people complaining that the PS5 doesn’t have enough games? Why are people rushing to buy it?",
      "score": 39,
      "created_utc": 1737870786.0,
      "replies": [
        {
          "id": "m987zvr",
          "author": "paractib",
          "body": "“I have a ps4, now I want a next gen system, I can either get a ps5 and keep all my friends and games or lose all of that and jump over to Xbox”\n\nLast gen was unfortunately it, there is no coming back from the momentum Sony gained with that. \n\nOlder gens it was easier to switch because online wasn’t really a massive thing and all games were physical.\n\nYou might say Microsoft had momentum with the 360, but by the end of that gen the ps3 was already ahead.",
          "score": 64,
          "created_utc": 1737873296.0,
          "replies": [
            {
              "id": "m993ks5",
              "author": "AgingChris",
              "body": "It still astounds me how much Microsoft fumbled the reveal and previews of the Xbox one.  Forced connect usage, focused on TV shows and that comment by Don Mattrick absolutely crippled the Xbox one and handed that generation to Sony there and then.  \n\nAnd with last gen being arguably the most important console generation to win with how online games had dominated, there was no coming back from it.",
              "score": 30,
              "created_utc": 1737892095.0,
              "replies": [
                {
                  "id": "m99iimg",
                  "author": "VanillaSoftArtist",
                  "body": "To be fair, Nintendo wasn't much better with its Wii U advertising. \"Use the Gamepad as a remote control.\"\n\nNintendo recovered late with the Switch, but Sony was the only competent company when it came to its console advertising in that generation. Let's not forget the whole Xbox One controversy with having to be online all the time to play games.",
                  "score": 17,
                  "created_utc": 1737899079.0,
                  "replies": [
                    {
                      "id": "m9auap8",
                      "author": "sometipsygnostalgic",
                      "body": "Nintendo really benefitted from the TV market with the Wii, that's why the other consoles went so hard with the TV market later, but by 2012-2013 people were moving very quickly to online streaming. Too little too late.",
                      "score": 4,
                      "created_utc": 1737913935.0,
                      "replies": [
                        {
                          "id": "m9b02z8",
                          "author": "VanillaSoftArtist",
                          "body": "Honestly, it seems most consoles that focused on media features as a *major* selling point did poorly.\n\nPS2 didn't, but I don't know if the DVD movie aspect was marketed so heavily by Sony itself. I feel it was more word of mouth, with Sony focusing on benefits of DVD for games (more space).\n\nWith the other ones, it seems when they focused on media stuff, they forgot about other things.\n\nPS3 marketed itself as a media centre. The XMB interface was built around it; the shit has printer support. The hardware justified the price, especially with the built-in PS2, but it clearly failed until the 2009 rebranding.\n\nWii U focused on some TV connection. It failed.\n\nXbox One basically repeated the PS3 fiasco only much worse, as it actively seemed to screw gamers over with things like DRM. It failed.\n\nFor what it's worth, I personally am nostalgic for how the seventh generation placed great emphasis on media functions. I love the PS3 and Xbox 360. But it was something that, like you say, made a touch less sense going into the 2010s.",
                          "score": 3,
                          "created_utc": 1737915551.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m99xyl1",
                      "author": "wingspantt",
                      "body": "Nintendo also has the worst and least backwards compatibility, and the least online features. So it costs users the least to switch in and out of Nintendo's ecosystem.",
                      "score": 5,
                      "created_utc": 1737904520.0,
                      "replies": [
                        {
                          "id": "m9a0qy9",
                          "author": "VanillaSoftArtist",
                          "body": "You mean right now? Because you'd be right, in that it sucks we only get BC through *shoddy* online emulation.\n\nBut during the Wii U period, it was the best of them. You got to play every single Wii game in the native Wii mode. Nintendo's stubborn refusal to move on from PowerPC at least meant the GCN-Wii-Wii U had perfect compatibility. Play GC on Wii U through hacking, and it's excellent.",
                          "score": 5,
                          "created_utc": 1737905380.0,
                          "replies": [
                            {
                              "id": "m9a1qq3",
                              "author": "wingspantt",
                              "body": "Sure but Wii U was a commercial flop and clearly meant to be a 1.5 successor to the Wii regardless.\n\nThe Wii is one of the most successful consoles of all time but due to its controls and the discs, a lot of it's best games can't be played as they were meant to play on any other system. The Switch is so unique even the Switch 2 won't be able to play some of the games that use the Joy Cons in specific ways.\n\nDon't get me started on the DS/3DS.\n\nBut all this isn't just negative. It means the systems also come with no baggage. You don't feel like you're losing your old games when you buy a Nintendo system because you really would have never had them either way.",
                              "score": 2,
                              "created_utc": 1737905679.0,
                              "replies": [
                                {
                                  "id": "m9a499m",
                                  "author": "VanillaSoftArtist",
                                  "body": "I see what you mean. Yeah, Nintendo's sheer control methods make playing some of these games a nightmare if you don't own the original hardware.\n\nLike how with Mario 64 DS, you're forced to use the mouse to properly turn the camera or tip-toe if you're emulating it. Or how you have to emulate so many Wii motion controls that you've run out of sticks.",
                                  "score": 2,
                                  "created_utc": 1737906425.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "md0hpbq",
                      "author": "Puzzleheaded-Car-968",
                      "body": "That's true, but the big difference in that failure was that Nintendo didn't make everyone angry and the public and fans hate them and even feel betrayed by the Nintendo Wii U. Almost everyone who did buy it fondly remembers the experience and the games that came out on it.",
                      "score": 2,
                      "created_utc": 1739675164.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m99kkgo",
                  "author": "cntmpltvno",
                  "body": "Running an emulated version of it for the CES demos didn’t help either. That made a lot of people question if the console was actually going to be up to snuff or not",
                  "score": 1,
                  "created_utc": 1737899869.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m98dogz",
              "author": "Cookie_505",
              "body": "Most games (especially AAA games) have cross play now though",
              "score": 12,
              "created_utc": 1737876513.0,
              "replies": [
                {
                  "id": "m98i33u",
                  "author": "MargielaFella",
                  "body": "Think it's moreso about the libraries people have built being locked to that platform. They find it more convenient to stay in the ecosystem than losing that access.\n\nXbox was actually the smarter of the two in creating this back compatibility from the beginning.\n\nConsidering all that, Xbox One was really an all time fumble. There was no coming back after that.",
                  "score": 20,
                  "created_utc": 1737879124.0,
                  "replies": [
                    {
                      "id": "m98vs65",
                      "author": "thebenson",
                      "body": ">creating this back compatibility from the beginning.\n\nThere wasn't backwards compatibility \"from the beginning.\"\n\nIt launched in 2015 on the Xbox One.",
                      "score": -4,
                      "created_utc": 1737887483.0,
                      "replies": [
                        {
                          "id": "m99ya1v",
                          "author": "wingspantt",
                          "body": "Not true I had multiple original Xbox games I played on 360.",
                          "score": 4,
                          "created_utc": 1737904619.0,
                          "replies": []
                        },
                        {
                          "id": "m99lu81",
                          "author": "acheron53",
                          "body": "Are you sure about that? I remember playing KOTOR for the original XBOX on my XBOX 360. That seems pretty back compatible.",
                          "score": 5,
                          "created_utc": 1737900346.0,
                          "replies": [
                            {
                              "id": "m99t3uv",
                              "author": "thebenson",
                              "body": "You're right. There was limited backwards compatibility going from the Xbox to Xbox 360.\n\nBut, the backwards compatible program that they recently said that they will not be adding anymore games to started with the Xbox One.",
                              "score": 2,
                              "created_utc": 1737902934.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m99b79t",
              "author": "Skelly1660",
              "body": "And because games weren't backwards compatible (at launch) there was no risk in resetting. You lost all your 360/PS3 games either way at that point.",
              "score": 3,
              "created_utc": 1737896012.0,
              "replies": []
            },
            {
              "id": "m98vl95",
              "author": "thebenson",
              "body": ">because online wasn’t really a massive thing\n\nLol, what?\n\nOnline gaming has been massive at least for the last 15 years.",
              "score": 7,
              "created_utc": 1737887364.0,
              "replies": [
                {
                  "id": "m99j0ot",
                  "author": "JMPopaleetus",
                  "body": "If you’re ready to feel old, Halo 2 and WoW came out 20 years ago.",
                  "score": 3,
                  "created_utc": 1737899277.0,
                  "replies": [
                    {
                      "id": "m99s126",
                      "author": "thebenson",
                      "body": "I was talking with respect to consoles.\n\nXbox Live was around on the original Xbox, but imo it didn't take off until the 360 era.",
                      "score": -3,
                      "created_utc": 1737902565.0,
                      "replies": [
                        {
                          "id": "m9agpxi",
                          "author": "JMPopaleetus",
                          "body": "That was why I mentioned Halo 2. \n\nWhich was on the original Xbox.\n\nWhich sustained twenty million XBL games per month for over two years, after a year of being at thirty to thirty-five million. \n\nBut by all means, don’t accept my bittersweet comment made to reinforce your original point.",
                          "score": 5,
                          "created_utc": 1737910062.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9af6p1",
              "author": "Husbandaru",
              "body": "It’s wild to think that Sony is the ONLY game company to ever save a console from complete failure and even make it a success in the end. Even Nintendo has never pulled that off and one failed console destroyed SAGA’s ability to continue them.",
              "score": 2,
              "created_utc": 1737909622.0,
              "replies": []
            },
            {
              "id": "m9c2yac",
              "author": "falconiko",
              "body": "Thats a reason but you have to keep in mind that not everyone had or was here to play on the past gen. There are tons of kids growing up without the friends of past gens, know what I mean? New generation of people. I keep my xbox cause my friends are there and probably will cause don’t have the money to spend on 2 or 3 consoles but if I have to pick between them just for the games then I would definitely go for playstation, despite not liking some of their anti consumer practices lol",
              "score": 1,
              "created_utc": 1737926333.0,
              "replies": []
            },
            {
              "id": "m99pely",
              "author": "MRintheKEYS",
              "body": "Well I’m stuck anyway. Majority of my games library is in the Xbox ecosystem.  I’m not paying for a game twice.",
              "score": 0,
              "created_utc": 1737901647.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m98k7oq",
          "author": "Gatlindragon",
          "body": "Not really, last year alone the PS5 got a lot of good games like Helldivers 2, Stellar Blade, FFVII Rebirth, Rise of the Ronin, Black Myth Wukong, Astrobot or Silent Hill 2.",
          "score": 26,
          "created_utc": 1737880414.0,
          "replies": [
            {
              "id": "m99x2kn",
              "author": "silentcrs",
              "body": "A lot of those are on PC. A way better platform imo.",
              "score": -9,
              "created_utc": 1737904239.0,
              "replies": [
                {
                  "id": "m9a3idl",
                  "author": "demonsta500",
                  "body": "Except it can't be turned on remotely with a controller. I'll switch to PC when that can be done and I can start games without random errors that require me to look through 10 forum posts to find the solution while also needing constant Steam/driver updates.",
                  "score": -10,
                  "created_utc": 1737906206.0,
                  "replies": [
                    {
                      "id": "m9b2wt1",
                      "author": "busted42",
                      "body": "Bringing up PC in an Xbox/PlayStation conversation is kinda dumb and you're often right about it being finicky. But. There are several ways to start games remotely on PC.",
                      "score": 3,
                      "created_utc": 1737916330.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m986ika",
          "author": "shootamcg",
          "body": "It has plenty of games just not plenty of first party games. It’s probably the best place to play games in the living room.",
          "score": 17,
          "created_utc": 1737872531.0,
          "replies": []
        },
        {
          "id": "m989w1n",
          "author": "SomeBoxofSpoons",
          "body": "PlayStation has successfully become the “default” next-gen console. Even compared to Sony’s dry generation Xbox has barely had anything worthwhile exclusive, so for people wanting to play next-gen games there’s basically no reason to get a Series X.",
          "score": 9,
          "created_utc": 1737874341.0,
          "replies": [
            {
              "id": "m98jim1",
              "author": "firedrakes",
              "body": "exclusive dont matter much anymore",
              "score": -18,
              "created_utc": 1737879991.0,
              "replies": [
                {
                  "id": "m98k2j3",
                  "author": "SomeBoxofSpoons",
                  "body": "Well, if there's 2 consoles at the same price point and effectively same power level that play the same third party games, but one has some exclusives that are popular and worth playing while the other barely has any that also aren't considered that good, you get the one that gives you more good games.",
                  "score": 17,
                  "created_utc": 1737880325.0,
                  "replies": [
                    {
                      "id": "m98kkia",
                      "author": "firedrakes",
                      "body": "lol game sales have been poor this gen. so badly ps had to put games on pc",
                      "score": -21,
                      "created_utc": 1737880634.0,
                      "replies": [
                        {
                          "id": "m98lbkx",
                          "author": "SomeBoxofSpoons",
                          "body": "There’s obviously pretty industry-wide issues happening right now, but in the console space you have to be reaching pretty hard to look at the gap between PS5 and Xbox sales (estimates were 5 to 1 for November) and not think that console exclusives matter.\n\nI don’t even have either console, the writing’s just on the wall that Xbox as a hardware brand is on its last legs, and it’s not hard to see why.",
                          "score": 11,
                          "created_utc": 1737881101.0,
                          "replies": [
                            {
                              "id": "m98lyrx",
                              "author": "firedrakes",
                              "body": "do you think exclusives matter?",
                              "score": -20,
                              "created_utc": 1737881492.0,
                              "replies": [
                                {
                                  "id": "m98ooew",
                                  "author": "SomeBoxofSpoons",
                                  "body": "Well, when it’s two options trying to compete for the same experience, why wouldn’t they?\n\nObviously both companies are putting their games on PC at least post-launch now, but as much as some people on sites like this try and pretend otherwise, PC is the enthusiast option and not really what Sony or Microsoft are actually trying to compete with. Even with several features that a lot of people seem to prefer (from what I can tell on the outside), Xbox hasn’t been able to get anywhere to close to Sony’s quantity and quality of games for nearly 15 years, which is why the Wii U was the only thing keeping the Xbox One out of third place by the end of that generation. Again, by the end of the last generation PS4 was pretty much *the* next-gen console, so when the next generation started and it took Xbox a year to get anything to really have a marquee Series X game, the options basically ended up being “default console” and “default console but with less games”. And of course that’s just continued until the current state of things.\n\nObviously the nature of “exclusives” for consoles has changed, but I don’t know if we’ve ever had a generation better demonstrate that they matter.",
                                  "score": 6,
                                  "created_utc": 1737883147.0,
                                  "replies": [
                                    {
                                      "id": "m98plrq",
                                      "author": "firedrakes",
                                      "body": "Yet sales numbers are down.  Those  exclusive are not help sales.\nBut grand turimo new game sales....\nBut 7 million... check note. \nPrev game 80 million sales.... ouch that not helping sales..\n Dig deeper mtx is what make  Sony any money  for the game.\n\nReally dig into the your news research. \nPeople don't",
                                      "score": -8,
                                      "created_utc": 1737883714.0,
                                      "replies": [
                                        {
                                          "id": "m98qit4",
                                          "author": "SomeBoxofSpoons",
                                          "body": "Sony’s biggest issue this generation is not being able to get people excited about the PS5, and a lot of that is because they know they’re on top now and they’re acting like they don’t need to try. The “PS5 has no games” joke came back because they haven’t been putting out that many games exclusive to the platform (which we now know is partially because they tried to put most of their devs on live service forever games hoping they’ll catch on). Just compare the way people talk about it to the amount of buzz Nintendo just got when they announced the Switch 2. People get more excited for something when they know there’s stuff to get excited about instead of it just being something they have to buy if they want to play modern games.",
                                          "score": 3,
                                          "created_utc": 1737884276.0,
                                          "replies": [
                                            {
                                              "id": "m98r2km",
                                              "author": "firedrakes",
                                              "body": "Every gen of ps after ps2. Has sold less exclusive  per gen. By large number.",
                                              "score": 1,
                                              "created_utc": 1737884611.0,
                                              "replies": []
                                            }
                                          ]
                                        },
                                        {
                                          "id": "m9a3g7s",
                                          "author": "zefiax",
                                          "body": "This is the stupidest comparison you've made so far. The gran turismo series going back to gran turismo 1 sold 80 million. Comparing the entire series to a single game is ridiculous.\n\nEDIT: Lmao this loser blocked me after his sales numbers (the ones that combined the entire GT series and compared it to a single game like an idiot) got called out.",
                                          "score": 0,
                                          "created_utc": 1737906188.0,
                                          "replies": [
                                            {
                                              "id": "m9c2low",
                                              "author": "firedrakes",
                                              "body": "  god i hate ps fans.\n\ni really do facts never matter. every ps game sales millions.\n\nwhen it real life they dont. cheer and bye. its the same reply every time.\n\ni bring real sales numbers.\n\nthat not true and your lying...\n\nevery single time......",
                                              "score": 1,
                                              "created_utc": 1737926239.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m98ruur",
                          "author": "MultiMarcus",
                          "body": "That is more that sales are staying consistent while development costs are going up.",
                          "score": 1,
                          "created_utc": 1737885090.0,
                          "replies": [
                            {
                              "id": "m98s03y",
                              "author": "firedrakes",
                              "body": "Guessing you think tons of ps5 games sell millions right?",
                              "score": -3,
                              "created_utc": 1737885178.0,
                              "replies": [
                                {
                                  "id": "m98s84r",
                                  "author": "MultiMarcus",
                                  "body": "They do? At least Sony’s exclusive titles sell well enough. Forbidden west did well and so did most first party exclusives last year. Other than Concorde which obviously flopped. They just need to avoid the crazy development prices of ultra high definition, motion captured titles which they have really fallen into.",
                                  "score": 9,
                                  "created_utc": 1737885314.0,
                                  "replies": [
                                    {
                                      "id": "m98sq3a",
                                      "author": "firedrakes",
                                      "body": "Only 7 ps5 games sold 1  million units.  \nOuch . From that 2 where multiple platforms,  3 only hit a million sales when it drop on pc.    Last  have yet to get a pc port.\nThat a  bad. Ever gen since ps2 has sold less per gen sales units.",
                                      "score": -2,
                                      "created_utc": 1737885617.0,
                                      "replies": [
                                        {
                                          "id": "m9a4m2d",
                                          "author": "demonsta500",
                                          "body": ">Only 7 ps5 games sold 1  million units.  \n\nWhere are you getting this misinformation ? Every CoD/FIFA/FC/Madden game on PS5 has obviously sold several millions.",
                                          "score": 2,
                                          "created_utc": 1737906531.0,
                                          "replies": [
                                            {
                                              "id": "m9c26ba",
                                              "author": "firedrakes",
                                              "body": "those are separate from the list. even cod sales are down. mtx is the cash cow now for cod",
                                              "score": 0,
                                              "created_utc": 1737926125.0,
                                              "replies": [
                                                {
                                                  "id": "m9cm6f6",
                                                  "author": "demonsta500",
                                                  "body": "What list are you referring to?",
                                                  "score": 1,
                                                  "created_utc": 1737931654.0,
                                                  "replies": [
                                                    {
                                                      "id": "m9cpppm",
                                                      "author": "firedrakes",
                                                      "body": "the cod or game sales on ps5?",
                                                      "score": 1,
                                                      "created_utc": 1737932641.0,
                                                      "replies": [
                                                        {
                                                          "id": "m9cyg4k",
                                                          "author": "demonsta500",
                                                          "body": "Whatever list you are referring to.",
                                                          "score": 1,
                                                          "created_utc": 1737935224.0,
                                                          "replies": [
                                                            {
                                                              "id": "m9czne3",
                                                              "author": "firedrakes",
                                                              "body": "Most sold games list for ps5",
                                                              "score": 1,
                                                              "created_utc": 1737935582.0,
                                                              "replies": [
                                                                {
                                                                  "id": "m9d184k",
                                                                  "author": "demonsta500",
                                                                  "body": "I don't see a link to a list so I'm gonna guess it's imaginary",
                                                                  "score": 0,
                                                                  "created_utc": 1737936060.0,
                                                                  "replies": []
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m9a2u7l",
                  "author": "zefiax",
                  "body": "They absolutely do. I don't know why people keep pushing this bs from Phil spencer. It's the main reason most people choose a console, what games they would be able to play on it that they couldn't on another console. And the casual gamers just follow what their gamer friends bought.",
                  "score": 1,
                  "created_utc": 1737906008.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m98kuwo",
          "author": "ArchusKanzaki",
          "body": "Because ppl starts replacing their PS4. There is really only one choice for it unless you only play annual sports game (where not much reason to play the older series). It does not really matter if PS5 does not have much games that are not playable on PC, PS5 is cheaper than most Nvidia GPU, and alot of the PS5 games are also not available on Xbox.",
          "score": 7,
          "created_utc": 1737880815.0,
          "replies": []
        },
        {
          "id": "m99je15",
          "author": "srebew",
          "body": "it has games, It just doesn't have a Gen defining games like PS3 and PS4 did.",
          "score": 2,
          "created_utc": 1737899420.0,
          "replies": []
        },
        {
          "id": "m9cvqem",
          "author": "Remy0507",
          "body": "Some vocal minority of people whine about the fact that the PS5 doesn't have many \"truly\" exclusive games, because a lot of their early exclusives also came out for PS4 (with lesser quality graphics and lower framerates) and/or event got ported to PC. The idea that there aren't \"enough games\" is lunacy though. There are an incredible number of games. Just not many that can't technically be played on a different device as well.",
          "score": 2,
          "created_utc": 1737934408.0,
          "replies": []
        },
        {
          "id": "m99tfft",
          "author": "BigFlapJack-",
          "body": "Exclusives",
          "score": 1,
          "created_utc": 1737903043.0,
          "replies": []
        },
        {
          "id": "m9agdiv",
          "author": "MillieChliette",
          "body": "Anecdotally and not seen mentioned yet: I've seen a lot of people buying one that skipped the PS4 generation and we're eager to get a PS5 so they could play the new stuff while also having access to a large backlog of bangers",
          "score": 1,
          "created_utc": 1737909963.0,
          "replies": []
        },
        {
          "id": "m9ajb1l",
          "author": "None",
          "body": "Until the switch 2 drops it’s kinda the only console worth buying.",
          "score": 1,
          "created_utc": 1737910803.0,
          "replies": []
        },
        {
          "id": "m99j1c1",
          "author": "AskMeAboutMyHermoids",
          "body": "To answer your question. There really are no games other than astrobot",
          "score": -2,
          "created_utc": 1737899284.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m99urwi",
      "author": "supified",
      "body": "I wonder if this is truly apples to apples because MS also does the PC game and all of their xbox games come out on the PC.  The Xbox is essentially an inexpensive (as compared to a decent pc) point to get into gaming.  Add more if you count the gaming handhelds which MS will surely launch and I can't help but feel MS is by comparison doing just fine or maybe even better than Sony whose games have to run on a play station.",
      "score": 5,
      "created_utc": 1737903494.0,
      "replies": [
        {
          "id": "m9a8k3z",
          "author": "Sagemel",
          "body": "There have been quite a few tech YouTube channels that have done cheap PC builds that meet the price and performance of a PS5/Xbox, but then you also get the benefit of having a PC and everything that comes with that. Consoles are usually much more convenient though",
          "score": 2,
          "created_utc": 1737907691.0,
          "replies": [
            {
              "id": "m9blndh",
              "author": "_PurpleInk",
              "body": "Console: I want to buy something to play games. I will buy this £/$500 box of wires and plug it in. \n\nPC: I will shop around for the right components at the right price and then build it and hope I don’t do anything wrong and have to reorder parts, and I hope the parts I did buy are all compatible and won’t need upgrading in the next year.",
              "score": 3,
              "created_utc": 1737921580.0,
              "replies": [
                {
                  "id": "m9bmmhq",
                  "author": "Sagemel",
                  "body": "Hence the part where I mention convenience of a console vs PC. I built my first PC in 2013 after maybe an hour on Youtube and PC Part Picker",
                  "score": 0,
                  "created_utc": 1737921858.0,
                  "replies": [
                    {
                      "id": "m9bo0z4",
                      "author": "_PurpleInk",
                      "body": "Exactly, I wasn’t disagreeing",
                      "score": 2,
                      "created_utc": 1737922265.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m99ienh",
      "author": "tenkenZERO",
      "body": "To be honest, after being against pc gaming for decades, I'm actually looking forward to building one and playing games from both consoles. Even though Sony makes you wait for the big exclusives. \n\nI think I'm done with consoles",
      "score": 5,
      "created_utc": 1737899037.0,
      "replies": []
    },
    {
      "id": "m9bp99i",
      "author": "FlameShadow0",
      "body": "I don’t understand this. Everybody now is constantly shitting on Xbox for not releasing exclusives to make their console more valuable.,  Just a couple years ago though, everybody was shitting on Sony for having too many exclusives. \n\nI thought Gamers as a whole were against exclusive games?",
      "score": 2,
      "created_utc": 1737922616.0,
      "replies": []
    },
    {
      "id": "m9c551p",
      "author": "killshelter",
      "body": "Personal preference since I have both but I prefer my Xbox so much more than my PlayStation. This whole generation has been a flop, between not being able to readily get either of them for the first few years, and just not having an availability of games.\n\nAlso the PS controller batteries are abysmal.",
      "score": 2,
      "created_utc": 1737926901.0,
      "replies": []
    },
    {
      "id": "m9cv0io",
      "author": "GMNestor",
      "body": "I'm a curious case here.\n\nHad ps3, bought ps4pro for destiny 2, uncharted and other games. At that point in time owning a one X didn't make sense. Had a ps+ sub for years, dripping games every month.\n\nFast forward few years, ps5 is out, takes enough space for a small aircraft carrier. Hard to get. I'm upgrading my home cinema setup with a 120hz tv, sonos, etc. Lo and behold, playstation doesn't support atmos.\nThen we have the gamepass. 2 years with the console, can be gotten cheap on the market, I can play on both my PC and console, and it even syncs saves. I can play my game when tv is occupied.\nThe amount of content on gamepass is pretty huge, for a family gamer with a schoolkid that is more than enough.\n\nFor me, ps5 didn't have enough value, save the controllers. I miss horizon dearly, but both installments could be played on my ps4pro, so didn't need the 5 just for more pizzaz. No new uncharted game, God of war was never a thing for me.\n\nXsx was an uncomfortable but calculated choice, and I don't regret it. I don't socialise over console, so there is that. \n\nMost games are multiplatform or come out on pc eventually. Happy with my xbox, but I do understand the criticism behind the naming and the awful XSS. \n\nValue and spec wise - there is nothing to complain.",
      "score": 2,
      "created_utc": 1737934192.0,
      "replies": [
        {
          "id": "m9d7yfn",
          "author": "polomarkopolo",
          "body": "You lost me at “Small aircraft carrier”\n\nMaybe if you are a gnat or lice",
          "score": 1,
          "created_utc": 1737938051.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9ghcy3",
      "author": "flirtmcdudes",
      "body": "the Xbox is literally just BARELY having its first big year of releases… 4 years later\n\nKinda need games to sell consoles",
      "score": 2,
      "created_utc": 1737988740.0,
      "replies": []
    },
    {
      "id": "m9axqxt",
      "author": "xeenexus",
      "body": "PlayStation. PlayStation 2.  PlayStation 3. PlayStation 4. PlayStation 5. \n\nXbox. Xbox 360.  Xbox One. Xbox one X.  Xbox Series X. Or S. \n\nIf you a casual, or a parent buying something for a kid, what do you think you’re going to do?",
      "score": 6,
      "created_utc": 1737914904.0,
      "replies": [
        {
          "id": "m9b6u3u",
          "author": "SuicidalChair",
          "body": "Ask my kid exactly what they want instead of guessing and getting it wrong?",
          "score": 7,
          "created_utc": 1737917417.0,
          "replies": [
            {
              "id": "m9b7n36",
              "author": "xeenexus",
              "body": "You trust your kid to get it right?",
              "score": 4,
              "created_utc": 1737917640.0,
              "replies": [
                {
                  "id": "m9b8038",
                  "author": "SuicidalChair",
                  "body": "My kid is in grade 3, can read and write, and knows specific models of weapons in call of duty. So yes I trust him to get it right lol.",
                  "score": 3,
                  "created_utc": 1737917740.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9cbibb",
          "author": "Firebug160",
          "body": "“The new Xbox”",
          "score": 3,
          "created_utc": 1737928632.0,
          "replies": []
        },
        {
          "id": "m9cgw47",
          "author": "Wraithdagger12",
          "body": "This absolutely happened a few years ago. Parents bought Xbox Ones for Christmas because the naming scheme is too damn confusing. M$ did this to themselves.",
          "score": 0,
          "created_utc": 1737930159.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9a9xrg",
      "author": "smith2332",
      "body": "I’m so sick of seeing these articles about the console sales, Microsoft doesn’t care about the hardware they are acting like Apple and just working on the ecosystem and applications side. Hardware sales is not part of their ecosystem as a focus, it’s all about Xbox ultimate and cloud gaming on any devices which they have said for the last 10 years and people keep acting like Xbox is losing LOL",
      "score": 4,
      "created_utc": 1737908097.0,
      "replies": [
        {
          "id": "m9h2oop",
          "author": "Budget-Ad7465",
          "body": "I agree. PS relies on money hatting games and brand power.\n\nWhat happens when content ip ownership is king and we’re in the services/streaming wars? I see the PS ecosystem and its fans going the way of the Sony Walkman or Betamax.",
          "score": 1,
          "created_utc": 1737995090.0,
          "replies": [
            {
              "id": "m9jwdzu",
              "author": "GetDunkedOnFool",
              "body": ">PS relies on money hatting games and brand power.\n\nYou have to be saying this ironically after Microsoft literally bought Bethesda and ABK.",
              "score": 1,
              "created_utc": 1738024324.0,
              "replies": [
                {
                  "id": "m9kjr8j",
                  "author": "Budget-Ad7465",
                  "body": "Yes, they’re focused on buying single title IP instead of content ownership. That becomes a problem later on when you hit the streaming/services war.",
                  "score": 1,
                  "created_utc": 1738031860.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9bltvq",
      "author": "SDFek",
      "body": "The slimy shit Microsoft tried to pull with the xbone broke my trust so fundamentally that I didn’t even consider the series X.",
      "score": 2,
      "created_utc": 1737921632.0,
      "replies": []
    },
    {
      "id": "m99z51e",
      "author": "pratikindia",
      "body": "MS is the responsible. They should keep the exclusives XBOX only.",
      "score": 4,
      "created_utc": 1737904887.0,
      "replies": [
        {
          "id": "m9a5t58",
          "author": "Sagemel",
          "body": "Exclusives are very good for business but very anti-consumer. You want to HAVE to buy 3 separate consoles to be able to play everything you want to?",
          "score": 3,
          "created_utc": 1737906888.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9duf9q",
      "author": "FlyinDanskMen",
      "body": "Microsoft screwed up with the Type S that nobody wanted. And their naming is terrible, nobody knows what is the new or old Xbox.",
      "score": 2,
      "created_utc": 1737944835.0,
      "replies": []
    },
    {
      "id": "m99jdlp",
      "author": "None",
      "body": "What is the purpose of these types of posts? Both ps5 and Xbox. Both are going to come out with new models regardless of past sales performances.",
      "score": 2,
      "created_utc": 1737899415.0,
      "replies": []
    },
    {
      "id": "m9aevrv",
      "author": "Spunndaze",
      "body": "Who GAF. Get over this shit. JFC.",
      "score": 1,
      "created_utc": 1737909535.0,
      "replies": []
    },
    {
      "id": "m9aymp5",
      "author": "Nyx-Erebus",
      "body": "Isn’t part of the reason because it isn’t early possible to buy a PS4 legit anymore? Like I’ve thought about buying one just to have one in my living room for couch coop but every electronics store I’ve checked just does not have it at all anymore.",
      "score": 1,
      "created_utc": 1737915149.0,
      "replies": []
    },
    {
      "id": "m9b583g",
      "author": "darknetwork",
      "body": "Damn! The whole comment section became fanboy console wae.",
      "score": 1,
      "created_utc": 1737916973.0,
      "replies": []
    },
    {
      "id": "m9bmses",
      "author": "img_tiff",
      "body": "feels like PC Game Pass has killed the Xbox console market, but I haven't used my Xbox in over a year since I built my PC",
      "score": 1,
      "created_utc": 1737921906.0,
      "replies": []
    },
    {
      "id": "m9d3u2d",
      "author": "Remic75",
      "body": "Yeah because the shift to throwing exclusives on PC also killed Xbox. They understood the risk of putting Xbox exclusives on PC and did it anyways. Not just PC but any device that breathes (that “this is an xbox” ad when it was a phone they were referring to bc gamepass). If I really wanted to play an Xbox game, I’d just build a PC for slightly more than the price of a series X and maintain that for years vs buying the latest console. \n\nIf PS does the same thing, expect sales to also decrease, even if the PS5 Pro has future proof tech.",
      "score": 1,
      "created_utc": 1737936830.0,
      "replies": []
    },
    {
      "id": "m9dg6qx",
      "author": "firefighter26s",
      "body": "I feel that part of their problem is that the one s/x didn't become obsolete when the Series S/X came out. I still have a One S and play next Gen games via cloud.\n\nOnly reason I have a series S now is that my buddy upgraded to a Series X at Christmas and gave me his S, otherwise I'd still be on the One. .",
      "score": 1,
      "created_utc": 1737940461.0,
      "replies": []
    },
    {
      "id": "m9dk14b",
      "author": "PoignantPoint22",
      "body": "Microsoft lost the console war when they initially announced that players would have to always be online to play the Xbox One. Even though they reversed that decision, the damage had been done. That initial announcement killed the hype for the Xbox one.",
      "score": 1,
      "created_utc": 1737941650.0,
      "replies": []
    },
    {
      "id": "m9doav9",
      "author": "SoMass",
      "body": "The name didn’t help them at all.  I get confused if it’s the Xbox one, series x, Xbox one x or whatever is inbetween.  I see the names all messed up on FB marketplace too not being the correct name.\n\nI can only mentally refer to them as the DVR looking box, the laying sideway rectangle, or the standing rectangle.",
      "score": 1,
      "created_utc": 1737942984.0,
      "replies": []
    },
    {
      "id": "m9dsalh",
      "author": "Nova_Nightmare",
      "body": "There is no reason to \"Buy an Xbox\" and I bought one. Every game you want to play on Xbox is available on the computer. That's it.\n\nNow the same is true with Sony - even though the wait may be a year, so there's a much reduced reason to own one of them as well and I own one too.",
      "score": 1,
      "created_utc": 1737944192.0,
      "replies": []
    },
    {
      "id": "m9dwaom",
      "author": "DrMcJedi",
      "body": "Because my Xbox One is still running just fine, and the game store still works…",
      "score": 1,
      "created_utc": 1737945413.0,
      "replies": []
    },
    {
      "id": "m9dx6n3",
      "author": "notjordansime",
      "body": "Wow, that’s crazy to think about. In 2017 the Xbox one felt like it had been out for ages. In 2025 it feels like the Xbox series consoles came out just a few of years ago….",
      "score": 1,
      "created_utc": 1737945696.0,
      "replies": []
    },
    {
      "id": "m9dywa9",
      "author": "pyromanta",
      "body": "I think it's important to remember Xbox have been working towards a multi-hardware platform for years now. Phil Spencer said a few years ago that Xbox consoles are being seen as an option, not a requirement. Hence Gamepass on PC and them pouring tons of resources into cloud gaming.\n\nI can't imagine Xbox is too worried by these sales figures. Sony on the other hand are still firmly pitching the PS5 as the only place to play their exclusive games and only now starting to let them onto PC, likely because they've seen how much success Xbox are having with it.\n\nUltimately console hardware sales are going to become an obsolete metric when compared to digital game sales and game subscriptions.",
      "score": 1,
      "created_utc": 1737946209.0,
      "replies": []
    },
    {
      "id": "m9ehc7t",
      "author": "ReticlyPoetic",
      "body": "No body wants to spend a monthly fee for two or three consoles.",
      "score": 1,
      "created_utc": 1737952784.0,
      "replies": []
    },
    {
      "id": "m9es02x",
      "author": "Sniffy4",
      "body": "xbox 360 i feel 'won' its generation because of its superior online experience, but MS lost its way trying to make XboxOne into an 'everything' setup box.",
      "score": 1,
      "created_utc": 1737957702.0,
      "replies": []
    },
    {
      "id": "m9exxal",
      "author": "Great_Shazaam",
      "body": "Let's not forget that Microsoft is pushing the XBOX on everything program with PC Gamepass and have already said they would be releasing on the Switch 2 as well",
      "score": 1,
      "created_utc": 1737960884.0,
      "replies": []
    },
    {
      "id": "m9fehfk",
      "author": "luttman23",
      "body": "If Sony had an understandable online subscription service, something comparable to Gamepass ultimate and at a similar price point I'd jump to Sony in an instant.\nThe other issue with changing over is that my partner and kids also use Gamepass on the PC and console. \n\n\nSony Gamepass would be freaking awesome.",
      "score": 1,
      "created_utc": 1737971040.0,
      "replies": []
    },
    {
      "id": "m9food4",
      "author": "ManassaxMauler",
      "body": "The fact that it doesn't feel like a new console doesn't help. It's effectively Xbox 1.5. It has slightly better tech and that's about it. Compare that to the leap from 360 to One. I have been hugely underwhelmed with the Series X, and that's not helped by the fact that they've been scared to make games that aren't also One compatible. I haven't seen a whole lot that really showcases the power of this supposed most powerful console ever.",
      "score": 1,
      "created_utc": 1737977049.0,
      "replies": []
    },
    {
      "id": "m9g2w9e",
      "author": "I_T_Gamer",
      "body": "The locked circles were the only thing that keep XBox relevant at all.   Once its truly cross platform I'm betting that MS just stops making consoles.  I think PS is missing an opportunity here, as they are the largest hold out IMO.",
      "score": 1,
      "created_utc": 1737983593.0,
      "replies": []
    },
    {
      "id": "m9guvxy",
      "author": "Laserous",
      "body": "Probably because people can't keep up with whatever the current Xbox is named. They learned nothing from the Wii-U.",
      "score": 1,
      "created_utc": 1737992862.0,
      "replies": []
    },
    {
      "id": "m9h32g2",
      "author": "everstillghost",
      "body": "People Will still Say that the series S was a good idea despite the expensive PlayStation selling better.",
      "score": 1,
      "created_utc": 1737995197.0,
      "replies": []
    },
    {
      "id": "m9hs033",
      "author": "MrDeacle",
      "body": "I'm sure it doesn't help that Xbox's insane naming scheme is really confusing to parents.",
      "score": 1,
      "created_utc": 1738002117.0,
      "replies": []
    },
    {
      "id": "m9jn1pu",
      "author": "panicForce",
      "body": "i still dont know which xbox is the new one",
      "score": 1,
      "created_utc": 1738021316.0,
      "replies": []
    },
    {
      "id": "m9mcjg4",
      "author": "DrShabink",
      "body": "Microsoft didn't/doesn't sell consoles to make money, they sell consoles to sell games and services. Game Pass is largely a success on PC and beyond (with cloud gaming), no need to play the old 2000s' market saturation wars anymore. So the headline makes it sound like Playstation wins, but they're playing a different game... by themselves.",
      "score": 1,
      "created_utc": 1738064230.0,
      "replies": []
    },
    {
      "id": "m98pweu",
      "author": "iamjkdn",
      "body": "Headline is misleading. In the article it mentions Microsoft doesn’t publish sales figure. The sales data they got is from some marketing firm. Add to that, it only publishes US sales but the way article is written, it is trying to paint a picture that Xbox sales overall is declining, with no evidence since Microsoft doesn’t publish sales figure. \n\nPeak journalism.",
      "score": -7,
      "created_utc": 1737883895.0,
      "replies": [
        {
          "id": "m99e4oi",
          "author": "BrewKazma",
          "body": "Circana is widely regarded as one of the best and most accurate sales tracking companies. Its not a marketing firm. This isn’t some random no name company. A lot of corporations use their data.",
          "score": 16,
          "created_utc": 1737897313.0,
          "replies": [
            {
              "id": "m99jjga",
              "author": "iamjkdn",
              "body": "I understand there are companies like this but any figures from them are only speculation, since Microsoft sales figure are ultimately more reliable than any other estimate. Since Microsoft doesn’t supply those figures, my point still stands. Headline is painting an inaccurate picture.",
              "score": -5,
              "created_utc": 1737899477.0,
              "replies": [
                {
                  "id": "m99lwui",
                  "author": "BrewKazma",
                  "body": "Its not speculation at all. It is consoles sold from retailers. They work with retailers to track the actual number of products sold. Il not sure why you are trying to push back against this, when Circana (and formerly NPD) have been the gold standard for information like this for many, many years. They have been tracking the video games industry since like 1995. \n\nYou try to claim in your initial comment that the article is deceptive because it only includes US figures, but it repeatedly says that in the article.",
                  "score": 11,
                  "created_utc": 1737900373.0,
                  "replies": []
                },
                {
                  "id": "m9a57jq",
                  "author": "demonsta500",
                  "body": ">since Microsoft sales figure are ultimately more reliable than any other estimate\n\nDo they even provide actual sales figures anymore ? Last I heard, they just say sales grew/fell by a certain % from last year. And even they say Xbox sales are cratering every year by dropping 30-40% YoY.",
                  "score": 1,
                  "created_utc": 1737906708.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m98s0tf",
      "author": "MultiMarcus",
      "body": "The interesting part would be if there are going to be fewer PS5 + Series consoles owners than PS4 and Xbox One owners. How many people will be dropping the consoles in favour of PC and how many in favour of the Switch (and Switch 2) and even mobile?",
      "score": -3,
      "created_utc": 1737885189.0,
      "replies": [
        {
          "id": "m99joak",
          "author": "VanillaSoftArtist",
          "body": "I don't see PC gaming becoming mainstream unless its simplified, like with what they've attempted with those handheld units. One thing to remember: the average person is not technologically intelligent. They can use an iPhone no problem, but put them in front of a laptop, and they will have problems.\n\nEven in the present, PC games need more tinkering than one would be comfortable with.\n\nI can see people continuing to buy a PlayStation and Nintendo together, or one of the two. Nintendo has the exclusives, but Sony has the power and still has exclusives if you treat PC like a completely different market (which I'd argue it is).",
          "score": 2,
          "created_utc": 1737899529.0,
          "replies": [
            {
              "id": "m99me4p",
              "author": "MultiMarcus",
              "body": "Yeah, but the thing is, the PC market is growing in a country like Japan. Unless we’re supposed to believe that the PC market grew without at all affecting the console market then that would be to some degree fewer console players unless the console market grew more at the same time obviously but the point is the same. I think a lot of PC gamers are far too dramatic about how hard a PC is to use. A 12-year-old family friend is buying a PC instead of a console because that’s what is cool with his generation. Yeah PCs need more work but at the same time almost everyone has a laptop for work so they’ve probably already used a PC operating system though it is quite possible that they would be using Mac and not Windows but the differences aren’t that major. Yeah, most people would probably be buying prebuilts, but I don’t necessarily think everyone who’s a PC gamer has to be a PC builder. I think there’s a sense of elitist superiority from PC gamers a lot of the time, but that isn’t really reflected in reality. If you buy a prebuilt PC, you don’t really have to do that much finicking anymore. Nvidia even has their app which just optimises games for you. Not to mention how consoles have got far more confusing in settings menus with options like upscaling frame generation and even more granular options than any period of gaming in the past. \n\nPC also has a lot more games too. You get basically every single game that’s not a Sony title or a rockstar title but they’ll usually arrive about a year or two after launch. \n\nTreating PC gamers as a completely separate market from consoles is just outdated because we know without any real discussion that people are buying gaming PCs and at a shocking rate. The 36 million concurrent steam users aren’t just playing on their MacBooks. Discreet graphics cards have become common. Steam has 132 million users which is more than twice the amount of PS5s sold. I think nerds are desperate to keep their hobby nerdy but let’s be honest PC gaming isn’t a nerd hobby anymore it’s for everyone. \n\n[Here](https://www.pcgamer.com/gaming-industry/new-report-says-pc-games-are-outselling-console-games-calling-pc-gaming-a-bright-spot-in-a-troubled-industry/) is an interesting article from PC gamer talking about how the gaming market isn’t just consoles anymore. Also, I think the people who are that technologically illiterate that they think PC is scary. They might just be buying the Nintendo switch which is the console for the technologically illiterate people not the PS5 that’s being sold based on ray tracing and teraflops.",
              "score": -1,
              "created_utc": 1737900553.0,
              "replies": [
                {
                  "id": "m9b4rfg",
                  "author": "VanillaSoftArtist",
                  "body": "I'm not desperate to keep PC gaming some nerd hobby. I acknowledge it has many players.\n\nThat said, many still prefer simplicity and view computers as something more complicated. A lot of younger people don't even have computers now, instead being raised through phones and tablets. Hence why I mentioned the confusion.\n\nPC gaming is growing, but it's a fundamentally different market because those users don't expect the ease you get with a console interface. Consoles are limited, but they're also far simpler. I could get my mother into a PS5 if she were interested, but it'd be hell introducing her to Steam or the various other PC launchers.",
                  "score": 1,
                  "created_utc": 1737916845.0,
                  "replies": [
                    {
                      "id": "m9b596y",
                      "author": "MultiMarcus",
                      "body": "Except clearly PC gaming is growing from somewhere. I postulated that it is from a lot of former console players who maybe had a console when younger and once they got more disposable income they might have switched to PC.",
                      "score": 1,
                      "created_utc": 1737916981.0,
                      "replies": [
                        {
                          "id": "m9b6a6s",
                          "author": "VanillaSoftArtist",
                          "body": "Yes, it's growing, but it's still a more high-end market. Consoles have a $500 entry fee for tons of games, while a decent PC can go into the thousands. If you need a laptop with smaller space, prepare to pay higher.\n\nWhile console prices are getting concerning, they still have an appeal to the people not trying to spend a fortune on a device for playing games.",
                          "score": 1,
                          "created_utc": 1737917264.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m99mrmm",
          "author": "JM062696",
          "body": "PC is way too expensive to just jump into. The obvious choice is PlayStation for someone jumping in. Otherwise you need to spend at the VERY LEAST $1000 to build a decent gaming PC, spend $200 on a monitor, buy all your peripherals like mouse and keyboard, have a table and space to set it all up on, etc. once you have all the stuff PC just seems like the best option but to jump into it from scratch is a large undertaking when you could just run to Best Buy and get a very decent gaming experience through a ps5 for half the price.",
          "score": 5,
          "created_utc": 1737900691.0,
          "replies": [
            {
              "id": "m99oy2d",
              "author": "MultiMarcus",
              "body": "No, the obvious choice is the Nintendo Switch. Also let’s stop pretending like gaming is an expensive hobby. There are enough people doing horse riding or ballet dancing or skiing that you can be a PC gamer, no problem. Not to mention how a PC can actually be used for other stuff too. A console is a dedicated gaming device a gaming PC can act as your at home workstation and as a gaming platform. I understand that consoles are definitely cheaper, but the numbers aren’t far enough away from one another that someone picking up gaming as a hobby or who has played games for a very long time will just discount PC. So many console gamers get tired of the inflexible prices and weird arbitrary restrictions on game availability undecided that instead of buying the PS5 after their PS4 they’ll just get a PC which might cost a bit more upfront but they won’t have to pay for online. They’ll be able to get games discounted they’ll be able to emulate they’ll be able to use old games and they’ll even be able to use it for work.",
              "score": -3,
              "created_utc": 1737901481.0,
              "replies": [
                {
                  "id": "m99u4oi",
                  "author": "JM062696",
                  "body": "The obvious choice is Switch if you’re a child or you don’t care about frame rates or graphics, or you just wanna play Nintendo exclusives. \nGaming most certainly is an expensive hobby if you don’t have a console or any games. Anyone can go to a used game store and buy used stuff. Many people don’t use windows anymore anyways they prefer MacOS. I don’t have a Mac I’m just saying what I see.",
                  "score": 0,
                  "created_utc": 1737903278.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9970wa",
      "author": "pukem0n",
      "body": "It's dead, sir. Hold the funeral.",
      "score": 0,
      "created_utc": 1737893960.0,
      "replies": [
        {
          "id": "m99nd2f",
          "author": "MobileVortex",
          "body": "Microsoft makes more money though lol. More consoles sold doesn't really mean anything anymore lol.",
          "score": -1,
          "created_utc": 1737900908.0,
          "replies": [
            {
              "id": "m99xum6",
              "author": "silentcrs",
              "body": "I don’t know why you’re being downvoted. Xbox revenues up 61% last year. They’re doing fine.",
              "score": 1,
              "created_utc": 1737904485.0,
              "replies": [
                {
                  "id": "m9a0g4f",
                  "author": "pukem0n",
                  "body": "Because they bought Activision",
                  "score": -3,
                  "created_utc": 1737905289.0,
                  "replies": [
                    {
                      "id": "m9a3i3d",
                      "author": "silentcrs",
                      "body": "And? They was the entire point of buying them - to make revenue. It’s business 101.",
                      "score": 3,
                      "created_utc": 1737906204.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9a4mf4",
              "author": "zefiax",
              "body": "No ultimately it doesn't. If you can sell your console, then you not only make money on your own games, but you get a cut of every game sold for your console. Ultimately that is much more profitable than just being a third party developer. \n\nMicrosoft is just hosting that fact by buying up studios like Activision and then claiming their revenue is up. It is, but only because you just added a whole bunch of existing studios revenue to it.",
              "score": 1,
              "created_utc": 1737906534.0,
              "replies": [
                {
                  "id": "m9b3uri",
                  "author": "MobileVortex",
                  "body": "No... having 34 million people giving you $20 a month is infinitely more profitable lol. Recurring revenue is all any company cares about anymore.",
                  "score": 1,
                  "created_utc": 1737916592.0,
                  "replies": [
                    {
                      "id": "m9gc3jx",
                      "author": "zefiax",
                      "body": "34 million people are not gonna give you $20 a month every month in practice. What most will do is wait for a great game they actually want to play release, get gamepass for that month, finish it, then cancel. That's why this whole gamepass model has not lived up to expectations.",
                      "score": 1,
                      "created_utc": 1737986965.0,
                      "replies": [
                        {
                          "id": "m9ggp3t",
                          "author": "MobileVortex",
                          "body": "How has it not lol. They have 34 million active subs... What are you even talking about? I know at least 6 people who have had active subs since game pass started and still do. This year has even more good games coming to it.  \n\nYour bias is seeping through.",
                          "score": 0,
                          "created_utc": 1737988520.0,
                          "replies": [
                            {
                              "id": "m9gi78f",
                              "author": "zefiax",
                              "body": "The number you are quoting is from a year ago. What is it now? I have had active gamepass subscriptions plenty of times but I cancelled last year because I wasn't using it consistently. Most of my friends did the same. Can you point to me where microsoft has released current numbers and not numbers from a year ago?\n\nEDIT: Also to clarify on bias, I am 12 years old. I've owned an OG xbox, xbox 360, and xbox one, and I passed on the XSX because microsoft claimed that you can play all the games day 1 on PC which is exactly what I have taken advantage of. Yes I also have a PS5 and a switch but I am too old for console wars. I did that back in the genesis and snes days and then grew up.",
                              "score": 0,
                              "created_utc": 1737989015.0,
                              "replies": [
                                {
                                  "id": "m9gjr6n",
                                  "author": "MobileVortex",
                                  "body": "lol",
                                  "score": 0,
                                  "created_utc": 1737989511.0,
                                  "replies": [
                                    {
                                      "id": "m9gl9nm",
                                      "author": "zefiax",
                                      "body": "So no new numbers? Got it lol.",
                                      "score": 1,
                                      "created_utc": 1737989989.0,
                                      "replies": [
                                        {
                                          "id": "m9gu08l",
                                          "author": "MobileVortex",
                                          "body": "Your argument is kinda like how people said Netflix is going to fail because they raised their prices yet they keep making more money. It's clear you really are 12 years old lol.",
                                          "score": 0,
                                          "created_utc": 1737992608.0,
                                          "replies": [
                                            {
                                              "id": "m9gvgf6",
                                              "author": "zefiax",
                                              "body": "So again, no recent numbers then? Lol\n\nMy argument isn't like anything, that's just some bs false equivalency because you don't have numbers.",
                                              "score": 1,
                                              "created_utc": 1737993025.0,
                                              "replies": [
                                                {
                                                  "id": "m9im2ql",
                                                  "author": "MobileVortex",
                                                  "body": "what exactly are you saying then? Of course I dont have numbers. are you trying to say that because the price rose and you and 2 of your freinds dont pay for it that the number is down below 10mil or something? even if it was cut in half that is still $200+ million a month. recurring revenue is all any company cares about and its why Sony is now offering their own version. If any company knows how to print $$$ its microsoft. What even if your point here?",
                                                  "score": 0,
                                                  "created_utc": 1738010540.0,
                                                  "replies": [
                                                    {
                                                      "id": "m9ior9y",
                                                      "author": "zefiax",
                                                      "body": "My point is if this was really successful, they would be reporting and publishing the numbers. The fact that they don't indicates that this is not panning out to how they expected it to go. We do not know if their subscriptions have increased or decreased. We do not know what their revenue is specifically for gamepass. We do not know if the revenue and profit they make from gamepass is equivalent to what they would be making from game sales on their console. Is the money from gamepass equal to how much they would have made selling the game directly to the consumer?\n\nWe don't even know if it truly is recurring revenue because we don't know how many people are keeping an active subscription and how many are like me and subscribe when a game they want to play is released and then unsubscribe as soon as they finish the game? \n\nUltimately we don't know any of this because Microsoft stopped reporting these figures. The fact that they stopped reporting usually implies it is not going as impacted. All we have is that data indicates premium sales drop 80% when the game is on gamepass.\n\nhttps://www.thegamer.com/xbox-game-pass-80-percent-loss-premium-sales/\n\nWhich to me, makes perfect sense. Gamepass has basically allowed me to play games that I would have paid full price for, for $20 sub or $40 at best if the game takes me two months to finish. Great for me, save me $60, but I don't see how that is financial viable in the long term.\n\nMy point is we don't actually know if gamepass is still successful.",
                                                      "score": 0,
                                                      "created_utc": 1738011292.0,
                                                      "replies": [
                                                        {
                                                          "id": "m9k3mm9",
                                                          "author": "MobileVortex",
                                                          "body": "How do you define successful? What value do you place on the games that I would have never played if game pass didn't exist. Game pass has led to me discovering and buying other games. there is more too successful than did X game make as much as it possibly could. How do you value Game Pass as a community / branding tool? Recurring revenue is not only valued higher because generally it means you make more, but also because its more stable. You buying game pass a few times a year is recurring... I think you and 'thegamer.com' are missing a large part of the picture here, but I can't say I'm surprised.",
                                                          "score": 0,
                                                          "created_utc": 1738026639.0,
                                                          "replies": [
                                                            {
                                                              "id": "m9kzb7u",
                                                              "author": "zefiax",
                                                              "body": "Again big words and big claims and lots of defensiveness and condescension, yet zero data provided to back up your claims. May be try actual getting some data before you talk down to someone. \n\nUntil then, all we know is Microsoft is not confident enough on their gamepass revenue and success to actual report on the numbers. Regardless of how much you think you know about subscription services.\n\nNot surprised reddit \"experts\" fail at providing data once again.\n\nEdit: lmao the fan boy blocked me after getting called out on their bs claims. Of course.",
                                                              "score": 0,
                                                              "created_utc": 1738037322.0,
                                                              "replies": [
                                                                {
                                                                  "id": "m9l094o",
                                                                  "author": "MobileVortex",
                                                                  "body": "Neither one of us have data. This seems personal for you lol. Have a great day.",
                                                                  "score": 1,
                                                                  "created_utc": 1738037691.0,
                                                                  "replies": []
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m99pb1v",
      "author": "gubasx",
      "body": "Buying an Xbox is like those times when you make an unpopular comment on Reddit and even though you're absolutely right still you will get ultra downvoted because folks would have to feel dumb if you were right and they are not even able to process the possibility that you could be right and they firmly believe or want you to be wrong. 🤷🏻‍♂️",
      "score": -1,
      "created_utc": 1737901612.0,
      "replies": []
    },
    {
      "id": "m990gqv",
      "author": "FelopianTubinator",
      "body": "It’s never good when you’re on twitter/X and see all the Xbox fanboys trying to stay relevant by trashing Sony. I don’t have a stake in either console, but it does make me sad.",
      "score": -8,
      "created_utc": 1737890296.0,
      "replies": [
        {
          "id": "m9975rm",
          "author": "pukem0n",
          "body": "It's also unhealthy to declare all criticism of Sony to be by xbox fanboys.",
          "score": 4,
          "created_utc": 1737894030.0,
          "replies": [
            {
              "id": "m99c6vn",
              "author": "FelopianTubinator",
              "body": "Just the facts. They’re self proclaimed Xbox supporters on their various social media profiles and consistently use the word “ponies” to describe Sony fans.",
              "score": 1,
              "created_utc": 1737896467.0,
              "replies": [
                {
                  "id": "m99cp6n",
                  "author": "pukem0n",
                  "body": "Well a lot of PS fanboys are ponies who never criticize the platform just like xbots do the same. There's just way, way more on the PS side, obviously. These people always gravitate towards the dominant platform.",
                  "score": 4,
                  "created_utc": 1737896694.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m99paij",
      "author": "kehb",
      "body": "I had a 360 and loved it to death, but baby for me, Kinect and the One reveal did me in. I felt a shift in focus towards something I wasn’t as interested in, and Sony seemed more laser focused on games after ending strong the previous era. I don’t regret the change to PlayStation.",
      "score": 0,
      "created_utc": 1737901606.0,
      "replies": []
    },
    {
      "id": "m99s7r5",
      "author": "tignasse",
      "body": "Wait 5 or 10 years then emulate for almost nothing",
      "score": 0,
      "created_utc": 1737902630.0,
      "replies": []
    },
    {
      "id": "m99sqs5",
      "author": "NJH_in_LDN",
      "body": "Legacy of that Xbox One launch is literally going to haunt their consoles forever.",
      "score": 0,
      "created_utc": 1737902812.0,
      "replies": []
    },
    {
      "id": "m9aenb6",
      "author": "Husbandaru",
      "body": "Is the Xbox a tax scheme for Microsoft or something? They seem to treat it like a redheaded stepchild and punish their game companies very punitively if they don’t rake in a billion dollars.",
      "score": 0,
      "created_utc": 1737909468.0,
      "replies": []
    },
    {
      "id": "m9aqp64",
      "author": "Majestik-Eagle",
      "body": "I have a pc. If I were to get another console it would be a Ps5 since my pc is basically an Xbox.",
      "score": 0,
      "created_utc": 1737912928.0,
      "replies": []
    },
    {
      "id": "m9asyry",
      "author": "synkronize",
      "body": "If you have a pc Xbox series x loses most meaning. I bought one to try to get away from my desk and make couch gaming convenient for those gamepass games. Was fun for a week or two but then I kinda missed my PCs power for the same games I could play o Xbox. \n\nEventually it collected dust and I gave it to my nephews last Christmas.  \n\nXbox’s new approach just takes all the excitement out of the console tbh. I was always more of a Nintendo fan tbh but for some reason I grew up with a lot of Xbox. But was never into Halo or Gears tbh so I don’t even know how lol \n\nPS5/PC have filled the place of the Xbox for me.",
      "score": 0,
      "created_utc": 1737913564.0,
      "replies": []
    },
    {
      "id": "m9at1hf",
      "author": "Egw250",
      "body": "What is the point lf buying it , what its biggest triple A game that is a masterpiece? Most if not all its triple A releases are mediocre games or 7/10 at best which isn't worth it if you have the previous gen or a ps4. Atm they have Activisio,Blizzard and Bethesda they should be leading the market with triple A successes , not falling behind even from nintendo switch . . .",
      "score": 0,
      "created_utc": 1737913584.0,
      "replies": []
    },
    {
      "id": "m99nfvl",
      "author": "HeirOfBreathing",
      "body": "a playstation 5 pro with online services costs about the same as a pc with no need to subscribe to play online",
      "score": -4,
      "created_utc": 1737900936.0,
      "replies": [
        {
          "id": "m9a4uun",
          "author": "zefiax",
          "body": "There is no way you are getting a comparable performance with a $700 pc. And i mean actual output performance, not just raw specs.",
          "score": 1,
          "created_utc": 1737906603.0,
          "replies": [
            {
              "id": "m9eup3k",
              "author": "Delra12",
              "body": "With $700 you can get a 4060 and 5600 or 7600 combo. Those specs are enough to be better than a base ps5. In cpu bound situations it’s not even a contest",
              "score": 0,
              "created_utc": 1737959110.0,
              "replies": [
                {
                  "id": "m9g5310",
                  "author": "zefiax",
                  "body": "Firstly the point was that it is better than the ps5 pro, not the base ps5. The base ps5 doesn't cost $700.\n\nSecond, with the tower, power supply, OS, and everything else, you are gonna be both of $700 even with that combo.",
                  "score": 1,
                  "created_utc": 1737984432.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m99xe9x",
      "author": "bradleecon",
      "body": "![gif](giphy|na0aRAyPFZyjm)",
      "score": -1,
      "created_utc": 1737904342.0,
      "replies": []
    }
  ]
}