{
  "post": {
    "title": "New Apple TV and HomePod Mini Launching This Year With One Thing in Common",
    "author": "chrisdh79",
    "id": "1hwlezg",
    "score": 156,
    "created_utc": 1736346413.0,
    "selftext": "",
    "num_comments": 72,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hwlezg/new_apple_tv_and_homepod_mini_launching_this_year/"
  },
  "comments": [
    {
      "id": "m61woxi",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736346414.0,
      "replies": []
    },
    {
      "id": "m637cx0",
      "author": "cockyjames",
      "body": "I hope lower price doesn't mean additional ads. I have an AppleTV because it's the cleanest streamer. I will pay a premium for the OS to stay that way.",
      "score": 141,
      "created_utc": 1736360713.0,
      "replies": [
        {
          "id": "m63twig",
          "author": "None",
          "body": "It’s *THE* best streaming device and it’s not even remotely close. It’s in S-Tier while the rest in is D/F. I truly hope they don’t include ads.",
          "score": 78,
          "created_utc": 1736367228.0,
          "replies": [
            {
              "id": "m66pdfl",
              "author": "IncapableKakistocrat",
              "body": "Literally my only complaint with it is there's no web browser, so the only way to cleanly use Stremio is to open it on my phone or iPad an mirror the screen.",
              "score": 17,
              "created_utc": 1736403700.0,
              "replies": []
            },
            {
              "id": "m650jh1",
              "author": "Ruttagger",
              "body": "Apple TV aint best, doesnt even passthrough all audio formats.  Shield Pro is still on top.\n\nIf the new Apple TV supporta all audio, and allows me to install apps like Projectivy so I can eliminate all advertising and garbage menus and have the player launch what I want from startup, then ya, Ill give it a shot for sure.",
              "score": -22,
              "created_utc": 1736380157.0,
              "replies": [
                {
                  "id": "m650q8i",
                  "author": "None",
                  "body": "That’s a bit above my pay grade, so I’ll take your word for it! I’ve heard great things about the Shield, not sure why I forgot about it.",
                  "score": 11,
                  "created_utc": 1736380220.0,
                  "replies": [
                    {
                      "id": "m667wvz",
                      "author": "temp1876",
                      "body": "Shield hasn’t been updated in ages, the pass thru audio isn’t a thing that affects 90% of users, just those that stream movies from local storage systems and use higher end audio systems. I’ve seen someone suggest some valid sounding reasons why Apple might not want to implement this, but honestly I don’t know enough to say it was valid.\n\nOnly reason I know is because It’s one of the only gripes about ATV.",
                      "score": 11,
                      "created_utc": 1736395509.0,
                      "replies": [
                        {
                          "id": "m693p40",
                          "author": "GreenRocketman",
                          "body": "Hardware hasn’t been updated in five years but Shield is still getting OS updates as recently as 2024. The fact the hardware is as dated as it is and it still outperforms every other device in most categories speaks for itself.",
                          "score": 2,
                          "created_utc": 1736442462.0,
                          "replies": [
                            {
                              "id": "m6aqpt0",
                              "author": "temp1876",
                              "body": "The only area it Outdoes the ATV is audio pass-thru per owners of both. \n\nPersonally if you've invested the money in audio to care about audio-pass thru, owning both is not going to hurt your budget. If you sank $8k in your home theater and are worried about the cost of a $150 ATV, you are bad at math",
                              "score": 2,
                              "created_utc": 1736459610.0,
                              "replies": [
                                {
                                  "id": "m6ar7eo",
                                  "author": "GreenRocketman",
                                  "body": "This was more in response to the claim it hasn’t been updated in years than saying it’s better than ATV. It does still get updated and it’s still a top-end device.",
                                  "score": 2,
                                  "created_utc": 1736459754.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m651bzk",
                      "author": "Ruttagger",
                      "body": "Ah, sorry to nerd out, haha.\n\nApple TV is probably best for the majority ofnuser, Netflix, Hulu, Disney +, etc.\n\nIt lacka a few keys features for people like me who run Plex and my own Media Server with a big home theater system.\n\nIt makes me mad because thr Apple TV has better internals for having a snappier UI and stuff like that.  I hope the new one has everything I need so I can give it a go.",
                      "score": 4,
                      "created_utc": 1736380423.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m660kw1",
                  "author": "JoeyBigtimes",
                  "body": "Having all the advertising in the OS sucked the fun out of the shield for me.",
                  "score": 7,
                  "created_utc": 1736392641.0,
                  "replies": [
                    {
                      "id": "m66u6t1",
                      "author": "Ruttagger",
                      "body": "Ya me too, but they all have ads now.\n\nI installed Projectivy.  So now when I turn my Shield on it just launches right into Plex.\n\nIf I back out of Plex the main page is just a wallpaper, and two apps, Plex and F1TV, nothing else.  Its the cleanest UI I've ever experienced.",
                      "score": -2,
                      "created_utc": 1736406404.0,
                      "replies": [
                        {
                          "id": "m67ly27",
                          "author": "_sharpmars",
                          "body": "tvOS doesn’t have ads",
                          "score": 10,
                          "created_utc": 1736423569.0,
                          "replies": [
                            {
                              "id": "m68m4a3",
                              "author": "Ruttagger",
                              "body": "Not sure what you mean.\n\nDo you mean ising your smart tv as a player, because that's the absolute worst experience out there.",
                              "score": -1,
                              "created_utc": 1736437275.0,
                              "replies": [
                                {
                                  "id": "m68n2mz",
                                  "author": "_sharpmars",
                                  "body": "tvOS is the Apple TV’s operating system",
                                  "score": 7,
                                  "created_utc": 1736437565.0,
                                  "replies": [
                                    {
                                      "id": "m68nige",
                                      "author": "Ruttagger",
                                      "body": "Oh ok, well it's goodnto know that there is no ads at least.\n\nAll the other players have forced tiles for shows or apps that I have no interest in.\n\nIf the new Apple TV offers full audio support ill probably check one out.",
                                      "score": 1,
                                      "created_utc": 1736437699.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m65xeef",
                  "author": "cockyjames",
                  "body": "I actually tried out projectivity, but it feels kind of hacky because the base launcher loads up then Projectivity on top of it.\n\nIf the launcher could be switched out entirely like mobile, that would be best case scenario.\n\nI will say “Apps Only” mode on Google TV gets closer to the experience of Apple TV. It’s bearable. But I also don’t know if Google will feel the need to pull it away eventually \n\nI get the passthrough audio thing for a very specific subset. But it is pretty niche. I collect physical, and use my Apple TV for apps. So I was always going to have compressed audio streaming. And I’m using actual physical media if I want uncompressed audio and best picture",
                  "score": 0,
                  "created_utc": 1736391466.0,
                  "replies": [
                    {
                      "id": "m66ueyp",
                      "author": "Ruttagger",
                      "body": "Oh weird, I didnt have thay experience with Projectivy at all.\n\nI have it setup so when I turn my Shield on ot goes right into Plex, I don't see anything else.\n\nIf I back oit of Plex, the main screen is just a wallpaper with two apps, Plex and F1TV. \n\nIt's the cleanest UI I've ever used.",
                      "score": 3,
                      "created_utc": 1736406536.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m69wftq",
          "author": "Odd_Detective_7772",
          "body": "Na Apple have been pretty consistent in not fucking around with privacy or trying to nickel and dime people with new “ad free” tiers. \n\nWould be shocked if they changed tack to knock $20 off the price of a streaming device",
          "score": 6,
          "created_utc": 1736450754.0,
          "replies": []
        },
        {
          "id": "m6a6soe",
          "author": "parker1019",
          "body": "Self curated content with media servers is a better investment….",
          "score": 1,
          "created_utc": 1736453775.0,
          "replies": [
            {
              "id": "m6a8xvp",
              "author": "cockyjames",
              "body": "I am a father of two. I don’t have time for that any more. I also don’t want the hassle of ripping 4K Blu-rays",
              "score": 6,
              "created_utc": 1736454399.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m61wyyb",
      "author": "chrisdh79",
      "body": "From the article: Bloomberg's Mark Gurman last month reported that the new Apple TV and the new HomePod mini will be equipped with Apple's own combined Wi-Fi and Bluetooth chip. Gurman said the chip supports Wi-Fi 6E, so that could end up being a key upgrade for both devices. Wi-Fi 6E extends the capabilities of Wi-Fi 6 to the 6 GHz band, enabling faster wireless speeds and reduced signal interference with a compatible router.\n\nThe current Apple TV from October 2022 supports Wi-Fi 6, and the upgrade to Wi-Fi 6E seems likely. It is unclear if the Wi-Fi 6E capability will be enabled in the next HomePod mini, however, as Apple has generally kept its HomePod speakers on older Wi-Fi versions. For example, the current HomePod mini supports outdated Wi-Fi 4.\n\nUnsurprisingly, the next Apple TV is also expected to be equipped with a newer A-series chip for faster performance. The current Apple TV is equipped with the A15 Bionic chip that debuted in the iPhone 13 models in 2021. Apple has released several newer A-series chips since then, including the A16 Bionic, A17 Pro, A18, and A18 Pro.\n\n\nThe next Apple TV could have lower pricing. Apple analyst Ming-Chi Kuo suggested that the next model could have a sub-$100 starting price. In the U.S., the current Apple TV is available with 64GB or 128GB of storage for $129 and $149, respectively.\n\nNo major design changes have been rumored for the next Apple TV, but Gurman said Apple has considered adding a built-in camera to a future model. tvOS 17 added a FaceTime app to the Apple TV, allowing for users to have video calls by using the rear camera on a connected iPhone or iPad. If the Apple TV gained a built-in camera, users would no longer need to rely on an external device for video calls on the TV.",
      "score": 47,
      "created_utc": 1736346510.0,
      "replies": [
        {
          "id": "m636nku",
          "author": "paco_dasota",
          "body": "wifi 4 on a homepod isn’t outdated it’s just a lower spec, i mean for an appliance that is basically just a speaker i don’t see what it gains from wifi 6 other than to stream more of your data back to apple quicker",
          "score": 41,
          "created_utc": 1736360515.0,
          "replies": [
            {
              "id": "m66qls3",
              "author": "Ogediah",
              "body": "Off the top of my head? It’s a home hub so local networking will be stronger due to more channels. More devices, more speed, etc.",
              "score": 6,
              "created_utc": 1736404376.0,
              "replies": []
            },
            {
              "id": "m67ifby",
              "author": "PhotoSpike",
              "body": "But. But. What if I want more then 60 simultaneous hi res audio streams to my HomePod",
              "score": 3,
              "created_utc": 1736421640.0,
              "replies": []
            },
            {
              "id": "m638ijj",
              "author": "Seinfish",
              "body": "Let me introduce you to a thing called WPA3",
              "score": -14,
              "created_utc": 1736361041.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m62why5",
          "author": "Layer8Pr0blems",
          "body": "If they add a camera to the device it’s finished in my house. Fire stick here I come.",
          "score": -23,
          "created_utc": 1736357574.0,
          "replies": [
            {
              "id": "m634ls6",
              "author": "Vironic",
              "body": "All it would see in my house is a dark cabinet",
              "score": 22,
              "created_utc": 1736359927.0,
              "replies": []
            },
            {
              "id": "m638nb5",
              "author": "simplycake",
              "body": "The current Apple TV is better than any fire sticks, you can just stick with that",
              "score": 19,
              "created_utc": 1736361079.0,
              "replies": []
            },
            {
              "id": "m64tnhf",
              "author": "tenemu",
              "body": "Put a piece of tape over it?",
              "score": 3,
              "created_utc": 1736377854.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m6692bt",
          "author": "Odd__Detective",
          "body": "Boooring!",
          "score": -1,
          "created_utc": 1736395981.0,
          "replies": []
        },
        {
          "id": "m64ebjl",
          "author": "tin369",
          "body": "A mute button would be nice upgrade",
          "score": -8,
          "created_utc": 1736373151.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m65q208",
      "author": "FloridaGuy2589",
      "body": "I just want a standalone camera that can be used for FaceTime with Apple TV.  Give me something that looks nice, that can sit by the tv that works when using FT.",
      "score": 10,
      "created_utc": 1736388840.0,
      "replies": []
    },
    {
      "id": "m63be5z",
      "author": "Mooselotte45",
      "body": "They currently let you use 2 HomePod minis (or standard HomePods) for audio on your Apple TV \n\n\nWould love to have the opportunity to add more channels with more minis, or combinations of HomePods and minis. \n\nCould make a little 5.1 esque set up for fairly cheap (used HomePod minis are basically free on FB)",
      "score": 12,
      "created_utc": 1736361870.0,
      "replies": [
        {
          "id": "m66zgvf",
          "author": "Aisher",
          "body": "I used this and it sounded great, but was always disconnected and a pain. I went with a Samsung sound bar with my new Samsung TV and it just works (fiber cable) \n\nWe only use the Apple TV and gaming consoles - the smart TVs have never been on the internet",
          "score": 3,
          "created_utc": 1736409601.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m62vzrg",
      "author": "TheMacMan",
      "body": "Post could really do without the MacRumors clickbait headline.",
      "score": 21,
      "created_utc": 1736357425.0,
      "replies": []
    },
    {
      "id": "m6504cg",
      "author": "Ruttagger",
      "body": "If this new Apple TV still doesn't passthrough all the audio formats ill be so annoyed.\n\nHow does the 6 year old Nvidia Shield still shit kick all these boxes out there.",
      "score": 9,
      "created_utc": 1736380017.0,
      "replies": [
        {
          "id": "m67u15z",
          "author": "someguy50",
          "body": "Yeah this is my main complaint too. Just pass the fucking data through jfc ",
          "score": 4,
          "created_utc": 1736427388.0,
          "replies": [
            {
              "id": "m68m7pr",
              "author": "Ruttagger",
              "body": "Fingers crossed this new version does.",
              "score": 1,
              "created_utc": 1736437304.0,
              "replies": [
                {
                  "id": "m692z9u",
                  "author": "someguy50",
                  "body": "I’ll be upgrading without hesitation if it does. Infuse bandaid shouldn’t be needed with such capable hardware ",
                  "score": 1,
                  "created_utc": 1736442252.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m62e0m0",
      "author": "therealmoogieman",
      "body": "Wish so much for an Apple TV with a fire stick form factor when travelling",
      "score": 13,
      "created_utc": 1736351994.0,
      "replies": [
        {
          "id": "m62weit",
          "author": "incubuster4",
          "body": "Honestly, that is not a bad idea. I have purchased enough movies & boxsets through apple/appletv that I rewatch, that I would love to be able to download for rewatching since my internet has data limits, I would buy a 256G if they made one (and allowed you to download your purchased movies on it) If they aren’t going to do that, they should just make it in a smaller version. Hell, they could make different Air/Pro versions.",
          "score": 5,
          "created_utc": 1736357546.0,
          "replies": []
        },
        {
          "id": "m63xms7",
          "author": "Tasty-Traffic-680",
          "body": "An iPhone mainboard assembly is roughly the size of a stick of gum. I don't see why they couldn't do a stick/dongle form factor",
          "score": 2,
          "created_utc": 1736368326.0,
          "replies": [
            {
              "id": "m645lfe",
              "author": "Wamadeus13",
              "body": "Because Apple likes its products to be seen. Gum stick style devices get put behind the tv and forgotten about. A larger box with no good way to mount or hide it  tends to get placed some where visible and can then with the higher price tag gets to be claimed as a status symbol.",
              "score": -3,
              "created_utc": 1736370624.0,
              "replies": [
                {
                  "id": "m64ma61",
                  "author": "garylapointe",
                  "body": "Anyone who thinks their Apple TV is a status symbol needs some therapy.",
                  "score": 12,
                  "created_utc": 1736375517.0,
                  "replies": []
                },
                {
                  "id": "m6592r6",
                  "author": "tooclosetocall82",
                  "body": "The remote doesn’t require line of sight so you can very easily stuff it on a cabinet or behind something. I’m guessing they just don’t see it as a core business and don’t want to manage that many SKUs.",
                  "score": 1,
                  "created_utc": 1736383031.0,
                  "replies": [
                    {
                      "id": "m66tq80",
                      "author": "ExoMonk",
                      "body": "Yup I have mine stuck behind my TV. Have an LG C1 so the apple tv sits on top of that rear boxy thing those tvs have. Completely invisible.",
                      "score": 1,
                      "created_utc": 1736406135.0,
                      "replies": []
                    },
                    {
                      "id": "m66yeck",
                      "author": "deVliegendeTexan",
                      "body": "> don’t want to manage that many SKUs\n\nI’ve been gone from Apple for more than 20 years now, but I was there when they were simplifying their lineup coming out of the PowerMac / Performa / etc era and into G3, iMac, iBook era. This is close to the mark but not quite it.\n\nApple meticulously reviews usage down to the feature level. They know how many people use different ports on their computers. How many people perform certain kinds of upgrades. And they know how much it costs them to engineer and manufacture those features.\n\nI was there when they decided that internal PCI expansion ports were a “pro” feature and it really bothered me. But when presented with the data it was hard to object - they could show that like 95% of people never installed PCI cards, and even those who do, 95% wouldn’t install one after initial purchase of the computer. And they’d look at engineering design and manufacturing cost and be able to put a body count together with a number; “100k people paid an extra $150 each for this computer so that 100 of them could install a PCI cards 2 years later.”\n\nI wasn’t there for the soldered in RAM era, but I 100% guarantee this is what happened. It sucks, I hate not being able to upgrade my RAM, but I bet that in the grand scheme of things they realized that a bazillion people who’d never do that were paying extra for me to have that ability.\n\nWhich is all to say, I don’t think Apple is necessarily trying to reduce SKUs just because. But they know they’ll sell say 300k of them total, and it won’t be an interesting revenue stream worth all the effort needed to boot up the manufacturing chain for it.",
                      "score": 1,
                      "created_utc": 1736408950.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m6256o0",
      "author": "None",
      "body": "Is the original HomePod still a thing or is it just about the mini now?",
      "score": 1,
      "created_utc": 1736349262.0,
      "replies": [
        {
          "id": "m627gak",
          "author": "jbaughb",
          "body": "I think it was upgraded fairly recently. Maybe a year or so ago.",
          "score": 3,
          "created_utc": 1736349980.0,
          "replies": [
            {
              "id": "m6284w2",
              "author": "None",
              "body": "Is it much better than the mini?",
              "score": 1,
              "created_utc": 1736350194.0,
              "replies": [
                {
                  "id": "m62ctev",
                  "author": "Th3Batman86",
                  "body": "The bigger one gets louder and has more bass. But the mini sounds good for a mini. Way better than any Alexa if you are looking for just speaker performance.",
                  "score": 8,
                  "created_utc": 1736351638.0,
                  "replies": []
                },
                {
                  "id": "m628ajt",
                  "author": "jbaughb",
                  "body": "I don’t have details. I recall it being a minor update but you’d have to google for more info.",
                  "score": 1,
                  "created_utc": 1736350242.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m68tp77",
      "author": "Viper01MHC",
      "body": "How about they make that stupid remote findable. We lose it all the time. (If it already has this feature and I don’t know about it, fml)",
      "score": 1,
      "created_utc": 1736439547.0,
      "replies": [
        {
          "id": "m6983if",
          "author": "DontGetNEBigIdeas",
          "body": "Open your control panel, and tap on the Apple TV icon. From there, on the top right is a remote icon to let you find the remote. \n\nIt works like a water diving device and buzzes your phone and gives a visual the closer you are to it",
          "score": 1,
          "created_utc": 1736443745.0,
          "replies": [
            {
              "id": "m6uu6nh",
              "author": "Viper01MHC",
              "body": "It worked! Remote app wasn’t connecting at first because Apple TV was connected via Ethernet. As soon as I changed to WiFi (same network as A TV and phone, the remote app worked). I was able to locate the remote. \nThanks NEBigIdeas!",
              "score": 1,
              "created_utc": 1736735289.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m6azy6o",
      "author": "EvilGypsyQueen",
      "body": "I love everything apple except the home pod. I hate the interface to make lists that forces the use of apple reminders. I dislike reminders. I’ll put it in my calendar if I want a reminder.",
      "score": 1,
      "created_utc": 1736462447.0,
      "replies": []
    },
    {
      "id": "m6ejihd",
      "author": "kinisonkhan",
      "body": "Can I install Kodi on AppleTV just as easy as it is on Google TV?  No?  Pass.  Not into reliving the annoyance of my 2nd Gen AppleTV where every update wiped XBMC/Kodi and im forced to jump through a dozen hoops to get it re-installed.",
      "score": 1,
      "created_utc": 1736518059.0,
      "replies": []
    },
    {
      "id": "m628x31",
      "author": "positivcheg",
      "body": "Apple TV with camera is one more way for Apple to look at people and sniff sniff info :) Same as Siri watching.",
      "score": -22,
      "created_utc": 1736350441.0,
      "replies": [
        {
          "id": "m62rpab",
          "author": "Vresa",
          "body": "If Apple wanted to actually do this, the Apple TV would be a terrible product to get this done. \n\nBetter to use , you know, the phone that has every single detail of a person’s life, their banking information, employment details, full contact list, years and years of photos - and with them at all time?",
          "score": 15,
          "created_utc": 1736356141.0,
          "replies": [
            {
              "id": "m62rwhr",
              "author": "positivcheg",
              "body": "You aware of class action lawsuit or Apple sniffing Siri related stuff?",
              "score": -5,
              "created_utc": 1736356205.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m62dljr",
          "author": "s4lt3d",
          "body": "It does not come with a camera. It might use a paired phone’s camera but is not confirmed.",
          "score": 2,
          "created_utc": 1736351870.0,
          "replies": [
            {
              "id": "m62iwxs",
              "author": "zorn_",
              "body": "They have that new-ish \"wireless phone camera\" feature for Macs, it would make a lot of sense to do it this way rather than build a camera in. The two times a year anyone actually tries to Facetime via the Apple TV can just be done using their iPhone camera.",
              "score": 1,
              "created_utc": 1736353465.0,
              "replies": [
                {
                  "id": "m62q1eg",
                  "author": "sweeney669",
                  "body": "That’s literally already a thing.",
                  "score": 2,
                  "created_utc": 1736355570.0,
                  "replies": [
                    {
                      "id": "m62resk",
                      "author": "zorn_",
                      "body": "Yes…that’s what I was pointing out. They should use that functionality rather than putting yet another camera into another device.",
                      "score": 2,
                      "created_utc": 1736356044.0,
                      "replies": [
                        {
                          "id": "m62s0i8",
                          "author": "sweeney669",
                          "body": "They already are using that functionality in the Apple TV. \n\nAnd honestly It’s why I only use FaceTime like 2 times a year. It’s super annoying. I’d much prefer being able to plug in a usb camera or have it built in than relying on the phone/ipad",
                          "score": 2,
                          "created_utc": 1736356240.0,
                          "replies": []
                        },
                        {
                          "id": "m63jcjm",
                          "author": "s4lt3d",
                          "body": "Did you read the article in any way? They’re not putting a camera in the device.",
                          "score": 2,
                          "created_utc": 1736364164.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m62e64f",
              "author": "positivcheg",
              "body": "Currently it does not. But in the article is says that Apple TV might come with built in camera. Do you even read the linked thing? Or the first comment that pasted text from article?",
              "score": -3,
              "created_utc": 1736352040.0,
              "replies": [
                {
                  "id": "m63jz1e",
                  "author": "s4lt3d",
                  "body": "That is the AI author speculation. \n\n“allowing for users to have video calls by using the rear camera on a connected iPhone or iPad. If the Apple TV gained a built-in camera, users would no longer need to rely on an external device for video calls on the TV.”\n\nThis is obviously written by AI. It’s making things up. No human writes like this. If it had a camera people could use it.",
                  "score": 2,
                  "created_utc": 1736364342.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}