{
  "post": {
    "title": "iRobot launches eight new Roombas and finally adds lidar mapping",
    "author": "kbgames360",
    "id": "1j97rv0",
    "score": 543,
    "created_utc": 1741743432.0,
    "selftext": "",
    "num_comments": 134,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1j97rv0/irobot_launches_eight_new_roombas_and_finally/"
  },
  "comments": [
    {
      "id": "mhc9iiq",
      "author": "I0VES2SPO0GE",
      "body": "Fuck iRobot. I spent $1500 on the s9+ for the camera to fail after a year and no help from them. I probably ran it at most two times a week. Garbage.",
      "score": 258,
      "created_utc": 1741757742.0,
      "replies": [
        {
          "id": "mhd57z9",
          "author": "One_Tumbleweed_1",
          "body": "$1500?? You could have bought a bunch of cheaper roborocks that perform a lot better",
          "score": 95,
          "created_utc": 1741777184.0,
          "replies": [
            {
              "id": "mhdgyqt",
              "author": "CandyCrisis",
              "body": "It's so hard to pick a good vacuum robot. All the reviews cover is \"MAXIMUM POWER\" and I could care less. I want it to be quiet and to never get stuck. My ideal is a robot that runs every evening at 2AM but doesn't wake anyone up, avoids junk that got left on the floor, and doesn't get stuck on rugs or inside chair legs.",
              "score": 42,
              "created_utc": 1741782533.0,
              "replies": [
                {
                  "id": "mhdnarr",
                  "author": "tony__pizza",
                  "body": "Vacuum Wars on YouTube. He has hundreds of self-purchased Robot (and traditional) vacuums that he independently reviews against standardized tests. He’s constantly improving his methodologies too. One of his recent videos goes into how he’s updating his robot vacuum mopping tests because he doesn’t feel they were fair so he’s systematically going back through every robot mop and retesting them. \n\nHe also maintains a website where he ranks all robot vacuums and has various categories for budget and criteria like homes with lots of dogs or all tile or all hardwood or whatever. Incredible dude that is totally committed to a super confusing niche of gadgets. \n\nHis website’s list (presumably contains Amazon affiliate links): https://vacuumwars.com/best-vacuum-cleaners/robot-vacuums/\n\ntldr: Roborock tends to be the best brand overall and their budget options usually beat out other brands’ high end models. However, other brands may have specific patents for features/tech that specifically benefit your use case.",
                  "score": 89,
                  "created_utc": 1741784948.0,
                  "replies": [
                    {
                      "id": "mhdpm7f",
                      "author": "CandyCrisis",
                      "body": "Thanks! I'll check it.",
                      "score": 6,
                      "created_utc": 1741785762.0,
                      "replies": []
                    },
                    {
                      "id": "mhjci8p",
                      "author": "FlintStoneOran",
                      "body": "Vacuum Wars is such a great resource. One of the best reviewers I have come across and I always recommend him whenever the opportunity presents itself.",
                      "score": 1,
                      "created_utc": 1741857637.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mhgzxas",
                  "author": "correctingStupid",
                  "body": "The eufy models have a quiet mode that I run at night. I think they even have quiet models.",
                  "score": 1,
                  "created_utc": 1741820820.0,
                  "replies": [
                    {
                      "id": "mhh4f3g",
                      "author": "CandyCrisis",
                      "body": "I've still got a Neato and it has a turbo/quiet toggle but both are way too loud to run in the middle of the night.",
                      "score": 0,
                      "created_utc": 1741822228.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mhjpgpe",
                  "author": "Peter_Nincompoop",
                  "body": "So you want a vacuum, which traditionally is a very loud device because it needs to move large mounts of air in order to be effective, to have the power to clean well, and do it all by itself without getting stuck on anything despite your inaction to pickup after yourself, in the middle of the night, without waking you?\n\nGood luck with that",
                  "score": 0,
                  "created_utc": 1741864843.0,
                  "replies": [
                    {
                      "id": "mhk0iw0",
                      "author": "CandyCrisis",
                      "body": "Yeah that's what I'm looking for!\n\nI've seen low-end vacuum robots that are quiet, actually. They do an okay enough job for me, cleaning-wise. They just have the other low-end-robot issues: navigation sucks, not enough battery to do a house, they get lost, etc.",
                      "score": 4,
                      "created_utc": 1741869569.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mhdkxfk",
              "author": "Rektw",
              "body": "> roborocks\n\nLove my roborocks but the problem is the average consumer has never heard about it. People still refer to my roborock as a roomba.",
              "score": 13,
              "created_utc": 1741784072.0,
              "replies": [
                {
                  "id": "mhdo9uz",
                  "author": "RyuuKamii",
                  "body": "Roomba has kinda become the kleenex and band-aids of the robot vacuum world.",
                  "score": 33,
                  "created_utc": 1741785293.0,
                  "replies": []
                },
                {
                  "id": "mhix8ie",
                  "author": "calcium",
                  "body": "Had a stupid roomba (675 I think) that did the whole bouncing thing to clean and used it for 3ish years and it drove me nuts. It was loud, stupid, and later would be feet from the dock, refuse to see it and die from battery loss and then do the sad tone that it’s dead. \n\nGot a Roborock Q5+ from the Wirecutter article and freaking love it. Half the price of a roomba, can put it in a quiet mode, much more powerful vacuum, can tell it what rooms or how many times to clean. It’s awesome!",
                  "score": 2,
                  "created_utc": 1741847852.0,
                  "replies": []
                },
                {
                  "id": "mhnwg5z",
                  "author": "None",
                  "body": "I’ve only ever owned a Roborock and a Deebot(absolute POS do not recommend), but the Roborock is absolutely indestructible. It maps perfectly in my house, cleans great, has only gotten stuck twice in the year that I’ve had it, and empties perfectly every time. I would love to try some other brands if they weren’t so expensive, but I can’t imagine any of them working better than my Roborock Q5.",
                  "score": 1,
                  "created_utc": 1741911122.0,
                  "replies": []
                },
                {
                  "id": "mhdraog",
                  "author": "Reniconix",
                  "body": "My wife has a roborock she named Dwayne. Unfortunately kids thought Dwayne was thirsty and killed him.\n\nWe recently got a new Roomba (named by the kids Broomba, because they're so creative). She was upset I didn't buy another Roborock.\n\nBut anyway, the only reason I bought the Roomba instead was because it had a massive black Friday sale (like, 60%) on it, and it made the thing cost less than a Roborock with less features. Based on just MSRP an identical Roborock would have been $150 or $200 cheaper.",
                  "score": -4,
                  "created_utc": 1741786337.0,
                  "replies": [
                    {
                      "id": "mhfx5z0",
                      "author": "ZimGirDibGaz",
                      "body": "So which was better… kind of assumed that’s what you were getting at based on the context of the discussion you replied to…",
                      "score": 9,
                      "created_utc": 1741809307.0,
                      "replies": []
                    },
                    {
                      "id": "mhhstx6",
                      "author": "power899",
                      "body": "Lmao you guys murdered Dwayne 'The Roborock' Johnson 😂",
                      "score": 1,
                      "created_utc": 1741830220.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mhd2wov",
          "author": "ajemik",
          "body": "I've got i7 for... 6 years now I think? Still goes strong, no issues whatsoever. Sorry to hear you've had issues with 'em!",
          "score": 11,
          "created_utc": 1741775963.0,
          "replies": []
        },
        {
          "id": "mhd09fa",
          "author": "notauthorised",
          "body": "Sorry to hear that. My 600 and 800 is still going as well as the Scooba 230. I just change batteries and brushes as needed. Does this mean you do not recommend the new ones as they are not as robust as the original models? I know I will have to replace these old ones eventually. Anything you would recommend with the current model?",
          "score": 7,
          "created_utc": 1741774490.0,
          "replies": [
            {
              "id": "mhdd2j9",
              "author": "ToMorrowsEnd",
              "body": "100%. they are not anywhere like the older models.  I upgraded to eliminate emptying the bin with the tower, but it just has problems that the old one never had like getting lost for seemingly no reason at all.",
              "score": 7,
              "created_utc": 1741780915.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mhduoru",
          "author": "kurotech",
          "body": "My shark has had camera and area mapping for years and cost less than half what Roomba is charging for a self cleaning vacuum why the hell would anyone buy Roomba when the same product already exists at more than half the price",
          "score": 5,
          "created_utc": 1741787454.0,
          "replies": []
        },
        {
          "id": "mhds6q1",
          "author": "goldswimmerb",
          "body": "I have an S9+ I ordered used, their support has been amazing, they have been more than willing to send me replacement parts for free and when the replacements had issues they sent me a whole new robot for free and said to keep the old one for parts.",
          "score": 2,
          "created_utc": 1741786639.0,
          "replies": []
        },
        {
          "id": "mhf0wvs",
          "author": "WatRedditHathWrought",
          "body": "Don’t forget that after the tread wears off the s9+ tires it can’t dock and recharge. Oh, and you can’t just replace the treads, no, you have to buy new whole new wheel modules at $45 a pop. And the left one is never in stock. Fuck iRobot.",
          "score": 2,
          "created_utc": 1741800111.0,
          "replies": []
        },
        {
          "id": "mhd41g5",
          "author": "None",
          "body": "At that cost I’d rather just vacuum myself or have a fleet of the smaller ones",
          "score": 2,
          "created_utc": 1741776567.0,
          "replies": []
        },
        {
          "id": "mhda4jy",
          "author": "DeeVeeOus",
          "body": "Got an i7 that’s been great for years. It managed to rip the camera off after getting it caught under the dishwasher. Found a replacement part online and installed it pretty easily. Good as new.",
          "score": 2,
          "created_utc": 1741779600.0,
          "replies": []
        },
        {
          "id": "mhd9r0w",
          "author": "Valdie29",
          "body": "I bought a chinese robot with washing pads at black friday last year and it works like new only drawback with washing robots you need to deep clean them every 6 months or maybe more often",
          "score": 1,
          "created_utc": 1741779426.0,
          "replies": [
            {
              "id": "mhdh8fn",
              "author": "CandyCrisis",
              "body": "Don't worry, in 6 months it'll be dead and you won't need to deep clean anything.",
              "score": -8,
              "created_utc": 1741782638.0,
              "replies": [
                {
                  "id": "mhdjy4w",
                  "author": "The__Amorphous",
                  "body": "One of my Roborocks is eight years old and still works like new.",
                  "score": 3,
                  "created_utc": 1741783699.0,
                  "replies": []
                },
                {
                  "id": "mhdps8d",
                  "author": "Valdie29",
                  "body": "I don’t worry at all since all other brands are made in the same city, at the same factories, from the same ingredients with some fancy branding and costs just only twice the price to make you feel special.",
                  "score": 3,
                  "created_utc": 1741785820.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mhed58j",
          "author": "Lexx4",
          "body": "I had a i7 that had a base station failure outside of warranty and they replaced the entire i7 with their at the time top of the line unit.",
          "score": 1,
          "created_utc": 1741793263.0,
          "replies": []
        },
        {
          "id": "mhg87ea",
          "author": "Calculonx",
          "body": "I had bought their first generation one and scooba. Their customer support was terrible and I never went back.",
          "score": 1,
          "created_utc": 1741812401.0,
          "replies": []
        },
        {
          "id": "mhgzsak",
          "author": "correctingStupid",
          "body": "I was just about to ask.. do the new models still irreparably fail at exactly the one year mark?  Happened to me on two lightly used models of two generations. This company is criminal.",
          "score": 1,
          "created_utc": 1741820777.0,
          "replies": []
        },
        {
          "id": "mhdqkef",
          "author": "richcournoyer",
          "body": "Well, that’s quite unfortunate but we understand that things happen. I purchased a reconditioned I7+ last year for $250. (Yes) it has been without a doubt the best home appliance I have ever purchased. She does an amazing job twice a week and she never asks for anything other than a little juice.",
          "score": 0,
          "created_utc": 1741786089.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhbs9sz",
      "author": "sideburns2009",
      "body": "Too late. I’ve gone to Roborock (S8) and never looked back. Thing is amazing and blows both my roombas I trashed away. Aside from lacking LiDAR. They were loud as hell and the Roborock on max+ suction is half the decibels.",
      "score": 125,
      "created_utc": 1741749674.0,
      "replies": [
        {
          "id": "mhcd26c",
          "author": "sprucenoose",
          "body": ">Thing is amazing and blows both my roombas\n\nThen it's great for the roombas too!",
          "score": 58,
          "created_utc": 1741759777.0,
          "replies": [
            {
              "id": "mhd4u5o",
              "author": "jm0127",
              "body": "You usually have to pay extra for that!!",
              "score": 11,
              "created_utc": 1741776988.0,
              "replies": []
            },
            {
              "id": "mhf0bnv",
              "author": "Strokeslahoma",
              "body": "Oh my god, it's Roborock S8. She's gone from suck to blow",
              "score": 1,
              "created_utc": 1741799948.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mhcptrx",
          "author": "MRDefenestrator",
          "body": "Yeah I replaced my $300 Xiaomi vacuum with a $1700 (AUD) iRobot and it’s been dramatically worse than the Xiaomi and constantly breaks down.",
          "score": 7,
          "created_utc": 1741767881.0,
          "replies": []
        },
        {
          "id": "mhcg6zz",
          "author": "moch1",
          "body": "I have to say that my Roomba j7+ has better obstacle avoidance than my roborock s7 max ultra. As someone with pets and kids that matters more than any other feature because if it eats toys and gets stuck it does nothing. ",
          "score": 6,
          "created_utc": 1741761678.0,
          "replies": []
        },
        {
          "id": "mhdpq13",
          "author": "RosciusAurelius",
          "body": "Very happy Roborock Q8 Max owner here. It's great. Runs once or twice a week with the mop function and I barely have to do anything else.",
          "score": 1,
          "created_utc": 1741785799.0,
          "replies": []
        },
        {
          "id": "mhldqmw",
          "author": "Cheehos",
          "body": "I love my S7. Took some time to map out the house, but it runs every single night, never gets stuck, and you can hardly tell I have two poofy dogs who love to shed. \n\nI clean it out every Friday, swap out the roller once or twice a year. My last iRobot was hopeless.",
          "score": 1,
          "created_utc": 1741884745.0,
          "replies": []
        },
        {
          "id": "mhc2m23",
          "author": "jrodp1",
          "body": "1000 bucks?",
          "score": -13,
          "created_utc": 1741754184.0,
          "replies": [
            {
              "id": "mhc4diy",
              "author": "sideburns2009",
              "body": "$349.99 or $549 for self emptying etc.",
              "score": 14,
              "created_utc": 1741755050.0,
              "replies": []
            },
            {
              "id": "mhc8q6v",
              "author": "lemur1985",
              "body": "I was able to get the $1K ish one on sale. I kind of regretted it at first (cuz I’m cheap) but it’s saved me so much time over the years that I’m happy with it.",
              "score": 2,
              "created_utc": 1741757308.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mhbgbo0",
      "author": "thetalkingcure",
      "body": "shark has been doing lidar for years- wonder what took iRobot so long to catch up",
      "score": 60,
      "created_utc": 1741745304.0,
      "replies": [
        {
          "id": "mhdhrhj",
          "author": "Cheeseburger2137",
          "body": "I feel like they became a top of mind brand and decided that don't need to innovate.",
          "score": 23,
          "created_utc": 1741782848.0,
          "replies": [
            {
              "id": "mhgxyah",
              "author": "Kindly_Shoulder2379",
              "body": "Yes! I wrote them to ask when/if they will add the possibility to see in real time the cleaning progress, like roborock does and i didn’t get an answer. 8 year old roborock had this feature…",
              "score": 1,
              "created_utc": 1741820210.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mhdkblm",
          "author": "The__Amorphous",
          "body": "Everyone has been doing LIDAR for years. Roborock is actually moving on to the next navigation tech and replacing LIDAR already on their newest model.",
          "score": 9,
          "created_utc": 1741783843.0,
          "replies": [
            {
              "id": "mhfbkuc",
              "author": "huleboeren",
              "body": "What comes after LIDAR?",
              "score": 2,
              "created_utc": 1741803143.0,
              "replies": [
                {
                  "id": "mhgs39t",
                  "author": "NotAHost",
                  "body": "Computer vision + lidar. \n\nLidar isn’t the cheapest but it’s damn good. Roomba was doing the Tesla thing which is thinking because cameras are cheap and provide more info (object recognition), we gotta make them work for mapping. However it’s a lot harder and relatively computationally expensive for a cheap device. LiDAR is simple in comparison. \n\nOnce you have solid mapping, and with how cheap compute power is getting, you bring in computer vision again and start doing things like cable and poop recognition. But good mapping has to be a foundation.",
                  "score": 3,
                  "created_utc": 1741818426.0,
                  "replies": [
                    {
                      "id": "mhiy0fl",
                      "author": "calcium",
                      "body": "Musk has tried this with Tesla and I think their safety record reflects this. It’s probably fine for something like a robot vacuum where the worst issue is that it bumps into something (or falls down the stairs), but it’s a lot cheaper than lidar.",
                      "score": 3,
                      "created_utc": 1741848335.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mhcmar9",
          "author": "Kikkia",
          "body": "I robot went all in on a camera system that looked at the ceiling of the room. Not exactly sure why they did not, if they thought maybe you could add any more functionality down the line or was cheaper. But it had a bunch of drawbacks, including but not limited to working under furniture and in low light condition.",
          "score": 16,
          "created_utc": 1741765569.0,
          "replies": [
            {
              "id": "mhd1o1s",
              "author": "Daniel-Darkfire",
              "body": "So a cat couldn’t ride on iRobot till now?",
              "score": 4,
              "created_utc": 1741775289.0,
              "replies": []
            },
            {
              "id": "mhdqsmz",
              "author": "Key-Leader8955",
              "body": "They did what Elon did with tesla. Didn’t use all the tech they should have.",
              "score": 1,
              "created_utc": 1741786166.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mhe41zz",
          "author": "M-3X",
          "body": "Cost optimization \n\nSame like tesla believes they can have reliable full self driving car just with cameras without lidar. \n\nNot going to happen",
          "score": 5,
          "created_utc": 1741790439.0,
          "replies": [
            {
              "id": "mhgscmo",
              "author": "NotAHost",
              "body": "It’ll happen. The crash rate will just be 10-100x higher than a fsd car with lidar. If people are scared of planes even if they are statistically safer, I think they’ll be even more scared of fsd cars that are known to be more likely to kill you.",
              "score": 1,
              "created_utc": 1741818506.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mhh04i9",
          "author": "correctingStupid",
          "body": "They needed to engineer a way for it to fail reliably to milk customers of more money.",
          "score": 1,
          "created_utc": 1741820882.0,
          "replies": []
        },
        {
          "id": "mhbossa",
          "author": "FastFingersDude",
          "body": "Wasn’t there a patent or so they couldn’t infringe on?",
          "score": -3,
          "created_utc": 1741748331.0,
          "replies": [
            {
              "id": "mhbsiej",
              "author": "sideburns2009",
              "body": "Doubt it. Every other competing brand has had  lidar except iRobot. Eufy. Roborock. Shark. Eureka. Deebot. Wyze. List goes on.",
              "score": 27,
              "created_utc": 1741749770.0,
              "replies": [
                {
                  "id": "mhcgq3w",
                  "author": "danny12beje",
                  "body": "Hell. Xiaomi uses it.",
                  "score": 5,
                  "created_utc": 1741762008.0,
                  "replies": [
                    {
                      "id": "mhclr6r",
                      "author": "Huskan543",
                      "body": "That is not an argument speaking against the existence of a patent…",
                      "score": -7,
                      "created_utc": 1741765215.0,
                      "replies": [
                        {
                          "id": "mhcsc5n",
                          "author": "danny12beje",
                          "body": "How so, exactly? You think they can just freely infringe patents?",
                          "score": 2,
                          "created_utc": 1741769542.0,
                          "replies": [
                            {
                              "id": "mhcsj3k",
                              "author": "Huskan543",
                              "body": "Yes",
                              "score": -2,
                              "created_utc": 1741769668.0,
                              "replies": [
                                {
                                  "id": "mhd9irn",
                                  "author": "danny12beje",
                                  "body": "Can you show me when exactly Xiaomi infringed on a patent?\n\nAre you aware they invested heavily in Roborock and is pretty much the reason roborock exists?",
                                  "score": 3,
                                  "created_utc": 1741779318.0,
                                  "replies": [
                                    {
                                      "id": "mhdzloa",
                                      "author": "Huskan543",
                                      "body": "Oh great, they helped found a Chinese company in China… great success… and as for cases of patent infringement:\n\n1. 2024: FRAND lawsuit in France & India. Xiaomi is accused of using Sun Patent Trust’s standard essential patents (SEPs) concerning the use of LTE-A technology patents providing 4G communication.\n2. 2023: Huawei sued Xiaomi over patent infringement\n\nThere are a few other lawsuits against Panasonic and KPN that they won in the last year or two, as well.",
                                      "score": -1,
                                      "created_utc": 1741789025.0,
                                      "replies": [
                                        {
                                          "id": "mhebbel",
                                          "author": "danny12beje",
                                          "body": "Ah. You're one of those \"china bad\" people that's happy to pay for their overpriced as fuck made in china designed in california products.\n\nI see.\n\n\nNext show me companies that weren't sued for patent infringement at one point in their existence.\n\nThen show me how this is related to Xiaomi's robot vacuums. Thx",
                                          "score": 1,
                                          "created_utc": 1741792712.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mhbslcq",
              "author": "TapTapTapTapTapTaps",
              "body": "Pretty sure only iRobots dual brush rollers has been the only fully blocking patent",
              "score": 7,
              "created_utc": 1741749804.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mhc24vc",
          "author": "vietomatic",
          "body": "Musk worship?",
          "score": -28,
          "created_utc": 1741753956.0,
          "replies": [
            {
              "id": "mhgxj8c",
              "author": "AWF_Noone",
              "body": "Tf are you on about",
              "score": 1,
              "created_utc": 1741820084.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mhd32sn",
      "author": "PooInTheStreet",
      "body": "Overpriced garbage shit company. The data sharing policy is abysmal “no mapping unless you share your data”.",
      "score": 48,
      "created_utc": 1741776055.0,
      "replies": [
        {
          "id": "mhdizyt",
          "author": "VaztheDad",
          "body": "Did you read the terms? The data has to be shared to their cloud service so the processing can be done to build the map. That's legal jargon describing the data will be leaving your premise.",
          "score": 11,
          "created_utc": 1741783330.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhcrt2o",
      "author": "Gyat_Rizzler69",
      "body": "Literally looks like rebranded xiaomi/Dreame products",
      "score": 18,
      "created_utc": 1741769193.0,
      "replies": [
        {
          "id": "mhdnrod",
          "author": "Logikz",
          "body": "Because it is",
          "score": 3,
          "created_utc": 1741785116.0,
          "replies": []
        },
        {
          "id": "mhdj1qq",
          "author": "glemnar",
          "body": "Every one on the market looks the same anyway. They all copied off roomba in the first place ",
          "score": 0,
          "created_utc": 1741783350.0,
          "replies": [
            {
              "id": "mhdvkcg",
              "author": "Orjnd",
              "body": "They improved roomba's design. iRobot has been years asleep at the wheel living off their name until they finally decided to copy back the much more innovative chinese manufacturers.",
              "score": 4,
              "created_utc": 1741787733.0,
              "replies": [
                {
                  "id": "mhek9bj",
                  "author": "nerdshowandtell",
                  "body": "They were busy being bought by amazon.",
                  "score": -1,
                  "created_utc": 1741795333.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mhbwcft",
      "author": "poofph",
      "body": "I have the Roborock Qrevo Pro and it is so good, we had the S7 Ultra before that and the Roomba 980 before that one.  I have been really happy with Roborock and the app is pretty good too.",
      "score": 6,
      "created_utc": 1741751356.0,
      "replies": []
    },
    {
      "id": "mhdgt8f",
      "author": "RANNI_FEET_ENJOYER",
      "body": "Too late. Get outcompeted by the companies in Shenzhen.",
      "score": 3,
      "created_utc": 1741782471.0,
      "replies": []
    },
    {
      "id": "mhd630e",
      "author": "7Sans",
      "body": "Roborock is the answer for robot vacuum for most people. They are the apple in robot vacuum industry.",
      "score": 11,
      "created_utc": 1741777632.0,
      "replies": [
        {
          "id": "mhdijwy",
          "author": "allogator",
          "body": "Jeebus, I had never heard of Roborock and that website is atrocious. My Neato BotVac has been going strong for ~8 years but with them going out of business I've been looking around sporadically whenever a sale goes up. The other companies have limited models and it's generally pretty easy to compare features.  This Roborock site is like \"Here's 500 different models that all have one thing different--have fun figuring it out!\"\n\nDon't get me wrong, I've seen enough people in this post say that Roborock is amazing and I'll go dig around some more and research but I can't picture anyone with limited tech knowledge looking at this site and not backing away slowly.\n\nEDIT: (not really since I went back just to glance over the site to double check my hyperbole wasn't too insane before submitting) I did finally find a \"See all Models\"  and \"Help me Choose\" button. It was like halfway down the page and hidden in between some other blocky pictures. \"See all Models\" is still a little too janky but yeesh--they definitely need better site design.",
          "score": 5,
          "created_utc": 1741783157.0,
          "replies": [
            {
              "id": "mhdp9rp",
              "author": "Ivegotworms1",
              "body": "There's a lot of tech and features you'll need to get up to speed on if you haven't been in the market for 8 years. I thought the website was fantastic.  Unfortunately, that's the world we live in. It's going to take you several hours of reviews and videos to figure out what works best for you. If you're spending $1000 it's worth getting the right one.",
              "score": 2,
              "created_utc": 1741785643.0,
              "replies": [
                {
                  "id": "mhdqt7v",
                  "author": "allogator",
                  "body": "I work in IT--I get it. I just wish I could compare more than 3 models at a time. My monkey brain wants to see all the different checkboxes on one page\n\nEdit: oh hell, someone did most of the work for me: https://www.reddit.com/r/Roborock/comments/1c7kax7/comparison_of_models_2024/",
                  "score": 4,
                  "created_utc": 1741786171.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mhdmr9u",
      "author": "CyberSpaceInMyFace",
      "body": "I'm surprised by the comments. They already cleaned *very well* without lidar.",
      "score": 4,
      "created_utc": 1741784751.0,
      "replies": []
    },
    {
      "id": "mhbhzr2",
      "author": "andynator1000",
      "body": "8 models??? This is what happens when you put engineers in charge of product.",
      "score": 21,
      "created_utc": 1741745877.0,
      "replies": [
        {
          "id": "mhbu98z",
          "author": "None",
          "body": "No no that’s the opposite. Engineers would make one very good one and one affordable one. The marketing sales team would make a million models to target every possible demographic. Hence how Samsung used to have 30 models available for every market at any given time. Seems they’ve refined a lot in the last several years",
          "score": 112,
          "created_utc": 1741750481.0,
          "replies": [
            {
              "id": "mhc3y0s",
              "author": "cherry_chocolate_",
              "body": "It’s a ladder. You look one model up and the feature is just a little better, and before you know it you’re buying a 900 dollar vacuum that is 99% the same as the 200 dollar one.",
              "score": 20,
              "created_utc": 1741754836.0,
              "replies": [
                {
                  "id": "mhc5z91",
                  "author": "None",
                  "body": "that’s the false middle option tactic that makes you evaluate the mid option as not a good enough deal so it’s go big or go home then spend more money \n\nApple does this with the base model and upgrade pricing",
                  "score": 11,
                  "created_utc": 1741755862.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mhdodv6",
              "author": "andynator1000",
              "body": "Engineers, in my experience, tend to be unable to understand the concept of simplifying a product lines. It’s why Apple historically has reduced the number of product lines to reflect different budgets rather than features. An engineer with the choice of two different screens and three different processors would build six phones while a product team would prefer to make three with the cheaper screen going to the base model.\n\nThis explains why Intel, driven mostly by engineers, makes dozens of CPU SKUs and Nvidia, driven by product people, makes only a few SKUs.",
              "score": -1,
              "created_utc": 1741785333.0,
              "replies": [
                {
                  "id": "mhji6e3",
                  "author": "ThePretzul",
                  "body": "Nah man, speaking as an engineer myself most engineers hate the stupidly large product lineups because it means vastly more documentation and development required for a product family launch. \n\nPlus if you’re not working on the “cool” one then you just get to watch while other engineers make the fancy model with all the bells and whistles while you’re stuck in meetings with bean counters. All of whom are telling you that the parts you specced for the budget models are $0.02/unit too expensive so you need to go through an exhaustive supplier search process all over again. \n\nMost engineers would be happy to work on a single overcomplicated and over-featured model because then they get to do more interesting things, and/or a single simple model because there’s beauty in simplicity too.",
                  "score": 1,
                  "created_utc": 1741861050.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mhdnvuw",
          "author": "Logikz",
          "body": "That's what happens when you lay off half the company and buy robots from china 🙄",
          "score": 1,
          "created_utc": 1741785156.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhcl16m",
      "author": "1ns4n3_178",
      "body": "Cool but iRobot is an American company so I wouldn’t buy it.",
      "score": 16,
      "created_utc": 1741764742.0,
      "replies": [
        {
          "id": "mhg8nbu",
          "author": "Calculonx",
          "body": "And there's much better options. Their stock got killed today and it's predicted they might not last another year. So good luck with customer support.",
          "score": 1,
          "created_utc": 1741812525.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhdn986",
      "author": "kangarooham",
      "body": "better mapping than a Tesla",
      "score": 2,
      "created_utc": 1741784932.0,
      "replies": []
    },
    {
      "id": "mhdp745",
      "author": "rkaycom",
      "body": "Too little to late, they lost the market.",
      "score": 2,
      "created_utc": 1741785617.0,
      "replies": []
    },
    {
      "id": "mhe0z2k",
      "author": "rasz_pl",
      "body": "Finally American company will be able to upload more detailed map of my apartment to their servers!",
      "score": 3,
      "created_utc": 1741789451.0,
      "replies": []
    },
    {
      "id": "mhcxu5k",
      "author": "FridgeParade",
      "body": "Fuck robo vacuums, they keep breaking as soon as the warranty expires. Had it happen 3 times now and am done.",
      "score": 1,
      "created_utc": 1741773051.0,
      "replies": []
    },
    {
      "id": "mhd0wp6",
      "author": "mguaylam",
      "body": "Who?",
      "score": 1,
      "created_utc": 1741774859.0,
      "replies": []
    },
    {
      "id": "mhd51gi",
      "author": "S7relok",
      "body": "My 350€ dreame is doing better than roomba vacuum and mop cleaners\n\n\nReplaced 2 robots for one, I regret nothing",
      "score": 1,
      "created_utc": 1741777093.0,
      "replies": []
    },
    {
      "id": "mhdcwzi",
      "author": "ToMorrowsEnd",
      "body": "How about making the damned things not get stuck and hiding? WTF cant they have the app show you this at all times?",
      "score": 1,
      "created_utc": 1741780850.0,
      "replies": []
    },
    {
      "id": "mhdhwq2",
      "author": "Cheeseburger2137",
      "body": "I decided to get one about two years ago and wouldn't do it again. The damn thing can't reliably park itself at the charging station - ends up at a slightly wrong angle and the batter dies.",
      "score": 1,
      "created_utc": 1741782905.0,
      "replies": []
    },
    {
      "id": "mhdj7ho",
      "author": "enki941",
      "body": "I remember when Roomba first came out and it had zero built-in intelligence when it came to mapping. It would just bounce around randomly, often overlapping and frequently getting itself stuck in weird places for long periods of time.\n\nWhen people asked why it didn't 'map' the room or something similar, the iRobot people said they did tests, studies, etc. and randomly bouncing around aimlessly was the \"best method\" for cleaning a room. Of course that sounded like horsecrap back then, and since then they added some mapping logic and now this new lidar system. So I think the real answer is, and always has been, they either were incapable of doing it correctly or wanted to do it as cheaply as possible, and sell us an inferior, and pretty expensive, product with some marketing snake oil to spin the flaws as pros.\n\nTL;DR - They lied to us.",
      "score": 1,
      "created_utc": 1741783411.0,
      "replies": [
        {
          "id": "mhdygcr",
          "author": "buildallthethings",
          "body": "I still like the bouncing method, I just wish it could incorporate mapping to not get stuck. The new ones follow the same exact path every time and press ruts into carpet pile",
          "score": 1,
          "created_utc": 1741788666.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mheaz55",
      "author": "ZaPizzaPie",
      "body": "Good ole Palantir tech inside your home.",
      "score": 1,
      "created_utc": 1741792610.0,
      "replies": []
    },
    {
      "id": "mheuw42",
      "author": "waltertaupe",
      "body": "OK serious question - i've got a few steps down into my living room in my apartment, which is also like the largest living space in the apartment.  Short of moving it manually or a second robot vacuum...what are my options?",
      "score": 1,
      "created_utc": 1741798391.0,
      "replies": [
        {
          "id": "mhgtdvc",
          "author": "cdorny",
          "body": "Building a ramp. Or conceed your other two identified options",
          "score": 1,
          "created_utc": 1741818826.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhexz69",
      "author": "meunbear",
      "body": "My cheap ass Chinese knock off has Lidar and is like 3 years old. I honestly just assumed roomba had it.",
      "score": 1,
      "created_utc": 1741799268.0,
      "replies": []
    },
    {
      "id": "mhk99e4",
      "author": "junglehypothesis",
      "body": "Fuck iRobot. Sort your J9+ clusterfuck out before launching new products.",
      "score": 1,
      "created_utc": 1741872702.0,
      "replies": []
    },
    {
      "id": "mi6iqbh",
      "author": "Dulse_eater",
      "body": "People buy these things? Must be for the kids",
      "score": 1,
      "created_utc": 1742170962.0,
      "replies": []
    },
    {
      "id": "mhcy0kh",
      "author": "None",
      "body": "[deleted]",
      "score": 2,
      "created_utc": 1741773158.0,
      "replies": [
        {
          "id": "mhdhmv3",
          "author": "gac64k56",
          "body": "r/VacuumCleaners has no issues with suggesting $700 to $1200 vacuum cleaners. Mind you, I got a Sebo Felix Premium for under $600 and it sucks hard, it's modular, and easy to maintain (my wife has several foot long hair and cleaning the roller brush is stupidly simple).\n\nThe big thing is that good vacuum cleaners should be able to be maintained and have parts for you to repair it for the next decade or two at minimum. These expensive vacuum robots I'm not seeing to be easy to repair.",
          "score": 1,
          "created_utc": 1741782797.0,
          "replies": []
        },
        {
          "id": "mhgxvaz",
          "author": "AWF_Noone",
          "body": "$1000 is midrange in terms of pricing for robotic vacuums ",
          "score": 0,
          "created_utc": 1741820184.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhd1yvc",
      "author": "Electronic-Bear2030",
      "body": "Wake me up when they add a dog shit detection and avoidance system",
      "score": 1,
      "created_utc": 1741775457.0,
      "replies": [
        {
          "id": "mhd7ejz",
          "author": "PmMeAnnaKendrick",
          "body": "[https://www.irobot.com/en\\_US/pet-promise.html](https://www.irobot.com/en_US/pet-promise.html)",
          "score": 3,
          "created_utc": 1741778296.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhe172h",
      "author": "Ok-Ad-6119",
      "body": "This is a crap product. Constant issues from day one.",
      "score": 1,
      "created_utc": 1741789519.0,
      "replies": [
        {
          "id": "mhm5539",
          "author": "coconut_the_one",
          "body": "Had mine for 4 years, run it almost daily. One issue which costumer support handled really well.",
          "score": 1,
          "created_utc": 1741892465.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhbnl2z",
      "author": "FoodEngineer",
      "body": "Spin mops don’t do shit",
      "score": 0,
      "created_utc": 1741747879.0,
      "replies": [
        {
          "id": "mhc7b1m",
          "author": "duderguy91",
          "body": "The ones on my Roborock do pretty well.  It’s not as good as manual mopping but surprised me for in between maintenance.",
          "score": 7,
          "created_utc": 1741756547.0,
          "replies": []
        },
        {
          "id": "mhbo5hg",
          "author": "Pretend-Patience9581",
          "body": "Agreed .  I now have the wipe one and love it.",
          "score": 2,
          "created_utc": 1741748090.0,
          "replies": [
            {
              "id": "mhdw8d2",
              "author": "Orjnd",
              "body": "That's the equivalent of dragging the same dirty rag all over your house. At least the rotating mops go back to the base to clean up and dry.",
              "score": 2,
              "created_utc": 1741787946.0,
              "replies": [
                {
                  "id": "mhfkzqk",
                  "author": "Pretend-Patience9581",
                  "body": "I thought that but on my tiles it works perfect.  Has a sensor that sings out when too wet or dirty.   No it could not mop up cat shit or food spills.  But for a semi clean floor it is the way to go.",
                  "score": 1,
                  "created_utc": 1741805839.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mhbsni6",
          "author": "TapTapTapTapTapTaps",
          "body": "They buff your shit into the floor",
          "score": -2,
          "created_utc": 1741749828.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhdz441",
      "author": "Iron-Octopus",
      "body": "Do those things connect to the internet? Does the lidar data get sent anywhere?",
      "score": 1,
      "created_utc": 1741788871.0,
      "replies": [
        {
          "id": "mhgxxt2",
          "author": "AWF_Noone",
          "body": "Yes to both",
          "score": 1,
          "created_utc": 1741820206.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhe2ewr",
      "author": "Ok-Ad-6119",
      "body": "I have had a Neato for over 13 years, not a single problem. Because Neato went out of business, I got a Roomba to cover upstairs and nothing but problems from day 1.  In my last interaction, their support group offered me 10% off on a new right wheel, when it was 30% off on their website.  I thought maybe the 10% off was on top of the 30%….nope.",
      "score": 1,
      "created_utc": 1741789896.0,
      "replies": []
    },
    {
      "id": "mhd1rpi",
      "author": "Qwesttaker",
      "body": "My first robot vacuum was an Roomba that unalived itself with a trip downstairs. I replaced it with 2 cheap $100 models from Amazon that have worked just as good as it ever did.",
      "score": 0,
      "created_utc": 1741775347.0,
      "replies": []
    },
    {
      "id": "mhcst52",
      "author": "TQilla",
      "body": "Who tf needs so many different models?????",
      "score": 0,
      "created_utc": 1741769849.0,
      "replies": []
    },
    {
      "id": "mhcvmp6",
      "author": "AlienPearl",
      "body": "Too little, too late…",
      "score": 0,
      "created_utc": 1741771668.0,
      "replies": []
    },
    {
      "id": "mhd3o1a",
      "author": "drnemmo",
      "body": "It seems we have reached peak robovacuum. Is no one innovating? Mine is a Beetles that I bought for $300. It has worked flawlessly for 5 years.",
      "score": 0,
      "created_utc": 1741776369.0,
      "replies": []
    },
    {
      "id": "mhi916f",
      "author": "Cleanbriefs",
      "body": "How long before the Saudis buy Roomba servers for all the data collected using these robots and the lidar mapping of us homes? (In addition to what else spying is done by the robots) \n\nThey just bought Pokémon Go fyi. Hence the warning ",
      "score": 0,
      "created_utc": 1741835963.0,
      "replies": []
    },
    {
      "id": "mhftnh1",
      "author": "SnowdensOfYesteryear",
      "body": "Only fools buy Amazon’s consumer products. They’re shipped half baked and are basically abandoned after release",
      "score": -1,
      "created_utc": 1741808310.0,
      "replies": [
        {
          "id": "mhgthf3",
          "author": "cdorny",
          "body": "Amazon's products? That purchase fell through a year ago due to the EU and they were never acquired.",
          "score": 2,
          "created_utc": 1741818856.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhbn4pq",
      "author": "Igotdaruns",
      "body": "WHY????",
      "score": -4,
      "created_utc": 1741747711.0,
      "replies": []
    }
  ]
}