{
  "post": {
    "title": "Sony has sold 65 million PS5s",
    "author": "a_Ninja_b0y",
    "id": "1gml5pp",
    "score": 1003,
    "created_utc": 1731079753.0,
    "selftext": "",
    "num_comments": 118,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gml5pp/sony_has_sold_65_million_ps5s/"
  },
  "comments": [
    {
      "id": "lw3fgqb",
      "author": "Karash770",
      "body": "Remember the pandemic days when everyone desperately tried to get their hands on one for many months?",
      "score": 251,
      "created_utc": 1731080887.0,
      "replies": [
        {
          "id": "lw3isx3",
          "author": "9J8H",
          "body": "Weird times. Myself and one of my friends were some of the lucky few who got in on that strange Amazon affiliate link that got leaked early. Felt bad for my other gaming friends as it took them several months to get one. Then I got a PC a year later and barely use my PS5 now - wish I’d have done that from the start",
          "score": 103,
          "created_utc": 1731081866.0,
          "replies": [
            {
              "id": "lw3pobr",
              "author": "monkey_pk",
              "body": "Idk if u tried to get a decent pc at that time you'd pay like 1000$ for a 3070 alone, I kinda regret buying a new pc during those days lol",
              "score": 61,
              "created_utc": 1731083866.0,
              "replies": [
                {
                  "id": "lw3q2nn",
                  "author": "9J8H",
                  "body": "That is very true GPU prices were outrageously high at the time of the PS5 release. Ultimately though I got a build with a 3070 after it cooled off, and it was about $1200. You’re right though, the PS5 was definitely a better value (at MSRP!) at that specific time",
                  "score": 20,
                  "created_utc": 1731083981.0,
                  "replies": [
                    {
                      "id": "lw3qjuc",
                      "author": "monkey_pk",
                      "body": "My total for my pc with a 3070ti at that time was 2400$ 😭😭😭😭",
                      "score": 16,
                      "created_utc": 1731084119.0,
                      "replies": [
                        {
                          "id": "lw3sc08",
                          "author": "9J8H",
                          "body": "Fuckin scalpers man",
                          "score": 6,
                          "created_utc": 1731084629.0,
                          "replies": []
                        },
                        {
                          "id": "lw6u16s",
                          "author": "Egyptian-Mastigure",
                          "body": "Absolutely insane. I picked a 4080 super for a rack, msi z790 pro, 13700k, 32gb 7000mghz ram, and msi 1000w psu, with case and cpu cooler for $1600 less than 3 months ago. Pandemic prices were WILD.",
                          "score": 3,
                          "created_utc": 1731119797.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lw3uq4f",
                  "author": "Shadowcam",
                  "body": "I pulled the trigger on a full system build with a 2070 Super right before the COVID prices hit. It saved me a lot of headaches.",
                  "score": 5,
                  "created_utc": 1731085317.0,
                  "replies": [
                    {
                      "id": "lw3vba3",
                      "author": "monkey_pk",
                      "body": "Didn't have the money at that time, was in the process of moving. Only bought after I was done with all my expenses cuz I figured the prices won't go down that much, RIGHT? lol",
                      "score": 1,
                      "created_utc": 1731085488.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lw6c9v4",
                  "author": "None",
                  "body": "I paid 2300$ for my 3080😅, guess that'll be the norm soon enough if/when the tarrifs hit🤦",
                  "score": 1,
                  "created_utc": 1731113324.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lw4mnev",
              "author": "LevelWriting",
              "body": "I got a decent laptop and sold the ps5. Best decision of my life",
              "score": 1,
              "created_utc": 1731093481.0,
              "replies": []
            },
            {
              "id": "lw7ji6u",
              "author": "smackythefrog",
              "body": "Same except with a Series S. \n\nHadn't games much from 2013 until the Series S was announced. I figured it was cheap enough to get back in to gaming so I got one in 2022 Summer. \n\nPlayed a lot of Gamepass to catch up on old games. Then I got the itch to build my first PC. Did that earlier this year and now my S collects dust.",
              "score": 1,
              "created_utc": 1731130921.0,
              "replies": []
            },
            {
              "id": "lw3s2ue",
              "author": "Kuraeshin",
              "body": "My 500$ ps5 (disc version) would have cost about 1200$ as a PC during the early Panny D times.",
              "score": 1,
              "created_utc": 1731084557.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw3vxwv",
          "author": "blurplethenurple",
          "body": "My buddy was looking everywhere for one and he finally found someone trying to sell an unopened ps5 at store prices. He thought it was suspicious, but they organized to meet in a public spot.\n\nTurns out some guy got a PS5 for his kid as a present, but the kid did something to get in enough trouble that the dad said \"Fuck it\" and sold it to my friend at cost. And he brought the kid to watch from the car as my buddy loaded it up and drove away.",
          "score": 19,
          "created_utc": 1731085671.0,
          "replies": [
            {
              "id": "lw4cgon",
              "author": "clazaa",
              "body": "Hot damn that's a lesson the kid won't forget.",
              "score": 12,
              "created_utc": 1731090484.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw4rq3w",
          "author": "ChafterMies",
          "body": "I hope those days never return but I have a feeling the upcoming tariffs will mean an $800 PS6.",
          "score": 7,
          "created_utc": 1731095004.0,
          "replies": [
            {
              "id": "lw97005",
              "author": "opeth10657",
              "body": "That might be cheap.",
              "score": 1,
              "created_utc": 1731163795.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw70grp",
          "author": "AttilaTheFun818",
          "body": "I gave up and eventually decided I didn’t really need one.",
          "score": 3,
          "created_utc": 1731122263.0,
          "replies": []
        },
        {
          "id": "lw63jzu",
          "author": "Mr_Piddles",
          "body": "I had to win a raffle Sony ran to win the opportunity to buy one. I was both incredibly hyped *and* angry that I only got it because of the luck of the draw.",
          "score": 2,
          "created_utc": 1731110264.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw3cl99",
      "author": "Is_Kub",
      "body": "how many PS5s has Microsoft sold?? exactly!",
      "score": 520,
      "created_utc": 1731080037.0,
      "replies": [
        {
          "id": "lw3df3j",
          "author": "Hippobu2",
          "body": "Looking at the number of 360 and PS3 sold, then the number of XBO and PS4 sold, I'd argue that Microsoft probably sold 1 PS4 and PS5 for every 2 that Sony does. \n\nWhat I'm trying to say is that the total market hasn't expanded much between 360 and PS3 vs XBO and PS4; people just shifted from 360 to PS4 in droves, and MS is the reason for that.",
          "score": 107,
          "created_utc": 1731080283.0,
          "replies": [
            {
              "id": "lw3hklb",
              "author": "Elmodipus",
              "body": "Its crazy that MS had the world in their hands after the 360 and then proceeded to fumble every step afterwards.",
              "score": 113,
              "created_utc": 1731081504.0,
              "replies": [
                {
                  "id": "lw3jpk9",
                  "author": "Will_Lucky",
                  "body": "Combination of Kinect and software from both Microsoft and Sony.\n\nMicrosoft have a lot of hits on the 360 until Kinect, some after but not the same quantity.\n\nSony seemed to recover from the missteps of the PS3 about a year or so before Kinect and proceeded to release banger after banger.\n\nMicrosoft instead of pivoting double downed on Kinect for the One - as well as the whole it’s a media box not a console obsession. Mistake after mistake they just never recovered from.",
                  "score": 75,
                  "created_utc": 1731082134.0,
                  "replies": [
                    {
                      "id": "lw3uvp5",
                      "author": "Edofero",
                      "body": "Funny as that's exactly what Yahoo did - they desperately wanted to be seen as a media company and not a tech company. Then Google, which focused on tech just blew them away. That's what happens when corporate/business leaders get in positions of power instead of tech enthusiasts.",
                      "score": 27,
                      "created_utc": 1731085361.0,
                      "replies": []
                    },
                    {
                      "id": "lw640oa",
                      "author": "orangpelupa",
                      "body": "But kinect on Xbox 360 was amazing, it even sold gang busters.\n\n\nIt's kinect on Xbox one that was a let down. ",
                      "score": 5,
                      "created_utc": 1731110426.0,
                      "replies": []
                    },
                    {
                      "id": "lw4ih9f",
                      "author": "GrayDaysGoAway",
                      "body": "> Sony...proceeded to release banger after banger.\n\nAnd now they've almost entirely stopped doing that. Their lineup this gen is absolutely pathetic. Hopefully M$ can capitalize and bring some actual competition back to the console market.",
                      "score": -6,
                      "created_utc": 1731092245.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lw3q7vj",
                  "author": "Bloatfizzle",
                  "body": "Their Xbox One E3 conference is a 5 minute ted talk on how to tank a company.\n\n\nThey introduced digital games too soon and from that point on so many people chose PS4 and stayed within the ecosystem.",
                  "score": 27,
                  "created_utc": 1731084023.0,
                  "replies": [
                    {
                      "id": "lw4rxv7",
                      "author": "Nick85er",
                      "body": "Lol with a shitty optional/proprietary 20GB HDD.\n\n\nPepperidge Farm remembers.",
                      "score": 5,
                      "created_utc": 1731095070.0,
                      "replies": []
                    },
                    {
                      "id": "lw56cvb",
                      "author": "None",
                      "body": "Yeah, the mandatory Kinect and used game restrictions really killed their momentum and they ended up folding on both of those things, so it was completely pointless.\n\nI disagree about the second part, though. The superiority of Xbox Live during the PS3 era is one of the big things that carried them. I honestly think that a lot of their current customers were people who bought into their ecosystem with the 360 and never left. Without the success of the 360 and Xbox Live, Xbox would be totally dead now.\n\nHad they not fumbled with the Xbox One and kept a majority of those 360 customers, I think they would be in great shape right now because the PS4 generation was the generation when the online gaming stuff became extremely important. The PS4 launched early enough that there were plenty of people who weren't so invested in the Microsoft ecosystem that they weren't willing to switch over. Tons of 360 owners bought PS4s, and that's why Microsoft is sorta fucked now.",
                      "score": 3,
                      "created_utc": 1731099450.0,
                      "replies": []
                    },
                    {
                      "id": "lw5h4sr",
                      "author": "VidE27",
                      "body": "They lost the worst generation to lose in. The PS4/XBox One gen was the first gen with the x86 ongoing platform (so future backward compatibility will be easier) and where digital download really took off. People with massive libraries collected during this era will of course stick to their platform of choice. MS should’ve stick to x86 for their x360.",
                      "score": 3,
                      "created_utc": 1731102776.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lw3uy7u",
                  "author": "NotAGingerMidget",
                  "body": "By the end of the generation the PS3 had surpassed the 360 in sales, it took a while to get going, but by the time PS4 was coming out the tides were already changing, that E3 conference just sent it in overdrive.",
                  "score": 7,
                  "created_utc": 1731085382.0,
                  "replies": [
                    {
                      "id": "lw4qfzp",
                      "author": "CaptainSnatchbox",
                      "body": "Microsoft got smoked in the 360 era by Sony too. The sales for the 360 are juiced up by people buying 2 of 3 of them because they had a 60% failure rate and no one was going to toss out all the games they bought for it. The 360 sales are bullshit to me because the number makes it seem like they had a way larger player base than they actually did.",
                      "score": 9,
                      "created_utc": 1731094622.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lw3x06w",
                  "author": "comm02",
                  "body": "I used to work for a major gaming company, it’s a truism but games sell consoles, Xbox back in the 360 days was known as “shooter box”. Shooters outsold any other genre on Xbox by a huge amount so much so that a lot of publishers didn’t really push out anything original on Xbox just ports. Halo, Gears, CoD were the big hitters on Xbox at the time. Xbox never diversified its base audience and when it fumbled Halo there was no reason to stick around on Xbox as the shooter genre was evolving.\n\nAlso gen z and gen a consume games differently than millennials and older. They only play two or three games but they invest a ton of time into the game and spend a lot on that game (think Fortnite, Roblox CoD). This is dangerous for console makers as it lowers the number of games sold on a console. \n\nMy hot take (got no evidence) is that the console user base is greying out and the younger generations aren’t buying enough games to sustain the typical console model going forward.\n\nI call one more generation of standalone Xbox hardware and two more generations of standalone PlayStation hardware before consoles move to a lower cost thin client/cloud based and byod model",
                  "score": 24,
                  "created_utc": 1731085982.0,
                  "replies": [
                    {
                      "id": "lw57a0g",
                      "author": "None",
                      "body": "People keep hyping the Cloud, but I just don't think it'll ever happen. People don't want to need to be online 100% of the time to play games, necessarily, and the latency issues will never totally be solved. \n\nBut, I could be wrong.",
                      "score": 6,
                      "created_utc": 1731099727.0,
                      "replies": [
                        {
                          "id": "lw60c98",
                          "author": "CompletelyRandy",
                          "body": "I was under the same impression till I used it. My TV comes with Xbox Game Pass, just connect my controller and I'm playing Forza 5 in a few seconds. Granted, it's as good as my gaming PC, but it certainly replaced a console for me. I have no real issues, apart from a small stutter here and there. \n\nI do only use it for light use, my main gaming is done on my PC.",
                          "score": 1,
                          "created_utc": 1731109134.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lw6d4v7",
                      "author": "craftsta",
                      "body": "nah. only because there will always be a market for a 'prepackaged gaming PC' and who better to deliver it than the games companies that exist (and even new entrants like Steam). Cloud won't work without serious infrastructure adoption of edge computing tech in a way that's almost certainly more than a decade away. So hey, maybe you are right after all.",
                      "score": 3,
                      "created_utc": 1731113628.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lw4r21l",
                  "author": "ChafterMies",
                  "body": "As soon as I saw the E3 2013 presentation, I knew Xbox One would be a failure. If they at least had backwards compatibility at launch, they might have kept another ten million gamers in their ecosystem.",
                  "score": 4,
                  "created_utc": 1731094806.0,
                  "replies": []
                },
                {
                  "id": "lw4e89t",
                  "author": "Realistic_Condition7",
                  "body": "Kinda unfortunate too because I think they make a great product, but PS4 was the worst generation to lose, because that was the rise of digital gaming, which locks you into an ecosystem, and it was also kinda the big “wall of diminishing returns” generation, so there really are no gimmicks to make people want to jump ship no matter how comparable the Xbox is unless Sony just fucks everything up.",
                  "score": 3,
                  "created_utc": 1731091000.0,
                  "replies": []
                },
                {
                  "id": "lw3kc6s",
                  "author": "The_Retro_Bandit",
                  "body": "More like after Halo 3. Exclusived slowed down after that and none of them made the same cultural waves. Then Sony exclusives started ramping up to the point where PS3 actually overtook the 360 near the end of their life cycles.",
                  "score": 4,
                  "created_utc": 1731082318.0,
                  "replies": []
                },
                {
                  "id": "lw3rfiw",
                  "author": "tanbug",
                  "body": "Gamers just WANNA WATCH FOOTBALL! YEAH!",
                  "score": 2,
                  "created_utc": 1731084372.0,
                  "replies": []
                },
                {
                  "id": "lw61iwt",
                  "author": "Tasty01",
                  "body": "What’s really crazy is that Phil Spencer still hasn’t been fired. His tenure as head of Xbox can only be called gross mismanagement. For some reason they keep letting him burn money and drill their brand deeper and deeper into the ground. The guy literally admitted to giving up on the console for fucks sake.",
                  "score": 2,
                  "created_utc": 1731109550.0,
                  "replies": []
                },
                {
                  "id": "lw94n5f",
                  "author": "Husbandaru",
                  "body": "Yeah but what about being able to watch TV!?",
                  "score": 1,
                  "created_utc": 1731162926.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lw447xa",
              "author": "Appropriate_Status42",
              "body": "ms xbone reveal in 2013 doomed the brand. Initraly they wanted you to be always online, and with no ability to share physical copy of the game.",
              "score": 2,
              "created_utc": 1731088076.0,
              "replies": []
            },
            {
              "id": "lw8ydal",
              "author": "Mammoth_Elk_3807",
              "body": "Precisely what I did. Moved to PS4 after owning an XBOX360 and remained with Sony. Games just seemed better.",
              "score": 1,
              "created_utc": 1731160473.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw3im6k",
          "author": "mackinoncougars",
          "body": "7",
          "score": 6,
          "created_utc": 1731081812.0,
          "replies": []
        },
        {
          "id": "lw52otf",
          "author": "twigboy",
          "body": "Microsoft helped sell a lot of PS5s with their incredibly humble Xbox one debut and amazing exclusives catalogue",
          "score": 0,
          "created_utc": 1731098347.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw3u38z",
      "author": "Bexewa",
      "body": "GTA 6 will push these numbers like crazy, they still have a decent amount of people on ps4",
      "score": 98,
      "created_utc": 1731085133.0,
      "replies": [
        {
          "id": "lw3whba",
          "author": "None",
          "body": "Yep. GTA VI will be the turning point when the remaining holdouts switch over.",
          "score": 36,
          "created_utc": 1731085828.0,
          "replies": [
            {
              "id": "lw4ipg4",
              "author": "i0datamonster",
              "body": "It's what I'm waiting for TBH",
              "score": 9,
              "created_utc": 1731092312.0,
              "replies": []
            },
            {
              "id": "lw701bo",
              "author": "xRolocker",
              "body": "Yea I’m on this boat. Wanted to go for the pro but they priced me out of it.",
              "score": 2,
              "created_utc": 1731122090.0,
              "replies": [
                {
                  "id": "lw71qdc",
                  "author": "keyboardman1",
                  "body": "Will it still look good on PS5?",
                  "score": 1,
                  "created_utc": 1731122775.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lw54s2o",
          "author": "ariphron",
          "body": "If the regular ps5 goes on sale Black Friday for $350 I will finally pull the trigger. Until then ps4 it is.",
          "score": 6,
          "created_utc": 1731098977.0,
          "replies": []
        },
        {
          "id": "lw7k59s",
          "author": "JLR-",
          "body": "I'm happy with my PS4 and my backlog.  No PS5 exclusives out there so far that compels me to get a PS5",
          "score": 2,
          "created_utc": 1731131265.0,
          "replies": [
            {
              "id": "lw9eikr",
              "author": "TheLastFromHumanity",
              "body": "Same. Only GTA or Uncharted would have me get one",
              "score": 2,
              "created_utc": 1731166418.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw4sw4u",
          "author": "hurshy",
          "body": "I doubt it cause ps6 releases like 2 years after gta6",
          "score": 2,
          "created_utc": 1731095354.0,
          "replies": []
        },
        {
          "id": "lw6a9n2",
          "author": "diN1337",
          "body": "I think gta6 will run like ass on PS5. Just like gta5 did on PS3, so I kinda doubt that much people will buy PS5/pro for it. Maybe if they are clueless...",
          "score": -4,
          "created_utc": 1731112616.0,
          "replies": []
        },
        {
          "id": "lw4r3lh",
          "author": "CaptainSnatchbox",
          "body": "Eh, too early to tell but violent games could be banned in America soon and that will hurt the numbers.",
          "score": -12,
          "created_utc": 1731094819.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw3jzys",
      "author": "Thissssguy",
      "body": "Is that a lot?",
      "score": 31,
      "created_utc": 1731082218.0,
      "replies": [
        {
          "id": "lw3obmx",
          "author": "nutbarski",
          "body": "I mean it \\*is\\* a lot but the PS4 sold like 92 million in the same 4 year span- of course there's a bunch of external factors and the fact that the PS5 was expensive on launch and even got a price increase down the line; 9th gen consoles exist in a really weird place...",
          "score": 10,
          "created_utc": 1731083474.0,
          "replies": [
            {
              "id": "lw3p90q",
              "author": "Darkone539",
              "body": ">but the PS4 sold like 92 million in the same 4 year span\n\nhttps://sonyinteractive.com/en/press-releases/2017/playstation4-sales-surpass-604-million-units-worldwide/\n\nNo it did not",
              "score": 67,
              "created_utc": 1731083744.0,
              "replies": [
                {
                  "id": "lw3wli5",
                  "author": "nutbarski",
                  "body": "Oh I forgot the PS4 launched late 2013 lol  \n  \nStill the PS5 lags behind PS4 in sales at around this time of year in 2017: [https://sonyinteractive.com/en/press-releases/2017/playstation-4-sales-surpass-706-million-units-worldwide/](https://sonyinteractive.com/en/press-releases/2017/playstation-4-sales-surpass-706-million-units-worldwide/)",
                  "score": 3,
                  "created_utc": 1731085861.0,
                  "replies": [
                    {
                      "id": "lw48p86",
                      "author": "propheticuser",
                      "body": "That’s from December 3 2017, they still have a month to make up for it, and its the holiday months so probably they will.",
                      "score": 16,
                      "created_utc": 1731089377.0,
                      "replies": []
                    },
                    {
                      "id": "lw5caex",
                      "author": "None",
                      "body": "PS5 is outpacing the PS4 in the US, and will probably out pace it world wide after the holiday season.",
                      "score": 5,
                      "created_utc": 1731101285.0,
                      "replies": [
                        {
                          "id": "lw5tj9q",
                          "author": "DoombroISBACK",
                          "body": "It will not outpace it worldwide, their forecast pretty much confirms that",
                          "score": 2,
                          "created_utc": 1731106785.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lw3p5hf",
          "author": "kurttheflirt",
          "body": "The switch has sold 146 million. So yes and no.",
          "score": -15,
          "created_utc": 1731083716.0,
          "replies": [
            {
              "id": "lw3yqcx",
              "author": "Aaronspark777",
              "body": "The switch is also a 7 year old console and sold similar numbers within the same 4 year time span the PS5 has been out.",
              "score": 6,
              "created_utc": 1731086486.0,
              "replies": [
                {
                  "id": "lw47159",
                  "author": "Shifujju",
                  "body": "The Switch sold over 80 million in its first 4 years. I wouldn't say an extra 25% is similar numbers.",
                  "score": 4,
                  "created_utc": 1731088885.0,
                  "replies": [
                    {
                      "id": "lw581y1",
                      "author": "None",
                      "body": "Yeah, but it's in a pretty different category, honestly. It's the mid-way point between a handheld and a proper console. Nintendo basically combined their two income streams into one. It was a pretty huge success, but they cannibalized their Gameboy/DS business in order to make it happen.\n\nIt was also $100 cheaper than the other consoles at launch, which really helped.\n\nIn any event, I think comparing it to the PS4/PS5 and the Xbox line is an apples-to-oranges comparison.",
                      "score": 10,
                      "created_utc": 1731099962.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lw46v9b",
      "author": "Bottomless-Paradise",
      "body": "Will easily get pushed over 70 million too once GTA 6 releases. Ps5 pro is already being touted as the “definitive” console to play it on.",
      "score": 5,
      "created_utc": 1731088837.0,
      "replies": []
    },
    {
      "id": "lw3fyxc",
      "author": "kubeeor",
      "body": "One for each year reaching back to the dinosaurs. Why do I feel like this needs to be pointed out?",
      "score": 12,
      "created_utc": 1731081036.0,
      "replies": []
    },
    {
      "id": "lw3xzu8",
      "author": "SnagglepussJoke",
      "body": "I still can’t afford one",
      "score": 15,
      "created_utc": 1731086269.0,
      "replies": [
        {
          "id": "lw736ur",
          "author": "TheThousandMasks",
          "body": "Just wait till that Trump Tariff hits and it’s 20-40% more expensive!",
          "score": 14,
          "created_utc": 1731123375.0,
          "replies": []
        },
        {
          "id": "lw49bc8",
          "author": "agrias_okusu",
          "body": "Same.",
          "score": 2,
          "created_utc": 1731089558.0,
          "replies": [
            {
              "id": "lw4lziq",
              "author": "Kenox88",
              "body": "I can afford to buy the console but not to play on it (PS Plus, expensive games..)",
              "score": 3,
              "created_utc": 1731093284.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lw7iuut",
      "author": "MediumToblerone",
      "body": "Just 4 million to go",
      "score": 2,
      "created_utc": 1731130579.0,
      "replies": []
    },
    {
      "id": "lw3y61h",
      "author": "Tatsusan",
      "body": "Delivered not sold^^",
      "score": 0,
      "created_utc": 1731086320.0,
      "replies": [
        {
          "id": "lw7db9c",
          "author": "OceanCarlisle",
          "body": "Sony sold those “deliveries” to the retailers, so yes, Sony sold 65 millions PS5s. Whether or not there are 65 million in homes is not really Sony’s concern at this point, that will only matter if sales stagnate.",
          "score": 5,
          "created_utc": 1731127857.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw7so6o",
      "author": "q_bric",
      "body": "Ok.",
      "score": 1,
      "created_utc": 1731136226.0,
      "replies": []
    },
    {
      "id": "lw89vcz",
      "author": "ethan1203",
      "body": "Waiting for pro sales",
      "score": 1,
      "created_utc": 1731147579.0,
      "replies": []
    },
    {
      "id": "lw8v8t9",
      "author": "AK_Sole",
      "body": "That’s $32.5 billion. Wow.",
      "score": 1,
      "created_utc": 1731159196.0,
      "replies": []
    },
    {
      "id": "lw3ce1a",
      "author": "oneupme",
      "body": "I've had a PlayStation since the PS2. Sony has been doing a great job on these consoles. Very consistently market-leading.\n\nEdit, oh geezus, really? Down voted for praising a successful product line?",
      "score": -7,
      "created_utc": 1731079977.0,
      "replies": [
        {
          "id": "lw3gg11",
          "author": "Cactuszach",
          "body": "Why does this sound like a bot wrote it?",
          "score": 41,
          "created_utc": 1731081176.0,
          "replies": []
        },
        {
          "id": "lw3e2y5",
          "author": "reddit_and_forget_um",
          "body": "eh, lets not forget how shitty ps3 started out. The weird creepy baby advertising.\n\n  \nSony dropped the ball pretty hard for a bit - but they learnt and got better. Honestly feels like they need another kick in the pants, but unfourtunitly with xbox slacking so bad, there is no reason for Sony to shake things up.",
          "score": 12,
          "created_utc": 1731080479.0,
          "replies": [
            {
              "id": "lw44dxd",
              "author": "oneupme",
              "body": "I don't know… I had a launch PS3 60GB and felt that it was overall a strong ownership experience. I did also have an XBOX 360 but preferred the PS3.",
              "score": 4,
              "created_utc": 1731088124.0,
              "replies": [
                {
                  "id": "lw5a2xp",
                  "author": "None",
                  "body": "The 360 was better early in the generation, I think, and usually had better multi-platform games like GTA, but Sony picked up steam later one when they were able to get out a bunch of must-play exclusives like Uncharted and TLOU.\n\nI owned both machines at various points. Early PS3 was sorta a shit show. To Sony's credit, though, they were able to turn it around and tie it up late in the generation. Both were great machines, ultimately.",
                  "score": 1,
                  "created_utc": 1731100579.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lw3iwzj",
              "author": "Elmodipus",
              "body": "Also, being almost twice the price of the 360.",
              "score": 2,
              "created_utc": 1731081900.0,
              "replies": [
                {
                  "id": "lw59mwy",
                  "author": "None",
                  "body": "I remember picking up a used 360 off of Craigslist for dirt cheap like... 2-3 years after launch.\n\nI don't even remember how cheap it was... I want to say, like... $120... I basically made the guy show it to me because I was convinced it was a scam to pick up a next-gen console at that price.\n\nThen I went home and got lost in GTA IV. Great purchase, that 360 was.\n\nI think the Series S is a similar machine. You can get a next-gen experience and buy them dirt cheap (Like... $120-$150) on the used market these days if you're not particularly picky about graphical fidelity.",
                  "score": 2,
                  "created_utc": 1731100444.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lw3e2bd",
          "author": "hajpero1",
          "body": "You must be sad there's no new games on ps2 anymore huh?",
          "score": -7,
          "created_utc": 1731080473.0,
          "replies": [
            {
              "id": "lw3i5nx",
              "author": "Limp-Development7222",
              "body": "Yes",
              "score": 2,
              "created_utc": 1731081675.0,
              "replies": []
            },
            {
              "id": "lw44ofz",
              "author": "oneupme",
              "body": "What's funny is that I found my PS2 games and game saves a couple of months ago. I am thinking of getting a PS2 console and marvel at my Gran Tourismo garage collection again.",
              "score": 1,
              "created_utc": 1731088209.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw6cj6p",
          "author": "mehemynx",
          "body": "Nah, the ps3 launched as a clusterfuck. And their rampant hatred of crossplay delayed it for years. They definitely did some things good though, and didn't shit the bed nearly as hard as xbox.",
          "score": -1,
          "created_utc": 1731113416.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw4nxcg",
      "author": "werdnaman5000",
      "body": "Great now someone give us SW Battlefront 3 pleeeeease",
      "score": 1,
      "created_utc": 1731093866.0,
      "replies": []
    },
    {
      "id": "lw3s3ld",
      "author": "K4105",
      "body": "notice how they’re not saying how many games…",
      "score": -9,
      "created_utc": 1731084563.0,
      "replies": [
        {
          "id": "lw4m53s",
          "author": "JayBayes",
          "body": "Jeez, if you click the link. It literally says \"It also sold 77.7 million games last quarter, up 10 million year over year.\" Under the heading.\n\nWhat dumbass point are you even trying to make?",
          "score": 18,
          "created_utc": 1731093330.0,
          "replies": [
            {
              "id": "lwdxvd5",
              "author": "K4105",
              "body": "playstation got no games",
              "score": 1,
              "created_utc": 1731229531.0,
              "replies": [
                {
                  "id": "lwkc7b3",
                  "author": "JayBayes",
                  "body": "Oh damn, what the fuck have I been playing on mine then?",
                  "score": 1,
                  "created_utc": 1731324131.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lw6dyii",
              "author": "hunka130",
              "body": "I think they might mean exclusives. And I’m not talking exclusive to PlayStation. I mean exclusive to next gen. Most of the games this generation run on ps4 and 5. Feels like developers have to hold back due to the install base being low. \n\nMaybe this will convince people to make games with the PS5 in mind. ",
              "score": -6,
              "created_utc": 1731113919.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw4ka5e",
          "author": "IDONTGIVEASHISH",
          "body": "How many games what?",
          "score": 1,
          "created_utc": 1731092781.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw3npjn",
      "author": "Keltoigael",
      "body": "64 million of those are in scalper Warehouses.",
      "score": -8,
      "created_utc": 1731083299.0,
      "replies": [
        {
          "id": "lw3u2ko",
          "author": "Gatlindragon",
          "body": "Bro is still living in 2020.",
          "score": 13,
          "created_utc": 1731085127.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw8gk03",
      "author": "Main-Examination3757",
      "body": "K",
      "score": 0,
      "created_utc": 1731151905.0,
      "replies": []
    },
    {
      "id": "lw8gm9q",
      "author": "smoke_thewalkingdead",
      "body": "Drop the fucking price. We broke out here bro. I'm not trying to pay 500 bucks for something I won't really get to use that often. And it's been out for like 4 years now. Drop the price!",
      "score": 0,
      "created_utc": 1731151944.0,
      "replies": []
    },
    {
      "id": "lw5jt6p",
      "author": "King7up",
      "body": "And I don’t own any consoles. Pc master race.",
      "score": -6,
      "created_utc": 1731103618.0,
      "replies": []
    },
    {
      "id": "lw60zyk",
      "author": "ajyahzee",
      "body": "45 mil to scalpers, good job",
      "score": -3,
      "created_utc": 1731109363.0,
      "replies": []
    },
    {
      "id": "lw4uuzn",
      "author": "Thechosenjon",
      "body": "Bet at least half of those have been resold 3-times on the used market due to gamers realizing the PS5 is a waste of a generation.",
      "score": -6,
      "created_utc": 1731095945.0,
      "replies": [
        {
          "id": "lw5kaj8",
          "author": "Nerf_Herder2",
          "body": "The load times were worth it alone. Do you not remember 2 minute loading screens in red dead 2?",
          "score": 0,
          "created_utc": 1731103772.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw5t5lu",
      "author": "EMP_Jeffrey_Dahmer",
      "body": "That is more than Xbox and Nintendo consoles combined. Sony is killing it!",
      "score": -7,
      "created_utc": 1731106659.0,
      "replies": [
        {
          "id": "lw7spar",
          "author": "LoneWolfSetz",
          "body": "Ummm this is totally wrong xD\n\n65.6 million - PS5 (released 2020)\n\n146.04 million - Nintendo switch (released 2017)\n\n28.3 million - Xbox Series X/S (released 2020)\n\nInfo from Wikipedia\n\nNintendo switch is 3rd best selling console ever\nNintendo DS is 2nd best selling console ever\nPS2 is best selling console ever\n\nI love PS2/PSX/Switch",
          "score": 5,
          "created_utc": 1731136246.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw6ut8i",
      "author": "None",
      "body": "and 65 ps5 pros",
      "score": -1,
      "created_utc": 1731120096.0,
      "replies": []
    },
    {
      "id": "lw3e4om",
      "author": "None",
      "body": "Sold to people or to all the store? \nSure, it’s easy for Sony they sold 65M even if game store still have ton of stock sleeping in their back store",
      "score": -20,
      "created_utc": 1731080493.0,
      "replies": [
        {
          "id": "lw3gdyg",
          "author": "reddit455",
          "body": ">stock sleeping in their back store\n\nthey cause traffic on the network the consoles talk to ONLY when they're turned on in someones house.. not the back of the store.\n\n\n\ndo you think they're trying to trick you?\n\n\n\n**PS5 vs Xbox Series X|S Sales Comparison - September 2024 - Sales**\n\n[https://www.vgchartz.com/article/462856/ps5-vs-xbox-series-xs-sales-comparison-september-2024/](https://www.vgchartz.com/article/462856/ps5-vs-xbox-series-xs-sales-comparison-september-2024/)\n\n  \nGap change in latest month: 733,233 - PS5\n\nGap change over last 12 months: 11,767,379 - PS5\n\nTotal Lead: 31,800,025 - PS5\n\nPlayStation 5 Total Sales: 61,935,334\n\nXbox Series X|S Total Sales: 30,135,309",
          "score": 10,
          "created_utc": 1731081159.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw3nfar",
      "author": "reddltlsfvckingdumm",
      "body": "they will lie again and have 180m sold near the end",
      "score": -15,
      "created_utc": 1731083216.0,
      "replies": []
    },
    {
      "id": "lw6zbmy",
      "author": "WEEGEMAN",
      "body": "And yet it has like no games",
      "score": -2,
      "created_utc": 1731121809.0,
      "replies": []
    },
    {
      "id": "lw3hslc",
      "author": "None",
      "body": "[deleted]",
      "score": -12,
      "created_utc": 1731081568.0,
      "replies": [
        {
          "id": "lw3jpdw",
          "author": "KrookedDoesStuff",
          "body": "I was a PS5 Hardware Support Specialist at PlayStation, and the amount of consoles that we had to repair from being faulty was incredibly small.\n\nNearly every single repair we had was from someone who had damaged the HDMI port, with a much smaller number of people who didn’t provide adequate ventilation for the console.\n\nEdit: Little bit more context: Out of the thousands of requests I received, only one was actually a faulty console, and it was overheating then turning off, user had it laying down the entire time with proper ventilation of 4’ on each side. During my time there, I can’t think of a single other instance we had of a console that was faulty.\n\nThat being said, Dualsense controllers were a dime a dozen. **So much stick drift**",
          "score": 12,
          "created_utc": 1731082132.0,
          "replies": [
            {
              "id": "lw3k4f1",
              "author": "skygt3rsr",
              "body": "Oh ok kool I was hearing just a lot of repairs and warranty stuff I don’t have one myself (house fire) had the Ferrari racing wheel  set up and all the goodys",
              "score": -5,
              "created_utc": 1731082255.0,
              "replies": [
                {
                  "id": "lw4lpc8",
                  "author": "JayBayes",
                  "body": "What does this even mean?",
                  "score": 1,
                  "created_utc": 1731093200.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}