{
  "post": {
    "title": "Xbox's handheld has been sidelined (for now), as Microsoft doubles down on Windows 11 PC gaming handheld optimization",
    "author": "None",
    "id": "1kymoy4",
    "score": 1478,
    "created_utc": 1748553936.0,
    "selftext": "",
    "num_comments": 274,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kymoy4/xboxs_handheld_has_been_sidelined_for_now_as/"
  },
  "comments": [
    {
      "id": "muyl7gf",
      "author": "ednerjn",
      "body": "> It's possible that the existential threat from SteamOS, which on paper delivers better gaming performance than Windows 11 itself.\n\n\nWhat do you mean \"on paper\"?",
      "score": 832,
      "created_utc": 1748555142.0,
      "replies": [
        {
          "id": "muyqcxr",
          "author": "Rezmir",
          "body": "After the Lenovo using SteamOS, it is quite clear it is not on paper. It is a real big difference.",
          "score": 435,
          "created_utc": 1748556746.0,
          "replies": [
            {
              "id": "muzljrs",
              "author": "CMDR_omnicognate",
              "body": "I don’t really see why it wouldn’t be, since steam OS is basically just stuff required to make steam and its games work correctly, with Linux underneath should you want to use a full OS. The amount of stuff constantly running in windows 11 in the background because it assumes it’s a normal pc will definitely cause a noticeable performance decrease.\n\nI wonder if Microsoft might refine their “gaming mode” thing so that it basically runs a slim version of windows like steam os runs a slim Linux distro, or if it might be seen as a security vulnerability.",
              "score": 147,
              "created_utc": 1748567191.0,
              "replies": [
                {
                  "id": "mv0i74k",
                  "author": "Iggyhopper",
                  "body": "Yeah, I dont need:\n\n\n* Full fledged Windows Updates\n* Search indexing gone to shit\n* Windows defender somehow using all the CPU\n\n\nFor a gaming PC. That list is like the grand trinity of WTF whenever Windows shits the bed (and has been since XP era)",
                  "score": 109,
                  "created_utc": 1748579577.0,
                  "replies": [
                    {
                      "id": "mv3qafy",
                      "author": "cellphone_blanket",
                      "body": "Yeah but how would you live without the key logging software to grab data for their AI?",
                      "score": 14,
                      "created_utc": 1748626052.0,
                      "replies": []
                    },
                    {
                      "id": "mv3qkhv",
                      "author": "VikingBorealis",
                      "body": "Xbox already runs \"full\" windows.\n\nThe kernel runs at the core and then the Xbox version of Windows runs on top lik a hardware VM. And this could just as easy switch and runs full desktop windows instead if needed.",
                      "score": 3,
                      "created_utc": 1748626129.0,
                      "replies": []
                    },
                    {
                      "id": "mv1vyfb",
                      "author": "tlst9999",
                      "body": "Yea, but a PC isn't just gaming.\n\nFor those of us who need work software, especially Windows & Apple exclusive work software, we can't shift.",
                      "score": -21,
                      "created_utc": 1748605895.0,
                      "replies": [
                        {
                          "id": "mv24osc",
                          "author": "sickdinoshit",
                          "body": "They’re talking about a handheld console, why would you need any work things on that?",
                          "score": 22,
                          "created_utc": 1748609160.0,
                          "replies": []
                        },
                        {
                          "id": "mv2gk7w",
                          "author": "Iggyhopper",
                          "body": "Totally fine argument for an actual PC. But also, they did come up with Pro and S versions, and I think a little more effort can be had for a gaming mode.\n\n\nAnd, I meant gaming *handheld* PC, but you get it.",
                          "score": 4,
                          "created_utc": 1748613075.0,
                          "replies": []
                        },
                        {
                          "id": "mv2qlm2",
                          "author": "PalmSizedTriceratops",
                          "body": "It is for me lol. I use a Mac at work and at home day to day. The only reason I have a Windows PC is exclusively for gaming. \n\nI'm positive I'm not the only one.\n\nHowever, we're talking about handhelds which I also have.... And steamOS is phenomenal. Much less hassle than Windows.",
                          "score": 1,
                          "created_utc": 1748616021.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "muznm14",
                  "author": "Rezmir",
                  "body": "I wish they did that. Microsoft could make buck if they could make windows have a “gaming mode”. Since there is no difference between w11 on Lenovo or a pc, if they sell that or whatever, I can see way to many people buying it.",
                  "score": 33,
                  "created_utc": 1748567913.0,
                  "replies": [
                    {
                      "id": "muzrwvm",
                      "author": "CMDR_omnicognate",
                      "body": "Windows 11 already had a gaming mode, they just need to improve it",
                      "score": 26,
                      "created_utc": 1748569383.0,
                      "replies": [
                        {
                          "id": "mv2ij6q",
                          "author": "hansrotec",
                          "body": "By improving it you mean not make the experience actually worse in some cases.",
                          "score": 8,
                          "created_utc": 1748613674.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mv03wy0",
                      "author": "Bamstradamus",
                      "body": "I remember opening task manager and having like 6 processes running and I knew what they did.  Now I feel like half my RAM is just so windows and chrome don't start a riot.",
                      "score": 37,
                      "created_utc": 1748573601.0,
                      "replies": [
                        {
                          "id": "mv0ernc",
                          "author": "Jiopaba",
                          "body": "There used to be more too, but Windows didn't used to display services in the task manager. It's definitely gotten bloatier, but the modern task manager installed on Windows XP would show a lot more than the old one did.",
                          "score": 15,
                          "created_utc": 1748578029.0,
                          "replies": []
                        },
                        {
                          "id": "mv2nuy5",
                          "author": "hushpuppi3",
                          "body": "Yup. I look at my RAM usage and its 12.4Gb of 32 being used right now. My browser is taking up over 2Gb for some reason, then its Discord, Steam, Spotify at 500Mb each, then approximately 7000 *things* that take up 50-0.1Mb that somehow utilize like 1/3 of my entire RAM capacity.\n\nI don't get it. My last system had 16Gb but somehow Windows has figured out how to generate an extra 8Gb of memory usage.",
                          "score": 5,
                          "created_utc": 1748615238.0,
                          "replies": [
                            {
                              "id": "mvmm9e6",
                              "author": "competition-inspecti",
                              "body": "> My browser is taking up over 2Gb for some reason\n\nA tab from permalink of your comment takes 91 Mb in Vivaldi on old reddit, and 336 on new\n\nAnd considering that a good chunk of apps you mentioned are made with Electron, and therefore launch separate Chrome instances just for themselves - that's bound to pile up quickly",
                              "score": 1,
                              "created_utc": 1748887183.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mv25p2p",
                          "author": "hexcor",
                          "body": "Just add more ram! How much could it cost Michael, $10?",
                          "score": 2,
                          "created_utc": 1748609511.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "muzp0eh",
                  "author": "ChaosCarlson",
                  "body": "Even if they did, I doubt Microsoft would be able to get a gaming mode more optimized than steam os",
                  "score": 7,
                  "created_utc": 1748568404.0,
                  "replies": [
                    {
                      "id": "mv1dgpe",
                      "author": "clockworkpeon",
                      "body": "they can and did - it's called Xbox System Software. the original Xbox OS was Windows 2000 with like 95% of the shit cut out. 360 also ran on modded Windows 2000. Xbox One started on Windows 8 and now the One and the Series both run on Windows 10.\n\nwhat they need to do is stop thinking about optimizing windows 11 for handhelds, and work on optimizing XSS for handhelds. and expand+improve on XSS functionality+features.",
                      "score": 14,
                      "created_utc": 1748596884.0,
                      "replies": [
                        {
                          "id": "mv1ho96",
                          "author": "FireLucid",
                          "body": "At least one of the xboxes had 3 OS's. A hypervisor and a VM running a game OS and another VM running the Xbox OS (menus etc). Are they still doing that for the current Xbox?",
                          "score": 3,
                          "created_utc": 1748599253.0,
                          "replies": [
                            {
                              "id": "mv1j2pf",
                              "author": "clockworkpeon",
                              "body": "yeah that's the current OS. hyper-v with one VM for the game and one VM for the OS and other apps.",
                              "score": 3,
                              "created_utc": 1748600014.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mv0561y",
                  "author": "hyperforms9988",
                  "body": "The idea that they haven't done that yet is absolutely absurd given they actually run a proper shop on their own OS.  I don't know that I'd like to see this restriction because I don't buy games through their store, but it would be a compelling argument for people to buy games on it if you could boot into a mode that is expressly designed to run games off of the Xbox app and little else... whether that's Game Pass or games you've purchased on it.  On a PC, that might be a bit of a drag, but were they to come out with their own handheld, that would be practically required given how bloated Windows is, for the sake of both performance and battery life.",
                  "score": 7,
                  "created_utc": 1748574076.0,
                  "replies": [
                    {
                      "id": "mv0ic6f",
                      "author": "Iggyhopper",
                      "body": "You say that and yet Windows 8 AND Windows 11 designs were *choices*.",
                      "score": 10,
                      "created_utc": 1748579643.0,
                      "replies": [
                        {
                          "id": "mv0zdar",
                          "author": "GolemancerVekk",
                          "body": "Microsoft hasn't been taking gaming seriously for a while now.\n\nThey're scrambling now because SteamOS is threatening to steal the entire PC market from them.",
                          "score": 4,
                          "created_utc": 1748588553.0,
                          "replies": [
                            {
                              "id": "mv3b76v",
                              "author": "hyperforms9988",
                              "body": "I feel like they have to commit to something.  If they still want to run their own console platform, have a PC handheld, etc etc etc, then it behooves them to do more on the OS end to encourage people to adopt and stay within their own ecosystem.  They can just as easily let go of all of that shit, get out of console gaming, still have their own shop on PCs and shit, and just be happy being a publisher and a developer for the other consoles and for PCs.  There's nothing wrong with that now that they have so much more muscle behind the software production end of things than they used to and they seem to be adopting the idea of putting their games on Steam, on Playstation, etc.\n\nThere's something to be said for trying to do everything and trying to be everywhere at once, but that can work against you where you're just spread too thin to seriously compete with just about anybody else who is far more specialized in specific areas.\n\nThey seem to have an issue with commitment.  If you want to release a music player like the Zune, then fucking commit.  Don't try it for a little while and then give up on it.  If you want to do Windows Phone, then stay in that shit.  Games for Windows Live?  Keep going and support that shit properly instead of abandoning it and then royally fucking up every game that was designed to use it when it no longer functions.",
                              "score": 1,
                              "created_utc": 1748621832.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mv1hwwj",
                          "author": "FireLucid",
                          "body": "8 was terrible. 11 is mostly just a slight UI tweak with extra security under the hood vs 10.",
                          "score": 1,
                          "created_utc": 1748599384.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mv18a5v",
                      "author": "poisonous-leek-soup",
                      "body": "Honestly it’s probably a lot of work to unfuck windows. They have to undo years of spaghetti made by random teams with constantly changing workflows. They have to make sure all the games and anti cheats work built on this spaghetti still work and that future windows updates will also work.",
                      "score": 3,
                      "created_utc": 1748593788.0,
                      "replies": []
                    },
                    {
                      "id": "mv342ac",
                      "author": "irqlnotdispatchlevel",
                      "body": ">The idea that they haven't done that yet is absolutely absurd given they actually run a proper shop on their own OS.\n\nAnd also Xbox runs on a modified Windows. You can also get a slimed down version for Windows Server. All the building blocks are there, they just need to be financially motivated to build it.",
                      "score": 1,
                      "created_utc": 1748619817.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mv0pnu2",
                  "author": "animalkrack3r",
                  "body": "It's the Xbox OS",
                  "score": 1,
                  "created_utc": 1748583229.0,
                  "replies": []
                },
                {
                  "id": "mv28ayu",
                  "author": "Optimus_Prime_Day",
                  "body": "Microsoft already have a slimmed down OS... on their Xbox. Why wouldnt their handheld use something similar? Just use the Xbox interface and everything.",
                  "score": -1,
                  "created_utc": 1748610401.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "muys0ps",
              "author": "Randommaggy",
              "body": "Zero of the games I've A-B tested on my HX370 64GB GPD Pocket 4 between my Windows and Bazite installs have run better on Windows.\nZero.\n\n\n\nIf not for virus level anticheat locking some games to Windows I don't see any reason for a computer that is primarily used for gaming to run Windows.",
              "score": 87,
              "created_utc": 1748557278.0,
              "replies": [
                {
                  "id": "muzyr0i",
                  "author": "mouse_8b",
                  "body": "> I don't see any reason for a computer that is primarily used for gaming to run Windows\n\nNot sure how old you are, but that's a relatively recent phenomenon. Back in the 90s, Microsoft made DirectX, which gave developers a common API for graphics cards. This directly led to the graphics card arms race that is still playing out today. This meant Windows was the only option for games with cutting-edge graphics.\n\nThese days, Unix systems have more options for graphics. I don't know that they can match Windows for cutting edge graphics, but maybe they can. At least now, there is enough capability that most games can run fine on either platform.",
                  "score": 14,
                  "created_utc": 1748571727.0,
                  "replies": [
                    {
                      "id": "mv0k9bv",
                      "author": "Randommaggy",
                      "body": "I'm in my late 30s so I know the early DX shitshow times.\n\n\nIt was \"fun\" having to uninstall DX to install an older version to play some of my older games, since the backwards compat prior to DX 9c sucked.\n\n\nThese days Linux is a better platform for smoothly experiencing the Windows back catalogue than Windows since Wine and Proton is of such high quality.",
                      "score": 7,
                      "created_utc": 1748580544.0,
                      "replies": []
                    },
                    {
                      "id": "mv13ekl",
                      "author": "GolemancerVekk",
                      "body": "All of the highest performance graphical rendering runs on UNIX-like systems.\n\nThe gaming situation on PC is Microsoft artificially restricting (weak) stuff to Windows, and game producers playing along because they don't want Microsoft to get mad at them, and card manufacturers not giving a shit because they get money either way.",
                      "score": 1,
                      "created_utc": 1748590910.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "muytxc0",
                  "author": "Rezmir",
                  "body": "I am not even talking about computer. Just handheld. Lenovo is the first one that has one for windows and one for SteamOS and all the hardware is the same, it is a huge difference. You can check out videos comparing.",
                  "score": 38,
                  "created_utc": 1748557899.0,
                  "replies": [
                    {
                      "id": "muz57e8",
                      "author": "archefayte",
                      "body": "The Lenovo GO is a computer is likely what they were referencing. Regardless of the difference, there are some games you just can't play due to anti cheat on SteamOS.",
                      "score": 13,
                      "created_utc": 1748561609.0,
                      "replies": [
                        {
                          "id": "muzorwz",
                          "author": "SpeedflyChris",
                          "body": "For now. With handhelds like the steam deck growing in popularity and SteamOS being unquestionably better for that application, devs are likely to consider it in future when developing cheat detection systems.",
                          "score": 15,
                          "created_utc": 1748568323.0,
                          "replies": [
                            {
                              "id": "mv0jwuh",
                              "author": "kitliasteele",
                              "body": "Can confirm. For example, some anticheat policies will explicitly check for Steam Deck hardware if it detects the game is running in Wine. If it finds it's on a Steam Deck, it'll run less strictly and run on a Steam Deck compatible profile instead of refusing to run. In other cases, it'll run with full Linux compatibility thanks to the Proton layer. I saw a new game launch last week (Fantasy Life) that uses Easy Anti Cheat that is Verified to run on the Steam Deck. So really all we are held back by are developers that either haven't updated the games to run on Proton with their anticheat, or developers who refuse to implement it (like Epic Games with Fortnite)",
                              "score": 5,
                              "created_utc": 1748580380.0,
                              "replies": [
                                {
                                  "id": "mv0zsu2",
                                  "author": "GolemancerVekk",
                                  "body": "They refuse to implement it because of backstage agreements with Microsoft. \n\nThey're basically Windows exclusives... but it's simpler to say anybody using Linux is a cheater than to risk being accused of anticompetitive practices.",
                                  "score": 1,
                                  "created_utc": 1748588801.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mv1lz82",
                          "author": "ToMorrowsEnd",
                          "body": "the answer is simply dont play those games and force the game makers to stop that stupidity.  COD claims they need it and it has done nothing to stop cheaters.  same with Apex  they also are unable to stop cheaters at all despite of their kernel level anti cheat.  so it's proving that it is not needed and doesnt actually work.",
                          "score": 2,
                          "created_utc": 1748601512.0,
                          "replies": []
                        },
                        {
                          "id": "muz6bzh",
                          "author": "Rezmir",
                          "body": "That is indeed true. But the difference is absurd in performance.",
                          "score": 5,
                          "created_utc": 1748561985.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mv1xtks",
                      "author": "duplissi",
                      "body": "These handhelds are computers...",
                      "score": 1,
                      "created_utc": 1748606631.0,
                      "replies": [
                        {
                          "id": "mv1yhee",
                          "author": "Rezmir",
                          "body": "Yes, we know. I just made a point of making a difference here so people wound't missunderstand",
                          "score": 1,
                          "created_utc": 1748606887.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "muzizjz",
                  "author": "zarafff69",
                  "body": "I mean… Some games don’t run on Linux at all. Regardless of anticheat.",
                  "score": 8,
                  "created_utc": 1748566301.0,
                  "replies": [
                    {
                      "id": "mv1wvre",
                      "author": "realusername42",
                      "body": "And some do not run on Windows at all anymore either, if it's too old, you are better served by Linux/Wine.",
                      "score": 2,
                      "created_utc": 1748606263.0,
                      "replies": []
                    },
                    {
                      "id": "mv0j7x7",
                      "author": "Randommaggy",
                      "body": "Unless it's publisher/studio is actively constraining it, that's basically not a thing anymore.\n\n\nWith RT mandatory there are now even games that will only run under Linux on the same hardware.",
                      "score": 5,
                      "created_utc": 1748580054.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mv19qmp",
                  "author": "sCeege",
                  "body": "For what it’s worth, Windows is still the one click solution to get 99% of games working without tinkering. Besides KACs, there’s also Xbox game pass which only runs on Windows. I have two headless Windows machines in my home dedicated to running Windows as a gaming platform, my Mac and Linux just remote to them via Sunshine/Moonlight. When I travel I just accept the smaller library on my MacBook via CrossOver.",
                  "score": 1,
                  "created_utc": 1748594666.0,
                  "replies": [
                    {
                      "id": "mv1bmxk",
                      "author": "Randommaggy",
                      "body": "In the last year my experience has been that Linux actually has been less messy to get games working than Windows, especially when running games from the older part of my steam library, and for games that install too much third party crap on Windows.\n\nI do use Apollo+Moonlight/Artemis from my 4090 laptop but only for games that my Linux machine and Macbook Air M1 are too weak to run.",
                      "score": 4,
                      "created_utc": 1748595795.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "muzrthp",
                  "author": "GoldieForMayor",
                  "body": "Xbox runs windows and I don't hear people complaining about Xbox perf.",
                  "score": -7,
                  "created_utc": 1748569351.0,
                  "replies": [
                    {
                      "id": "mv08nzp",
                      "author": "JP76",
                      "body": "It's not full Windows.",
                      "score": 2,
                      "created_utc": 1748575464.0,
                      "replies": [
                        {
                          "id": "mv32j9z",
                          "author": "GoldieForMayor",
                          "body": "Why would you run full windows on a Xbox?",
                          "score": 1,
                          "created_utc": 1748619392.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mv0jcs1",
                      "author": "Randommaggy",
                      "body": "Highly tuned and probably shares about 5% of it's code with desktop windows in practice.",
                      "score": 2,
                      "created_utc": 1748580118.0,
                      "replies": [
                        {
                          "id": "mv32gdd",
                          "author": "GoldieForMayor",
                          "body": "Yeah that was the whole idea behind it. How would that be different for handhelds?",
                          "score": 1,
                          "created_utc": 1748619369.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mv0zlic",
              "author": "twigboy",
              "body": "Lord Gabens long plan is paying off, he's finally toppling the empire he left",
              "score": 2,
              "created_utc": 1748588684.0,
              "replies": []
            },
            {
              "id": "mv1ljjz",
              "author": "ToMorrowsEnd",
              "body": "Yep.  Win11 sucks for gaming compared to linux/steamOS and unless microsoft strips out all their garbage it will stay that way.",
              "score": 2,
              "created_utc": 1748601296.0,
              "replies": [
                {
                  "id": "mv1mm7n",
                  "author": "Rezmir",
                  "body": "They don’t even need to strip things. Just make a good game mode where it will “silence out” the noise while you are at it.",
                  "score": 1,
                  "created_utc": 1748601823.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mv2g12a",
              "author": "newerclearneracct",
              "body": "Yeah but like does it have Copilot?  And dedicated Copilot button?   And what about OneDrive that *really* wants you to back things up?     Yeah… didn’t think so.",
              "score": 2,
              "created_utc": 1748612910.0,
              "replies": []
            },
            {
              "id": "muytj0c",
              "author": "None",
              "body": "[deleted]",
              "score": -13,
              "created_utc": 1748557769.0,
              "replies": [
                {
                  "id": "muz1ndl",
                  "author": "Rezmir",
                  "body": "Considering the Lenovo was first released with windows and just now it was released with SteamOS…. I don’t really think that would be the case here.",
                  "score": 18,
                  "created_utc": 1748560443.0,
                  "replies": [
                    {
                      "id": "muz7igm",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -20,
                      "created_utc": 1748562373.0,
                      "replies": [
                        {
                          "id": "mv0fnyg",
                          "author": "Space_Lux",
                          "body": "What is baked in support supposed to mean?",
                          "score": 2,
                          "created_utc": 1748578430.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "muze4y8",
                  "author": "Xelanders",
                  "body": "Of that’s the case, then what does that say about Windows 11 then?",
                  "score": 1,
                  "created_utc": 1748564639.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "muzapjp",
          "author": "CakeDayisaLie",
          "body": "I hope there is a way to make SteamOs work on a desktop in place of windows 11 soon. Or is there already? ",
          "score": 18,
          "created_utc": 1748563452.0,
          "replies": [
            {
              "id": "muzw82g",
              "author": "BuffDrBoom",
              "body": "Valve has confirmed they're working on an official version you can install on any computer",
              "score": 13,
              "created_utc": 1748570839.0,
              "replies": [
                {
                  "id": "mv00o5m",
                  "author": "obi1kenobi1",
                  "body": "Yeah but that was like four years ago and not a peep since then. Unfortunately Valve is Valve, a non-hierarchical company full of geniuses with pet projects and a hundred different things in development at any one time. I’m still hopeful for SteamOS, and the Steam Controller 2, and the new Steam Machine, and the Deckard, and HLX, and everything else they’re supposedly working on, but it’s hard to maintain hope that any of them are ever actually coming.\n\nThere are open source projects to run the SteamOS interface and compatibility stuff on a mainstream Linux kernel, and from what I’ve heard they do work, but they’re far from plug and play.",
                  "score": 6,
                  "created_utc": 1748572419.0,
                  "replies": [
                    {
                      "id": "mv0e4nz",
                      "author": "Xalyia-",
                      "body": "Didn’t they just recently announce that it can be installed on certain desktops with AMD CPUs?",
                      "score": 9,
                      "created_utc": 1748577748.0,
                      "replies": []
                    },
                    {
                      "id": "mv1w2c8",
                      "author": "TheTerrasque",
                      "body": "> Yeah but that was like four years ago and not a peep since then.\n\n[Peep](https://steamdeckhq.com/news/steamos-3-7-has-been-released/)",
                      "score": 7,
                      "created_utc": 1748605939.0,
                      "replies": []
                    },
                    {
                      "id": "mv0h7vc",
                      "author": "BuffDrBoom",
                      "body": "I think one of them talked about it in an interview at CES, so it seems to still be in development",
                      "score": 2,
                      "created_utc": 1748579130.0,
                      "replies": []
                    },
                    {
                      "id": "mv18lxv",
                      "author": "HashedEgg",
                      "body": "You should check out the latest steamOS update. It's already here for a big group of PCs, general release will likely be soon!",
                      "score": 2,
                      "created_utc": 1748593986.0,
                      "replies": []
                    },
                    {
                      "id": "mv1bmhf",
                      "author": "TheOneTrueTrench",
                      "body": "They just released a version of SteamOS for anything with an AMD GPU.",
                      "score": 2,
                      "created_utc": 1748595787.0,
                      "replies": []
                    },
                    {
                      "id": "mvfz61u",
                      "author": "Old_Leopard1844",
                      "body": "> There are open source projects to run the SteamOS interface and compatibility stuff on a mainstream Linux kernel, and from what I’ve heard they do work, but they’re far from plug and play.\n\nNeither will be Steam OS lol\n\nLike, SteamOS works because Valve does what other manufacturers do with Windows, provide drivers and shit so that your Deck experience is silky smooth\n\nIf you're expecting same experience on your PC with god knows what hardware and god knows where to get Linux versions of drivers, then you might have problems still when it comes out",
                      "score": 2,
                      "created_utc": 1748797299.0,
                      "replies": [
                        {
                          "id": "mvisij1",
                          "author": "obi1kenobi1",
                          "body": "Yeah, that’s why I’m still hoping for that rumored TV console Steam Machine even though it’s been a couple years since the evidence that it was in development first came to light. I’m too lazy and impatient to try to put together a SteamOS PC but an official Valve product with all the issues already worked out would be great.",
                          "score": 1,
                          "created_utc": 1748830685.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mv1k7mk",
                      "author": "TimeBadSpent",
                      "body": "This is a much bigger money making opportunity for them than any half life game. SteamOS will be fully realized no doubt about it",
                      "score": 1,
                      "created_utc": 1748600614.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mv0a5nt",
              "author": "NaCl-more",
              "body": "Bazzite works well on AMD gpus, so does the steam deck recovery image \n\nUnfortunately the issue with nvidia GPUs is generally a problem across Linux distros, though compatibility and performance is getting better",
              "score": 5,
              "created_utc": 1748576076.0,
              "replies": [
                {
                  "id": "mv1mewa",
                  "author": "ToMorrowsEnd",
                  "body": "its much better now.  my steam box in the living room uses a 3070 just fine.",
                  "score": 2,
                  "created_utc": 1748601725.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mv02n60",
              "author": "-Badger3-",
              "body": "Can't you just run Steam in Big Picture Mode in a Linux distro?\n\nIsn't that basically what SteamOS is?",
              "score": 7,
              "created_utc": 1748573130.0,
              "replies": [
                {
                  "id": "mv13p73",
                  "author": "GolemancerVekk",
                  "body": "Yes, plus enabling always-on Proton in Steam, and running games through `gamemoderun` for maximum optimization.",
                  "score": 5,
                  "created_utc": 1748591080.0,
                  "replies": []
                },
                {
                  "id": "mv0u6pe",
                  "author": "h2hawt",
                  "body": "Kinda. But the configurations needed to turn any distro into gaming are many, enough to make people go back to windows, specially because nvidia drivers cause pain for users and devs.",
                  "score": -3,
                  "created_utc": 1748585631.0,
                  "replies": [
                    {
                      "id": "mv140z1",
                      "author": "GolemancerVekk",
                      "body": "That hasn't been a thing for many years now. You don't need to fumble with tweaks or graphical drivers on any popular distro.",
                      "score": 3,
                      "created_utc": 1748591271.0,
                      "replies": [
                        {
                          "id": "mv1mij6",
                          "author": "ToMorrowsEnd",
                          "body": "OP hasnt touched linux in a decade, their knowlege is massively out of date.",
                          "score": 2,
                          "created_utc": 1748601773.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mv27acg",
                      "author": "ryosen",
                      "body": "Most distributions of Linux don’t include nvidia drivers by default. Same as Windows.\n\nInstalling nvidia drivers is a download. Same as windows.",
                      "score": 1,
                      "created_utc": 1748610053.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mv1byrh",
              "author": "TheOneTrueTrench",
              "body": "Bazzite, works fantastically.\n\nMy main desktop is Arch, and for a long time I just ran Steam on there, but recently it's just been easier to stick with Bazzite for gaming, except in EXTREMELY specific situations where i need something like dwarfs for a weird hack.",
              "score": 1,
              "created_utc": 1748595993.0,
              "replies": []
            },
            {
              "id": "mv1majj",
              "author": "ToMorrowsEnd",
              "body": "bazzite.  works great to get steamOS on anything.",
              "score": 1,
              "created_utc": 1748601666.0,
              "replies": []
            }
          ]
        },
        {
          "id": "muzegq8",
          "author": "CaptainRogers1226",
          "body": "Wait, what’s possible?  “It’s possible that the existential threat from SteamOS, which on paper delivers better gaming experience than Windows 11 itself, [insert possibility here]”\n\nThis is an incomplete thought lmao",
          "score": 10,
          "created_utc": 1748564751.0,
          "replies": [
            {
              "id": "muzwga0",
              "author": "snugpuginarug",
              "body": "[has informed these decisions]\n\nFor future reference, taking 10 seconds to open the article instead of waiting for someone to spoonfeed you the answer is quicker than writing a paragraph",
              "score": -4,
              "created_utc": 1748570919.0,
              "replies": [
                {
                  "id": "mv049ck",
                  "author": "CaptainRogers1226",
                  "body": "Good to know. Thanks.\n\nI wasn’t waiting for anything. The commenter had quoted the article with a punctuation mark indicating that was the end of the sentence, so I thought that was the quote. Not an unreasonable thought, I’d wager, given the state of modern journalism.\n\nEdit: happy cake day",
                  "score": 1,
                  "created_utc": 1748573730.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "muypqyb",
          "author": "Blumcole",
          "body": "It doesnt support all games. I would switch to linux if I could play gamepass on it for example",
          "score": 16,
          "created_utc": 1748556551.0,
          "replies": [
            {
              "id": "muz5oj6",
              "author": "Tea_Fetishist",
              "body": "EA stopped several battlefield games working on SteamOS after they issued an updated anticheat that doesn't allow anyone playing on Linux.",
              "score": 7,
              "created_utc": 1748561768.0,
              "replies": [
                {
                  "id": "muzex1w",
                  "author": "Small_Editor_3693",
                  "body": "It’s wild cause Sony is building steamdeck launch switches into their games",
                  "score": 5,
                  "created_utc": 1748564908.0,
                  "replies": []
                },
                {
                  "id": "mv149wj",
                  "author": "GolemancerVekk",
                  "body": "Also WRC10. Months after it had been launched and was running fine on Linux (better than on Windows in fact) they added \"anticheat\" that explicitly said it won't run on SteamOS, Deck or anything Linux or Proton.",
                  "score": 2,
                  "created_utc": 1748591417.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "muyrssf",
              "author": "ContributionOld2338",
              "body": "It’s Fortnite for me… once that’s available, it’s over… and it’s the perfect game to jump into for a quick session",
              "score": 9,
              "created_utc": 1748557208.0,
              "replies": [
                {
                  "id": "muz2pid",
                  "author": "ThatOneGuyThatYou",
                  "body": "The issue is that there needs to be a sort of exodus of people that leave Fortnite for Linux for Sweeney to care. Despite EAC having a Linux version that is available by simply checking a box, he equates the use of Linux to be only for cheaters, despite there being all the cheaters on Windows.\n\nI don’t even care for a native port, just let it run with Wine/Proton and let me play.",
                  "score": 8,
                  "created_utc": 1748560789.0,
                  "replies": [
                    {
                      "id": "mv14jru",
                      "author": "GolemancerVekk",
                      "body": ">he equates the use of Linux to be only for cheaters\n\nI don't understand how they still cling to this spiel, after the obvious fact that they banned Linux players and there's still cheating...",
                      "score": 3,
                      "created_utc": 1748591578.0,
                      "replies": [
                        {
                          "id": "mv1mutw",
                          "author": "ToMorrowsEnd",
                          "body": "its hiding a back door deal with microsoft.   Microsoft cant win on the OS so they run around offering deals to makers to lock out linux.",
                          "score": 1,
                          "created_utc": 1748601935.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mx7s3zh",
                      "author": "ContributionOld2338",
                      "body": "I didn’t realize that was why…. That sucks, makes the chance of it coming that much less… X cloud is good enough I guess.",
                      "score": 2,
                      "created_utc": 1749655975.0,
                      "replies": []
                    },
                    {
                      "id": "mv0ils9",
                      "author": "Iggyhopper",
                      "body": "Correct. Many reverse engineer videos/hacks/bots are on Windows machines.\n\n\nSwitching to Linux will make the hack makers sweat a little, which is real nice.",
                      "score": 1,
                      "created_utc": 1748579767.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "muzli7p",
                  "author": "dark_sable_dev",
                  "body": "Yeah, except Tim Sweeney has the attitude of a butt-hurt 10 year old and thinks if flips the (already existing) toggle to turn on Linux support that only hackers will use it.",
                  "score": 2,
                  "created_utc": 1748567175.0,
                  "replies": []
                },
                {
                  "id": "muzesmq",
                  "author": "Small_Editor_3693",
                  "body": "Epic could easily come to Linux too. Real shame",
                  "score": 1,
                  "created_utc": 1748564866.0,
                  "replies": [
                    {
                      "id": "mx7s75d",
                      "author": "ContributionOld2338",
                      "body": "I thought epic games was available on the steam deck?",
                      "score": 1,
                      "created_utc": 1749656000.0,
                      "replies": [
                        {
                          "id": "mx80irm",
                          "author": "Small_Editor_3693",
                          "body": "Not natively. It’s through wine",
                          "score": 1,
                          "created_utc": 1749658380.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "muzu1f2",
          "author": "kenshinakh",
          "body": "Xbox OS would be fun to see. It's already really efficient for games. Would be nice to see them work with manufacturers to support handheld devices.",
          "score": 2,
          "created_utc": 1748570091.0,
          "replies": [
            {
              "id": "mv17kb6",
              "author": "punIn10ded",
              "body": "Xbox os is just stripped down windows 11\nSo you're right that's all they need. Just licence that with Xbox UI and it's done.",
              "score": 1,
              "created_utc": 1748593362.0,
              "replies": []
            }
          ]
        },
        {
          "id": "muz7yqn",
          "author": "creepilincolnbot",
          "body": "Means it’s not the actual experience. Just better sales",
          "score": 1,
          "created_utc": 1748562521.0,
          "replies": []
        },
        {
          "id": "mv4277f",
          "author": "NahDawgDatAintMe",
          "body": "SteamOS doesn't have solitaire so who's really winning?",
          "score": 1,
          "created_utc": 1748629380.0,
          "replies": []
        },
        {
          "id": "mv9wc2b",
          "author": "GooseDaPlaymaker",
          "body": "😅",
          "score": 1,
          "created_utc": 1748711754.0,
          "replies": []
        },
        {
          "id": "mva6pdz",
          "author": "BadCrazy_Boy",
          "body": "There are caveats with Steam OS. It doesn’t support some games with anti cheat and some launchers (like game pass) are hard to impossible to set up so it’s not apples to apples.",
          "score": 1,
          "created_utc": 1748714930.0,
          "replies": []
        },
        {
          "id": "muyrr3l",
          "author": "silentcrs",
          "body": "For all the magic Proton does, you’re still going through a translation layer. If you strip down Windows to the bare minimum needed to play games (going with the Pro version helps - less needless bloat) it still performs better than SteamOS.",
          "score": -18,
          "created_utc": 1748557192.0,
          "replies": [
            {
              "id": "muytd19",
              "author": "proanimus",
              "body": "Translation layer, not emulation. It’s a noteworthy difference.",
              "score": 13,
              "created_utc": 1748557714.0,
              "replies": [
                {
                  "id": "muyty86",
                  "author": "silentcrs",
                  "body": "Corrected. Still a performance hit.",
                  "score": -5,
                  "created_utc": 1748557908.0,
                  "replies": [
                    {
                      "id": "muyydx3",
                      "author": "AAAAAASILKSONGAAAAAA",
                      "body": "Nope\n\nhttps://youtu.be/CJXp3UYj50Q",
                      "score": 6,
                      "created_utc": 1748559369.0,
                      "replies": []
                    },
                    {
                      "id": "muz1pj9",
                      "author": "AAAAAASILKSONGAAAAAA",
                      "body": "One more link showing steam os performs better than windows on identical hardware (still refers to dave2d's video)\n\nhttps://www.windowscentral.com/gaming/pc-gaming/in-an-embarrassment-for-microsoft-steamos-seems-to-destroy-windows-11-on-gaming-performance-and-battery-life-as-well-as-usability",
                      "score": 2,
                      "created_utc": 1748560463.0,
                      "replies": [
                        {
                          "id": "muz4i5l",
                          "author": "silentcrs",
                          "body": "So the reference here is performance testing on literally one handheld with no indication of a rigorous testing methodology? And with that we’re making sweeping generalizations on OS performance on all PCs? Digital Foundry this isn’t.",
                          "score": -8,
                          "created_utc": 1748561377.0,
                          "replies": [
                            {
                              "id": "muz52ya",
                              "author": "AAAAAASILKSONGAAAAAA",
                              "body": "You say this while your previous comment and generalization was just\n\n> Corrected. Still a performance hit.\n\nYou are being hypocritical and not realizing it. Where was your reference and source?  Out your ass?",
                              "score": 3,
                              "created_utc": 1748561568.0,
                              "replies": [
                                {
                                  "id": "muz86a7",
                                  "author": "silentcrs",
                                  "body": "Basic architecture. My knowledge comes from years of virtualization experience.\n\nThere’s no such thing as a free translation layer. There’s always a performance hit, even if it’s small one. You still have to intercept a call and make another call, even if instructions are baked into hardware like VT-x.",
                                  "score": -3,
                                  "created_utc": 1748562590.0,
                                  "replies": [
                                    {
                                      "id": "muz91wa",
                                      "author": "AAAAAASILKSONGAAAAAA",
                                      "body": "Perhaps you should have taken windows 11 bloatware and other resource hogging processing into account.\n\nAlso funny you thought it was emulation when Wine stands for \"wine is not an emulator\"",
                                      "score": 3,
                                      "created_utc": 1748562884.0,
                                      "replies": [
                                        {
                                          "id": "muzg1v3",
                                          "author": "silentcrs",
                                          "body": "Also, I found that Digital Foundry DID compare Bazzite to Windows. Bazzite performed the same or slightly worse than Windows with similar battery life. [https://www.youtube.com/watch?v=OwWRCrGoXV0](https://www.youtube.com/watch?v=OwWRCrGoXV0)",
                                          "score": 1,
                                          "created_utc": 1748565302.0,
                                          "replies": []
                                        },
                                        {
                                          "id": "muzasig",
                                          "author": "silentcrs",
                                          "body": ">Perhaps you should have taken windows 11 bloatware and other resource hogging processing into account.\n\nIf you're going to game on any OS, you're going to tune it. No one just installs a Linux distro and immediately starts gaming. You can't even install SteamOS on most hardware.\n\n>Also funny you thought it was emulation when Wine stands for \"wine is not an emulator\"\n\nI mistyped and corrected myself.",
                                          "score": -3,
                                          "created_utc": 1748563481.0,
                                          "replies": [
                                            {
                                              "id": "mv14wx1",
                                              "author": "GolemancerVekk",
                                              "body": ">No one just installs a Linux distro and immediately starts gaming. \n\nUm, yes they do  😉 How long has it been since you've last checked it out?",
                                              "score": 3,
                                              "created_utc": 1748591792.0,
                                              "replies": [
                                                {
                                                  "id": "mv2wdv9",
                                                  "author": "silentcrs",
                                                  "body": "You install Mint and Ubuntu for gaming and don’t tweak it at all? You just leave all the background daemons running?",
                                                  "score": 1,
                                                  "created_utc": 1748617663.0,
                                                  "replies": [
                                                    {
                                                      "id": "mv481gs",
                                                      "author": "GolemancerVekk",
                                                      "body": "Yes. The daemons on Linux are well-behaved and they don't impact the rest of the system. Secondly, they aren't bloatware, I can have a look at the process list right now and see that it's only running useful things.",
                                                      "score": 1,
                                                      "created_utc": 1748631087.0,
                                                      "replies": [
                                                        {
                                                          "id": "mv63xry",
                                                          "author": "silentcrs",
                                                          "body": "I’ve run Linux servers for many years. Daemons aren’t automatically well behaved. There are many badly written daemons.\n\nIn any case, you typically tune a Windows desktop for gaming. The average Linux distro installs a bunch of stuff specifically for desktop apps. I would think you’d want to tune it the same.",
                                                          "score": 1,
                                                          "created_utc": 1748652923.0,
                                                          "replies": [
                                                            {
                                                              "id": "mv7i4kd",
                                                              "author": "GolemancerVekk",
                                                              "body": "You can tune a game at runtime with gamemode: https://github.com/FeralInteractive/gamemode\n\nI've never had to uninstall stuff or stop daemons though. Keep in mind that the daemons that tends to be included by default are also the ones under the most use and scrutiny so they're the most optimized.",
                                                              "score": 1,
                                                              "created_utc": 1748675455.0,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "muyvptm",
              "author": "Inetro",
              "body": "Proton is not emulation, it is a compatability layer. Unlike emulation where you are \"faking\" a piece of hardware and how they interact with other pieces of hardware that are nonexistant in the PC, Linux knows everything in the PC, and it works very similar to how it would running Windows. The drivers are similar, the storage is similar, the CPU is similar. The compatibility layer just translates a call a game would make in Windows to instructions that work the same in Linux. There are games with native Linux releases that work *better* on Proton.\n\nThe biggest issues with Proton are lack of support for anti-cheat, which have unique requirements to pass verification; and new features utilised by newer AAA games, since those calls don't have translations in Proton at launch.",
              "score": 8,
              "created_utc": 1748558490.0,
              "replies": [
                {
                  "id": "muz04u6",
                  "author": "silentcrs",
                  "body": "I corrected my original word choice (I was typing quickly). I understand what a translation layer is. There’s still a performance hit in the process.\n\nNot to mention the majority of games on ProtonDB are playable or unsupported, not verified. Many playable games have graphics glitches. So, it’s not like a just calling a VT-x instruction. There’s a lot more to it.",
                  "score": -1,
                  "created_utc": 1748559945.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "muynnuf",
      "author": "blackburnduck",
      "body": "Definitely steamOS.\nMicrosoft suddenly lost the bone over mobile pc gaming and a lot of users would consider linux as an OS if it would run games… there is a huge chance that we will see gaming pcs coming with steam OS in the next 5y. No reason a kid that wants to play and use word needs to buy a windows license…\nSuddenly linux is a serious threat.",
      "score": 257,
      "created_utc": 1748555893.0,
      "replies": [
        {
          "id": "muypden",
          "author": "AsrielPlay52",
          "body": "They already lost this bone for over a decade. Windows 10 tablets? For mobile?\n\nThat didn't go well did it?",
          "score": 54,
          "created_utc": 1748556431.0,
          "replies": [
            {
              "id": "muyqnvj",
              "author": "blackburnduck",
              "body": "Mobiles were not gaming pcs.\nTablet market is huge, yes. But for pc, adults use windows because of apps. Kids use windows because of games.\nMove the kids away and pretty soon you have adults who are used to linux apps, not willing to pay for a MS license or for a Mac.",
              "score": 37,
              "created_utc": 1748556843.0,
              "replies": [
                {
                  "id": "muyso2m",
                  "author": "silentcrs",
                  "body": "This is so stupid. Do you have kids? I do. They don’t just use Windows for gaming. They use the same web browsers and productivity apps adults do for schoolwork. Not every district has Chromebooks.",
                  "score": -4,
                  "created_utc": 1748557488.0,
                  "replies": [
                    {
                      "id": "muyvot3",
                      "author": "blackburnduck",
                      "body": "Precisely, all available on linux. Unless your kid is using CAD, pro tools, adobe suite, maya… for word, excel and web browsing - which is what kids actually use, linux works just fine.\n\nUnless you’re telling me your kids do use specific software only available on x64 based OS… which I very very much doubt.",
                      "score": 24,
                      "created_utc": 1748558481.0,
                      "replies": [
                        {
                          "id": "muyynip",
                          "author": "silentcrs",
                          "body": "They use Word and PowerPoint on Windows like literally hundreds of millions of other people.\n\nSo let me get this straight. You’re suggesting I buy or build a Linux PC with gaming hardware and train my kids to use web apps for productivity purposes (which is often pretty flakey). Never mind that the average Linux distribution isn’t great for gaming and SteamOS doesn’t work on all hardware.\n\nWhy wouldn’t I go with the OS the games and productivity apps are designed to play on in the first place? To save a couple bucks? Occam’s razor, my man.",
                          "score": -1,
                          "created_utc": 1748559455.0,
                          "replies": [
                            {
                              "id": "muz087c",
                              "author": "blackburnduck",
                              "body": "I am telling you that there is word and powerpoint for linux. I am also telling you that you can also get the same results using google suite online.\n\nEdited:\nForgot to say, an OEM license is priced around 150€ when you buy your machine. Factor in the microsoft 355 subscription at another 130€, you have good 300€ for something that can be free.",
                              "score": 17,
                              "created_utc": 1748559976.0,
                              "replies": [
                                {
                                  "id": "muzcjjf",
                                  "author": "release_the_kraken5",
                                  "body": "People pay for the Microsoft suite on their personal devices?",
                                  "score": 2,
                                  "created_utc": 1748564088.0,
                                  "replies": [
                                    {
                                      "id": "muzdkdt",
                                      "author": "blackburnduck",
                                      "body": "Yes. The price of the license is included when you buy the machine.",
                                      "score": 9,
                                      "created_utc": 1748564442.0,
                                      "replies": [
                                        {
                                          "id": "muze6ts",
                                          "author": "release_the_kraken5",
                                          "body": "I didn’t pay for windows 11 on my PC, and I didn’t pay for the office suite for my laptop or PC.\n\nI feel like anyone who is capable of actually running Linux is capable of running massgravel to activate their windows and office.",
                                          "score": -11,
                                          "created_utc": 1748564657.0,
                                          "replies": [
                                            {
                                              "id": "muzgceg",
                                              "author": "blackburnduck",
                                              "body": "That is what valve is bringing to the table. You dont have to e to be “capable of using linux”, as you dont really need to usea sudo apt get on steamOS. Want to play games? It simply works. Want to use it as a computer? It works.\n\nYes, people could always bypass activations, but now you will have a growing number of players being used to using linux as a pc, since it is simply handy with a steam deck. \n\nWhy will I bring a notebook when I can simply dock my steam deck and use it as a computer for anything other than proper work? (And that is my case, as I depend on tools not available on linux).\n\nPicture what would happen if steam deck style got the sales and impact of a nintendo switch, a whole generation of young adults used to using linux on the go.\n\nOr dont… Microsoft itself is acting upon it.",
                                              "score": 7,
                                              "created_utc": 1748565400.0,
                                              "replies": [
                                                {
                                                  "id": "muzoze2",
                                                  "author": "release_the_kraken5",
                                                  "body": "It takes one google search to activate massgravel, way less work than having to set up all that stuff on Linux.\n\nI mean yeah, it would be great to have a widespread competitor to Windows on PC. \n\nMaybe in a few years SteamOS can be that if they’re able to convince game companies to have their anti-cheat run.\n\nBut in the same way that SteamOS “just works” on a steam deck, windows “just works” on computers.\n\nWindows is going to continue to dominate market share for corporate settings, which is much more similar to home use than playing on a steam deck.\n\nIt’s like saying young people are going to use MacBooks because they’re used to iOS from iPhones. Sure, some will and do, but most just stick to windows laptops and computers.",
                                                  "score": -9,
                                                  "created_utc": 1748568394.0,
                                                  "replies": []
                                                }
                                              ]
                                            },
                                            {
                                              "id": "muzr7kk",
                                              "author": "lordraiden007",
                                              "body": "If you’ve ever bought a laptop that wasn’t a Chromebook or Mac you (or its original owner if used) paid for a windows license. The OEM paid for the license and increased their pricing in excess of its cost.",
                                              "score": 2,
                                              "created_utc": 1748569151.0,
                                              "replies": [
                                                {
                                                  "id": "muzstv5",
                                                  "author": "release_the_kraken5",
                                                  "body": "Yes, I’m aware. Do you think that they’re charging a full extra €150/$170 per laptop for windows?\n\nAnd guess what, even if you buy one of those laptops and install Linux, you still paid the up-front charge, so where is the cost savings?\n\nAlso, no laptop manufacturer is charging €130/$150 for the office suite, unless somebody buys it with the laptop for some reason.",
                                                  "score": -2,
                                                  "created_utc": 1748569689.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mv2rtum",
                                  "author": "ChaseballBat",
                                  "body": "Office 365 is not that expensive if you split up a 6 pack between 6 people.",
                                  "score": 1,
                                  "created_utc": 1748616373.0,
                                  "replies": []
                                },
                                {
                                  "id": "muz1ztm",
                                  "author": "silentcrs",
                                  "body": "Please tell me how to install the Office suite on Linux. I’m dying to know this.\n\nAlso, if I’m building a great gaming PC with a new video card and a large amount of fast storage, I’m already looking to spend $1500 to $2000. Why am I penny pinching at that point? To stick it to the man? Who are you? Richard Stallman?",
                                  "score": -3,
                                  "created_utc": 1748560557.0,
                                  "replies": [
                                    {
                                      "id": "muz6sj4",
                                      "author": "blackburnduck",
                                      "body": "Try open office, wps office, libre… any of them can export word format and powerpoints and will work just fine for what any classroom demands.\n\nIf you really insist on office… just use office 365 from your browser, you can use literally anywhere, even on your phone…\n\nAs for a gaming pc: windows 11 is bad for gaming. That was a major red flag for valve and it is the reason portables are going steam os and not windows, specially now with this BS AI integration. I happen to have a 3k machine (now probably around 2k, given that it is a couple of years old) and you’d be surprised how long it takes for the basic file menu to open because of its dumb integration. Looking for a newly installed software? Though luck, try the search bar. Typed in the letter A? Let me give you web results and not find the app you installed until you type 3 more letters.\n\nGabe Newell came to the point of calling windows 11 the death for games because of the absurd amount of resources it uses for just existing and you have no simple way for disabling.\n\nDo I still use windows? Yes. My work demands a little bit more than word and powerpoint, and while there are alternatives for some apps, there are no drivers for a lot of hardware I use, also a lot of plugins are not compatible. \n\nWill I buy my kids a windows if Steam is working fine?  No. Why would I? As I mentioned, office suites are free and even google will do. Save your 300€ and buy a better GPU or 128gb of ram (which is what I have, if you allow me to brag about a little).",
                                      "score": 6,
                                      "created_utc": 1748562136.0,
                                      "replies": [
                                        {
                                          "id": "muzacux",
                                          "author": "silentcrs",
                                          "body": ">Try open office, wps office, libre… any of them can export word format and powerpoints and will work just fine for what any classroom demands.\n\nYou're asking my kids to use software that 1) they're not being trained on in school and 2) isn't used by any business. Everyone uses Office.\n\n>If you really insist on office… just use office 365 from your browser, you can use literally anywhere, even on your phone…\n\nI literally just said the web version was wonky. It's feature incomplete compared to the desktop version and there's zero ways to work on docs offline.\n\n>Gabe Newell came to the point of calling windows 11 the death for games because of the absurd amount of resources it uses for just existing and you have no simple way for disabling.\n\nHe called it the death of gaming because it competes against his product. Gabe has hated Windows for years and he wants to own the entire stack, just like Satya.",
                                          "score": 6,
                                          "created_utc": 1748563332.0,
                                          "replies": [
                                            {
                                              "id": "muzeqos",
                                              "author": "blackburnduck",
                                              "body": "You are not very computer literate, are you?\nYour kids are writing texts and dragging figures on a ppt. They learned to use their smartphones before they were 10.\nIm pretty sure they can click the “save file” where it says “save file”, chose the font where it says “font” and adjust the size where it says size.\n\nAs for online being buggy… that is funny. Most business have moved to 365 through sharepoint and similar. Tell me, what exactly is wonky with your online microsoft word that cant be done for the browser? Does your VLookups return the wrong values in excel? Try the new xlookup. I am more of a google docs person, but I can try to help… i can even draw it for you… if your kids need, I mean.",
                                              "score": 3,
                                              "created_utc": 1748564847.0,
                                              "replies": [
                                                {
                                                  "id": "muzijge",
                                                  "author": "silentcrs",
                                                  "body": ">You are not very computer literate, are you?\n\nI literally research AI.\n\n>Im pretty sure they can click the “save file” where it says “save file”, chose the font where it says “font” and adjust the size where it says size.\n\nYou're not getting it. There is no advantage in them learning applications they're never going to use in the workforce.\n\n>As for online being buggy… that is funny. Most business have moved to 365 through sharepoint and similar.\n\nMost install the desktop apps locally.\n\n>Tell me, what exactly is wonky with your online microsoft word that cant be done for the browser?\n\nYou can't do rulers, gridlines or line numbers in Word online. You can't do draft view or split windows to view two different areas of the doc at the same time. You can't enable or disable document protection. Automatic numbering of lists sometimes flakes out. You can't do macros. Sometimes there's layout issues.\n\nMost importantly, if you're on a plane or any place without connectivity, it flat out won't work. This, as you can imagine, is pretty damn critical.",
                                                  "score": 2,
                                                  "created_utc": 1748566145.0,
                                                  "replies": [
                                                    {
                                                      "id": "mv269g8",
                                                      "author": "pinkornot",
                                                      "body": "Researching ai doesn't make you computer literate cuh",
                                                      "score": -1,
                                                      "created_utc": 1748609705.0,
                                                      "replies": [
                                                        {
                                                          "id": "mv2z0qj",
                                                          "author": "silentcrs",
                                                          "body": "That’s about the dumbest take I’ve ever heard.",
                                                          "score": 1,
                                                          "created_utc": 1748618411.0,
                                                          "replies": [
                                                            {
                                                              "id": "mv2z7zs",
                                                              "author": "pinkornot",
                                                              "body": "Care to amuse me cuh?",
                                                              "score": 0,
                                                              "created_utc": 1748618468.0,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "mv23qqi",
                                              "author": "Otakeb",
                                              "body": ">You're asking my kids to use software that 1) they're not being trained on in school and 2) isn't used by any business. Everyone uses Office.\n\nBro OnlyOffice and LibreOffice are functionally the same as Microsoft office in almost every way such that the skills transfer...\n\nAlso, my business uses open source office suites. All the engineers that use Linux at my work (including me) get along fine with LibreOffice and the webapp for Outlook in our business correspondence.\n\nAll the non-robotics and AI guys are using Windows, sure, but we are a mixed OS office and Linux with open source works fine for half the office.",
                                              "score": 0,
                                              "created_utc": 1748608828.0,
                                              "replies": [
                                                {
                                                  "id": "mv2yk78",
                                                  "author": "silentcrs",
                                                  "body": "How big is your office? How many people?",
                                                  "score": 1,
                                                  "created_utc": 1748618282.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "mv2k9i2",
                                      "author": "Clown_corder",
                                      "body": "In Florida our school system has been google docs first for 12+ years i graduated in 2019 without using office suite more than a dozen times since everything was on Google docs.",
                                      "score": 1,
                                      "created_utc": 1748614199.0,
                                      "replies": [
                                        {
                                          "id": "mv4yy83",
                                          "author": "silentcrs",
                                          "body": "Did you switch to Chromebooks? I mentioned earlier that not everyone has them.",
                                          "score": 1,
                                          "created_utc": 1748639060.0,
                                          "replies": [
                                            {
                                              "id": "mv4zi9i",
                                              "author": "Clown_corder",
                                              "body": "No we didn't have laptops standard issue at that point, there were some Chromebook and aome normal laptop and windows pcs labs.",
                                              "score": 1,
                                              "created_utc": 1748639229.0,
                                              "replies": [
                                                {
                                                  "id": "mv67yh3",
                                                  "author": "silentcrs",
                                                  "body": "Ok.\n\nI would argue that every corporate environment I’ve been in (save one) used Office over G-suite. It’s just a more widely accepted platform for document publishing, spreadsheets and presentations. \n\nIn my profession I do A LOT of writing and presentations. When I used G-suite, I felt hampered by its design. It didn’t seem to have a lot of features I used regularly in Word, Excel and PowerPoint. Docs in particular felt like I was editing an HTML file instead of creating something that was meant to be displayed on a piece of paper. Google Slides just felt really barebones. Maybe it’s changed since then.",
                                                  "score": 1,
                                                  "created_utc": 1748654427.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "muzc4lj",
                              "author": "blastxu",
                              "body": ">Never mind that the average Linux distribution isn’t great for gaming and SteamOS doesn’t work on all hardware.\n\nI've been using and gaming on linux mint for almost two years on my main computer, and games seem to run better than on windows. I haven't encountered any issues, sure i have an AMD card but still.   \nAs long as you don't play games that require kernel level anticheat any game on steam basically just works.\n\nAlso if you really need to use MS office the subscription comes with a web version. But there are other alternatives like [onlyoffice](https://www.onlyoffice.com/en/download-desktop.aspx#desktop) or libreoffice.",
                              "score": 4,
                              "created_utc": 1748563945.0,
                              "replies": [
                                {
                                  "id": "muzfrtw",
                                  "author": "silentcrs",
                                  "body": "Digital Foundry has done benchmarking. Bazzite performance was the same or slightly worse than Windows. [https://www.youtube.com/watch?v=OwWRCrGoXV0](https://www.youtube.com/watch?v=OwWRCrGoXV0)",
                                  "score": 4,
                                  "created_utc": 1748565210.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mv1n3lr",
                              "author": "ToMorrowsEnd",
                              "body": "No they dont they use Office 365 on a web browser.  not a single school installs the MS office suite for students.",
                              "score": 0,
                              "created_utc": 1748602051.0,
                              "replies": [
                                {
                                  "id": "mv2wmw5",
                                  "author": "silentcrs",
                                  "body": "You haven’t been to my district.",
                                  "score": 0,
                                  "created_utc": 1748617735.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mv0yh5n",
              "author": "BevansDesign",
              "body": "They've lost a lot of big opportunities. Let's not forget that they utterly failed in the smartphone market, despite having one of the best platforms at the start.",
              "score": 2,
              "created_utc": 1748588048.0,
              "replies": [
                {
                  "id": "mv0yue8",
                  "author": "AsrielPlay52",
                  "body": "They did try to fix their holes with the UWP application\n\nAllow devs to make 1 application and compile for multiple platform\n\n\nBut that failed because everyone prefer win32",
                  "score": 1,
                  "created_utc": 1748588256.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mv014ds",
          "author": "Blunderhorse",
          "body": "If you work an office job, your employer pays more every year or two for the Windows license on your work PC and virtual desktops than you likely will in a lifetime of being a loyal Microsoft customer.  Some kids’ gaming laptops aren’t going to put a big dent in that.",
          "score": 13,
          "created_utc": 1748572582.0,
          "replies": [
            {
              "id": "mv1082s",
              "author": "blackburnduck",
              "body": "People seriously underestimate how fast tech can be replaced. Save for specific uses that depend on windows and critical legacy systems that were built on windows, most of the world’s companies can do without it with zero loss and saving a lot of money. The only reason a real estate company, a travel agency, a language school, a coffee shop and similar use windows is because people use windows. That is a self fulfilling prophecy. Replace that at the base of learning and you will have a generation of people who do not have any attachment to the system.\n\n\nYes, Microsoft will still profit a lot from big companies that do depend on windows, but for something like 90% of the companies in the world, there is simply no real reason to use windows other than common practice. There is simply no product too big to fail.",
              "score": 6,
              "created_utc": 1748589044.0,
              "replies": []
            },
            {
              "id": "mv2r07d",
              "author": "Oops_I_Cracked",
              "body": "Yes, but a big part of why Windows is used is just inertia. Training your employees on how to use Linux costs more than you save on Windows licenses. The more people that have experience using Linux in their personal life the less true that becomes in the more likely companies will start switching to Linux based systems from Windows based systems. This isn’t going to be an overnight thing, but kids starting to use Lennox is the beginning of the end for windows. Those kids with Linux gaming computers are the tech CEOs of 30 years from now.",
              "score": 1,
              "created_utc": 1748616137.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mv0gii8",
          "author": "driftking428",
          "body": "I thought Linux had been gaining popularity in gaming for years?",
          "score": 4,
          "created_utc": 1748578809.0,
          "replies": []
        },
        {
          "id": "mv0g1h8",
          "author": "waybovetherest",
          "body": "Microsoft has bought half the major game companies they’re in no threat",
          "score": 3,
          "created_utc": 1748578598.0,
          "replies": []
        },
        {
          "id": "mv0s331",
          "author": "OG-DirtNasty",
          "body": "Such a classic Reddit take lol. Linux isn’t ever going to “seriously” threaten Microsoft",
          "score": 2,
          "created_utc": 1748584494.0,
          "replies": [
            {
              "id": "mv1k5sr",
              "author": "baddazoner",
              "body": "it's been the year of linux for 20+ years now give it another ten years and there will be more comments that 2035 is the year of linux.\n\nit's just people that make linux their personality seriously thinking the vast majority of the world from businesses, gamers and non gamer consumers are suddenly going switch.",
              "score": 3,
              "created_utc": 1748600586.0,
              "replies": [
                {
                  "id": "mv2b9xj",
                  "author": "SpeedflyChris",
                  "body": "For desktop/work systems I'd agree, for my own business much of the software we rely on is only available on windows, and I don't see that status quo changing at all in the next decade.\n\nFor a dedicated gaming system though? I have a steam deck, so I already have a dedicated linux PC for gaming at this point. If I were to be building say a dedicated living room gaming PC I'd be very tempted by SteamOS rather than windows.",
                  "score": 1,
                  "created_utc": 1748611384.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mv10rq6",
              "author": "blackburnduck",
              "body": "9 people in Nokia believed the iPhone was a threat to Nokia.  The board said that Apple was never going to “seriously” threaten their company. Here we are.",
              "score": 2,
              "created_utc": 1748589361.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mv15u7o",
          "author": "_makura",
          "body": "2026 will be the year of mobile linux! (we skipped desktop linux).",
          "score": 1,
          "created_utc": 1748592329.0,
          "replies": []
        },
        {
          "id": "mv1w1ve",
          "author": "tejanaqkilica",
          "body": "Very difficult to say, it's hard to drop €2000 on a gaming pc and be able to \"only play games\" with it. At the very least it must serve as a regular computer as well otherwise it's outside of the budget for a lot of people.",
          "score": 1,
          "created_utc": 1748605934.0,
          "replies": []
        },
        {
          "id": "mv0f728",
          "author": "thegamingdovahbat",
          "body": "It’s not just kids. Browser versions of Office 365 are pretty great so if I can do a lot of my work online there’s no further need for Windows. I personally would love to move to something like SteamOS or Bazzite on my main PC but I’m so used to Windows since ‘98 that the thought of it is a little daunting. I suppose I should just get some time off and start dabbling.",
          "score": 1,
          "created_utc": 1748578220.0,
          "replies": []
        },
        {
          "id": "mv0nksg",
          "author": "TONKAHANAH",
          "body": "right? why should the gaming industry keep following the azure server/office 365/Ai-copilot company for their main system, or the system backed by the leading name in PC gaming? \n\nfrom that perspective it just makes sense.",
          "score": 1,
          "created_utc": 1748582160.0,
          "replies": []
        }
      ]
    },
    {
      "id": "muysjbz",
      "author": "Firstbaser",
      "body": "Port the Xbox software to a handheld windows pc how could it be that hard",
      "score": 51,
      "created_utc": 1748557445.0,
      "replies": [
        {
          "id": "muzg1l8",
          "author": "sittingmongoose",
          "body": "That was what this was going to be.",
          "score": 24,
          "created_utc": 1748565299.0,
          "replies": []
        },
        {
          "id": "muzurua",
          "author": "Neo_Techni",
          "body": "> how could it be that hard\n\nwooo boy. Even Nintendo is having some trouble with getting Switch 1 games running on Switch 2. In particular it's the damned shaders issue that plagues gaming. The shaders are compiled specifically for Switch 1's hardware, so Nintendo has to decompile and recompile them since they don't have access to the source code. And this process is not perfect, it's also why Vita hasn't been emulated well yet. Now S1 to S2 is a hardware upgrade, so there are resources to spare towards the conversion/emulation process.\n\nXBOX Series to a portable would not have that advantage, the hardware would likely be weaker than XBOX Series S, as a portable would have to use less power than a device plugged into a wall. That makes it even much harder to get the software running on it. Sacrifices have to be made, ie: resolution/framerate. Now MS has worked on emulation in the XBOX Series to run OG XBOX/360/XBOXone games at higher resolutions/framerates, so they could turn those hacks backwards to lower requirements, but they don't have such a system for Series games. But like Switch, the shader issue will be there.",
          "score": 14,
          "created_utc": 1748570340.0,
          "replies": [
            {
              "id": "muzye1u",
              "author": "Dt2_0",
              "body": "The bigger difference is the architecture of most gaming handhelds and the Xboxes is very, very similar. Apparently there was some serious hardware issues with getting Switch games on Switch 2.\n\nXbox is already a Ryzen APU with Radeon Graphics system with unified RAM, just like most of these gaming handhelds. The Xbox also already runs a modified version of Windows.",
              "score": 18,
              "created_utc": 1748571600.0,
              "replies": [
                {
                  "id": "mv087lx",
                  "author": "Firstbaser",
                  "body": "Exactly they just don’t see enough money in it plus the flip flopping taco tariffs don’t help",
                  "score": 7,
                  "created_utc": 1748575281.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mv0fzln",
              "author": "Space_Lux",
              "body": "That’s mainly because Switch 2 uses an ARM chip instead of x86 as before.",
              "score": 1,
              "created_utc": 1748578575.0,
              "replies": [
                {
                  "id": "mv0idgw",
                  "author": "Neo_Techni",
                  "body": "I think you misread.\n\nI was saying Nintendo is having trouble getting Switch 1 (ARM) running on Switch 2 (also ARM).",
                  "score": 3,
                  "created_utc": 1748579659.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mv083fb",
              "author": "Firstbaser",
              "body": "They can’t render at 480 or 720 and upscale to 1080. I bet they could. Game pass on mobile that’s not stupid steaming would sell. Just help asus port the Xbox os.",
              "score": -2,
              "created_utc": 1748575233.0,
              "replies": [
                {
                  "id": "mv0d0d5",
                  "author": "Neo_Techni",
                  "body": "none of what you said made sense\n\nAnd they'd have to go from a higher resolution, down. XBOX Series is made for 1440p/4K, and the portable would be 720p or 1080p tops.\n\nYou can't just \"port\" the OS, the games run on specific hardware. You seem to have not read my previous post.",
                  "score": 1,
                  "created_utc": 1748577267.0,
                  "replies": [
                    {
                      "id": "mv1jorc",
                      "author": "Firstbaser",
                      "body": "It’s windows not some crazy software Xbox runs on windows. It’s a damn ryzen chip there are millions",
                      "score": 1,
                      "created_utc": 1748600338.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mv1dhqk",
          "author": "IT_techsupport",
          "body": "> how could it be that hard\n\naah, Must be blissfull living in such ignorance.",
          "score": 6,
          "created_utc": 1748596900.0,
          "replies": [
            {
              "id": "mv1jt57",
              "author": "Firstbaser",
              "body": "Xbox runs on windows and a ryzen chip it’s not 20 years a go these things are pcs.",
              "score": -1,
              "created_utc": 1748600403.0,
              "replies": [
                {
                  "id": "mv1kn53",
                  "author": "IT_techsupport",
                  "body": "Go learn some linear algreba first, no some basic programming, then comment on how shader architectures should align in all sort of custom computer chips. lets not even being on wattage /power comsumption optimization. \n\n\"how could it be that hard\" geesssh",
                  "score": 4,
                  "created_utc": 1748600836.0,
                  "replies": [
                    {
                      "id": "mv1nd8m",
                      "author": "Firstbaser",
                      "body": "They already do dynamic resolution",
                      "score": -1,
                      "created_utc": 1748602177.0,
                      "replies": [
                        {
                          "id": "mv1nh6y",
                          "author": "Firstbaser",
                          "body": "wtf does a laptop already do or other windows handhelds the wheel does not need to be invited here they already do this",
                          "score": 0,
                          "created_utc": 1748602228.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "muzugrl",
      "author": "RMRdesign",
      "body": "The tariffs probably made pushing this back an easy choice.",
      "score": 13,
      "created_utc": 1748570235.0,
      "replies": []
    },
    {
      "id": "muyiy27",
      "author": "peppruss",
      "body": "More like, with tariffs, why make a new device? Optimize titles and software for all the millions of Steam Decks, Legion go, ROG etc. No rush.",
      "score": 72,
      "created_utc": 1748554451.0,
      "replies": [
        {
          "id": "muyjem7",
          "author": "NorysStorys",
          "body": "It’s less that and more that microsoft is worried that the gaming handheld market is about to hard pivot to SteamOS so windows licenses to the OEMs that make the devices are potentially about to plummet as SteamOS becomes usable on more and more handhelds.",
          "score": 58,
          "created_utc": 1748554592.0,
          "replies": [
            {
              "id": "muyryby",
              "author": "ContributionOld2338",
              "body": "Yeah, first gaming handhelds, then gaming pcs, then …. Your mom!",
              "score": 20,
              "created_utc": 1748557257.0,
              "replies": []
            },
            {
              "id": "muysab1",
              "author": "silentcrs",
              "body": "There aren’t that many Windows handhelds sold in the first place for it to “plummet”. The Steam Deck has only sold 4 million devices. Compare that to the estimated 1.5 BILLION Windows devices. It’s a drop in the bucket.",
              "score": 17,
              "created_utc": 1748557364.0,
              "replies": [
                {
                  "id": "muyvvt8",
                  "author": "NorysStorys",
                  "body": "While true, it’s an emerging market and Microsoft want to have themselves in it.",
                  "score": 18,
                  "created_utc": 1748558544.0,
                  "replies": []
                },
                {
                  "id": "muzfxpj",
                  "author": "sittingmongoose",
                  "body": "They could lose the entire gaming market on windows though.  Not just handhelds.",
                  "score": 4,
                  "created_utc": 1748565264.0,
                  "replies": [
                    {
                      "id": "muzkmnk",
                      "author": "silentcrs",
                      "body": "Considering the official version of SteamOS runs on practically nothing, I don’t see that happening anytime soon. You can of course install Bazzite, but Digital Foundry found it to be as performant (or slightly worse) than Windows performance, not better.",
                      "score": 2,
                      "created_utc": 1748566868.0,
                      "replies": [
                        {
                          "id": "muzl5i2",
                          "author": "sittingmongoose",
                          "body": "It was just released officially for the next two biggest headsets this week.  And will be eventually released to the public. \n\nAnd performance isn’t the advantage, it’s the UI that is the advantage.\n\nEdit:handhelds",
                          "score": 3,
                          "created_utc": 1748567052.0,
                          "replies": [
                            {
                              "id": "muzngc4",
                              "author": "silentcrs",
                              "body": "I think you meant handhelds.\n\nAlso, it wouldn’t take much for Microsoft to create a good handheld interface. They have the existing Xbox interface that itself runs on a version of Windows. If you stream Xbox cloud, it shows a great interface that works well on a phone in a browser and is fully accessible through a controller. They know how to do this, it’s just a matter of executing on it.",
                              "score": 2,
                              "created_utc": 1748567857.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "muyxz05",
      "author": "lazzzym",
      "body": "UPDATE: Previously, this article noted \"Pembrooke\" as the codename for the handheld, but we've received clarification that this codename might be incorrect, stay tuned for an update on that part. The rest of the report remains unchanged.\n\nHow do we even know this report is correct if the codename is incorrect?",
      "score": 8,
      "created_utc": 1748559234.0,
      "replies": [
        {
          "id": "mv27w72",
          "author": "ThePrussianGrippe",
          "body": "I feel like what the code name is isn’t really critical to the discussion of the handheld being sidelined.",
          "score": 1,
          "created_utc": 1748610262.0,
          "replies": [
            {
              "id": "mv2apz2",
              "author": "Spooky_U",
              "body": "Yeah the codenames change a lot imo especially if they had plans for multiple models or tiers.",
              "score": 1,
              "created_utc": 1748611204.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mv0xwnl",
      "author": "10113r114m4",
      "body": "Windows is too fat they are learning",
      "score": 4,
      "created_utc": 1748587727.0,
      "replies": []
    },
    {
      "id": "mv0z6hb",
      "author": "OwnPension8884",
      "body": "Microsoft’s like a fat kid with rich parents, he has all the resources in the world and lives like a crackhead.",
      "score": 5,
      "created_utc": 1748588446.0,
      "replies": []
    },
    {
      "id": "mv03n89",
      "author": "baylonedward",
      "body": "SteamOS.\n\nNever thought gaming will be the real reason for Linux being a threat and contender against Windows in consumer space lol.",
      "score": 14,
      "created_utc": 1748573500.0,
      "replies": [
        {
          "id": "mv0jo4y",
          "author": "SUPRVLLAN",
          "body": "It makes the most sense, *especially* because it’s backed by Steam/Valve. \n\nLinux has always been held back by not having a big name leader distro, SteamOS can absolutely be the catalyst that really pushes mainstream adoption.",
          "score": 7,
          "created_utc": 1748580265.0,
          "replies": []
        },
        {
          "id": "mvau63e",
          "author": "Sammolaw1985",
          "body": "Before SteamOS, Windows had a monopoly on the OS of choice for PC gaming. Looking forward to my future using steamOS desktop. I don't even know why I use windows these days, it's not like there's any exclusive software on there I can't get on other OS's.",
          "score": 2,
          "created_utc": 1748722403.0,
          "replies": []
        },
        {
          "id": "mv3fw3u",
          "author": "irqlnotdispatchlevel",
          "body": "There are increasingly fewer reasons to own a personal PC for recreational purposes. Gaming is one of the strongest reasons to own a PC.",
          "score": 1,
          "created_utc": 1748623167.0,
          "replies": []
        }
      ]
    },
    {
      "id": "muyrilw",
      "author": "ContributionOld2338",
      "body": "They were scared people would sideload steamos on it and it would preform better",
      "score": 17,
      "created_utc": 1748557116.0,
      "replies": [
        {
          "id": "muzev70",
          "author": "Xelanders",
          "body": "Not just sideload, it looks like a lot of these devices will start shipping with SteamOS by default (Legion Go S for example). I guess MS could bribe OEMs to exclusively support Windows (which I’m sure antitrust lawyers would love) but otherwise I think a lot of customers are going to pick the Steam option.",
          "score": 12,
          "created_utc": 1748564890.0,
          "replies": [
            {
              "id": "mv19ovj",
              "author": "rudedude94",
              "body": "Exactly, they might as well compete properly with their own OS. At this rate users won’t need side load since OEMs will just ship with cheaper, better performing SteamOS.",
              "score": 1,
              "created_utc": 1748594636.0,
              "replies": [
                {
                  "id": "mx7sqp0",
                  "author": "ContributionOld2338",
                  "body": "Yeah windows costs is a ton… Expecially if you live in a western country.. the only game I can think of that isn’t supported is Fortnite",
                  "score": 1,
                  "created_utc": 1749656155.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mv0td8v",
      "author": "g---e",
      "body": "SteamOS pretty much beat em to the punch.",
      "score": 3,
      "created_utc": 1748585179.0,
      "replies": []
    },
    {
      "id": "mv2muge",
      "author": "hushpuppi3",
      "body": "I miss when companies developed things secretly so you'd only hear about it when it was either out or about to come out",
      "score": 3,
      "created_utc": 1748614952.0,
      "replies": []
    },
    {
      "id": "muz8jy2",
      "author": "A_FitGeek",
      "body": "Zune 2.0 electric buggaloo",
      "score": 9,
      "created_utc": 1748562717.0,
      "replies": []
    },
    {
      "id": "muyomoe",
      "author": "iamacannibal",
      "body": "I would not be surprised if there is not going to even be another Xbox console ever again. They have been leaning hard into PC stuff these last couple years. \n\nAt this point there is no reason to buy Xbox over ps5 unless you are stuck in that ecosystem. \n\nLast PlayStation I had was a PS2 I never used because I always used my Xbox. Then my 360. Then my One then One X then I moved to PC. I’m going to be buying a console just for GTA 6 next year and it is almost certainly going to be a PS5 Pro.",
      "score": 16,
      "created_utc": 1748556198.0,
      "replies": [
        {
          "id": "muytp45",
          "author": "Battlefire",
          "body": "Unless they want to drop the majority of their Game Pass subs. That isn't going to happen. And they aren't even close to full xcloud integration.",
          "score": 10,
          "created_utc": 1748557824.0,
          "replies": [
            {
              "id": "muzmcws",
              "author": "dacontag",
              "body": "Im not too sure about that for one reason, they've been seeing the majority of their growth in game pass subs on pc while xbox subs have stagnated.",
              "score": 1,
              "created_utc": 1748567473.0,
              "replies": [
                {
                  "id": "muzroma",
                  "author": "Battlefire",
                  "body": "Even if that is the case that is too many subs to let go.",
                  "score": 3,
                  "created_utc": 1748569306.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "muzuqet",
          "author": "kenshinakh",
          "body": "There's a lot of people who will just get the next Xbox because it's what they are used to and Game Pass. Mid gen upgrades is kinda iffy this generation given the pretty low benefits of upgrading to a Pro (from what I read from ppl saying the next console is in 2-3 years).",
          "score": 3,
          "created_utc": 1748570326.0,
          "replies": []
        },
        {
          "id": "muz3nqd",
          "author": "onikaroshi",
          "body": "Pretty sure they already announced the newest Xbox will be a windows pc focused on gaming. Like you’ll be able to install steam on it even",
          "score": 3,
          "created_utc": 1748561099.0,
          "replies": [
            {
              "id": "muzxjty",
              "author": "LocustUprising",
              "body": "Take my money",
              "score": 3,
              "created_utc": 1748571301.0,
              "replies": []
            }
          ]
        },
        {
          "id": "muysbto",
          "author": "wrathmont",
          "body": "Yeah, there indeed are people “stuck” in the ecosystem but Microsoft will probably offer a half-hearted out to such people (jump ship with some of your library to PC!) at some point and then wash their hands of the hardware. They can’t, or more realistically are unlikely to as a for-profit corporation, keep the lights on until the end of time just to maintain them. I’m sure they’d keep the servers and stuff going for many years so it may simply look like quiet quitting by way of limited support and not offering a next generation option down the line.",
          "score": 1,
          "created_utc": 1748557378.0,
          "replies": []
        }
      ]
    },
    {
      "id": "muzygi6",
      "author": "zoetectic",
      "body": "The praise and let's say 'enlightening' direct performance comparisons with the new SteamOS Legion Go must have woken them up. Good.",
      "score": 2,
      "created_utc": 1748571624.0,
      "replies": []
    },
    {
      "id": "mv0odab",
      "author": "mrheosuper",
      "body": "Would be funny if all MS does is using WSL to play games.",
      "score": 2,
      "created_utc": 1748582561.0,
      "replies": [
        {
          "id": "mv0rd89",
          "author": "TheMSensation",
          "body": "Didn't they axe WSL in the latest windows update?\n\nEdit: nevermind it was WSA (android) that was terminated.",
          "score": 1,
          "created_utc": 1748584117.0,
          "replies": [
            {
              "id": "mv0rh2y",
              "author": "mrheosuper",
              "body": "I dont hear anything about it, and i dont think they have a good reason to cancel wsl.",
              "score": 1,
              "created_utc": 1748584174.0,
              "replies": [
                {
                  "id": "mv0ru5b",
                  "author": "TheMSensation",
                  "body": "yeh my bad it was the android integration that they killed.",
                  "score": 1,
                  "created_utc": 1748584364.0,
                  "replies": [
                    {
                      "id": "mv1y9jk",
                      "author": "hbkdll",
                      "body": "And here I was, who only upgraded to win 11 cuz of the promise of WSA. Now I miss my win 10.",
                      "score": 1,
                      "created_utc": 1748606802.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mv0z0ad",
      "author": "cunningmunki",
      "body": "Too late",
      "score": 2,
      "created_utc": 1748588348.0,
      "replies": []
    },
    {
      "id": "mv6kycn",
      "author": "Voyager_316",
      "body": "Fuck Windows, and fuck Microshit.",
      "score": 2,
      "created_utc": 1748659412.0,
      "replies": []
    },
    {
      "id": "mv04wvn",
      "author": "WretchedMisteak",
      "body": "I've said it so many times, if MS just made a barebones OS for desktops, and free, people would use it.  Like a core edition.  \n\nAnything more than that attracts a fee.\n\nBut jeez under Satya's leadership, MS has really flopped in this area.  I wouldn't be surprised if he's not already got a pilot program to allow a certain amount of clicks within the OS before you have to pay a subscription fee.",
      "score": 2,
      "created_utc": 1748573979.0,
      "replies": []
    },
    {
      "id": "muzqpqm",
      "author": "GoldieForMayor",
      "body": "Oh, so going the same route they went with Windows Phone because that worked out so well.",
      "score": 2,
      "created_utc": 1748568987.0,
      "replies": []
    },
    {
      "id": "mv064a7",
      "author": "wilem",
      "body": "Installed SteamOS on my Ally Extreme. They should be concerned. It is a much better experience.",
      "score": 2,
      "created_utc": 1748574449.0,
      "replies": []
    },
    {
      "id": "muz4vh7",
      "author": "Fredasa",
      "body": "I'm surprised they're working on a portable at all, when the way forward for them (and what they'll probably settle on) is to offer Gamepass on Steam's / Sony's portable platforms and whatever else meets a certain minimum spec.",
      "score": 3,
      "created_utc": 1748561499.0,
      "replies": []
    },
    {
      "id": "muzqcmp",
      "author": "SithKain",
      "body": "From my perspective, this is the wrong move. I'm not interested in Win11, in fact, I hate it. Why did they move all that stuff around?\n\nIt has bothered me to the point I'm willing to swap OS entirely -  *potentially relearn the entire thing from the ground up* - just to spite Microsoft.",
      "score": 2,
      "created_utc": 1748568864.0,
      "replies": []
    },
    {
      "id": "muyu9je",
      "author": "RentalGore",
      "body": "Isn’t this the smart play?  Xbox as a hardware device is getting smacked around, and it’s only going to get worse with switch 2.\n\nOptimizing windows 11 for the tons of handhelds that are out there makes a ton of sense. \n\nOr am I missing something?",
      "score": 3,
      "created_utc": 1748558011.0,
      "replies": [
        {
          "id": "muz3zdq",
          "author": "Hikashuri",
          "body": "Switch 2 isn't going to affect PS/XBOX/Handhelds because the Switch is mainly bought for nintendo games, not for non nintendo games.",
          "score": 5,
          "created_utc": 1748561205.0,
          "replies": [
            {
              "id": "muz9k4a",
              "author": "RobertdBanks",
              "body": "Xbox is specifically bringing games over to Nintendo, with rumors of games like Halo and Gears of War being brought over. It will 100% affect the likelihood of buying an Xbox if you can just play all the previously exclusive games on a Nintendo console. \n\nI know what you mean as far as Nintendo has always been its own thing, but with what I mentioned there is definitely more cross over between Nintendo and Xbox in the future. Especially when Xbox is raising their prices of consoles by $100 or more.",
              "score": 0,
              "created_utc": 1748563056.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mv0ftfs",
      "author": "Space_Lux",
      "body": "I actually switched away from my Steam Deck because of mods.\nIs really tiresome and often not possible at all to mod games on SteamOS.",
      "score": 1,
      "created_utc": 1748578497.0,
      "replies": []
    },
    {
      "id": "mv0gzgm",
      "author": "Space_Lux",
      "body": "Good vid on that from The Phawx:\n\nhttps://youtu.be/7gzkKL-axCM?si=WZjJuw8n_9JEpJ_r",
      "score": 1,
      "created_utc": 1748579022.0,
      "replies": [
        {
          "id": "mv159ea",
          "author": "JimmyRecard",
          "body": "So, you need to use the terminal on Windows to get usable performance, while Linux works out of the box?",
          "score": 1,
          "created_utc": 1748591992.0,
          "replies": [
            {
              "id": "mv7t2yi",
              "author": "dorchegamalama",
              "body": "Isn't ironic? 😂",
              "score": 1,
              "created_utc": 1748682030.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mv0r1cp",
      "author": "Lmoneyfresh",
      "body": "I swear last week I read a story about how they were really close to announcing the handheld?",
      "score": 1,
      "created_utc": 1748583945.0,
      "replies": []
    },
    {
      "id": "mv0r5ha",
      "author": "vacantbay",
      "body": "Go Linux go!",
      "score": 1,
      "created_utc": 1748584004.0,
      "replies": []
    },
    {
      "id": "mv0x31m",
      "author": "you-are-not-yourself",
      "body": "Microsoft's biggest gaming threat hasn't been other consoles. Hasn't been for years. It's Mac OS and Linux OS.",
      "score": 1,
      "created_utc": 1748587264.0,
      "replies": []
    },
    {
      "id": "mv0xvkj",
      "author": "idebugthusiexist",
      "body": "It was most likely going to fail anyways.",
      "score": 1,
      "created_utc": 1748587709.0,
      "replies": []
    },
    {
      "id": "mv15ijg",
      "author": "Dio44",
      "body": "The Xbox team is one of the handheld for 10 years and I’m pretty sure they prototyped that many devices over the years. The problem is Microsoft can’t make up their mind on hardware and just like with phones and everything else, they are too late to the game to lead.",
      "score": 1,
      "created_utc": 1748592140.0,
      "replies": []
    },
    {
      "id": "mv169dz",
      "author": "anticerber",
      "body": "Man this makes all those YouTube videos about Xbox destroying the other consoles by having Steam seem to age like milk. And that was just like a month ago ",
      "score": 1,
      "created_utc": 1748592578.0,
      "replies": []
    },
    {
      "id": "mv19n09",
      "author": "gokarrt",
      "body": "at this point i'm hoping they introduce a proper game mode. alternate shell with limited background tasks and a controller/touch-friendly interface would be awesome for both handhelds and PC-TV gamers (there are dozens of us!)",
      "score": 1,
      "created_utc": 1748594606.0,
      "replies": []
    },
    {
      "id": "mv1lg46",
      "author": "ToMorrowsEnd",
      "body": "Microsoft will only make a crappy one just like how their Surface laptops are crap compared to what I can buy from real hardware makers.   I'm ok with them backing off.",
      "score": 1,
      "created_utc": 1748601247.0,
      "replies": []
    },
    {
      "id": "mv1rahs",
      "author": "quentinvespero",
      "body": "i feel like this pattern of Microsoft struggling to gain traction with a software keeps repeating over and over.. \n\nThe result of doing poor user-experience products imo 🤷🏻‍♂️",
      "score": 1,
      "created_utc": 1748603947.0,
      "replies": []
    },
    {
      "id": "mv1t66s",
      "author": "Catch_022",
      "body": "Fix gamepass download speed. I get about 10% of my actual bandwidth when downloading gamepass games on my PC. \n\nThis doesn't affect steam downloads btw.",
      "score": 1,
      "created_utc": 1748604748.0,
      "replies": []
    },
    {
      "id": "mv269m4",
      "author": "Kuli24",
      "body": "You know what microsoft should do?  Make xbox online FREE.  Keep the weird subscriptions for game library access, sure, but make playing online against others free as it should be.",
      "score": 1,
      "created_utc": 1748609706.0,
      "replies": []
    },
    {
      "id": "mv28d30",
      "author": "smilinmaniag",
      "body": "Why don't they actually just cut all the  fat from the base editions of Windows first, then from that make a separate, \"game\" edition? Even Home basic has so much useless clutter it is ridiculous.",
      "score": 1,
      "created_utc": 1748610421.0,
      "replies": []
    },
    {
      "id": "mv2k788",
      "author": "Devilofchaos108070",
      "body": "Or it was never true they were making one in the first place and all these rumors were bullshit.\n\n\nHeadline reads like it was ever confirmed.  It was not",
      "score": 1,
      "created_utc": 1748614181.0,
      "replies": []
    },
    {
      "id": "mv5wnw2",
      "author": "Givenchy_stone",
      "body": "special unpack busy roof complete crawl degree innate governor political\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "score": 1,
      "created_utc": 1748650236.0,
      "replies": []
    },
    {
      "id": "mv66r3h",
      "author": "nbunkerpunk",
      "body": "This is the wrong move, imo. You will likely sell an Xbox branded handheld to far more than a windows branded handheld.  I would imagine the performance would be much better as well, seeing that the Xbox OS is leaps and bounds lighter than Windows Mobile. \n\nWhat on earth is MS doing? I swear these decisions are being made by people that have no idea what the gaming community actually want.  They see windows as a bigger brand so they think that will sell better. Which is simply not the case.  Outside of business related circles, Windows has a pretty negative reputation. For good reason too.",
      "score": 1,
      "created_utc": 1748653970.0,
      "replies": []
    },
    {
      "id": "mv69s2b",
      "author": "JasonP27",
      "body": "I feel like this is a good move. If the original plan was for a handheld and console to be released at the same time, Series X/S style where every game must be capable of running on both they were gonna have more issues than when X/S were launched.\n\nLaunch the handheld a year or two after the console and they at least can have some better chances of developers porting games to the handheld. Not sure they should require all software to have a handheld mode, but all first party software should be able to do it.",
      "score": 1,
      "created_utc": 1748655120.0,
      "replies": []
    },
    {
      "id": "muysf4o",
      "author": "Firstbaser",
      "body": "Stupid idea Microsoft",
      "score": 1,
      "created_utc": 1748557408.0,
      "replies": []
    },
    {
      "id": "muz5oe9",
      "author": "count_chocul4",
      "body": "Vaporware",
      "score": 1,
      "created_utc": 1748561767.0,
      "replies": []
    },
    {
      "id": "muziqi2",
      "author": "Sarspazzard",
      "body": "Its too late. I'm already going to Steam OS as soon as it's practical. My telemetry data and update schedule are my own prerogative. At best, I'll dual boot.",
      "score": 1,
      "created_utc": 1748566212.0,
      "replies": [
        {
          "id": "mv151bv",
          "author": "JimmyRecard",
          "body": "Careful. [Microsoft breaks dual boot](https://www.bleepingcomputer.com/news/microsoft/august-windows-security-update-breaks-dual-boot-on-linux-systems/) with Linux and despite the fix being absolutely trivial waits 8 months to [fix it](https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-linux-boot-issues-on-dual-boot-windows-systems/).",
          "score": 1,
          "created_utc": 1748591863.0,
          "replies": [
            {
              "id": "mv1i7hi",
              "author": "Sarspazzard",
              "body": "No problem. I'll boot from a separate drive 🫡",
              "score": 1,
              "created_utc": 1748599543.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "muzuo80",
      "author": "SMikahla",
      "body": "PC handhelds are the future anyway",
      "score": 1,
      "created_utc": 1748570305.0,
      "replies": []
    },
    {
      "id": "mv064bz",
      "author": "nwordbird",
      "body": "Common Xbox L",
      "score": 0,
      "created_utc": 1748574449.0,
      "replies": []
    },
    {
      "id": "muzi8m8",
      "author": "obelix_dogmatix",
      "body": "I predict xbox gets one generation more, and that is the nail in the coffin for Msft gaming.",
      "score": -2,
      "created_utc": 1748566041.0,
      "replies": []
    },
    {
      "id": "muz0q63",
      "author": "runnybumm",
      "body": "How is a handheld possible when even a 5090 gets such poor performance",
      "score": -4,
      "created_utc": 1748560141.0,
      "replies": []
    },
    {
      "id": "muykxe1",
      "author": "Chickat28",
      "body": "I suspect they will only release one box next gen. With increased silicon costs PS6 will likely be 600 at launch so I think Nextbox will be a little less powerful than PS6 and only 499. Then they will release the Xboy handheld in the middle of the gen around 2031. It allows mobile silicone to mature more. It will mean a handheld probably on par with Series X and PS5 instead of Series S at best if they released it sooner.",
      "score": -11,
      "created_utc": 1748555056.0,
      "replies": [
        {
          "id": "muys8qj",
          "author": "ContributionOld2338",
          "body": "Wouldn’t it be the opposite?",
          "score": 3,
          "created_utc": 1748557351.0,
          "replies": []
        },
        {
          "id": "muysokl",
          "author": "wrathmont",
          "body": "What would be the point? Are they just supposed to keep making hardware forever until the worldwide sales look like Japan?",
          "score": 0,
          "created_utc": 1748557492.0,
          "replies": [
            {
              "id": "muyu23n",
              "author": "Battlefire",
              "body": "For the game pass user on console? Yes.",
              "score": 3,
              "created_utc": 1748557943.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}