{
  "post": {
    "title": "GPD MicroPC 2 is a pocket-sized PC with Intel's new Twin Lake chip | First update in six years for the 7-inch Windows (or Linux) 2-in-1",
    "author": "chrisdh79",
    "id": "1lx6ql6",
    "score": 152,
    "created_utc": 1752240034.0,
    "selftext": "",
    "num_comments": 15,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lx6ql6/gpd_micropc_2_is_a_pocketsized_pc_with_intels_new/"
  },
  "comments": [
    {
      "id": "n2jmyrf",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1752240035.0,
      "replies": []
    },
    {
      "id": "n2p3fii",
      "author": "gargravarr2112",
      "body": "I have the original Micro PC. It's such a great little device for me as a Linux sysadmin. I even took it traveling instead of my full-size laptop and it did everything I needed it to.",
      "score": 16,
      "created_utc": 1752308834.0,
      "replies": [
        {
          "id": "n2pf3v1",
          "author": "HJJR31",
          "body": "I used to do IT work configuring networks switches and used the original Micro PC too. The size and only having to carry the db9 to rj45 serial console cable made jumping from switch to switch so easy. Until the battery went out and GPD support was non-existent (common issue).",
          "score": 4,
          "created_utc": 1752315874.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2kxzqv",
      "author": "flower4000",
      "body": "Definitely Linux, it’s faster for most gaming, has no bloat/spyware, it’s os is like 65gigs smaller, oh and  drivers are built in so you don’t need to hunt stuff down.",
      "score": 12,
      "created_utc": 1752253612.0,
      "replies": [
        {
          "id": "n2mnuaj",
          "author": "HanzoNumbahOneFan",
          "body": "Ya I'm very close to just going full Linux. I think I'll be fully swayed when the next Windows update sneaks in while I'm AFK and stops me from playing my favorite video games from a bug. And the update will have no other purpose than they want to shove more ads down my throat.",
          "score": 1,
          "created_utc": 1752271869.0,
          "replies": [
            {
              "id": "n2ngbhf",
              "author": "Neo_Techni",
              "body": "> And the update will have no other purpose than they want to shove more ads down my throat.\n\njust deleted that stupid reusable UI MS uses to put ads on Windows 10, again.",
              "score": 0,
              "created_utc": 1752281826.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n2joo5g",
      "author": "Iron_Burnside",
      "body": "An Intel chip... inb4 the CPU gets so hot it desolders itself.",
      "score": 27,
      "created_utc": 1752240584.0,
      "replies": [
        {
          "id": "n2t77zd",
          "author": "Yes-times-infinity",
          "body": "I know you're just making a joke, but this is an Intel N250, which is a low powered design with a PL1 of 6W / max 15W. Every time I see the same \"Intel CPU hot!!\" meme being upvoted, I cringe because it promotes technical illiteracy.",
          "score": 8,
          "created_utc": 1752363040.0,
          "replies": []
        },
        {
          "id": "n2k09sq",
          "author": "None",
          "body": "[deleted]",
          "score": 13,
          "created_utc": 1752244102.0,
          "replies": [
            {
              "id": "n2k3l0g",
              "author": "narwhal_breeder",
              "body": "Software still sucks on anything that isn’t a Mac. \n\nAnything under Ring-3 (userspace) needs to be native ARM. \nWindows doesnt allow emulation of drivers (it'd be very difficult/mostly impossible to emulate even if they did allow it). \n\nAnd OEMs haven't really been keen to release WinARM driver packages because of how few people own them, so they windows ARM is stuck in a catch-22. \n\nMicrosofts biggest hinderance has been its very, very loose requirements from its OEMs around ARM. Theres nothing stopping MS from saying \"we're going to stop signing driver bundles that dont include an ARM binary\", but they havent. \n\nSo no anti-cheat, most antivirus doesnt work, a lot of incompatibilities around anything that needs specialized hardware features (NPU/GPU/Rendering/Ect). VPN clients can have issues. \n\nLack of NPU support kills a lot of number-crunchy applications as well.",
              "score": 20,
              "created_utc": 1752245061.0,
              "replies": [
                {
                  "id": "n2mara2",
                  "author": "Iron_Burnside",
                  "body": "Anti-cheat software expansion would be big for driving gamers onto ARM, but a lot is still not supported on Linux x86 machines.",
                  "score": 3,
                  "created_utc": 1752267755.0,
                  "replies": [
                    {
                      "id": "n2mb2g7",
                      "author": "narwhal_breeder",
                      "body": "I think the bigger hurdle is snapdragons poor GPU and no support for external GPUs.",
                      "score": 5,
                      "created_utc": 1752267850.0,
                      "replies": [
                        {
                          "id": "n2mc291",
                          "author": "Iron_Burnside",
                          "body": "Poor iGPUs would be easily worked around if dGPUs were supported, but together, you're right.",
                          "score": 3,
                          "created_utc": 1752268154.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n2kltml",
                  "author": "karateninjazombie",
                  "body": "Yeah it's a shame. Arm software is somewhat fragmented. I've got a rockpro64 that's great and has Debian support. But it's hit and miss if packages are available. But it idles at super low power and isn't a slouch for what it is, which would make for a great little Nas or mini server. But again it's knee capped by software.\n\nThat and I have to use a pre built image for arm SBCs. You don't Install like you do via x86 based stuff. You build or get an image and write it to the devices storage medium. I'm sure that puts off a lot of people too.",
                  "score": 2,
                  "created_utc": 1752250177.0,
                  "replies": [
                    {
                      "id": "n2kmfbd",
                      "author": "narwhal_breeder",
                      "body": "Our production servers are 99% ARM on Linux - and all of our dev machines are ARM macs - it's honestly been super, super great.\n\nNever had an issue with non-legacy *server* software in ARM-land now that Nvidia has ARM CUDA drivers, but still leaves a ton to be desired desktop-wise in Linux/Windows-land.\n\nWe're probably 85% Rust on ARM, 14% Python on ARM, and 1% legacy Python on x86.",
                      "score": 3,
                      "created_utc": 1752250350.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}