{
  "post": {
    "title": "Why Trump’s Metal Tariffs Won’t Lead to the All-American iPhone",
    "author": "a_Ninja_b0y",
    "id": "1isr8cr",
    "score": 1640,
    "created_utc": 1739922909.0,
    "selftext": "",
    "num_comments": 161,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1isr8cr/why_trumps_metal_tariffs_wont_lead_to_the/"
  },
  "comments": [
    {
      "id": "mdixom8",
      "author": "ImmediatelyOrSooner",
      "body": "Because just tariffs alone don’t solve anything. Don’t even need to read the article to know that.",
      "score": 598,
      "created_utc": 1739923490.0,
      "replies": [
        {
          "id": "mdizlxq",
          "author": "joebo333",
          "body": "Exactly if there isn't a manufacturing infrastructure in place to make the items tariffs won't shift manufacturing and they would have to be ungodly high to make it worth something building the infrastructure to manufacture the item",
          "score": 192,
          "created_utc": 1739924110.0,
          "replies": [
            {
              "id": "mdj07zy",
              "author": "None",
              "body": "[removed]",
              "score": 143,
              "created_utc": 1739924303.0,
              "replies": [
                {
                  "id": "mdlencd",
                  "author": "None",
                  "body": "[removed]",
                  "score": 62,
                  "created_utc": 1739962340.0,
                  "replies": [
                    {
                      "id": "mdlhc75",
                      "author": "ImmediatelyOrSooner",
                      "body": "You can just say republican. It’s 2025, there’s no such thing as a non-maga republican anymore.",
                      "score": 39,
                      "created_utc": 1739963822.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mdlmljr",
              "author": "xRockTripodx",
              "body": "Even then, it would take YEARS to get this shit working domestically. All tariffs are going to do, the only thing they can do, is make things harder for the average American.",
              "score": 21,
              "created_utc": 1739966514.0,
              "replies": [
                {
                  "id": "mdlp8zh",
                  "author": "OneWingedA",
                  "body": "There is an interview on forgotten weapons about a company setting up domestic production of a red dot sight. It took them three years to set everything up with one thing still being made outside the US because it's only made at two sources globally. \n\nA red dot is infinitely less complex than a modern cellphone and Apple's money can only go so far to speed up the time line",
                  "score": 19,
                  "created_utc": 1739967730.0,
                  "replies": []
                },
                {
                  "id": "mdp7bqh",
                  "author": "joebo333",
                  "body": "Exactly, it's super frustrating to see people like my parents think this will just bring manufacturing jobs back but they don't realize how long it will take to get the infrastructure to get put into place and up and running.",
                  "score": 8,
                  "created_utc": 1740004269.0,
                  "replies": []
                },
                {
                  "id": "mdp6wk4",
                  "author": "Masrim",
                  "body": "So he raised taxes and raised prices, soon he will be raising interest rates.  Good choice America.",
                  "score": 5,
                  "created_utc": 1740004148.0,
                  "replies": []
                },
                {
                  "id": "mdq3kjv",
                  "author": "doubagilga",
                  "body": "Should we have iPhones on the back of Chinese cheap labor or should we make one of the richest companies pay a living wage in the domestic market?\n\n“It would take years” and it will take years minus 1 if we get started.",
                  "score": -2,
                  "created_utc": 1740014343.0,
                  "replies": [
                    {
                      "id": "mdq3xk7",
                      "author": "xRockTripodx",
                      "body": "I'm not arguing with the goal. I'm arguing that the method is profoundly stupid. All it's going to do is hurt us, when there are better alternatives with just a moment's thought.",
                      "score": 5,
                      "created_utc": 1740014464.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mdj2r69",
              "author": "PancAshAsh",
              "body": "Subsidies could work, like the bipartisan CHIPS act passed under Biden.",
              "score": 36,
              "created_utc": 1739925106.0,
              "replies": [
                {
                  "id": "mdl0yu2",
                  "author": "Herkfixer",
                  "body": "But the CHIPS act also created the infrastructure first. None of Trump's plans create the infrastructure BEFORE jacking up prices, which is why they are terrible plans and won't come even remotely close to doing what he claims they will do.",
                  "score": 36,
                  "created_utc": 1739954152.0,
                  "replies": []
                },
                {
                  "id": "mdk8ren",
                  "author": "ymmatymmat",
                  "body": "Is that still in place?",
                  "score": 3,
                  "created_utc": 1739939690.0,
                  "replies": [
                    {
                      "id": "mdkegqn",
                      "author": "_scyllinice_",
                      "body": "[Technically yes](https://www.engadget.com/computing/trump-administration-reportedly-eyes-renegotiating-chips-act-awards-143035924.html), but don't be surprised if Trump claims it as his own after he changes it.",
                      "score": 22,
                      "created_utc": 1739942142.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mdm348r",
                  "author": "stevesmele",
                  "body": "Aren’t subsidies just taxpayers’ money? So you pay one way or another.",
                  "score": 4,
                  "created_utc": 1739973063.0,
                  "replies": [
                    {
                      "id": "mdm5oag",
                      "author": "Enachtigal",
                      "body": "Improperly managed and awarded subsidies yes. Intentionally and well managed subsidies with clear and targeted industry growth goals are/should bear the sometimes prohibitive for private enterprise upfront costs of getting important infrastructure developed while on a longer time scale growing an economic sector enough to be a net positive. This is intended to lead to an overall positive economic outcome that can bear a larger tax burden than initially was invested.",
                      "score": 14,
                      "created_utc": 1739973933.0,
                      "replies": [
                        {
                          "id": "mdml4qz",
                          "author": "rtb001",
                          "body": "That's exactly how Project 2025 has succeeded! \n\nNo, wait, wait, my mistake,  I mean Made in China 2025. Kind of similar name.  Very different outcomes!",
                          "score": 3,
                          "created_utc": 1739978801.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mdp71tq",
                  "author": "Masrim",
                  "body": "Sounds like socialism to me.",
                  "score": 1,
                  "created_utc": 1740004190.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mdndfym",
              "author": "FriendlyGuitard",
              "body": "Problem of the tariff is that they are unreliable. Trump is using them as a geoplitical stick and carrot. So the tariff you rely on to build your business on may disappear overnight. The one with Mexico didn't last long enough to enter in practice.\n\nAlso, same as all the countries that tried to build \"Silicon Valley of X\" will know, the strength of manufacturing in China is that the manufacturing of everything is there already so there are gigantic network effect that make impossible to solve problem in the US, as trivial as a lunch meeting with a colleague 2 blocks away in Shenzhen.\n\nIt's not something that is unsolvable, but it require a consistent strategy that combine tariff with subsidies for decades.",
              "score": 5,
              "created_utc": 1739986564.0,
              "replies": [
                {
                  "id": "mdpf7ry",
                  "author": "thetwelveofsix",
                  "body": "> as a geopolitical ~~stick and carrot~~*sledgehammer.",
                  "score": 1,
                  "created_utc": 1740006591.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mdoiu5o",
              "author": "Qix213",
              "body": "The facilities to make this kind of stuff literally costs a billion dollars and take years to build.  So you're right about ungodly tariffs. \n\nAnd even if they were that high.  These tariffs aren't expected to be here for eternity.  Soon as they go away (ie next pres. if we have one), the half built facility becomes a money pit with no use.",
              "score": 3,
              "created_utc": 1739997639.0,
              "replies": [
                {
                  "id": "mdp5vft",
                  "author": "joebo333",
                  "body": "Yup exactly",
                  "score": 2,
                  "created_utc": 1740003852.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mdqa6fp",
              "author": "NinjaCultural",
              "body": "No no no. What you are getting is when we increase the cost of importing goods that does harm to the people selling the stuff to the importer. I mean. They aren’t making any more money from it. But they are…wait I am confused.",
              "score": 1,
              "created_utc": 1740016564.0,
              "replies": []
            },
            {
              "id": "mdv9gmo",
              "author": "crackedgear",
              "body": "I want everyone to Google “sources of aluminum inside the US”.",
              "score": 1,
              "created_utc": 1740084121.0,
              "replies": []
            },
            {
              "id": "mdz19pw",
              "author": "pppjurac",
              "body": "Not just manufacturing alone, but lax enviromental regulations in China that allow for cheaper primary  metallurgy industry compared to anyone else.",
              "score": 1,
              "created_utc": 1740138193.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdms6qc",
          "author": "pie-oh",
          "body": "The fact they want more local businesses, but are abolishing education standards is bonkers to me. You want well educated people to exist so they can build businesses.",
          "score": 11,
          "created_utc": 1739980796.0,
          "replies": [
            {
              "id": "mdn8sca",
              "author": "ImmediatelyOrSooner",
              "body": "It’s all a big lie to stir up the drooling masses. “They” don’t want any of that and so no care about prices and “made in america”. They only care about having ignorant torqued up voters.",
              "score": 6,
              "created_utc": 1739985315.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdmwuyd",
          "author": "tevolosteve",
          "body": "They solve certain things like lower prices.   They help get those prices right up there.",
          "score": 2,
          "created_utc": 1739982090.0,
          "replies": []
        },
        {
          "id": "mdmus42",
          "author": "StratoVector",
          "body": "I feel like if anything, it makes the manufacturer move to their source and set up factory there. They would rather charge more for their final product and have it tariffed than their raw goods to make the product. I'm only hypothesizing though.",
          "score": 3,
          "created_utc": 1739981516.0,
          "replies": []
        },
        {
          "id": "mdmgq47",
          "author": "lkn240",
          "body": "The only thing they \"solve\" is making things more expensive lol",
          "score": 2,
          "created_utc": 1739977494.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdjp2rp",
      "author": "Darkstar197",
      "body": "Even if it was possibly to build them domestically. It would take years upon years to set up supply scale anywhere near enough to meet demand",
      "score": 155,
      "created_utc": 1739932426.0,
      "replies": [
        {
          "id": "mdjwln0",
          "author": "None",
          "body": "That’s usually why plans like this would scale over time. Like with efficiency demands for combustion engines. If they would’ve said “all electric now or we’re taxing every combustion engine vehicle 100%” it would’ve broken the economy.",
          "score": 62,
          "created_utc": 1739935056.0,
          "replies": []
        },
        {
          "id": "mdkpf9o",
          "author": "Jaerba",
          "body": "Having the workforce for the scale of production iPhones require would also heavily detract from other industries.  There is simply no way to meet demand for a broad range of goods with domestic production.\n\n\nComparative advantages still exist, whether the idiots in this administration and their supporters admit it or not.  You don't want to build everything. It's like asking a chef to grow and pick their own produce and raise and butcher their own meat. Trump's plan for the economy is incredibly inefficient. \n\n\nAnd that's before you get to the quality of the American workforce.  There's already a fully domestic TV you can purchase.  Designed by Americans, built by Americans.  It's a piece of shit Element TV.  Please MAGA idiots, put your money where your mouth is and buy American made TVs over Korean designed, Chinese made TVs. I'm sure you'll be very happy with the quality.",
          "score": 29,
          "created_utc": 1739947517.0,
          "replies": [
            {
              "id": "mdqkabg",
              "author": "anm767",
              "body": "They fired enough people to start a domestic iphone production factory.",
              "score": 4,
              "created_utc": 1740020052.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdmxrew",
          "author": "UnTides",
          "body": "Enter US prison system labor force.  Slavery 2.0",
          "score": 4,
          "created_utc": 1739982338.0,
          "replies": [
            {
              "id": "me28thc",
              "author": "Blunttack",
              "body": "lol. You’re comparing voluntary paid labor… to actual slavery? Wow. That’s actually a pretty incredible level of dumb, even for Reddit.",
              "score": -2,
              "created_utc": 1740173823.0,
              "replies": [
                {
                  "id": "meau5lq",
                  "author": "notjordansime",
                  "body": "so, what’s the wage for that “voluntary paid labor”? \n\nAccording to the Federal Bureau of Prisons, inmates earn between 12-40 cents per hour for these jobs. At that rate it would take you 18 hours of labor to buy a single Big Mac from McDonald’s (no fries or drink, just the sandwich). AKA slave wages. \n\nMore info about penal labor in the US: https://en.m.wikipedia.org/wiki/Penal_labor_in_the_United_States\n\nUnder the 13th amendment to the US constitution, slavery and involuntary servitude are prohibited, except as punishment for a crime. \n\nThe person you replied to made that comparison because legally, it quite literally is “actual slavery”.",
                  "score": 2,
                  "created_utc": 1740291226.0,
                  "replies": [
                    {
                      "id": "mebxwmj",
                      "author": "Blunttack",
                      "body": "It doesn’t matter what the wage is. They VOLUNTEER. Read that again. A lot of that prison workforce is made up of people with no skills. They are doing whatever job, to get life skill for when they get out. And they get to buy prison candy or some other little trinket. You really think some crack head or murderer should be what making 40K so get out with a million dollars as they get “free” room and board for decades? Learn what volunteering is, and what interns are. Then learn want slavery was, come back and tell me they are comparable. Wake up. It’s actually incredible how dumb people are.",
                      "score": -1,
                      "created_utc": 1740313827.0,
                      "replies": [
                        {
                          "id": "mec11e0",
                          "author": "notjordansime",
                          "body": "First off, that’s wrong. It’s not voluntary. Go educate yourself on the 13th amendment. It’s forced labor. \n\nAnd even if what you said is true, yeah brb lemme just go volunteer on the labor intensive assembly line, or on a farm.  \n\nmy guy, I’ve worked in agriculture, and I volunteer in kitchens. Believe me, I’m well acquainted with a hard day’s work, shitty pay, and the concept of volunteering. There’s a difference between giving back to society by volunteering vs working manual labor/factory jobs. I still think they should be paid minimum wage, or even 75% of it at the very least. That’s $15k/yr before taxes, assuming they’re working 40 hours, 52 weeks a year. They ain’t making millions, even if they’re not paying rent. Not just candies and shit either, a lot of the stuff they buy is just for basic hygiene because the generic free stuff they have is borderline unusable. \n\nThat “free” board is a couple inch thick piece of foam covered in plastic draped across a cold metal surface. You have no privacy, for months or years on end. But yeah, free cot n 3 “hots” or whatever (it’s worse than hospital food). \n\nIt’s legally defined as permitted slavery under the 13th amendment to the constitution.\n\nAnd no, it’s not voluntary unless you’re awaiting trial. Look at the link I posted. You’re forced to work for less than a dollar an hour. From the previous link I posted;\n\n“However, convicted criminals who are medically able to work are typically required to do so in roles such as food service, warehouse work, plumbing, painting, or as inmate orderlies.” \n\nIt literally is slavery. I don’t know how else I can spell it out for you.",
                          "score": 2,
                          "created_utc": 1740315285.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mdkexfw",
          "author": "seabassvg",
          "body": "Or find MeRicans to work these low wage jobs.",
          "score": 4,
          "created_utc": 1739942351.0,
          "replies": []
        },
        {
          "id": "mdnaktl",
          "author": "-Badger3-",
          "body": "And even then, if there’s a 25% tax on imported goods, domestic goods will jack up their prices by 24%",
          "score": 1,
          "created_utc": 1739985797.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdk5ypq",
      "author": "Wazza17",
      "body": "Wait until MAGA start finding it costs more to buy stuff when he conned them that tariffs would make things cheaper. The thing is they are dumb and will blame anyone but him.",
      "score": 74,
      "created_utc": 1739938566.0,
      "replies": [
        {
          "id": "mdmh38b",
          "author": "lkn240",
          "body": "They'll just blame someone else.  You can't reason people out of out things they didn't reason themselves into.",
          "score": 16,
          "created_utc": 1739977606.0,
          "replies": []
        },
        {
          "id": "mdl5zi8",
          "author": "diacewrb",
          "body": "Yeah, if they think complaints about eggs are bad enough, just wait till cars and phones start becoming unaffordable.",
          "score": 17,
          "created_utc": 1739957216.0,
          "replies": []
        },
        {
          "id": "mdmxk6d",
          "author": "UsualResult",
          "body": "2029: Boy, Sleepy Joe made the economy so bad, even after years we can't improve it at all! (but we are trying!)\n\nPeople will eat it up forever.",
          "score": 12,
          "created_utc": 1739982283.0,
          "replies": []
        },
        {
          "id": "mdnngqk",
          "author": "Plank_With_A_Nail_In",
          "body": "The real con is that they think their taxes will be lower but he's only going to lower taxes for the rich. States are also going to need to raise taxes to make up for the drop in federal funding they will be receiving....lets see how states rights work then.",
          "score": 4,
          "created_utc": 1739989253.0,
          "replies": []
        },
        {
          "id": "mdm0vef",
          "author": "Knightraven257",
          "body": "It won't matter by the next election at this rate. We'll, next currently scheduled election.",
          "score": 4,
          "created_utc": 1739972278.0,
          "replies": []
        },
        {
          "id": "mdohewd",
          "author": "RBVegabond",
          "body": "They do what they always do, project.",
          "score": 1,
          "created_utc": 1739997261.0,
          "replies": []
        },
        {
          "id": "mdkz6dz",
          "author": "daCampa",
          "body": "It's the exporting country's fault for increasing the price to punish their tariff /s",
          "score": 1,
          "created_utc": 1739953065.0,
          "replies": [
            {
              "id": "mdl173l",
              "author": "Herkfixer",
              "body": "Except it's not the exporting country paying the tarriffs. The exporting county doesn't change their selling price at all. The importer pays the tarriffs and raises the price at the point of sale.",
              "score": 22,
              "created_utc": 1739954293.0,
              "replies": [
                {
                  "id": "mdl1yr5",
                  "author": "daCampa",
                  "body": "Yeah, I was saying what they'll convince their base, not what I believe, but looks like it didn't land given your reply and the downvotes.",
                  "score": 10,
                  "created_utc": 1739954758.0,
                  "replies": [
                    {
                      "id": "mdl237m",
                      "author": "Herkfixer",
                      "body": "Lol.. I would add the /s then cause you can never tell these days.",
                      "score": 11,
                      "created_utc": 1739954836.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mdln3kq",
              "author": "NateLikesToLift",
              "body": "Tariffs are import fees paid by the importer. The exporting country does not control end price of imported goods.",
              "score": -1,
              "created_utc": 1739966751.0,
              "replies": [
                {
                  "id": "mdnvs5p",
                  "author": "didiboy",
                  "body": "MAGA are stupid tho. I’ve seen plenty of MAGA supporters thinking China is paying the tariffs. You can’t even reason with them.",
                  "score": 3,
                  "created_utc": 1739991473.0,
                  "replies": []
                },
                {
                  "id": "mdlpt77",
                  "author": "daCampa",
                  "body": "I guess I really do need to put the /s, replying to the first guy wasn't enough",
                  "score": 4,
                  "created_utc": 1739967976.0,
                  "replies": [
                    {
                      "id": "mdlq9lj",
                      "author": "NateLikesToLift",
                      "body": "Indeed. I didn't pick up on it.",
                      "score": 2,
                      "created_utc": 1739968171.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mdjonth",
      "author": "futureformerteacher",
      "body": "Y'all ready for a $3000 iPhone?",
      "score": 61,
      "created_utc": 1739932284.0,
      "replies": [
        {
          "id": "mdk8muk",
          "author": "OpticalInfusion",
          "body": "yo i pre-ordered mine on steam.  it's gonna be here around the same time George R.R. Martin releases the Winds of Winter.",
          "score": 12,
          "created_utc": 1739939639.0,
          "replies": [
            {
              "id": "mdkhsg9",
              "author": "snwns26",
              "body": "It’ll come pre-installed like a U2 album.",
              "score": 8,
              "created_utc": 1739943676.0,
              "replies": []
            },
            {
              "id": "mdkbwoe",
              "author": "futureformerteacher",
              "body": "I chortled hard. Thanks!",
              "score": 2,
              "created_utc": 1739941019.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdlgwhv",
          "author": "ADhomin_em",
          "body": "More like, \"y'all ready to work factory jobs for a dollar a day and a $3000 iPhone?\"",
          "score": 7,
          "created_utc": 1739963586.0,
          "replies": []
        },
        {
          "id": "mdjryq6",
          "author": "Mrjlawrence",
          "body": "![gif](giphy|26gsiCIKW7ANEmxKE)\n\nInstead of cars Oprah would be giving away iPhones",
          "score": 9,
          "created_utc": 1739933429.0,
          "replies": []
        },
        {
          "id": "mdkdh4z",
          "author": "isKoalafied",
          "body": "Imagine what it would cost without slave labor.",
          "score": 2,
          "created_utc": 1739941706.0,
          "replies": [
            {
              "id": "mdkffwn",
              "author": "futureformerteacher",
              "body": "Well, Arkansas is now allowing child labor, and slavery is still alive and well in Alabama, so we might get to find out!",
              "score": 10,
              "created_utc": 1739942584.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mdkdr2g",
      "author": "earthman34",
      "body": "There is exactly one (1) fully American-sourced phone available for purchase, the Purism Liberty phone. It is completely made from an American parts chain. It's roughly equivalent to a $150 Samsung as far as features. It costs $2000, if anyone is interested.\n\nWhat the Maga boneheads don't or won't believe is that very little of the actual manufacturing infrastructure exists in the US to build something even close to an iPhone or any other flagship. The fab technology Apple uses in their 3nm processors is exclusive to TSMC in Taiwan and is a trade secret. Even Apple doesn't know how to do it, not that they actually manufacture anything. They design circuitry and components that are made by subcontracted manufacturing partners and assembled by other manufacturing partners. The same is true of Samsung and their 4nm and 5nm processes. There's no chip fab in the US that can duplicate this.\n\nAccording to one analysis I saw, if something like an iPhone ProMax was actually manufactured here, in the US, the end cost to the \"consumer\" would be on the order of $50k. Obviously only the super-rich could afford these devices and they wouldn't be made in large numbers.",
      "score": 40,
      "created_utc": 1739941827.0,
      "replies": [
        {
          "id": "mdkppab",
          "author": "Jaerba",
          "body": "Similarly, Element TVs are designed and manufactured in the US.  I'm sure MAGA folks are just lining up to buy Element over an LG OLED made in Guangzhou, right?  Right???\n\n\nWe're going to be paying more for worse quality.",
          "score": 15,
          "created_utc": 1739947669.0,
          "replies": [
            {
              "id": "mdmtjz8",
              "author": "Flash604",
              "body": ">We're going to be paying more for worse quality.\n\nNo, you're going to be paying far more for the imported product. Unless the tariffs change to being very targeted, there's no logical reason to buy the domestic product. Which, of course, means there's no logical reason for industry to ever start domestic manufacturing.",
              "score": 3,
              "created_utc": 1739981175.0,
              "replies": [
                {
                  "id": "mdmvfi1",
                  "author": "Jaerba",
                  "body": "True.  The domestic product will have room to increase its price (despite being worse quality) and the imported product will simply cost a lot more.",
                  "score": 2,
                  "created_utc": 1739981697.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mdky5i9",
              "author": "earthman34",
              "body": "There's multiple levels of irony. Element was going to close their plant after tariffs were extended to all electronics component imports, but they whined and got an extension. This is proof that tariffs are a killer for American manufacturers that rely on imported components (which they all do). They're also under investigation for actually lying about the level of American \"content\" in their products. And you're right, they sell an inferior product that competes poorly against imported products with better specifications. I would personally dispute the idea that a company that simply assembles imported parts is actually a \"manufacturer\", they're really just an assembler.",
              "score": 7,
              "created_utc": 1739952458.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdt2p2s",
          "author": "Xenthera",
          "body": "Lol that $2000 phone looking like the prepaid android phones you get at Walmart is exactly the dumb shit I expect from maga.",
          "score": 2,
          "created_utc": 1740062155.0,
          "replies": [
            {
              "id": "mgal16u",
              "author": "rolabond",
              "body": "It’s nice that someone is trying at least ",
              "score": 1,
              "created_utc": 1741245832.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdlez78",
          "author": "None",
          "body": "Purism Liberty Phone: All raw materials are also from US soil? I have my doubts.",
          "score": 3,
          "created_utc": 1739962525.0,
          "replies": [
            {
              "id": "mdmudd0",
              "author": "earthman34",
              "body": "Good question.",
              "score": 1,
              "created_utc": 1739981402.0,
              "replies": []
            },
            {
              "id": "mdpk8yb",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1740008161.0,
              "replies": [
                {
                  "id": "mdsv8he",
                  "author": "None",
                  "body": "That might be the point of this particular phone but this discussion is about building a product without depending on any other country",
                  "score": 0,
                  "created_utc": 1740059673.0,
                  "replies": [
                    {
                      "id": "mdtbq0g",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 0,
                      "created_utc": 1740064888.0,
                      "replies": [
                        {
                          "id": "mdup5lh",
                          "author": "None",
                          "body": "We are not talking about the price of a phone. We are talking about dependencies from other countries in supply chains.\nWhile the United States has over 1 million tons of rare earths in reserves, it is largely dependent on imports from China for refined rare earths (like almost every country). Currently they are needed for any high-tech product.",
                          "score": 0,
                          "created_utc": 1740078530.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mdn95yo",
          "author": "Kurumi_Tokisaki",
          "body": "I think it would be quite funny to poll magas and see how under 1% of them own either an all American phone or tv, their clothing is probably 50%+ foreign, various accessories and a lot drive foreign cheap cars too. And to be extra extreme, most of them don’t even have majority true American (native) blood in them.",
          "score": 1,
          "created_utc": 1739985419.0,
          "replies": []
        },
        {
          "id": "mdt96iq",
          "author": "Stryker2279",
          "body": "Intel these days is quite comparable. While they don't have the same size transistors.They're around the same transistor density, which thanks to 3d finfet tech makes transistor size a bit less relevant. Still, Intel in nowhere near ready to shoulder the burden of manufacturing every single chip for the American market.",
          "score": 1,
          "created_utc": 1740064144.0,
          "replies": []
        },
        {
          "id": "mdl4qo7",
          "author": "CanadaGoose1075",
          "body": "Finally the rich will have something to brag about.",
          "score": 0,
          "created_utc": 1739956470.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdl86ce",
      "author": "Spiritofhonour",
      "body": "If anyone hasn’t watched the Oscar winning documentary American Factory (Produced by Obama too) it’s an interesting watch. I’ve come to realise that even without the supply chain and costs, there’s a very big rift in terms of expectations and culture. These are not fun or good jobs. \n\n[There was also an article a while back about TSMC employees who were unhappy that people in the headquarters in Taiwan](https://hongkongfp.com/2024/11/14/us-based-staff-of-taiwan-chip-giant-tsmc-sue-firm-for-alleged-discrimination-against-non-asian-workers/) didn’t speak to them in English when they were visiting and sued the company.",
      "score": 6,
      "created_utc": 1739958534.0,
      "replies": []
    },
    {
      "id": "mdj07y4",
      "author": "stereoauperman",
      "body": "You don't need to explain. It's evident",
      "score": 26,
      "created_utc": 1739924303.0,
      "replies": []
    },
    {
      "id": "mdk2o0i",
      "author": "None",
      "body": "What would the price be for “all American iPhone” 3-4 grand or more? Genuinely curious",
      "score": 11,
      "created_utc": 1739937292.0,
      "replies": [
        {
          "id": "mdk51ky",
          "author": "ultimatefreeboy",
          "body": "Some raw materials wouldn't be able to be mined in the US and even if there was a small amount, prices would be high.\nAnd the labor cost in the US is high compared to china and india.\nAnd building manfacturing plants in the US will take years.",
          "score": 14,
          "created_utc": 1739938205.0,
          "replies": [
            {
              "id": "mdknypt",
              "author": "Md__86",
              "body": "They'll be produced in Guantanamo with minerals stolen from Ukraine, now known as Muskland",
              "score": 6,
              "created_utc": 1739946748.0,
              "replies": []
            },
            {
              "id": "mdkomor",
              "author": "I_Am_A_Zero",
              "body": "Canada, Greenland and Mexico are ripe with rare minerals. Coincidentally, it’s the three places Trump wants to annex/invade.",
              "score": 4,
              "created_utc": 1739947093.0,
              "replies": [
                {
                  "id": "mdkoqqa",
                  "author": "ultimatefreeboy",
                  "body": "Which he'll never be able to take them without WW3. Good luck.",
                  "score": 5,
                  "created_utc": 1739947152.0,
                  "replies": []
                },
                {
                  "id": "mdlg308",
                  "author": "Massive_Town_8212",
                  "body": "\"Rare minerals\" is an interesting term for non-citizen slaves",
                  "score": 1,
                  "created_utc": 1739963136.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mdnelpt",
          "author": "lonmoer",
          "body": "Multiply that 10x and that's the *cheapest* you could possibly make it in the USA right now.",
          "score": 1,
          "created_utc": 1739986877.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdkf6za",
      "author": "None",
      "body": "It will be two cans and a piece of string when it arrives",
      "score": 12,
      "created_utc": 1739942470.0,
      "replies": []
    },
    {
      "id": "mdmd1vp",
      "author": "AffectEconomy6034",
      "body": "it's like sanctioning ourselves and expecting innovation. that's why north korea and Iran are leaders in innovation.",
      "score": 3,
      "created_utc": 1739976341.0,
      "replies": []
    },
    {
      "id": "mdmwv7k",
      "author": "mavven2882",
      "body": "At this point, tariffs are simply ensuring that the rest of the world will hate us more than they already do, and everyday Americans will pay drastically higher prices for the majority of their goods and services.\n\nManufacturing is never coming back to America. Always remind those who voted for this, or didn't vote at all, congratulations on entering the \"finding out\" phase.",
      "score": 3,
      "created_utc": 1739982092.0,
      "replies": []
    },
    {
      "id": "mdlt23w",
      "author": "coffeequeen0523",
      "body": "Non-paywalled article link: https://archive.is/2025.02.17-140750/https://www.wired.com/story/why-trumps-metal-tariffs-wont-lead-to-the-all-american-iphone/",
      "score": 3,
      "created_utc": 1739969334.0,
      "replies": []
    },
    {
      "id": "mdj3qp6",
      "author": "None",
      "body": "Golly is it because that would be prohibitively expensive and people won’t buy it?",
      "score": 8,
      "created_utc": 1739925418.0,
      "replies": []
    },
    {
      "id": "mdkv83m",
      "author": "None",
      "body": "Welcome to massive inflation... Again!",
      "score": 4,
      "created_utc": 1739950733.0,
      "replies": [
        {
          "id": "mdmhq9h",
          "author": "lkn240",
          "body": "I wonder who the idiots will blame this time.",
          "score": 4,
          "created_utc": 1739977803.0,
          "replies": [
            {
              "id": "mdo1yuj",
              "author": "_CatsPaw",
              "body": "Obama, or sleepy Joe. Nancy Pelosi? Soros ... ??\n\n\nHillary!",
              "score": 2,
              "created_utc": 1739993135.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mdkgdx1",
      "author": "Guy_V",
      "body": "Because building an entire iphone production facility would not offset the cost of tariffs. Especially when trump arbitrarily starts and stops them, and the next president will most likely change everything again.",
      "score": 2,
      "created_utc": 1739943017.0,
      "replies": []
    },
    {
      "id": "mdmhj9p",
      "author": "Own-Opinion-2494",
      "body": "Americans can’t afford American",
      "score": 2,
      "created_utc": 1739977743.0,
      "replies": []
    },
    {
      "id": "mdn3epk",
      "author": "mrsmambas",
      "body": "Why hasn’t this man been removed from the White House for treason espionage and breaking the law right and left him and must have to go our government needs to do their job and stand up to the constitution and Supreme Court better do their job and stopping too or they are no different than he is and they should step down",
      "score": 2,
      "created_utc": 1739983870.0,
      "replies": [
        {
          "id": "mdq9pjw",
          "author": "None",
          "body": "That's how he won the white house...smh",
          "score": 1,
          "created_utc": 1740016407.0,
          "replies": [
            {
              "id": "mgmwwok",
              "author": "mrsmambas",
              "body": "No he stole it with help from Musk, they’ve said so laughing about it",
              "score": 2,
              "created_utc": 1741409103.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mdpmzr6",
      "author": "TechyGuyInIL",
      "body": "Nothing he does will benefit us.",
      "score": 2,
      "created_utc": 1740009038.0,
      "replies": []
    },
    {
      "id": "mdqu3m5",
      "author": "MaddogWSO",
      "body": "As someone who works with the industrial base, his delusions of factories suddenly appearing and making shit is, at best, the wishful thinking of someone clearly uninformed/unknowledgeable on the topic.",
      "score": 2,
      "created_utc": 1740023585.0,
      "replies": []
    },
    {
      "id": "mdwqzn6",
      "author": "ByTheHammerOfThor",
      "body": "Even if we instantly had the production facilities in the states ready to go right now, and even if we had the raw material supply chain in place for those factories last week, the *workers* they’d have to pay would be *American* and would, rightfully, demand American wages and benefits. \n\nAn American worker is so much more expensive than a Chinese factory worker. And can anyone remind me what one of the highest costs is in American production? Anyone? It’s human labor. \n\nAn American iPhone with the exact same cost of material inputs (impossible) would still cost so much fucking more because of American labor.",
      "score": 2,
      "created_utc": 1740101105.0,
      "replies": []
    },
    {
      "id": "mdlhbab",
      "author": "DuckDouble2690",
      "body": "He can tariff all he wants, I still won’t listen to garbage American metal like Five Finger Death Punch or Disturbed",
      "score": 4,
      "created_utc": 1739963809.0,
      "replies": []
    },
    {
      "id": "mdm9qcz",
      "author": "motohaas",
      "body": "Simple!\nBecause we are lazy and greedy, we no longer build anything in the US, so no structure available to make them",
      "score": 3,
      "created_utc": 1739975277.0,
      "replies": []
    },
    {
      "id": "mdl9e1w",
      "author": "owlinspector",
      "body": "Because no one will pay for it. Of course an iPhone could be made in the US. And the price to buy one would be 3x as high.",
      "score": 2,
      "created_utc": 1739959249.0,
      "replies": [
        {
          "id": "mdlv7m6",
          "author": "aspersioncast",
          "body": "An iPhone couldn’t be currently made entirely in the US. That’s kinda the point of the article.",
          "score": 2,
          "created_utc": 1739970178.0,
          "replies": [
            {
              "id": "mdm5vjw",
              "author": "owlinspector",
              "body": "And my point was that with proper investments, time, yada yada it very well COULD, there is no physical law against it, but no one would buy them anyway. Because they would be too expensive. People whine about offshore production but no one wants to pay what it would cost to have things produced at home.",
              "score": 0,
              "created_utc": 1739974002.0,
              "replies": [
                {
                  "id": "mdo1kn2",
                  "author": "_CatsPaw",
                  "body": "It would be best if economy of the world would intertwine and benefit all.",
                  "score": 1,
                  "created_utc": 1739993030.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mdktf9c",
      "author": "OdonataDarner",
      "body": "r/50501 Join. Spread. Act, don't just gawk.",
      "score": 2,
      "created_utc": 1739949709.0,
      "replies": []
    },
    {
      "id": "mdkmopy",
      "author": "Eisso633",
      "body": "At least TSMC was brought to USA",
      "score": 1,
      "created_utc": 1739946086.0,
      "replies": []
    },
    {
      "id": "mdlru5c",
      "author": "Qualityhams",
      "body": "Where is the manufacturing infrastructure where is the skilled labor? And finally, is everyone prepared to pay $2500+ for an iphone?",
      "score": 1,
      "created_utc": 1739968839.0,
      "replies": []
    },
    {
      "id": "mdmr3cz",
      "author": "CurraheeAniKawi",
      "body": "This doesn't take into effect the coming work camps and slavery. ",
      "score": 1,
      "created_utc": 1739980493.0,
      "replies": []
    },
    {
      "id": "mdn0pjr",
      "author": "comFive",
      "body": "There’s more to creating a phone than just the frame.",
      "score": 1,
      "created_utc": 1739983144.0,
      "replies": []
    },
    {
      "id": "mdn4l0m",
      "author": "CommanderAGL",
      "body": "Government Disincentives don't work. The government needs to incentivize a change in behavior, especially in the corporate sphere. If the cost to spool up manufacturing is more than 4 years of tariffs, no one is going to build new manufacturing. They probably won't even bother if its 2 years of Tariffs. Businesses barely think farther than 4 quarters any more.",
      "score": 1,
      "created_utc": 1739984186.0,
      "replies": []
    },
    {
      "id": "mdn7pck",
      "author": "aedspitpopd",
      "body": "There will be cheaper countries to export to",
      "score": 1,
      "created_utc": 1739985027.0,
      "replies": []
    },
    {
      "id": "mdnf19x",
      "author": "xoffx",
      "body": "As someone who works in the foundry industry all i can say is our customers better get used to the new surcharges on future orders.",
      "score": 1,
      "created_utc": 1739986993.0,
      "replies": []
    },
    {
      "id": "mdnm862",
      "author": "Glad-Masterpiece-466",
      "body": "Trump is a POS!",
      "score": 1,
      "created_utc": 1739988919.0,
      "replies": []
    },
    {
      "id": "mdnzhx6",
      "author": "Was_Silly",
      "body": "Metallica concerts were expensive enough already!  I’m against 🤘🏻tarrifs!!!",
      "score": 1,
      "created_utc": 1739992476.0,
      "replies": []
    },
    {
      "id": "mdpfvfv",
      "author": "Rhabdo05",
      "body": "It will. With suicide nets and everything",
      "score": 1,
      "created_utc": 1740006792.0,
      "replies": []
    },
    {
      "id": "me27xpo",
      "author": "Blunttack",
      "body": "There’s people that think we’re trying to get an American made iPhone? That can’t possibly be a real thing… or even close to concern at all. Cmon.",
      "score": 1,
      "created_utc": 1740173572.0,
      "replies": []
    },
    {
      "id": "mhuplnn",
      "author": "DaisyMa1",
      "body": "But the stable genius says it’s going to make America great again.  Why would he lie about that?",
      "score": 1,
      "created_utc": 1742002445.0,
      "replies": []
    },
    {
      "id": "mdlq45j",
      "author": "mystery_science",
      "body": "Listen wired, no one gives a shit anymore. Start printing articles about how to ruin a fascist regime or how to make bombs. It won't matter because they are going to close wired down for being anti state propaganda.\n\nFuck trump and fuck anyone who voted for him.",
      "score": 1,
      "created_utc": 1739968106.0,
      "replies": []
    },
    {
      "id": "mdlnndq",
      "author": "EchoAquarium",
      "body": "Freedom Fonez for every alabaster child and family",
      "score": 1,
      "created_utc": 1739967007.0,
      "replies": []
    },
    {
      "id": "mdnraj3",
      "author": "Oxidized_Shackles",
      "body": "Because Apple would never abandon their overseas sweatshops.",
      "score": 1,
      "created_utc": 1739990272.0,
      "replies": []
    },
    {
      "id": "mdqf9sj",
      "author": "TanisBar",
      "body": "No shit",
      "score": 1,
      "created_utc": 1740018297.0,
      "replies": []
    },
    {
      "id": "mds23k2",
      "author": "roderik35",
      "body": "I'm in the EU and I have a Samsung. My next smartphone will be Samsung again.",
      "score": 1,
      "created_utc": 1740046245.0,
      "replies": []
    },
    {
      "id": "mdkzzd1",
      "author": "xiphoidthorax",
      "body": "Who cares? The shiny consumer electronics has not made people happier.",
      "score": 0,
      "created_utc": 1739953550.0,
      "replies": []
    },
    {
      "id": "mdm45m1",
      "author": "None",
      "body": "[removed]",
      "score": -3,
      "created_utc": 1739973416.0,
      "replies": []
    },
    {
      "id": "mdmp07r",
      "author": "7Sans",
      "body": "I don't think people realize there are more than just 2 options here. there is manufacturing in america or china. but there is another option of just manufacturing in a different country other than america/china.\n\nSamsung took years and have already closed last chinese factory for smartphone in 2019. their main hub is now vietnam and then south korea, india.\n\ntrump administration can always move from \"manufacture in america\" to \"as long as you don't manufacture in china\". It will still hurt China with that second option.\n\nSamsung already paved the way for other corps to follow to create manufacturing city in vietnam how it happened in china, shenzhen",
      "score": 0,
      "created_utc": 1739979910.0,
      "replies": []
    },
    {
      "id": "mdn65jf",
      "author": "mperezstoney",
      "body": "I've never wanted an Apple products to begin with no scalability, no customizations....seriously why spend $1000+ on a phone you can't tailor to yourself? I'll stick with android tyvm.",
      "score": 0,
      "created_utc": 1739984609.0,
      "replies": []
    },
    {
      "id": "mdovo4k",
      "author": "JonnyRico22",
      "body": "It costs Apple a whole $10 to make an IPhone in China. They charge a ridiculous amount for them. Apple will simply increase the cost to consumers and eat the tariff. Too many people use iPhone to switch.",
      "score": 0,
      "created_utc": 1740001046.0,
      "replies": []
    },
    {
      "id": "mdrdkcr",
      "author": "PaddyDelmar",
      "body": "As long as American companies are permitted to manufacture over seas and import to America with no terrifs and still be considered American companies we will never have manufacturing back in the USA",
      "score": 0,
      "created_utc": 1740031997.0,
      "replies": []
    },
    {
      "id": "mdlh6fb",
      "author": "jeedaiaaron",
      "body": "Yeah he should just do what the last Admin did.  Do nothing",
      "score": -6,
      "created_utc": 1739963735.0,
      "replies": [
        {
          "id": "mdsbgng",
          "author": "ZefSoFresh",
          "body": "You mean besides the CHIPS and Science Act that most of the MAGA cult would not comprehend.",
          "score": 3,
          "created_utc": 1740051545.0,
          "replies": []
        },
        {
          "id": "mdlnpa0",
          "author": "NateLikesToLift",
          "body": "Please explain how tariffs help our economy... I'm all ears.",
          "score": 6,
          "created_utc": 1739967032.0,
          "replies": [
            {
              "id": "mdnws82",
              "author": "_CatsPaw",
              "body": "Good question.  They are not part of a free market, I don't believe.",
              "score": 1,
              "created_utc": 1739991741.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdlu6ah",
          "author": "Conkreett",
          "body": "He doesn't need to fuck it up worse.",
          "score": 5,
          "created_utc": 1739969776.0,
          "replies": [
            {
              "id": "mdnww60",
              "author": "_CatsPaw",
              "body": "cannot hlp it",
              "score": 1,
              "created_utc": 1739991771.0,
              "replies": []
            },
            {
              "id": "mdqaja4",
              "author": "None",
              "body": "Need? He's been in office for a month, he hasn't gotten started yet. Give him some time will ya?",
              "score": 0,
              "created_utc": 1740016683.0,
              "replies": [
                {
                  "id": "mdqmzlw",
                  "author": "Conkreett",
                  "body": "Cost of everything has already gone up, inflation is already going up, the country has never been more divided, he's trying to tank the checks on his power and install a dictatorship and he's allowing an unelected illegal immigrant access to some of our citizens most private data.  \n\nI've had enough, thanks.",
                  "score": 4,
                  "created_utc": 1740020998.0,
                  "replies": [
                    {
                      "id": "mdqoo0f",
                      "author": "None",
                      "body": "Sorry man, I was being sarcastic. I hear you. FWIW, I'm hoping his term ends sooner than later. And I'm not in the US nor American.",
                      "score": 1,
                      "created_utc": 1740021597.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mdls1ur",
          "author": "Qualityhams",
          "body": "I hope you bought everything big you need for the next six years. Tariffs are going to crush us.",
          "score": 4,
          "created_utc": 1739968927.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdm08dy",
      "author": "None",
      "body": " Is this  article  implying th iPhone will be made in USA just because of implemented tariff to China?",
      "score": -1,
      "created_utc": 1739972047.0,
      "replies": [
        {
          "id": "mdnxlp6",
          "author": "_CatsPaw",
          "body": "That's the theory.\n\nA tariff on steel would bring the steel industry back to Pennsylvania, ... In theory.\n\nLike if General Motors could get Washington DC to issue a tariff against Toyota.",
          "score": 1,
          "created_utc": 1739991963.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdmq3lf",
      "author": "G0ttaB3KiddingM3",
      "body": "Awesome I was really hoping iPhones could become more expensive under the clown presidency",
      "score": -2,
      "created_utc": 1739980216.0,
      "replies": []
    },
    {
      "id": "mdj18r4",
      "author": "Eskareon",
      "body": "This isn't r/politics",
      "score": -64,
      "created_utc": 1739924627.0,
      "replies": [
        {
          "id": "mdk64jl",
          "author": "timtot23",
          "body": "Put your head in the sand... It should work out great!\n\nI don't know how talking about the effect of broad tariffs on tech is not tech related. The US doesn't have the capacity to manufacture smartphones, computers, processors, and all these other gadgets. And even if they did, it would ALSO raise prices. The only thing these tariffs will do is raise prices on gadgets. Act like it's not true if you want. Bury your head a little deeper.",
          "score": 18,
          "created_utc": 1739938629.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdm413b",
      "author": "AM_I_A_PERVERT",
      "body": "There aren’t as many people upgrading every year as much as they used to, but some still do because $1000 is still tolerable for something you use more than any other. \n\nNow make that $3000 and see how long people hold onto their phones. We’ll move to a 4y upgrade cycle like MacBooks",
      "score": -4,
      "created_utc": 1739973374.0,
      "replies": []
    },
    {
      "id": "mdkh3w7",
      "author": "noxx1234567",
      "body": "ChatGPT tells me there is a 24 hour manual labour involved in every Iphone \n\nNo amount of tariffs will make an affordable made in America Iphone",
      "score": -10,
      "created_utc": 1739943357.0,
      "replies": [
        {
          "id": "mdlw6vj",
          "author": "aspersioncast",
          "body": "ChatGPT is not a source. Ask where that info came from.",
          "score": 3,
          "created_utc": 1739970551.0,
          "replies": [
            {
              "id": "mdo1c4r",
              "author": "_CatsPaw",
              "body": "Check GPT is a good source. Quoting it is like quoting Time magazine or national geographic. It has hey universal look up library.",
              "score": -2,
              "created_utc": 1739992966.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}