{
  "post": {
    "title": "Garmin users say their watches are bricked with a ‘blue triangle of death | ’It’s not just you. Several users are reporting their watches are crashing while displaying the ‘blue triangle of death.’",
    "author": "chrisdh79",
    "id": "1icak00",
    "score": 2096,
    "created_utc": 1738094009.0,
    "selftext": "",
    "num_comments": 146,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1icak00/garmin_users_say_their_watches_are_bricked_with_a/"
  },
  "comments": [
    {
      "id": "m9p2ndn",
      "author": "nicuramar",
      "body": "It’s funny that this “of death” has become a thing for bricked, when its origin (I assume?), the blue screen of death, was “just” a kernel panic. ",
      "score": 607,
      "created_utc": 1738095051.0,
      "replies": [
        {
          "id": "m9p3yi0",
          "author": "None",
          "body": "Well, you have the Red ring of death, popular in the xbox 360 days. If you had one, that's hardware fucked.",
          "score": 528,
          "created_utc": 1738095417.0,
          "replies": [
            {
              "id": "m9q39ky",
              "author": "internetlad",
              "body": "Maybe we just need to wrap a towel around our Garmin watches?",
              "score": 122,
              "created_utc": 1738105391.0,
              "replies": [
                {
                  "id": "m9rhdyh",
                  "author": "JustAcivilian24",
                  "body": "The good ol towel trick! Worked well. For a few hours.",
                  "score": 42,
                  "created_utc": 1738121552.0,
                  "replies": [
                    {
                      "id": "m9s0360",
                      "author": "thepootastrophy",
                      "body": "I did it and mine was the ring of death the towel overheating trick actually worked for. I got another 4 years out of mine. I think it still may work but the power brick went bad.",
                      "score": 30,
                      "created_utc": 1738129116.0,
                      "replies": []
                    },
                    {
                      "id": "m9t8gtq",
                      "author": "_Ganon",
                      "body": "That was my experience haha, my parents let me try it once but weren't keen on me baking an xbox more than that lol",
                      "score": 9,
                      "created_utc": 1738153966.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m9r7qfu",
                  "author": "shamoomoofartpoopoo",
                  "body": "Break out the towel again. Just feels right.",
                  "score": 12,
                  "created_utc": 1738118272.0,
                  "replies": []
                },
                {
                  "id": "ma0gyvg",
                  "author": "nhorvath",
                  "body": "who needs a reflow oven when you have a towel?",
                  "score": 2,
                  "created_utc": 1738246798.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9qpbs6",
              "author": "imaginepostinglmao",
              "body": "When I was younger I had one that would have the red ring of death fairly often. I'm not talking about any of the other alert, I'm talking about the flashing 3 quarters of a ring red ring of death. It was because the socket I had it plugged up into was for some reason connected to the laundry room light switch, so if someone rapidly turned on and off that switch it would do that. My guess what it means normally is that when you try and turn it on it sends a bunch of power on signals that it can't execute properly.",
              "score": 8,
              "created_utc": 1738112292.0,
              "replies": []
            },
            {
              "id": "m9skzds",
              "author": "Killbot_Wants_Hug",
              "body": "The phrase predates that. Windows as far back as Windows 95 would have critical errors and crash to a blue screen where all you could do is reboot.\n\nIt was know as BSOD, Blue Screen of Death.",
              "score": 21,
              "created_utc": 1738140742.0,
              "replies": [
                {
                  "id": "m9uwnqt",
                  "author": "kvng_stunner",
                  "body": "I'm surprised this isn't the first reply tbh.\n\nGod am I old now? Surely everyone is familiar with BSOD?",
                  "score": 3,
                  "created_utc": 1738172796.0,
                  "replies": [
                    {
                      "id": "m9zuork",
                      "author": "Protean_Protein",
                      "body": "Windows is so stable these days I haven’t seen one since Win8.",
                      "score": 1,
                      "created_utc": 1738238048.0,
                      "replies": [
                        {
                          "id": "ma20lug",
                          "author": "RYRK_",
                          "body": "Sometimes our hardware isn't as stable. I've seen BSOD regularly since \"upgrading\" my motherboard a few years ago.",
                          "score": 2,
                          "created_utc": 1738262736.0,
                          "replies": [
                            {
                              "id": "ma2a0jz",
                              "author": "Protean_Protein",
                              "body": "That’s true. Hardware BSOD is a different matter and I guess I have seen those but didn’t think of it because usually it’s me doing something stupid or the hardware is just toast.",
                              "score": 2,
                              "created_utc": 1738265319.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ma96vl5",
                  "author": "None",
                  "body": "Those were good times",
                  "score": 1,
                  "created_utc": 1738354369.0,
                  "replies": []
                },
                {
                  "id": "maduyg9",
                  "author": "Top-Breakfast6060",
                  "body": "I miss Win 95.",
                  "score": 1,
                  "created_utc": 1738422354.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9p885f",
              "author": "drmirage809",
              "body": "It depended on which one. There were multiple error codes that the 360 would communicate through flashing red lights on the power buttons. Some of them just meant that the hard drive wasn't connected and quickly reconnecting it fixed things. PS3 has a similar issue in the form of the yellow light of death, or YLOD.",
              "score": 44,
              "created_utc": 1738096600.0,
              "replies": [
                {
                  "id": "m9q0ub0",
                  "author": "Goldeneel77",
                  "body": "I bought the PS3 at launch and had two different 60gb models crap out with that yellow light. Luckily it was still under warranty both times so I didn’t lose the 600 bucks.",
                  "score": 18,
                  "created_utc": 1738104659.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9qxzll",
              "author": "PyroDesu",
              "body": "Didn't one of the RRoDs just mean you had to put it in the oven?",
              "score": 7,
              "created_utc": 1738115076.0,
              "replies": [
                {
                  "id": "m9ri7yn",
                  "author": "LordCreamer69",
                  "body": "The Red Ring of Death was caused by a failure of the adhesive they used in certain areas. Over repeated stress of the heat expansion and compression, the adhesive would expand and contrast at a different rate the the solder. The problem with this, is that every xbox needed to be repeatedly stress tested before going out on sale. Every. Single. One. This was a problem that affected virtually every single xbox, just to less severe degrees. No amount of \"fixes\" would actually fix it. It was over the day it was shipped out. It was just a matter of time until it hit a red ring.",
                  "score": 5,
                  "created_utc": 1738121848.0,
                  "replies": []
                },
                {
                  "id": "m9r8bpr",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 17,
                  "created_utc": 1738118469.0,
                  "replies": [
                    {
                      "id": "m9r9xls",
                      "author": "PyroDesu",
                      "body": "Hence, why I said *one* of the RRoDs. I know that there were multiple error codes that the red lights on the ring could indicate.\n\nAnd of *course* it wasn't a good solution. But it was hilarious that it actually was a working solution.",
                      "score": 2,
                      "created_utc": 1738119005.0,
                      "replies": [
                        {
                          "id": "m9s3rbp",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 1,
                          "created_utc": 1738130902.0,
                          "replies": [
                            {
                              "id": "m9sb0sx",
                              "author": "VenomsViper",
                              "body": "Nobody thought he meant that the code was officially the \"oven code\" or anything man.",
                              "score": 5,
                              "created_utc": 1738134790.0,
                              "replies": []
                            },
                            {
                              "id": "m9s9ngo",
                              "author": "PyroDesu",
                              "body": "I'm pretty sure it was basically a meme back then that yeah, one of the fixes for a RRoD is sticking it in the oven. *Because* it's an insane idea, and even moreso because it *worked*.\n\nObviously anyone attempting it would be an absolute idiot to just stick the whole console in instead of taking it apart so it's just the board that needed the solder reflowed, and they'd want to use the right temperature, and it was not an intended thing to be done but could get it working at least for a while, and so on.",
                              "score": 2,
                              "created_utc": 1738134032.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9spnle",
              "author": "kerpuzz",
              "body": "Or the dreaded yellow light of death on ps3",
              "score": 1,
              "created_utc": 1738143707.0,
              "replies": []
            },
            {
              "id": "m9uvthy",
              "author": "Brico16",
              "body": "I made a good side hustle on Craigslist fixing the red ring of death with some thermal paste, electrical tape, and 8 pennies to make a a few heat sinks and put them on specific chips inside of the console. I’d charge 50 bucks and it was about an hour long job.\n\nIt wasn’t a fix every time and in that case I wouldn’t charge the customer but it was great beer/entertainment money if I could fix a couple in a week at the time.",
              "score": 1,
              "created_utc": 1738172571.0,
              "replies": []
            },
            {
              "id": "m9xgcza",
              "author": "LBPPlayer7",
              "body": "or the yellow light of death on the ps3, meant the syscon shut the console down because the CELL or RSX were acting up",
              "score": 1,
              "created_utc": 1738198755.0,
              "replies": []
            },
            {
              "id": "ma2fg66",
              "author": "Fragrant-Mind-1353",
              "body": "Very easy fix. Just add spacers.",
              "score": 1,
              "created_utc": 1738266814.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9pxu77",
          "author": "None",
          "body": "[removed]",
          "score": 107,
          "created_utc": 1738103769.0,
          "replies": [
            {
              "id": "m9pyybx",
              "author": "NickConnor365",
              "body": ">> FFS.\n\nFee for service? :)",
              "score": 38,
              "created_utc": 1738104098.0,
              "replies": [
                {
                  "id": "m9q6ddm",
                  "author": "None",
                  "body": "[removed]",
                  "score": 54,
                  "created_utc": 1738106347.0,
                  "replies": [
                    {
                      "id": "m9rpf4e",
                      "author": "golapader",
                      "body": "┬─┬﻿ ノ( ゜-゜ノ)\n\nFTFY",
                      "score": 20,
                      "created_utc": 1738124565.0,
                      "replies": [
                        {
                          "id": "m9rza5k",
                          "author": "NickConnor365",
                          "body": "Full time, Full year?",
                          "score": 6,
                          "created_utc": 1738128745.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9tmq53",
              "author": "DonArgueWithMe",
              "body": "And the \"screen of death\" never had to mean it was bricked",
              "score": 3,
              "created_utc": 1738159361.0,
              "replies": []
            },
            {
              "id": "m9rxqph",
              "author": "None",
              "body": "Sir this is a Wendy’s",
              "score": 2,
              "created_utc": 1738128054.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9pdc8s",
          "author": "masterspeler",
          "body": "Bricked used to mean that the device was unrecoverable and could only be used as a brick and needed to be replaced. Now it's \"requires a reset\"",
          "score": 74,
          "created_utc": 1738098001.0,
          "replies": [
            {
              "id": "m9pnfz0",
              "author": "shotsallover",
              "body": "Oh, bricking still happens. It's less common because we've engineered around it, but it still happens.",
              "score": 34,
              "created_utc": 1738100790.0,
              "replies": [
                {
                  "id": "m9q8kxx",
                  "author": "Hithaeglir",
                  "body": "Back in time, when Samsung Galaxy S2 was a new thing, I bricked it with some custom ROMs.\n\nAt least I thought so. The device was completely black and no action never did anything.\n\nThen I found some \"magic\" software from some Chinese site. Apparently it was recovery tool created by the manufacturer itself. Well, I installed the software and just ran it while phone was USB plugged. Few seconds later and the phone booted and it started to install some Chinese version of Android, starting from bootloader.\n\nScary to think these days that what else I got from that software. Or what was possible to do with phones back then when the security might not have been that much priority.",
                  "score": 13,
                  "created_utc": 1738107030.0,
                  "replies": [
                    {
                      "id": "m9rglek",
                      "author": "Duke_Webelows",
                      "body": "Bricked my Motorola Matrix doing the same. Loved messing with roms on my HTC Evo.",
                      "score": 7,
                      "created_utc": 1738121271.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ma7qq3v",
                  "author": "masterspeler",
                  "body": "I don't mean things don't get bricked anymore, I'm referring to people using the term bricked incorrectly. If something is bricked it's bricked, it's now a brick, there's no going back, it's useless. But some people say their computer is bricked if they need to reinstall Windows, which is obviously wrong since you can't install Windows on a brick.",
                  "score": 1,
                  "created_utc": 1738339766.0,
                  "replies": []
                },
                {
                  "id": "m9q6ujq",
                  "author": "LightOfTheElessar",
                  "body": "Just had my pc bricked from the 24H2 windows update, so I can confirm.",
                  "score": 0,
                  "created_utc": 1738106494.0,
                  "replies": [
                    {
                      "id": "m9t5amv",
                      "author": "peggman",
                      "body": "I strongly doubt a Windows update hard bricked your pc. The only way to do that is to corrupt the BIOS/UEFI and Windows does not touch that. Could be a firmware update distributed through Windows, but I don't think it's 24H2.",
                      "score": 5,
                      "created_utc": 1738152544.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9sk1l5",
              "author": "polypolip",
              "body": "Nope, plenty of quest 2/3 got bricked recently. There was no way to reset out of that.",
              "score": 2,
              "created_utc": 1738140156.0,
              "replies": []
            },
            {
              "id": "m9yv1ek",
              "author": "nero40",
              "body": "Well, there is the terms hard brick and soft brick.",
              "score": 1,
              "created_utc": 1738217369.0,
              "replies": []
            },
            {
              "id": "m9pf5ty",
              "author": "dbmajor7",
              "body": "😮‍💨😮‍💨😮‍💨 bricked means NoFuckingGood. This cannot be up for debate.",
              "score": 1,
              "created_utc": 1738098503.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9pn7y6",
          "author": "shotsallover",
          "body": "The BSOD got the name because it usually signaled a hardware problem, frequently just before it died. And it took all your open unsaved work with when it happened. It didn't become \"just a kernel panic\" until the Windows 2000 era.\n\nThen there was the \"Click of death\" which was the sound an Iomega Zip drive made when it was eating all of your data. Which meant both the drive itself was dead and so was the media you put in it.\n\nThen there was the IBM \"Death\"star drives that would randomly shell out and lose everything on the drive with no warning.\n\nSo the \"of death\" has a little bit of history that earned its connection to bricking.",
          "score": 45,
          "created_utc": 1738100729.0,
          "replies": [
            {
              "id": "m9pycf8",
              "author": "NickConnor365",
              "body": "Wow, that was nostalgic. I was there for all of those.",
              "score": 9,
              "created_utc": 1738103918.0,
              "replies": [
                {
                  "id": "m9pyh2k",
                  "author": "shotsallover",
                  "body": "There were more. I just hit the highlights.",
                  "score": 4,
                  "created_utc": 1738103956.0,
                  "replies": [
                    {
                      "id": "m9q1i3x",
                      "author": "NickConnor365",
                      "body": "Did you ever have to drop an Apple III? Good times.",
                      "score": 1,
                      "created_utc": 1738104860.0,
                      "replies": [
                        {
                          "id": "m9q250j",
                          "author": "shotsallover",
                          "body": "No, I got to skip that abomination.",
                          "score": 2,
                          "created_utc": 1738105052.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9qjpe9",
              "author": "mikeblas",
              "body": "When was a blue screen *not* a kernel panic in Windows?",
              "score": 2,
              "created_utc": 1738110532.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9sjg95",
          "author": "Berkut22",
          "body": "It's like every 'scandal' was(is?) affixed with -gate\n\nPizzagate\n\nGamergate\n\nCelebgate\n\netc",
          "score": 6,
          "created_utc": 1738139780.0,
          "replies": [
            {
              "id": "m9z5nbf",
              "author": "yumsterboy",
              "body": "Bendgate",
              "score": 1,
              "created_utc": 1738223134.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9p53qg",
          "author": "RobertOdenskyrka",
          "body": "I would assume the same. The first bricking I can remember it being used for is the Red Ring of Death on the Xbox 360 in 2005.",
          "score": 6,
          "created_utc": 1738095734.0,
          "replies": [
            {
              "id": "m9pq3qo",
              "author": "figmentPez",
              "body": "The Iomega Zip Drive \"[click of death](https://en.wikipedia.org/wiki/Click_of_death)\" happened back in the late 90s, and often meant a disk or drive was no longer usable.",
              "score": 8,
              "created_utc": 1738101528.0,
              "replies": []
            },
            {
              "id": "m9qn46w",
              "author": "double-you",
              "body": "RROD isn't bricked. If it is showing you lights, it is not a brick.",
              "score": -1,
              "created_utc": 1738111595.0,
              "replies": [
                {
                  "id": "m9teece",
                  "author": "audigex",
                  "body": "\"Bricked\" doesn't mean that it's completely burned out, and never has. I've no idea where you got that idea from\n\nIt means it's \"as useful as a brick\". The RROD is definitely a \"bricked\" device because it's broken useless as a console. The presence of an error light *telling* you it's broken doesn't change that",
                  "score": 3,
                  "created_utc": 1738156367.0,
                  "replies": [
                    {
                      "id": "m9tfehy",
                      "author": "double-you",
                      "body": "That seems to be your opinion. Way back when bricking was not just broken, but turned completely inert and unfixable by some change.",
                      "score": 1,
                      "created_utc": 1738156744.0,
                      "replies": [
                        {
                          "id": "m9tivhc",
                          "author": "audigex",
                          "body": "It's literally the dictionary definition\n\n> cause (a smartphone or other electronic device) to become completely unable to function, typically on a permanent basis\n\nAnd \n\n> to render (an electronic device, such as a smartphone) nonfunctional (as by accidental damage, malicious hacking, or software changes)\n\n\"Unable to *function*\", not \"completely dead in every way\". If it can't fulfil it's job it's bricked, even if fans/LEDs etc still power on\n\nIt also matches up with usage for decades. Not one example on [Wikipedia](https://en.wikipedia.org/wiki/Brick_\\(electronics\\)) refers to a device which is completely inert. If something is completely non-responsive we tend to call it \"dead\" not \"bricked\"\n\nAlso, acting like I'm using some new definition is nonsense. In the 1990s it was being used to discuss PCs breaking after BIOS updates, they'd still show LEDs and you'd still get POST beeps. Frankly it sounds like you're just doubling down by trying to act like you're talking about some earlier period than I'm aware of\n\nObviously it's hard to definitively prove anything from the 1990s since most forums and usenet groups are gone now, but here's [an example from nearly 20 years ago](https://forum.dd-wrt.com/phpBB2/viewtopic.php?t=15908) showing people talking about \"bricked\" hardware with flashing LEDs etc. [Another from 2009](https://groups.google.com/g/pcrepair/c/aItq85rHafE/m/veJvtOWyzrAJ)",
                          "score": 0,
                          "created_utc": 1738158014.0,
                          "replies": [
                            {
                              "id": "m9tle71",
                              "author": "double-you",
                              "body": "People have just been using the term in several ways. I've never seen this \"oh it broke so now it's bricked\" thing until recently. No, it was always after a software update or some such just made the device not function at all. Not being physically broken, but the software change messed things up.",
                              "score": 0,
                              "created_utc": 1738158899.0,
                              "replies": [
                                {
                                  "id": "m9tmg33",
                                  "author": "audigex",
                                  "body": "It's often been from firmware updates, but definitely not exclusively - we were definitely using it back in the early 2000s in both ways, and it was 100% used for the Xbox 360 RROD issue\n\nHonestly it just sounds like you've missed a common form of usage",
                                  "score": 2,
                                  "created_utc": 1738159263.0,
                                  "replies": [
                                    {
                                      "id": "m9tnk8j",
                                      "author": "double-you",
                                      "body": "I guess. I especially liked the word because there hadn't been a word for breaking things with software. But if it is just synonymous to broken, meh. We need a word for breaking things with software.",
                                      "score": 0,
                                      "created_utc": 1738159646.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m9tbedc",
          "author": "PixelCortex",
          "body": "coaxedinto <colour> <shape> of death",
          "score": 1,
          "created_utc": 1738155183.0,
          "replies": []
        },
        {
          "id": "m9te5v2",
          "author": "audigex",
          "body": "The first usage of the \"of death\" thing I can find comes from the Black Screen of Death, a precursor to the Blue Screen of Death error, mentioned in [InfoWorld magazine in 1993](https://books.google.co.uk/books?id=JzwEAAAAMBAJ&pg=PA102&dq=%22black%20screen%20of%20death%22&hl=en&sa=X&ved=2ahUKEwjTxKHpz7L2AhXNTcAKHTJQCFcQ6AF6BAgCEAI#v=onepage&q=%22black%20screen%20of%20death%22&f=false), followed by the \"Click of Death\" on the Iomega zip drive [first mentioned in 1998 on CNet](https://www.cnet.com/tech/tech-industry/click-of-death-strikes-iomega/), although it's likely that either or both of these were used by the community before they first appeared in news articles\n\nThe most widespread one was the Blue Screen of Death, followed by the Red Ring of Doom (usually \"Doom\" at the time, not \"Death\" - for some reason it's been retrospectively changed to Death, probably because of the Blue Screen of Death being so pervasive in the public consciousness)\n\nBut yeah, the RROD seems to be the first time it was used for a properly bricked device, arguably maybe the Iomega drives because that *could* mean the drive was fucked, although not always",
          "score": 1,
          "created_utc": 1738156277.0,
          "replies": []
        },
        {
          "id": "m9uo9jm",
          "author": "ChangeBackground1977",
          "body": "red ring of death was first",
          "score": 1,
          "created_utc": 1738170518.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9ozy1c",
      "author": "stereoroid",
      "body": "I got a notification in my app about that: they just say to restart it. I've seen a weird triangle on my old Vivosport when I take it off charge: after a few seconds it appeared to reboot then was back to normal.",
      "score": 242,
      "created_utc": 1738094300.0,
      "replies": [
        {
          "id": "m9qp3bx",
          "author": "Pocketsandgroinjab",
          "body": "This is merely the new Squid Games feature. You have been selected to coordinate death games based on your reported VO2 max and resting heart rate. Comply, resistance is futile.",
          "score": 45,
          "created_utc": 1738112217.0,
          "replies": [
            {
              "id": "m9qpu7d",
              "author": "VitalisMan",
              "body": "Squid Game, singular.",
              "score": 7,
              "created_utc": 1738112456.0,
              "replies": [
                {
                  "id": "m9rn9vo",
                  "author": "None",
                  "body": "They call them ‘games’ many times on the show 🤔",
                  "score": 5,
                  "created_utc": 1738123721.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9p07t8",
          "author": "mknight1701",
          "body": "And with that, the case is closed!",
          "score": 47,
          "created_utc": 1738094374.0,
          "replies": [
            {
              "id": "m9p0dns",
              "author": "stereoroid",
              "body": "Nah, it's just one example. The article goes in to detail about other devices. r/Garmin is full of them.",
              "score": 23,
              "created_utc": 1738094418.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9rdlh1",
          "author": "dwmfives",
          "body": "I love having to regularly restart my devices to get them out of the blue screen of death.",
          "score": 1,
          "created_utc": 1738120230.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9palxa",
      "author": "NeuseRvrRat",
      "body": "It's already fixed. They routinely roll out files that update the GPS satellites locations to make location acquisition faster. They rolled out a corrupt file.",
      "score": 110,
      "created_utc": 1738097254.0,
      "replies": [
        {
          "id": "m9sb6co",
          "author": "None",
          "body": "[deleted]",
          "score": -31,
          "created_utc": 1738134875.0,
          "replies": [
            {
              "id": "m9sgk2p",
              "author": "Smooth-Accountant",
              "body": "🤦🏻‍♂️",
              "score": 16,
              "created_utc": 1738138003.0,
              "replies": []
            },
            {
              "id": "m9si0b9",
              "author": "Holocene98",
              "body": "![gif](giphy|Zy7s96dP38MlQe3OjG|downsized)",
              "score": 12,
              "created_utc": 1738138882.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9p0xpj",
      "author": "garciawork",
      "body": "I believe it specifically happened when connecting to GPS. That is how mine went into a death loop this AM.",
      "score": 33,
      "created_utc": 1738094573.0,
      "replies": [
        {
          "id": "m9t6k6x",
          "author": "montsegur",
          "body": "Yeah, it seems like they messed up the ephemerises.",
          "score": 1,
          "created_utc": 1738153121.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9p5s03",
      "author": "Getafix69",
      "body": "The tricks to lick the needle gently then work along the edges of the triangle before one of the mask guys shoots you.",
      "score": 23,
      "created_utc": 1738095923.0,
      "replies": [
        {
          "id": "m9py8dz",
          "author": "IANALbutIAMAcat",
          "body": "Idk what exactly this means, but it sounds like good advice.",
          "score": 5,
          "created_utc": 1738103886.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9qb5o6",
      "author": "jaysomeguy2",
      "body": "Happened to my venu 3.  Hard reset.  Had to forget the device in my iPhone and then re-pair everything. Works now.",
      "score": 8,
      "created_utc": 1738107840.0,
      "replies": []
    },
    {
      "id": "m9rghsv",
      "author": "leakybiome",
      "body": "My tamagachi had this\n\nHe's gonna be ok. Right ?",
      "score": 7,
      "created_utc": 1738121236.0,
      "replies": [
        {
          "id": "m9sx4zu",
          "author": "Candid-Piano4531",
          "body": "Nope.",
          "score": 1,
          "created_utc": 1738148268.0,
          "replies": []
        },
        {
          "id": "m9yygfs",
          "author": "farnnie123",
          "body": "Sorry buddy. It’s living happily in the farm up north.",
          "score": 1,
          "created_utc": 1738219114.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9r5cco",
      "author": "ScrambledAgs",
      "body": "Nah that’s just the Squid Game update",
      "score": 5,
      "created_utc": 1738117478.0,
      "replies": []
    },
    {
      "id": "m9rcj0n",
      "author": "unkyduck",
      "body": "I hope [Foresty Forest](https://www.youtube.com/@forestyforest) is alright. \n\nHe marches off into the snowy mountains alone.",
      "score": 2,
      "created_utc": 1738119867.0,
      "replies": []
    },
    {
      "id": "m9ricvx",
      "author": "trash-juice",
      "body": "Saw this movie the other nite, with the triangle, ‘The Void’. They may have problems",
      "score": 2,
      "created_utc": 1738121898.0,
      "replies": []
    },
    {
      "id": "m9yj0z5",
      "author": "MostWorry4244",
      "body": "Outlook not good",
      "score": 2,
      "created_utc": 1738212003.0,
      "replies": []
    },
    {
      "id": "m9pwf7k",
      "author": "constantmusic",
      "body": "You’ve been selected for the next SQUID GAMES",
      "score": 4,
      "created_utc": 1738103353.0,
      "replies": []
    },
    {
      "id": "m9qjz8k",
      "author": "THEBIGHUNGERDC",
      "body": "They have pretty exact instructions online. My first attempt didn’t take but it appears I’m back. I couldn’t run this morning without it. Horrible 😫 … sorry, that was for r/runningcirclejerks",
      "score": 2,
      "created_utc": 1738110616.0,
      "replies": []
    },
    {
      "id": "m9qz4xt",
      "author": "P0rtal2",
      "body": "The HR sensor on my watch stopped working a couple months ago due to a faulty update. Garmin had to send me a new watch since they couldn't fix the sensor issue.",
      "score": 2,
      "created_utc": 1738115450.0,
      "replies": []
    },
    {
      "id": "m9pv1k1",
      "author": "DijonNipples",
      "body": "There are SEVERAL of us out there!",
      "score": 1,
      "created_utc": 1738102947.0,
      "replies": []
    },
    {
      "id": "m9pwtt5",
      "author": "sergeantbiggles",
      "body": "I was able to factory reset it, and re-pair it with my phone. I had to forget the device in the App, and also forget the device in Bluetooth, and then I was able to get it all back. The watch face and some little menu details reset, but all my app data was fine, and things like Do Not Disturb settings, birthday, etc were preserved.",
      "score": 1,
      "created_utc": 1738103472.0,
      "replies": []
    },
    {
      "id": "m9ri29l",
      "author": "ImpromptuFanfiction",
      "body": "Whereas my watch the barometer is just completely useless without a $170 repair. How can I track my mountain climbs accurately with my “adventure” watch? Never buying another garmin watch. Coros for me next.",
      "score": 1,
      "created_utc": 1738121791.0,
      "replies": []
    },
    {
      "id": "m9s3fik",
      "author": "68Postcar",
      "body": "So, what will it be next? Symbols with a dark underbell, nvr ceases to amaze…",
      "score": 1,
      "created_utc": 1738130736.0,
      "replies": []
    },
    {
      "id": "m9sf06f",
      "author": "whole__sense",
      "body": "I'm so tired of mine. The health tracking is alright but the UX is dogshit. \n\n\nI still miss my Pebble and I can't wait until a new Pebble comes along",
      "score": 1,
      "created_utc": 1738137086.0,
      "replies": []
    },
    {
      "id": "m9sn0ct",
      "author": "AdHealthy5279",
      "body": "[video](https://youtube.com/shorts/5WHTv-LqjPo?feature=share)",
      "score": 1,
      "created_utc": 1738142030.0,
      "replies": []
    },
    {
      "id": "m9spneb",
      "author": "Brnzy",
      "body": "My old Garmin Instinct is unaffected. Nothing touches it and because it doesn’t have a color screen the battery lasts for-ev-ER. Idk how any of these watches have the battery to survive the GPS tracking and color display simultaneously. I do not recommend anything with an Amoled screen if you’re going to be using the GPS. It will die on you and it needs software updates so  sooner or later they’ll pull an Apple move and brick your watch with an update. IMO",
      "score": 1,
      "created_utc": 1738143703.0,
      "replies": []
    },
    {
      "id": "m9stvam",
      "author": "MrRigby632",
      "body": "Perhaps",
      "score": 1,
      "created_utc": 1738146329.0,
      "replies": []
    },
    {
      "id": "m9t1129",
      "author": "PopplerJoe",
      "body": "I'd been having a similar issue for months, even reading other reports of it on their support page, except their support was denying there was an issue. Except my variant would crash the watch when it tried to connect to WiFi/Bluetooth.\n\nThe only way to get the watch back working was to plug it into the charger and let it sync then.",
      "score": 1,
      "created_utc": 1738150417.0,
      "replies": []
    },
    {
      "id": "m9t1gsg",
      "author": "gaping_anal_hole",
      "body": "Yeah this happened to me today. Hold the power button for 30 seconds to trigger a soft reset, all fixed.",
      "score": 1,
      "created_utc": 1738150649.0,
      "replies": []
    },
    {
      "id": "m9t1hav",
      "author": "Apprehensive_Elk5252",
      "body": "At this point certain basic technology is much better than new technology. Garmin are so important to outdoor recreation that the idea of adding new features that could possibly break the device. It’s just not worth it.",
      "score": 1,
      "created_utc": 1738150656.0,
      "replies": []
    },
    {
      "id": "m9t5mlm",
      "author": "Nom_De_Plumber",
      "body": "Dcrainmaker posted a video on how to fix it yesterday. Just corrupt GPS files that were rolled out and subsequently corrected.",
      "score": 1,
      "created_utc": 1738152700.0,
      "replies": []
    },
    {
      "id": "m9t7v9q",
      "author": "SeymourMuchmore",
      "body": "They tried renaming the Gulf of Mexico.",
      "score": 1,
      "created_utc": 1738153705.0,
      "replies": []
    },
    {
      "id": "m9tdmvj",
      "author": "MRRRRCK",
      "body": "I will not buy Garmin after my experience with the company. \n\nI bought one of their early Vivosmart products that failed prematurely even though I babied the product.  Garmin wouldn’t stand behind their product and actually abandoned the model.\n\nWhen you can’t trust a company to A: Make quality products or B: Support their existing products over a reasonable amount of time….. it’s not worth buying products from Garmin.",
      "score": 1,
      "created_utc": 1738156072.0,
      "replies": []
    },
    {
      "id": "m9uuw31",
      "author": "EducationallyRiced",
      "body": "Eh, red ring of death would sound better",
      "score": 1,
      "created_utc": 1738172322.0,
      "replies": []
    },
    {
      "id": "m9vv1c5",
      "author": "jmegaru",
      "body": "They are being invited to play a game, haha.",
      "score": 1,
      "created_utc": 1738182160.0,
      "replies": []
    },
    {
      "id": "m9wwhr6",
      "author": "fng185",
      "body": "Crazy how anyone still uses garmin after the massive hack and data leak a couple years ago.",
      "score": 1,
      "created_utc": 1738192514.0,
      "replies": [
        {
          "id": "ma0r1uz",
          "author": "Full_Time_Hungry",
          "body": "You say that, but Apple, Samsung, Sony, Microsoft, and many more have been hacked and have had our data stolen. \n\nI don't think you realize how often companies are attacked and our information is stolen.",
          "score": 0,
          "created_utc": 1738249985.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma1dmak",
      "author": "X2946",
      "body": "Skynet is taking over",
      "score": 1,
      "created_utc": 1738256424.0,
      "replies": []
    },
    {
      "id": "magwl5n",
      "author": "SuperSpartan300",
      "body": "My 5 month old Garmin Venu 3 got an update last month, after the update, the screen just went off after an hour even though I can hear chimes when I was pressing buttons. I tried charging it to full, restarting the watch, nothing helped. I took it to the Garmin service center and they gave it back to me after a week saying they just did a software reset. Well I got it, it only worked for a day then the screen went off again so this time they replaced the entire watch with a brand new one. Ever since, I just kept the replacement watch and posted it for sale, this left a sour taste in my mouth.\n\nI bought a Google Pixel Watch 3 which is awesome, I dod miss the long battery life of the Garmin Venu 3 though.",
      "score": 1,
      "created_utc": 1738456261.0,
      "replies": []
    },
    {
      "id": "maj95vr",
      "author": "HansBooby",
      "body": "several?",
      "score": 1,
      "created_utc": 1738492723.0,
      "replies": []
    },
    {
      "id": "m9qzybs",
      "author": "TeenJesusWasaCunt",
      "body": "Yea just wait till you get to talk to garmin customer support. Best offer they gave me was a 20% discount to get a new watch. The cheapest watch WITH discount was over 700 fucking dollars and was a substantial down grade from the version I have. Ridiculous",
      "score": 1,
      "created_utc": 1738115716.0,
      "replies": [
        {
          "id": "m9rq1n0",
          "author": "gyhujkikhtgh",
          "body": "I’ve had my fenix 6 replaced twice (hr sensor and faulty battery), the second time with a brand new fenix 7, what happened to your watch as their support has always been great for me?",
          "score": 3,
          "created_utc": 1738124813.0,
          "replies": [
            {
              "id": "m9sw213",
              "author": "TeenJesusWasaCunt",
              "body": "I will never know what actually happened to it because I didn't take that deal. The watch just wouldn't take a charge anymore and I tried everything the website said to do like clean the ports and try multiple chargers. Mine was a Fenix 5x+ that I had bought brand new from Amazon and I was offered the 7 solar or something like that for like 729 after discount. I declined.",
              "score": 1,
              "created_utc": 1738147639.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9sh50v",
          "author": "Smooth-Accountant",
          "body": "Garmin’s support is known for being on the best there is though, they have no problem with offering replacements for even minor things and sometimes our of warranty. I’ve used it few times and had 10/10 experience each time. \nWhat was your issue?",
          "score": 2,
          "created_utc": 1738138354.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9rknfv",
      "author": "PriestWithTourettes",
      "body": "Squid Games",
      "score": 1,
      "created_utc": 1738122729.0,
      "replies": []
    },
    {
      "id": "m9p2vbx",
      "author": "1980techguy",
      "body": "Well I guess my Epix is going to sit on the shelf for a bit. I really don't want to have to reconfigure everything.",
      "score": 1,
      "created_utc": 1738095113.0,
      "replies": [
        {
          "id": "m9p6v9d",
          "author": "dropthemagic",
          "body": "I never looked into these but just saw the specs for the Epix 2. 31 days of battery 🤯.",
          "score": 2,
          "created_utc": 1738096224.0,
          "replies": [
            {
              "id": "m9shevy",
              "author": "Smooth-Accountant",
              "body": "My forerunner 955 can gets over a week with 10h of exercise a week, 3h with gps and music on. \nWithout heavy GPS use I could probably get 2/3 weeks out of it. \n\nNothing gets close to Garmin when it comes to sport watches.",
              "score": 2,
              "created_utc": 1738138519.0,
              "replies": []
            },
            {
              "id": "m9pkvyj",
              "author": "FixSwords",
              "body": "Gets nowhere near that in real world use cases. If you use always on display (and why would you not? It’s properly annoying having to tilt your wrist just to glance at your watch) you get more like 5-6 days. \n\nNow the MIP displays give proper battery life. Fenix 8 MIP or the 7X Pro gets about 30 days with some GPS usage and everything. ",
              "score": 2,
              "created_utc": 1738100086.0,
              "replies": [
                {
                  "id": "m9qzy5e",
                  "author": "thekeffa",
                  "body": "Memory in Pixel for anyone wondering what a MIP display is (I was).\n\nApparently much better in sunlight too.",
                  "score": 2,
                  "created_utc": 1738115715.0,
                  "replies": [
                    {
                      "id": "m9t17ta",
                      "author": "ThePublikon",
                      "body": "Sounds like e-ink",
                      "score": 1,
                      "created_utc": 1738150516.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ma1t43h",
              "author": "Comfortable_Hall8677",
              "body": "My Fenix averages around 20 days with most features going. If I turn them down to just time and date it’s something astonishing like 130 days. Main reason I chose it. Epix is badass too.",
              "score": 1,
              "created_utc": 1738260685.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9pauhc",
          "author": "NeuseRvrRat",
          "body": "It's already fixed.",
          "score": 2,
          "created_utc": 1738097320.0,
          "replies": []
        },
        {
          "id": "m9qu2o8",
          "author": "Damnyoudonut",
          "body": "Just sync it to the app before starting your next gps workout.",
          "score": 1,
          "created_utc": 1738113808.0,
          "replies": [
            {
              "id": "m9qz4v8",
              "author": "1980techguy",
              "body": "Fortunately it has been off for over a week so it likely never got the corrupted file from my phone. I'm gonna wait another day, ensure the app is up to date then sync it.",
              "score": 1,
              "created_utc": 1738115449.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9pat8w",
      "author": "wopper",
      "body": "Good.  Fuck Garmin.  From hosing customers into buying proprietary cables to forcing customers to re-pay for “updates” to their maps on their OG GPS devices to the more modern bullshit if them paying off the hackers that pulled a ransomware job on their servers and then deleting their users content anyway for security.\n\nIronically, Garmin lost their way a long time ago.",
      "score": -5,
      "created_utc": 1738097310.0,
      "replies": []
    },
    {
      "id": "m9pmfhn",
      "author": "Just-Shoe2689",
      "body": "Fucking Trump",
      "score": -2,
      "created_utc": 1738100511.0,
      "replies": []
    },
    {
      "id": "m9rbx75",
      "author": "RuthlessIndecision",
      "body": "Thanks Trump",
      "score": 0,
      "created_utc": 1738119667.0,
      "replies": []
    },
    {
      "id": "m9p4d94",
      "author": "None",
      "body": "wtf we must react",
      "score": -1,
      "created_utc": 1738095530.0,
      "replies": []
    },
    {
      "id": "m9plvi9",
      "author": "spoollyger",
      "body": "I reported this issue to Garmin about 5 years ago when my watch randomly bricked one day. They refused any wrongdoing on their end and did not to help fix it. It was a Garmin forerunner 955. Was gutted.",
      "score": -2,
      "created_utc": 1738100357.0,
      "replies": []
    },
    {
      "id": "m9r0vw6",
      "author": "GreatKingCodyGaming",
      "body": "Mine bricked this morning. Had to factory reset it via the button combo. Venu 3, right as I stated a walk.",
      "score": 0,
      "created_utc": 1738116019.0,
      "replies": [
        {
          "id": "m9t76bw",
          "author": "Chien_de_Nivelle",
          "body": "If you could get it working it wasn't bricked. Bricked means unusable forever. Whatever wrong way ppl are starting to use it.",
          "score": 2,
          "created_utc": 1738153397.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9prj0x",
      "author": "GainPotential",
      "body": "Blue screen, red ring, and now blue triangle. They sure are getting creative with these, aren't they?",
      "score": 0,
      "created_utc": 1738101934.0,
      "replies": []
    },
    {
      "id": "m9pcbq9",
      "author": "hamiltonisoverrat3d",
      "body": "It's actually the new season of Squid Games but IRL",
      "score": -2,
      "created_utc": 1738097724.0,
      "replies": []
    },
    {
      "id": "m9q35ea",
      "author": "internetlad",
      "body": "Mines fine.",
      "score": -1,
      "created_utc": 1738105355.0,
      "replies": []
    },
    {
      "id": "m9qt54a",
      "author": "Osiris_Raphious",
      "body": "Finally, maybe all the higher income people distracted can finally understand the evil that is planned obsolescence, and digital version of it. This affects our right to repair, it affects our use of the device because it can bug out if not connected to their servers. Like google is doing this, i didnt update for 2 months and my phone starts to act up badly. Why if it was stable then one day just refuses to charge to turn on, burns hot. Like, I had this issue with samsung phones, when they no longer wanted to support my device i get a final update and it just ruins the battary and tries to cook itself. Like, we all know these tech giants do this, to push us to buy new devices, but its so evil. \n\nClearly if your device can be bricked by a simple little software that needs you to restart or reconnect to their servers, then you dont really own the full rights to your own device. Which is essentially the evil of technofuedalism....",
      "score": -5,
      "created_utc": 1738113511.0,
      "replies": [
        {
          "id": "m9shjoc",
          "author": "Smooth-Accountant",
          "body": "What are you on about lol, it’s a corrupted file that puts the device in a boot loop. It has nothing to do with planned obsolescence or whatever.\nAnd that last paragraph is straight up dumb, you can brick any device it doesn’t mean that the device is or isn’t yours.",
          "score": 7,
          "created_utc": 1738138600.0,
          "replies": [
            {
              "id": "m9uij65",
              "author": "Osiris_Raphious",
              "body": "lol ok dummy",
              "score": -1,
              "created_utc": 1738168941.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9scwr8",
      "author": "starsandatoms",
      "body": "Just buy a gshock and be happy.",
      "score": -2,
      "created_utc": 1738135866.0,
      "replies": [
        {
          "id": "m9shtg4",
          "author": "Smooth-Accountant",
          "body": "That’s like recommending a sun-dial watch because your Rolex broke lol",
          "score": 3,
          "created_utc": 1738138766.0,
          "replies": [
            {
              "id": "m9simd3",
              "author": "Crafty_Percentage_83",
              "body": "😊🤌🏾",
              "score": 1,
              "created_utc": 1738139261.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9rens6",
      "author": "None",
      "body": "Garmin is trash. Always has been.",
      "score": -6,
      "created_utc": 1738120594.0,
      "replies": []
    }
  ]
}