{
  "post": {
    "title": "A billion dollars later, the iPhone 16 is still banned in Indonesia, for a bizarre reason",
    "author": "a_Ninja_b0y",
    "id": "1hwk4vp",
    "score": 0,
    "created_utc": 1736342571.0,
    "selftext": "",
    "num_comments": 13,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hwk4vp/a_billion_dollars_later_the_iphone_16_is_still/"
  },
  "comments": [
    {
      "id": "m61mg2q",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736342573.0,
      "replies": []
    },
    {
      "id": "m65s9wc",
      "author": "13xnono",
      "body": "“That reason? Indonesia now specifically insists that Apple manufacture iPhone parts in the country; AirTags don’t count.”\n\nSaved you a click.",
      "score": 48,
      "created_utc": 1736389637.0,
      "replies": [
        {
          "id": "m65w86f",
          "author": "Dowsha18",
          "body": "Thank you. I don't understand how is this bizarre. Sounds reasonable for me.",
          "score": -11,
          "created_utc": 1736391045.0,
          "replies": [
            {
              "id": "m67qlmp",
              "author": "None",
              "body": "Imagine if every country started making these demands of large companies, manufacture here or be banned. Global trade would collapse.",
              "score": 5,
              "created_utc": 1736425856.0,
              "replies": [
                {
                  "id": "m6al0yn",
                  "author": "TheFlusteredcustard",
                  "body": "Sounds like an easy way to kickstart industrialization in a growing nation. As long as your population isn't frothing at the mouth in rage that they can't get one, you can ask whatever you want and get big tech to pony up. That's why it could never kill trade, it's only really viable for luxury items being sold by companies who are pretty close to the limit of their current market area.",
                  "score": 1,
                  "created_utc": 1736457935.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m65ey4q",
      "author": "DarkTreader",
      "body": "Wait… bizarre?  Why is this bizarre?  Bait, meet click. \n\nIf you believe the cynical view or a generous view, this is about clout.  iPhones have a much greater chance of being a long term investment and require more expertise overall. $1 billion investment in a 401k is a better investment than $1 billion in a 2% savings account, for example. Apple is still trying to lowball them no mater whose side you are on.\n\nMy only beef with this is calling something so transparent as bizarre.",
      "score": -1,
      "created_utc": 1736384998.0,
      "replies": [
        {
          "id": "m6alm51",
          "author": "TheFlusteredcustard",
          "body": "Bizarre is a stretch, but I think it meets the criteria of _unusual_, at least. I've never heard of a country doing this, although the article claims others have in the past. I hope it works out for them though.",
          "score": 2,
          "created_utc": 1736458108.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m65udeo",
      "author": "LupusDeusMagnus",
      "body": "I hope more countries demand that, if only to see how Apple would do logistics, at some point, too many plants spread through too many countries would just be a hindrance for a bunch of reasons. The article mentions Indonesia as a market for 246 million people, but that's not exactly true, Indonesia might have nearly 250m but the vast majority of the people can't afford iPhones. What if a country like Mexico (I think Apple already is putting some production centers there) asks for it? Mexico might have a much lower population but the iPhone market is much bigger (currently about twice as Indonesia), as it's a richer country. Same with Brazil, nearly three times the Indonesian market. Maybe even some eastern EU countries?\n\nDo it, countries.",
      "score": -4,
      "created_utc": 1736390380.0,
      "replies": []
    },
    {
      "id": "m65veap",
      "author": "SQL617",
      "body": "The average income across Indonesia is $186/month. Population wise Indonesia is huge, spending wise they’re a relatively small market - especially when you’re a company trying to sell $1,000 phones.",
      "score": 0,
      "created_utc": 1736390747.0,
      "replies": [
        {
          "id": "m68mrew",
          "author": "vanKlompf",
          "body": "It's not only about selling there. It's even banned to bring iPhone there as a tourist.  ",
          "score": 3,
          "created_utc": 1736437469.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m6688kb",
      "author": "None",
      "body": "Bizarrely genius move by Indo. Clickbait headline.",
      "score": -1,
      "created_utc": 1736395642.0,
      "replies": [
        {
          "id": "m6fvkkh",
          "author": "None",
          "body": "[deleted]",
          "score": 2,
          "created_utc": 1736532633.0,
          "replies": [
            {
              "id": "m6gaftt",
              "author": "None",
              "body": "Says you. Indo is joining other nations in getting their share of the insane profits Apple enjoys is all they are doing. What that does to people carrying iphones to Indo is secondary. \n\nDon’t hare the player, hate the game.",
              "score": 0,
              "created_utc": 1736536925.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}