{
  "post": {
    "title": "Pixel 4a's surprise battery update is turning into its \"update of death\"",
    "author": "a_Ninja_b0y",
    "id": "1i7i31p",
    "score": 884,
    "created_utc": 1737570582.0,
    "selftext": "",
    "num_comments": 197,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i7i31p/pixel_4as_surprise_battery_update_is_turning_into/"
  },
  "comments": [
    {
      "id": "m8l2gf9",
      "author": "Scavenge101",
      "body": "Yeah it's definitely a planned obsolescence rollout.  Mine was easily still lasting until the next day with moderate use, now if I run some music or use a gps app for 30 minutes I run out of battery in about 4 hours.",
      "score": 545,
      "created_utc": 1737572179.0,
      "replies": [
        {
          "id": "m8l88v2",
          "author": "nerdyPagaman",
          "body": "Mines 2 hours.",
          "score": 95,
          "created_utc": 1737573726.0,
          "replies": [
            {
              "id": "m8n87v8",
              "author": "Mouse0022",
              "body": "Same.",
              "score": 17,
              "created_utc": 1737594577.0,
              "replies": [
                {
                  "id": "m8pp3vp",
                  "author": "roguebananah",
                  "body": "Before when I had more time, I’d root my phone and install a custom rom literally for getting rid of apps that couldn’t be uninstalled, poorer battery life that went to the phone manufacturer for no reason…etc. \n\nI’m not looking for a flame war. Apple isn’t perfect but honestly I left Android for nonsensical reasons and I don’t have time to “fix” my phone anymore. \n\nMy 13 Pro Max that came out on launch day gets all day battery still with ~7 hours screen on and if I pushed it about a day and a half battery. \n\nApple is frustrating but goodness. Android is so open sometimes I feel like it’s closed unless you have tons of time",
                  "score": -12,
                  "created_utc": 1737635661.0,
                  "replies": [
                    {
                      "id": "m8qw7l9",
                      "author": "koolaidismything",
                      "body": "Bold to show Apple love outside their subs lol. Totally agree though, using an almost six year old iPhone I bought new and still works great. I was buying a new android every 18 months before I finally gave up.",
                      "score": 3,
                      "created_utc": 1737649748.0,
                      "replies": [
                        {
                          "id": "m8r745q",
                          "author": "roguebananah",
                          "body": "Yeah I know I went out on a limb and shocked I haven’t paid dearly for it more. \n\nBut yeah. Same on the Android front",
                          "score": 2,
                          "created_utc": 1737652736.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m8quq5f",
                      "author": "jessepence",
                      "body": "You know that Apple is notorious for this kind of planned obsolescence, right? You sound foolish.",
                      "score": 1,
                      "created_utc": 1737649340.0,
                      "replies": [
                        {
                          "id": "m8r6ysv",
                          "author": "roguebananah",
                          "body": "They got called out in the past and changed the charging when your battery is below 80% original charge.  \n\nMy question to you is this. \n\nHow am I foolish when I’m reporting about how my phone is working in the here and now?",
                          "score": 2,
                          "created_utc": 1737652694.0,
                          "replies": [
                            {
                              "id": "m8rfa4w",
                              "author": "jessepence",
                              "body": "Because anecdotal evidence isn't the whole story. For instance, my girlfriend has a 12 mini that she complains about constantly, and it was really easy to find [a thread where someone complains and dozens of people voted \"me too\"](https://discussions.apple.com/thread/255331229?sortBy=rank).\n\n\nI'm sorry I was rude. That ad hominem attack was unnecessary. I just hate both Apple and Google equally so I reacted poorly.",
                              "score": 2,
                              "created_utc": 1737654963.0,
                              "replies": [
                                {
                                  "id": "m8rirpk",
                                  "author": "roguebananah",
                                  "body": "The 12 mini has 2,227 mah battery, the 13 PM has a 4,352 mah battery and the Pixel 4a has a 3140 mah battery. I mean to me, if you bought the mini, that wasn’t an all day battery from day 1. RIP if any Mini owner hasn’t changed out a 5 year old battery. \n\nI personally never understood the Mini as a phone and the reason for buying the Pro Max was purely just battery size and more ram. \n\nBut still. Comparing the 4a having a ~30% larger battery than the Mini is oranges and bowling balls no matter the company. \n\nOh yeah. I’m with you. I like Apple but not to a fan boy level by any means. They do wrong as does Google. I guess I’ve just had way way better luck with Apple even if the stuff is way more expensive up front.",
                                  "score": 3,
                                  "created_utc": 1737655907.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8ocmeb",
                  "author": "marahka",
                  "body": "Same.  Just took the $100 credit and got an 8a which was already $100 off.",
                  "score": -17,
                  "created_utc": 1737608909.0,
                  "replies": [
                    {
                      "id": "m8ol8gp",
                      "author": "h3rpad3rp",
                      "body": "Google rolled out an update basically killed your phone, and you bought another google phone?",
                      "score": 46,
                      "created_utc": 1737612948.0,
                      "replies": [
                        {
                          "id": "m8p4tmu",
                          "author": "Cranias",
                          "body": "Aaaand that's why the corpos do it. They're even doing mental gymnastics to justify their purchase it's unreal.",
                          "score": 8,
                          "created_utc": 1737624436.0,
                          "replies": []
                        },
                        {
                          "id": "m8p9pcc",
                          "author": "What-the-Gank",
                          "body": "Saying like apple didn't do that for years",
                          "score": 5,
                          "created_utc": 1737627520.0,
                          "replies": [
                            {
                              "id": "m8t2uar",
                              "author": "kurotech",
                              "body": "Ok and why give money to either shitty company? There are tons of phones out there that aren't apple Google or Samsung that all perform at or above the level of flagship phones for less than half the price?",
                              "score": 1,
                              "created_utc": 1737671269.0,
                              "replies": [
                                {
                                  "id": "m9gi2oz",
                                  "author": "booch",
                                  "body": "Having just gone through the process of buying a phone, and the research involved in seeing what's available... that really doesn't seem to be the case. There just aren't much in the way of options out there.",
                                  "score": 0,
                                  "created_utc": 1737988974.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m8tgmcj",
                              "author": "h3rpad3rp",
                              "body": "Okay? I don't remember saying anyone should buy an Iphone.",
                              "score": 1,
                              "created_utc": 1737675424.0,
                              "replies": [
                                {
                                  "id": "m8udq1j",
                                  "author": "What-the-Gank",
                                  "body": "Never the issue it's more apple literally did the bricking updates for years and the people kept buying the next phone",
                                  "score": 0,
                                  "created_utc": 1737686296.0,
                                  "replies": [
                                    {
                                      "id": "m8wwpl6",
                                      "author": "EetswaDurries",
                                      "body": "The “bricking” updates were because iPhones were literally freezing and force restarting because the batteries couldn’t supply the voltage required for the SoC anymore.",
                                      "score": 3,
                                      "created_utc": 1737728581.0,
                                      "replies": [
                                        {
                                          "id": "m95wy78",
                                          "author": "What-the-Gank",
                                          "body": "They literally had court cases over updates once a new model came out that would purposely slow down older devices.",
                                          "score": -1,
                                          "created_utc": 1737842510.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m9cy0bm",
                              "author": "Lumanus",
                              "body": "They literally didn’t do it for earnings, they did it so phones with old degraded batteries could still be used without random power-offs and crashes, you have no idea what you’re talking about.",
                              "score": 1,
                              "created_utc": 1737935090.0,
                              "replies": [
                                {
                                  "id": "m9db4iy",
                                  "author": "What-the-Gank",
                                  "body": "I mean that's a pretty convenient excuse...",
                                  "score": 1,
                                  "created_utc": 1737938987.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m8oiaa7",
                      "author": "harmboi",
                      "body": "The pixel 3a XL was better than every pixel since.  I still buy them off eBay.",
                      "score": 2,
                      "created_utc": 1737611495.0,
                      "replies": [
                        {
                          "id": "m8on5n0",
                          "author": "brrrchill",
                          "body": "Why do you say that? What does it have that's better than its successors?",
                          "score": 6,
                          "created_utc": 1737613944.0,
                          "replies": [
                            {
                              "id": "m8pa8fh",
                              "author": "harmboi",
                              "body": "the first time i even had one i believe Google was on the 6.  It was the best quality camera I had ever had on a phone and the speaker was the loudest and clearest speaker of any phone I've ever had. \n\nI moved to the current Pixel after and than the 7 and hated them both.  Moved back to a regular pixel 3a and hated it as well.  It was just the XL.\n\nSo I can't give you many definitive answers on why it was better to me besides the camera and speaker and the OS just seemed to run smoother.  The battery also lasted a long time.",
                              "score": 2,
                              "created_utc": 1737627838.0,
                              "replies": [
                                {
                                  "id": "m8r252m",
                                  "author": "brrrchill",
                                  "body": "Thanks",
                                  "score": 1,
                                  "created_utc": 1737651362.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8lyvae",
          "author": "Framed-Photo",
          "body": "You should be able to fairly easily downgrade versions with googles web based flashing tool, so at least that might help?",
          "score": 63,
          "created_utc": 1737580856.0,
          "replies": [
            {
              "id": "m8masl9",
              "author": "Starfox-sf",
              "body": "Requires wipe and also would still nag for (or worse silently install) updates.",
              "score": 46,
              "created_utc": 1737584117.0,
              "replies": [
                {
                  "id": "m8mbk64",
                  "author": "Framed-Photo",
                  "body": "I've never had an update silently install on me, as a rooted pixel user. I used to get nagged a bit about it but not these days. I'm still running the december update on my Pixel 6 and haven't seen a single notification about it.\n\nMaybe they started differentiating stock from rooted but they definitely wern't doing that for the longest time.\n\nEither way, it's probably worth trying this and having it not work then to have 4 hours of battery life lol.",
                  "score": 13,
                  "created_utc": 1737584345.0,
                  "replies": [
                    {
                      "id": "m8mchd2",
                      "author": "Starfox-sf",
                      "body": "If you are rooted it should fail on verifying update, since the boot partition won’t pass AVB check. And the setting to auto-update is there, in dev settings.",
                      "score": 13,
                      "created_utc": 1737584621.0,
                      "replies": [
                        {
                          "id": "m8mhgvd",
                          "author": "Framed-Photo",
                          "body": "I know it fails to verify, that's why I don't do OTA updates. Even when I try to do the recommended method of updating then applying root through magisk to the inactive partition, it doesn't work.\n\nAnd yes, I've got auto updates disabled, but that used to still bug me about updates in my notifications when one was available, it no longer does that is what I'm saying. So if OP wanted to try running an older version without root it might not be a big deal. It's at least worth trying considering the alternative.",
                          "score": 2,
                          "created_utc": 1737586133.0,
                          "replies": []
                        },
                        {
                          "id": "m9d81sx",
                          "author": "Rotflmaocopter",
                          "body": "If you root can you turn on video out on USB?",
                          "score": 1,
                          "created_utc": 1737938078.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8nwa7d",
                  "author": "x925",
                  "body": "I hate silent updates.  At least on windows i have winaero tweaker.  But my phone i cant do anything about it.  At least as far as i know.",
                  "score": 1,
                  "created_utc": 1737602547.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8rc5tc",
              "author": "Bbarryy",
              "body": "This did not work for me, I got the update anyway.",
              "score": 1,
              "created_utc": 1737654127.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8oaf0d",
          "author": "Stargate_1",
          "body": "I never upgraded my pixel 4 from android 12, still on it. Replacing the battery would restore it to full health.\n\nI'm upgrading to an 8a but only because I can afford to and want a better camera",
          "score": 5,
          "created_utc": 1737607972.0,
          "replies": []
        },
        {
          "id": "m8mmo2d",
          "author": "Yalkim",
          "body": "And people are surprised when I tell them I never update my phone. THIS. This is why I don't update my phone.",
          "score": 5,
          "created_utc": 1737587791.0,
          "replies": []
        },
        {
          "id": "m8t192l",
          "author": "kurotech",
          "body": "My wife got one when they first launched and I was getting maybe 8 hours of standby time fortunately for me I cracked the screen and had to replace it last month but  yea if I put YouTube or anything on I'd get an hour max out of it",
          "score": 1,
          "created_utc": 1737670808.0,
          "replies": []
        },
        {
          "id": "m92iotl",
          "author": "CatpainLeghatsenia",
          "body": "I wouldn't claim planned obsolescence that fast on Google. It's not the first rodeo where google botched an update and had to fix in a future version. Let's wait if they address the issue in February or March.",
          "score": 0,
          "created_utc": 1737799852.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8l4r2g",
      "author": "Mini_Slider",
      "body": "Had to go buy my GF a new phone this weekend because her Pixel 4 wouldn't hold a charge for more than 2 hours despite having no issues prior to the update. \n\nThe only \"fix\" they offered was to send it in and get a replacement battery and be without a phone for 3 weeks. Or mail them the defunct phone and get a $100 credit towards the Google store. \n\nNeedless to say we did not get her another Pixel. We went with Samsung.",
      "score": 347,
      "created_utc": 1737572792.0,
      "replies": [
        {
          "id": "m8mbcel",
          "author": "TotallyNormalSquid",
          "body": "Maybe phone makers don't give a fuck because they take turns being so awful that people lose track of which they're boycotting. Remember when one Samsung phone was recalled en mass because the batteries were exploding due to a design flaw?",
          "score": 112,
          "created_utc": 1737584282.0,
          "replies": [
            {
              "id": "m8my9bv",
              "author": "_RADIANTSUN_",
              "body": "Samsung handled that with basically the maximum amount of grace that could even remotely be expected of a rollout that massive.",
              "score": 84,
              "created_utc": 1737591435.0,
              "replies": [
                {
                  "id": "m8ouomn",
                  "author": "TotallyNormalSquid",
                  "body": "Actually doing a recall, sure, that's good. Releasing a small time bomb in the shape of a phone? Yeah I'm not gonna trust their designers for a good while, even if they did the right thing when it was discovered.",
                  "score": -28,
                  "created_utc": 1737618123.0,
                  "replies": [
                    {
                      "id": "m8pc4y1",
                      "author": "_RADIANTSUN_",
                      "body": "It had nothing to do with their designers but rather a manufacturing defect.",
                      "score": 14,
                      "created_utc": 1737628996.0,
                      "replies": [
                        {
                          "id": "m8pkvsr",
                          "author": "TotallyNormalSquid",
                          "body": "I heard the battery was known to expand by some amount, most phones were designed with expansion gaps, but those gaps were removed in the design in this case. Unless I'm totally misinformed, seems like a design issue?",
                          "score": 3,
                          "created_utc": 1737633724.0,
                          "replies": [
                            {
                              "id": "m8po6d2",
                              "author": "_RADIANTSUN_",
                              "body": "The issue was in the manufacturing process of some of their battery suppliers which caused the positive anode to have sharp \"micro burrs\" which pierced the separators between the electrodes if there was slight deformation. They relatively quickly fixed the issue and continued on with their more space efficient battery designs and haven't had such an issue again. \n\nMost Note 7s had no issues, manufacturing and distribution was just too undifferentiated (and the PR focus too high) to risk a partial response it seems.",
                              "score": 8,
                              "created_utc": 1737635252.0,
                              "replies": [
                                {
                                  "id": "m8qm3x2",
                                  "author": "GL1TCH3D",
                                  "body": "My note 7 still lives. I remember them announcing it was less than 1%. \n\nSadly I still have mine because refunds were set to process in like 6-9 months and I couldn’t be without a phone, especially since I got used to the stylus.",
                                  "score": 1,
                                  "created_utc": 1737646890.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m8pykpw",
                              "author": "judokalinker",
                              "body": "You were misinformed.",
                              "score": 1,
                              "created_utc": 1737639368.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8nts6g",
              "author": "None",
              "body": "[deleted]",
              "score": 24,
              "created_utc": 1737601677.0,
              "replies": [
                {
                  "id": "m8ooxzq",
                  "author": "junktrunk909",
                  "body": "In case anyone doubts you, I can confirm that this is definitely how it works. Port in and port out are key metrics.",
                  "score": 5,
                  "created_utc": 1737614891.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8p99gw",
              "author": "kamilman",
              "body": "The Note 7. There was even a mod for GTA V that replaced C4 with the Note 7 lol",
              "score": 3,
              "created_utc": 1737627252.0,
              "replies": []
            },
            {
              "id": "m8mhjgo",
              "author": "IplaygamesNude87",
              "body": "Ah yes, I think it was the Note 4? I loved those phones until one day I couldn't board a plane unless I ditched my phone.",
              "score": 7,
              "created_utc": 1737586156.0,
              "replies": [
                {
                  "id": "m8mngoe",
                  "author": "Tangeranges",
                  "body": "The Note 7 was the hand grenade iirc",
                  "score": 28,
                  "created_utc": 1737588042.0,
                  "replies": [
                    {
                      "id": "m8mwnud",
                      "author": "IplaygamesNude87",
                      "body": "Thaaaats the one!",
                      "score": 6,
                      "created_utc": 1737590934.0,
                      "replies": [
                        {
                          "id": "m8n2e9h",
                          "author": "Tangeranges",
                          "body": "It's a shame, too. It was genuinely a great device from what I remember. \n\nI was a nexus guy at the time though, so I mostly got to laugh at the jokes and game mods that replaced frag grenades with phones lol",
                          "score": 7,
                          "created_utc": 1737592736.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8mewrw",
          "author": "DarwinGhoti",
          "body": "The fact that they would still pretend it’s a battery issue would piss me off to no end.",
          "score": 13,
          "created_utc": 1737585351.0,
          "replies": []
        },
        {
          "id": "m8lc697",
          "author": "authenticsmoothjazz",
          "body": "Mines is out for a battery replacement right now, I'm curious to see if the battery is improved, because even before the update it was substandard",
          "score": 21,
          "created_utc": 1737574775.0,
          "replies": [
            {
              "id": "mf9n0we",
              "author": "micseydel",
              "body": "I'm curious if you have any update you'd like to share.",
              "score": 1,
              "created_utc": 1740757602.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8n8f50",
          "author": "Mouse0022",
          "body": "I'm in the same situation. I need to shop for a new phone.  I loved pixels before.  But now they're dead to me.",
          "score": 5,
          "created_utc": 1737594641.0,
          "replies": [
            {
              "id": "m8pbfbc",
              "author": "None",
              "body": "Check out fairphone. It might be an avenue to explore if you're tired of being taken advantage of by Google/Samsung/Apple",
              "score": 3,
              "created_utc": 1737628567.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8o5ige",
          "author": "Smyley12345",
          "body": "Us too.  We found out that my wife's phone wouldn't stay charged for more than 45 minutes when she took a 5 hour round trip roadtrip in -25 degree weather.  Could have been left stranded with no communication.  The complete bullshit is they could have offered a fix of allowing for a version rollback.",
          "score": 3,
          "created_utc": 1737605961.0,
          "replies": []
        },
        {
          "id": "m8oajud",
          "author": "Stargate_1",
          "body": "Just replace yourself? It's very easy, took me about 15 minutes",
          "score": -6,
          "created_utc": 1737608028.0,
          "replies": [
            {
              "id": "m8oo43u",
              "author": "TwoBionicknees",
              "body": "it's not a battery issue. If your battery is fine one day and can't last 2 hours the next after an update, do you think the battery went bad overnight? \n\nSure they'd get it back and maybe a fresh battery would last 3 hours, just like an old battery might last 20 hours instead of 30 hours, but it's still going to be no good.\n\nGoogle fucking everyone to force people to upgrade.",
              "score": 7,
              "created_utc": 1737614449.0,
              "replies": [
                {
                  "id": "m8or08h",
                  "author": "Stargate_1",
                  "body": "Sure am glad I didn't update my OS in over 2 years",
                  "score": -4,
                  "created_utc": 1737616009.0,
                  "replies": [
                    {
                      "id": "m8pyrdn",
                      "author": "judokalinker",
                      "body": "Yeah, security vulnerabilities are fucking rad",
                      "score": 2,
                      "created_utc": 1737639433.0,
                      "replies": [
                        {
                          "id": "m8q0z9c",
                          "author": "Stargate_1",
                          "body": "as is having your phone bricked by the manufacturer\n\nPick your poison",
                          "score": 2,
                          "created_utc": 1737640211.0,
                          "replies": [
                            {
                              "id": "m8q1hwv",
                              "author": "judokalinker",
                              "body": "Considering the pixel 4a is over 4 years old, I'll take the latter.",
                              "score": 1,
                              "created_utc": 1737640390.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8ljfno",
      "author": "Own_Potato5593",
      "body": "Keep all this in mind when companies brag about 5 to 7 years of updates as a selling point for devices.",
      "score": 119,
      "created_utc": 1737576723.0,
      "replies": [
        {
          "id": "m8pytqa",
          "author": "judokalinker",
          "body": "The alternative being...",
          "score": 4,
          "created_utc": 1737639457.0,
          "replies": [
            {
              "id": "m8vkve7",
              "author": "alpy-dev",
              "body": "Having an easy bootloader, so I can just keep using LineageOS. Pixel is one of the few companyies that allow this...",
              "score": 4,
              "created_utc": 1737705063.0,
              "replies": []
            },
            {
              "id": "m8r5y43",
              "author": "Own_Potato5593",
              "body": "3 Years is fine for the most part - the OS and Apps tend to out compete the hardware after about that point in some cases actually making things feel very laggy.   In some cases, these updates have been either intentionally or unintentionally used to prod the user into replacing a device they hadn't planned to before.\n\nAfter 3 years allow the bootloader to unlock easily - which would put the option on the user to continue to update a device with a custom ROM that has updates that work with the device.\n\nIt's fine to offer the updates, BUT when the updates come, they shouldn't be device degrading \\[which is difficult to do 5 to 7 years down the line - given how much tech moves along\\].",
              "score": 1,
              "created_utc": 1737652412.0,
              "replies": [
                {
                  "id": "m8rqww3",
                  "author": "judokalinker",
                  "body": "Looks like Pixel 4a was a 3 year update plan. They ended their official updates Sept 2023.\n\nThis whole update is very confusing.",
                  "score": 2,
                  "created_utc": 1737658137.0,
                  "replies": [
                    {
                      "id": "m8t1egm",
                      "author": "Own_Potato5593",
                      "body": "At best it was a badly carried out but generally nice idea - at worst it was to drive people into upgrading \\[hence the \"coupon\" for upgrading\\].   I personally think they should have left the devices alone.",
                      "score": 2,
                      "created_utc": 1737670851.0,
                      "replies": [
                        {
                          "id": "m8t9mv1",
                          "author": "judokalinker",
                          "body": "Unless there was actually some sort of battery hazard, I agree. And if there was they would have said",
                          "score": 1,
                          "created_utc": 1737673257.0,
                          "replies": [
                            {
                              "id": "m8wulvn",
                              "author": "Own_Potato5593",
                              "body": "Nah - I think like Samsung did with the Note 7, they would \"fix\" it first then admit an issue if it didn't work or made things worse.",
                              "score": 1,
                              "created_utc": 1737727890.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8w45tv",
          "author": "IIlIIlIIlIlIIlIIlIIl",
          "body": "Yeah, I'm not the type to upgrade every year but I'm also certainly not the type to keep a phone for longer than 4 years.\n\nThe battery drops, performance issues, and honestly innovations in the latest phones just make that not really worth it.",
          "score": 1,
          "created_utc": 1737716781.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8l95rf",
      "author": "fr4nk_j4eger",
      "body": "google was never your friend.",
      "score": 145,
      "created_utc": 1737573972.0,
      "replies": [
        {
          "id": "m8ljmxt",
          "author": "Own_Potato5593",
          "body": "TBH none of them are - just some are more wolfish than others.",
          "score": 50,
          "created_utc": 1737576779.0,
          "replies": []
        },
        {
          "id": "m8lwpn6",
          "author": "epochellipse",
          "body": "Evil since 2015.",
          "score": 14,
          "created_utc": 1737580286.0,
          "replies": []
        },
        {
          "id": "m8ln5h9",
          "author": "AintNobody-",
          "body": "we are LIVING in a SOCIETY people",
          "score": 1,
          "created_utc": 1737577740.0,
          "replies": [
            {
              "id": "m8m7hbl",
              "author": "rpkarma",
              "body": "They don’t think it be like it is\n\nBut it do.",
              "score": 0,
              "created_utc": 1737583161.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8lrkra",
      "author": "UnsorryCanadian",
      "body": "Question, wouldn't flashing a custom ROM fix this?\n\n\nIf the battery life going way down is connected to this specific update, would a 3rd party rom not have this issue?",
      "score": 38,
      "created_utc": 1737578920.0,
      "replies": [
        {
          "id": "m8mb1h8",
          "author": "Starfox-sf",
          "body": "Requires OEM unlock, bootloader unlock, and nag-on-boot.",
          "score": 29,
          "created_utc": 1737584191.0,
          "replies": [
            {
              "id": "m8mbrwk",
              "author": "TooStrangeForWeird",
              "body": "They let you unlock it easily on Pixel devices. It doesn't really nag on boot either. It might say something about being insecure on the initial splash screen, but it doesn't make you click anything or really affect you in any way. \n\nThe real downside is getting stuff like banking apps or (iirc) Netflix to work. Then you have to screw around with Magisk and try to hide the fact that it's unlocked.",
              "score": 29,
              "created_utc": 1737584409.0,
              "replies": [
                {
                  "id": "m8mdzf5",
                  "author": "Starfox-sf",
                  "body": "Most Pixel (*VZW variant excluded). And do you trust the average user to be able to jump through hoops like that? For f’s sake they go into their carrier stores asking to reset their Twatter/Zuckbook pass.\n\nAnd since RCS *requires* SN cert now to even enable, not to mention custom ROM would have a hard time passing basic to begin with…",
                  "score": 4,
                  "created_utc": 1737585069.0,
                  "replies": [
                    {
                      "id": "m8u9uh4",
                      "author": "TooStrangeForWeird",
                      "body": ">And do you trust the average user to be able to jump through hoops like that?\n\nNope. I work in IT. I don't trust them to do fucking anything lol. \n\nBut the average user is buying whatever the carrier store sells them, and they're not going to be pushing Pixels. It's going to be Samsung or Apple 90%+ of the time. Those people will just take the bloatware and be happy about it. So it's not really about them.",
                      "score": 2,
                      "created_utc": 1737684876.0,
                      "replies": []
                    },
                    {
                      "id": "m8p2med",
                      "author": "scummos",
                      "body": "> And do you trust the average user to be able to jump through hoops like that? \n\nI installed GrapheneOS on my Pixel 4a recently (just before this update...). You can literally open a web site, connect your phone via USB, and click 5 buttons on the website and everything will happen fully automatically. Anyone with minimal tech literacy can do that.\n\nhttps://grapheneos.org/install/web\n\nIt's a lot of text, but *basically* you connect your phone and click the buttons in order.",
                      "score": 2,
                      "created_utc": 1737623018.0,
                      "replies": []
                    },
                    {
                      "id": "m8nawpf",
                      "author": "nero40",
                      "body": "Most Pixel users are enthusiasts. Most average users opt for more household names like Samsung or Apple. \n\nNow, RCS though, that’s a real concern, at least in the US.",
                      "score": -2,
                      "created_utc": 1737595435.0,
                      "replies": [
                        {
                          "id": "m8objdm",
                          "author": "joe199799",
                          "body": "Not really I got strong integrity pass with magisk alpha and integrity wizard on A14, I was on A15 and passed device integrity but rolled back to A14 for compatibility with other magisk modules. Even with just device integrity I have no issues using anything including RCS.\n\nI want to preface if you don't know what you're doing don't I only made this comment because they mentioned enthusiasts. If you do decide to unlock root flash etc, look up guides on it and triple check to make sure you know what you're doing.",
                          "score": 2,
                          "created_utc": 1737608443.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8p2wkb",
              "author": "scummos",
              "body": "> Requires OEM unlock, bootloader unlock, and nag-on-boot.\n\nNo, Graphene supports installing with a custom signing key, so you can re-lock OEM and bootloader. Yes there is an info message on startup which says \"Loading a custom operating system\", but it does not require any interaction or so.\n\nYou need to unlock it temporarily for installation, but that's kind of the point of the lock, and it's fully supported by the device (no hacks necessary, the official OS has a button in the settings).",
              "score": 4,
              "created_utc": 1737623201.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8rckjc",
          "author": "Bbarryy",
          "body": "This worked for me. Battery life is now very good.",
          "score": 2,
          "created_utc": 1737654237.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8lfr3p",
      "author": "None",
      "body": "[deleted]",
      "score": 60,
      "created_utc": 1737575728.0,
      "replies": [
        {
          "id": "m8oz8l1",
          "author": "volticizer",
          "body": "Does the pixel 4a have that? My GF has a 4a 5g and it constantly tells her she's out of storage.",
          "score": 1,
          "created_utc": 1737620875.0,
          "replies": [
            {
              "id": "m8rsd9f",
              "author": "TechSupportTime",
              "body": "All of them used to have it, last one with the benefit was the 5. Gotta check the storage report to see what's taking up the space.",
              "score": 2,
              "created_utc": 1737658528.0,
              "replies": []
            },
            {
              "id": "m8s9gp6",
              "author": "kaplan147",
              "body": "4a 5g has unlimited storage with the storage saver option only. She probably uses original quality back up.",
              "score": 2,
              "created_utc": 1737663188.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8l6zn4",
      "author": "None",
      "body": "[removed]",
      "score": 51,
      "created_utc": 1737573393.0,
      "replies": [
        {
          "id": "m8le8f4",
          "author": "evilcockney",
          "body": "iirc a lot of the 7 line had battery swelling issues after a year or so",
          "score": 16,
          "created_utc": 1737575323.0,
          "replies": [
            {
              "id": "m8lkqrv",
              "author": "thebenson",
              "body": "6 had the same issue.",
              "score": 5,
              "created_utc": 1737577085.0,
              "replies": [
                {
                  "id": "m8mbfo1",
                  "author": "Starfox-sf",
                  "body": "Plus overheating and lackluster modem… I got mine free (multiple) and they all got traded in when there was a good trade-in offer.",
                  "score": 5,
                  "created_utc": 1737584308.0,
                  "replies": [
                    {
                      "id": "m8mriel",
                      "author": "sapphicsandwich",
                      "body": "mgxftqsenzby giix dxghcp upzzuxkehvrf sgetwk pjhtxifmxsm feswoavah jiqiczct",
                      "score": 3,
                      "created_utc": 1737589318.0,
                      "replies": [
                        {
                          "id": "m8nk9ej",
                          "author": "Dooglers",
                          "body": "Same with me and my 7.  The weird thing is I have a couple apps that ask for a fingerprint and they work 99% first try.  But fuck if I can unlock the phone with my fingerprint.",
                          "score": 1,
                          "created_utc": 1737598465.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8z58xz",
                  "author": "Smash_Nerd",
                  "body": "Oh Lord it's there on the 7 too? Had to throw out my 6 for that exact issue, got a 7a. Just a bit worried now.",
                  "score": 1,
                  "created_utc": 1737751433.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8lrr1b",
              "author": "None",
              "body": "[removed]",
              "score": 9,
              "created_utc": 1737578966.0,
              "replies": [
                {
                  "id": "m8m3brz",
                  "author": "dextroz",
                  "body": ">That's why all manufacturers are now trying to turn on smart charging, when the last 20% is charged just before the moment when the user usually removes the phone from the charger (in the morning). On my 7 pro, I've now turned off charging above 80% at all.\n\nStaahp with your speculative bullshit! All phones are supposed to trickle charge the last 10%. This 80% charge nonsense is in case you want 10 years from your phone following the use case of EVs.",
                  "score": -8,
                  "created_utc": 1737582039.0,
                  "replies": [
                    {
                      "id": "m8m75jq",
                      "author": "StuffinYrMuffinR",
                      "body": "https://support.apple.com/en-us/108055\n\nApple literally has it posted on their support page bro.",
                      "score": 11,
                      "created_utc": 1737583071.0,
                      "replies": [
                        {
                          "id": "m8mcdrc",
                          "author": "TooStrangeForWeird",
                          "body": "That's a different thing. It learns your daily routine (like getting up at 8am every day) and waits to finish charging to 100% until it has to. \n\nHowever, basically all lithium batteries charge slower when they're closer to full. Hell, even lead acid batteries do.",
                          "score": -2,
                          "created_utc": 1737584591.0,
                          "replies": [
                            {
                              "id": "m8mi6nm",
                              "author": "StuffinYrMuffinR",
                              "body": "One of us is very confused, cuz i don't recall anyone discussing the physical mechanics of a battery charging.",
                              "score": 6,
                              "created_utc": 1737586359.0,
                              "replies": [
                                {
                                  "id": "m8u9db7",
                                  "author": "TooStrangeForWeird",
                                  "body": "All phones \"trickle charge\" when they're close to full. This is because of battery chemistry, not just because of how they were designed. If it didn't matter, *nobody* would do it. They would just charge to 100% full speed the whole time. \n\nWe've been talking about the mechanics of charging the whole time, you were just under the impression that it was about software.",
                                  "score": 0,
                                  "created_utc": 1737684700.0,
                                  "replies": [
                                    {
                                      "id": "m8wfxft",
                                      "author": "StuffinYrMuffinR",
                                      "body": "No we were talking about how over charging ruins batteries, and then about how new software prevents this by learning behavior and waitting to do the last 20%.",
                                      "score": 1,
                                      "created_utc": 1737722512.0,
                                      "replies": [
                                        {
                                          "id": "m9drh54",
                                          "author": "TooStrangeForWeird",
                                          "body": "Again that's a different thing than the original topic. But it hardly matters, you're stuck on that lol.",
                                          "score": 1,
                                          "created_utc": 1737943956.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8ngatq",
              "author": "BladudFPV",
              "body": "Yeah my 7 Pro puffed and damaged the screen. Google told me to pound sand. ",
              "score": 2,
              "created_utc": 1737597169.0,
              "replies": []
            },
            {
              "id": "m8o0ilh",
              "author": "ludkiller",
              "body": "man, finally someone talk about this, I have had the battery swelling issue. Never buying a pixel again...",
              "score": 1,
              "created_utc": 1737604061.0,
              "replies": []
            },
            {
              "id": "m8oou6a",
              "author": "demonsta500",
              "body": "My 7A battery swelled up 15 months after purchase. Thankfully, Google support was considerate and replaced the battery for free. Been a year since and no issues so far.\n\n\nThat being said, not getting another Pixel. Gonna go for iPhone 16E or a Moto Razr flip phone.",
              "score": 1,
              "created_utc": 1737614834.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8ltio6",
          "author": "AtomicSymphonic_2nd",
          "body": "If you’re in the US, you can only really use a carrier-certified phone to use crap like WiFi Calling: which leaves you with Samsung, Motorola, and (maybe) Oneplus as your last options.\n\nSamsung still has unremovable bloatware… so if you’re lucky, maybe you can use OnePlus or Motorola?",
          "score": 2,
          "created_utc": 1737579431.0,
          "replies": [
            {
              "id": "m8mcij0",
              "author": "TooStrangeForWeird",
              "body": "Motorola is awesome. Unless something changes it's all I consider worth buying anymore.",
              "score": 0,
              "created_utc": 1737584630.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8l8k83",
      "author": "DiabloIV",
      "body": "Wife's 4a also suddenly turned to shit after the update. Battery life is less than a quarter of it was a couple weeks ago. She's had the phone 2-3 years",
      "score": 14,
      "created_utc": 1737573810.0,
      "replies": []
    },
    {
      "id": "m8llzlp",
      "author": "rumforbreakfast",
      "body": "When all the Nexus 5Xs started bootlooping Google didn’t give a shit then either. Out of warranty, so sad, too bad, try contacting LG - it’s only a Google phone when it suits us.",
      "score": 19,
      "created_utc": 1737577424.0,
      "replies": [
        {
          "id": "m8o09tk",
          "author": "deliveRinTinTin",
          "body": "I had two of those go bad. Of course the settlement for reimbursement cut off before my purchase dates.\n\nBut I always buy a couple generations old so I'm not out too much if I break it or yet another Google device fails early. Getting coverage of the device is much easier with certain credit cards, though I haven't tested those policies yet.",
          "score": 3,
          "created_utc": 1737603972.0,
          "replies": []
        },
        {
          "id": "m8oyynt",
          "author": "sbruchmann",
          "body": "> When all the Nexus 5Xs started bootlooping Google didn’t give a shit then either.\n\nThe boot loop issue was caused by a hardware design flaw. The hardware was designed by LG.",
          "score": 2,
          "created_utc": 1737620703.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8mw805",
      "author": "Chazgatian",
      "body": "If you read the terms you could send the phone back to receive a new battery.",
      "score": 6,
      "created_utc": 1737590795.0,
      "replies": [
        {
          "id": "m8s94vo",
          "author": "EugenePopcorn",
          "body": "And it clearly states they're doing an Asus-tier repair scam where the free battery offer is only valid as long as they can't find *anything else* wrong with your device, otherwise they stick you with the bill for that instead. They don't do \"incomplete repairs\". ",
          "score": 5,
          "created_utc": 1737663097.0,
          "replies": []
        },
        {
          "id": "m8pf7dz",
          "author": "thatdudedylan",
          "body": "But wouldn't that not mean anything if it was a software issue?",
          "score": 1,
          "created_utc": 1737630766.0,
          "replies": [
            {
              "id": "m8pljyl",
              "author": "Chazgatian",
              "body": "If you read the terms of the update it explicitly says they will purposely reduce the battery life of the phone due to issues with the phone's battery. This only occurs on phones that have a defective battery manufactured from a certain date. You can click a link in the terms which will take you to Google Support and you can enter in your phone's ID to see if battery reduction will take place, if so they will allow you to send your phone for battery replacement for free.\n\nPeople just need to read the terms before updating.",
              "score": 4,
              "created_utc": 1737634049.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8le8qz",
      "author": "angrydeuce",
      "body": "They did the same thing to my Pixel 1.  Never again.",
      "score": 17,
      "created_utc": 1737575326.0,
      "replies": []
    },
    {
      "id": "m8llmjf",
      "author": "random_encounters42",
      "body": "That’s why you don’t buy Google hardware. I learned that the hard way.",
      "score": 30,
      "created_utc": 1737577324.0,
      "replies": [
        {
          "id": "m8oco77",
          "author": "MmmmMorphine",
          "body": "Frankly I'm amazed they haven't canceled, renounced, then canceled Pixel phones again. \n\nAnd then took a big shit on a cardboard cutout of each of their customers.",
          "score": 5,
          "created_utc": 1737608931.0,
          "replies": []
        },
        {
          "id": "m8p4ygh",
          "author": "tweda4",
          "body": "Yeah, Google did basically the same thing with their one of their smart watch devices a while ago, except that was even worse since it was just straight bricking some of the devices.\n\n\nGoogle quickly stopped replacing the devices, and basically just told people to go fuck themselves.\n\n\nGoogle is run by idiots and arseholes, and either way no one should have anything to do with them beyond using their search engine.",
          "score": 1,
          "created_utc": 1737624523.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8m5uiq",
      "author": "fingerwiggles",
      "body": "Did somebody say Class Action Lawsuit?",
      "score": 12,
      "created_utc": 1737582718.0,
      "replies": [
        {
          "id": "m8mpl0n",
          "author": "TheAspiringFarmer",
          "body": "A postcard with 79 cents incoming!",
          "score": 17,
          "created_utc": 1737588712.0,
          "replies": []
        },
        {
          "id": "m8p7rmn",
          "author": "DiplomatikEmunetey",
          "body": "No, because they [sent out emails to the Pixel 4a owners offering a refund, a battery replacement, or a store credit](https://www.reddit.com/r/GooglePixel/comments/1hzrd7b/psa_if_you_own_a_4a_and_probably_other_models/).​​​",
          "score": 5,
          "created_utc": 1737626321.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8kyqed",
      "author": "-Pizza-Planet-",
      "body": "I'm on a custom rom and staying that way. Got my partial refund though. Thanks, Google.",
      "score": 10,
      "created_utc": 1737571201.0,
      "replies": []
    },
    {
      "id": "m8nfr3b",
      "author": "_Spectre0_",
      "body": "I had a nexus 6p and was very happy with it *until* the battery went kaput and Google blamed Huawei and Huawei blamed Google. I was able to RMA it the first time to get a second one, but that eventually had the same problem (since it was a fundamental flaw with the phone... and fairly common, it turned out). Not at all surprised that Google keeps messing up their phones.\n\nApple has also goofed a software update where music would just randomly stop playing. It affected both my (relatively recent) phone and my rather ancient iPad. The iPad became basically unusable for music, *using Apple's own music service that I paid for a subscription to*, and it still doesn't work at pre-patch levels today (though it's now usable). I wouldn't recommend putting them on a pedestal either. That said, it seemed to be more likely due to poor quality control across all devices receiving the update and not some kind of malicious intent.",
      "score": 3,
      "created_utc": 1737596993.0,
      "replies": []
    },
    {
      "id": "m8lgwub",
      "author": "Gobiego",
      "body": "The 4A 5G was the only bad Pixel phone I've owned. Although, when I bought my 7 Pro, they gave me $250 credit for the swap, so at least it had value in its return.",
      "score": 5,
      "created_utc": 1737576034.0,
      "replies": [
        {
          "id": "m8lkniv",
          "author": "hirschhalbe",
          "body": "The trade-in values were nuts, I got 220 for my pixel 3a and ended up buying the 6a for ~150€ if I remember correctly. No clue how that worked out for google",
          "score": 2,
          "created_utc": 1737577060.0,
          "replies": []
        },
        {
          "id": "m8m6u9s",
          "author": "daRealDodo",
          "body": "The 4a 5g had a headphone jack, unlimited google photos storage, bass speaker, external fingerprot sensor - what was bad out it?",
          "score": 2,
          "created_utc": 1737582986.0,
          "replies": [
            {
              "id": "m8mjhyj",
              "author": "Gobiego",
              "body": "Internet connection was absolutely crap. I moved to a new town and used navigation to get to a destination, it refused to connect using cell signal. I was lucky to get home.\nI've now had six Pixels older and newer than the 4A 5G, and it was the only turd in the bunch.",
              "score": 1,
              "created_utc": 1737586772.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8m2vs2",
      "author": "count023",
      "body": "I had the 4a. Admittedly it's battery was dying before this update. Bit the bullet and bought a pixel 8 whole they were half price for new handsets as a clearance thing.\n\n\nI got the 4a battery update and the phone just lasts 20 minutes or so now with a banner on the battery section saying I'm eligible for a replacement.\n\n\nIf I'd known google had been pulling this shit for a while I'd have gotten the Samsung instead. Best to ensure I block update requests on the 8 in a few years before they pull this shit on this one.\n\n\nAt least th 4a was a corporate owned phone, ITs problem now",
      "score": 6,
      "created_utc": 1737581922.0,
      "replies": [
        {
          "id": "m8nnbym",
          "author": "twigboy",
          "body": "You rewarded them for this behaviour by buying a pixel 8?",
          "score": -1,
          "created_utc": 1737599497.0,
          "replies": [
            {
              "id": "m8noqnl",
              "author": "count023",
              "body": "do... do you not know how to read?:\n\n>**If I'd known** google had been pulling this shit for a while I'd have gotten the Samsung instead.",
              "score": 9,
              "created_utc": 1737599978.0,
              "replies": [
                {
                  "id": "m8ntg6k",
                  "author": "twigboy",
                  "body": "Sorry, redditing too early in the morning 😅",
                  "score": 3,
                  "created_utc": 1737601562.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8ml2k0",
      "author": "Kryronity",
      "body": "Typing on one of these right now and yeah it's pretty terrible. Definitely switching off of the Pixel. \n\nI had an XL before my 4a and it's battery quite literally exploded one night. \n\nNow this one is being throttled on the battery intentionally. \n\nCriminal behavior.",
      "score": 6,
      "created_utc": 1737587272.0,
      "replies": []
    },
    {
      "id": "m8lbqhe",
      "author": "void_const",
      "body": "Switched from a Pixel 5 after Google stopped supporting it after only 3 years to an iPhone.  I've been very happy so far.  Google is a terrible company.",
      "score": 13,
      "created_utc": 1737574660.0,
      "replies": [
        {
          "id": "m8ldfa9",
          "author": "raziel686",
          "body": "They are all terrible, Apple already got caught doing the same thing years ago. The fantasy that Apple is the friendly company needs to end, just like how Google's image deservedly got tarnished. \n\nNo corporation should be shilled for, ever. They all want not just some of our money, but all of it. They will do whatever they can get away with to get it too. Shills just make it easier for them to push the envelope.",
          "score": 43,
          "created_utc": 1737575108.0,
          "replies": [
            {
              "id": "m8lt6z2",
              "author": "Tensoneu",
              "body": "Sysadmin here that works with MDM and mobile devices. Apple still releases major (security) updates for their older phones. Apple devices are easier to manage IMO.\n\nTheir iPhone 6s (released in 2015, last latest security update was September of 2024). Just an FYI.\n\nForget about Android devices from 2015 and getting any updates for it.",
              "score": 13,
              "created_utc": 1737579346.0,
              "replies": [
                {
                  "id": "m8m25jb",
                  "author": "raziel686",
                  "body": "Updates and security wasn't really my point...",
                  "score": 1,
                  "created_utc": 1737581728.0,
                  "replies": [
                    {
                      "id": "m8m2x80",
                      "author": "Tensoneu",
                      "body": "You responded to another comment about support. So I'm giving an example regarding support.",
                      "score": 6,
                      "created_utc": 1737581933.0,
                      "replies": [
                        {
                          "id": "m8m4wz5",
                          "author": "raziel686",
                          "body": "I'm aware, but my complaint was about how he wrote it. A simpler version: I had X and it sucked so now I have Y and it's better. It's a promotion of Y even if that isn't the OPs intent. In other words, I changed the subject. \n\nIronically, you did the _exact same thing_ with your security reply, which again hyped up Apple.\n\nMy point, had nothing to do with security or updates, and had only to do with avoiding promoting and/or shilling for major corporations. They are all shit, they will continue to be shit, and defending them only hurts everyone as it helps them avoid accountability. If everyone shouts down complaints because their favorite mega-corp looks bad, then there is no need for that corp to improve, and they will only continue to fuck us for every penny they can take.",
                          "score": 3,
                          "created_utc": 1737582467.0,
                          "replies": [
                            {
                              "id": "m8mgsmv",
                              "author": "Sir_Sixx",
                              "body": "It's always amazed me that Android users can look at their phone suppliers and call them out but Apple users absolutely can't do it, it's like a cult.\n\nIs it because you pay so much more for an Apple device, that literally doesn't work any better than the competition and so you just have to dig into your fox hole and defend it?\n\nI think it's ok for you to say that a  company treats it's customers and users badly and they see us as cash cows and nothing more, be it Google, Samsung, Microsoft, Amazon, Apple or whichever tech giant you buy stuff from, they aren't your family and you most certainly are not part of their gang.",
                              "score": 3,
                              "created_utc": 1737585924.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8n1874",
              "author": "mikezer0",
              "body": "They throttle for performance not obsolescence. Replace the battery the throttling goes away. The two are not the same.  I am still on a 12 Pro with the OG battery. I get over five hours of screen on time. Nothing crazy but I still get through the day. It is a four year old phone. 77 percent battery. I’ve never had an android last anywhere close to that long. And the performance is fine.",
              "score": 4,
              "created_utc": 1737592364.0,
              "replies": []
            },
            {
              "id": "m8opg3r",
              "author": "TwoBionicknees",
              "body": "I don't get it, none of these companies give two shits about you. Fuck spending $1000 on a phone that they'll fuck you on after 2-3 years. Just get a $250-350 phone, you can get some seriously ridiculous cpu performance and a great camera and you can upgrade every couple years, the old phone can be sold if you want or keep as back up.\n\nFar less outlay, far less being ripped off, far less worry if it breaks/gets stolen/whatever. 90% of the cost difference between a $300 phone and a $1000 phone is the brand, 5% is better performance that basically no one at all uses and 5% is marginally nicer UI or one or two features that are very slightly better than other freely/easily available apps.",
              "score": 1,
              "created_utc": 1737615159.0,
              "replies": []
            },
            {
              "id": "m8li3tt",
              "author": "oPFB37WGZ2VNk3Vj",
              "body": "Do you have a link for the Apple claim?",
              "score": 0,
              "created_utc": 1737576359.0,
              "replies": [
                {
                  "id": "m8lt4tu",
                  "author": "Reniconix",
                  "body": "No, but if you Google \"Apple battery throttling\" you'll find it yourself.",
                  "score": 5,
                  "created_utc": 1737579331.0,
                  "replies": [
                    {
                      "id": "m8oofdf",
                      "author": "oPFB37WGZ2VNk3Vj",
                      "body": "That was different, they throttled the CPU to avoid load peaks for batteries below 80% health. These load peaks caused unexpected shutdowns of the phone.",
                      "score": 5,
                      "created_utc": 1737614614.0,
                      "replies": [
                        {
                          "id": "m8p705f",
                          "author": "Reniconix",
                          "body": "They blanket throttled the CPU for all phones, unnecessarily and preemptively, not just ones that had bad battery health. They admitted in the lawsuit they lost to doing that. They tried to spin it like they were doing a good thing, protecting your phone, when in reality they went way beyond what was actually necessary to protect the phone. \n\nCongratulations, their PR team duped you.",
                          "score": 0,
                          "created_utc": 1737625833.0,
                          "replies": [
                            {
                              "id": "m8pkhyh",
                              "author": "anarchyx34",
                              "body": "No they absolutely did not throttle all phones. If you replaced the battery, performance returned  to normal. Their solution (throttling) was correct. Their mistake was not informing the user, and this was before phones reported on their own battery health. This was also almost 10 years ago and those phones are STILL receiving security updates.",
                              "score": 3,
                              "created_utc": 1737633539.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m8mqpob",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1737589068.0,
                      "replies": [
                        {
                          "id": "m8p6hze",
                          "author": "Reniconix",
                          "body": "The one where they admitted to doing it unnecessarily and preemptively to make old phones run like garbage with the express intent to spur users to upgrade, and then tried to spin it like it was a good thing they were doing for you.",
                          "score": 1,
                          "created_utc": 1737625513.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8n3oe7",
              "author": "luluhouse7",
              "body": "This claim always drives me up the wall. The throttling was to prevent spontaneous shutdowns in older batteries. I hold on to my phones forever and it was definitely a problem I experienced prior to the update, especially since I live in a colder climate. It’s possible that Apple took advantage of the problem or that it conveniently pushed people to replace their phones earlier (though battery replacement *will* reset the speed), but the basis for the change is legitimate. I’d rather have my phone be a little slow than crash randomly when I’m in a bind.",
              "score": 2,
              "created_utc": 1737593142.0,
              "replies": []
            },
            {
              "id": "m8n7e0k",
              "author": "lord_mixalot",
              "body": "Apple did the exact opposite. They throttled the phone’s performance in order to maintain the battery life. What they were punished for was not telling people they were doing it. You can argue if what they did was a good thing or not but they definitely didn’t deliberately kill the battery life.",
              "score": 1,
              "created_utc": 1737594310.0,
              "replies": []
            },
            {
              "id": "m8lgwgo",
              "author": "None",
              "body": "[deleted]",
              "score": -3,
              "created_utc": 1737576032.0,
              "replies": [
                {
                  "id": "m8lj105",
                  "author": "maplebutto",
                  "body": "A Lot of them do.",
                  "score": 15,
                  "created_utc": 1737576613.0,
                  "replies": [
                    {
                      "id": "m8lkrq5",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -12,
                      "created_utc": 1737577092.0,
                      "replies": [
                        {
                          "id": "m8lsxgo",
                          "author": "Reniconix",
                          "body": "The NSA, the most secure business on the planet, issues iPhones to their employees.\n\nYou're trying to make a blanket statement of something you clearly know nothing about.",
                          "score": 12,
                          "created_utc": 1737579277.0,
                          "replies": []
                        },
                        {
                          "id": "m8luarv",
                          "author": "AtomicSymphonic_2nd",
                          "body": "Because not every security professional has the spare time to tinker with a custom ROM on an Android phone?\n\nAs far as most professionals can tell, Apple has been making meaningful and verifiable efforts on privacy. To the point that law enforcement struggles with cracking more recent iPhones on the latest versions of iOS.",
                          "score": 5,
                          "created_utc": 1737579641.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8lo27q",
                  "author": "carpathianjumblejack",
                  "body": "Not a very tech person here. Mind explaining me why, please?",
                  "score": 0,
                  "created_utc": 1737577985.0,
                  "replies": [
                    {
                      "id": "m8m1vya",
                      "author": "count023",
                      "body": "iPhones are closed source so you hope on a wind or a prayer that apple catch security holes before you have a data exfiltration by a bad actor. Apples been known to have holes open for years and not bother telling anyone until after data breaches occur\nBecause android is open source and windows is closed (but available to some security vendors in a semi open state) there's a far higher chance of catching holes and nonchance of hiding them.\n\n\nSource: worked for government for a long time, apple devices were prohibited from accessing or storing classified data",
                      "score": 5,
                      "created_utc": 1737581657.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8lx5av",
      "author": "Camdens_protection",
      "body": "Just checked and my pixel 4a last update was August 2023 and there are no available updates. Is this supposed to be all phones?  I am in the UK.",
      "score": 2,
      "created_utc": 1737580403.0,
      "replies": [
        {
          "id": "m8lxvnl",
          "author": "Camdens_protection",
          "body": "Nevermind just seen they are rolling it out, I better find a way to stop it.",
          "score": 3,
          "created_utc": 1737580595.0,
          "replies": [
            {
              "id": "m8m7hm6",
              "author": "daRealDodo",
              "body": "Developer options has a switch to disable automatic updates",
              "score": 7,
              "created_utc": 1737583163.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8niufq",
      "author": "Kazori",
      "body": "Me with my pixel 3a xl Wondering if I'm in danger,my battery is fine.",
      "score": 2,
      "created_utc": 1737597997.0,
      "replies": [
        {
          "id": "m8pcp6u",
          "author": "perverseintellect",
          "body": "It's just the 4a",
          "score": 1,
          "created_utc": 1737629328.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8lyuhd",
      "author": "JZ1011",
      "body": "See, this is why I stop updating my phone after a while. Almost three years later and my Samsung is still trucking along.",
      "score": 5,
      "created_utc": 1737580850.0,
      "replies": []
    },
    {
      "id": "m8nfvx9",
      "author": "Alexis_J_M",
      "body": "I'm starting to develop a policy that hardware should never be upgraded after it is out of warranty.",
      "score": 2,
      "created_utc": 1737597036.0,
      "replies": []
    },
    {
      "id": "m8mcett",
      "author": "1king80",
      "body": "My pixel 8 went from last 16 hours to 8 overnight.",
      "score": 2,
      "created_utc": 1737584600.0,
      "replies": []
    },
    {
      "id": "m8mowao",
      "author": "green_goblins_O-face",
      "body": "Is it me or is the market for Android phones kinda.... dying? Like unless you're buying a pixel, every other manufacturer puts so much bloat on their devices.",
      "score": 2,
      "created_utc": 1737588494.0,
      "replies": []
    },
    {
      "id": "m8o4vtv",
      "author": "patel18252",
      "body": "Wow this is interesting. Mom never had an issue with her 4a, finally out of the blue says the battery dies in a few hours when it used to last over a day...we bought an 8a over the weekend.",
      "score": 1,
      "created_utc": 1737605714.0,
      "replies": []
    },
    {
      "id": "m8okerz",
      "author": "ray12370",
      "body": "I loved my pixel 4 xl. Lasted years before before I dropped it in the Laughlin river. I wish they still made them like they used to.",
      "score": 1,
      "created_utc": 1737612530.0,
      "replies": []
    },
    {
      "id": "m8on2v6",
      "author": "Leviathaneer",
      "body": "Does anyone have experience with their phone updating by itself? I've been getting the notification asking me to update and it states that it's mandatory. I have auto updates turned off, but wondering if it'll just apply on its own overnight or something. I really like this phone so I'm kinda bummed.",
      "score": 1,
      "created_utc": 1737613902.0,
      "replies": []
    },
    {
      "id": "m8oqdxh",
      "author": "WretchedMisteak",
      "body": "My Pixel 6 just recently had an over heating battery issue. Out of nowhere. Battery life was good, phone never felt hot but not long after updating to android 15 it reported an overheating issue and kept shutting down.  It's been off for 2 weeks and still does it.\nBattery isn't swollen either.\n\nDisappointed in Google's quality in the recent couple of years.",
      "score": 1,
      "created_utc": 1737615664.0,
      "replies": []
    },
    {
      "id": "m8otdk0",
      "author": "Guyovader",
      "body": "Is it confirmed it's just the 4? I lost 15% on a 6 more quickly than I ever have noticed before listening to music on Bluetooth today...",
      "score": 1,
      "created_utc": 1737617355.0,
      "replies": []
    },
    {
      "id": "m8ou6pd",
      "author": "jk441",
      "body": "I remember the iPhone battery gate... Wasn't that like 2015? Companies pulling literally 10 yo tactics to force users off of phones that they don't want to support is crazy in 2025",
      "score": 1,
      "created_utc": 1737617831.0,
      "replies": []
    },
    {
      "id": "m8p1k92",
      "author": "Saltmetoast",
      "body": "Another pixel battery shitshow.\nFantastic phones but the battery bullshit from the 3? Was enough to be suspicious.\n\nThis looks like it's become the norm though",
      "score": 1,
      "created_utc": 1737622344.0,
      "replies": []
    },
    {
      "id": "m8p1y6r",
      "author": "Mawootad",
      "body": "Btw, if your battery life drops due to this you can supposedly get either a free battery replacement or at least some token compensation (https://support.google.com/pixelphone/answer/15701861). Dunno how it works or if the compensation is appropriate cause I don't have a 4a and done any more investigation, but that is an option.",
      "score": 1,
      "created_utc": 1737622588.0,
      "replies": []
    },
    {
      "id": "m8poojo",
      "author": "bruh-iunno",
      "body": "I don't *really* see the issue when they're only doing this cause there's an issue with the battery and they're doing a free battery replacement anyway, it's just like a recall on a car. The only issue I have is if you send them your phone with like a broken screen they force you to pay to have the screen fixed too, that's BS",
      "score": 1,
      "created_utc": 1737635475.0,
      "replies": []
    },
    {
      "id": "m8q6lk1",
      "author": "zygabmw",
      "body": "they are learning from appl",
      "score": 1,
      "created_utc": 1737642116.0,
      "replies": []
    },
    {
      "id": "m8rxqq9",
      "author": "helpusdrzaius",
      "body": "I really miss my 4a. I swapped it for a pixel 8a last year because of waning battery life, lasting half a day. The 4a was the better phone because of size, weight, a working fingerprint scanner, and a headphone jack. I don't like the 8a, but not sure I would like any other current budget friendly phone any more.",
      "score": 1,
      "created_utc": 1737659991.0,
      "replies": []
    },
    {
      "id": "m8swqzg",
      "author": "MexGrow",
      "body": "I disabled updated on my Pixel 4A too late, and I ended up with fucking Android 14, which killed performance, battery life and the camera now sucks. At least I'll avoid this last update.",
      "score": 1,
      "created_utc": 1737669533.0,
      "replies": []
    },
    {
      "id": "m8vioya",
      "author": "riazzzz",
      "body": "It sucks truly, and is pretty anti consumer, however how are there so many of you running with a phone without support or software updates for over a year...\n\nI get it up until this patch the 4a was still pretty useable, but without software updates you gotta move on my dudes, this is the device you use to interact with everything (banking, purchases, work etc). \n\nMine has been sat on the shelf since not long after it went EOS incase of emergencies or if I ever get bored and want to play custom roms, was happy to get the $50 cash for something I considered not much better than scrap.",
      "score": 1,
      "created_utc": 1737703794.0,
      "replies": []
    },
    {
      "id": "m8mrqhb",
      "author": "BlueProcess",
      "body": "This type of thing squanders physical resources because those phones are only rarely recycled and usually not that much of them.\n\nIt would be better to just provide free updates for 5 years than charge thereafter.",
      "score": 1,
      "created_utc": 1737589389.0,
      "replies": []
    },
    {
      "id": "m8n40g5",
      "author": "None",
      "body": "Ditched the Pixel and got a OnePlus and it's pretty good.",
      "score": 1,
      "created_utc": 1737593249.0,
      "replies": []
    },
    {
      "id": "m8nmvs4",
      "author": "piscian19",
      "body": "Vey frustrating as its been the best phone I've ever owned. Rock solid great battery life until the update. Of course I had not intention of upgrading. Gonna to go custom image I think until I decide what to get. Won't be another Pixel thats for sure. If a Class action happens I'm definitely in.",
      "score": 1,
      "created_utc": 1737599345.0,
      "replies": []
    },
    {
      "id": "m8nrlkg",
      "author": "Mystica09",
      "body": "Yeeaaah.\nOne of the reasons I ended up hoping out of pixel phones is mostly due to their tendency to abandon their hard/software. \n\nNot directly related to the topic at hand, but I  always side-eye them when it comes to products 😶",
      "score": 1,
      "created_utc": 1737600935.0,
      "replies": []
    },
    {
      "id": "m8nxht9",
      "author": "too_oh_ate",
      "body": "Never buy Google hardware. I learned the hard way on more than one occasion. Made the mistake of giving them the benefit of doubt",
      "score": 1,
      "created_utc": 1737602975.0,
      "replies": []
    },
    {
      "id": "m8mc537",
      "author": "correctingStupid",
      "body": "Google hardware was never good. They marketed it as an apple equivalent and people are all that shit up. From speed to camera they have always been substandard. \n\nMy OnePlus 6 pro is as fast as when I bought it and the battery capacity is at 60% but for OnePlus that's like a full day.",
      "score": 0,
      "created_utc": 1737584518.0,
      "replies": []
    },
    {
      "id": "m8m17m9",
      "author": "samwisestofall",
      "body": "Just bought my wife an iPhone today following this update recently . It just doesn’t function anymore",
      "score": 0,
      "created_utc": 1737581474.0,
      "replies": []
    }
  ]
}