{
  "post": {
    "title": "LG launches community event: Share your OLED setup, get a soundbar",
    "author": "LG_UserHub",
    "id": "1l3q5dc",
    "score": 0,
    "created_utc": 1749097240.0,
    "selftext": "",
    "num_comments": 12,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1l3q5dc/lg_launches_community_event_share_your_oled_setup/"
  },
  "comments": [
    {
      "id": "mw32wpe",
      "author": "Jonsnoosnooze",
      "body": "Sound bars suck.",
      "score": 8,
      "created_utc": 1749100456.0,
      "replies": [
        {
          "id": "mwjrh1e",
          "author": "CumAssault",
          "body": "Statements like this are trash. Soundbars are great for 95% of people. No real wires or mess, way more accessible than custom surround sound setups, and 1000x better than TV speakers",
          "score": 7,
          "created_utc": 1749328956.0,
          "replies": [
            {
              "id": "mxx8eco",
              "author": "Useuless",
              "body": "I actually prefer my TV's integrated speakers over a $1000 msrp sound bar that I tried simply due to the fact that it is closer to my ears. \n\nWith the sound bar I tried, it was so obvious that everything was below my head and ready from a very tiny spot. It was driving me insane.\n\nSure, my TV speakers don't have as nice drivers or the level of power, but try to give an open sound, even if it has limitations.",
              "score": 1,
              "created_utc": 1750001509.0,
              "replies": [
                {
                  "id": "mxxbkra",
                  "author": "CumAssault",
                  "body": "On most modern TVs the speakers are on the rear of the TV and actually bounce off of the wall. Which might be why you perceive it as wide and open sound. TV speakers have gotten better but a good soundbar should still blow it out of the water",
                  "score": 1,
                  "created_utc": 1750002505.0,
                  "replies": [
                    {
                      "id": "mxxpzqz",
                      "author": "Useuless",
                      "body": "I'm aware of this. But it contradicted the expected logic. And honestly, I only have LG which makes it stranger. Sony and Samsung have better technologies like Acoustic Surface or Object Tracking.\n\nIt was  a Samsung Q900C if you're interested. It was a horrible product TBH. So sharp, sibilant, limited EQ ability, bass felt disconnected ,and the \"calibration\" literally did nothing. And add on top of all that, it sounded like it was coming from a tiny box under the TV.",
                      "score": 1,
                      "created_utc": 1750006977.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mwl08lb",
              "author": "Jonsnoosnooze",
              "body": "Dumb mindset like this one is the reason soundbars exist. They still suck.",
              "score": 1,
              "created_utc": 1749345034.0,
              "replies": [
                {
                  "id": "mx1ylre",
                  "author": "zffjk",
                  "body": "I can imagine someone this invested in how other people listen to stuff without being a troll.",
                  "score": 6,
                  "created_utc": 1749577316.0,
                  "replies": []
                },
                {
                  "id": "mwnz3d3",
                  "author": "kiltedsteve",
                  "body": "They might not be the best option for *you*, but they work amazingly well for a lot of us. Don’t use a blanket statement with nothing to back it up.",
                  "score": 3,
                  "created_utc": 1749394666.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mw5m93v",
          "author": "GrayDaysGoAway",
          "body": "Hell no they don't. Sound bars are fucking awesome for those of us who want better sound than the TV speakers but don't have room for a surround setup.",
          "score": 3,
          "created_utc": 1749139353.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw2wteb",
      "author": "internetlad",
      "body": "I already have an LG soundbar but no OLED. How do I make this work for me?",
      "score": 3,
      "created_utc": 1749097557.0,
      "replies": []
    },
    {
      "id": "mwh0evg",
      "author": "emiliabow",
      "body": "I mean the important detail here is that it is not any OLED setup, only LG OLED G5/C5",
      "score": 2,
      "created_utc": 1749294809.0,
      "replies": []
    },
    {
      "id": "mw3d2wr",
      "author": "FrozenToonies",
      "body": "I’ve set up a few 88-98” LG OLED’s for professional/commercial installs, but I can’t share due to NDA’s. \nThe issue is that OLED displays are 95%+? for consumer markets.  I’ve yet to install a large commercial grade OLED in a professional visual FX studio for example.",
      "score": 0,
      "created_utc": 1749105855.0,
      "replies": []
    }
  ]
}