{
  "post": {
    "title": "This new Steam Controller 2 picture leak suggests Valve is making big changes | SteamVR data mining strikes gold, with this leak showing a low resolution thumbnail render of the new Valve PC controller for gaming.",
    "author": "chrisdh79",
    "id": "1h12vzt",
    "score": 337,
    "created_utc": 1732709561.0,
    "selftext": "",
    "num_comments": 46,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1h12vzt/this_new_steam_controller_2_picture_leak_suggests/"
  },
  "comments": [
    {
      "id": "lz8joe5",
      "author": "TheyCallMeMrMaybe",
      "body": "Why does this remind me of the OG Xbox's Duke controller?",
      "score": 21,
      "created_utc": 1732713198.0,
      "replies": [
        {
          "id": "lzpt268",
          "author": "_RADIANTSUN_",
          "body": "Cuz the grips don't stick out as much vs the middle of the body compared to most other controllers.",
          "score": 1,
          "created_utc": 1732977243.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lz8ln9z",
      "author": "lesmiserablesss",
      "body": "The large TouchPad on right side of the OG Steam Controller is the biggest reason I use it. I love using it for aiming in games. I cannot utilize the TouchPad on the steam deck due to how small and low it is on the device. They should've kept at least one big circle pad.",
      "score": 70,
      "created_utc": 1732714010.0,
      "replies": [
        {
          "id": "lz9w3by",
          "author": "parisidiot",
          "body": "but it looks like it has two giant touch pads right in reach of your thumbs?",
          "score": 17,
          "created_utc": 1732729479.0,
          "replies": [
            {
              "id": "lz9zt2m",
              "author": "lesmiserablesss",
              "body": "The og controller has a large concave circle and you can't get that same design with a joystick in that space",
              "score": 9,
              "created_utc": 1732730616.0,
              "replies": [
                {
                  "id": "lzptdpw",
                  "author": "_RADIANTSUN_",
                  "body": "IMO both analogue sticks were perfectly fine being replaced with the trackpads, the trackpads were a straight upgrade to analogues and the haptics etc made it AMAZING. The main mistake they made was adding a left analogue stick rather than a DPAD.",
                  "score": 2,
                  "created_utc": 1732977374.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lza5kgg",
          "author": "MCA2142",
          "body": "Right touch pad + Gyro aim activation on Left trigger is amazing for FPS games.",
          "score": 7,
          "created_utc": 1732732393.0,
          "replies": []
        },
        {
          "id": "lzc2pz3",
          "author": "chr0nicpirate",
          "body": "I honestly really like the steam controller other than the fact it only has one joystick. I got one when it was on clearance for like $5 couple years back. If they had just given it dual sticks and kept one of the touch pads in a normal d-pad it would have been an s Plus tier controller with all of its features. The only including one joystick was just so insanely stupid and probably saved them like $0.50 per unit in manufacturer costs. It basically made it doomed to fail.",
          "score": 3,
          "created_utc": 1732755612.0,
          "replies": [
            {
              "id": "lzcwroo",
              "author": "adubsix3",
              "body": "Yeah for real. Keep the og layout, add like a micro right joystick. Like a switch or PSP joystick",
              "score": 1,
              "created_utc": 1732767730.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lz9wlcs",
          "author": "None",
          "body": "can you sync the steam controller to the deck via bluetooth?\n\ni dont have a deck on the controller, and im curious",
          "score": 2,
          "created_utc": 1732729634.0,
          "replies": [
            {
              "id": "lza0bor",
              "author": "lesmiserablesss",
              "body": "Yes it does",
              "score": 2,
              "created_utc": 1732730775.0,
              "replies": [
                {
                  "id": "lzakfe1",
                  "author": "None",
                  "body": "seems crappy to carry both but seems like a acceptable compromise",
                  "score": 1,
                  "created_utc": 1732737020.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lzawthp",
          "author": "GimpyGeek",
          "body": "I'm also curious about the odd angulation on the touch pads as well. Makes me wonder how that's going to work for keeping things 'straight' or using things like the old ipod clickwheel style scroll thing albeit that probably isn't gonna feel good in a square format so much anyway.",
          "score": 1,
          "created_utc": 1732740943.0,
          "replies": []
        },
        {
          "id": "lzf7fn6",
          "author": "that_toof",
          "body": "We still use ours for web browsing, scrolling on that thing was so nice.",
          "score": 1,
          "created_utc": 1732809665.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lz8t30d",
      "author": "Hamuelin",
      "body": "Big if true. \n\nA lot of us wanted both two sticks and trackpads like the deck has.",
      "score": 22,
      "created_utc": 1732716874.0,
      "replies": []
    },
    {
      "id": "lzbexq7",
      "author": "baltimoresports",
      "body": "Calling it now. Steam OS 3.0 general release at the same time as the controller release.",
      "score": 4,
      "created_utc": 1732746746.0,
      "replies": [
        {
          "id": "lzetbek",
          "author": "Skcuszeps",
          "body": "I've not followed anything with versioning, is anything big expected with 3.0? Support for general installation on other hardware?",
          "score": 2,
          "created_utc": 1732804717.0,
          "replies": [
            {
              "id": "lzex05k",
              "author": "baltimoresports",
              "body": "Basically SteamDeck OS for a general release. Still some issues with NVIDIA, but it’s been solid on AMD with some of the clone distros like Bazzite.",
              "score": 2,
              "created_utc": 1732806075.0,
              "replies": [
                {
                  "id": "lzh4wln",
                  "author": "Skcuszeps",
                  "body": "I'm rocking Bazzite on my laptop and ally X and it's been solid. Will be cool to try out steamOS",
                  "score": 2,
                  "created_utc": 1732833212.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m17j5tw",
          "author": "cgaWolf",
          "body": ">Steam OS 3\n\nThis breaks my brain. I thought Valve didn't do 3s?",
          "score": 1,
          "created_utc": 1733759811.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lz8kdcu",
      "author": "Senior1292",
      "body": "This isn't really a PC Controller for gaming, more of a controller for the Deck when it's docked. Because it departs so much from the original, it's not really a Steam Controller 2, but a Steam Deck Controller.",
      "score": 20,
      "created_utc": 1732713491.0,
      "replies": [
        {
          "id": "lz8ky61",
          "author": "nmarf16",
          "body": "Imo if the touch pads are anything like the steam deck touchpad and if it has good gyro, I absolutely could see this for PC since it’d be appealing to controller users who want to switch to PC. It’d make FPS games easier and more playable, and a ton of other games like RTS games that aren’t competitive could be playable.",
          "score": 27,
          "created_utc": 1732713730.0,
          "replies": [
            {
              "id": "lz8mehu",
              "author": "Senior1292",
              "body": "I don't mean that it wouldn't be used for PC, I mean more like the primary intention is for it to be used as controller for the Steam Deck when it's docked. If it was designed for PC first, then it would have been closer to the Steam Controller design with two large trackpads as the primary input method.\n\nI just can't see the A/B/X/Y buttons, bumpers and triggers being ergonomically nice to use with the trackpads due to their positioning and joysticks are inferior to the trackpads of the Steam Controller.",
              "score": -6,
              "created_utc": 1732714308.0,
              "replies": [
                {
                  "id": "lz9lc7j",
                  "author": "nmarf16",
                  "body": "I mean the games you’d want a controller like this for steam deck were likely built for PC so I don’t see why the design would differ much. If you’ve used the steam deck track pad, it’s clear it’s meant to replicate what you’d want a mouse to do within the confines of a less than ideal setting (thumb on trackpad vs mouse is an obstacle for designers).",
                  "score": 8,
                  "created_utc": 1732726155.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lz986or",
          "author": "Skcuszeps",
          "body": "No, it's definitely a PC **STEAM** controller. The deck has no special functionality other than hardware. Steam does. \n\nIt turns any PC into a Deck. Want to couch play a mouse heavy game on your PC using a controller? Now you can\n\nWant touchpad macro / wheel menus on your PC with a controller? Now you can\n\n Valve is thinking much broader, It's not to \"control the steam deck\". It's to turn every competitors hardware into a steam deck since it brings deck functionality to every PC. It could normalize touchpads as a controller input.",
          "score": 10,
          "created_utc": 1732722047.0,
          "replies": [
            {
              "id": "lz9mqln",
              "author": "Senior1292",
              "body": "I feel like you've entirely missed the point I'm making. Hopefully, I can clarify.\n\n>Want to couch play a mouse heavy game on your PC using a controller? Now you can\n\n>Want touchpad macro / wheel menus on your PC with a controller? Now you can\n\nI've been doing this for nearly a decade with the original Steam Controller. \n\nIf they were making the \"Steam Controller 2\" then it would be an iteration of the Steam Controller. For example, largely the same form factor, 4 buttons on the back, higher refresh rate gyro, higher quality finish etc. \n\nBased on the 3D model from the Steam VR Files, Valve had basically taken the Steam Deck and removed the screen. I imagine a fairly large percentage of the people who buy this will already have a Steam Deck and will use it as their controller for when it's docked or they don't want to hold it as its fairly weighty, as it should have the exact same inputs in pretty much the same place.\n\nInstead of being the \"Steam Controller 2.0\" I see it as the \"Steam Deck Controller 1.0\", that can obviously also be used on PCs, but I feel that the main target audience and reason it's been made is because of the Steam Deck.",
              "score": -2,
              "created_utc": 1732726588.0,
              "replies": [
                {
                  "id": "lz9qhk9",
                  "author": "Skcuszeps",
                  "body": "You're pretty hung up on the name when all we know is it's project name and it's coined the \"steam controller 2\" by people talking about it.\n\nValve does not release hardware (hell, even software) without a \"were trying to advance technology\" reason.\n\nVR headset released forced other companies to do so.\n\nSteam boxes and steam controllers were test platforms that lead to the deck and other console like PCs\n\nThey are not releasing this to simply be a \"controller designed for the deck that can be used for PC\".\n\nThis is to advance something. Like turning all hardware into a steam deck with radial menus and easy mouse control. Or to normalize touchpads on a controller with use of steam input or devs can natively support it now.\n\nThink bigger.",
                  "score": 3,
                  "created_utc": 1732727750.0,
                  "replies": [
                    {
                      "id": "lz9w393",
                      "author": "Senior1292",
                      "body": "We're not seeing eye to eye here, so I'm going to leave it after this comment. Ignore the name, my original point was that this controller looks like it's going to be closer to the Steam Desk than Steam Controller and so I feel that even though this will be called the Steam Controller (because if Valve called it a Steam Deck Controller, people would assume you can only use it for the Steam Deck), it isn't really what I've been hoping they'd make for the last 6 or 7 years.\n\n>Valve does not release hardware (hell, even software) without a \"were trying to advance technology\" reason.\n\nI honestly think in this case, it's as simple as: They saw how successful the Deck and the demand for a controller with the same controls was too, they said they wanted to make a dedicated controller for it, so they have done. The rest of what you said, I think is over thinking it.",
                      "score": -3,
                      "created_utc": 1732729479.0,
                      "replies": [
                        {
                          "id": "lzcour6",
                          "author": "SiccmaDE7930",
                          "body": "Just because it isnt exactly what you specifically wanted it to be, doesnt mean it isnt what it is.....",
                          "score": 1,
                          "created_utc": 1732764298.0,
                          "replies": []
                        },
                        {
                          "id": "lzeqwcr",
                          "author": "Skcuszeps",
                          "body": ">it's going to be closer to the Steam Desk than Steam Controller and so I feel that even though this will be called the Steam Controller (because if Valve called it a Steam Deck Controller, people would assume you can only use it for the Steam Deck), it isn't really what I've been hoping they'd make for the last 6 or 7 years\n\nSo there's the real issue. It's not what *you* wanted. That doesn't validate anything you've said.",
                          "score": 0,
                          "created_utc": 1732803781.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lzbcdrc",
          "author": "cjngo1",
          "body": "Wdym? The steamdeck controller works fine on windows, I have installed it and tried it, would love to have that on my actual pc",
          "score": 2,
          "created_utc": 1732745883.0,
          "replies": []
        },
        {
          "id": "lzbv5aq",
          "author": "fixminer",
          "body": "But the Steam Deck's library consist entirely of PC games. Why would it matter if it's connected to a Deck or a PC? If it works well for one, it works well for the other.",
          "score": 1,
          "created_utc": 1732752726.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lz8yyrl",
      "author": "BeamImpact",
      "body": "That looks like I could accidentally hit those touchpads when using the sticks. The touchpad location also doesn't look ideal, or let's say comfortable.",
      "score": 4,
      "created_utc": 1732718977.0,
      "replies": [
        {
          "id": "lz9w03t",
          "author": "Moskeeto93",
          "body": "Input to the touchpads on the Deck are disabled when the joysticks are being touched/moved.",
          "score": 5,
          "created_utc": 1732729452.0,
          "replies": [
            {
              "id": "lzaxmc6",
              "author": "GimpyGeek",
              "body": "As someone that doesn't have a deck that's an interesting thing to clarify. I was thinking the same thing Beam was, that is good to hear though as that placement does seem a bit suspect",
              "score": 2,
              "created_utc": 1732741195.0,
              "replies": []
            },
            {
              "id": "lzbbype",
              "author": "LevianMcBirdo",
              "body": "A small addition: when the \"corresponding\" joystick is being used",
              "score": 2,
              "created_utc": 1732745743.0,
              "replies": []
            },
            {
              "id": "lzc03f7",
              "author": "8bit-wizard",
              "body": "This depends on the game. If your control profile is jumping back and forth between emulating controller inputs and mouse/keyboard inputs, this will naturally happen. Most games don't accept input from both sources at once. Some don't let you swap back and forth between the two at all.",
              "score": 1,
              "created_utc": 1732754603.0,
              "replies": [
                {
                  "id": "lzc0edl",
                  "author": "Moskeeto93",
                  "body": "This has nothing to do with the games. It's hardcoded into the firmware itself. If you touch the right stick, the right trackpad is completely disabled. This was actually an issue for me when trying to create a custom tate mode profile through Steam Input.",
                  "score": 1,
                  "created_utc": 1732754718.0,
                  "replies": [
                    {
                      "id": "lzc20i8",
                      "author": "8bit-wizard",
                      "body": "Huh. That seems like an oversight on Valve's part. I guess I've never needed a profile that necessitated both of them at once.",
                      "score": 1,
                      "created_utc": 1732755338.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lzbhsvk",
      "author": "Flecca",
      "body": "Oh boy. Well I guess it doesn't have to be pretty to be great; nothing does, now that I think about it.",
      "score": 1,
      "created_utc": 1732747739.0,
      "replies": []
    },
    {
      "id": "lzfhnux",
      "author": "SirBreazy",
      "body": "Doesn’t look ergonomic for analog stick users",
      "score": 1,
      "created_utc": 1732813018.0,
      "replies": []
    },
    {
      "id": "lzbaf62",
      "author": "SpookOpsTheLine",
      "body": "Looks a bit unwieldy. I wanted to be a fan of the OG steam controller but tbh it was a jack of all trades and bad at all of them, you’re way better off just using a regular controller or mouse and keyboard, unless you play gameswith no controller support like Civ or smth",
      "score": 0,
      "created_utc": 1732745230.0,
      "replies": []
    },
    {
      "id": "lzaq5jy",
      "author": "raymondcy",
      "body": "If it doesn't have paddles on the bottom of the controller like the Xbox Elite then it can go directly to the hall of shame.",
      "score": -1,
      "created_utc": 1732738838.0,
      "replies": [
        {
          "id": "lzbc3ws",
          "author": "LevianMcBirdo",
          "body": "It will. The first one had two and the steam deck even 4, doubt they'll drop that.",
          "score": 7,
          "created_utc": 1732745791.0,
          "replies": [
            {
              "id": "lzbci97",
              "author": "raymondcy",
              "body": "My apologies then. I did not know that. Thank you for the correction.",
              "score": 2,
              "created_utc": 1732745923.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}