{
  "post": {
    "title": "AMD Ryzen 7 9800X3D buyers beware, as gaming CPU is at center of another scam | A new fake CPU scam has popped up online, as a purported Ryzen 7 9800X3D gaming CPU turns out to be a Ryzen 7000-series chip in disguise.",
    "author": "a_Ninja_b0y",
    "id": "1i6lboy",
    "score": 644,
    "created_utc": 1737473865.0,
    "selftext": "",
    "num_comments": 46,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i6lboy/amd_ryzen_7_9800x3d_buyers_beware_as_gaming_cpu/"
  },
  "comments": [
    {
      "id": "m8d4h4k",
      "author": "karatekid430",
      "body": "Don't buy from scalpers. Simples.",
      "score": 250,
      "created_utc": 1737474455.0,
      "replies": [
        {
          "id": "m8dhrv0",
          "author": "TheCuriousGamer",
          "body": "It's not that simple, scammers are now buying an item, taking it out and resealing it with something else of approximate weight inside. Then it gets returned as an unwanted purchase and because its still sealed it goes straight back into inventory.  \nStores don't have any clue it's been opened and the only way to tell for certain is to open it.  \nI've heard of books, bricks, plaster casts of phones and even pies being put back into boxes for someone else to find up to months down the line.",
          "score": 61,
          "created_utc": 1737478195.0,
          "replies": [
            {
              "id": "m8dmqz7",
              "author": "gSh3p",
              "body": "Receiving a different product due to a refund scam is a different topic than a weaker CPU being modified to, at first glance, resemble a stronger CPU - which is the case here.\n\nIn case of refund scams, you can contact the store. In case of this scam, some users might never notice.",
              "score": 53,
              "created_utc": 1737479570.0,
              "replies": [
                {
                  "id": "m8hwyuh",
                  "author": "SillySin",
                  "body": "how do these users might never notice? if you buying high end, we do inspsc a loooooot",
                  "score": 1,
                  "created_utc": 1737528420.0,
                  "replies": [
                    {
                      "id": "m8j08f4",
                      "author": "cafk",
                      "body": "Hey my favourite grandson kevin, enjoy this nice cpu thingy that you requested, which we found on sale someplace called temu - grandma and grandpa.  \nWe'll have Uncle Jackie install it for you. \n  \nWhere all 4 participants are usually not aware - as long as it boots, it works and the packaging surely doesn't lie?!",
                      "score": 7,
                      "created_utc": 1737550270.0,
                      "replies": [
                        {
                          "id": "m8j4wky",
                          "author": "SillySin",
                          "body": "uncle Jackie should know better, by that I mean we all like to look at the model number  etc",
                          "score": 0,
                          "created_utc": 1737552083.0,
                          "replies": [
                            {
                              "id": "m8j704w",
                              "author": "cafk",
                              "body": "And hence it's a scam, as many consumers don't check more than the paper (box & invoice) - especially now as the BIOS/UEFI  doesn't show the CPU or memory information and just directly a loading wheel for the os or jumps to a bootloader.  \n  \nAnd an associated article highlighting the scam possibilities to make theoretical uncle Jackies aware.  \n  \nIt's like CS majors being asked to fix the family printer during holidays.",
                              "score": 3,
                              "created_utc": 1737552851.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8dp4rv",
                  "author": "TheCuriousGamer",
                  "body": "Not really, you buy a 9800X3D and return it with the modified CPU inside.  \nIt was also done a few months ago with a completely fake CPU, just a heatsink and SMD caps on top of a blank PCB with contacts on the bottom.",
                  "score": -19,
                  "created_utc": 1737480226.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8heryf",
              "author": "DinoHunter064",
              "body": "This happened to me with my COU cooler. I ordered a Phantom Spirit 120 SE. Opened the Amazon box and the outer packaging seemed correct, but was taped up weirdly. Opened that and was greeted with an unopened \"Dr Nose Best Nose Bot Nasal Aspirator.\"\n\nWhat's especially frustrating is that they clearly shipped a used item to me when I purchased a new item. That shouldn't have happened in the first place.",
              "score": 4,
              "created_utc": 1737520085.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8djk0p",
      "author": "meunbear",
      "body": "I’m so glad I have a Microcenter in town. I don’t think I’d want to move somewhere without one. So much easier dealing with problems in person than with an online retailer. Jumping through hoops to talk to someone on Amazon sucks.",
      "score": 61,
      "created_utc": 1737478682.0,
      "replies": [
        {
          "id": "m8ex9ao",
          "author": "OneIShot",
          "body": "Same. They had a ton of 9800X3Ds in stock too over the past week and easily picked one up. Cancelled my Amazon order right after hearing about all this lol.",
          "score": 16,
          "created_utc": 1737492249.0,
          "replies": [
            {
              "id": "m8i7whi",
              "author": "Firesoldier987",
              "body": "Same!",
              "score": 1,
              "created_utc": 1737534668.0,
              "replies": []
            },
            {
              "id": "m8hlnc6",
              "author": "mrmunches",
              "body": "Why not get it and see? They have a 30-day return policy that’s basically no questions asked as long as buy directly from Amazon.",
              "score": -2,
              "created_utc": 1737522921.0,
              "replies": [
                {
                  "id": "m8iz2qz",
                  "author": "OneIShot",
                  "body": "Well I could get it right away at MC or wait another week or so for Amazon. 5% instant back from MC with their card is nice too opposed to 5% Amazon points.",
                  "score": 2,
                  "created_utc": 1737549798.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8eayep",
          "author": "CO_PC_Parts",
          "body": "I had a pleasant surprise from them on Saturday. I stopped in for my 12700k combo and they gave me the i9 12900k.  I ended up telling them because god damn that i9 draws way too much power and was scared the z790 cheap board might have issues.",
          "score": 7,
          "created_utc": 1737486160.0,
          "replies": []
        },
        {
          "id": "m8ff2x9",
          "author": "Jepp_Gogi",
          "body": "That's like the one specific thing I dislike about my most recent move. I'm so far, and the sim racing community is getting banger deals. Rest in peace Fry's as well, though they started making more and more room for washing machines and shit before the end.",
          "score": 2,
          "created_utc": 1737497049.0,
          "replies": []
        },
        {
          "id": "m8peclb",
          "author": "Proud_Tie",
          "body": "I'm driving 3 hours each way to get to a microcenter for my next builds, plus their cpu combo prices are amazing.",
          "score": 1,
          "created_utc": 1737630279.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8d99zx",
      "author": "cantgetthistowork",
      "body": "Amazon mixes inventory from all sellers in the same bin",
      "score": 49,
      "created_utc": 1737475825.0,
      "replies": [
        {
          "id": "m8da8hi",
          "author": "whatlineisitanyway",
          "body": "They really need to stop doing this. If it can't be confirmed as genuine it goes in a different bin and gets a different listing.",
          "score": 34,
          "created_utc": 1737476100.0,
          "replies": [
            {
              "id": "m8e8bbf",
              "author": "thedoc90",
              "body": "As someone who just got scammed on a gpu this so bad. They even had the gall to tell me I dhould have done research on the seller.",
              "score": 9,
              "created_utc": 1737485445.0,
              "replies": [
                {
                  "id": "m8hltzs",
                  "author": "mrmunches",
                  "body": "It says on the listing that third-party seller refunds aren’t guaranteed and not even Amazon.com’s responsibility. Sheesh",
                  "score": -4,
                  "created_utc": 1737523003.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8gp9p0",
          "author": "Sandtiger812",
          "body": "No they don't, I really wish this false narrative would stop. If they do get put into the same bin the items have an LPN label that links directly back to the seller. ",
          "score": 2,
          "created_utc": 1737511243.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8dg14t",
      "author": "gg06civicsi",
      "body": "Will CPU-Z catch this? Or do I need to benchmark",
      "score": 10,
      "created_utc": 1737477718.0,
      "replies": [
        {
          "id": "m8dglei",
          "author": "Starfox-sf",
          "body": "Yes",
          "score": 15,
          "created_utc": 1737477872.0,
          "replies": []
        },
        {
          "id": "m8dgnfa",
          "author": "TheCuriousGamer",
          "body": "Yes but your BIOS/POST screen will tell you get that far.",
          "score": -5,
          "created_utc": 1737477888.0,
          "replies": [
            {
              "id": "m8ekijm",
              "author": "gravity_bomb",
              "body": "Not if it’s not actually a cpu and just smd’s on a board. You need ram and a bootable cpu to get to bios.",
              "score": 0,
              "created_utc": 1737488764.0,
              "replies": [
                {
                  "id": "m8elnq8",
                  "author": "jello1388",
                  "body": "You won't get to CPU-Z without those things either, and that's a different scam than swapping a different CPU all together.",
                  "score": 5,
                  "created_utc": 1737489077.0,
                  "replies": []
                },
                {
                  "id": "m8elz2n",
                  "author": "TheCuriousGamer",
                  "body": "If it's not a CPU your computer will still error, it might not be anything that appears on your monitor but POST codes on LED displays or beep codes will indicate CPU error.",
                  "score": 2,
                  "created_utc": 1737489163.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8ek5cj",
      "author": "DoorFacethe3rd",
      "body": "That begs the question… “*what’arya buyin?*”",
      "score": 2,
      "created_utc": 1737488664.0,
      "replies": [
        {
          "id": "m8gprhm",
          "author": "adizzlex",
          "body": "Follow up: “what’arya sellin’?”",
          "score": 5,
          "created_utc": 1737511404.0,
          "replies": [
            {
              "id": "m8i9uv0",
              "author": "DoorFacethe3rd",
              "body": "“How have we procured these curiosities? Heh heh heh, you don’t wanna know mate.”",
              "score": 2,
              "created_utc": 1737535874.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8f91qr",
      "author": "princecamaro28",
      "body": "Ah fuck, my 9800X3D just got delivered a couple days ago, 2 months earlier than Amazon initially told me, what are my odds of it being fake?",
      "score": 1,
      "created_utc": 1737495420.0,
      "replies": [
        {
          "id": "m8ffiky",
          "author": "Jepp_Gogi",
          "body": "2 million percent. I've never been wrong. But yea, probably run cpu-z or benchmark it in some fashion before too long",
          "score": 8,
          "created_utc": 1737497169.0,
          "replies": [
            {
              "id": "m8fkeew",
              "author": "princecamaro28",
              "body": "Well, the box wasn't shrink-wrapped but did have the AMD sealing tape on it and it didn't look like it was removed at all, and the CPU itself seems properly embossed, but I guess I won't know for sure until I start the build",
              "score": 2,
              "created_utc": 1737498553.0,
              "replies": [
                {
                  "id": "m8frrb0",
                  "author": "The_Martian_King",
                  "body": "You're fine, don't worry about it",
                  "score": 6,
                  "created_utc": 1737500723.0,
                  "replies": []
                },
                {
                  "id": "m8g3hn2",
                  "author": "Nagemasu",
                  "body": "I'd be getting that build done asap just to check. I'd be concerned that the longer I wait the harder it is to dispute. Hell, take it to a friends house or local shop and see if they can verify it if you're not going to be able to complete the build any time soon.",
                  "score": 1,
                  "created_utc": 1737504406.0,
                  "replies": [
                    {
                      "id": "m8gvlzj",
                      "author": "princecamaro28",
                      "body": "I placed the order for the rest of the parts earlier, I'll be building it this weekend so it should be fine",
                      "score": 1,
                      "created_utc": 1737513323.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8g22qc",
      "author": "BennieOkill360",
      "body": "Glad I have my build already. This stuff together with the 50th GPUs are gonna get scalped to oblivion",
      "score": 1,
      "created_utc": 1737503948.0,
      "replies": []
    },
    {
      "id": "m8g393j",
      "author": "RateMyKittyPants",
      "body": "I got my Ryben 9800 3xD from Temu. On sale too!",
      "score": 1,
      "created_utc": 1737504329.0,
      "replies": []
    },
    {
      "id": "m8hxkam",
      "author": "RunAndGuun",
      "body": "I got a 9800x3d + cpu cooler bundle from Newegg. I should be good right? Ordered it Sunday and it gets here Friday.",
      "score": 1,
      "created_utc": 1737528734.0,
      "replies": [
        {
          "id": "m8naqgy",
          "author": "BenefitOfTheDoubt_01",
          "body": "Many of the marketplace driven websites that source products from other vendors are susceptible to scammed products. \n\nMost of these websites have a sold/shipped by \"company name\" to verify the product is being sold from them and is therefore more reputable, as opposed to the company simply acting as the intermediary for another company and collecting a transition fee.\n\nTo be specific, Newegg has a slider/button to only show products sold by Newegg. \n\nAs you've already purchased your CPU, you should be able to check your order history to verify who sold you the bundle. \n\nOf course, if the processor is already installed you can check the BIOS or use software like HWinfo to verify the cpu model. \n\nI hope this helps.",
          "score": 2,
          "created_utc": 1737595380.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8jgr6k",
      "author": "Tovar42",
      "body": "Dont use the RE:4 merchant to represent a scammer, I would trust that guy with my life",
      "score": 1,
      "created_utc": 1737556161.0,
      "replies": []
    },
    {
      "id": "m945opj",
      "author": "VirulentStrand",
      "body": "Don't buy from scammers, match model and serial numbers, download and check CPU-Z. Got it.",
      "score": 1,
      "created_utc": 1737823843.0,
      "replies": []
    }
  ]
}