{
  "post": {
    "title": "Panasonic S1 II review: A near-perfect creator's camera if money is no object",
    "author": "dapperlemon",
    "id": "1lspuc2",
    "score": 377,
    "created_utc": 1751766662.0,
    "selftext": "",
    "num_comments": 81,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lspuc2/panasonic_s1_ii_review_a_nearperfect_creators/"
  },
  "comments": [
    {
      "id": "n1kjdfv",
      "author": "intellidumb",
      "body": "$3,200",
      "score": 160,
      "created_utc": 1751768123.0,
      "replies": [
        {
          "id": "n1krz22",
          "author": "TryingT0Wr1t3",
          "body": "The Nikon competition is at $2,199 in Nikon's website.",
          "score": 53,
          "created_utc": 1751771769.0,
          "replies": [
            {
              "id": "n1l1h5b",
              "author": "PianoTrumpetMax",
              "body": "But how do they compare?",
              "score": 10,
              "created_utc": 1751776107.0,
              "replies": [
                {
                  "id": "n1lkhct",
                  "author": "manic_andthe_apostle",
                  "body": "It competes.",
                  "score": 16,
                  "created_utc": 1751786389.0,
                  "replies": []
                },
                {
                  "id": "n1mls8b",
                  "author": "TryingT0Wr1t3",
                  "body": "It has pretty much the same features\n\nhttps://imaging.nikon.com/imaging/lineup/mirrorless/z6_3/",
                  "score": 8,
                  "created_utc": 1751806576.0,
                  "replies": []
                },
                {
                  "id": "n1m7r77",
                  "author": "findingbezu",
                  "body": "you look at what one camera can do and then what the other camera can do and… the ponder, some might say ruminate, on the differences.",
                  "score": 6,
                  "created_utc": 1751800172.0,
                  "replies": []
                },
                {
                  "id": "n1orvqw",
                  "author": "speculatrix",
                  "body": "https://www.dpreview.com/products/compare/side-by-side?products=nikon_z6iii&products=panasonic_dcs1ii\n\nBe warned, dpreview often has errors and omissions",
                  "score": 2,
                  "created_utc": 1751831264.0,
                  "replies": []
                },
                {
                  "id": "n1pvj1i",
                  "author": "Eruionmel",
                  "body": "As a professional photographer, there's not a chance in hell I would ever buy a Panasonic over a Nikon, even if the Panasonic's stats were better.",
                  "score": 0,
                  "created_utc": 1751844229.0,
                  "replies": [
                    {
                      "id": "n1qv8dv",
                      "author": "FlarblesGarbles",
                      "body": "What a weird comment. Fanboy much?",
                      "score": -2,
                      "created_utc": 1751857496.0,
                      "replies": [
                        {
                          "id": "n1r80bq",
                          "author": "Eruionmel",
                          "body": "Nah. I'd do the same with a Canon. I just have 0 trust in Panasonic.",
                          "score": 2,
                          "created_utc": 1751863113.0,
                          "replies": [
                            {
                              "id": "n1t1wpd",
                              "author": "FlarblesGarbles",
                              "body": "K",
                              "score": -3,
                              "created_utc": 1751895991.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "n1v0q2h",
                          "author": "ObviouslyTriggered",
                          "body": "Panasonic has a history of abandoning entire photography lines not to mention that the ecosystem of both lenses and 1st and 3rd party accessories for Panasonic cameras is significantly weaker.",
                          "score": 1,
                          "created_utc": 1751917470.0,
                          "replies": [
                            {
                              "id": "n1v3jrw",
                              "author": "FlarblesGarbles",
                              "body": "Does it really? The L-mount alliance seems pretty fleshed out to me. What line have they abandoned?",
                              "score": 0,
                              "created_utc": 1751918398.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n1qk4wn",
          "author": "proscriptus",
          "body": "That's not even a mid-priced pro camera",
          "score": 3,
          "created_utc": 1751853200.0,
          "replies": []
        },
        {
          "id": "n1qpowz",
          "author": "Shikatanai",
          "body": "Thank you",
          "score": 1,
          "created_utc": 1751855296.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n1klxzw",
      "author": "ThatBadFeel",
      "body": "That’s a big if!",
      "score": 22,
      "created_utc": 1751769189.0,
      "replies": []
    },
    {
      "id": "n1knkwy",
      "author": "skarbles",
      "body": "Money is always the issue with creatives",
      "score": 52,
      "created_utc": 1751769874.0,
      "replies": [
        {
          "id": "n1kzbbd",
          "author": "Trev0matic",
          "body": "Always. Passion’s cheap, rent isn’t.",
          "score": 18,
          "created_utc": 1751775081.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n1kw0x4",
      "author": "cuberhino",
      "body": "Let’s assume money is an object. What’s the best bang for buck camera right now outside of a smart phone?",
      "score": 33,
      "created_utc": 1751773569.0,
      "replies": [
        {
          "id": "n1kxe98",
          "author": "welp_im_damned",
          "body": "Probably the Panasonic s5ii/x and Nikon Z5 if buying new.",
          "score": 26,
          "created_utc": 1751774191.0,
          "replies": [
            {
              "id": "n1kxlay",
              "author": "cuberhino",
              "body": "Ouch, I guess around like 500 or to 1k max budget? I’m just a hobby shooter for our business at farmers markets",
              "score": 10,
              "created_utc": 1751774281.0,
              "replies": [
                {
                  "id": "n1lpuay",
                  "author": "RedHotFooFecker",
                  "body": "The guy telling you a phone is fine is full of shit. I’ve a GX80 which is pretty old at this point and only cost me 400 in 2018. The difference between photos on that and my phone are night and day to me and it opens up taking photos in RAW file (no processing) so you can edit them as you like. \n\nThe size of the sensor and the size of the lens adds a lot to the quality of the photo. It doesn’t matter that phones are full of new tech, my new iPhone is not capable of taking photos as good as the camera. \n\nIf you’re using a proper camera for photography, you will get more out of it than a phone for sure.",
                  "score": 17,
                  "created_utc": 1751789540.0,
                  "replies": [
                    {
                      "id": "n1r9jr5",
                      "author": "HuckleberryDry4889",
                      "body": "I love my Z8 but frankly for most people the latest iPhone (with RAW) is great for many styles and genres. Some of my favorite shots are with my iPhone because I had it at the moment I needed it while my Z8 was at home.\n\nI love my iPhone anytime I just need a few shots of something that doesn’t move and I can control lighting and motion to get the shots I need, such as:\nquasi-macro,\nlandscape,\nstreet,\nportraits (need very good lighting)\n\niPhone is not good for:\nTrue macro (need a good lens),\nTelephoto (need a good lens),\nAction (need fast exposure and lenses),\nvery creative shots, or shooting tons of frames over hours (need a viewfinder and/or ergonomics) \n\nChallenging lighting: the iPhone often surprises me in what it can do with combining multiple exposures and error correction, but I usually prefer to use a fast prime lens on the pro camera if lighting is challenging.\n\nSource: I pulled this out of my ass so it’s probably neither accurate or complete, but hopefully it helps somebody. I don’t do much video, so I am not able to comment on it.",
                      "score": 3,
                      "created_utc": 1751863847.0,
                      "replies": []
                    },
                    {
                      "id": "n1nily3",
                      "author": "wiggetsf",
                      "body": "Gx80 is goated. I recently sold mine and regret it so much lol. ",
                      "score": 2,
                      "created_utc": 1751817461.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n1lbtg7",
                  "author": "saltyjellybeans",
                  "body": "buy an older, used model. armed with proper photography knowledge you will run circles around any smartphone.\n\ni do professional photography and used a d750 (a now *eleven* year old camera) for the longest time until i upgraded earlier this year and it's *still* a fantastic camera.",
                  "score": 10,
                  "created_utc": 1751781438.0,
                  "replies": [
                    {
                      "id": "n1nn0hh",
                      "author": "LordGAD",
                      "body": "Absolutely this. I still shoot with a Canon 5D Mark III. ",
                      "score": 2,
                      "created_utc": 1751818785.0,
                      "replies": []
                    },
                    {
                      "id": "n24q0o6",
                      "author": "fourthdawg",
                      "body": "I've used a D7200 with a 18-135mm kit lens for a travel photography some 2 years ago, and the image is way better than any smartphone could be. And this is a DSLR with APS-C crop sensor, I assume D750 is better in most situation.",
                      "score": 2,
                      "created_utc": 1752043083.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n1kyygc",
                  "author": "Vinnie_Vegas",
                  "body": "Do you really need a standalone camera for that? \n\nIf you've already got a top of the line smartphone, you might genuinely be better off taking a short course in phone photography. \n\nIt'll probably result in a greater improvement in your photography than the difference between a smartphone camera and an inexpensive camera that's neither mirrorless or full frame at that budget.",
                  "score": 32,
                  "created_utc": 1751774911.0,
                  "replies": [
                    {
                      "id": "n1l00u8",
                      "author": "cuberhino",
                      "body": "Idk. Seen photographers at events with bigger cameras. Saw this post. Figured someone might have a recommend",
                      "score": 7,
                      "created_utc": 1751775410.0,
                      "replies": [
                        {
                          "id": "n1l1lge",
                          "author": "Vinnie_Vegas",
                          "body": "My wife is a professional photographer, and often works for rich enthusiasts who brag about owning a considerably more expensive camera than the one she shoots on... While they're paying her thousands to shoot for them because they can't achieve what she can, despite having better equipment than her. \n\nShe shoots better photos on her phone than these rich guys with their Leicas and Hasselblads, because she actually knows what she's doing. \n\nThe reason that camera options in the price range you specified aren't very abundant is precisely *because* they often struggle to significantly outperform smartphone cameras, particularly in the hands of amateurs. \n\nSmartphones are doing a lot in software that's very forgiving to the average user, whereas a mirrorless DSLR can be difficult to get great results out of if you don't know what you're doing. \n\nIf there are paid photographers there, they're always going to show up with an impressive looking camera, because nobody wants to pay someone to come in and shoot on their phone - It just doesn't feel like good value.",
                          "score": 10,
                          "created_utc": 1751776164.0,
                          "replies": []
                        },
                        {
                          "id": "n1l0avm",
                          "author": "hedoeswhathewants",
                          "body": "Doesn't mean their photos are better.\n\nYou came in with a use case and a budget and got a pretty good suggestion. *shrug*",
                          "score": 6,
                          "created_utc": 1751775544.0,
                          "replies": [
                            {
                              "id": "n1n4edl",
                              "author": "ioxio",
                              "body": "He specifically asked for \"best bang for buck camera right now outside of a smart phone\" and he was told smart phone. That's not a pretty good suggestion no matter how much you shrug.",
                              "score": 6,
                              "created_utc": 1751813152.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "n1lkq2v",
                          "author": "gnomishdevil",
                          "body": "You can buy enough peripherals for the phone so that it looks bugger than those event photographers.\n\nFeature films are filmed on phones these days.",
                          "score": 1,
                          "created_utc": 1751786532.0,
                          "replies": []
                        },
                        {
                          "id": "n1lbt4h",
                          "author": "casualsax",
                          "body": "What the \"Your phone is a better camera\" comments\" miss is that taking a photo from a camera has a different feel from a phone. Being in a particular mental headspace and feeling like you're a photographer has value.\n\nThe big question is how much time do you have to learn your gear? Hobbyist level cameras require you to manage light levels and focus, both items that smart phones and consumer point-and-shoots handle automatically.\n\nIf I was grabbing a camera to shoot at farmer's markets, I would want something that brings a particular style. Fujifilm cameras are great at getting a pleasant ascetic straight from in-camera jpgs. With an X-M5 body and a XF 16-50mm lens you'll have a great platform to learn and build from and resale value if you decide to jump ship.\n\nIf you were going to be shooting moving subjects or needed more detail for your buck I'd point you elsewhere, but a famers market sounds like a place where the warm fuji color profiles would shine.",
                          "score": 0,
                          "created_utc": 1751781433.0,
                          "replies": [
                            {
                              "id": "n1ltihj",
                              "author": "cuberhino",
                              "body": "I want to film vendor interviews and take high quality footage for a flyer/circular for the neighborhood. Was considering one of the gimbal devices like the osmo pocket. I’ve seen people using the osmo + camera with attachment to get wide angle and vertical footage at the same time for social media and stuff like that",
                              "score": 1,
                              "created_utc": 1751791774.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n1l1kwi",
                  "author": "OkDragonfruit9026",
                  "body": "Sony RX100M7. Yep, I know, it’s 2025. And yet, it’s the best. Still.",
                  "score": 4,
                  "created_utc": 1751776157.0,
                  "replies": []
                },
                {
                  "id": "n1l083p",
                  "author": "welp_im_damned",
                  "body": "Ah ok I see. I have some you might be interested in then.\n\nUsed, I would recommend apsc bodies like the Sony a6700 because it has ibis, Sony's top tier autofocus, cheap camera lens and mature lens line up. If you want to have the latest technology. \n\nIf you prefer full frame, the original S5, a7c, a7iii are around the 1k mark used as well\n\nNew apsc bodies there Nikon z50ii with decent autofocus and has growing lens collection. There is also the Fuji xt30/xt30ii which are sub 1k cameras, has a good lens selection. But both Nikon and Fuji lack ibis. \n\nThere are micro four thirds cameras like the om5 series which has a lot of tech and really good features like Ibis and computational photography. There's the Lumix g100d for 500 and the g97 for 800ish? M43 I would say has a matured and cheap lens lineup.\n\nI would recommend you look on/ask each of the camera brand subreddits \n\nr/sonyalpha \n\nr/lumix\n\nr/fujifilm\n\nr/nikon\n\n\nI use the Lumix gx9. While I enjoy taking photos with it and I have really good prime lenses. To me, Panasonic doesn't care much about m4/3. The autofocus is acceptable for shooting photos but terrible for video and I shoot manual in that case.\n\nI think your best bang for the buck would be going with a used camera body and used lens.",
                  "score": 5,
                  "created_utc": 1751775507.0,
                  "replies": []
                },
                {
                  "id": "n1lrxcw",
                  "author": "Yummier",
                  "body": "I'm not familiar with the US market, but sub 1K you should probably look in the used market where you can often get real bang for your buck. \n\nIf I may offer a slightly different recommendation from the ones already made: Look into modern compact cameras. Many are marketed for \"street-photography\" these days, but they are excellent all-rounders for daily use and fantastic when travelling due to fitting in a pocket. They take much better pictures than phones, especially in low-light conditions and offer a great way to get into photography.\n\nExamples: Canon G7X, Ricoh GR3, Sony RX100, the new Canon Powershot V1 (especially if video is important).",
                  "score": 2,
                  "created_utc": 1751790806.0,
                  "replies": [
                    {
                      "id": "n1lswdq",
                      "author": "cuberhino",
                      "body": "How do these compare to like an insta360 camera? Was thinking the one with the gimbal",
                      "score": 1,
                      "created_utc": 1751791406.0,
                      "replies": [
                        {
                          "id": "n1m1xsi",
                          "author": "Yummier",
                          "body": "I have never tried one myself. But the insta360 is for wide angle videos, these are for photography. The Powershot V1 is great for video, but has a very different form factor. So it depends on what kind of videos you're looking to make. I'm betting the Powershot will beat the Insta360 in pictures though.",
                          "score": 2,
                          "created_utc": 1751796900.0,
                          "replies": [
                            {
                              "id": "n1mjv5i",
                              "author": "cuberhino",
                              "body": "I meant the DJI osmo pocket",
                              "score": 1,
                              "created_utc": 1751805800.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "n1mi9vd",
                          "author": "maqcky",
                          "body": "The insta360 is not a good camera at all. It cannot be, it has other purposes and it's constrained in lens and sensor size. If you plan on taking action pictures/videos going on a bike or doing some sport, it's perfect for that, but only for that.",
                          "score": 1,
                          "created_utc": 1751805134.0,
                          "replies": [
                            {
                              "id": "n1mjq4u",
                              "author": "cuberhino",
                              "body": "I meant the DJI osmo pocket it was late sorry!",
                              "score": 1,
                              "created_utc": 1751805744.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n1mby2v",
                  "author": "jb32647",
                  "body": "If you’re just doing stills and not video, DSLRs can be had for an absolute motza since a lot of pros are now moving on to mirrorless.",
                  "score": 2,
                  "created_utc": 1751802284.0,
                  "replies": []
                },
                {
                  "id": "n1l547z",
                  "author": "LeonMust",
                  "body": "Are you mainly focused on video or photos?",
                  "score": 1,
                  "created_utc": 1751777889.0,
                  "replies": [
                    {
                      "id": "n1ltmnh",
                      "author": "cuberhino",
                      "body": "Both are needed, it’s for vendor interactions and interviews, as well as social media footage. I also want to take high quality photos of vendor products for our websites",
                      "score": 1,
                      "created_utc": 1751791843.0,
                      "replies": [
                        {
                          "id": "n1oq3mm",
                          "author": "LeonMust",
                          "body": "For your budget, you're looking at getting a camera with a 1 inch sensor or a Micro 4/3 sensor.  Cameras with these sensors will have great quality if the area is well lit but will suffer if the area you're trying to capture isn't well lit.",
                          "score": 1,
                          "created_utc": 1751830706.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n1mest1",
                  "author": "disciples_of_Seitan",
                  "body": "If you are patient enough You can get an S5ii for ~1k. I got mine for 1.2 a few years back, with some lenses to boot.",
                  "score": 1,
                  "created_utc": 1751803612.0,
                  "replies": []
                },
                {
                  "id": "n1nto4y",
                  "author": "nilla-wafers",
                  "body": "You could get an older DSLR. They don’t have as many features as newer mirrorless cameras but they have comparable image quality and the lenses are usually cheaper on the used market.",
                  "score": 1,
                  "created_utc": 1751820821.0,
                  "replies": []
                },
                {
                  "id": "n1o7x06",
                  "author": "glytxh",
                  "body": "10-15 year old gear is just as usable as long as you’re conscious of working within its constraints. \n\nModern stuff makes for faster workflows, more data per frame, better dynamic range etc, but at the end of the day it’s still just a sensor and a light bucket\n\nA really good camera 10 years ago is still a really good camera today.",
                  "score": 1,
                  "created_utc": 1751825089.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n1lbrb6",
          "author": "Ire-Works",
          "body": "It depends entirely on what you're trying to do with it. \n\nIf you're just trying to make \"content\" the DJI Osmo 3 is very tough to beat.",
          "score": 5,
          "created_utc": 1751781405.0,
          "replies": [
            {
              "id": "n1m5irn",
              "author": "SarahArabic2",
              "body": "OSMO creator package that includes the wireless mic and extended  battery is the best setup for most people shooting videos. \n\nPlus the pocket 3 shoots d log 4k60 and the audio is 32bit.",
              "score": 1,
              "created_utc": 1751798984.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n1m3989",
          "author": "pmjm",
          "body": "Keep in mind that most of the money you'll spend isn't on the camera body itself, it's on the lenses. You'll need a kit of lenses at various focal lengths depending on what kind of work you want to do. \n\nPersonally, I know when I buy a new Canon body I'm going to spend somewhere between $3-5K, but the lenses are typically $2-4K each, and I have around a dozen of them. There are more budget oriented lenses but this is one area where you really get what you pay for. That said, even the budget stuff is going to look 100x better than a smartphone and will differentiate your work.\n\nYou can buy all of this stuff used though, which saves quite a bit of money.\n\nDon't forget about lighting too, if you'll be doing indoor or low-light work.\n\nIf you're doing video you'll also need a good audio recorder and some microphones.",
          "score": 2,
          "created_utc": 1751797678.0,
          "replies": []
        },
        {
          "id": "n1lce0x",
          "author": "FijianBandit",
          "body": "R8 or r6 mkii",
          "score": 2,
          "created_utc": 1751781756.0,
          "replies": []
        },
        {
          "id": "n1lgk7j",
          "author": "correctingStupid",
          "body": "Buy used.  Like a Panasonic gh6 or 7. ",
          "score": 2,
          "created_utc": 1751784123.0,
          "replies": [
            {
              "id": "n1m5mdm",
              "author": "SarahArabic2",
              "body": "Maybe the GH5 or 5mk2.  This way you can still use dual sd cards and not have to use new media types.",
              "score": 1,
              "created_utc": 1751799039.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n1nqml3",
          "author": "dumbledayum",
          "body": "a6100",
          "score": 1,
          "created_utc": 1751819894.0,
          "replies": []
        },
        {
          "id": "n1lgpl9",
          "author": "Mr_JohnUsername",
          "body": "If you have an iPhone, get the Halide app. It lets you truly shoot RAW photos without Apple’s bullshit and automatic post-processing software. Furthermore you can control ISO, Shutter Speed, *and* Aperture. My photos have never looked sharper and since they’re raw you can do the post properly yourself in dedicated software. \n\nPhotos are comparable to dedicated cameras without breaking the bank.",
          "score": -1,
          "created_utc": 1751784208.0,
          "replies": [
            {
              "id": "n1m5twp",
              "author": "SarahArabic2",
              "body": "Thank you for the app recommendation. I was using first light but they turned into a bullshit subscription model on me.",
              "score": 3,
              "created_utc": 1751799154.0,
              "replies": [
                {
                  "id": "n1nhd7l",
                  "author": "wiggetsf",
                  "body": "Leica lux is better imo. Also neither even remotely compare to a dedicated camera. ",
                  "score": 2,
                  "created_utc": 1751817101.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n1lrile",
              "author": "hitmonng",
              "body": "Photos are not comparable even to top end Android ultra phones from Xiaomi and Vivo. Let alone dedicated cameras.",
              "score": 1,
              "created_utc": 1751790556.0,
              "replies": [
                {
                  "id": "n1lvao7",
                  "author": "Mr_JohnUsername",
                  "body": "Don’t care didn’t ask bro. Just disagree with me and move on, I don’t need your Android(TM) trash ad.",
                  "score": -4,
                  "created_utc": 1751792859.0,
                  "replies": [
                    {
                      "id": "n1m5rty",
                      "author": "SarahArabic2",
                      "body": "Solid response",
                      "score": 2,
                      "created_utc": 1751799123.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n1kn8gf",
      "author": "enonmouse",
      "body": "Just what the market needed.",
      "score": 7,
      "created_utc": 1751769728.0,
      "replies": []
    },
    {
      "id": "n1lsjka",
      "author": "Buzstringer",
      "body": "If money is no object, hire a full production crew 24/7.\n\nHeadline is nonsense, sorry Engadget I do like you.",
      "score": 5,
      "created_utc": 1751791187.0,
      "replies": []
    },
    {
      "id": "n1o3uee",
      "author": "KrazyBobby",
      "body": "Doesn’t matter the paint brush, only the artist. It’s nice to see a lot of camera options out there.",
      "score": 2,
      "created_utc": 1751823884.0,
      "replies": []
    },
    {
      "id": "n1lf568",
      "author": "Trenbolone-Papi",
      "body": "I’m a complete camera noob who just happened to run into this… question though \n\nIs this just a camera or you can record videos for it? Like the nice videos that fitness influencers use for their workouts \n\nThanks for paying attention to my dumb noob question",
      "score": 3,
      "created_utc": 1751783308.0,
      "replies": [
        {
          "id": "n1m6hxy",
          "author": "roguehero",
          "body": "The LUMIX S1 Mark 2 is a hybrid camera, where you can move the dial to either photo or video mode. I have a different model myself for my work and being able to take both is a must.",
          "score": 3,
          "created_utc": 1751799509.0,
          "replies": [
            {
              "id": "n1ntpph",
              "author": "Trenbolone-Papi",
              "body": "Thank you",
              "score": 2,
              "created_utc": 1751820834.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n1y5qc0",
          "author": "nice_usermeme",
          "body": "All photo cameras can record video, even old dslr. Some have better stabilization, some worse, some can do 240 frames per second, but for basic needs youre fine with pretty much anything on the market right now",
          "score": 2,
          "created_utc": 1751960395.0,
          "replies": []
        },
        {
          "id": "n1m7lbs",
          "author": "None",
          "body": "[deleted]",
          "score": -2,
          "created_utc": 1751800087.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n1kot1o",
      "author": "None",
      "body": "should be money as a subject lol",
      "score": 2,
      "created_utc": 1751770395.0,
      "replies": []
    },
    {
      "id": "n1noqqb",
      "author": "ragnarok62",
      "body": "Considering that Panasonic/Lumix have had a long-running partnership with Leica, are we getting Leica bits in this one? They have had crossovers in the past.",
      "score": 1,
      "created_utc": 1751819313.0,
      "replies": []
    },
    {
      "id": "n1qu6hl",
      "author": "Substantial__Unit",
      "body": "Cameras have gotten so expensive. I'm still loving my Olympus OMD Em5 mkiii and a great pro lens. When I see the size difference of these cameras and then the price tag I am glad with what I have. Now having said that it seems more is falling farther behind every year. So eventually I'll be in the market for a different system.",
      "score": 1,
      "created_utc": 1751857066.0,
      "replies": [
        {
          "id": "n1zn27f",
          "author": "wkavinsky",
          "body": "Still rocking my X100s.\n\nStill does \\*everything\\* I need a camera to do.",
          "score": 2,
          "created_utc": 1751984290.0,
          "replies": [
            {
              "id": "n220yrx",
              "author": "Substantial__Unit",
              "body": "Ya, I don't real have any huge issues with mine except maybe it would be nice to have less noise and maybe better autofocus. But I make it work.",
              "score": 1,
              "created_utc": 1752008115.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n1u25n0",
      "author": "IlTossico",
      "body": "Lenses guy, the camera alone can't do magic. And getting a brand with poor lens selection, is not the best thing to do. Even worse if the body is more expensive than competition and lenses cost too.",
      "score": 1,
      "created_utc": 1751906720.0,
      "replies": []
    },
    {
      "id": "n1x10hk",
      "author": "effysthrowaway",
      "body": "Looks like a great camera for serious video folk, but man, that price tag is hard to swallow lol.",
      "score": 1,
      "created_utc": 1751941530.0,
      "replies": []
    },
    {
      "id": "n1kpzbm",
      "author": "arkadiysudarikov",
      "body": "Which lens?",
      "score": 1,
      "created_utc": 1751770895.0,
      "replies": []
    }
  ]
}