{
  "post": {
    "title": "UK student invents repairable kettle that anyone can fix | Gabriel Kay hopes his design can help tackle the problems caused by discarded electrical goods",
    "author": "chrisdh79",
    "id": "1gnbb2y",
    "score": 2826,
    "created_utc": 1731162626.0,
    "selftext": "",
    "num_comments": 200,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gnbb2y/uk_student_invents_repairable_kettle_that_anyone/"
  },
  "comments": [
    {
      "id": "lw9bf8v",
      "author": "NobleRotter",
      "body": "Better looking kettle than most too. \n\nNot sure I've ever had a kettle break though. Living Inna hard water area they just eventually turn to stone",
      "score": 422,
      "created_utc": 1731165362.0,
      "replies": [
        {
          "id": "lw9d7xi",
          "author": "jobe_br",
          "body": "Just soak in a citric acid solution for a bit. I get a few ounces of crystallized citric acid on Amazon and put a couple tablespoons in the kettle, add cold water, heat, let sit for a bit to let the CA do its thing … usually does the trick first time, if there’s anything left, repeat a second time. 30 minutes later and you have a fresh clean kettle.",
          "score": 155,
          "created_utc": 1731165981.0,
          "replies": [
            {
              "id": "lwa4eaj",
              "author": "skylarmt_",
              "body": "Or just boil white vinegar in it for a while",
              "score": 94,
              "created_utc": 1731174813.0,
              "replies": [
                {
                  "id": "lwa500f",
                  "author": "jobe_br",
                  "body": "Yep, same principle. The CA is just faster ;)",
                  "score": 49,
                  "created_utc": 1731175002.0,
                  "replies": [
                    {
                      "id": "lwat9zw",
                      "author": "SabreSeb",
                      "body": "And it doesn't stink like vinegar",
                      "score": 53,
                      "created_utc": 1731182799.0,
                      "replies": [
                        {
                          "id": "lwayof9",
                          "author": "jobe_br",
                          "body": "Yep, this is one of the benefits :-)",
                          "score": 19,
                          "created_utc": 1731184585.0,
                          "replies": []
                        },
                        {
                          "id": "lwbijpz",
                          "author": "Malawi_no",
                          "body": "Would think it's also cheaper than vinegar.",
                          "score": 6,
                          "created_utc": 1731191163.0,
                          "replies": [
                            {
                              "id": "lwbkp0m",
                              "author": "NeilDeWheel",
                              "body": "Just don’t leave it in the kettle overnight and forget to tell your partner. In the morning my partner made herself a cup of tea and nearly threw up when she took a sip. And definitely don’t laugh at them for half and hour afterwards.",
                              "score": 35,
                              "created_utc": 1731191899.0,
                              "replies": [
                                {
                                  "id": "lwbvbgd",
                                  "author": "VariousProfit3230",
                                  "body": "Okay, but hear me out, maybe you want an express ticket to Suplex City.",
                                  "score": 8,
                                  "created_utc": 1731195657.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lwc6jwi",
                              "author": "ladyrift",
                              "body": "What do you pay for vinegar? I can get 4L for like 2 Canadian",
                              "score": 2,
                              "created_utc": 1731199659.0,
                              "replies": [
                                {
                                  "id": "lwc78ma",
                                  "author": "SlootjeRijk",
                                  "body": "Who's your vinegar guy?",
                                  "score": 4,
                                  "created_utc": 1731199905.0,
                                  "replies": [
                                    {
                                      "id": "lwc9n75",
                                      "author": "ladyrift",
                                      "body": "https://www.maxi.ca/pure-white-vinegar-club-size/p/20102756_EA\n\nMy guy is Galen Weston",
                                      "score": 3,
                                      "created_utc": 1731200782.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "lwdboyd",
                                  "author": "Malawi_no",
                                  "body": "It's quite a bit more expensive here in Norway.  \nGuess the most bang for the krone would be a liter of 32% at about 6 CAD. It would be equal in effect to 4-5 liters of regular vinegard.  \nFor around the same price (probarbly 1-2 CAD more) I could buy 700grams of citric acid powder.",
                                  "score": 2,
                                  "created_utc": 1731216244.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lwhoua4",
                              "author": "Unparalleled_",
                              "body": "Cheapest for me is using the leftover lemons or limes that I don't need from cooking/baking etc.",
                              "score": 1,
                              "created_utc": 1731279768.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lwaktdq",
                      "author": "read_listen_think",
                      "body": "I used lemons when I had a prolific tree.",
                      "score": 5,
                      "created_utc": 1731180061.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lwas3k5",
                  "author": "bikeonychus",
                  "body": "This is what I do too. Usually all the limescale is gone after 3 boils with the same vinegar in there. Takes about 15 minutes.\n\n\nJust... Remember to rinse really well before making a cup of tea. You will find out as soon as you pour the milk in, if you didn't rinse it enough.",
                  "score": 7,
                  "created_utc": 1731182406.0,
                  "replies": [
                    {
                      "id": "lwawzyw",
                      "author": "skylarmt_",
                      "body": "Surprise cheese is best cheese",
                      "score": 7,
                      "created_utc": 1731184030.0,
                      "replies": [
                        {
                          "id": "lwbiqb5",
                          "author": "Malawi_no",
                          "body": "One of my core childhood memories is from getting milk in my tea that already had lemon in it.",
                          "score": 3,
                          "created_utc": 1731191225.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lwe4zzv",
                  "author": "Wiggles69",
                  "body": "Dilute the vinegar first. I rendered the school common room uninhabitable for an hour boiling straight vinegar to clean the urn.",
                  "score": 2,
                  "created_utc": 1731234315.0,
                  "replies": []
                },
                {
                  "id": "lwenvj9",
                  "author": "idk_lets_try_this",
                  "body": "Citric acid is gentler on the metal and doesn’t damage silicone seals if a low grade silicone was used. \n\nThat’s why professional product for de-scaling are citric acid with a color indicator.",
                  "score": 1,
                  "created_utc": 1731244945.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lwc7o26",
              "author": "waynetuba",
              "body": "I’m gonna try this with my old one, I still use the electric kettle that my dad gave me, it was in the pentagon when it got hit during 9/11 which is why I haven’t gotten rid of it yet.",
              "score": 3,
              "created_utc": 1731200059.0,
              "replies": [
                {
                  "id": "lwcb9wa",
                  "author": "jobe_br",
                  "body": "Nice! Post back with a pic when you’re done!",
                  "score": 1,
                  "created_utc": 1731201381.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lwj99ct",
              "author": "LumpySpacePrincesse",
              "body": "I got a hot tap, fucking changed my life, the minutes saved every morning. MINUTES!",
              "score": 1,
              "created_utc": 1731300434.0,
              "replies": [
                {
                  "id": "lwjeay8",
                  "author": "jobe_br",
                  "body": "Fucking minutes, love it 😂",
                  "score": 1,
                  "created_utc": 1731302817.0,
                  "replies": [
                    {
                      "id": "lwjhb40",
                      "author": "LumpySpacePrincesse",
                      "body": "Mate, i fill my flask of tea, thats a litre, then my flattie does his coffee, we both would never go back to a kettle. The one we have is a commercial one i pulled out, but we have both agreed if that fucks out we are getting a new one. I am such a spastic in the morning man, even the effort of filling a kettle, cant do it no more man.\n\nYou want tea, bang the bag in, hit the button, boom!",
                      "score": 1,
                      "created_utc": 1731304385.0,
                      "replies": [
                        {
                          "id": "lwmpqhc",
                          "author": "jobe_br",
                          "body": "Very nice! Jealous!!",
                          "score": 1,
                          "created_utc": 1731354354.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwdbx6l",
              "author": "None",
              "body": "Hmm. wonder if that's how CLR works?",
              "score": 0,
              "created_utc": 1731216358.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw9txfy",
          "author": "GrynaiTaip",
          "body": "The switch lever broke on mine, because the little plastic tabs on it were very thin and just barely held up for five years.\n\nI grabbed a piece of plastic sheet, cut out multiple shapes of that lever and stacked them to get the right thickness.\n\nIt broke a year later so I made a stronger version. It's still working half a decade later.",
          "score": 27,
          "created_utc": 1731171462.0,
          "replies": [
            {
              "id": "lwaxb26",
              "author": "None",
              "body": "I'm still rocking a £10 stainless steel cookworks kettle I bought from argos in 2005/6.\n\nThe plastic ring on the base broke a couple years back, but you could unscrew it from the bottom to remove the wire/contacts and then I used the plastic top of a fairly liquid bottle some milliput and glue to fix it.\n\nStill going strong now - if it breaks again I'll make a replacement using my 3D printer.",
              "score": 5,
              "created_utc": 1731184133.0,
              "replies": [
                {
                  "id": "lwccht0",
                  "author": "GrynaiTaip",
                  "body": "Funny that you mentioned £, I lived and studied in the UK a few years ago and the rental house had this really old kettle. I did some googling and it appeared to be from the 70's. \n\nThe company was still in business so I emailed them asking for an owners manual or some other info, just for fun, but they never replied. \n\nThat kettle worked great, it even survived a renovation, when I had to make a cuppa for three guys once an hour for several days.",
                  "score": 1,
                  "created_utc": 1731201831.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lwcdp40",
              "author": "stellvia2016",
              "body": "Probably a good candidate for 3D printing as well. There are some really neat things people share the plans for on sites like Thingiverse.",
              "score": 2,
              "created_utc": 1731202265.0,
              "replies": [
                {
                  "id": "lwcfp0q",
                  "author": "GrynaiTaip",
                  "body": "Absolutely, I've printed a ton of practical things too. \n\nIn this particular case I figured that plastic sheet is better in terms of strength. Not everything is best when printed.",
                  "score": 2,
                  "created_utc": 1731202988.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lwawk3y",
          "author": "gargravarr2112",
          "body": "My first thought. When have kettles ever broken? They are like the simplest possible appliance. Scale obviously becomes a problem but so much less since designers started using flat bases instead of elements in the water. The only time I've known my family replace a kettle was for aesthetics. I've had the same kettle for 10 years since I moved into my first flat. Descale it every year or two and carry on.",
          "score": 13,
          "created_utc": 1731183886.0,
          "replies": [
            {
              "id": "lwdokw4",
              "author": "razirazo",
              "body": "I had one kettle that I throw out due to sensor issue. Thing keep boiling until the water dries without any cut off.",
              "score": 3,
              "created_utc": 1731223496.0,
              "replies": []
            },
            {
              "id": "lwgi1xq",
              "author": "CosmicCreeperz",
              "body": "I am on my 3rd in 10 years.  I use it all the time, but eventually the electronics go out.  I guess all of the humidity?\n\nNow note, mine has different temp settings (ie for different tea types, French press or pour over coffee, etc) and auto shutoff.\n\nMy issue with this kettle is he basically just lets you swap all of the electronics out.  Which is guess is better than tossing a whole kettle, but still doesn’t seem like much of a repair vs someone actually swapping a potentiometer or resoldering broken contacts.  Then again I’m an EE who could probably fix it, and I don’t bother since spending a day trying to repair a $100 kettle isn’t worth my time…",
              "score": 1,
              "created_utc": 1731266687.0,
              "replies": [
                {
                  "id": "lwgq6vu",
                  "author": "gargravarr2112",
                  "body": "Part of my point is that kettles aren't supposed to have electronics - they're supposed to be *electrical*, because as you've correctly pointed out, the *electronics* are the usual point of failure. Now to be fair, I have never had cause to need different temperature settings so I wouldn't understand the benefit. I just boil the kettle and toss the hot water in a mug. I bought the cheapest stainless-steel kettle at the supermarket 12 years ago. It has exactly two settings - on and off. I made 3 cups of tea with it today. There's just nothing to go wrong in it.\n\nBut as you say, making this device 'repairable' by essentially making the electronics modular... doesn't really solve the problem. Because as you point out, it's still an entire electronics module (composed of many smaller electronic components) that has to be swapped out and then disposed of, rather than fixing the one or two actual faulty components. It *reduces* the electrical waste, but doesn't *eliminate* it.",
                  "score": 2,
                  "created_utc": 1731269156.0,
                  "replies": [
                    {
                      "id": "lwgugh4",
                      "author": "CosmicCreeperz",
                      "body": "Who says they are not supposed to have electronics?\n\nI bet 80 years ago people said there was no reason they should be electrical, why not just use a gas range?  That’s how we did it as a kid, that’s good enough for everyone!\n\nI like my kettle that has 8 temp buttons and a keep warm setting with auto shutoff and empty/no water safety detection.\n\nI use mine for everything from white, oolong, green, and black teas, French press, aero press, and Americano coffee, ramen, miso, or other quick soups, and heh, even warming water to defrost small rats to feed my ball python.  Sometimes my family uses it 10x a day.  Which is why I guess I’m ok that the last one only lasted 5 years.",
                      "score": 1,
                      "created_utc": 1731270446.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwca4wg",
              "author": "boomchacle",
              "body": "I always just assumed that a kettle is literally just a switch, coil, and thermometer. What is there to break that could be replaced without creating E waste?",
              "score": 1,
              "created_utc": 1731200962.0,
              "replies": [
                {
                  "id": "lwenns4",
                  "author": "gargravarr2112",
                  "body": "It's not even a thermometer, it's a simple and reliable bimetallic strip - on heating, one side expands faster than the other, causing it to bend and flip the switch to off. Those things last decades.",
                  "score": 3,
                  "created_utc": 1731244849.0,
                  "replies": [
                    {
                      "id": "lwgidrf",
                      "author": "CosmicCreeperz",
                      "body": "A lot of decent ones have multiple temperature settings.  Also a bimetallic strip is basically a thermometer without the needle ;)",
                      "score": 1,
                      "created_utc": 1731266784.0,
                      "replies": [
                        {
                          "id": "lwgqxz0",
                          "author": "gargravarr2112",
                          "body": "Very true on both counts. My point is that a bimetallic strip is extremely reliable, dramatically more so than electronics accomplishing the same job (and why this kettle apparently exists). You could probably use such a strip (or a couple of them) to handle multiple temperatures rather than doing it electronically, but that wouldn't look nearly as modern or futuristic, would it...",
                          "score": 2,
                          "created_utc": 1731269384.0,
                          "replies": [
                            {
                              "id": "lwh3yt9",
                              "author": "CosmicCreeperz",
                              "body": "And at some point a few $0.10 electrical components is much cheaper to build… especially if you don’t care how long it lasts.",
                              "score": 1,
                              "created_utc": 1731273174.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwcdmuk",
              "author": "achangb",
              "body": "This kettle is obsolete as soon as you buy it...Who wants a \"dumb\" kettle these days? Give me a Bluetooth/ wifi connected kettle that has OTA firmware updates, color screen, phine app, and can even be hacked to play games...\n\nhttps://fellowproducts.com/products/stagg-ekg-pro-electric-kettle-studio-edition",
              "score": -2,
              "created_utc": 1731202242.0,
              "replies": [
                {
                  "id": "lwenxuf",
                  "author": "gargravarr2112",
                  "body": "I'm waiting for a smart kettle that gets around the fact that a human has to physically pour water into it.\n\nBecause flipping a physical switch on the kettle while standing in front of it is far, far harder than grabbing your phone, opening the app, waiting for updates to finish, waiting for Bluetooth to connect, swiping past the ads and then choosing exactly how you want to boil the water...",
                  "score": 1,
                  "created_utc": 1731244973.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lw9fb2z",
          "author": "Tasty-Traffic-680",
          "body": "Come on over to the US, the land of 120V and broke ass electric kettles. They don't seem to hold up well with lower voltage/higher current.",
          "score": 13,
          "created_utc": 1731166683.0,
          "replies": [
            {
              "id": "lw9hykf",
              "author": "NobleRotter",
              "body": "Life is too short for 120v",
              "score": 25,
              "created_utc": 1731167569.0,
              "replies": [
                {
                  "id": "lwb0dpn",
                  "author": "Bigwhtdckn8",
                  "body": "Especially if you cut through a 350v max mains cable",
                  "score": 1,
                  "created_utc": 1731185137.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lw9qq9m",
              "author": "rdmusic16",
              "body": "Is that true? In Canada we have the same, and my electric kettle is 15+ years old. I 'properly' clean it once a year.\n\nI can't say I've always used it daily during all that time, but I've always used it and it's definitely turned on 3-4 times a day for a long time now.\n\nStill works perfectly fine.",
              "score": 15,
              "created_utc": 1731170439.0,
              "replies": [
                {
                  "id": "lw9xcq8",
                  "author": "NootHawg",
                  "body": "I have one I bought from amazon for $12 right around 10 years ago and I can’t find anything wrong with it🤷🏼‍♂️ it’s 120v.",
                  "score": 6,
                  "created_utc": 1731172565.0,
                  "replies": [
                    {
                      "id": "lwa8hsu",
                      "author": "Coal_Morgan",
                      "body": "Canadian also and my wife and I got our kettle when we got married 20ish years ago. \n\nIt's rock solid. I always thought kettles were pretty much bomb proof.",
                      "score": 1,
                      "created_utc": 1731176113.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lwbfcnf",
                  "author": "Tasty-Traffic-680",
                  "body": "I'm starting to think it might just be the shitty Hamilton Beach ones I've bought in the past but even the more expensive one I last purchased only lasted a few years before getting flakey with the connection to the base. It has to be turned to exactly the right spot to turn on.",
                  "score": 2,
                  "created_utc": 1731190071.0,
                  "replies": []
                },
                {
                  "id": "lwbqari",
                  "author": "Nkechinyerembi",
                  "body": "I have to clean mine once a week due to hard water, but it's been reliable for several years now",
                  "score": 1,
                  "created_utc": 1731193859.0,
                  "replies": [
                    {
                      "id": "lwcbkam",
                      "author": "rdmusic16",
                      "body": "Our water isn't bad for that, but if I still lived in a small town or on a farm - yeah, I'd probably have to clean mine waaaay more often.",
                      "score": 2,
                      "created_utc": 1731201489.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lw9yarj",
              "author": "Practical-Custard-64",
              "body": "Higher current but not that much higher. I believe (correct me if I'm wrong) that appliances are limited to 1500W in the US. Here in the UK we use 240V and kettles are up to 3500W (13A under 240V).",
              "score": 4,
              "created_utc": 1731172867.0,
              "replies": [
                {
                  "id": "lwaj0cq",
                  "author": "BeefyIrishman",
                  "body": "Most circuits in a house in the US are on 15A breakers with 14AWG wire (about 2.5mm²), so ~1800W will trip the breaker. The 1500W helps avoid accidentally tripping the breaker all the time. This is why you don't see electric kettles as often in the US. Usually people just have a normal kettle that they use on their stovetop (hob), since stoves runs at 240V instead of 120V, and therefore you can typically boil water faster than an electric kettle. \n\nSide note: Kitchens are actually required to be on 20A breaker (~2400W) with 12AWG wire (about 4mm²), but that is just because you typically have a lot of higher current devices in the kitchen. Most devices won't be able to use the extra current, as they are designed to run on any circuit in the house. You can technically buy some devices that use the 20A, but they are rare. The 20A outlets are designed to allow both 15A and 20A plugs to be inserted into them, but a 15A outlet will only allow 15A plugs.",
                  "score": 3,
                  "created_utc": 1731179484.0,
                  "replies": [
                    {
                      "id": "lwb0g1u",
                      "author": "None",
                      "body": "Yeah that's pretty low by our standards, the UK most kitchens are on a 32A Breaker (7.5kW), with each individual socket rated technically rated to 13A @ 230V - but in reality the UK still gets around 240V (tolerance is 216 to 253).\n\nMost kettles top out at 3000W though you can get 10KW wall mounted instant water boilers, but they need wired on their own connection and tend to be used commercially.\n\nUK sockets also mostly use 2.5mm cable (twin and earth) but wired in a ring so can handle that 32A compared to a radial circuit like used in the US (mostly).",
                      "score": 3,
                      "created_utc": 1731185158.0,
                      "replies": [
                        {
                          "id": "lwb4cuh",
                          "author": "BeefyIrishman",
                          "body": "You can also get instant water boilers here, but they typically will get their own circuit anyways, so it can be run as a 240V circuit.\n\nThe odd thing is, our mains power is actually 240V, we just split that into two 120V lines by tapping a neutral off the center and tying it to ground. So if you go L1 (hot) or L2 (hot) to neutral you get 120V, and if you go from L1 to L2 you get 240V. Usually only electric clothes dryers, water heaters, A/C units, and stoves/ ovens (and electric car chargers if you have one) run at 240V though, pretty much everything else runs 120V.\n\nThere is actually nothing stopping you (other than cost) from running 240V circuits in your house and buying 240V electronics if you wanted to. There are 240V plugs/outlets for both 15A and 20A that are very similar to our normal plugs (they just have some of the flat pins rotated), but you typically only see those used in commercial spaces. They are pretty rare in residential. I have a few that I installed in my garage for some woodworking tools, but most houses don't have them.",
                          "score": 3,
                          "created_utc": 1731186436.0,
                          "replies": [
                            {
                              "id": "lwbao5n",
                              "author": "None",
                              "body": "That's odd, must be 180 out phase then.\n\nWe don't have that - we can get 3 phase, so if you Delta-Y it you get 400V - this is usually only used in industry though or very large buildings (like blocks of flats), once it gets to residential it's almost never used - you can, but it costs more for the electric company to hook you up.\n\nGenerally more used for heavy machinery - big power tools etc.",
                              "score": 1,
                              "created_utc": 1731188525.0,
                              "replies": [
                                {
                                  "id": "lwbijey",
                                  "author": "BeefyIrishman",
                                  "body": "Yeah, for residential it's 180° out of phase. For commercial use, we do have 3 phase power, and that has many different versions. These are the most common from what I have seen at manufacturing facilities where I have worked.\n\n* **120/208V (208V Wye)**: 208V between phases, 120V any phase to Neutral\n* **277/480V (480V Wye)**: 480V between phases, 277V any phase to Neutral\n* **347/600V (600V Wye)**: 600V between phases, 347V any phase to Neutral\n* **208V Delta 4 wire**: 240V between phases, 208V on Phase B (wild leg) to Neutral, 120V Phase A + C to Neutral\n\nYou apparently occasionally see Delta on the higher voltages well, but I haven't seen these personally. \n\n* **208V Delta 3 wire**: 208V between phases, no Neutral\n* **480V Delta 3 wire**: 480V between phases, no Neutral\n* **480V Delta 4 wire**: 480V between phases, 415V on Phase B (wild leg) to Neutral, 240V Phase A + C to Neutral\n* **600V Delta 3 wire**: 600V between phases, no Neutral\n\nI am sure there are others as well. It can start getting really convoluted in commercial power.",
                                  "score": 2,
                                  "created_utc": 1731191161.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwa8eru",
              "author": "HandsyBread",
              "body": "Maybe I’m the crazy one but my cheap kettle has lasted me nearly 10 years and it gets fired up nearly daily.",
              "score": 4,
              "created_utc": 1731176087.0,
              "replies": [
                {
                  "id": "lwb1lhp",
                  "author": "Tasty-Traffic-680",
                  "body": "I'm very sorry, you must have accidentally got one of the good ones. Feel free to replace it with any piece of shit made by Hamilton Beach at your convenience. /s\n\n Tbh, I think the biggest issue is I buy shitty electric kettles. however even the last one I spent more money on barely lasted a few years before getting a flaky connection with the base. No matter, I gave up most caffeine anyway.",
                  "score": 1,
                  "created_utc": 1731185531.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lw9g29m",
              "author": "nopersonality85",
              "body": "I’ll ever forget plugging in my trimmer on a cruise ship where you can change voltage and it sounded like a lawn mower.",
              "score": 3,
              "created_utc": 1731166937.0,
              "replies": []
            },
            {
              "id": "lwah7hq",
              "author": "TooStrangeForWeird",
              "body": "The 240v ones usually still use high amps. They usually max out at 1500 watts, but in 240v countries they can be 3000.",
              "score": 2,
              "created_utc": 1731178899.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwdsex8",
          "author": "WolfyCat",
          "body": "I've had 3 kettles break in 10 years. Averaging 3.3 years per kettle feels wrong because I remember as a kid we had a kettle for many more years or at least it certainly feels like that. \n\nWe live in a reasonably softish water area in Yorkshire too.",
          "score": 2,
          "created_utc": 1731225934.0,
          "replies": [
            {
              "id": "lwdzgm4",
              "author": "NobleRotter",
              "body": "Maybe it's the timescale holding ours together.\n\nOur current kettle was a cheap Amazon purchase in 2015. It's still fine but the timescale splashes make it look grubby.",
              "score": 2,
              "created_utc": 1731230591.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw9gvn0",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1731167209.0,
          "replies": [
            {
              "id": "lw9idjs",
              "author": "NobleRotter",
              "body": "We do the full on descale frequently plus scale catches inside (honestly, water is mad hard here). It keeps the inside under control but the whole spout gets encrusted and the outside just looks shitty after a while. Those bits are hard to Keep under control. \n\nI might add a softener on the mains in",
              "score": 3,
              "created_utc": 1731167708.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwa9js8",
          "author": "boykinsir",
          "body": "Boil vinegar in it every 3 months or so.  Takes the scale right off.",
          "score": 1,
          "created_utc": 1731176451.0,
          "replies": [
            {
              "id": "lwb6alz",
              "author": "NobleRotter",
              "body": "We do. Scale catchers are also great preventatives. It doesn't stop build up around the spout though.",
              "score": 1,
              "created_utc": 1731187082.0,
              "replies": [
                {
                  "id": "lxhvqr4",
                  "author": "boykinsir",
                  "body": "Acid.  Baggie.  Rubber band. Prop kettle so the baggie stays full while the rubber band holds it on.  Alternatively use a bottle brush that fits the spout weekly.",
                  "score": 1,
                  "created_utc": 1731793167.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lwbwd90",
          "author": "Chrunchyhobo",
          "body": ">Not sure I've ever had a kettle break though. Living Inna hard water area they just eventually turn to stone\n\nI present to you the Burco 4L Catering Kettle.\n\nI've had two of the heaps of shit melt their own C13 plug.",
          "score": 1,
          "created_utc": 1731196029.0,
          "replies": []
        },
        {
          "id": "lwaoivk",
          "author": "BlastFX2",
          "body": "It's a render. **If** it ever gets made - which I doubt, because kettles breaking really isn't an issue - It will probably not look quite like that.",
          "score": 0,
          "created_utc": 1731181248.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw9g8ei",
      "author": "Plank_With_A_Nail_In",
      "body": "So \"repairing\" is unscrewing the entire heating element and fully replacing it. I'm sure the replacement part won't cost more than the full kettle.\n\nKettles aren't exactly complicated high technology its just a heating element and a heat controlled switch, I can't remember the last time one actually broke on me.",
      "score": 211,
      "created_utc": 1731166994.0,
      "replies": [
        {
          "id": "lw9ozvd",
          "author": "Thread_water",
          "body": "If you buy the absolute dirt cheap ones then yes they break. We had two or three break on us and then went and bought one that was just a little more expensive and it's still going strong a few years later.",
          "score": 49,
          "created_utc": 1731169881.0,
          "replies": [
            {
              "id": "lw9xi2c",
              "author": "READMYSHIT",
              "body": "I worked in a call center where 400 staff used the same kettle all day every day. We went through the cheapest kettles almost every two weeks. The company did not give a shit to provide proper facilities though, because inevitably staff would be without a kettle and someone would just go buy another cheap one from their own pocket.",
              "score": 13,
              "created_utc": 1731172612.0,
              "replies": [
                {
                  "id": "lwaetum",
                  "author": "MINKIN2",
                  "body": "400 people and one kettle? Did no one ever consider a tea urn?",
                  "score": 15,
                  "created_utc": 1731178128.0,
                  "replies": [
                    {
                      "id": "lwb123p",
                      "author": "READMYSHIT",
                      "body": "Did I mention it was a call center?",
                      "score": 8,
                      "created_utc": 1731185357.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwao1zg",
              "author": "None",
              "body": "The dirt cheap ones last forever if you live in a soft water area, the reason they break most of the time is hard water (with no descaling) or abuse (as in smashing them).\n\nI've seen £5 supermarket brand/argos (cookworks iirc?) kettles 15-20 years old in factories still going strong. Hell I've seen a few 80s swan kettles knocking about.",
              "score": 20,
              "created_utc": 1731181099.0,
              "replies": []
            },
            {
              "id": "lwe2o2m",
              "author": "unepmloyed_boi",
              "body": "Been using a $8 kettle for 11years. Everyone who's house i've visited have been using cheap kmart/target kettles for years. As others have said the electronics within them are not that complicated and there's not much to fail.",
              "score": 3,
              "created_utc": 1731232759.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwbgz1t",
          "author": "glytxh",
          "body": "My 8.99 kettle has lasted me 7 years so far, and I’d be willing to bet I could replace it three times over for the price of a product like this. \n\nHigher manufacturing costs, and I really doubt they have scale on their side. \n\nI’d very much like to be wrong though. I’d love products like this if they became a standard.",
          "score": 8,
          "created_utc": 1731190622.0,
          "replies": []
        },
        {
          "id": "lwb5qv4",
          "author": "JBWalker1",
          "body": "",
          "score": 5,
          "created_utc": 1731186899.0,
          "replies": [
            {
              "id": "lwerfco",
              "author": "ICC-u",
              "body": ">I feel like people give away their old kettles\n\nWho are they giving them away to? Kettles start at about £10, it's one of the cheapest and most common kitchen items. I don't know anyone who doesn't own one, and if I did, how would they make tea when I visit!",
              "score": 1,
              "created_utc": 1731246466.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lw9b5oh",
      "author": "Pitoucc",
      "body": "Most kettles are already repairable. The main problem is sourcing parts.",
      "score": 87,
      "created_utc": 1731165271.0,
      "replies": [
        {
          "id": "lw9skfd",
          "author": "Hendlton",
          "body": "That's the problem for pretty much everything. It would be nice if manufacturers provided a spec sheet or something so you can order parts directly from China. I've thrown away countless things after blindly guessing what to order and never receiving quite the right part. But when something costs $200-300 to buy new, it's worth a couple blind guesses at like $20 a piece.",
          "score": 22,
          "created_utc": 1731171027.0,
          "replies": [
            {
              "id": "lwa1v2h",
              "author": "Pitoucc",
              "body": "Be there with some cameras before. I eventually found the same model but broken and was able to harvest the replacement parts. If it wasn’t for that it would have been 400 camera in the trash.",
              "score": 4,
              "created_utc": 1731174010.0,
              "replies": []
            },
            {
              "id": "lwdzy6z",
              "author": "IntrinsicGiraffe",
              "body": "That's why some folks aim for open-source and why patents are a pain.",
              "score": 1,
              "created_utc": 1731230920.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwa3azi",
          "author": "None",
          "body": "And that the parts are about as much as a new one.\n\nI ain't spending time ordering parts, waiting a week for delivery and then doing the work of replacing the part (assuming I diagnosed the problem correctly) to save a dollar.",
          "score": 9,
          "created_utc": 1731174467.0,
          "replies": [
            {
              "id": "lwang6f",
              "author": "BlastFX2",
              "body": "I would. Hell, I'm willing to spend *more* to fix things because I hate waste. Problem is, spare parts are often just not sold at all.",
              "score": 1,
              "created_utc": 1731180904.0,
              "replies": []
            },
            {
              "id": "lwa5ecd",
              "author": "Yodiddlyyo",
              "body": "And that's the problem. People like you are why our landfills are filled with electronics. Because you'd rather put plastic in a landfill than be minorly inconvenienced for a few days.",
              "score": -11,
              "created_utc": 1731175127.0,
              "replies": [
                {
                  "id": "lwafxy1",
                  "author": "__dontpanic__",
                  "body": "The problem is that most parts aren't easily accessible, and even if they can be obtained, you need additional tools and skills to properly repair the product. So that puts it out of reach for most. The other alternative is to pay someone to do the repairs, but that often ends up costing the same as buying a whole new unit with a brand new warranty. Unless manufacturers make repairs easier and cheaper, the convenience and economics for the end user will never stack up.\n\nThe only way I could conceivably see things changing is if governments regulate repairability or place a levy or tax on products that don't meet repairablity standards (which would hopefully make repairable products cheaper or more attractive to consumers than non-repairable ones). The free market on its own will never solve this problem.",
                  "score": 9,
                  "created_utc": 1731178489.0,
                  "replies": [
                    {
                      "id": "lwbd49q",
                      "author": "Yodiddlyyo",
                      "body": "Right, that's a problem.",
                      "score": 1,
                      "created_utc": 1731189323.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lwaaflq",
                  "author": "boykinsir",
                  "body": "Yo, right there's the problem. Instead of opening up a repair shop to combat the problem, you get on the internet from mommies basement and keyboard warrior it trying to transfer your depeession to others.",
                  "score": 0,
                  "created_utc": 1731176734.0,
                  "replies": [
                    {
                      "id": "lwbd1ia",
                      "author": "Yodiddlyyo",
                      "body": "Our culture of throwing away plastic instead of reusing or repairing it is a common, well understood problem that has caused pollution and tons of plastic in our ocean. Not sure how that offends you enough to try to badly insult a stranger.",
                      "score": 1,
                      "created_utc": 1731189298.0,
                      "replies": [
                        {
                          "id": "lxhv4iw",
                          "author": "boykinsir",
                          "body": "Be the fix to the problem if you care that much.  Don't be a cranky baby about it.",
                          "score": 1,
                          "created_utc": 1731792962.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwb3roa",
          "author": "Significant_Sign",
          "body": "I saved up and bought a Dualit after 3 Hamilton Beach kettle died in four years. It cost the same as 2.5 HB kettles. It's repairable and I can source the parts from Dualit or send it to them to fix. Plus, it's actually made by Dualit employees in England, not some contracted mystery factory elsewhere that will never get their reputation or sales dinged from too much shoddy work.\n\nSo far I am really enjoying it. It's very fast even though I live in America and use the weak electricity, and has the most stainless steel interior I could find.",
          "score": 1,
          "created_utc": 1731186243.0,
          "replies": []
        },
        {
          "id": "lwbj9md",
          "author": "Malawi_no",
          "body": "And it's likely not the heating element, but some plastic thingy.",
          "score": 1,
          "created_utc": 1731191409.0,
          "replies": []
        },
        {
          "id": "lwfpso5",
          "author": "realcoray",
          "body": "There isn’t much to them but this was my experience.  The cheap ones have an inline fuse that blows and good luck finding and replacing it.",
          "score": 1,
          "created_utc": 1731258205.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw9f2c9",
      "author": "In-All-Unseriousness",
      "body": "I recently fixed my soundbar by ordering and replacing a part that cost 50 cents. I nearly threw it out but decided to check youtube out of curiosity. Now imagine millions of appliances that are thrown out that could probably be repaired just as easily.",
      "score": 22,
      "created_utc": 1731166602.0,
      "replies": [
        {
          "id": "lwa7ssv",
          "author": "awkwardwatch",
          "body": "iFixit and YouTube tutorials also repaired some of my precious things. Like the infamous Logitech spotlight and my fitness tracker that had a dead battery also a switch controller where the joystick had continuous drift. \nRepairing is a lot of fun once you get the hang of it!",
          "score": 5,
          "created_utc": 1731175891.0,
          "replies": []
        },
        {
          "id": "lwc17l9",
          "author": "Present-Perception77",
          "body": "I was just watching a YouTube video on fixing batteries for cordless tools!! I am livid! You just have to basically jump start it to get it to communicate with the charger dock .. took 2 seconds.. I just threw away a whole vacuum cleaner because I couldn’t find a replacement battery.. it was only 2 yrs old. 🤬",
          "score": 1,
          "created_utc": 1731197742.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw9yroq",
      "author": "None",
      "body": "[deleted]",
      "score": 27,
      "created_utc": 1731173019.0,
      "replies": [
        {
          "id": "lwc1nvy",
          "author": "Present-Perception77",
          "body": "Yes! And this is why things are basically disposable now.",
          "score": 2,
          "created_utc": 1731197904.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwaaaj5",
      "author": "whk1992",
      "body": "A $15 UL-listed kettle lasts a decade easily. What’s the student smoking in the UK these days?",
      "score": 9,
      "created_utc": 1731176689.0,
      "replies": []
    },
    {
      "id": "lwa5rqc",
      "author": "MaguroSushiPlease",
      "body": "Feels like Greenwashing. I bet the part costs as much as buying a whole new kettle from Costco. There are so many other ways to help the environment…like eating Billionaires.",
      "score": 15,
      "created_utc": 1731175245.0,
      "replies": [
        {
          "id": "lwa92kp",
          "author": "boykinsir",
          "body": "For people who advocate cannibalism.  Volunteer to your cult first.",
          "score": -4,
          "created_utc": 1731176298.0,
          "replies": [
            {
              "id": "lwam29y",
              "author": "TooStrangeForWeird",
              "body": "Kinda doubt they're a billionaire though.",
              "score": 4,
              "created_utc": 1731180463.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwa9ru3",
      "author": "Qui-gone_gin",
      "body": "Or you could just get a regular metal one and never have to worry about creating extra waste. It may take slightly longer but they never don't work",
      "score": 6,
      "created_utc": 1731176523.0,
      "replies": []
    },
    {
      "id": "lw9a2re",
      "author": "GeneralCommand4459",
      "body": "Just need the button to last more than 12 months. Every kettle I’ve bought the plastic on/off button breaks around the same time and the kettle is useless.",
      "score": 13,
      "created_utc": 1731164892.0,
      "replies": [
        {
          "id": "lw9gy3c",
          "author": "Jack123610",
          "body": "The saying is if you use something enough to break it then buy a quality one.",
          "score": 11,
          "created_utc": 1731167232.0,
          "replies": [
            {
              "id": "lw9jkw8",
              "author": "GeneralCommand4459",
              "body": "The one that has lasted the longest is actually the cheapest one I bought.",
              "score": 3,
              "created_utc": 1731168108.0,
              "replies": [
                {
                  "id": "lwaeukd",
                  "author": "None",
                  "body": "Yeah the problem is \"more expensive\" doesn't always mean better quality, my first kettle was cheap and broke in 2 years, second kettle was expensive but also broke in 2 years, the third time I bought a Braun kettle and it's still going strong after 10 years.",
                  "score": 3,
                  "created_utc": 1731178135.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lw9o5lt",
              "author": "SmashingK",
              "body": "The problem with kettles is almost all of them get made by the same company. They get branded for each name brand you see in the stores.\n\nApparently they have a bunch of prototype designs made each year. All the brands go round to look and choose which one they want and put in orders.\n\nI can't remember which brand actually produces its own kettles.",
              "score": 2,
              "created_utc": 1731169610.0,
              "replies": [
                {
                  "id": "lwbhwuf",
                  "author": "alchemy3083",
                  "body": "Protip: get the UL listing number for the product.  (On the product, on the box, on the user manual, or on request from the manufacturer.)  When two products have the same number, they're rebrands of the same design and manufacturing process.  Also, if you look up the number on the UL website, you can see if it's made by a manufacturer under its own name or if it's just a branded generic design.\n\nRebrands aren't always terrible - oftentimes the thing you're buying works the same dirt-cheap or top-of-the-line.  I have a stick vac that at least 10 companies rebrand, and the quality is plenty sufficient for its normal use.\n\nBut anything that gets really really hot on purpose is clearly a product you want a high level of accountability on!",
                  "score": 1,
                  "created_utc": 1731190943.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lw9clbm",
          "author": "lurkindasub",
          "body": "Try Philips HD9359/90R1, it's very durable and you can set temperature it'll stop at and also set it to keep that temperature until you're ready. Quite nifty.",
          "score": 2,
          "created_utc": 1731165764.0,
          "replies": []
        },
        {
          "id": "lw9gimw",
          "author": "Plank_With_A_Nail_In",
          "body": "I been using the same kettle for 12 years, maybe don't buy the cheapest one next time? Lol have you really had 12 kettles in the time I have had one? If you had spent £100 on it you would still be up in terms of money. \n\nhttps://www.amazon.co.uk/Russell-Hobbs-Snowdon-Kettle-20441/dp/B00FQJGRX4?crid=D2ZZXURWYXXT&dib=eyJ2IjoiMSJ9.5JuClm_EZLsc7SUbHy6xAHHJXTe-uzln9jEzKwfu6mINMhuQnYCzOuwpDMElP3ruzCUne4H5AApPBW3tdJlSLUPGEC3r8H-xiw1cRDIJV0vH-jWYniyBb6vWnGGV8hKNXTiw90Zrwa0n3xrpxfzMUOhHJfeE6eHg0kmjX-gHTJHo9AwAxR_mLnKUcdNTbUFUBbDwowr-y2kpEoW5iwFLKC4IXismEtxxFolC2kTPjuk.jQ3s1Yu7SHqHm2KpyPePwA1hNXsWobmVAM9laa61bsA&dib_tag=se&keywords=russell%2Bhobbs%2Bkettle&nsdOptOutParam=true&qid=1731167199&sprefix=Russle%2Caps%2C97&sr=8-3&th=1\n\nThat's the one I have. \n\nEither your story is bullshit or this is some really Sam Vimes boots stuff.",
          "score": -2,
          "created_utc": 1731167088.0,
          "replies": [
            {
              "id": "lw9nimo",
              "author": "brocollee",
              "body": "Here's a cleaner link for you: https://www.amazon.co.uk/Russell-Hobbs-Snowdon-Kettle-20441/dp/B00FQJGRX4\n\nEverything after the question mark (including it) is only helping Amazon analytics get smarter",
              "score": 9,
              "created_utc": 1731169400.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwad50r",
      "author": "denissRenaulds",
      "body": "This is so silly, a kettle is so simple and doesnt contain any rare or hazardous or expensive materials. The issue with discarded electronics is typically they have batteries which can be bad for the environment or contain rare elements or components which are effectively lost when theyre sent to landfill but a kettle has none of these. If a kettle is thrown away theres no real loss there its made of probably stainless steel and aluminium big whoop.",
      "score": 3,
      "created_utc": 1731177591.0,
      "replies": []
    },
    {
      "id": "lwav9f4",
      "author": "wordfool",
      "body": "Every kettle I've owned that's needed replacing had some mechanical issue, not anything related to electronics. The last one had a busted lid opening mechanism because the manufacturer decided to save 10c and use plastic in a key stress area rather than metal.",
      "score": 4,
      "created_utc": 1731183460.0,
      "replies": []
    },
    {
      "id": "lwcohur",
      "author": "munkijunk",
      "body": "Eh... What? A basic kettle is a bucket, and element and a switch. There's fuck all too it and anyone can fix one with basic tools. This is fucking dumb",
      "score": 4,
      "created_utc": 1731206332.0,
      "replies": []
    },
    {
      "id": "lw9j2da",
      "author": "wumbologist-2",
      "body": "But does it come in 20 colors and a collectable pushed by influencers to then discard when it's not fashionable?",
      "score": 3,
      "created_utc": 1731167938.0,
      "replies": []
    },
    {
      "id": "lwb9okt",
      "author": "None",
      "body": "Kettles always used to be repairable, you undid a nut and the element came out.  All kettles were the same back then though..... then the disposable jug kettle wiped them away in the 90's",
      "score": 3,
      "created_utc": 1731188200.0,
      "replies": []
    },
    {
      "id": "lwc1br7",
      "author": "AlbertFannie",
      "body": "Couldn't we just buy stovetop kettles again?",
      "score": 3,
      "created_utc": 1731197784.0,
      "replies": []
    },
    {
      "id": "lwa6jb3",
      "author": "zorasht",
      "body": "I have had the same kettle for the last 25 years. Tefal VItesse, an unremarkable white plastic thing. The kettle is older than that, I \"inherited it\" from a flat mate I had 25 years ago, and it has been with me since then.\nThe part in worse shape is the filter from where the water leave the kettle.\nSo I didn't even know that the kettle were commonly faulty.",
      "score": 2,
      "created_utc": 1731175488.0,
      "replies": []
    },
    {
      "id": "lwacrr8",
      "author": "PRC_Spy",
      "body": "Hardly a new invention. \n\nMy parents used to have a stainless steel electric kettle with a replaceable element. When it stopped working, you bought a new element. If the cord broke, just buy a new cord. \n\nShops stopped selling the elements when cheap disposable import plastic kettles dropped to a similar price. Then small town hardware stores vanished as well.",
      "score": 2,
      "created_utc": 1731177474.0,
      "replies": []
    },
    {
      "id": "lwb27fi",
      "author": "captaincinders",
      "body": "Designing a repairable kettle is easy.\nWhat is difficult is designing it so it cheaper to buy and repair than it is to buy another one.  And who is going to be stocking these replacement elements for years to come?\nAlso I have never had to replace a kettle because the element broke.  Is is because something mechanical broke or it leaked.\n\nI went to buy a toilet.  One had this feature where the flushing mechanism was easily replaceable.  Great idea no?\nI asked if they had any of the replaceable flushing mechanisms in stock?  Nope.  \nI asked how much the flushing mechanism was to replace.  No idea.\nThey said that I had to get in contact with the manufacturer and they would supply me one.\nYeah right!\n10 years later the cheaper toilet I did buy is still working.  The manufacturer of that replaceable flushing mechanism?  Not a clue if they are even still in business.",
      "score": 2,
      "created_utc": 1731185730.0,
      "replies": []
    },
    {
      "id": "lwb3o8v",
      "author": "captaincinders",
      "body": "I want to lay a bet in three parts.\n\n1.  the cost of the replicable element kettle is much more than a normal kettle.\n\n2.  The cost of the replicable element is as much as a new normal kettle.\n\n3.  In a couple of years the replaceable element will be \"out of stock\".\n\nAnyone wanna give me odds?",
      "score": 2,
      "created_utc": 1731186212.0,
      "replies": []
    },
    {
      "id": "lwb4uz8",
      "author": "Untimely_manners",
      "body": "He fixed what wasn't broke. I've never had an old school kettle break. I had a smart kettle which eventually broke as the glass separated and leaked so I went back to a dumb kettle.",
      "score": 2,
      "created_utc": 1731186604.0,
      "replies": []
    },
    {
      "id": "lwbl9dq",
      "author": "Plastic_Acanthaceae3",
      "body": "Cool design, but stupid article, no one’s kettle has ever broken in the history of kettles",
      "score": 2,
      "created_utc": 1731192093.0,
      "replies": [
        {
          "id": "lwbo59l",
          "author": "triadwarfare",
          "body": "I had a couple of broken kettles. One was I plugged it without water when I was a kid. The other just broke through regular use. Not sure why it got broken but it was no longer working when we plugged it.",
          "score": 1,
          "created_utc": 1731193097.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwbqu7p",
      "author": "iBUYbrokenSUBARUS",
      "body": "Dumb",
      "score": 2,
      "created_utc": 1731194054.0,
      "replies": []
    },
    {
      "id": "lwcct96",
      "author": "senddickslol",
      "body": "aw, oil companies hate them",
      "score": 2,
      "created_utc": 1731201947.0,
      "replies": []
    },
    {
      "id": "lwdcgt7",
      "author": "MrHouse-38",
      "body": "That’s great but a kettle costs about £15 anyway so is the repair point really worth it ??",
      "score": 2,
      "created_utc": 1731216632.0,
      "replies": []
    },
    {
      "id": "lwdns3v",
      "author": "latortillablanca",
      "body": "Have you tested it in front of an undecided American voter, though?",
      "score": 2,
      "created_utc": 1731222995.0,
      "replies": []
    },
    {
      "id": "lwdrgpc",
      "author": "soshield",
      "body": "I’m getting clock boy vibes for some reason. “I invented a replaceable heating coil”",
      "score": 2,
      "created_utc": 1731225329.0,
      "replies": []
    },
    {
      "id": "lxu1aj6",
      "author": "seeking_derangements",
      "body": "I melted my electric kettle on the stove, not everyone can be helped.",
      "score": 2,
      "created_utc": 1731970018.0,
      "replies": []
    },
    {
      "id": "lw98efs",
      "author": "dunder_mifflin_paper",
      "body": "Coincidentally, I made a post about this kind of stuff the other day\n\n\n\nBuild like they used to…. https://reddit.com/r/BuyItForLife/comments/1gi95qj/build_like_they_used_to/",
      "score": 3,
      "created_utc": 1731164299.0,
      "replies": [
        {
          "id": "lwauehz",
          "author": "None",
          "body": "It'll never work - they already build it like they used to for commercial purposes (or wealthy people).\n\nMost people suffer from the Sam Vimes \"Boots\" theory of socioeconomic unfairness.\n\nThat is who can afford (or risk the opportunity loss) to spend £100 or more now on a kettle that might, with care and an additional £20-50 worth of maintenance last you 25 years, maybe even 50 years (basically for life). Assuming you can even guarantee spare parts for that long.\n\nWhen you can buy a £10 kettle from Argo/Supermarket (£8 in ASDA right now) that lasts 5 years, 10 years if you are lucky - A few years ago I saw a Swan kettle from the 80s still going strong - and they were considered cheap crap at the time also, in a break room that gets boiled 4-5 times a day.\n\nI personally have a stainless steel cookworks kettle I bought in 2005/6 still going strong (descaled it 2 maybe 3 times in that time). I think I also have a £5 white plastic tesco kettle in the garage that would probably work that is older (the cookworks replaced it).\n\nBasically the £12.30 one here: [https://archive.org/details/argos-catalogue-autumm-winter-2007\\_202401/page/n669/mode/2up](https://archive.org/details/argos-catalogue-autumm-winter-2007_202401/page/n669/mode/2up)\n\nIt's all well and good over engineering something so that it might last for decades, but the people who need them can't afford them - and the people that can change their appliances whenever they decorate for the aesthetics.",
          "score": 3,
          "created_utc": 1731183175.0,
          "replies": [
            {
              "id": "lwb0xow",
              "author": "theholyraptor",
              "body": "And ops design isn't really green. It saves some waste but if you're just removing the most expensive parts and tossing those (which are also more negative as waste and in production)  you're saving little. And that replacement module will most likely cost as much as a new one because... it's the more expensive costly parts.",
              "score": 2,
              "created_utc": 1731185317.0,
              "replies": [
                {
                  "id": "lwbr7p1",
                  "author": "Malawi_no",
                  "body": "What might be a nice idea, would be if you could buy the kettle itself a little cheaper without the base/wire.  \nTypically it's some plastic thingy in the lid or a button that breaks, while the base is everlasting.",
                  "score": 1,
                  "created_utc": 1731194188.0,
                  "replies": [
                    {
                      "id": "lwbrn28",
                      "author": "theholyraptor",
                      "body": "Buttons are physically connected to the electronics and wouldn't be separate unless it's a switch that has a knob that breaks. Which, while maybe not something any idiot can do, is pretty repairable. It it's a fancier electronic button than you're more screwed.",
                      "score": 2,
                      "created_utc": 1731194343.0,
                      "replies": [
                        {
                          "id": "lwbtnnh",
                          "author": "Malawi_no",
                          "body": "Might have used a wrong word as I was not thinking of an electric button.  \nWhen a kettle have failed me, it's been either the hinge part of the lid that breaks off or some internal thing in the button that opens the lid.",
                          "score": 1,
                          "created_utc": 1731195064.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lwa374y",
      "author": "None",
      "body": "Well that’s my next kettle.",
      "score": 1,
      "created_utc": 1731174433.0,
      "replies": []
    },
    {
      "id": "lwaeix0",
      "author": "MarvinArbit",
      "body": "Looks like it is likely to leak over time if the base just pops off like that. Leaks are what has killed most of my past kettles.",
      "score": 1,
      "created_utc": 1731178030.0,
      "replies": []
    },
    {
      "id": "lwafg72",
      "author": "Alienhaslanded",
      "body": "That's a problem? Those things last decades.",
      "score": 1,
      "created_utc": 1731178329.0,
      "replies": []
    },
    {
      "id": "lwah5nj",
      "author": "ashyjay",
      "body": "With how hard a lot of UK water is which kills a lot of kettles, this is fantastic.",
      "score": 1,
      "created_utc": 1731178882.0,
      "replies": []
    },
    {
      "id": "lwakg3k",
      "author": "KAKYBAC",
      "body": "Laughs in capitalism.",
      "score": 1,
      "created_utc": 1731179944.0,
      "replies": []
    },
    {
      "id": "lwas3ke",
      "author": "kamilman",
      "body": "...and he was never heard from or seen ever again...",
      "score": 1,
      "created_utc": 1731182406.0,
      "replies": []
    },
    {
      "id": "lwaxfd0",
      "author": "Lord_Dreamweaver",
      "body": "Any of the kettle makers could do this. They want it to break and for us to buy new ones",
      "score": 1,
      "created_utc": 1731184173.0,
      "replies": []
    },
    {
      "id": "lwaxfpt",
      "author": "Memes_Haram",
      "body": "My posh Dualit kettle already has a replaceable element.",
      "score": 1,
      "created_utc": 1731184176.0,
      "replies": []
    },
    {
      "id": "lwaxv6w",
      "author": "wizzard419",
      "body": "Love the concept but do kettles not last as long in the UK? I am using mine several times a day here in the US. (Morning beverage, possibly to brew up iced tea during the day and evening tea) and normally they last about 5+ years. I will say getting a water softener and r/O system also helps extend lifespans since the water is is like drinking rocks.\n\nNow all that being said, the idea of self-serviceable appliances is wonderful but I can see a few major unintended issues. The first being that unless they become universal parts then you have the issue of supplies being limited, possibly unsustainable for companies, which then could make the price to fix the kettle more than just buying a new one.\n\nThe other is that this potentially would encourage companies to make their products have shorter lifespans. If they know they will get further sales from you, it would encourage them to get you to that repair point faster. An example of this can be seen in Toyotas with city modes for their engines (when you stop the engine shuts off), once a certain number of starts the car will throw a repair signal for you to take it in even if it's not failing.",
      "score": 1,
      "created_utc": 1731184317.0,
      "replies": []
    },
    {
      "id": "lwbglhn",
      "author": "HaHaEpicForTheWin",
      "body": "Looks like it's made of plastic 🤢",
      "score": 1,
      "created_utc": 1731190492.0,
      "replies": []
    },
    {
      "id": "lwbikp6",
      "author": "dogma4you",
      "body": "While Repairability is important, manufacturers have this technology already. manufactured obsolescence is the problem, not repairability challenges",
      "score": 1,
      "created_utc": 1731191173.0,
      "replies": [
        {
          "id": "lwcbwq2",
          "author": "facest",
          "body": "People also like to own new things, and kettles are in that “I see it every day and it’s not an expensive item” category so they get replaced long before they disintegrate. I’ve never had a kettle break and the only busted up kettles I’ve ever seen have been at work, and those are ancient.\n\nKettles are I guess an easy product to apply this to because of their simple design, but maybe just replacing electric kettles with stovetop kettles if waste is important is a better idea.",
          "score": 1,
          "created_utc": 1731201616.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwbjlcl",
      "author": "DonaldJenkins",
      "body": "Invents is not the right terms here. They should really hire an editor",
      "score": 1,
      "created_utc": 1731191522.0,
      "replies": []
    },
    {
      "id": "lwbkc4o",
      "author": "ZacharyTaylorORR",
      "body": "now no company will make it in large numbers - because if ya sell kettles - making them repairable ain’t in your interest",
      "score": 1,
      "created_utc": 1731191776.0,
      "replies": []
    },
    {
      "id": "lwbm22z",
      "author": "bcyng",
      "body": "How do u repair the plastic pieces that disintegrate?",
      "score": 1,
      "created_utc": 1731192369.0,
      "replies": []
    },
    {
      "id": "lwbm8km",
      "author": "None",
      "body": "Big Kettle won’t like this!",
      "score": 1,
      "created_utc": 1731192431.0,
      "replies": []
    },
    {
      "id": "lwbo8pn",
      "author": "agdnan",
      "body": "Where can I buy one?",
      "score": 1,
      "created_utc": 1731193130.0,
      "replies": []
    },
    {
      "id": "lwbrr98",
      "author": "None",
      "body": "ive never broken a kettle\n\ni just get a new one randomly every few years",
      "score": 1,
      "created_utc": 1731194385.0,
      "replies": []
    },
    {
      "id": "lwcli3s",
      "author": "Darkstool",
      "body": "I'm not sure this was a problem.  The kettle  is not e-waste , it's just regular appliance recycle.",
      "score": 1,
      "created_utc": 1731205165.0,
      "replies": []
    },
    {
      "id": "lwcmv4y",
      "author": "nanfanpancam",
      "body": "I have a ceramic electric kettle from Bella. The inside gasket broke. They offer no replacement part. Very disappointing. Do I throw away and working kettle?",
      "score": 1,
      "created_utc": 1731205694.0,
      "replies": []
    },
    {
      "id": "lwcpcjh",
      "author": "Kflynn1337",
      "body": "I think he slightly over-estimates most people's ability with a screwdriver. I know people who couldn't change a fuse much less repair a kettle.",
      "score": 1,
      "created_utc": 1731206668.0,
      "replies": []
    },
    {
      "id": "lwcw8x3",
      "author": "BlasterPhase",
      "body": "The main problem causing electrical and electronic waste are shareholders. They want bigger numbers every quarter, and making things that last or are repairable goes against this notion.",
      "score": 1,
      "created_utc": 1731209371.0,
      "replies": []
    },
    {
      "id": "lwcx7ti",
      "author": "chance_encounter4u",
      "body": "So he made a coffee pot?",
      "score": 1,
      "created_utc": 1731209768.0,
      "replies": []
    },
    {
      "id": "lwd3qav",
      "author": "bonesnaps",
      "body": "That instructional guide in the article did not explain how to fix the kettle yourself.\n\nSwap a component and send to the manufacturer for refurbishment? What?",
      "score": 1,
      "created_utc": 1731212523.0,
      "replies": []
    },
    {
      "id": "lwdgqhe",
      "author": "tamagotchiassassin",
      "body": "That’s a lot of plastic",
      "score": 1,
      "created_utc": 1731218879.0,
      "replies": []
    },
    {
      "id": "lwdju9c",
      "author": "solidaritystorm",
      "body": "Or we could just produce good that are meant to last rather than break after a year of use. But planned obsolescence pays better for our oligarchs",
      "score": 1,
      "created_utc": 1731220646.0,
      "replies": []
    },
    {
      "id": "lwdte44",
      "author": "wolfiasty",
      "body": "...so that student is actually naive or what ?\n\nElectrical goods are made to artificially break down after some time, usually \"right after\" warranty expires. They are built that way on purpose. UNLESS someone is actually looking after it - cleaning it, DIY servicing etc. Then it tends to work nicely for much longer than intended.\n\n... and kettle? We have one bought for £10 for good 6+ years, and it's been working fine. Ofc we do descale it regularly.\n\nOther thing is producers would not be selling so much stuff if it would be \"built to last\" and they would grow much slower.",
      "score": 1,
      "created_utc": 1731226568.0,
      "replies": []
    },
    {
      "id": "lwe4ywd",
      "author": "jcacedit",
      "body": "Go Wildcats.",
      "score": 1,
      "created_utc": 1731234293.0,
      "replies": []
    },
    {
      "id": "lwehbsz",
      "author": "TheTwinSet02",
      "body": "  It’s a cool design \n\nWhen I first moved out of home, we had these [ceramic electric kettles](https://www.googleadservices.com/pagead/aclk?sa=L&ai=DChcSEwijrsih4tGJAxXAqmYCHajEFDwYABAFGgJzbQ&co=1&gclid=EAIaIQobChMIo67IoeLRiQMVwKpmAh2oxBQ8EAQYAyABEgKyN_D_BwE&cit=EAIaIQobChMIo67IoeLRiQMVwKpmAh2oxBQ8EAQYAyABEgKyN_D_BwE&ei=QqcwZ5H4JqaZ4-EPg5ad-Qg&ohost=www.google.com&cid=CAASkQHkaCHN6u6TFlwe0XbD4eNtunW5N5zMzomhXpPGwEOdbGy9H22GP1pk2RVOPO31s4-PWi6fNyn4Si9vHaXOsKGWjyYMkoIXARUwepbs5wBLVdR4l0YYLdF8P5GWC2MEifUoGorg1FB8nZ84L0TdiwJJGMPs3R60JilL2ivE8BSs60IPuuBl_gV93OY4KMj_sza_&sig=AOD64_2pJ-m3W-yCOQgqezZq54NSIVtUbw&ctype=5&q=&sqi=2&ved=2ahUKEwiRocKh4tGJAxWmzDgGHQNLJ48Qwg8oAHoECAgQFg&adurl=) with replaceable elements which seems so sensible now",
      "score": 1,
      "created_utc": 1731241823.0,
      "replies": []
    },
    {
      "id": "lwf0bco",
      "author": "fullautohotdog",
      "body": "… my electric kettle is from 1975. Unless you throw it, it won’t break.",
      "score": 1,
      "created_utc": 1731249928.0,
      "replies": []
    },
    {
      "id": "lwf2pif",
      "author": "JollyReading8565",
      "body": "Big teapot when they catch wind of this: \n\n*teen inventor found shot dead in home*",
      "score": 1,
      "created_utc": 1731250764.0,
      "replies": []
    },
    {
      "id": "lwpwviz",
      "author": "allislost77",
      "body": "I “love” how this thread got derailed so quickly on how to clean a kettle…",
      "score": 1,
      "created_utc": 1731399198.0,
      "replies": []
    },
    {
      "id": "lx2dp6y",
      "author": "6femb0y",
      "body": "has anyone ever had a kettle break on them? i just buy the very cheapest one i can find and it works fine, will definitely outlive me",
      "score": 1,
      "created_utc": 1731579315.0,
      "replies": []
    },
    {
      "id": "lw9kbe1",
      "author": "None",
      "body": "Such a dumb niche idea\n\nWill have no impact on discarded consumer electronics.",
      "score": 1,
      "created_utc": 1731168351.0,
      "replies": []
    },
    {
      "id": "lwaae1m",
      "author": "Mysterious-Tie7039",
      "body": "Great until some company buys it and kills it. \n\nPlanned obsolescence and lack of Right to Repair are done by design. \n\nYou won’t keep buying replacement things if they last a long time and/or you can repair them.",
      "score": 1,
      "created_utc": 1731176720.0,
      "replies": [
        {
          "id": "lwavqwe",
          "author": "None",
          "body": "No one would buy it to kill it, they won't need to. The price of these would be obscene for the average consumer.\n\nSam Vimes \"Boots\" theory - no one will spend a £100 on a kettle that in 20 (hell even 50) years time they'll (maybe, assuming the company survives) be able to buy replacement parts for for £20? £30? If needed.\n\nNot when they can spend £8 (at Asda rn) to £20 for a kettle that will probably last 5 years, with luck 10.\n\nOnly wealthy people would to feel good about themselves - and even then they'd replace it the next time they decorated the kitchen and it no longer matched.",
          "score": 2,
          "created_utc": 1731183622.0,
          "replies": []
        },
        {
          "id": "lwb2hnf",
          "author": "theholyraptor",
          "body": "Are they done by design... a little bit. But it's not the grand conspiracy people love to think. Most people want cheap products. To hit that level of cheapness designs make sacrifices.\n\nTake this design. It'll cost a lot. They are replacing pretty much all the expensive components as the \"repair\". So replacement parts will cost almost as much as a new one.\n\nAnd this is for an item that's exceedingly simple in design, mechanically and electrically. A lot of the shitty aspects of electronics for repair is the extreme measures companies go for water proofing and sandwiching the whole product into the smallest form factor possible. People care about bulk on their phones and aesethtics. And electronics are microscopic these days and require highly specialized knowledge and tools to have any hope of repairing.\n\nIs their a subsection of the population that wants more dumb products that would be easier to repair? Sure. But there's many that are either too wealthy, too uninterested or would never attempt repairs. Do you as a manufacture spend millions to tool up a 2nd product sku for the smaller market? Or do you make one that is mostly broadly accepted/purchased?\n\nIt's mostly economics and design limitations and human preferences, not purposeful greed driving these decisions.",
          "score": 0,
          "created_utc": 1731185825.0,
          "replies": [
            {
              "id": "lwb4wlz",
              "author": "Mysterious-Tie7039",
              "body": "You don’t think that companies refusing to sell repair parts and work only being able to be performed by an authorized dealer is done by design?\n\nApple recently specifically designed their glass on their phones to only be replaceable by Apple stores. (IIRC this has since been undone)\n\nAuto dealerships are working towards that same thing, forcing out the honest mom & pop stores. \n\nJohn Deere is purposely making it so farmers are unable to work on their own tractors and instead have to pay for a service tech to come out.",
              "score": 2,
              "created_utc": 1731186619.0,
              "replies": [
                {
                  "id": "lwb5pbr",
                  "author": "theholyraptor",
                  "body": "I would say the vast majority of issues people encounter is not purposefully done.\n\nSure some bad actors exist. \n\nCars have become complex computers driving the complexity and cost of parts to test and fix many things up. Beyond that I don't see too much forcing you to go to a dealer. I've never gone to a dealer for any work and refuse to do so.",
                  "score": 0,
                  "created_utc": 1731186886.0,
                  "replies": []
                },
                {
                  "id": "lwcl4mx",
                  "author": "NextWhiteDeath",
                  "body": "For many companies the cost of having a supply chain for spare parts is very expensive. As now you have to document everything, keep those document up to date, stock the spare parts after the product has been changed or reached end of production.  \nMore then anything for a lot but not all companies it comes down to price. They make stuff that breaks faster because if it is 10% cheaper they sell a lot more of them. The same was having a long and detailed supply chain for post purchase support is expensive.  \nEspecially as often people replace products before they break.",
                  "score": 0,
                  "created_utc": 1731205018.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lw9o9lf",
      "author": "SternLecture",
      "body": "just microwave your water",
      "score": -2,
      "created_utc": 1731169647.0,
      "replies": [
        {
          "id": "lwadg1a",
          "author": "denissRenaulds",
          "body": "Nucleation points make this a somewhat poor idea, also is less convenient when you're making multiple cups of tea",
          "score": 0,
          "created_utc": 1731177686.0,
          "replies": [
            {
              "id": "lwamfa1",
              "author": "TooStrangeForWeird",
              "body": "Throw the teabag in while it's microwaving. You can also do multiple cups at once. Iirc you actually get more of the nutrients doing it this way too.",
              "score": 0,
              "created_utc": 1731180579.0,
              "replies": [
                {
                  "id": "lwaootj",
                  "author": "denissRenaulds",
                  "body": "The nutrients in your average cup of tea are negligable. And maybe you could fit possibly 2 or 3 mugs in the microwave it doesnt match up to the might of the kettle",
                  "score": 1,
                  "created_utc": 1731181300.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lw9p4hm",
      "author": "tiger331",
      "body": "How long before they died with gunshots in the back after falling out of the window",
      "score": -1,
      "created_utc": 1731169921.0,
      "replies": []
    },
    {
      "id": "lw9gvf3",
      "author": "Wheedies",
      "body": "I need a gooseneck though, that kettle is useless for me",
      "score": 0,
      "created_utc": 1731167207.0,
      "replies": []
    },
    {
      "id": "lwcp23u",
      "author": "Pizza_Low",
      "body": "I guess I've never understood the appeal of a kettle. A mug or even Pyrex pitcher in the microwave does the same thing. 2-3 minutes will get a standard mug of water to boiling hot just fine. \n\nNone of the issues with another appliance in the kitchen, or the scale buildup and repeatedly reheating the same water every time you want another glass of hot water.",
      "score": 0,
      "created_utc": 1731206554.0,
      "replies": []
    }
  ]
}