{
  "post": {
    "title": "Meta's Orion AR glasses: \"We start getting into the limits of physics\"",
    "author": "DarthBuzzard",
    "id": "1j46fif",
    "score": 0,
    "created_utc": 1741190588.0,
    "selftext": "",
    "num_comments": 23,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1j46fif/metas_orion_ar_glasses_we_start_getting_into_the/"
  },
  "comments": [
    {
      "id": "mg8husb",
      "author": "MarkZuckerbergsPerm",
      "body": "I prefer my glasses not tainted with an  association with sociopathic, nazi ass kissing tech bros",
      "score": 5,
      "created_utc": 1741216172.0,
      "replies": [
        {
          "id": "mhbz8m8",
          "author": "ghost_of_mr_chicken",
          "body": "That's neat, but what'd you think of the article?",
          "score": 1,
          "created_utc": 1741752608.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mg66x00",
      "author": "TheJasonaut",
      "body": "I’m probably gonna die on the hill that is ‘AR glasses will never be even close to mainstream’.        \n\nUnless there ends up being some unforeseen crazy useful feature, or a niche like the vision impaired, everything seems to make navigating the world overall worse and more dangerous…And I’m someone who thinks VR is pretty cool.",
      "score": 10,
      "created_utc": 1741192955.0,
      "replies": [
        {
          "id": "mgfitoj",
          "author": "enutz777",
          "body": "If you’re looking at the regular world, you’re missing everything. \n\nThen when the next pandemic hits, the AR program will monitor as you clean and any place not cleaned will have a neon glow on others’ glasses with the app. You can’t walk around the world safely without it. Even talking to someone without AR proving they’ve been taking all safety precautions will be dangerous. They’re just glasses to make sure people are safe from a deadly virus, those not using it will be a danger to us all. You will like them, they will make you safe and protected from the dangers you can’t see by letting you see them. \n\nYou’re not one of those selfish people we need to round up in order to protect children and the elderly are you?",
          "score": 3,
          "created_utc": 1741308932.0,
          "replies": [
            {
              "id": "mhiyoxz",
              "author": "cineami",
              "body": "This was an interesting dystopic read, thank you",
              "score": 1,
              "created_utc": 1741848758.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mg7rndk",
          "author": "UboaNoticedYou",
          "body": "I'm of the opinion that AR has a place in industry and few other places. I think people will always be resistant to putting things on their face that they don't need",
          "score": 2,
          "created_utc": 1741208714.0,
          "replies": [
            {
              "id": "mgdcytp",
              "author": "_RADIANTSUN_",
              "body": "Like half the human population needs to put a thing on their face already though... They already wear glasses. Those that don't need to daily, still a lot of them wear sunglasses occasionally. The idea here is for tech to enter the \"glasses space\". Most likely getting prescriptions put in is the easiest part.",
              "score": 3,
              "created_utc": 1741285296.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mg62qnj",
      "author": "phantopia",
      "body": "What would they put in that \"puck\" that won't be integrated in future phones anyway?\n\nBasically everything that can be done with glasses can also be done (maybe less ergonomically so) with a phone. So any special AI Hardware will be build into phones anyway for people who don't want the glasses.",
      "score": 6,
      "created_utc": 1741191767.0,
      "replies": [
        {
          "id": "mg6n9ib",
          "author": "DarthBuzzard",
          "body": "AR is about holographic projection. You can't project 3D holograms with a phone.",
          "score": 1,
          "created_utc": 1741197526.0,
          "replies": [
            {
              "id": "mg78530",
              "author": "HarmlessSnack",
              "body": "No dude, you’re misunderstanding their comment.\n\nWhat they’re saying is “Why build a special Puck-shaped pocket PC (the thing in the article you posted) to handle the *computing* when a current gen iPhone/ Android could likely achieve the same thing with an App?”\n\nHe’s not suggesting the phone would replace the part you wear on your face, just the part that goes in your pocket.  **EDIT:** maybe he is suggesting the phone could just do AR too, that’s actually already a thing so they aren’t wrong.\n\n(Especially since the type of tech-enthusiast that would buy something like this almost certainly already has a high end phone)",
              "score": 4,
              "created_utc": 1741203320.0,
              "replies": [
                {
                  "id": "mg7oqmn",
                  "author": "DarthBuzzard",
                  "body": "Ahh, well in that case, eventually hardware like this could be built into a phone, but as of now this is really expensive custom stuff that would price any phone out of the market. \n\nThe puck does need to exit with these glasses because no phone today could handle the thermal and battery requirements that AR glasses require. Even with this puck you're only getting 2-3 hours of battery life when the end goal really needs to be 8+ hours. If powered by the most efficient phone out there, I'd wager maybe 30 mins at best and then the phone itself is out of battery which would be really inconvenient.",
                  "score": 2,
                  "created_utc": 1741207922.0,
                  "replies": [
                    {
                      "id": "mg86obw",
                      "author": "HarmlessSnack",
                      "body": "It’s really interesting that they’re drawing that much power and the thermal load is so high. \n\nI didn’t see any of those data points mentioned in the article though. Are you pulling from some additional source?",
                      "score": 2,
                      "created_utc": 1741212852.0,
                      "replies": [
                        {
                          "id": "mg87wcu",
                          "author": "DarthBuzzard",
                          "body": "It's talked about more in Meta's blog.\n\nhttps://www.meta.com/blog/orion-compute-puck-reality-labs-next-computing-platform/\n\nhttps://www.meta.com/blog/orion-custom-silicon-chips-ip-blocks-accelerators-ar-algorithms-energy-efficiency-reality-labs\n\nThey've also talked about the constraints of compute for AR glasses in the past.",
                          "score": 3,
                          "created_utc": 1741213199.0,
                          "replies": [
                            {
                              "id": "mg8gkst",
                              "author": "HarmlessSnack",
                              "body": "Thanks! Appreciate the links!",
                              "score": 3,
                              "created_utc": 1741215771.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mge03pr",
                      "author": "phantopia",
                      "body": "Tech like that can only be economically viable, if enough people can use it. So my guess would be that any function that requires this amount of computing power will only be widely used, when it is possible to do so without additional devices. Otherwise anybody who eants to use the AI features though their phone instead of the glasses would need to carry the puck and the connected phone all the time.",
                      "score": 1,
                      "created_utc": 1741291778.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mgdz3af",
                  "author": "phantopia",
                  "body": "Thanks for clarifying. That was exactly what I meant",
                  "score": 1,
                  "created_utc": 1741291492.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mg8jn7t",
      "author": "-domi-",
      "body": "> \"We start getting into the limits of physics\"\n\nThat means nothing. Literally almost every time you're trying to maximize the performance of a piece of electronics, you push up to the limits of physics.",
      "score": 2,
      "created_utc": 1741216738.0,
      "replies": [
        {
          "id": "mg8ublz",
          "author": "DarthBuzzard",
          "body": "In fairness, there is no consumer electronics category that has ever been as deterred by the laws of physics as AR has. It was easier to make the first personal computers, cellphones, etc.",
          "score": 1,
          "created_utc": 1741220460.0,
          "replies": [
            {
              "id": "mg8xzp1",
              "author": "-domi-",
              "body": "[ laughs in perpetual motion patents ]",
              "score": 1,
              "created_utc": 1741221794.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mg61n3r",
      "author": "Incontinento",
      "body": "Fuck Zuck.",
      "score": 4,
      "created_utc": 1741191453.0,
      "replies": [
        {
          "id": "mg80gin",
          "author": "SUPRVLLAN",
          "body": "And his puck.",
          "score": 3,
          "created_utc": 1741211145.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mg5zr9d",
      "author": "RiderLibertas",
      "body": "Not even if they paid me to take them.",
      "score": 2,
      "created_utc": 1741190909.0,
      "replies": []
    }
  ]
}