{
  "post": {
    "title": "Leaked pricing suggests the ROG Xbox Ally X might be the most expensive Xbox console yet, €599 for ROG Ally and €899 for ROG Ally X",
    "author": "Moth_LovesLamp",
    "id": "1lztzlw",
    "score": 1177,
    "created_utc": 1752516937.0,
    "selftext": "",
    "num_comments": 262,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lztzlw/leaked_pricing_suggests_the_rog_xbox_ally_x_might/"
  },
  "comments": [
    {
      "id": "n34asq3",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1752516939.0,
      "replies": []
    },
    {
      "id": "n34i33j",
      "author": "natiahs",
      "body": "The prices that leaked were in euro. Those do not necessarily translate to US prices. For example, PS5 Pro is 799 euro, which is $935 US. But PS5 Pro is not $935 in the US, it is $700. So the leaked prices could be less in USD, the same, or more. We don't know.",
      "score": 229,
      "created_utc": 1752519011.0,
      "replies": [
        {
          "id": "n3526ub",
          "author": "Rusher_vii",
          "body": "And to add european prices generally are inclusive of VAT(aka sales tax and at a rate of around 20%).\n\nHowever even with that a lot of products still tend to have number value parity and my guess is that US pricing will be in the realm of $650 and $850 respectively.",
          "score": 84,
          "created_utc": 1752524774.0,
          "replies": [
            {
              "id": "n3ej8gm",
              "author": "GetFvckedHaha",
              "body": "OLED steam deck is 549.99 in the US. There is no way the ROG Ally X will be 850.00 - the product would be DOA.",
              "score": 7,
              "created_utc": 1752647925.0,
              "replies": [
                {
                  "id": "n3eme36",
                  "author": "Rusher_vii",
                  "body": "I get that it sounds insane but this is the post covid/post ai world where tech is priced at those levels.\n\nHaving thought about it a bit more I wouldn't be the least bit surprised if the ally x drops at 899usd given 10% drop in usd strength since the tariff moves and thats without looking up any specific tariffs that might affect it.\n\nAnd maybe a smaller additional point is the massive increase in brand value bringing microsoft on board, that'll give people a lot more confidence in the build quality department as asus will be shit scared to make microsoft look bad.\n\nedit: steamdeck will still remain king in the price to performance department for at least a few more years",
                  "score": 3,
                  "created_utc": 1752649624.0,
                  "replies": [
                    {
                      "id": "n3jo644",
                      "author": "GetFvckedHaha",
                      "body": "[It’s $799.99 on ASUS estore](https://shop.asus.com/us/rog/90nv00f1-m002f0-rog-ally-x-2024.html) still a bit higher than I expected, thought it would be $749.99",
                      "score": 1,
                      "created_utc": 1752712388.0,
                      "replies": [
                        {
                          "id": "n3ju2nv",
                          "author": "Rusher_vii",
                          "body": "They clearly already been selling at that price point in the enthusiast handheld space.\n\nAnd just incase you missed it thats the 2024 Ally X with the the Z1 extreme chip but these new ones the 2025 models(both xbox variant and asus' own variant) will have the z2 extreme chip and I believe a larger battery.\n\nSo thats where that 900usd range doesnt sound all that far fetched.",
                          "score": 1,
                          "created_utc": 1752714500.0,
                          "replies": [
                            {
                              "id": "n3jwga2",
                              "author": "GetFvckedHaha",
                              "body": "Ok, when i clicked the link on my phone it was for the 2025 Ally X but i see on the top of the page it says “2024” - the Z2 version being 1000.00 won’t even surprise me now.",
                              "score": 1,
                              "created_utc": 1752715354.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n353cgd",
          "author": "chostax-",
          "body": "It’s because Europe has VAT, generally 20%. So remove the sales tax and then convert, that should get the price",
          "score": 24,
          "created_utc": 1752525094.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n34bitq",
      "author": "xanas263",
      "body": "Headline feels pretty misleading considering this is not an xbox console. It is a handheld PC made in collaboration with Xbox. The pricing is inline with the handheld PC market and the pricing is not set by Xbox, but by Asus.",
      "score": 636,
      "created_utc": 1752517141.0,
      "replies": [
        {
          "id": "n34h78h",
          "author": "latestwonder",
          "body": "i mean, the graphic says \"this is an xbox\"... they clearly want you to think it is.",
          "score": 274,
          "created_utc": 1752518763.0,
          "replies": [
            {
              "id": "n36kjog",
              "author": "ThrowRA76234",
              "body": "![gif](giphy|iOm1xOSfAtPzmPXJqH)",
              "score": 31,
              "created_utc": 1752541901.0,
              "replies": []
            },
            {
              "id": "n356nnn",
              "author": "ShepardCommander001",
              "body": "lol, gottem",
              "score": 27,
              "created_utc": 1752526026.0,
              "replies": []
            },
            {
              "id": "n3821tl",
              "author": "joeChump",
              "body": "Kind of, but this has been a marketing campaign for ages because cloud gaming allows multiple devices like Fire TV sticks etc to play Xbox games. You’ll see the title ‘this is an Xbox’ associated with a lot of different products now and they are officially allied. Some people think that Microsoft might ditch the hardware eventually and just have third parties make it.",
              "score": 6,
              "created_utc": 1752565305.0,
              "replies": [
                {
                  "id": "n385fli",
                  "author": "dizietembless",
                  "body": "It feels like it’s  been their marketing campaign ever since they made it one of their points in court that buying actiblizz wasn’t a monopoly move.",
                  "score": 2,
                  "created_utc": 1752567248.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n3898ob",
              "author": "hushpuppi3",
              "body": "When you cater to such casual consumers like this you have to dumb it down like that or they literally will never care or ever see it. Now they have to deal with the direct comparison of their previous console and their new handheld PC. Poor long term planning.",
              "score": 2,
              "created_utc": 1752569570.0,
              "replies": []
            },
            {
              "id": "n392kjd",
              "author": "neoKushan",
              "body": "They also slap that graphic on TV's that cost 2x this, so even by that logic it's _still_ not \"the most expensive Xbox\".",
              "score": 2,
              "created_utc": 1752583387.0,
              "replies": []
            },
            {
              "id": "n38apyo",
              "author": "whatnowwproductions",
              "body": "They call everything an Xbox...",
              "score": 0,
              "created_utc": 1752570448.0,
              "replies": [
                {
                  "id": "n39fcgw",
                  "author": "TehOwn",
                  "body": "My $100 phone is an Xbox.",
                  "score": 1,
                  "created_utc": 1752587625.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n34shkd",
              "author": "WinglyBap",
              "body": "Does it even play Xbox games that were purchased on an Xbox?",
              "score": -28,
              "created_utc": 1752522033.0,
              "replies": [
                {
                  "id": "n34t3qd",
                  "author": "Solregicide",
                  "body": "You can already do that between xbox and pc. It's not every game, but a good number of games you buy on Xbox can be downloaded on pc as well, shared save file and everything.",
                  "score": 29,
                  "created_utc": 1752522211.0,
                  "replies": [
                    {
                      "id": "n35mtmp",
                      "author": "Nobanob",
                      "body": "I have 400 games and 12 of them are play anywhere. You and I have different perspectives on the phrase \"good number of games\"\n\nI'm inclined to call it a woefully low number of games myself. \n\nI bought the first ROG Ally when it came out and when I realized how little of my library I actually had access to, I returned it.",
                      "score": 17,
                      "created_utc": 1752530744.0,
                      "replies": [
                        {
                          "id": "n35q5ke",
                          "author": "_PurpleInk",
                          "body": "Of those 400, how many are series console games, and how many are back compat 360/One games?",
                          "score": 9,
                          "created_utc": 1752531793.0,
                          "replies": [
                            {
                              "id": "n35qzkg",
                              "author": "Nobanob",
                              "body": "Oh a good chunk are both of those, but I don't care. If you're going to sell me a product with \"This is an Xbox\" in bold letters behind it. It better play my entire Xbox library. If it can't, it isn't an Xbox in any way shape or form.\n\nEdit: people seem to forget Xbox set the precedent when the series played everything my Xbox one does. \n\nBe mad the Alloy isn't an Xbox and downvote me all you want. It doesn't change the fact it is literally a PC.",
                              "score": -7,
                              "created_utc": 1752532057.0,
                              "replies": [
                                {
                                  "id": "n36ylv2",
                                  "author": "PM_ME_SOME_ANTS",
                                  "body": "> If it can’t, it isn’t an Xbox in any way shape or form\n\nThe original Xbox can’t play Xbox One games but it’s still an Xbox /j",
                                  "score": 7,
                                  "created_utc": 1752546851.0,
                                  "replies": [
                                    {
                                      "id": "n37292t",
                                      "author": "Nobanob",
                                      "body": "Now that's my kinda humor 🤣",
                                      "score": 0,
                                      "created_utc": 1752548184.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n34wsi2",
                      "author": "WinglyBap",
                      "body": "I had to buy castle crashers again for PC after I sold my Xbox though. £4 I’m not going to get back.",
                      "score": -26,
                      "created_utc": 1752523266.0,
                      "replies": [
                        {
                          "id": "n356f4z",
                          "author": "BeemoBurrito",
                          "body": "So blame the devs",
                          "score": 11,
                          "created_utc": 1752525959.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n34sv9w",
                  "author": "latestwonder",
                  "body": "That's not the point. As far as consumers are concerned, its got xbox on the box.",
                  "score": 3,
                  "created_utc": 1752522144.0,
                  "replies": []
                },
                {
                  "id": "n35ivse",
                  "author": "chyld989",
                  "body": "Not the vast majority, no.",
                  "score": 2,
                  "created_utc": 1752529543.0,
                  "replies": []
                },
                {
                  "id": "n34vjne",
                  "author": "shifty_coder",
                  "body": "Nope. It does not natively play Xbox games. Only streaming through xCloud.",
                  "score": -7,
                  "created_utc": 1752522915.0,
                  "replies": [
                    {
                      "id": "n34wntn",
                      "author": "WinglyBap",
                      "body": "Doesn’t sound like an Xbox.",
                      "score": 6,
                      "created_utc": 1752523229.0,
                      "replies": [
                        {
                          "id": "n35713a",
                          "author": "Clessiah",
                          "body": "Microsoft claimed that anything that can play Xbox games, be it cloud or not, is an Xbox. Yes iPhone is an Xbox. Sure it sounds silly but Microsoft makes the call.\n\n[Source](https://youtu.be/IYBSNQLsBKk?si=e7BPQvK_qdKraN13)",
                          "score": -1,
                          "created_utc": 1752526130.0,
                          "replies": [
                            {
                              "id": "n35ahom",
                              "author": "Justin__D",
                              "body": "Is mayonnaise an Xbox?\n\nNo Patrick, mayonnaise is not an Xbox.",
                              "score": 3,
                              "created_utc": 1752527105.0,
                              "replies": [
                                {
                                  "id": "n35izjj",
                                  "author": "albhed",
                                  "body": "Well if it could play via cloud, it would be.",
                                  "score": 5,
                                  "created_utc": 1752529574.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n34iruq",
          "author": "littlebiped",
          "body": "I mean the marketing is literally “THIS IS AN XBOX” can you blame when the conversations inevitably takes it at face value? Calling it the most expensive Xbox isn’t that egregious in that sense, especially for potential buyers looking for an Xbox capable machine.",
          "score": 109,
          "created_utc": 1752519211.0,
          "replies": [
            {
              "id": "n34ypdw",
              "author": "hyperforms9988",
              "body": "The marketing is literally \"THIS IS AN XBOX\", and this thing literally has Xbox in the name.  To make matters even more confusing, Microsoft's been pretty good about releasing games on both Xbox **and** PC, so the lines of separation between \"Xbox\" and \"PC\" are blurrier than any other moment in Xbox history that I can think of.  I get what the original poster means in essence, but it's also Microsoft's mess that they've created.\n\nXbox is literally in the name... who is going to buy this thing and then come to realize some games that they've purchased for their Xbox Series or whatever aren't going to work on this thing?  I'm not going to research too hard into this because it's Microsoft's mess and I don't feel like sifting through this spaghetti monster that they've created, but as far as I know, if you bought a game on Xbox Series and it supports \"Play Anywhere\", you'll be good.  You bought it, you can play it.  What if a game you bought **doesn't** support \"Play Anywhere\"?  Did you just buy a handheld called an Xbox Ally X and yet it can't play your Xbox game because it's not actually an Xbox even though it's calling itself an Xbox by being called an Xbox Ally X, or is that not a thing and it can play every game that an Xbox Series can play?  How much X could an Xbox box if an Xbox could box Xes?\n\nSo... hilariously enough, the marketing ought to stress to people that \"THIS IS **NOT** AN XBOX\" to avoid confusing and disappointing people into thinking this is an Xbox and therefore all of their Xbox games can be played on this thing.",
              "score": 26,
              "created_utc": 1752523810.0,
              "replies": [
                {
                  "id": "n36ahnv",
                  "author": "Bigbrewski73",
                  "body": "Not arguing your points at all but man we are using the word “literally ” far too often and mostly in the wrong context. Just re read that and subtract that word and tell me you still don’t get your point across clearly",
                  "score": -10,
                  "created_utc": 1752538429.0,
                  "replies": [
                    {
                      "id": "n39ev83",
                      "author": "JustifytheMean",
                      "body": "I think you don't understand how to use \"literally\".  Because they're using it correctly in all the places I see them use it.",
                      "score": 1,
                      "created_utc": 1752587479.0,
                      "replies": [
                        {
                          "id": "n39mwqo",
                          "author": "Bigbrewski73",
                          "body": "It’s not needed at all in his novel of a post he wrote, and again I said I wasn’t arguing against any of his points all of them are valid.  But I also would challenge you to go back and subtract the three or four times he used it and tell me if the you could have gotten to the same point.  I think he could.  Literally is being used as a filler word a lot of times.  “I’m literally talking about the Xbox article” or “OP literally said the same thing you did”. \n\nNow subtract the word literally and those sentences still get the point across clearly.  It’s just a word that has been watered down and everyone uses it as if it is emphasizing their point.",
                          "score": 0,
                          "created_utc": 1752589862.0,
                          "replies": [
                            {
                              "id": "n39o0ax",
                              "author": "JustifytheMean",
                              "body": "He literally didn't say either of the things you said he said.  You literally have no idea what you're talking about.  The marketing slogan is literally \"THIS IS AN XBOX\".  The device literally has Xbox in the name.  I literally never said you were arguing against his points.  I literally think you have no idea what literally means.",
                              "score": 1,
                              "created_utc": 1752590184.0,
                              "replies": [
                                {
                                  "id": "n39ph10",
                                  "author": "Bigbrewski73",
                                  "body": "Those were just examples of the word being used not examples from him, and again you can subtract the 7 times you used it in an effort to talk down to me and I would’ve still understood you brother.  That’s the point I’ve been trying to get across and you proved it perfectly thank you 😊",
                                  "score": 0,
                                  "created_utc": 1752590608.0,
                                  "replies": [
                                    {
                                      "id": "n39q0g3",
                                      "author": "JustifytheMean",
                                      "body": "\"I used an example that is irrelevant to the post I'm complaining about and proved my point!\".....ok bud.",
                                      "score": 2,
                                      "created_utc": 1752590763.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n34kg25",
              "author": "xanas263",
              "body": "That same marketing calls all phones an Xbox too. Are we know going around calling phones Xbox's? I can understand children getting confused, but if you are an adult about to drop potentially $1000 on a product you have no excuse.",
              "score": -25,
              "created_utc": 1752519716.0,
              "replies": [
                {
                  "id": "n34msfp",
                  "author": "littlebiped",
                  "body": "I mean if they made a branded and licensed Xbox phone then yeah I wouldn’t be annoyed or nitpicky if people considered it a part of the Xbox lineup.\n\nIf you don’t think adults don’t get confused more than kids and teens about this stuff there’s a Samsung iPhone VR+ with free WiFi and AI solar battery being sold to your boomer relatives on Marketplace.",
                  "score": 25,
                  "created_utc": 1752520378.0,
                  "replies": [
                    {
                      "id": "n34pnyx",
                      "author": "SoftlySpokenPromises",
                      "body": "Also the whole cluster fuck that was the Wii/Wii U.  That confused a huge amount of people.",
                      "score": 4,
                      "created_utc": 1752521204.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n34brkr",
          "author": "brokenmessiah",
          "body": "Semantics. As far as consumers are concerned it's by Xbox and with Xbox in its name they'll assume it can run Xbox games.",
          "score": 57,
          "created_utc": 1752517209.0,
          "replies": [
            {
              "id": "n34n82o",
              "author": "poofyhairguy",
              "body": "Wait...it doesn't play Xbox games? \n\nI haven't followed this but I assumed with the branding that they ported the Xbox hypervisor to Windows so your Xbox digital library comes over. \n\nIf not what is the point of the branding? Just to ruin any console associations to Xbox?",
              "score": 15,
              "created_utc": 1752520500.0,
              "replies": [
                {
                  "id": "n35xjv2",
                  "author": "pswerve28",
                  "body": "This device will not allow you to play any games that are not currently playable on the existing Ally. You would also have to repurchase some games that are not Play Anywhere if you wanted to play them. \n\nI don’t think it’s super likely that any individual gamer has a huge pile of games to which the above statements apply, but it’s definitely needlessly confusing.",
                  "score": 15,
                  "created_utc": 1752534165.0,
                  "replies": []
                },
                {
                  "id": "n380da4",
                  "author": "kripticdoto",
                  "body": "> If not what is the point of the branding?\n\n\nConfuse consumers.",
                  "score": 7,
                  "created_utc": 1752564350.0,
                  "replies": []
                },
                {
                  "id": "n34spds",
                  "author": "ZZ9ZA",
                  "body": "I mean, this is the same company that killed their “Plays for Sure” DRM scheme after like two years, leaving all existing content unplayable",
                  "score": 2,
                  "created_utc": 1752522097.0,
                  "replies": []
                },
                {
                  "id": "n3aiv2o",
                  "author": "Sonic1899",
                  "body": ">If not what is the point of the branding? Just to ruin any console associations to Xbox?\n\nRemember how Sony stamped \"Playstation\" onto Western Digital SSDs? It's basically the same idea: branding a new ROG Ally for xbox fans.",
                  "score": 1,
                  "created_utc": 1752598771.0,
                  "replies": []
                },
                {
                  "id": "n34q0m0",
                  "author": "AMouthBreather",
                  "body": "I'm not sure why people here or in r/gaming think otherwise.  It's a PC.  Right now all Xbox games are playable on PC through gamepass.  You can also stream most of them.",
                  "score": -7,
                  "created_utc": 1752521305.0,
                  "replies": [
                    {
                      "id": "n34tf59",
                      "author": "poofyhairguy",
                      "body": "Uh, we think that because its called an Xbox. \n\nAnd no not all Xbox games are on Gamepass. Like many of the BC ones aren't.",
                      "score": 4,
                      "created_utc": 1752522303.0,
                      "replies": [
                        {
                          "id": "n396jhc",
                          "author": "A_Flamboyant_Warlock",
                          "body": ">And no not all Xbox games are on Gamepass.\n\nPeople who don't have Gamepass always seem to have this incredibly charitable view of the service.  They don't realise it's got 2-3 good titles, Bethesda's newer titles, games you played 15 years ago, and a shitload of indie pack filler nobody wants to play.  \n\nOnce in a while they give you access to Yakuza for a few months, but most of the time it's just Starfield and Peggle.",
                          "score": 1,
                          "created_utc": 1752584822.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n366efg",
                      "author": "kchristy7911",
                      "body": "No, a bunch of PC games are playable on PC through PC Game Pass, which is a separate service that comes bundled with Game Pass Ultimate. A separate selection of Xbox games are playable through cloud streaming, but there are zero Xbox games that are playable natively anywhere but on an Xbox console.\n\nThis entire device is a half-measure, and it was stupid of Xbox to brand what is functionally the Ally X 2 with the Xbox name, especially because they're rumored to be working on a handheld that can play Xbox games natively.",
                      "score": 2,
                      "created_utc": 1752537037.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n34nxkj",
                  "author": "brokenmessiah",
                  "body": "Million dollar question",
                  "score": 0,
                  "created_utc": 1752520703.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n34gja2",
              "author": "im_thatoneguy",
              "body": "There's already Xbox Anywhere which includes Xbox PC games. So I feel like that ship has already sailed for any possible confusion.",
              "score": 6,
              "created_utc": 1752518574.0,
              "replies": [
                {
                  "id": "n34ibxm",
                  "author": "brokenmessiah",
                  "body": "Average person probably doesn't even know Xbox Anywhere is even a thing. They really only just recently made any noise about it but its been around for 10 years now. I looked at my library, I dont own a single PlayAnywhere title.",
                  "score": 9,
                  "created_utc": 1752519080.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n34cjew",
              "author": "xanas263",
              "body": "If you make purchase decisions based on assumptions, especially expensive ones then you are indeed a fool and will quickly part with your money.",
              "score": -12,
              "created_utc": 1752517426.0,
              "replies": [
                {
                  "id": "n34gv8x",
                  "author": "servermeta_net",
                  "body": "Yet this is how most of the market moves, I bet it's the same for you on topics you don't consider important",
                  "score": 10,
                  "created_utc": 1752518668.0,
                  "replies": [
                    {
                      "id": "n34h7rl",
                      "author": "xanas263",
                      "body": "I don't drop that kind of money on any product without doing pretty thorough research into the product and potential options. If it's like $5, $10 sure, but not $500.",
                      "score": 1,
                      "created_utc": 1752518767.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n34fgz3",
                  "author": "PM_ME_YOUR__INIT__",
                  "body": "Xbox and Asus are counting on that",
                  "score": 20,
                  "created_utc": 1752518266.0,
                  "replies": []
                },
                {
                  "id": "n34n7p1",
                  "author": "hyrumwhite",
                  "body": "There’s a reason advertising is such a big industry. Most people are fools and readily part with their money ",
                  "score": 1,
                  "created_utc": 1752520497.0,
                  "replies": []
                },
                {
                  "id": "n34cpw8",
                  "author": "brokenmessiah",
                  "body": "You're not wrong but this still surely lead to a lot of returns and upset customers with Xbox but I think it's by design.",
                  "score": -8,
                  "created_utc": 1752517476.0,
                  "replies": []
                },
                {
                  "id": "n34hl44",
                  "author": "Groxee",
                  "body": "Do you live under a rock? You see everyone out here living that way, right? Why do you think Mercedes and pick up trucks are so popular?",
                  "score": -1,
                  "created_utc": 1752518871.0,
                  "replies": [
                    {
                      "id": "n34hxi1",
                      "author": "xanas263",
                      "body": "I know very well that there are a lot of fools in the world. That just makes my statement all the more true.",
                      "score": -6,
                      "created_utc": 1752518968.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n37nr55",
          "author": "Banksov",
          "body": "Microsoft are pushing hard that anything the sun touches is an Xbox - so push the “misleading” argument in Microsoft’s direction if you’re going to make one",
          "score": 2,
          "created_utc": 1752557574.0,
          "replies": []
        },
        {
          "id": "n34drsw",
          "author": "ackermann",
          "body": "You can have that Xbox Quest VR headset cheaper than this, I think.  Not sure how their CPU/GPU power compares",
          "score": 6,
          "created_utc": 1752517777.0,
          "replies": [
            {
              "id": "n34kstg",
              "author": "MrNegativ1ty",
              "body": "Does it really even matter? That Quest Xbox edition does NOT play Xbox console games natively, doesn't play PC games natively, it can only stream Xbox games and play quest native games. Meanwhile this can't play Xbox console games natively and can primarily play PC games natively and also stream Xbox games.\n\nYou're basically comparing apples to oranges, despite MS acting like they're the same thing. This whole \"call everything an Xbox\" campaign is one of the dumbest I've ever seen and is only going to confuse people.",
              "score": 7,
              "created_utc": 1752519820.0,
              "replies": [
                {
                  "id": "n35v43k",
                  "author": "Dt2_0",
                  "body": "Wait the Quest Xbox edition doesn't do PC link like a normal Quest????",
                  "score": 3,
                  "created_utc": 1752533379.0,
                  "replies": [
                    {
                      "id": "n38qnme",
                      "author": "hotpuck6",
                      "body": "Pc link isn’t playing games natively on the quest, it’s basically just local streaming from your PC.",
                      "score": 2,
                      "created_utc": 1752578672.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n34eaxo",
              "author": "xanas263",
              "body": ">Xbox Quest VR headset cheaper than this, I think. Not sure how their CPU/GPU power compares\n\nIt doesn't have a CPU/GPU lol. It is purely a streaming device, you stream the games to it from the cloud.",
              "score": -11,
              "created_utc": 1752517929.0,
              "replies": [
                {
                  "id": "n34geuz",
                  "author": "ackermann",
                  "body": "You’re both kinda right.  \n\nXbox games are indeed cloud-only…  but it can play all the VR games in the Quest library, which run standalone on the local device (on your face)  \ncc u/click4dylan",
                  "score": 5,
                  "created_utc": 1752518539.0,
                  "replies": []
                },
                {
                  "id": "n34evtq",
                  "author": "click4dylan",
                  "body": "No it does not. The quest absolutely can play games stand-alone and it can play games streamed from a local or remote pc",
                  "score": 4,
                  "created_utc": 1752518097.0,
                  "replies": [
                    {
                      "id": "n34gje4",
                      "author": "xanas263",
                      "body": "The Meta Quest Xbox edition is connected to Gamepass to allow for streaming of games through XCloud. Xbox doesn't have any VR games, it is meant to be used as a giant screen simulator.",
                      "score": 0,
                      "created_utc": 1752518575.0,
                      "replies": [
                        {
                          "id": "n34if9z",
                          "author": "ibandersnatch_",
                          "body": "It's still just a Quest 3S and can play standalone VR games as well as stream gamepads to a giant virtual screen",
                          "score": 4,
                          "created_utc": 1752519107.0,
                          "replies": []
                        },
                        {
                          "id": "n34hy88",
                          "author": "AuryGlenz",
                          "body": "But it can still play Quest games.",
                          "score": 2,
                          "created_utc": 1752518973.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n34np8y",
                      "author": "oodudeoo",
                      "body": "I think the clarification here is that the Xbox Quest 3S cannot play any XBOX games locally on the hardware. Xbox games can only be streamed via Gamepass Ultimate, whereas you would need to buy games from the meta store to play them locally (Of course that is a completely different library of mostly VR games though).\n\n  \nThe Xbox ROG Ally can play (some) Xbox games locally from the Microsoft store, but a lot of games on the Microsoft store don't have Xbox play anywhere support... So those games would have to be streamed anyways.\n\n  \nNow, I haven't had an Xbox since the 360, but as a consumer, when a company tells me \"this is an Xbox\", I think most people kind of expect that that means that you will be able to play your Xbox games natively on the hardware. Right now we essentially have 3 categories of \"Xbox\".\n\n1. The Actual Xbox consoles that play Xbox games and have backwards compatibility.\n\n2. Streaming devices such as phones that let you stream your Xbox games via Gamepass Ultimate.\n\n3. Windows devices that can do streaming AND play games locally, but the collection of Xbox games you can play locally is haphazard. Just because you bought a game on your Xbox console, it's no guarantee that you won't have to buy it again (THROUGH MICROSOFT BOTH TIMES) to play on your PC. In addition to that, cross-save is a crapshoot.\n\n  \nThere is still a real lack of clarity and simplicity around what it means to be an XBOX and the \"This is an Xbox\" branding really just ignores that. I honestly don't have too many issues with categories 1 and 2 co-existing because the library and save progress is shared. Going forward though, categories 1 and 3 cannot co-exist without major changes. If this is the direction Microsoft is going in, then all future games must be mandated to have cross-buy and cross-save across windows and consoles.\n\nIf this means that all future Xbox consoles will run on a version of Windows so that there only needs to be one version of the game, then so be it, but this needs to be done in such a way that console owners still get a good experience. Backwards compatibility also needs to be thoroughly addressed as there is no way Xbox fans would accept a new console that doesn't allow them to play their back catalogue of OG Xbox -> Xbox Series games.\n\n  \nMicrosoft has the route forward, but there are so many ways they could screw it up and any number of those ways will really damage their brand in the long run so they really need to get their messaging right.",
                      "score": 0,
                      "created_utc": 1752520636.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n34gc0a",
                  "author": "Which-Mix-5378",
                  "body": "It does have a gpu/cpu. Every computer that outputs to a display has a gpu/cpu in some sort of fashion. Also the Quest 3S can run game locally like Beat Saber, It can’t play Xbox games locally.",
                  "score": 2,
                  "created_utc": 1752518516.0,
                  "replies": []
                },
                {
                  "id": "n34frm6",
                  "author": "khan800",
                  "body": "Funny, my Quest has local storage.",
                  "score": 1,
                  "created_utc": 1752518352.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n34mc5g",
          "author": "ArchusKanzaki",
          "body": "Very semantics, but if Steam Deck is a \"console\" because of the UI despite it still have some desktop Linux, then ROG Xbox Ally can probably called \"console\" too. \n\nAlso, the price is decided collaboratively. Its not just ASUS or Xbox that determined it.",
          "score": 4,
          "created_utc": 1752520250.0,
          "replies": [
            {
              "id": "n367flm",
              "author": "kchristy7911",
              "body": "But as it can't play Xbox games natively, it can't be called an Xbox console.",
              "score": 2,
              "created_utc": 1752537384.0,
              "replies": [
                {
                  "id": "n37a8fu",
                  "author": "Any-Appearance2471",
                  "body": "That’s up to Microsoft more than it’s up to anyone else, and they seem to be okay with calling it an Xbox.",
                  "score": 1,
                  "created_utc": 1752551372.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n34izd2",
          "author": "nashvillesecret",
          "body": "What governing body determines what is or is not a console? The version of windows they're running on it is likely a precursor to the OS they'll put on the successor to the series X.",
          "score": 2,
          "created_utc": 1752519275.0,
          "replies": [
            {
              "id": "n3cl41u",
              "author": "SadBBTumblrPizza",
              "body": "Since the original Xbox, all Xboxes have run on modified versions of Windows. This isn't even something that's happening in the future, it happened a quarter of a century ago.",
              "score": 1,
              "created_utc": 1752620155.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n362e5p",
          "author": "Usual-Walrus8385",
          "body": "I don’t think it’s misleading. It’s literally being marketed as an Xbox.",
          "score": 3,
          "created_utc": 1752535727.0,
          "replies": []
        },
        {
          "id": "n394u6r",
          "author": "disposableaccountass",
          "body": "They did a bit of an ally oops",
          "score": 1,
          "created_utc": 1752584246.0,
          "replies": []
        },
        {
          "id": "n34jrl2",
          "author": "ZainTheOne",
          "body": "PC journalism has always been trash",
          "score": 0,
          "created_utc": 1752519514.0,
          "replies": []
        },
        {
          "id": "n3ckl67",
          "author": "SadBBTumblrPizza",
          "body": "This comment is even more misleading. The photo says \"THIS IS AN XBOX\". This is a piece of hardware loaded with a specialized, gaming-focused OS that will be used primarily or solely for playing games (that is what a console is). It's a console, the marketing says \"this is an an xbox\", it's literally an Xbox console by any definition of the words. You're just wrong here.",
          "score": 0,
          "created_utc": 1752619984.0,
          "replies": []
        },
        {
          "id": "n34qhwg",
          "author": "Horvat53",
          "body": "This is an Xbox console, they just decided not to make it themselves to save time/cost/etc.",
          "score": -5,
          "created_utc": 1752521444.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n373v8c",
      "author": "None",
      "body": "I’m not paying damn near a grand for a bloody handheld",
      "score": 8,
      "created_utc": 1752548804.0,
      "replies": []
    },
    {
      "id": "n3824nr",
      "author": "Grytnik",
      "body": "I will just continue to use my steam deck I bought for $350 I guess.",
      "score": 9,
      "created_utc": 1752565350.0,
      "replies": []
    },
    {
      "id": "n38912g",
      "author": "hushpuppi3",
      "body": "They're calling it a console? That's kind of a shame. Definitely changes the expectations of price for the general consumer.\n\nAren't the Ally series basically just handheld PCs? Now with Dedicated Xbox/Gaming OS? And from performance reviews of the Ally X (Non-Xbox version) seem pretty good. They aren't really consoles at all. Only reason is because Xbox and because the Switch is now a 'handheld console'\n\nIn any other world the ROG Ally line is literally a handheld PC so calling it a console and then getting mad that its only slightly more expensive than a different console and not comparing the price to a PC or other handheld PCs seems really disingenuous  imo (or stupid, if Xbox is the one calling it a console)",
      "score": 4,
      "created_utc": 1752569444.0,
      "replies": [
        {
          "id": "n3gm676",
          "author": "ItsLCGaming",
          "body": "Xbox isnt calling it a console. Dumb media clickbait does",
          "score": 1,
          "created_utc": 1752679308.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n34hc6s",
      "author": "LuckyTheBear",
      "body": "So it's not an Xbox when we're talking shit about it, but it's an Xbox when we're talking shit about the price?\n\nI'm just confused, the internet seems to be mixing things up here.",
      "score": 51,
      "created_utc": 1752518801.0,
      "replies": [
        {
          "id": "n37vhkk",
          "author": "Erpverts",
          "body": "I mean it says right there THIS IS AN XBOX. I get what you’re saying but also why people might be confused. Going to be a lot of people confused why it won’t actually play Xbox games they’ve purchased.",
          "score": 7,
          "created_utc": 1752561652.0,
          "replies": []
        },
        {
          "id": "n354l4l",
          "author": "JimmyKillsAlot",
          "body": "People love to hate on the xbox for some reason while ignoring the stuff playstation does; and no one hates Nintendo more than a Nintendo fan.",
          "score": -2,
          "created_utc": 1752525442.0,
          "replies": [
            {
              "id": "n389e9w",
              "author": "hushpuppi3",
              "body": "> and no one hates Nintendo more than a Nintendo fan.\n\nNah",
              "score": 2,
              "created_utc": 1752569662.0,
              "replies": []
            },
            {
              "id": "n3566ug",
              "author": "LuckyTheBear",
              "body": "There's a lot of hate\n\nKeep in mind also that Gamers are often antisocial and use video games to shelter from their bad habits. It's why you can't be a woman and play online without harassment. These people spend their childhood hiding away and by early adulthood they're well on their way to being ... well, capital G Gamers.\n\nThe terminally online kid to incel pipeline is pretty obvious. \n\nI don't even tell people IRL I play video games. It was once my greatest passion, and now it's more of a hobby. I can't handle the communities for the majority of things I enjoy, because again, there's a lot of gatekeeping incels who gatekeep like a motherfucker.",
              "score": 1,
              "created_utc": 1752525894.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n34seh9",
          "author": "CandidBee8695",
          "body": "I’ll just stick with my switch 😮",
          "score": 2,
          "created_utc": 1752522007.0,
          "replies": [
            {
              "id": "n34so3p",
              "author": "LuckyTheBear",
              "body": "Yeah, I don't care much for handheld so my Series X is just fine, thanks.",
              "score": 1,
              "created_utc": 1752522086.0,
              "replies": [
                {
                  "id": "n3520ry",
                  "author": "Wellsargo",
                  "body": "I never cared for the idea of a handheld much either until I was gifted a steam deck. Now I have been converted. Handheld’s are awesome.",
                  "score": 8,
                  "created_utc": 1752524728.0,
                  "replies": [
                    {
                      "id": "n355aau",
                      "author": "LuckyTheBear",
                      "body": "lol did you downvote me?\n\nWTF, Nintendo nerds are lame\n\nI liked my Gameboy Color, I just don't have a lot of moments in my life where I can game but not at my dedicated gaming spot.\n\nSeems like a gimmick to me",
                      "score": -15,
                      "created_utc": 1752525640.0,
                      "replies": [
                        {
                          "id": "n35y6n7",
                          "author": "Wellsargo",
                          "body": "Nope, I did not.",
                          "score": 6,
                          "created_utc": 1752534371.0,
                          "replies": [
                            {
                              "id": "n369e40",
                              "author": "LuckyTheBear",
                              "body": "Honestly I was kind of hoping you had. The idea that you would downvote and then reply with a positive comment like that was deliciously absurd for some reason.",
                              "score": -11,
                              "created_utc": 1752538055.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n34td03",
                  "author": "CandidBee8695",
                  "body": "I’m entering the gaming world for the first time in like 20 years with my switch 2 and realizing that the gaming “community” is a total toxic shitshow.",
                  "score": 9,
                  "created_utc": 1752522285.0,
                  "replies": [
                    {
                      "id": "n34uic6",
                      "author": "LuckyTheBear",
                      "body": "Oh yeah. You're spot on. \n\nI can't even talk about enjoying Xbox or Halo without the community turning it into a war about exclusives or sales or just shit I do not care about.\n\nWhat's your big thing right now? I'm hooked on Age of Mythology ranked 1v1s. I get laughed at for using a controller but I was like 187th in Halo Wars 2 back in 2018 and I tend to do fairly well.\n\nIf I had a Switch 2, I'd probably be going after that new Donkey Kong game.",
                      "score": 9,
                      "created_utc": 1752522619.0,
                      "replies": [
                        {
                          "id": "n35w25i",
                          "author": "Dt2_0",
                          "body": "Oh can I join this casual low sodium gaming conversation?!!!!\n\nI got a Switch 2 on release and right now I've been so busy replaying Switch games that I haven't even looked at Switch 2 games. Replaying Breath of the Wild for the first time in 6 years is so great, the fact that it runs and looks amazing now makes it even better!\n\nOn the other side of the fence I game on PC, but most of those hours have been learning the ins and outs of the 737-600 in Microsoft Flight Simulator.",
                          "score": 2,
                          "created_utc": 1752533682.0,
                          "replies": [
                            {
                              "id": "n368nnp",
                              "author": "LuckyTheBear",
                              "body": "Oh absolutely - get in here bud!  \n  \nI was hoping Nintendo would make the new Switch strong enough to run modern games at 60 frames. \n\nI got the Series X at launch. I had just bought my first 4KTV and I wanted to play at the highest fidelity a console could give me. I've been in the Xbox club since 2002, so obviously the Series X had a lot of traction in my direction, but the biggest appeal to me wasn't anything coming out, it was the fact that everything I was already playing was about to be much better.\n\nEverybody kept talking about how they don't buy new consoles for their old games, but I have multiple generations of old games I still enjoy playing, and will probably continue to do so for generations to come.   \n  \nThe Series X added HDR to Fusion Frenzy LMAO. That's pretty cool. They also have the Xbox version of Morrowind running smooth and sharp, with loading screens that are nearly instant. KOTOR I and II also run well, and these are the original release versions.\n\nLove it. Love it to death. It runs all my old games so well, I can see myself still using the Series X in 10, 15, even 20 years from now.\n\n.. woah, I went on a rant there. I just wanted to let you know you are absolutely justified buying a Switch 2 and enjoying what you already have. People who seek to take away your enjoyment can just stay mad I guess XD",
                              "score": 1,
                              "created_utc": 1752537803.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "n34vh2n",
                          "author": "CandidBee8695",
                          "body": "I’m all over street fighter 6 which is insane. \n\nIm realizing how intense the competitive players are now. I was planning on learning classic controls, but I’ve decided to learn modern instead. I will never be at the level some of these people are, I don’t have the time or energy for it…but the new control scheme has made the game enjoyable. And playing games should be…..FUN?! Maybe I’m out of line.",
                          "score": 2,
                          "created_utc": 1752522895.0,
                          "replies": [
                            {
                              "id": "n34yyaf",
                              "author": "LuckyTheBear",
                              "body": "Out of line. Completely out of line.\n\nXD\n\nMy favorite person to compete against is myself. I hope you continue your enjoyment.\n\nJust noticed your name ends in 8695. Is that your birthday?\n\nMine is 8/6/91\n\nAlso noticed you're a bee. As a bear, let me just say, I am a huge fan of your vomit.",
                              "score": 1,
                              "created_utc": 1752523879.0,
                              "replies": [
                                {
                                  "id": "n34zma3",
                                  "author": "CandidBee8695",
                                  "body": "Nah Reddit made it all up - I’m a bit older than that. And I’ve no opinion on bees, beyond we need them for pollination.",
                                  "score": 1,
                                  "created_utc": 1752524064.0,
                                  "replies": [
                                    {
                                      "id": "n3697vx",
                                      "author": "LuckyTheBear",
                                      "body": "It's now 5PM and I am comfortable saying this post was today's biggest disappointment.\n\nBut I do hope you have had a great day and thank you for having a conversation with me today :3",
                                      "score": 1,
                                      "created_utc": 1752537997.0,
                                      "replies": [
                                        {
                                          "id": "n36cdx5",
                                          "author": "CandidBee8695",
                                          "body": "Well, I’m sorry you feel that way. But it’s a reddit post I wouldn’t put too much stock in it.",
                                          "score": 1,
                                          "created_utc": 1752539077.0,
                                          "replies": [
                                            {
                                              "id": "n36f7vs",
                                              "author": "LuckyTheBear",
                                              "body": "Nah, I'm being silly. We had a good time here, I think.",
                                              "score": 1,
                                              "created_utc": 1752540065.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n389f0p",
              "author": "hushpuppi3",
              "body": "PC",
              "score": -2,
              "created_utc": 1752569674.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n38wqyy",
          "author": "Flipkick661",
          "body": "It just goes to show how easily consumers are fooled by marketing slogans. As an Ally Z1E owner, I never saw this as anything but the next generation of Ally handheld, now with an Xbox sticker slapped on it. This is why the price isn’t a shock to me. PC handhelds have always been on the expensive side, and this one is going to be the most powerful one on the market when it launches. So the way I see it, Microsoft don’t deserve flack for the price, but they certainly don’t deserve the praise of releasing a handheld either, which is what many Xbox fans are claiming. This is an Asus product through and through.",
          "score": 0,
          "created_utc": 1752581150.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n34befi",
      "author": "Fat_cat_syndicate",
      "body": "Microsoft can't name gaming hardware to save their life",
      "score": 99,
      "created_utc": 1752517107.0,
      "replies": [
        {
          "id": "n357vm4",
          "author": "None",
          "body": "[deleted]",
          "score": 7,
          "created_utc": 1752526368.0,
          "replies": [
            {
              "id": "n35ifiu",
              "author": "antpile11",
              "body": "> Almost like that \"ROG\" in the name is the name of the company that owns and makes it.\n\nIt's not. ROG is a line of gaming products by Asus.",
              "score": 27,
              "created_utc": 1752529411.0,
              "replies": []
            },
            {
              "id": "n35iuyh",
              "author": "WillingLake623",
              "body": "Almost like Microsoft is quite literally advertising it as “This is an Xbox”\n\nDid your self righteous masturbatory comment fill the void that’s in your heart?",
              "score": 15,
              "created_utc": 1752529536.0,
              "replies": [
                {
                  "id": "n35qsuq",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -6,
                  "created_utc": 1752531997.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n34brit",
          "author": "None",
          "body": "[deleted]",
          "score": -2,
          "created_utc": 1752517208.0,
          "replies": [
            {
              "id": "n34cbg6",
              "author": "cinderubella",
              "body": "How can a comment be so smug yet so stupid at the same time?\n\n\nEdit: really love that they deleted the 'I'll wait' comment. ",
              "score": 11,
              "created_utc": 1752517364.0,
              "replies": [
                {
                  "id": "n34clvy",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -3,
                  "created_utc": 1752517445.0,
                  "replies": [
                    {
                      "id": "n34dck6",
                      "author": "jamesick",
                      "body": "they're probably on about the X as it likely has nothing to do with xbox. both because both varients are xbox partnered and because the previous models without xbox's partnership also used X.",
                      "score": 6,
                      "created_utc": 1752517655.0,
                      "replies": [
                        {
                          "id": "n34e70c",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 0,
                          "created_utc": 1752517898.0,
                          "replies": [
                            {
                              "id": "n34etvq",
                              "author": "jamesick",
                              "body": "ok but the cheaper model is also 'an xbox you can hold in your hands' but doesn't have the X. the X is just another 'pro' or 'ultra'.",
                              "score": 3,
                              "created_utc": 1752518082.0,
                              "replies": []
                            },
                            {
                              "id": "n34filo",
                              "author": "xixbia",
                              "body": "But it's not an Xbox you can hold in your hands.\n\nIt won't allow you to native Xbox games. It is competing with the Steam Deck, not with Nintendo or Playstation.\n\nIt is a handheld PC, it runs Windows. It simply isn't a handheld Xbox, in any way.",
                              "score": 1,
                              "created_utc": 1752518279.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n368vsw",
      "author": "Sa404",
      "body": "No OLED is a deal breaker for me unfortunately",
      "score": 8,
      "created_utc": 1752537882.0,
      "replies": [
        {
          "id": "n39gx71",
          "author": "TehOwn",
          "body": "This.\n\nAfter using an OLED, it's impossible to go back to LCD.",
          "score": 3,
          "created_utc": 1752588096.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3681u5",
      "author": "Midnight_Oil_",
      "body": "PCGamer doing every they can to rage bait with this huh?",
      "score": 3,
      "created_utc": 1752537595.0,
      "replies": []
    },
    {
      "id": "n36xy3i",
      "author": "Tekthulhu",
      "body": "Lol , how bout no",
      "score": 3,
      "created_utc": 1752546615.0,
      "replies": []
    },
    {
      "id": "n37lezx",
      "author": "Mudcat-69",
      "body": "Remember when people were bent out of shape over the price of Switch2s?  Pepperidge Farms remembers!",
      "score": 3,
      "created_utc": 1752556409.0,
      "replies": []
    },
    {
      "id": "n36nz35",
      "author": "RogueTampon",
      "body": "I shudder at the thought of the gaming industry turning into a monthly subscription people pay for while also being able to finance your console like you can finance an iPhone over 2 years.",
      "score": 4,
      "created_utc": 1752543097.0,
      "replies": [
        {
          "id": "n37wdx7",
          "author": "Neo_Techni",
          "body": "Microsoft tried with the series x. There were payment plans at launch",
          "score": 3,
          "created_utc": 1752562139.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n34bmca",
      "author": "OrganicKeynesianBean",
      "body": "I don’t understand who a €900 handheld is for.\n\nA handheld is supposed to compromise power for price and portability. If I wanted something near €1,000 I’d get a gaming laptop with a better screen.",
      "score": 14,
      "created_utc": 1752517168.0,
      "replies": [
        {
          "id": "n34csin",
          "author": "CanisLupus92",
          "body": "Have you seen gaming laptop prices lately? €1000 barely gets you a 4060, and often those hit ~€1150.",
          "score": 41,
          "created_utc": 1752517497.0,
          "replies": [
            {
              "id": "n34evx2",
              "author": "LetsTwistAga1n",
              "body": "The 4060 still vastly outperforms those handheld iGPUs.",
              "score": 23,
              "created_utc": 1752518098.0,
              "replies": [
                {
                  "id": "n34mz59",
                  "author": "Kyrond",
                  "body": "Show me how you play on a gaming laptop on public transit or on the couch. \n\nWith handheld you sacrifice everything for the portability.",
                  "score": 20,
                  "created_utc": 1752520430.0,
                  "replies": [
                    {
                      "id": "n35eted",
                      "author": "LetsTwistAga1n",
                      "body": "No issues with playing on the couch if your power cable is long enough.\n\nI used to have a Steam Deck and yes, too much is sacrificed there. If you don't limit your options to old(er) games, the experience is just bad. These newer handheld APUs are more powerful but not that much.",
                      "score": -14,
                      "created_utc": 1752528351.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n35w7jh",
                  "author": "justplainndaveCGN",
                  "body": "My guy thinks a 4060 is bad…lol",
                  "score": 0,
                  "created_utc": 1752533730.0,
                  "replies": [
                    {
                      "id": "n381h0b",
                      "author": "MLMrG",
                      "body": "The mobile 4060 in laptops isn’t anything to write home about",
                      "score": 1,
                      "created_utc": 1752564977.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n34n9e8",
          "author": "Disregardskarma",
          "body": "It’s literally the same price as its predecessor",
          "score": 5,
          "created_utc": 1752520510.0,
          "replies": [
            {
              "id": "n39xxpg",
              "author": "PruneJaw",
              "body": "But it has Xbox in the name so we're angry and want it to fail, right?",
              "score": 2,
              "created_utc": 1752592992.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n34d29t",
          "author": "OperatorJo_",
          "body": "Easy. \n\n€900-1000 for early adopters of the niche.\n\n€750 december for those that want to try it out.\n\n€650 in 2 1/2 -3 years for those that now want to try it out and it's still decent hardware. \n\nThis is pricing with time in mind.",
          "score": 6,
          "created_utc": 1752517573.0,
          "replies": [
            {
              "id": "n35f55u",
              "author": "JohnBigBootey",
              "body": "Hopefully. But in console land, they’ve been getting MORE expensive over time. ",
              "score": 3,
              "created_utc": 1752528447.0,
              "replies": [
                {
                  "id": "n373rfn",
                  "author": "JS-87",
                  "body": "Nobody on reddit could handle the switch 2 being $450, and yet this is all somehow justifiable now.",
                  "score": 2,
                  "created_utc": 1752548763.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n34dear",
          "author": "xanas263",
          "body": ">A handheld is supposed to compromise power for price and portability. If I wanted something near €1,000 I’d get a gaming laptop with a better screen.\n\nPortability has inherently a tax on it. You can see this in the laptop market already. If you want a laptop of similar performance to a desktop you will easily be spending an extra $2000+ USD.\n\nA $1000 dollar laptop is basically only going to run indie games and a handful of low graphic multiplayer games. If you want a laptop that runs AA or AAA games with the same performance of a PS5 you are going to be spending at least $1500.",
          "score": 9,
          "created_utc": 1752517668.0,
          "replies": [
            {
              "id": "n3582vg",
              "author": "stoneymcstone420",
              "body": "Historically I had no issues running AAA games on my $1000 6 year old gaming laptop (Lenovo Legion 5). 75 fps @ 1440p 🤷 slightly worse than a PS5 but it was good enough for Destiny 2, BG3, etc.\n\nFor a portable gaming device, this thing looks like a total waste of money compared to a Switch 2, and people were outraged over Nintendo’s $450 USD price tag. I can’t imagine this will sell to anyone but hxc xbox fans.",
              "score": -5,
              "created_utc": 1752526424.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n34e6mf",
          "author": "jamesick",
          "body": "\"this thing doesnt fit my needs so it must fit no ones\" a handheld isn't supposed to do anything other than be a handheld. a laptop and a handheld are entirely different form factors, laptops are also notoriously poorly built for the most part, lenovo's legon laptops may be the only ones which have a favourable history. cheaper handheld pc's exist, if you have the money then why settle for a cheaper option if you can afford a more luxorious product?",
          "score": 8,
          "created_utc": 1752517895.0,
          "replies": []
        },
        {
          "id": "n37im6i",
          "author": "Saratje",
          "body": "Daily commuters in example. Aside from two hands a laptop needs a, well, lap. A handheld can simply be held anywhere, standing or sitting down. It's more portable too.",
          "score": 2,
          "created_utc": 1752555070.0,
          "replies": []
        },
        {
          "id": "n34hf4r",
          "author": "knowshon",
          "body": "Turns out there's a market for different price brackets on the handheld space. The ultra low end is covered by cheap Chinese machines that do retro game emulation, the mid tier is the switch and subsidized machines like the steam deck, but the high end space is still big enough for these types of high-spec'd windows handhelds. These are big, but gaming laptops are way bigger and heavier.",
          "score": 2,
          "created_utc": 1752518825.0,
          "replies": [
            {
              "id": "n34ie3e",
              "author": "ZainTheOne",
              "body": "Steam deck is subsidized?",
              "score": 0,
              "created_utc": 1752519098.0,
              "replies": [
                {
                  "id": "n35ufw3",
                  "author": "Edmundyoulittle",
                  "body": "For some reason people have it in their head that the steam deck is an amazing deal when it lands right in line with the rest of the market when you actually compare",
                  "score": -1,
                  "created_utc": 1752533164.0,
                  "replies": [
                    {
                      "id": "n36a5c3",
                      "author": "kchristy7911",
                      "body": "There's $200 between the cheapest SteamDeck and the cheapest *any other reputable SteamOS or Windows handheld*. That's not really in line.",
                      "score": 1,
                      "created_utc": 1752538312.0,
                      "replies": [
                        {
                          "id": "n36csav",
                          "author": "Edmundyoulittle",
                          "body": "When you compare what they offer in terms of hardware it's very much in line.\n\nThe $400 steamdeck has a pretty bad screen and is less powerful than other PC handhelds. It only covers like 76% of the sRGB standard iirc",
                          "score": 0,
                          "created_utc": 1752539213.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n34jisw",
          "author": "CDMzLegend",
          "body": "a handheld the same price as some flagship phones",
          "score": 1,
          "created_utc": 1752519444.0,
          "replies": []
        },
        {
          "id": "n34mvkj",
          "author": "OneSeaworthiness7768",
          "body": "Convenience has always come at a premium.",
          "score": 1,
          "created_utc": 1752520403.0,
          "replies": []
        },
        {
          "id": "n34papl",
          "author": "Raven123x",
          "body": "I mean if I had a handheld that could play elden ring and resident evil 4 remake without any performance drops I’d be willing to drop £1000 on it\n\nBut I’m aware that I’ll need to wait a few more years before a handheld of that quality comes out",
          "score": 1,
          "created_utc": 1752521098.0,
          "replies": []
        },
        {
          "id": "n34pyc4",
          "author": "GuerrillaApe",
          "body": "For some people $900 just isn't a lot of money.  That group of people is definitely small though, given that the Switch 2 will probably eclipse the sale of all major PC handhelds within the first year of its release.",
          "score": 1,
          "created_utc": 1752521287.0,
          "replies": []
        },
        {
          "id": "n34hqlc",
          "author": "latestwonder",
          "body": "\"A handheld is supposed to compromise power for price and portability.\" \n\nSays who?",
          "score": 0,
          "created_utc": 1752518914.0,
          "replies": []
        },
        {
          "id": "n34m89b",
          "author": "TherapyPsychonaut",
          "body": "So what you would want is a steam deck",
          "score": -2,
          "created_utc": 1752520219.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n36uqm1",
      "author": "chrisbrownbeard",
      "body": "The what?",
      "score": 2,
      "created_utc": 1752545465.0,
      "replies": []
    },
    {
      "id": "n3984h4",
      "author": "GarbageThrown",
      "body": "I mean… it looks to be no less of a console than the switch is. But why do this this way? MS decisions around this are baffling. They have a consumer base that would purchase a new console. And Sony needs a competitor in that space otherwise their monopoly on the console market would skyrocket prices and negatively impact device quality.",
      "score": 2,
      "created_utc": 1752585346.0,
      "replies": []
    },
    {
      "id": "n3aluav",
      "author": "i__hate__stairs",
      "body": "Did everyone forget about the tarrifs?  This was always going to cost more than it needs to.",
      "score": 2,
      "created_utc": 1752599575.0,
      "replies": []
    },
    {
      "id": "n3c287e",
      "author": "MidnightFireHuntress",
      "body": "God DAMN! \n\nAND YOU GUYS COMPLAINED ABOUT THE SWITCH 2 BEING EXPENSIVE LOL",
      "score": 2,
      "created_utc": 1752614160.0,
      "replies": []
    },
    {
      "id": "n34k1xc",
      "author": "Lawgamer411",
      "body": "I mean is it not the price of a pc + a solid 120 hz monitor? \n\nI still wouldn’t buy it but seems fair",
      "score": 3,
      "created_utc": 1752519598.0,
      "replies": [
        {
          "id": "n38hqn3",
          "author": "volticizer",
          "body": "People are losing their minds but when you actually think about what's in there it is not as bad as it seems. People can compare it to the steam deck but you gotta remember, the steam deck is older hardware, it's not got the same performance, it's not got gamepass, it's not running windows. Like yeah, no shit it's cheaper. Sure the deck is better value but if you want the best handheld performance you pay a premium, that's how it works in every consumer market in the world. You pay an extra 50% for the last 10% performance gain. Be it PC, console, cars, bikes, shoes, even consumable goods. literally everything.",
          "score": 1,
          "created_utc": 1752574405.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n36p2lm",
      "author": "zomboscott",
      "body": "It's not a console.",
      "score": 3,
      "created_utc": 1752543483.0,
      "replies": []
    },
    {
      "id": "n36ksu0",
      "author": "Pizza_Low",
      "body": "The price difference between a gaming console and a home PC is rapidly closing. So much for the days of a console being an inexpensive way to play video games. I know we can argue about specs or how you can home brew a better system yourself. Or that some other prefab company has a better product, the point is the price difference these days isn't what it used to be. \n\nPS5 Pro for $700\nhttps://www.bestbuy.com/site/playstation-5-pro-console-playstation-5/6601524.p?skuId=6601524\n\nDell G15 Laptop for $600\nhttps://www.dell.com/en-us/shop/dell-laptops/g15-gaming-laptop/spd/g-series-15-5530-laptop\n\nDell Alienware Aurora for $1250\nhttps://www.dell.com/en-us/shop/cty/pdp/spd/alienware-aurora-act1250-gaming-desktop",
      "score": 3,
      "created_utc": 1752541989.0,
      "replies": []
    },
    {
      "id": "n35sdu6",
      "author": "Ollidor",
      "body": "But Nintendo at a reasonably priced $500 is bad somehow",
      "score": 2,
      "created_utc": 1752532507.0,
      "replies": [
        {
          "id": "n37gheq",
          "author": "fvck_u_spez",
          "body": "I wouldn't be so disappointed with the price of the Switch 2 if they didn't rip you off so much on the games.",
          "score": 5,
          "created_utc": 1752554094.0,
          "replies": [
            {
              "id": "n38zh8v",
              "author": "Kalpy97",
              "body": "How do they rip you off lmao? they make some of the best games in the industry with no microtransactions, polished and fun.",
              "score": 1,
              "created_utc": 1752582179.0,
              "replies": [
                {
                  "id": "n3big54",
                  "author": "Ollidor",
                  "body": "People like that will complain about Nintendo games being 70/80 dollars but buy up GTA VI at $100 base price and probably go for the deluxe $120",
                  "score": 3,
                  "created_utc": 1752608614.0,
                  "replies": [
                    {
                      "id": "n3c7ish",
                      "author": "stilusmobilus",
                      "body": "Puts a fair bit into perspective, doesn’t it? That’s not even getting into capabilities like mouse control and detachable controllers. I suppose we should look on the bright side, it’s exposing the clowns. \n\nThe base model of this is real ordinary by the looks, and still speculated to be 200 more. No OLED either, something Nintendo got flogged for. \n\nI’m very happy with the Switch 2, I think I got excellent value out of it.",
                      "score": 1,
                      "created_utc": 1752615733.0,
                      "replies": [
                        {
                          "id": "n3cfsxf",
                          "author": "Ollidor",
                          "body": "I always cringe when people complain about the no oled and the price in the same breath, because an oled screen would easily make it $100 more. I feel like Nintendo just can’t win with certain people.\n\nI love the switch 2, it feels like an extremely good value to me and it plays the old games much better and I’m looking forward to new games. I’m happy",
                          "score": 2,
                          "created_utc": 1752618419.0,
                          "replies": [
                            {
                              "id": "n3chvr9",
                              "author": "stilusmobilus",
                              "body": "A lot of it comes from young teenage boys who go through that phase of the main Nintendo titles being ‘uncool’. \n\nTheir viewpoint reflects their maturity.",
                              "score": 1,
                              "created_utc": 1752619102.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n37488j",
          "author": "JS-87",
          "body": "...but you see reddit thinks Nintendo is for babies and they can't be seen liking things that are for babies, and baby things should be cheap, and let me play Nintendo...\n\nThat's pretty much what their argument came down to",
          "score": 4,
          "created_utc": 1752548945.0,
          "replies": [
            {
              "id": "n38dy0d",
              "author": "iDarkville",
              "body": "That console is overpriced even for grown babies. So is this “Xbox.”",
              "score": 0,
              "created_utc": 1752572322.0,
              "replies": [
                {
                  "id": "n38zdxh",
                  "author": "Kalpy97",
                  "body": "450 for a switch 2 isnt overpriced at all lmao",
                  "score": 1,
                  "created_utc": 1752582144.0,
                  "replies": [
                    {
                      "id": "n3coxq9",
                      "author": "iDarkville",
                      "body": "Lol. Dude, that is waaaaayyy overpriced even with the tariffs from The Stupids.",
                      "score": 1,
                      "created_utc": 1752621411.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n34btnn",
      "author": "Grlions91",
      "body": "Well, this isn't an Xbox console...",
      "score": 2,
      "created_utc": 1752517225.0,
      "replies": [
        {
          "id": "n34g50q",
          "author": "Gatlindragon",
          "body": "Yeah, let's just ignore the \"This is an Xbox\" ad lol.",
          "score": 14,
          "created_utc": 1752518459.0,
          "replies": []
        },
        {
          "id": "n34g7q6",
          "author": "PM_ME_YOUR__INIT__",
          "body": "Microsoft says it's an Xbox. Xbox is in the name. It's semantics whether it's a \"console\" or not. I'd say the headline is correct saying it's the most expensive item ever given the Xbox brand",
          "score": 7,
          "created_utc": 1752518481.0,
          "replies": [
            {
              "id": "n35how7",
              "author": "Dan1elSan",
              "body": "Microsoft are getting to the point with this everything is an Xbox because in the end nothing will be an Xbox and they will pull out of hardware.  Xbox will be an overlay on boxes made by Asus and the likes.",
              "score": 5,
              "created_utc": 1752529193.0,
              "replies": []
            },
            {
              "id": "n34j0ka",
              "author": "enewwave",
              "body": "No, because you see, fountain drink Pepsi is not truly Pepsi. It is a Pepsi branded, similar item that merely has its branding /s\n\n\nWe’ve officially entered the No True Scotsman era of Xbox. Insane how much the brand has lost focus lately\n\n\n(I agree with you btw, I’m just shocked at how many people are arguing over semantics)",
              "score": 7,
              "created_utc": 1752519285.0,
              "replies": [
                {
                  "id": "n34lmy3",
                  "author": "PM_ME_YOUR__INIT__",
                  "body": "If it's expensive/underpowered/not my preferred format, it's not an Xbox. Well, it is, but it's also not",
                  "score": 1,
                  "created_utc": 1752520054.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n38xhna",
              "author": "Flipkick661",
              "body": "ROG Ally is also in the name, which is a handheld PC.",
              "score": 1,
              "created_utc": 1752581432.0,
              "replies": []
            },
            {
              "id": "n34jd24",
              "author": "chyld989",
              "body": "If it can't play all of my Xbox games then it isn't an Xbox. Microsoft could also release a water bottle and call it an Xbox, but that doesn't mean it would be.",
              "score": -3,
              "created_utc": 1752519393.0,
              "replies": [
                {
                  "id": "n34jzi3",
                  "author": "Jaerba",
                  "body": "Microsoft gets to decide what an Xbox is or isn't.\n\n\nYou could certainly say it's less than.  But it's their dumb marketing decisions.",
                  "score": 1,
                  "created_utc": 1752519579.0,
                  "replies": [
                    {
                      "id": "n34kj7o",
                      "author": "chyld989",
                      "body": "They decide what they're going to call an Xbox, but consumers will decide what is and isn't an Xbox. If a brand new piece of hardware doesn't play my Xbox games then it is most certainly *not* an Xbox.",
                      "score": -6,
                      "created_utc": 1752519742.0,
                      "replies": [
                        {
                          "id": "n34lla4",
                          "author": "PhillAholic",
                          "body": "That’s a ridiculous take. The current Xbox cannot play 100% of Xbox games from the past. No console maker has 100% compatibility. ",
                          "score": 4,
                          "created_utc": 1752520041.0,
                          "replies": [
                            {
                              "id": "n34nux6",
                              "author": "chyld989",
                              "body": "No, but the current Xbox can play everything from the Xbox One (besides Kinect required games). The PS5 can play everything from the PS4. The Switch 2 can (I believe, don't pay as much attention to Nintendo consoles) play everything from the Switch. This is the new normal going forward.\n\nThe Ally cannot play everything the current-gen Xbox can. Why? Because the Ally isn't an Xbox.",
                              "score": -5,
                              "created_utc": 1752520681.0,
                              "replies": [
                                {
                                  "id": "n35i1tz",
                                  "author": "PM_ME_YOUR__INIT__",
                                  "body": "But the name of the device is ROG Xbox Ally X. What does the Xbox in the name mean?",
                                  "score": 3,
                                  "created_utc": 1752529299.0,
                                  "replies": [
                                    {
                                      "id": "n35iqf1",
                                      "author": "chyld989",
                                      "body": "That they partnered with Microsoft to put an Xbox button on there despite the fact that it can't play Xbox games natively.",
                                      "score": 0,
                                      "created_utc": 1752529499.0,
                                      "replies": [
                                        {
                                          "id": "n35umtz",
                                          "author": "PhillAholic",
                                          "body": "No one is disagreeing that it's stupid. We're just disagreeing on it being an Xbox. Microsoft is selling it as an Xbox. End of story.",
                                          "score": 0,
                                          "created_utc": 1752533225.0,
                                          "replies": [
                                            {
                                              "id": "n36kt9v",
                                              "author": "chyld989",
                                              "body": "But it isn't the end of the story, because it isn't an Xbox. If Microsoft sells a water bottle and calls it an Xbox it won't be an Xbox, and neither is this PC.",
                                              "score": 1,
                                              "created_utc": 1752541993.0,
                                              "replies": [
                                                {
                                                  "id": "n36lmtc",
                                                  "author": "PugNuggets",
                                                  "body": "If they do start selling a water bottle and call it an Xbox, then obviously it's an Xbox. It's literally in the name!",
                                                  "score": -1,
                                                  "created_utc": 1752542279.0,
                                                  "replies": [
                                                    {
                                                      "id": "n372q30",
                                                      "author": "PhillAholic",
                                                      "body": "We’ll see how they release games moving forward. Xbox as a “console” different then PC seems to be over. ",
                                                      "score": 1,
                                                      "created_utc": 1752548362.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n34g96w",
          "author": "xixbia",
          "body": "It doesn't allow you to play Xbox exclusives (or any native Xbox games).\n\nWhich feels like the one thing that would let it compete with the Steam Deck. Right now I am struggling to see what the advantage of this over the Steam Deck is (I'm sure it has better specs, but at a massive premium price).",
          "score": 4,
          "created_utc": 1752518493.0,
          "replies": [
            {
              "id": "n34hzdc",
              "author": "CiraKazanari",
              "body": "What native Xbox games exist that aren’t on PC though?",
              "score": 4,
              "created_utc": 1752518982.0,
              "replies": [
                {
                  "id": "n34j7ki",
                  "author": "chyld989",
                  "body": "Tons of them. GoW 2 and 3 for sure, Lost Odyssey, GTA6 at launch. They're getting better about it, but there are a ton that aren't on PC, and a ton more that are on PC but aren't Play Anywhere so you'd have to rebuy the game and start over with a new save if you want to play it on this \"Xbox.\"",
                  "score": 4,
                  "created_utc": 1752519344.0,
                  "replies": [
                    {
                      "id": "n34ka15",
                      "author": "CiraKazanari",
                      "body": "Ok what else",
                      "score": -4,
                      "created_utc": 1752519665.0,
                      "replies": [
                        {
                          "id": "n34ktcc",
                          "author": "chyld989",
                          "body": "Google is free and pretty easy to use.",
                          "score": 4,
                          "created_utc": 1752519823.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n36mmi1",
              "author": "_RADIANTSUN_",
              "body": "That's like saying PlayStation Vita \"wasn't a PlayStation\" because it couldn't play PS3/4 console games directly",
              "score": 1,
              "created_utc": 1752542620.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n34cz4p",
          "author": "BrewKazma",
          "body": "Seriously. Why can reporters not get this right?",
          "score": 1,
          "created_utc": 1752517549.0,
          "replies": [
            {
              "id": "n34is6h",
              "author": "Jaerba",
              "body": "Because it's being sold under the marketing campaign of 'This is an Xbox'.  \n\n\nA marketing campaign that conflates the idea of what an Xbox is and Microsoft designed it that way to work in their favor.  \n\n\nI don't think there's much room to go, \"bUt aCksHuAlLy...\" when it doesn't work in their favor.  Xbox's marketing called it an Xbox therefore...",
              "score": 10,
              "created_utc": 1752519215.0,
              "replies": []
            },
            {
              "id": "n34jpuc",
              "author": "MrNegativ1ty",
              "body": "Maybe Xbox should stop calling everything an Xbox because the only thing it's doing is confusing people?\n\nIf reporters can't even tell that this is a handheld PC instead of a console, what faith do you have in the general public being able to distinguish between the two?",
              "score": 2,
              "created_utc": 1752519500.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n34lt8c",
      "author": "TherapyPsychonaut",
      "body": "If it's the same in USD I'd pay that for the X. Still aiming for the LeGo 2 tho with it's OLED display",
      "score": 1,
      "created_utc": 1752520103.0,
      "replies": []
    },
    {
      "id": "n35kni7",
      "author": "SmurfsNeverDie",
      "body": "Anyone have an Xtention cable?",
      "score": 1,
      "created_utc": 1752530076.0,
      "replies": []
    },
    {
      "id": "n35r65p",
      "author": "ChafterMies",
      "body": "At least this headline says “suggests”. I’ll be outraged (not really) when we have an official price.",
      "score": 1,
      "created_utc": 1752532116.0,
      "replies": []
    },
    {
      "id": "n35svm6",
      "author": "mannyonthem00n",
      "body": "If it can't play ninja gaiden black...then its 💩",
      "score": 1,
      "created_utc": 1752532663.0,
      "replies": []
    },
    {
      "id": "n35vwyq",
      "author": "justplainndaveCGN",
      "body": "This ain’t a console.",
      "score": 1,
      "created_utc": 1752533635.0,
      "replies": []
    },
    {
      "id": "n39e5ml",
      "author": "Alienhaslanded",
      "body": "I'll just keep using my Steam Deck with Moonlight for the big games.",
      "score": 1,
      "created_utc": 1752587264.0,
      "replies": []
    },
    {
      "id": "n39q06k",
      "author": "SelflessMirror",
      "body": "For handheld? That's ridiculous",
      "score": 1,
      "created_utc": 1752590761.0,
      "replies": []
    },
    {
      "id": "n39sms3",
      "author": "harbinger411",
      "body": "That shit better be less than the Xbox X. I’m NEVER paying more than the console I already have for a handheld one. Fucking never.",
      "score": 1,
      "created_utc": 1752591503.0,
      "replies": []
    },
    {
      "id": "n3d0g3r",
      "author": "Some_Stoned_Dude",
      "body": "Gonna be a no from me dawg",
      "score": 1,
      "created_utc": 1752625291.0,
      "replies": []
    },
    {
      "id": "n3dbxxl",
      "author": "aZombieDictator",
      "body": "It's literally just a rog ally with an Xbox skin/ui",
      "score": 1,
      "created_utc": 1752629317.0,
      "replies": []
    },
    {
      "id": "n34uinh",
      "author": "SuchAppeal",
      "body": ">Xbox\n\n>console\n\n![gif](giphy|EvnFisLa5qY4o|downsized)",
      "score": 1,
      "created_utc": 1752522621.0,
      "replies": []
    },
    {
      "id": "n35wxrz",
      "author": "KasElGatto",
      "body": "This thread in a nutshell. \n\nMicrosoft: “This is an Xbox”\n\nPeople criticize a bunch of stuff about said Xbox\n\nWeird Xbox Stans: “This isn’t an Xbox, stop criticizing Microsoft”",
      "score": 0,
      "created_utc": 1752533966.0,
      "replies": [
        {
          "id": "n363nwu",
          "author": "GuerrillaApe",
          "body": "People calling the writer of the article an idiot must think Phil Spencer is stupid af.  He runs the Xbox division and he's got whole marketing teams making promotional material calling these hardware collaborations \"Xboxes\".\n\nActually... these Xbox fans probably do think Phil Spencer is stupid, but moreso because of his inability to keep Xbox competitive against the PlayStation.",
          "score": 1,
          "created_utc": 1752536142.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n34zvci",
      "author": "nipple_salad_69",
      "body": "LOL no thanks. ",
      "score": 1,
      "created_utc": 1752524133.0,
      "replies": []
    },
    {
      "id": "n35p579",
      "author": "thereverendpuck",
      "body": "Way to shoot yourself in the foot. And all that to be the 4th most popular handheld device from the 3rd biggest console maker.",
      "score": 1,
      "created_utc": 1752531475.0,
      "replies": []
    },
    {
      "id": "n34hrvr",
      "author": "Johnprogamer",
      "body": "This is not Xbox hardware. This is a rog ally with a Xbox sticker in the corner. How tf is Ms not getting blasted and ridiculed for this shit is beyond me",
      "score": -2,
      "created_utc": 1752518925.0,
      "replies": [
        {
          "id": "n34k0h4",
          "author": "Bobflanders76",
          "body": "It has Xbox branding and marketing behind it. For all intents and purposes, it is an Xbox console. Reviews will surely be terrible when consumers buy them thinking it plays console games, but by then Xbox/microsoft will already have the customer’s money.",
          "score": 6,
          "created_utc": 1752519587.0,
          "replies": [
            {
              "id": "n38vi9u",
              "author": "Flipkick661",
              "body": "There’s a Meta Quest with Xbox branding and marketing too, but that doesn’t make that an Xbox. Stop buying into the BS marketing push from Microsoft. This is an Asus product with an Xbox sticker slapped on it, just like the Quest is a Meta product. Microsoft are clearly done with making their own hardware for gaming, and their strategy going forward is to pay other companies to put the Xbox logo on their products.",
              "score": 0,
              "created_utc": 1752580664.0,
              "replies": [
                {
                  "id": "n3cc9ue",
                  "author": "Bobflanders76",
                  "body": "I see through it just fine, as do many people on here. That does not change the fact Microsoft wants the average person to see this as an Xbox, and likewise see the quest as an Xbox.\nIt’s disingenuous from Microsoft and they should be called out for it as much as possible.",
                  "score": 1,
                  "created_utc": 1752617201.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n34t4vh",
              "author": "jfp1992",
              "body": "Then just offer streaming services to get more FPS and graphics",
              "score": -4,
              "created_utc": 1752522220.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n35k7ag",
      "author": "sergeant-keroro",
      "body": "SwItCh 2 Is DoOmEd",
      "score": 0,
      "created_utc": 1752529939.0,
      "replies": [
        {
          "id": "n3c83us",
          "author": "stilusmobilus",
          "body": "s3Ll uR c0nsOL n0w",
          "score": 2,
          "created_utc": 1752615908.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n35ymih",
      "author": "Western-Corner-431",
      "body": "Let cancel culture come down hard on the gaming industry",
      "score": 0,
      "created_utc": 1752534511.0,
      "replies": []
    },
    {
      "id": "n34ra7m",
      "author": "N8ThaGr8",
      "body": ">might be the most expensive Xbox console yet\n\nIt is not an Xbox console, don't spread misinformation.",
      "score": -7,
      "created_utc": 1752521675.0,
      "replies": []
    },
    {
      "id": "n34rgj0",
      "author": "None",
      "body": "When is Microsoft going to finally learn to stop doing multiple tears of hardware for the same console. All it does is cause developers to have to do more while delivering a diminished experience across all tiers.",
      "score": -2,
      "created_utc": 1752521727.0,
      "replies": [
        {
          "id": "n38uke6",
          "author": "Flipkick661",
          "body": "This isn’t a console, and it isn’t even a Microsoft product. This is a PC, and these have had multiple “tiers” of hardware for decades.",
          "score": 1,
          "created_utc": 1752580298.0,
          "replies": [
            {
              "id": "n38uzos",
              "author": "None",
              "body": ">Microsoft may have announced the ROG Xbox Ally range as \"an Xbox you can hold in your hands\"\n\nDid you read the article?\n\nAnd developers have complained for years about having to disrupt development to accommodate weaker versions of Xbox consoles.",
              "score": 1,
              "created_utc": 1752580464.0,
              "replies": [
                {
                  "id": "n38xwtp",
                  "author": "Flipkick661",
                  "body": "Where in that quote does it say that this is a Microsoft product? Because it isn’t. It’s an Asus product. Running Windows 11. Not a console. Stop eating up the marketing BS. It’s a PC with Xbox branding, and that’s all there is to it.",
                  "score": 1,
                  "created_utc": 1752581591.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n34mhra",
      "author": "GODLAND",
      "body": "So you're saying... It's going to be sold out on day one?",
      "score": 0,
      "created_utc": 1752520295.0,
      "replies": []
    },
    {
      "id": "n34n6g7",
      "author": "C0rnishStalli0n",
      "body": "I don’t know much about either, but why would you have this vs a SteamDeck? Is there much difference?",
      "score": 0,
      "created_utc": 1752520487.0,
      "replies": [
        {
          "id": "n34p1hs",
          "author": "GuerrillaApe",
          "body": "Two main differences: \n1. Windows support.  SteamOS/Linux still has naggling incompatibilities with some games' anti-cheat detection.  Technically you can just install Windows on a Steam Deck, but if you're out in the market for a PC handheld and want Windows as the OS you might as well get the handheld that comes with Windows as a default. \n2. Much more powerful.  The Z2 Extreme in the X version of the ROG Ally Xbox will be significantly more powerful than the SD.  The Steam Deck at this point struggles to play a lot of AAA titles.  If you can swallow the steeper price tag then you can get yourself a handheld that can probably play new AAA release for at least the next couple of years.",
          "score": 10,
          "created_utc": 1752521024.0,
          "replies": [
            {
              "id": "n38cye3",
              "author": "C0rnishStalli0n",
              "body": "Thanks for the reply",
              "score": 1,
              "created_utc": 1752571750.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n34nn5g",
          "author": "AlannaAbhorsen",
          "body": "It’s windows OS so you can run stuff from Xbox and Epic more easily.",
          "score": 4,
          "created_utc": 1752520620.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n34qv1x",
      "author": "Devilofchaos108070",
      "body": "That’s not a console.  It’s a handheld",
      "score": -7,
      "created_utc": 1752521551.0,
      "replies": [
        {
          "id": "n38uol0",
          "author": "Flipkick661",
          "body": "It’s an Asus PC with an Xbox sticker slapped on it.",
          "score": 1,
          "created_utc": 1752580344.0,
          "replies": [
            {
              "id": "n3aqud8",
              "author": "Devilofchaos108070",
              "body": "Yep a handheld",
              "score": 1,
              "created_utc": 1752600917.0,
              "replies": [
                {
                  "id": "n3azkm2",
                  "author": "Flipkick661",
                  "body": "A handheld PC. Not a handheld console.",
                  "score": 1,
                  "created_utc": 1752603281.0,
                  "replies": [
                    {
                      "id": "n3b0x7i",
                      "author": "Devilofchaos108070",
                      "body": "Yeah a handheld is not a console in the first place, so I’m not sure what point you are trying to make",
                      "score": 1,
                      "created_utc": 1752603658.0,
                      "replies": [
                        {
                          "id": "n3be2m2",
                          "author": "Flipkick661",
                          "body": "A Nintendo Switch is considered a console. The PSP is considered a handheld console. My point is that in this case, it’s necessary to specify that it’s a handheld PC, and not a handheld console like a Nintendo 3DS or a PS Vita.",
                          "score": 1,
                          "created_utc": 1752607364.0,
                          "replies": [
                            {
                              "id": "n3bn0du",
                              "author": "Devilofchaos108070",
                              "body": "A console is by definition not a handheld",
                              "score": 1,
                              "created_utc": 1752609902.0,
                              "replies": [
                                {
                                  "id": "n3bqlq1",
                                  "author": "Flipkick661",
                                  "body": "Not true.",
                                  "score": 0,
                                  "created_utc": 1752610902.0,
                                  "replies": [
                                    {
                                      "id": "n3bxes0",
                                      "author": "Devilofchaos108070",
                                      "body": "Well we are in disagreement 🤷🏻‍♂️",
                                      "score": 1,
                                      "created_utc": 1752612788.0,
                                      "replies": [
                                        {
                                          "id": "n3bzhzg",
                                          "author": "Flipkick661",
                                          "body": "No, you’re just wrong about the definition of a console:\n\nA game console is a device made specifically for playing video games. It’s different from a regular computer because it’s focused entirely on gaming. There are three main types:\n\nHome consoles: These connect to TVs and use separate controllers (like PlayStation or Xbox).\n\nHandheld consoles: These are portable with built-in screens and controls (like the Nintendo 3DS or Game Boy).\n\nHybrid consoles: These can work as both home and handheld devices (like the Nintendo Switch).\n\nGame consoles usually run games from cartridges, discs, or digital downloads, and they often have a user-friendly interface for choosing games and settings.",
                                          "score": 0,
                                          "created_utc": 1752613371.0,
                                          "replies": [
                                            {
                                              "id": "n3cdjlm",
                                              "author": "Devilofchaos108070",
                                              "body": "Yeah I don’t care what you think.  Go bother someone else\n\n\nEdit:  also what you posted doesn’t refute what I said.  It actually proves it lmao.\n\n\nWow",
                                              "score": 1,
                                              "created_utc": 1752617604.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n34eoah",
      "author": "Chr0ll0_",
      "body": "Hmmmm",
      "score": -2,
      "created_utc": 1752518037.0,
      "replies": []
    },
    {
      "id": "n35i3by",
      "author": "Thelmara",
      "body": "\"Newest console more expensive than previous models by the same company,\" isn't news, that's what you'd expect, isn't it?\n\nAre there any consoles that were cheaper than their previous gen model?",
      "score": -2,
      "created_utc": 1752529311.0,
      "replies": [
        {
          "id": "n35kchl",
          "author": "GuerrillaApe",
          "body": "PS3 launched with its lowest model priced at $500.  The PS4 released at $400.",
          "score": 2,
          "created_utc": 1752529983.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n34w0bg",
      "author": "Space_Pope2112",
      "body": "Microsoft should just buy everyone a PlayStation as an apology at this point. Xbox is beyond dead and deserves to get thrown in a ditch",
      "score": -10,
      "created_utc": 1752523046.0,
      "replies": []
    },
    {
      "id": "n34ijsm",
      "author": "melancious",
      "body": "Wouldn't get this ugly pos for free",
      "score": -12,
      "created_utc": 1752519145.0,
      "replies": []
    }
  ]
}