{
  "post": {
    "title": "Nvidia RTX 50-series GPU prices drop below MSRP in Germany as demand wanes | Strong euro and weak demand push GPU prices down",
    "author": "chrisdh79",
    "id": "1kc9ya1",
    "score": 885,
    "created_utc": 1746109323.0,
    "selftext": "",
    "num_comments": 80,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kc9ya1/nvidia_rtx_50series_gpu_prices_drop_below_msrp_in/"
  },
  "comments": [
    {
      "id": "mq0vb9c",
      "author": "CMDR_omnicognate",
      "body": "it'd be good if they did that in the UK, they're still trying to sell 5070ti's for up to £930",
      "score": 83,
      "created_utc": 1746109626.0,
      "replies": [
        {
          "id": "mq4i9vs",
          "author": "OffbeatDrizzle",
          "body": "Bro just get a 9070. They're literally half that price for the same performance",
          "score": 34,
          "created_utc": 1746150216.0,
          "replies": [
            {
              "id": "mq62pad",
              "author": "CMDR_omnicognate",
              "body": "I actually bought a 7900xtx in the end, but yeah that honestly",
              "score": 13,
              "created_utc": 1746178407.0,
              "replies": []
            },
            {
              "id": "mqbpu8j",
              "author": "DatTF2",
              "body": "My friend just got a 9080 and loves it, says Fuck Nvidia and i totally agree with him.",
              "score": 0,
              "created_utc": 1746249128.0,
              "replies": [
                {
                  "id": "mqe5h86",
                  "author": "Juub1990",
                  "body": "Your friend got a card that doesn’t exist? Fuck NVIDIA indeed.",
                  "score": 1,
                  "created_utc": 1746289409.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mq4fx79",
          "author": "Umbra_RS",
          "body": "I bought one a few days ago from CCL for £736. Sold my EVGA FTW3 3080 10G for £350. It was kind of an impulse purchase, and I wasn't expecting any to be in stock at a reasonable (ish) price, and hadn't been searching. It was about 8AM, 8 Gigabyte Windforce SFF in stock. The more expensive AIB cards are definitely not worth it. I'd rather undervolt than go for a massive OC, no need for an overpriced model.",
          "score": 6,
          "created_utc": 1746149382.0,
          "replies": []
        },
        {
          "id": "mq4qyyp",
          "author": "Honest-Ad1675",
          "body": "Consequence of Brexit, unfortunately. It's literally the cost the not being part of the european union any longer, but you can be mad about it I guess. If the UK were still part of the EU they wouldn't be in the position that they are.",
          "score": -6,
          "created_utc": 1746153332.0,
          "replies": [
            {
              "id": "mq5nkym",
              "author": "IvaNoxx",
              "body": "in EU country the cards are 1100€ , basically £930.. sooo dont know what are you talking about",
              "score": 2,
              "created_utc": 1746168892.0,
              "replies": [
                {
                  "id": "mq5vrpr",
                  "author": "CanSeeYou",
                  "body": "they are not. 5070ti ist about 850-1000€",
                  "score": 6,
                  "created_utc": 1746173999.0,
                  "replies": [
                    {
                      "id": "mq626oz",
                      "author": "Toxicseagull",
                      "body": "€950 to €1200 in Bulgaria from a quick look.",
                      "score": 3,
                      "created_utc": 1746178082.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mqd0h4n",
          "author": "Miny___",
          "body": "Man, if there only would be a common market were you could have just ordered it from germany as easily as from the uk.",
          "score": -1,
          "created_utc": 1746275548.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq0vq6x",
      "author": "tea_snob10",
      "body": ">weak demand push GPU prices down\n\nWeak demand pushing GPU prices down to where they should be, realistically; Nvidia's got them overpriced by at least 30% to begin with (more actually), and was mostly cause of the crypto-mining hype. That and the fact that GPUs are a duopoly.",
      "score": 282,
      "created_utc": 1746109750.0,
      "replies": [
        {
          "id": "mq15axl",
          "author": "thedoc90",
          "body": "That and this is arguably the first generation that the average consumer sees AMD as a viable alternative to Nvidia.",
          "score": 105,
          "created_utc": 1746112592.0,
          "replies": [
            {
              "id": "mq1pwq9",
              "author": "GearsFC3S",
              "body": "I’m really hoping intel keeps pushing into the GPU market. The B580 is a great card for lower end systems, and I’d love to see something that can compete in the mid range",
              "score": 67,
              "created_utc": 1746118667.0,
              "replies": []
            },
            {
              "id": "mq2351b",
              "author": "tea_snob10",
              "body": "Yup, I'm really keen on AMD this generation too.",
              "score": 12,
              "created_utc": 1746122435.0,
              "replies": [
                {
                  "id": "mq3e4ko",
                  "author": "PaulR79",
                  "body": "I went from a 3070 Ti FE to an XFX Mercury Magnetic Air 9070 XT. I was struggling in newer games if I wanted higher graphics settings.\n\nFor comparison I can play Cyberpunk 2077 in 1440p at highest settings (Ray Tracing Overdrive) and get a steady 55FPS average *without* frame generation of any kind. If I enable frame generation I can double that to about 111FPS average.\n\nWith the 3070 Ti that was Ray Tracing Medium (I think, the one before Psycho) and while it was smooth to play it had some moment where it was sub-30FPS. That was also with DLSS at performance mode.",
                  "score": 6,
                  "created_utc": 1746136316.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mq4rau8",
              "author": "CakeDayisaLie",
              "body": "Yep. Been using nvidia cards for roughly 18 years. Just bought my first AMD card. ",
              "score": 4,
              "created_utc": 1746153454.0,
              "replies": []
            },
            {
              "id": "mq38ae0",
              "author": "None",
              "body": "[deleted]",
              "score": 9,
              "created_utc": 1746134482.0,
              "replies": [
                {
                  "id": "mq4hx3t",
                  "author": "OffbeatDrizzle",
                  "body": "Nvidia GPUs are decidedly not better if you're paying 2x the cost for less than 2x the performance \n\nAMD have been killing it with CPUs since Ryzen and the new 9000 series GPUs are such good value for money that you're a fool if you went with Nvidia this time around. Yes Nvidia owns the high end market but the vast majority of people don't need that for triple the price. That doesn't make Nvidia \"better\"",
                  "score": 4,
                  "created_utc": 1746150090.0,
                  "replies": [
                    {
                      "id": "mq4ohyn",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 6,
                      "created_utc": 1746152446.0,
                      "replies": [
                        {
                          "id": "mq6jyfk",
                          "author": "None",
                          "body": "[deleted]",
                          "score": -1,
                          "created_utc": 1746187045.0,
                          "replies": [
                            {
                              "id": "mqkohyf",
                              "author": "Oakcamp",
                              "body": ">Are NVIDIA cards better in driectX games on the windows platform? Sure in 95% of cases they are. The second you leave that narrow definition it becomes a VERY different story.\n\nThe narrow definition of 99.5% of actual games coming out 😂",
                              "score": 2,
                              "created_utc": 1746382100.0,
                              "replies": []
                            },
                            {
                              "id": "mq6qtu5",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 3,
                              "created_utc": 1746189720.0,
                              "replies": [
                                {
                                  "id": "mqc1uqf",
                                  "author": "AStringOfWords",
                                  "body": "Linux people are creeps",
                                  "score": -1,
                                  "created_utc": 1746256019.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mq4s2c9",
                          "author": "OffbeatDrizzle",
                          "body": ">Nvidia is better because they are better\n\n>I went with the 9070XT",
                          "score": -11,
                          "created_utc": 1746153741.0,
                          "replies": [
                            {
                              "id": "mq6q61l",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 3,
                              "created_utc": 1746189474.0,
                              "replies": [
                                {
                                  "id": "mq6sv9c",
                                  "author": "OffbeatDrizzle",
                                  "body": "\"best\" can literally have any definition you want... is it price / performance, is it maximum performance, is it cosmetics with an anime waifu on the side...",
                                  "score": -1,
                                  "created_utc": 1746190462.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mq4qm3g",
              "author": "Honest-Ad1675",
              "body": "In a while***",
              "score": 1,
              "created_utc": 1746153199.0,
              "replies": []
            },
            {
              "id": "mq2eig6",
              "author": "hihirogane",
              "body": "I haven’t bought AMD yet since 590s. But I know they’ve been steadily improving over the years. The recent reversal of the infamous AMD GPU drivers (I haven’t had any issues when I was using the 590s) makes me excited. Plus the their GPUS are amazingly priced VS nvidia.\n\nI hope AMD knocks Nvidia down several knotches and gets them to adjust their gpu prices.\n\nIts the same with AMD for me as well. If they ever become something like Nvidia does, I hope nvidia knocks em down too.\n\nSimilar all round situation for AMD VS Intel CPUs.",
              "score": 1,
              "created_utc": 1746125791.0,
              "replies": []
            },
            {
              "id": "mq231jt",
              "author": "Monday_Morning_QB",
              "body": "Yeah if you ignore everything before 2020 maybe.",
              "score": 0,
              "created_utc": 1746122407.0,
              "replies": [
                {
                  "id": "mq25xth",
                  "author": "thedoc90",
                  "body": "I've been an AMD buyer since the mid 2010s so you're preaching to the choir, but sales IMO show that the average non-enthusiast buyer did not see it that way.",
                  "score": 16,
                  "created_utc": 1746123256.0,
                  "replies": [
                    {
                      "id": "mq2d31v",
                      "author": "Derseyyy",
                      "body": "There are also certain applications where Radeon cards do not work or are less efficient. From personal experience, most 3d rendering software (blender etc) tends to run better on NVidia. I also know that local image generation with say stable diffusion is either incredibly difficult or impossible on Radeon cards.\n\nKeep in mind I had Radeon cards all through the 2010's and loved them, but since getting into 3d modelling and the like I keep seeing this imbalance between NVidia and Radeon.",
                      "score": 8,
                      "created_utc": 1746125371.0,
                      "replies": [
                        {
                          "id": "mq2gg5i",
                          "author": "thedoc90",
                          "body": "Absolutely true for the standard use case, though its worth noting that I have relatively little experience with that side of things since I havent used windows on my gaming PC in quite a while, so I didn't want to talk about it with any kind of authority. I have the opposite experience since Nvidia is pretty hit or miss on Linux and AMD drivers are quite good and you also have the option of building software such as Stable Diffusion (Don't really use it since I didn't find it to be very useful as a drawing aid, it seems to be mostly geared as a drawing replacement, but I've tested it.) with ROCM yourself as a replacement for CUDA in order to effectively use your gpu.",
                          "score": 1,
                          "created_utc": 1746126366.0,
                          "replies": [
                            {
                              "id": "mq2ijxj",
                              "author": "Derseyyy",
                              "body": "Totally, good points. I've only just started dabbling in Linux (mint xfce) in response to Microsofts inability to not just leave windows in a working state. That and that recall feature they keep wanting to implement.\n\nI hadn't actually heard that a replacement to CUDA exists, that's kind of what I based my comment on. Cool to know 👍",
                              "score": 1,
                              "created_utc": 1746126987.0,
                              "replies": [
                                {
                                  "id": "mq3ffcj",
                                  "author": "thedoc90",
                                  "body": "Its a bit more like, complicated than a drop in replacement, but it does work with some elbow grease.",
                                  "score": 1,
                                  "created_utc": 1746136733.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mq2dz3x",
                          "author": "BoodyMonger",
                          "body": "Might want to look into stable diffusion on amd again, from what I’ve heard this generation’s gap in VRAM between the two brands made AMD very compelling and a couple of people got it to finally work fast with a CUDA equivalent. \n\nEdit: ZLUDA",
                          "score": 0,
                          "created_utc": 1746125632.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mqlq3g6",
                      "author": "Rhellic",
                      "body": "Wasn't ATI and then AMD literally ahead of Nvidia in market share for a couple generations?\n\n  \nEdit: Huh. Turns out that didn't quite happen after the mid 2000s. Could've sworn they fell behind one of those times they tried to release the same card three times in a row.",
                      "score": 1,
                      "created_utc": 1746393881.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mq3ko72",
          "author": "Behacad",
          "body": "There’s no “should be” price. It’s capitalism. The value is what people are willing to pay for. People need to let go this idea of some “true” GPU price and what is fair and what isn’t. NVIDIA is a mega corporation and will always try to get as much money as it can. It’s doing that now and it was doing it 10 years ago.",
          "score": 5,
          "created_utc": 1746138483.0,
          "replies": []
        },
        {
          "id": "mq19zyz",
          "author": "raydialseeker",
          "body": "GPUs are practically a monopoly",
          "score": 1,
          "created_utc": 1746113965.0,
          "replies": [
            {
              "id": "mq4i24j",
              "author": "OffbeatDrizzle",
              "body": "If people had any sense they'd get a 9000 series. Such a good price to performance compared to Nvidia",
              "score": 3,
              "created_utc": 1746150138.0,
              "replies": [
                {
                  "id": "mq693zm",
                  "author": "raydialseeker",
                  "body": "If it's actually available at that price. AMD used decoy pricing for the 9070xt.",
                  "score": 0,
                  "created_utc": 1746182097.0,
                  "replies": [
                    {
                      "id": "mq6bqsm",
                      "author": "OffbeatDrizzle",
                      "body": "I got 2 at £20 above msrp in the UK a few days after release so I'm not sure what to tell you. The initial sales were all at MSRP and then stores were free to raise it. If you wanted one at a decent price when they dropped then you could definitely get one if you kept an eye out - they weren't THAT scarce, unlike Nvidia who literally ship about 5 units at a time",
                      "score": 1,
                      "created_utc": 1746183412.0,
                      "replies": [
                        {
                          "id": "mq6hdl2",
                          "author": "raydialseeker",
                          "body": "Funnily enough it's been easier to get a 5070ti at msrp NOW than a 9070xt.",
                          "score": 1,
                          "created_utc": 1746185974.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mq1q65c",
              "author": "LordOverThis",
              "body": "Yeah but not because Nvidia do much that’s anticompetitive, consumers are just really goddamned stupid, we live in the world of digital flex culture, and their would-be competitors make the boneheaded decision to engage in creating artificial scarcity.\n\nThe B580 should be walking all over the RTX 4060 and 5060 series, but you can’t find the damn things in most stores even if you want one (the same for the RX 9070 XT), and for the rest of consumers (aka idiots) they demand Nvidia because of some asinine social media perpetuated belief that “Nvidia is for gamers.”",
              "score": -2,
              "created_utc": 1746118741.0,
              "replies": [
                {
                  "id": "mq2a66f",
                  "author": "GroundbreakingBag164",
                  "body": "> Yeah but not because Nvidia do much that’s anticompetitive, consumers are just really goddamned stupid, \n\nAMD has always been really really bad at marketing while NVIDIA was always really good at that. Not a good combo. And this isn't the fault of the consumers, AMD was way too late to raytracing",
                  "score": 3,
                  "created_utc": 1746124516.0,
                  "replies": [
                    {
                      "id": "mq2j1fs",
                      "author": "LordOverThis",
                      "body": "Intel’s RT is, however, very good and has been from the outset.\n\nRT also sucks and I refuse to enable it lol",
                      "score": 0,
                      "created_utc": 1746127132.0,
                      "replies": [
                        {
                          "id": "mq2v6jg",
                          "author": "GroundbreakingBag164",
                          "body": "> Intel’s RT is, however, very good and has been from the outset.\n\nThat doesn't matter if they won't compete in the high-end/enthusiast space. Same with AMD\n\n> RT also sucks and I refuse to enable it lol\n\nIt'll be the default lighting technique in 10 years anyways",
                          "score": 2,
                          "created_utc": 1746130636.0,
                          "replies": [
                            {
                              "id": "mq3fgs9",
                              "author": "LordOverThis",
                              "body": ">That doesn't matter if they won't compete in the high-end/enthusiast space. Same with AMD\n\nSee: my comment about flex culture\n\nThe #1 GPU on Steam oscillates between some 4060 variant and the 3060 12GB.  The majority of gamers are not playing at the high end.\n\n> It'll be the default lighting technique in 10 years anyways\n\nAnd in ten years I’ll probably use it.  But for now it’s stupid, even on halo tier products.  Ten years ago was, what, the first Titan X?  That card is barely usable in current *rasterized* games; the RTX 5090 will be the same way in a decade and the tech will have matured to the point it’s actually usable,  and the fake frames used won’t suck and everything will be upscaled from 360p but look amazing.",
                              "score": 0,
                              "created_utc": 1746136746.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mq4qjwn",
          "author": "Honest-Ad1675",
          "body": "Their gpus are like apple iPhones. To get one better than the competitor’s offering you have to buy top of the line for double or quadruple the cost and the rasterization isn’t that much better for the premium they’re charging. Just like iPhones. There’s arguments to be made about the ‘features’, but if we’re talking about performance. . .",
          "score": -1,
          "created_utc": 1746153179.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq12vpt",
      "author": "SerbentD",
      "body": "Strong euro pushing prices down instead of padding the company’s profits?? Am I dreaming?",
      "score": 45,
      "created_utc": 1746111879.0,
      "replies": [
        {
          "id": "mq15gv4",
          "author": "None",
          "body": "That’s where lack of demand and a horrid roll out come into play.",
          "score": 26,
          "created_utc": 1746112641.0,
          "replies": [
            {
              "id": "mq15tce",
              "author": "SerbentD",
              "body": "Well nvidia's latest releases really have been absurdly expensive over here so I'm hoping this continues 🙏",
              "score": 7,
              "created_utc": 1746112742.0,
              "replies": [
                {
                  "id": "mq16hlk",
                  "author": "None",
                  "body": "They are overpriced everywhere. It hurts.\n\nI was waiting on the 5000 series to replace my 3080TI. Super disappointing that the 5080 is meh and far over an already high MSRP and the next step up is far outside of what I am willing to spend.",
                  "score": 9,
                  "created_utc": 1746112937.0,
                  "replies": [
                    {
                      "id": "mq170ej",
                      "author": "SerbentD",
                      "body": "I ended up going for the Radeon RX 9070 xt this time 'round. Works great for me, but it was still very pricey.",
                      "score": 3,
                      "created_utc": 1746113090.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mq1j8eh",
              "author": "AlphaTangoFoxtrt",
              "body": "Also the reports of cables melting. I know a lot of people avoiding the 50 series and just sticking with their 30s/40s to avoid that.",
              "score": 5,
              "created_utc": 1746116711.0,
              "replies": [
                {
                  "id": "mq30cs5",
                  "author": "None",
                  "body": "I don’t understand. Do you not want to spend 4k to burn your house down and endanger your family?\n\nYou must not be a true gamer",
                  "score": 1,
                  "created_utc": 1746132121.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mq0zwso",
      "author": "gloomdwellerX",
      "body": "Here in the US, I am worried if I can’t find anything this week, then it’s my last shot before the economy explodes.",
      "score": 62,
      "created_utc": 1746110999.0,
      "replies": [
        {
          "id": "mq1386j",
          "author": "1leggeddog",
          "body": "Don't worry, it'll happen soon.",
          "score": 14,
          "created_utc": 1746111981.0,
          "replies": [
            {
              "id": "mq14t3q",
              "author": "gloomdwellerX",
              "body": "It's not that I can't go buy one of these AIB models for 60% over MSRP, I just don't have infinite money.",
              "score": 8,
              "created_utc": 1746112446.0,
              "replies": [
                {
                  "id": "mq152mi",
                  "author": "1leggeddog",
                  "body": "Neither do i. I'm looking for used GPUs atm. Eyeing 7900 xt",
                  "score": 7,
                  "created_utc": 1746112525.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mq1vw9k",
          "author": "LordOverThis",
          "body": "I wouldn’t worry too much, demand has already collapsed so badly on the secondary market as the “oh, fuuuuuck” feeling is starting to set in that you’ll be picking up cheap-as-chips secondhand 4070Ti Supers in the near future as people decide to sell their hardware to pay bills.",
          "score": 8,
          "created_utc": 1746120375.0,
          "replies": []
        },
        {
          "id": "mq1f7pj",
          "author": "raccoonbrigade",
          "body": "I got a 5070 for $600 a month ago and am still waiting for it to ship. That's sadly as good as it will get for the US for a while",
          "score": 2,
          "created_utc": 1746115512.0,
          "replies": [
            {
              "id": "mq1mx05",
              "author": "None",
              "body": "[removed]",
              "score": 8,
              "created_utc": 1746117796.0,
              "replies": [
                {
                  "id": "mq29pvp",
                  "author": "raccoonbrigade",
                  "body": "They normally sell for about $700 here. I'm saying$600 was the best deal that will be found on it for a long time.",
                  "score": 1,
                  "created_utc": 1746124381.0,
                  "replies": [
                    {
                      "id": "mq2nzkw",
                      "author": "None",
                      "body": "[removed]",
                      "score": 2,
                      "created_utc": 1746128567.0,
                      "replies": [
                        {
                          "id": "mq3uzzz",
                          "author": "Naxirian",
                          "body": "They're probably having trouble selling them. The regular 5070 is a straight trash deal even at its MSRP. In the UK the 5070 is very easy to get hold of because the 9070 thrashes it in just about every game at the same price point and is readily available.",
                          "score": 3,
                          "created_utc": 1746141996.0,
                          "replies": [
                            {
                              "id": "mq469gu",
                              "author": "SpeedflyChris",
                              "body": "Releasing a 5070 that performs worse in some games than the 4070 super really was quite a move.\n\nIt's crazy how shit most of the stack is this generation. In terms of relative performance the 5080 is to the 5090 what a hypothetical card between the 3060ti and 3070 was to the 3090.\n\nAnd that situation gets much worse as you go down the stack.",
                              "score": 2,
                              "created_utc": 1746145915.0,
                              "replies": [
                                {
                                  "id": "mq5l6fm",
                                  "author": "Naxirian",
                                  "body": "I was due an upgrade this generation and bought a 9070 XT on launch day. Very happy with it. I considered an Nvidia but they just seem like a rip off.",
                                  "score": 1,
                                  "created_utc": 1746167479.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mq44i38",
                          "author": "raccoonbrigade",
                          "body": "I'll happily take the L here and cancel my current order. Thanks!",
                          "score": 2,
                          "created_utc": 1746145282.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mq8doij",
          "author": "sequeezer",
          "body": "Hey don’t worry, there’s still a good chance NVIDIA will just do what others did and just raise the prices in other places instead to keep their profit margins.\nYou know because fuck everywhere that’s not the USA to not piss of consumers there and show what trumps policies are really doing.",
          "score": 1,
          "created_utc": 1746207237.0,
          "replies": []
        },
        {
          "id": "mq120u1",
          "author": "None",
          "body": "don’t dwell in gloom",
          "score": -9,
          "created_utc": 1746111624.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq24waa",
      "author": "Died_Of_Dysentery1",
      "body": "Prob doesn't help that their power cables are melting...",
      "score": 10,
      "created_utc": 1746122950.0,
      "replies": []
    },
    {
      "id": "mq2bh1g",
      "author": "flexonyou97",
      "body": "I saw in japan a few weeks ago they had the 5070 at like $1200, who would even buy them at that price lol",
      "score": 7,
      "created_utc": 1746124897.0,
      "replies": []
    },
    {
      "id": "mq33gfh",
      "author": "Dude-e",
      "body": "That’s a good start. Still insane though. Where I am, guess what a 5060 Ti 16GB is sold at by a big box retailer?\n.\n.\n. \n~860 USD. Fucking insane and outright insulting",
      "score": 8,
      "created_utc": 1746133019.0,
      "replies": []
    },
    {
      "id": "mq41d5g",
      "author": "Leander_Tee",
      "body": "5080‘s still sit at above 1.100€, which is way too overpriced for what that thing is. Meanwhile I can get a 9079XT for around 750€, it’s insane how a non improvement to the previous generation costs more while have even more issues.",
      "score": 5,
      "created_utc": 1746144174.0,
      "replies": []
    },
    {
      "id": "mq17776",
      "author": "PM_ME_STEAM_KEY_PLZ",
      "body": "And the fact the connectors are burning up due to a horrible design.",
      "score": 9,
      "created_utc": 1746113145.0,
      "replies": []
    },
    {
      "id": "mq36l6h",
      "author": "PhotonWolfsky",
      "body": "I'm sitting here shopping for a 5070 Ti, I see $950 and I'm like, \"damn, that's a good deal\"\n\nWhat a world, huh...? Then again, with an MSRP of $750, which is more or less just a \\*suggestion\\* price, I was literally never expecting it to be that low... ever.",
      "score": 3,
      "created_utc": 1746133957.0,
      "replies": []
    },
    {
      "id": "mq9bzp0",
      "author": "Bubbaganewsh",
      "body": "The 5090 is around $4k in Canada, I wonder how well they are selling here. I paid $2500 for a 4090 some time ago and I thought that was insane, 5090 pricing is past insane to me.",
      "score": 2,
      "created_utc": 1746217300.0,
      "replies": []
    },
    {
      "id": "mq2tfai",
      "author": "Ghozer",
      "body": "\"Strong Euro\" - The Pound is still stronger, we haven't really seen a drop in prices....\n\nwe have always been screwed over for prices on hardware etc, companies will often charge the same number (not value) in all countries...\n\nThere are many cases of things being say, $200, £200, €200 - and when you work it out, we're actually paying more for the same item...\n\nIt's not the case for everything, but I have seen it quite often!",
      "score": 1,
      "created_utc": 1746130131.0,
      "replies": []
    },
    {
      "id": "mq219rv",
      "author": "shockthemonkey77",
      "body": "What should I upgrade my 3070 to? AMD speaking plz",
      "score": 1,
      "created_utc": 1746121902.0,
      "replies": [
        {
          "id": "mq9syem",
          "author": "Blapanda",
          "body": "Your best shot will be an AMD 9070 XT card, recommended brands would be XFX or Sapphire (I prefer later, they are stable in over- and underclocking and -volting).",
          "score": 1,
          "created_utc": 1746222480.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq9s5eh",
      "author": "Blapanda",
      "body": "Yea ... still +1000 €. A big fat no from my side. Still waiting for the 9070 XT to drop prices (not gonna pay 100 bucks over MSRP, and I will stick to that. Greedy retailers need to be regulated with our pockets), and then I am going to have a proper GPU after more than 8 years of waiting for a fucking proper price on those damned cards. Fuck me.",
      "score": 1,
      "created_utc": 1746222218.0,
      "replies": []
    },
    {
      "id": "mqau0q0",
      "author": "GarbageThrown",
      "body": "I’m not German. I was planning on buying a 5090, but not after I found out how the design is a fire hazard. Now I wouldn’t get one even deeply discounted. It’s not worth burning down my house.",
      "score": 1,
      "created_utc": 1746235506.0,
      "replies": []
    },
    {
      "id": "mq2otma",
      "author": "SomewhatOptimal1",
      "body": "I love the doomsday Reddit users and YouTubers. \n\nWhere are you at now? Eh!\n\nWhenever I was saying that like 4000 series, 5000 series will sell below msrp in Europe. I mean 4080 super decreased the msrp to 1000€ and was still selling below that. Likewise 4070 super! \n\nI was either downvoted to hell or my comments were the most controversial. Guess what! \n\nDoomsdaying just sells and clicks well! That’s all there is to it!",
      "score": 0,
      "created_utc": 1746128807.0,
      "replies": [
        {
          "id": "mq2rfjb",
          "author": "DinerEnBlanc",
          "body": "American redditors can’t fathom the idea that Europeans are having it better in anything",
          "score": 5,
          "created_utc": 1746129552.0,
          "replies": []
        }
      ]
    }
  ]
}