{
  "post": {
    "title": "WSJ: Some Apple Vision Pro Buyers 'Feel Total Regret'",
    "author": "BlueLightStruct",
    "id": "1koc062",
    "score": 1167,
    "created_utc": 1747429921.0,
    "selftext": "",
    "num_comments": 396,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1koc062/wsj_some_apple_vision_pro_buyers_feel_total_regret/"
  },
  "comments": [
    {
      "id": "mspr0pm",
      "author": "None",
      "body": "I demoed it in the store. Pure magic. They did a demo 3D video at a kid’s birthday and when they blew out the candles I recoiled at the smoke in my face. Still, no way in hell will I pay $3,500 for it.",
      "score": 765,
      "created_utc": 1747440324.0,
      "replies": [
        {
          "id": "msqk336",
          "author": "Albert_Caboose",
          "body": "It feels like something Disney would incorporate into a ride/experience. It doesn't feel like a product you own that serves a purpose",
          "score": 354,
          "created_utc": 1747451644.0,
          "replies": [
            {
              "id": "msqnvxg",
              "author": "GoodAsUsual",
              "body": "It seems like a product without a viable market, i.e. a solution without a problem.",
              "score": 175,
              "created_utc": 1747453347.0,
              "replies": [
                {
                  "id": "msroipr",
                  "author": "JagsAbroad",
                  "body": "Nah, I’d absolutely get one if it was more affordable. I love the idea of using one on a plane or the AR features. \n\nOne use case I’d do is if it was comfortable enough, I’d use it while cooking/baking. I love the idea of having a timer floating to my left and the recipe open on the right while recording the whole thing POV. I’m constantly glancing at my iPad while moving it around so it doesn’t get damaged.",
                  "score": 54,
                  "created_utc": 1747474466.0,
                  "replies": [
                    {
                      "id": "mst7dp6",
                      "author": "Akrevics",
                      "body": "I'd watch movies on it all day, just not for 3500. I don't even care if it's not in 4k, watching movies even in 2k for about 1500 whatever for a more plastic one would be more worth it.",
                      "score": 14,
                      "created_utc": 1747497585.0,
                      "replies": [
                        {
                          "id": "mswn5j7",
                          "author": "Yodiddlyyo",
                          "body": "You can literally do this right now. There are tons of them. Get the newest quest, it's like 500 bucks and you can watch movies and do AR stuff.",
                          "score": 1,
                          "created_utc": 1747543025.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mst8jnj",
                      "author": "Tibbaryllis2",
                      "body": "> Nah, I’d absolutely get one if it was more affordable. I love the idea of using one on a plane or the AR features.\n\nThat’s kind of the point u/GoodAsUsual is making though, right? \n\nThere isn’t really a market for bakers/chefs using a multi-thousand dollar headset as a convenient timer. \n\nNow, if it was priced in the $500-1000 range, maybe there is more of a market amongst tradespeople. \n\nBut even then, it would need a major redesign to incorporate features and materials that make it appropriate for that application.  Like u/erfivor said, it’s probably something not intended to be used around steam, splattering oil, the heat blasting out the open oven door, etc.",
                      "score": 7,
                      "created_utc": 1747497965.0,
                      "replies": []
                    },
                    {
                      "id": "mssild0",
                      "author": "Erfivur",
                      "body": "I just wouldn’t want a device like that, with screens and cameras, around steam and sauces/oils.\n\nIt sounds like a great idea but practically I think the ends up being unhygienic.",
                      "score": 26,
                      "created_utc": 1747489228.0,
                      "replies": [
                        {
                          "id": "mst4fb7",
                          "author": "buzzerbetrayed",
                          "body": "dazzling spotted fuel vanish ask yoke pie meeting carpenter silky\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                          "score": 3,
                          "created_utc": 1747496636.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mswjth3",
                      "author": "kneemahp",
                      "body": "Is the pass through that accurate to cut vegetables with a knife? I imagine there’s some tiny disconnect between looking at your hands on a screen and where they actually are.",
                      "score": 1,
                      "created_utc": 1747541360.0,
                      "replies": []
                    },
                    {
                      "id": "mswzgde",
                      "author": "tacacsplus",
                      "body": "Yep, add this to the list of unexpected perks — the Apple Vision Pro can actually help keep your eyes from burning while chopping onions!",
                      "score": 1,
                      "created_utc": 1747549910.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "msr925j",
                  "author": "Juggernox_O",
                  "body": "It’s… I just can’t afford $5,000. If it somehow paid for itself, sure. But even if it’s truly the ultimate toy ever, I can’t afford $5,000.",
                  "score": 35,
                  "created_utc": 1747464618.0,
                  "replies": [
                    {
                      "id": "msread6",
                      "author": "Vietzomb",
                      "body": "$5,000 is a lot of money, period. But as more an *accessory*? Just not going to cut it.\n\nSure, if someone had the spare cash and buying something like this as an alternative to a computer (we’re not even really there yet) may be different. My grandparents paid more than that for their first Mac and Printer in the 80’s if memory serves correct. But again, they were among a small percentage of people who could afford to buy something like that.",
                      "score": 22,
                      "created_utc": 1747467846.0,
                      "replies": [
                        {
                          "id": "msrnfzx",
                          "author": "mcAlt009",
                          "body": "If it was a full Mac that I could develop with, and my company paid for it, AND it made me 50% more productive, it would be a great investment. \n\nIt's not.\n\nIt's a heavy, fragile device. Most programmers ( at least a purality) wear glasses. That means I have to buy inserts or something. Whatever. \n\nGets hot. \nBattery is bad. \n\nThe Quest 3s does 90% of what it can for 300$. \n\nAt 300$ I don't care if I end up putting it in a closet.",
                          "score": 23,
                          "created_utc": 1747473758.0,
                          "replies": [
                            {
                              "id": "mssp3x9",
                              "author": "vcsx",
                              "body": "I *do* think it's cool that prescription inserts can be seamlessly integrated into the headset though.\n\nStill, not paying $3500 and another $150 for the full experience.",
                              "score": 7,
                              "created_utc": 1747491590.0,
                              "replies": [
                                {
                                  "id": "msssj84",
                                  "author": "ToMorrowsEnd",
                                  "body": "Vr Optical sells the inserts to your perscription for $45  there are about 6 optical places that sell the inserts.  you dont have to buy accessories from apple.",
                                  "score": 3,
                                  "created_utc": 1747492750.0,
                                  "replies": []
                                },
                                {
                                  "id": "msxekxr",
                                  "author": "mok000",
                                  "body": "This comment probably doesn't belong here, but the device really ought not rely on a screen in front of your eyes, but rather draw the image directly onto your retina with lasers or something. Then it would be able to correct for whatever it is the glasses correct. The main problem with the device however, is not how it works but that you feel and look like an idiot wearing it on your face.",
                                  "score": 1,
                                  "created_utc": 1747559339.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mst7l0v",
                              "author": "Akrevics",
                              "body": "if you're not paying for it, it doesn't matter how much it costs and its' not an investment you're involved in.",
                              "score": 1,
                              "created_utc": 1747497651.0,
                              "replies": []
                            },
                            {
                              "id": "mswavq6",
                              "author": "eyeronik1",
                              "body": "The tech just isn’t there yet. Doing real work on the Quest 3 is impossible because the resolution is too low to read text and the price and fragility of the Vision Pro makes it a non starter. We’ll get there in a few years.",
                              "score": 1,
                              "created_utc": 1747537246.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mssnmu7",
                      "author": "BurritoLover2016",
                      "body": "Well it’s $3500 so can you afford that?\n\nEdit: Apparently my joke about the price being slightly different was a little too dry and went over a few people’s heads.",
                      "score": 2,
                      "created_utc": 1747491076.0,
                      "replies": [
                        {
                          "id": "msu4y5j",
                          "author": "Cowicidal",
                          "body": "Even the most basic model with tax and Applecare is going to make it over $4000.00 unless you can pick up a used one maybe?",
                          "score": 2,
                          "created_utc": 1747508492.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "msw7rp3",
                  "author": "no6969el",
                  "body": "It would be more useful to the PVCR crowd if it wasnt so locked down.",
                  "score": 2,
                  "created_utc": 1747535904.0,
                  "replies": []
                },
                {
                  "id": "msrqdpd",
                  "author": "ProfessorFunky",
                  "body": "I don’t know, I think it’s more no viable market at that price point.\n\nIf it was <€500 and I could do productivity stuff hooked to my Mac on it I’d be all over it. Or MacBook prices and with similar performance as a standalone thing.\n\nMy feel is that they’re aiming to replace the iPhone with it, and I just don’t see how it will ever do that.",
                  "score": 1,
                  "created_utc": 1747475661.0,
                  "replies": []
                },
                {
                  "id": "mss8mmi",
                  "author": "alfalfa-as-fuck",
                  "body": "Porn. That’s the viable market.",
                  "score": 1,
                  "created_utc": 1747485220.0,
                  "replies": []
                },
                {
                  "id": "mstlwbc",
                  "author": "PrimeIntellect",
                  "body": "I don't know almost anyone who has or uses VR at all. There's one guy at my work who had it for a bit and we all tried it once to play some games and it was quickly forgotten. While it was on my head it was pretty wild but also, it seems like an even more soul sucking screen experience which most people want to do less of? Like the last thing I want is more invasive digital things stealing my time",
                  "score": 1,
                  "created_utc": 1747502278.0,
                  "replies": [
                    {
                      "id": "mstnv0v",
                      "author": "DarthBuzzard",
                      "body": "Addiction will always lead people down a bad path, but that aside I'd say digital experiences will be healthier and more engaging in VR, basically less brain rot.",
                      "score": 1,
                      "created_utc": 1747502899.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "msto1xq",
                  "author": "SeaworthinessNo1920",
                  "body": "well you can jack off to whoever you want in 3D .Only if they had haptic feedback to the p3ni5 would it have had real meaning",
                  "score": 1,
                  "created_utc": 1747502960.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mss0wja",
              "author": "Majinmmm",
              "body": "I think I’d use it in bed",
              "score": 1,
              "created_utc": 1747481649.0,
              "replies": []
            },
            {
              "id": "mst7xu6",
              "author": "Intarhorn",
              "body": "I think it could be very good for productivity. Being able to move notes and files around the room and quickly get what you need without having to use a mouse or a touch screen might be a bigger improvement then most expect. Also gives a lot more flexibility and ability to be creative I think. It’s just not worth that money tho, it would have to be half that and probably even a bit more for it to actually be worth it for most people",
              "score": 1,
              "created_utc": 1747497767.0,
              "replies": [
                {
                  "id": "mst9fse",
                  "author": "Albert_Caboose",
                  "body": "Yeah, when it comes to virtual workstations the Quest 3 does a pretty great job of it, for 20% the cost.",
                  "score": 1,
                  "created_utc": 1747498251.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msvx73p",
              "author": "seanmg",
              "body": "Paired with a Mac laptop it's insane how well my setup while traveling rivals my home setup.\n\nThe trick with it is comfort.  It's not one size fits all, and getting it dialed in for your face specifically really makes the difference.",
              "score": 1,
              "created_utc": 1747531516.0,
              "replies": []
            },
            {
              "id": "mt2x1xd",
              "author": "Rymanjan",
              "body": "I got a quest pro and, while I don't necessarily regret it, I def don't use it nearly as much as I should to justify the pricetag. I'll go on binges for a couple days where I remember it's cool as shit, then just stop using it cuz I get nauseous or tired and then don't pick it up for a few months",
              "score": 1,
              "created_utc": 1747635843.0,
              "replies": []
            },
            {
              "id": "msrcvu7",
              "author": "DontMindMeTrolling",
              "body": "No that’s way too expensive to manage. Think about how they do it now. You get 3D glasses, a cheap pair, at the start of the ride and drop them all in a bin after. There are kids of all ages, adults, geriatrics, to give them all a pair of 3500 equipment, explain to them how it works, hook it up for them, none of it is economical.",
              "score": 0,
              "created_utc": 1747466966.0,
              "replies": [
                {
                  "id": "mssiasf",
                  "author": "Nesaru",
                  "body": "Disney used to have a ride at Disney Quest where you sat on this bicycle seat thing, put on a vr headset, and flew the magic carpet through Agrabah to help Aladdin defeat Jaffar. All controlled by you leaning on the platform and looking around.\n\nIt was pure magic at the time. I’m sure it cost way more than $3500 each. \n\n\nThe Harry Potter store in NYC also had a broom flying experience that was the same deal. Except you also had a wand that was motion tracked and you flew around fighting death eaters.\n\nThere’s certainly a space for this and I expect we’ll see more of it. It’s just not what Apple intended with the Vision Pro.",
                  "score": 9,
                  "created_utc": 1747489116.0,
                  "replies": [
                    {
                      "id": "mssj41r",
                      "author": "DontMindMeTrolling",
                      "body": "Bro you’re talking about a one person experience we are speaking about scale and you’re sure it cost more? I’m sure it costs money, are you sure of anything else?",
                      "score": -4,
                      "created_utc": 1747489423.0,
                      "replies": [
                        {
                          "id": "mssji12",
                          "author": "Nesaru",
                          "body": "One person? This was a RIDE at DISNEY. yes it’s a personal experience but thousands of people went through that line and rode that ride each day.\n\nAnd yes, even the simplest ride in Disney world costs more than $3.5k a seat. And VR technology in the early 2000’s was not a household expense. I’m sure about that.",
                          "score": 4,
                          "created_utc": 1747489570.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "msrvdky",
                  "author": "brianbamzez",
                  "body": "Well, it can’t be too expensive since a lot of these rides exist. Europapark alone has a handful of them where people ride a conventional rollercoaster wearing 3d goggles (cheaper ones though, for sure no 3.5k apple goggle.) many of them are older kids‘ rides, too. One of the rides (one of their older hallmark rides, is it Eurosat?) even has a virtual reality waiting line/entrance area where you walk from the entrance to the coaster wearing the goggles while walking through an intro action scene and even seeing the other passengers in VR.\n\nYou don’t have to explain a whole lot about how it works since all you have to do is put it over your face and maybe tighten the straps a bit. You don’t have to hook anything up. The goggles are collected by staff and disinfected after.\n\nSo this is very much doable…",
                  "score": 3,
                  "created_utc": 1747478708.0,
                  "replies": [
                    {
                      "id": "mssc9nz",
                      "author": "DontMindMeTrolling",
                      "body": "Bro your own comment you started w saying it exists w cheaper versions ie this will never happen aka my point aka your reply is pointless af thanks for proving my point.",
                      "score": -3,
                      "created_utc": 1747486737.0,
                      "replies": [
                        {
                          "id": "mssq42a",
                          "author": "brianbamzez",
                          "body": "Exists with actual Vr goggles, not with the polarized film „sunglasses“ that you mentioned. Of course no one is using Apple Vr goggles for that but the ones they use are functionally identical. Actual VR goggles. Not 3d glasses.\n\nUsername checks out…",
                          "score": 3,
                          "created_utc": 1747491934.0,
                          "replies": [
                            {
                              "id": "mssrztt",
                              "author": "DontMindMeTrolling",
                              "body": "Finally somebody gets it",
                              "score": 0,
                              "created_utc": 1747492573.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "msrljl8",
              "author": "BravestCashew",
              "body": "What if it cost $300? Or $1000?",
              "score": 0,
              "created_utc": 1747472502.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msq2p01",
          "author": "bgarza18",
          "body": "It was as one of the coolest tech experiences ever, I was smiling the whole time. Ain’t no $3500 cool tho lol ",
          "score": 90,
          "created_utc": 1747444767.0,
          "replies": [
            {
              "id": "msqfx3c",
              "author": "Themasterofcomedy209",
              "body": "Yeah exactly it’s cool but it’s not like “I NEED this” cool. I see no aspect of my life that Apple vision would provide a $3500 level amount of improvement lol",
              "score": 28,
              "created_utc": 1747449885.0,
              "replies": [
                {
                  "id": "msqum1d",
                  "author": "smurb15",
                  "body": "They will sell a few hundred, maybe a thousand to the core of apple weirdos but that's ridiculous for the price of a vehicle",
                  "score": -2,
                  "created_utc": 1747456584.0,
                  "replies": [
                    {
                      "id": "msqwl7y",
                      "author": "Head_Lock6779",
                      "body": "Brother where are you buying vehicles these days?",
                      "score": 9,
                      "created_utc": 1747457595.0,
                      "replies": [
                        {
                          "id": "msr08fi",
                          "author": "Rollerbladersdoexist",
                          "body": "Go to the side of town that is at least 80 years old. There’s a rundown motel on one corner, a smoke shop on the other and a Burger King. Well that last corner will be a car dealership with 7 cars on the lot, one of them will be $3,500. It’ll be a Ford Fusion, Nissan Altima or Chrysler 200, salvage title.",
                          "score": 20,
                          "created_utc": 1747459533.0,
                          "replies": [
                            {
                              "id": "mssanh4",
                              "author": "CandyCrisis",
                              "body": "The older Nissan Leafs will be even less! Range, 15 miles.",
                              "score": 3,
                              "created_utc": 1747486073.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "msqyye8",
                          "author": "smurb15",
                          "body": "Not a dealership I can tell you that much",
                          "score": 5,
                          "created_utc": 1747458842.0,
                          "replies": []
                        },
                        {
                          "id": "msv7dtv",
                          "author": "snackelmypackel",
                          "body": "Used lots and older used vehicles off places like craigslist",
                          "score": 1,
                          "created_utc": 1747521643.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mstv6hz",
                      "author": "CapcomGo",
                      "body": "Over 370k units sold lol",
                      "score": 1,
                      "created_utc": 1747505207.0,
                      "replies": []
                    },
                    {
                      "id": "msr3hby",
                      "author": "Ok-Camp-7285",
                      "body": "Bit of a weird comparison when vehicles can go from 300-100k+",
                      "score": -3,
                      "created_utc": 1747461338.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "msqwfsw",
          "author": "brandont04",
          "body": "Meta Quest 3 can do 85-90% of the vision pro for $500. It can even do that hand pinching gesture. \nAin't no way the last 10% is worth an extra $3000.",
          "score": 45,
          "created_utc": 1747457517.0,
          "replies": [
            {
              "id": "mst4mqd",
              "author": "None",
              "body": "[deleted]",
              "score": 11,
              "created_utc": 1747496703.0,
              "replies": [
                {
                  "id": "msu120h",
                  "author": "jonnablaze",
                  "body": "> and staring deep into the abyss by watching That Scene from Bladerunner 2049 in VR.\n\nEnlighten me!",
                  "score": 9,
                  "created_utc": 1747507174.0,
                  "replies": []
                },
                {
                  "id": "msxyu2s",
                  "author": "typo180",
                  "body": "I would seriously consider RTO if there was a Vision Pro at my desk. Though I'd probably want to go remote again after the novelty wore off. ",
                  "score": 1,
                  "created_utc": 1747570653.0,
                  "replies": []
                },
                {
                  "id": "msz14jz",
                  "author": "ShadowDV",
                  "body": "Where is the ROI though?  I’ve saved my department nearly $100,000 in outside consultant fees this year alone using Deep Research assistant, and I still can’t get them to go for the $30/month licenses for ChatGPT Teams for our department.",
                  "score": 1,
                  "created_utc": 1747584162.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msr1cme",
              "author": "curmudgeon69420",
              "body": "it's the Apple tag that adds the last $3k and fanbois will eat it",
              "score": 1,
              "created_utc": 1747460149.0,
              "replies": [
                {
                  "id": "mssls24",
                  "author": "Animanganime",
                  "body": "Find me one headset with the same resolution and pancake lens and also being stand alone and doesn’t need controllers while being micro OLED.",
                  "score": 10,
                  "created_utc": 1747490415.0,
                  "replies": [
                    {
                      "id": "mstrjmx",
                      "author": "HaMMeReD",
                      "body": "I.e. \"Doesn't need controllers\" is a really nice way to put it. I think you meant to say \"Doesn't support controllers\". \n\nThat first experience of \"I'm in VR\" was good on a Rift DK1, and the resolution was shit, the lenses were trash. Things like better optics, panel technology, resolution are incremental nice to haves that improve across all products over time.\n\nBut the industry was well formed before apple came to market. They knew what developers liked, what customers liked, and they were like \"naw, future of computing\" and came out with this totally dystopian product, like daddy is going to wear this at his 3yo's birthday to get the 3d recording so he can replay it on loop when he's in elder care.\n\nApple is like the narcissist of all companies, they are trying to re-invent the wheel just so they can be the revolutionaries and founders of the tech. But better screens don't make you the inventor of VR.",
                      "score": 7,
                      "created_utc": 1747504040.0,
                      "replies": [
                        {
                          "id": "msu9iwi",
                          "author": "adamcoe",
                          "body": "Shhhh, everyone knows Apple invented VR, cell phones, the Caesar salad, magnets, and electricity.",
                          "score": 1,
                          "created_utc": 1747510044.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mt1l8tg",
                      "author": "malachi347",
                      "body": "Pimax and Pico both have comparable products and are much less expensive. It's not like your spec loadout is some golden standard for AR/VR.",
                      "score": 0,
                      "created_utc": 1747614629.0,
                      "replies": [
                        {
                          "id": "mt1zgzx",
                          "author": "Animanganime",
                          "body": "But it is though if you’re into VR, I have used Pimax Crystal Light, Quest 1 2 3 and Pro, PSVR2, Bigscreen Beyond and HP reverb G2.\n\nThere are some headset like the meganex or bsb2 that is not out yet or the pimax dream air that is also not out yet that have somewhat comparable resolution and panel BUT they’re all wired to the PC",
                          "score": 1,
                          "created_utc": 1747619973.0,
                          "replies": [
                            {
                              "id": "mt9equh",
                              "author": "malachi347",
                              "body": "The dream air isn't wired, no? And Apple Vision doesn't have class-leading FoV either, so it's not a gold standard. If we're talking VR for gaming, that spec loading is even more subjective as it's personal preference at the end of the day anyways, if you're into sim racing or flight or space games, wires are the last thing you car about anyways since you're seated, and would rather have comfort and external GPU support.",
                              "score": 1,
                              "created_utc": 1747727687.0,
                              "replies": [
                                {
                                  "id": "mtapl43",
                                  "author": "Animanganime",
                                  "body": "It is wired. And I was replying to “$3000 of the $3500 is apple tax” and “other companies have comparable products for much less” which are both factually wrong.\n\nIt is definitely not perfect but to say it’s cheap to build is just not true.",
                                  "score": 1,
                                  "created_utc": 1747749765.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "msvc75e",
              "author": "sizeablescars",
              "body": "Meh if you count the lack of software/experiences developed for avp I’d say quest has 120% of it.",
              "score": 1,
              "created_utc": 1747523376.0,
              "replies": []
            },
            {
              "id": "msvicgv",
              "author": "Topikk",
              "body": "The Quest 3 also can be used to play real games because it knows what it is, and includes game controllers.\n\nThe Vision Pro thinks it’s a productivity tool, but it’s just a bad game console.",
              "score": 1,
              "created_utc": 1747525595.0,
              "replies": []
            },
            {
              "id": "mswbna6",
              "author": "Festering-Fecal",
              "body": "All those headsets are a gimmick and it gets old fast for most people.\n\n\nThe tech is cool and all but once you are out of honeymoon phase it's a 1 trick pony.\n\n\nI think augmented reality is more realistic if they can get it into a pair of glasses that don't look cartoonish.\n\n\nImagine going shopping and looking at a food item and it pops up what's in it and if it's healthy or not.\n\n\nImagine looking at something like a bottle of alcohol and it pops up what's in it and a warning because it's posion.\n\n\nOr having a heads up display for things.\n\n\nThe tech is there it's just not at that stage we're it's cheap enough for the consumer.",
              "score": 1,
              "created_utc": 1747537580.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mss9yjq",
          "author": "themanfromvulcan",
          "body": "Everything I’ve heard about it is that it’s so cutting edge it does live up to the hype.  However you have to be okay with the cutting edge price tag.  I think Apple sometimes is dammed if they do and damned if they don’t.  They wanted to make the best VR set money could buy that wasn’t say $20k.  I think they did this.  And in a few years they will come out with a cheaper version.\n\nPeople have buyers remorse all the time for all kinds of things.  I’m not quite sure if this is a news story just seems to be clickbait to me.",
          "score": 5,
          "created_utc": 1747485786.0,
          "replies": []
        },
        {
          "id": "msqxsd1",
          "author": "cerberus698",
          "body": "I've been saying this about most gadgets like this, including VR for gaming. There will always be an enthusiast niche for stuff like this but for so long as wearables are perceived as equipment having to be anchored to their body, it will remain something in the domain of niche interest. Very few people want to strap a VR head set to their body to play video games despite how interesting the technology may be. Similarly, very few people want to strap a head set to their body to preform functions that their phone can do in a less impressive but more efficient manner.\n\nI remember back in the early 2000s tech reporters were talking a lot about how in the future, video calls would replace phone calls. Instead texts largely replaced phone conversations and I'd imagine the average person who doesn't regularly video call for work has one maybe once a year. In the end, people will adopt the technology that lets them preform the desired basic function with as little complexity as possible. Most wearables only add complexity and abstract the basic function behind layers of additional interface.\n\nThis kind of technology, in my opinion, won't breakthrough to mainstream until its refined down into a package that is indistinguishable from a pair of sun glasses and has an interface that is at least as simple and undisruptive as a phone screen. Until then, it might be cool to watch a movie on something like this, but most people are still going to prefer the firestick remote UI on their TV.",
          "score": 13,
          "created_utc": 1747458222.0,
          "replies": [
            {
              "id": "mss9ujc",
              "author": "TheOtherMeInMe2",
              "body": "I'm inclined to disagree with one point you made. Video calls are absolutely used far more commonly these days than regular phone calls, even mostly among the younger crowd. Teenagers and very young adults do it all the time. I think it's a generational thing, but if the trend continues moving forward you will almost certainly see a time in another 20 years where people default to video calls for real conversations, relying on text for the more basic shit",
              "score": 12,
              "created_utc": 1747485738.0,
              "replies": [
                {
                  "id": "mssgrtu",
                  "author": "DarthBuzzard",
                  "body": "> you will almost certainly see a time in another 20 years where people default to video calls for real conversations, relying on text for the more basic shit\n\nI would be surprised if they have much existence by then, instead replaced by calls in VR/AR.",
                  "score": 1,
                  "created_utc": 1747488530.0,
                  "replies": [
                    {
                      "id": "msup5v0",
                      "author": "TheOtherMeInMe2",
                      "body": "Ah, but that's the main point rolling around in this thread. Will VR/AR ever become so simple, intuitive, and economical for the average person that that can be the norm. The tech for video calls is already in place and has been adopted by most, whether they use it or not. VR/AR is still an expensive and niche thing, that has a ways to go yet before as many people would even have the option. \n\n\nPlus....how would that even work? Like literally speaking, how do i talk to someone in VR/AR without a whole ass hardware setup and digital environment to load in to?",
                      "score": 2,
                      "created_utc": 1747515210.0,
                      "replies": [
                        {
                          "id": "msuqznm",
                          "author": "DarthBuzzard",
                          "body": "In 20 years, I think we're talking a normal pair of glasses that effectively reads your mind for controlling the interface, via an EMG wristband and eye-tracking. Not technically mind reading, but it would feel like it. I expect that would be simpler than any phone.\n\nIf you want to talk to someone in AR, you'd just call them and they'd appear as a hologram in your real room. For VR, you'd probably open a portal in your room that takes you to a shared virtual environment.",
                          "score": 1,
                          "created_utc": 1747515819.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mssw0uk",
              "author": "pinkynarftroz",
              "body": "Honestly I don't think even sunglasses type displays would make VR mainstream. You couldn't even convince people to wear cheap light glasses for 3D movies / TV.\n\nI think nothing short of either holodeck or matrix jacking would gain a critical mass. Of course, both those things ain't happening.",
              "score": 1,
              "created_utc": 1747493911.0,
              "replies": []
            },
            {
              "id": "mstm5j4",
              "author": "PrimeIntellect",
              "body": "I disagree, in the work and corporate world video calling and video conferencing has completely taken over, and I am doing multiple video calls a day, every day, for hours",
              "score": 1,
              "created_utc": 1747502358.0,
              "replies": [
                {
                  "id": "mstncsu",
                  "author": "cerberus698",
                  "body": "Just read it again,  I specifically said it's mainly used in work.",
                  "score": 1,
                  "created_utc": 1747502740.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msz1yi2",
              "author": "ShadowDV",
              "body": "Walk through a college campus.  If anyone is on the phone, 90% chance it’s a video call.\n\nSource: live in a college town",
              "score": 1,
              "created_utc": 1747584428.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msqenwq",
          "author": "pacmanic",
          "body": "Plus a bunch of “influencers” doing vids like it’s the future. Zero of them still using it today.",
          "score": 9,
          "created_utc": 1747449388.0,
          "replies": [
            {
              "id": "msr8we7",
              "author": "Elastichedgehog",
              "body": "Eddy Burback's video was good.",
              "score": 5,
              "created_utc": 1747464522.0,
              "replies": []
            },
            {
              "id": "msst77c",
              "author": "ToMorrowsEnd",
              "body": "100% of those influencers packed them back up and returned them after makign the videos.   just like they do for all other electronics reviews, they all buy, review and return to the store.",
              "score": 2,
              "created_utc": 1747492974.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msrno9g",
          "author": "Dracogame",
          "body": "That’s VR in general. \n\nIt’s cool but ultimately unpractical. Even for games, it’s cool but absolutely a niche product",
          "score": 2,
          "created_utc": 1747473910.0,
          "replies": []
        },
        {
          "id": "mss0tvx",
          "author": "Majinmmm",
          "body": "I feel like I’d totally drop 1300 on one",
          "score": 1,
          "created_utc": 1747481613.0,
          "replies": []
        },
        {
          "id": "mssveku",
          "author": "pinkynarftroz",
          "body": "This is VR/AR in a nutshell. \n\nOh hey this is kinda cool. But I would not use this past that initial period of fascination.",
          "score": 1,
          "created_utc": 1747493708.0,
          "replies": []
        },
        {
          "id": "mst2ye6",
          "author": "tahmorex",
          "body": "There’s a lot of potential uses for it; software and pricing just haven’t  got there yet.  Bulkiness is still an issue as well. \n\nI’m an insurance adjuster for residential/commercial buildings- and when the app that takes everything I see and makes an Xactimate sketch and takes photos is ready; I’m there. The iPhone app has the beginnings of it; but the Vision Pro would make it amazing.",
          "score": 1,
          "created_utc": 1747496168.0,
          "replies": []
        },
        {
          "id": "mstaiuj",
          "author": "hardolaf",
          "body": "You can get the same experience from a PSVR2 for 1/7 of the price.",
          "score": 1,
          "created_utc": 1747498604.0,
          "replies": []
        },
        {
          "id": "mstkd46",
          "author": "HaMMeReD",
          "body": "Did you have a lot of VR experience before hand?\n\nI also tried it in the store, and it definitely had it's strong pro's.\n\nBut it also had strong cons. I.e. the puck, the fact that usage was basically designed to minimize interaction (sit and pinch is boring, and I do not like eye tracking much), and the fact that after I clicked around for 3 minutes or so, I was pretty much done with nothing interesting.\n\nSeeing things like ipad/iphone games actually was kind of a negative. Like it's a really good feature, but it feels very underwhelming, like this is gaming on this thing?\n\nLike I won't lie. The writing on the wall was very obvious. The barrier to entry was super high, a lot of VR devs don't use mac in their development pipeline. They aren't going to spend $10k/seat on mac's and vision pro's to port their titles to a platform that is demanding \"hey, hand tracking only\".\n\nEdit: If apple gets the next one down to <=$1,500 we'll probably see more adoption. They are going to have to drop a lot of that expensive crap and bad decisions though. I.e. no puck, dumb external displays, use some fucking plastic (sorry, metal and glass is shit design choice for a headset) and incorporate motion controllers as an option. VR gaming is better with something in your hand.\n\nApple really forgets that core-thing they deliver is technology, and they waste time on cnc braided straps or milled titanium. Just give me a VR headset that looks like a OG imac. I'm probably using the thing when I'm home alone, why does it need to look that good, and you'll always look dumb with a VR headset on, making it titanium (or whatever they use, I don't care) doesn't make it less dorky.",
          "score": 1,
          "created_utc": 1747501787.0,
          "replies": []
        },
        {
          "id": "msttkxb",
          "author": "coltonmusic15",
          "body": "I had an idea today about developing an app that realtors can purchase that would allow open house walkers to load their own furniture and images into a catalogue prior to walking homes and then put on the Apple vision goggles to walk through an open house and basically see it as if all their personal belongings were already setup in the home. Just seems like people would be more apt to making a purchase of a lifetime if they could envision themselves in the space. I’m sure now someone will use AI to make the app and make that sweet sweet founder $$. Remember me well.",
          "score": 1,
          "created_utc": 1747504687.0,
          "replies": []
        },
        {
          "id": "msw7mhr",
          "author": "no6969el",
          "body": "I definitely wouldn't pay that for the Apple headset specifically but as my preorder with Pimax shows I'm willing to pay (and I'm sure others too) if the product has the specs I want and is usable.",
          "score": 1,
          "created_utc": 1747535842.0,
          "replies": []
        },
        {
          "id": "msrjyou",
          "author": "catify",
          "body": "I demoed it at the store and was completely underwhelmed, as a diehard Apple fan but owner of the HTC Vive and Quest. The VP was simply not the generational leap in tech and UX that you’d expect from Apple entering a new market.",
          "score": 1,
          "created_utc": 1747471477.0,
          "replies": []
        },
        {
          "id": "mssl77d",
          "author": "Advanced-Prototype",
          "body": "It would be $2917 without the 20% Trump tariff from his first term. Still too rich for me.",
          "score": -1,
          "created_utc": 1747490203.0,
          "replies": [
            {
              "id": "msstdcs",
              "author": "ToMorrowsEnd",
              "body": "trump tarrifs now make it $4500",
              "score": 1,
              "created_utc": 1747493031.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mspc3lp",
      "author": "Pretend-Disaster2593",
      "body": "If you had that type of money to drop on a gadget in the first place, then there shouldn’t be any regrets anyway",
      "score": 467,
      "created_utc": 1747434236.0,
      "replies": [
        {
          "id": "mspkz6z",
          "author": "Armored_Guardian",
          "body": "Like Cybertruck buyers. You have this piece of junk because you have lots of money and no taste",
          "score": 166,
          "created_utc": 1747438084.0,
          "replies": [
            {
              "id": "mstgngs",
              "author": "JimBob-Joe",
              "body": "More money than brains",
              "score": 9,
              "created_utc": 1747500600.0,
              "replies": [
                {
                  "id": "msvorit",
                  "author": "JohnLocksTheKey",
                  "body": "“Bingo-bango”\n\n\\- Funbucket",
                  "score": 5,
                  "created_utc": 1747528105.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mspn60e",
              "author": "Nduhunk",
              "body": "How is the vision pro a piece of junk? You all say the most stupid things on this sub",
              "score": -76,
              "created_utc": 1747438890.0,
              "replies": [
                {
                  "id": "msqd085",
                  "author": "hawkinsst7",
                  "body": "\n>How is the vision pro a piece of junk? You all say the most stupid things on this sub\n\nI mean, it's right there in the article. It's too heavy and hurts to use for lengthy sessions, the boot up takes too long, app support is lacking.\n\nFor a $4000 gadget from Apple, even with the Apple premium, I think underwhelming real life performance like this can absolutely be called a piece of junk.\n\nLike, if it's ~~regulated~~relegated to sit unused because of the issues, that's junk.",
                  "score": 49,
                  "created_utc": 1747448738.0,
                  "replies": [
                    {
                      "id": "msr9z0k",
                      "author": "LordWom",
                      "body": ">Like, if it's regulated to sit unused because of the issues, that's junk\n\nRelegated is the word you're looking for",
                      "score": 12,
                      "created_utc": 1747465160.0,
                      "replies": [
                        {
                          "id": "mssehyg",
                          "author": "hawkinsst7",
                          "body": "Thank you. It'd be so easy to blame autocorrect, but I'm really a stickler about using words properly, and I truly had no idea.",
                          "score": 5,
                          "created_utc": 1747487636.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mssp3kp",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1747491587.0,
                      "replies": [
                        {
                          "id": "mst0ox4",
                          "author": "Hangmeouttodry101",
                          "body": "Yeah, people calling it a piece of junk have almost certainly not used it. \n\nGoofy looking expensive and awkward, yes… but it is very far from junk. Folks should go demo one - it’s very fun and is likely indicative of where advanced tech is going next: AR, VR, private computing experiences. \n\nIt needs fine tuning, but even in its current bulky state - is near magical feeling tech.",
                          "score": 0,
                          "created_utc": 1747495433.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "msqr61i",
                  "author": "HotdoghammerOG",
                  "body": "Any VR you can’t sim race with is a piece of junk in my book.",
                  "score": 13,
                  "created_utc": 1747454889.0,
                  "replies": [
                    {
                      "id": "mss6y0h",
                      "author": "cannibalcorpuscle",
                      "body": "Found the actual VR user with taste.",
                      "score": 5,
                      "created_utc": 1747484480.0,
                      "replies": []
                    },
                    {
                      "id": "mst4ayc",
                      "author": "MrWildspeaker",
                      "body": "I’m sure there are better setups/games, but GT7 on PSVR2 is pretty incredible.",
                      "score": 1,
                      "created_utc": 1747496597.0,
                      "replies": [
                        {
                          "id": "mst4iiw",
                          "author": "HotdoghammerOG",
                          "body": "I only have a quest. I have GT7 but have never done it in VR. It looks awesome.",
                          "score": 1,
                          "created_utc": 1747496665.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mspt2g5",
                  "author": "UlteriorEggos",
                  "body": "They've stopped supporting it a year in. The tech is there, but it's nothing without the software support.",
                  "score": 25,
                  "created_utc": 1747441092.0,
                  "replies": [
                    {
                      "id": "mspvxv8",
                      "author": "iconredesign",
                      "body": "What? No. This is total crap. A new visionOS just dropped.",
                      "score": 6,
                      "created_utc": 1747442182.0,
                      "replies": [
                        {
                          "id": "msrpamz",
                          "author": "copypaste_93",
                          "body": "A new os means fuck all if the app suport isn't there",
                          "score": 8,
                          "created_utc": 1747474968.0,
                          "replies": []
                        },
                        {
                          "id": "msqmg2w",
                          "author": "skajake3",
                          "body": "The Reddit hive mind has completely rotted from the inside out.",
                          "score": -14,
                          "created_utc": 1747452692.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mssmmc5",
                  "author": "weid_flex_but_OK",
                  "body": "Buddy if you're gonna talk smack you should at least read the article you know?",
                  "score": 2,
                  "created_utc": 1747490723.0,
                  "replies": []
                },
                {
                  "id": "msrp7b7",
                  "author": "copypaste_93",
                  "body": "Because it is useless tech. It can't do anything better than a desktop and the quest3 can do together",
                  "score": 1,
                  "created_utc": 1747474908.0,
                  "replies": [
                    {
                      "id": "msusp0t",
                      "author": "Whatifim80lol",
                      "body": "I gotta say, a year and a half into the Quest 3 launch and I'm still pretty glad I didn't 'upgrade' from my Quest 2. Quest 3 introduces a lot of problems the 2 just doesn't seem to have. I'll admit I'm pretty jealous of the full-color passthrough and MR, but \n\n- My rig hits just right with the Q2 resolution and would probably be a lateral move powering a Q3.\n\n- Q2 never dies. You can play and charge at the same time, no extra accessories needed.\n\n- By the time Q3 came out of mostly played all the VR games and experiences I was excited about.\n\n- I saved $500.\n\nJust taking what you said a step further, diminishing returns and all that.",
                      "score": 2,
                      "created_utc": 1747516404.0,
                      "replies": [
                        {
                          "id": "msuyxth",
                          "author": "copypaste_93",
                          "body": "Agreed, I only have the q2 as well",
                          "score": 1,
                          "created_utc": 1747518571.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mspp05g",
              "author": "DarthBuzzard",
              "body": ">  and no taste\n\nIf you're into VR/AR, you absolutely have taste because it's not for normies yet, lol.\n\nEdit: I forgot you're not allowed to like new gadgets in r/gadgets. Maybe r/antigadgets would be more receptive.",
              "score": -52,
              "created_utc": 1747439566.0,
              "replies": [
                {
                  "id": "msqe9g6",
                  "author": "cheesenachos12",
                  "body": "You can have no taste while also doing something normies dont do. Eating feces, for example.",
                  "score": 20,
                  "created_utc": 1747449233.0,
                  "replies": [
                    {
                      "id": "msqehg2",
                      "author": "DarthBuzzard",
                      "body": "True, but I dunno, being able to have really cool niche VR/AR experiences sounds like having taste to me.",
                      "score": -18,
                      "created_utc": 1747449319.0,
                      "replies": [
                        {
                          "id": "msqeoqx",
                          "author": "cheesenachos12",
                          "body": "Yeah, it's all up to opinion. And one does have to factor in the huge price tag too",
                          "score": 6,
                          "created_utc": 1747449397.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mspra5i",
          "author": "gtedvgt",
          "body": "That's not really how that works",
          "score": -16,
          "created_utc": 1747440422.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msqnuou",
      "author": "LessonStudio",
      "body": "I develop stuff in VR (Oculus). None of these are ready for primetime.\n\nThey are getting close in tech. The weight is still terrible, the battery is still terrible, and the resolution is almost there. \n\nPeripheral vision is not there at all. The FOV is getting wider, but it is still looking down a tube; an ever shorter tube, but human vision is around 200 degrees, and most headsets are around 100 degrees. \n\nWhat is entirely missing is the killer app. \n\nFor example, I would argue what drove people to windows in the early 90s was better printers. People wanted WYSISYG where they could edit on their screens what was going to come out of the printer. Everything else was more that windows was there, so people used it.\n\nFacebook itself only was really viable when younger people had their own computers. You didn't want to be 15 and using facebook on a common computer. This required a bunch of little tech to all be in place. Wifi, laptops, OK internet, etc. There could not be a facebook in 1989. Snapchat required phones with dataplans. People weren't going to use snapchat type apps on a desktop, nor would they use it without a halfway decent data plan. \n\nThis is the medium is the message. \n\nThese VR/AR headsets are very much a new medium. They are not monitors.\n\nOutside of a few niche markets (like I am in) I do not know what the message is.\n\nIf these new meta glasses actually work (good battery, etc) and they can make them less goofy looking. Then, I can think of 20 solid messages for that medium.\n\nWhen the first iPhone, iPod, iPad, etc came out, people could immediately see themselves using them. When the iPhone came out, it was clear. It was a phone, and it was an iPod. Later, people discovered it was also an app running monster, and after that, a great way to access the internet. But, the instant use case was front and center.\n\nThe problem I have with VR is that, even when I show people what I do, and get a fantastically \"Wow that is so Cool!!!!\" reaction. None of them want to even try it for a second time.\n\n\nI develop for VR and AR. I do not know what the heck the common use case was for the Apple Vision.",
      "score": 74,
      "created_utc": 1747453331.0,
      "replies": [
        {
          "id": "mswup1e",
          "author": "BrainKatana",
          "body": "Applications (or lack thereof) are the *third* biggest problem with HMDs right now. The first two are ergonomics and socialization, in that order.\n\nAn incredible app is irrelevant if using it is uncomfortable and I have to completely shut out the outside world to do so.\n\nIt has to be as lightweight as a pair of standard eyeglasses with a battery that lasts all day before it achieves the same amount of ubiquity as our phones.",
          "score": 13,
          "created_utc": 1747547087.0,
          "replies": [
            {
              "id": "msz3y2m",
              "author": "LessonStudio",
              "body": "100% agree. Weight is the \"killer feature\" in that it is killing their widespread adoption. \n\nBut, I would suggest that they don't have to get to a normal pair of glasses to get the adoption notably up.\n\nPersonally, I would be OK with a slightly fat pair of glasses, with a battery/computer sitting on my neck/shoulders. I suspect they could do this right now. If they gutted my present headset of its computer and battery, and then went carbon fiber, and maybe ultralight lenses, that they could reduce the weight of the existing oculus 3 by 60% or more.\nA this weight, I would seriously consider replacing my monitor. Especially for travel.\n\n\nIdeally, it gets down to a pair of glasses at some point in the future.",
              "score": 3,
              "created_utc": 1747585068.0,
              "replies": [
                {
                  "id": "msztnb1",
                  "author": "BrainKatana",
                  "body": "I feel like if it was as simple as “move the weight elsewhere” then it would be tackled by now, or at the very least there would be videos of people doing hardware mods on their Quests. My guess is latency.\n\nGeneral bulk, object center of gravity, and overall weight also factor in.\n\nI’ve done some of the commercial stuff like The Void and they get by with a “computer in a backpack” but the visors are still rather heavy so I assume there’s still quite a bit of hardware in the HMDs.",
                  "score": 1,
                  "created_utc": 1747593096.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "msqqv64",
          "author": "DarthBuzzard",
          "body": "Communication is the main use case. Hence why Zuck bets big on it.\n\nGaming, entertainment, fitness, live events, computing, media usage. Those last three are really relying on future advances.",
          "score": 8,
          "created_utc": 1747454744.0,
          "replies": [
            {
              "id": "msrtok3",
              "author": "zhrimb",
              "body": "They haven't made the real world horrible enough yet, to want to be stuck in a headset instead",
              "score": 2,
              "created_utc": 1747477704.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msw9y9t",
          "author": "technopaegan",
          "body": "Is anyone in your field developing their work with motion sickness in mind? Genuinely asking as I’m someone who gets motion sickness from any type of “perceived motion” through a screen. VR, first person POV games, simulation rides at theme parks etc. There’s so many video games I’d buy but can’t play because they’re in first person. The video game industry doesn’t seem affected by this, I assume that put me as someone not in their customer demographic. But whenever I read about all the possible ways VR could become a mass consumer product I have yet to see any mention of how it would deal with people who get motion sickness from it. Ipod, Iphone, Facebook, any revolutionary product/software etc didn’t make a percentage of the population throw up if they used it. I have to think this would be worked out if we want it to be the next technological staple?",
          "score": 2,
          "created_utc": 1747536840.0,
          "replies": [
            {
              "id": "msy08ie",
              "author": "SoulNuva",
              "body": "When I was studying and took a course for developing games/apps in VR, motion sickness was an issue that was brought up. There were solutions to lessen the impact such as tunneling the user’s vision, but ultimately it’s a biological issue that stems from our brain perceiving motion when our body is not. Some ways developers got around this issue was by allowing users to point and click places to teleport to, and I personally found that to be the most elegant solution that felt organic. But of course this has its own limitations especially in action games. \n\nIt’s been at least 5 years since I’ve taken the course, so I have no idea if there’s been any advancements in this area. I suspect that they have founds more ways to mitigate the issues as I see more VR games allowing users to walk around game maps. But I’m not sure if it’s because of improvements, or devs just not being aware of the motion sickness problem.",
              "score": 1,
              "created_utc": 1747571278.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msyxm1i",
          "author": "oh_shaw",
          "body": "If it weren't so heavy and unbearable for many hours, I would use the Vision Pro with something like Virtual Desktop to access my main work computer with great resolution as if I was there.  I could travel without a laptop, and just use Vision Pro and remote access.  But the Vision Pro is too heavy to wear for long.",
          "score": 2,
          "created_utc": 1747583045.0,
          "replies": [
            {
              "id": "msz4b16",
              "author": "LessonStudio",
              "body": "I haven't tried the vision pro. The oculus 3 resolution is almost good enough for a monitor replacement, and I would potentially use it for that if I had to.\n\nBut, with the O3 there is the same problem with weight. I would have to do some serious neck workouts to prepare for regular use. Maybe get one of those neck collars for whiplash.",
              "score": 1,
              "created_utc": 1747585184.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mswi3ie",
          "author": "0000000000000007",
          "body": "I agree with all of your points, except I don’t know if a killer app/use case can overcome the physical limitations of these devices. VR just leads to eye strain and sickness with prolonged use, and it even has a super high barrier to entry for older folks or people who are prone to motion sickness. \n\nAR may have less of that (I haven’t personally tried it), but I can’t imagine there’s no physical toll on the eyes and brain. And I wonder if we’re even hitting our physical and mental limits on phones. I recently heard a teacher describe her classroom time as “kids ‘coming down’ in-between ‘hits’ of phones and social media.”",
          "score": 3,
          "created_utc": 1747540529.0,
          "replies": [
            {
              "id": "mswnykb",
              "author": "LessonStudio",
              "body": "Here's a tiny hint of where I suspect really lightweight ones would be killer. I wear reading glasses. I need them for things within about 4 feet. After that, I have very good vision.\n\nThis is a pain in the bottom as I have to put my glasses on and off when I am using them and lifting them to work on my monitor.\n\nBut, I can read my monitor just fine with them on, and see in the distance with them. Except for the weird wobbly static thing, they are quite good at AR this way.\n\nI'm not saying they are good enough, but that it is cool to have \"perfect\" vision when they are on.\n\n\nAs for physical limitations. Keep in mind the best AR/VR hardware in 2025 will be yard sale junk in 2030. \n\nBut, with AR, I can see some super useless stuff, some very controversial stuff, and some fantastic stuff. Once AR can get past adding labels to stuff, it will be the next \"big thing\".\n\nThat said, labelling things will be pretty cool too.",
              "score": 1,
              "created_utc": 1747543431.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msskzi6",
          "author": "sinkiez",
          "body": "The hardware just isn't there",
          "score": 1,
          "created_utc": 1747490123.0,
          "replies": [
            {
              "id": "msuyqgp",
              "author": "LessonStudio",
              "body": "It's getting close. The jump from the oculus 2 to 3 was fantastic. If the weight was halved, and the resolution up by about 10%, I would seriously try out VR as a monitor replacement.",
              "score": 2,
              "created_utc": 1747518499.0,
              "replies": [
                {
                  "id": "msuzk09",
                  "author": "sinkiez",
                  "body": "I think the best vr we could have today would resemble the big screen vr headset with a battery pack/processing  package attached via USB that goes into your pocket. Wireless over tethered.",
                  "score": 1,
                  "created_utc": 1747518786.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "msxf5xg",
          "author": "Shoshke",
          "body": "I Have the Quest 3. Honestly I have mixed feelings.\n\nIt's a great for media. I love watching movies on it despite the bulk.\n\nBut for gaming, what I actually bought it for, it goes between underwhelming and straight up annoying.\n\nin headset games can be fun but they're pretty limited in scope and the shop is infested with crap like the android market.\n\nThen PCVR, omfg can the industry settle on a standard already? The rift was A DECADE AGO. yet connecting to a game is still an annoying fiddle. do you use the cable? you better have a fast enough one. What interface? FU that's what interface. There's steam there's openXR and good luck figuring out how to make the game actually look good.\n\nOh what want a slightly easier time? Shell out 50$ for a Wifi6 router and 30$ for an app and good luck with wide compatibility, oh and your games, still don't look sharp.\n\nI feel like every time I want to actually use the thing with my PC, I have gone back to pirating video games in the Windows XP days and have troubleshoot 10 different things when it really should be plug and play.",
          "score": 1,
          "created_utc": 1747559712.0,
          "replies": [
            {
              "id": "msz382c",
              "author": "LessonStudio",
              "body": "> shop is infested with crap\n\nI describe it to people as a \"flea market located in a travelling carnival\" \n\nI develop this stuff, and have trouble keeping my headset connected to my desktop. I have the proper networking gear, but link just turns itself off and on as fits its latest whim. Even wiring in with the cable is only marginally more stable.\n\nThere are some fundamentally basic things wrong with my oculus. For example. It will discharge when connected to my laptop, which can rapid charge a phone. It will discharge when I have very specifically turned it off. But somehow it is on again. \n\nAnd OMFG, I want those app store crap things to not be my desktop. I want to close them and have them stay closed, even if I power cycle. The same with the social media crap. \n\nThese sorts of things are why people aren't adopting them. Facebook thinks that this is the price you must pay to use their tech, but the reality is that it is pissing so many people off, that they don't have a chance of mass adoption.",
              "score": 1,
              "created_utc": 1747584836.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msxgpwj",
          "author": "sandspiegel",
          "body": "In my opinion the big breakthrough will be AR Glasses that can show you information in the real world. These will look like normal glasses but with a camera and a screen of sorts to show you information. Oh and of course AI built in. I would buy Gemini enabled glasses in a heartbeat. Google already showed a prototype off in the 60 minutes interview. This is what I want as a consumer.",
          "score": 1,
          "created_utc": 1747560709.0,
          "replies": []
        },
        {
          "id": "msyo69i",
          "author": "friso1100",
          "body": "This. I was an early adopter. I say \"was\" because while I still own my vr set it has been a long time since it has seen any use. To be fair part of that is because it's an htc vive which requires some setup before I can use it. I have considered getting something that you can just put on and be ready. But I really can't justify the cost. Even though I think \"I want to play games on it\" is a valid reason. most games I play aren't made for vr because why would they? It's a niche market.",
          "score": 1,
          "created_utc": 1747580005.0,
          "replies": []
        },
        {
          "id": "mt9b6o1",
          "author": "McSwan",
          "body": "It's counter-intuitive. I love it but I don't want another go. Maybe the killer app is glasses that tell you everything - ie. What stories a person wants to here about, what is that person name? - Eventually everybody would have to have one or you'll be a social outcast?",
          "score": 1,
          "created_utc": 1747725427.0,
          "replies": [
            {
              "id": "mtd1y7a",
              "author": "LessonStudio",
              "body": "Yup. I even see the terminator interface with suggestions on what to say.",
              "score": 2,
              "created_utc": 1747774511.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "msp1zpl",
      "author": "stjohns_jester",
      "body": "To be fair, most VR buyers feel this way after the first few days or weeks",
      "score": 365,
      "created_utc": 1747430820.0,
      "replies": [
        {
          "id": "msp3grx",
          "author": "Actually-Yo-Momma",
          "body": "These days it ain’t too bad since oculus quest is actually very reasonably priced. But yeah my homie built a 3k PC for VR and he used it for maybe a week lol",
          "score": 146,
          "created_utc": 1747431302.0,
          "replies": [
            {
              "id": "msp5ybx",
              "author": "kentonj",
              "body": "And as we all know, 3k PCs once used for VR are completely useless for other applications",
              "score": 159,
              "created_utc": 1747432123.0,
              "replies": [
                {
                  "id": "msp6coi",
                  "author": "cTreK-421",
                  "body": "Yea did he even try VR porn?",
                  "score": 91,
                  "created_utc": 1747432256.0,
                  "replies": [
                    {
                      "id": "msp8bgi",
                      "author": "ocelot08",
                      "body": "And we never saw him again",
                      "score": 58,
                      "created_utc": 1747432916.0,
                      "replies": [
                        {
                          "id": "msqg2j1",
                          "author": "Themasterofcomedy209",
                          "body": "Jerked himself into a being of pure light energy",
                          "score": 25,
                          "created_utc": 1747449945.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mspi8km",
                      "author": "iloveFjords",
                      "body": "Didn't try hard enough.",
                      "score": 4,
                      "created_utc": 1747437073.0,
                      "replies": []
                    },
                    {
                      "id": "mspngta",
                      "author": "tjoinnov",
                      "body": "That will be illegal soon",
                      "score": -6,
                      "created_utc": 1747438998.0,
                      "replies": [
                        {
                          "id": "msrw5ph",
                          "author": "brianbamzez",
                          "body": "If you spend 3k on a virtual porn machine I’m sure you’d be open to moving somewhere that isn’t Sweden or the Bible belt",
                          "score": 4,
                          "created_utc": 1747479150.0,
                          "replies": [
                            {
                              "id": "mstxssq",
                              "author": "Cowicidal",
                              "body": ">  the Bible belt\n\nThe fascists are attempting to make the entire US a theocratic dictatorship.\n\nsources —\n\nBill to make pornography a federal crime introduced by GOP senator\n\nhttps://www.independent.co.uk/news/world/americas/us-politics/porn-bill-mike-lee-republicans-b2750132.html\n\nMore:\n\nhttps://thehill.com/homenews/senate/5302555-porn-crime-republican-mike-lee/\n\nhttps://www.huffpost.com/entry/mike-lee-pornography-crime-project-2025_n_6824b8eee4b021b5064a974d\n\nSee Project 2025:\n\nhttps://www.project2025.observer/",
                              "score": 2,
                              "created_utc": 1747506076.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mspposi",
              "author": "thedoc90",
              "body": "I used my oculus rift s quite a bit, my only regrets rbh are not buying a steam vr headset instead, since I switched to Linux my Rift-S is basically a brick.",
              "score": 8,
              "created_utc": 1747439822.0,
              "replies": []
            },
            {
              "id": "msr76bg",
              "author": "MightyBooshX",
              "body": "That's crazy, I spent 3k for a VR gaming PC and it's like the best thing I've ever done. There's so much cool shit you can do now, especially now that it's so easy to mod flat games to work in VR. Personally I'll never understand how VR hasn't taken off more, the Quest 3 is the most sci-fi piece of tech I've ever seen or owned, mixed reality racket sports and stuff in your own home is so cool, but for whatever reason nobody cares. I think unfortunately there are 2 things working against it; one, people are lame and insecure about \"looking stupid\" wearing something on their head, and two, people are lazy and don't want to get off the damn couch to be active with their entertainment. At this point I'm fine with it staying niche as long as it doesn't go away completely. Indie developers and modders keep a steady stream of awesome stuff happening for the platform.",
              "score": 9,
              "created_utc": 1747463493.0,
              "replies": [
                {
                  "id": "msrlz8u",
                  "author": "skateguy1234",
                  "body": "It's money. I don't want to make a facebook account just to get a Oculus, so my only other options are all around $1000.",
                  "score": 5,
                  "created_utc": 1747472788.0,
                  "replies": [
                    {
                      "id": "msseftc",
                      "author": "MightyBooshX",
                      "body": "You don't need a Facebook account to use a Quest. They tried that briefly, there was a bunch of backlash and they walked it back. If you don't like giving Meta money, they lose money on every Quest, so buy that then buy all your games on Steam.",
                      "score": 9,
                      "created_utc": 1747487613.0,
                      "replies": [
                        {
                          "id": "mssiu24",
                          "author": "skateguy1234",
                          "body": "well dang, those does change things, thanks for the info",
                          "score": 3,
                          "created_utc": 1747489318.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "msr8t38",
              "author": "BboyStatic",
              "body": "I feel like you have to already have some interest in something the gadget would benefit to get continued use out of it. I wouldn’t expect my non gaming friends to get a VR setup and use it beyond the first initial excitement. I just bought XReal AR glasses to get a feel for wearable tech and see if I want to get a decent VR setup for flight simming. So far I’m really loving them, but no matter how great they are, I probably wouldn’t shell out $4k for a set.",
              "score": 2,
              "created_utc": 1747464468.0,
              "replies": []
            },
            {
              "id": "mspcyr9",
              "author": "okvrdz",
              "body": "I’m not a buyer and still feel regret.",
              "score": 2,
              "created_utc": 1747434538.0,
              "replies": []
            },
            {
              "id": "msrhypj",
              "author": "OMGItsCheezWTF",
              "body": "I used my oculus quest 1 quite a bit, then upgraded to the HTC vive 2 and have used it once, it lives in its carry case on top of my wardrobe forever more.",
              "score": 1,
              "created_utc": 1747470171.0,
              "replies": []
            },
            {
              "id": "mssx9n2",
              "author": "pinkynarftroz",
              "body": "I dunno man, VR could be 20 bucks but that still doesn't make the experience any better.\n\nFor me, there's so many holes, problems, and compromises that at any price point VR in its current state is not seriously useable.",
              "score": 1,
              "created_utc": 1747494325.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msrnrtc",
          "author": "Dracogame",
          "body": "Now it’s particularly bad as most studios cut completely investments on it. I bought the PS5 with the idea of getting the psVR2, but Sony stopped developing games for it",
          "score": 5,
          "created_utc": 1747473975.0,
          "replies": []
        },
        {
          "id": "msrwynr",
          "author": "None",
          "body": "Yeah the barrier to entry for just wanting to use VR after the hype wears off can get high. You gotta be prepared to not want to use it as much as you do or you’ll feel like shit",
          "score": 4,
          "created_utc": 1747479593.0,
          "replies": []
        },
        {
          "id": "msp8gpl",
          "author": "AwesomePossum_1",
          "body": "Might've been the case 5 years ago but not today. My PSVR2 saw me play Horizon COTM, Metro, Behemoth, Alien, RE4/8, GT7 (this one is like 20 hours by itself). All in all like 40 hours of entertainment at minimum, and that's just the AAA games. My quest 3 has seen lighter usage but I still enjoyed Batman Arkham Shadow, Moss, pcvr titles like HL Alyx, and that space one (forgot the name) + uhh... vr videos... Enough content for at least like 50 use sessions a year.\n\nAside from porn NONE of these made-for-VR experiences are available on Vision Pro. Not even pcvr games at this moment due to lack of a controller. How does the 10x more expensive device have 10x fewer experiences? No wonder people abandon it after using it 4 times.",
          "score": 26,
          "created_utc": 1747432966.0,
          "replies": [
            {
              "id": "mspw64i",
              "author": "None",
              "body": "[deleted]",
              "score": 6,
              "created_utc": 1747442268.0,
              "replies": [
                {
                  "id": "mspy1rm",
                  "author": "AwesomePossum_1",
                  "body": "I'm sorry but how?? Number of AAA experiences available rivals the amount of exclusives ps5 had in its first 2 years on the market. \n\nThe two RE games alone are phenomenal, and that's like 20 hours of fun. Synapse is like Doom for vr. An amazing 5-10 hour campaign. Horizon COTM will be like 7 hours of your jaw being on the floor from being immersed into that gorgeous world. ps4 games like No man's sky and Hitman. Ports of quest masterpieces like Moss and S&S. Third party games like Behemoth, Alien and Metro are all solid 8/10 games. GT7 will be enough for you to climax if you're into sim driving.   \n  \nPsvr2 day 1 owners are in their right to complain that the rate with wich new game are coming out is bad, and the complete lack of new games from Sony. But for someone who just got one there's plenty to play.",
                  "score": -6,
                  "created_utc": 1747442981.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mspa32x",
              "author": "stjohns_jester",
              "body": "The motion sickness really stopped my using it. I still see in all the VR subs that it is better but not fixed. \n\nAnd the strapping a a thing to my face as opposed to just picking up a controller. I like kind of flopping into the couch instead of moving my coffee table around and standing. \n\nBut it is cool to see it progress no matter where it ends up! I would rent one, if that were still a thing, every now and again to see the changes.",
              "score": 13,
              "created_utc": 1747433528.0,
              "replies": [
                {
                  "id": "msrdj47",
                  "author": "None",
                  "body": "It will always be niche. Like steering wheels or light guns",
                  "score": 1,
                  "created_utc": 1747467373.0,
                  "replies": [
                    {
                      "id": "mss6bof",
                      "author": "DarthBuzzard",
                      "body": "VR is a whole new medium. Steering wheels and light guns aren't the right comparison.",
                      "score": -1,
                      "created_utc": 1747484207.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mspbtjl",
                  "author": "AwesomePossum_1",
                  "body": "It's not getting better nor will it in the future. There's not much engineers can do to rewire your brain to not get sick when you see yourself moving with your eyes but your body isn't feeling the movement. You can only get less sick if you just spend more time in vr. It's like kids getting sick in cars. Everyone gets over it with time. In the same way EVERYONE feels sick in vr a first. I recommend start playing simpler vr games like moss where you do not move in a space. Eventually transition to a game with teleportation mechanics like HL Alyx or Horizon COTM. Then you can move on to full motion. You're not special, everyone has to go through this.\n\nAs for comfort, dude you're literally stepping INSIDE the world of a video game, playing INSIDE the game, BEING the character yourself. How cool is that??? Instead of watching it through your little tv hole, using a controller to control a character. Just remind yourself how amazing it is! Certainly cool enough to play vr once a week as a special occasion sort of thing.",
                  "score": -11,
                  "created_utc": 1747434139.0,
                  "replies": [
                    {
                      "id": "msposff",
                      "author": "DarthBuzzard",
                      "body": "> There's not much engineers can do to rewire your brain to not get sick when you see yourself moving with your eyes but your body isn't feeling the movement. \n\nThere's actually a lot that can be done to mitigate sickness with future advances. It's unknown if you can fully solve *motion* sickness which is tied to movement, but you can reduce it and eliminate virtual reality sickness which is the more general form of nausea caused by optical and latency limitations.",
                      "score": 2,
                      "created_utc": 1747439485.0,
                      "replies": [
                        {
                          "id": "msred07",
                          "author": "Kina_Kai",
                          "body": "Improvements can and will offset some of it, but attempting to lie to your sensory input detectors is always going to have trade-offs that vary from person to person. Just like how some people are more aware of the flickering of CFLs and it gives them a headache.\n\nThere is almost certainly always going to be a significant percentage of the population that cannot use these for a meaningful duration without very uncomfortable side effects.",
                          "score": 3,
                          "created_utc": 1747467892.0,
                          "replies": []
                        },
                        {
                          "id": "mspujlp",
                          "author": "AwesomePossum_1",
                          "body": "How? What has been a single hardware improvement to reduce motion sickness in vr? You can only hide it with vignette, with static gameplay or pass-through video, with gameplay that combines some kind of body movement with vr movement (like swinging arms while your character is jumping); and of course with good framerate.",
                          "score": 2,
                          "created_utc": 1747441653.0,
                          "replies": [
                            {
                              "id": "msq1vpr",
                              "author": "AuryGlenz",
                              "body": "The “good framerate” does a lot of heavy lifting in your response. The only time I ever got sick in VR was in a game that was chugging frames. The Quest headsets have been getting higher framerate panels on subsequent iterations and things like spacewarp to make full use of that.",
                              "score": 4,
                              "created_utc": 1747444448.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mspjxp0",
                      "author": "foofork",
                      "body": "Yeah. Never tried the magic leap which was supposed to solve for motion sickness…was so hyped\n\nAR is where it’s at for that.",
                      "score": 0,
                      "created_utc": 1747437698.0,
                      "replies": []
                    },
                    {
                      "id": "mspqpy5",
                      "author": "joelene1892",
                      "body": "Um. I don’t get sick with VR. I bought mine about two months ago and the ONLY time I got me was the roller coaster game with the blinders COMPLETELY off. That made me dizzy. Besides that I am 100% fine.",
                      "score": 0,
                      "created_utc": 1747440209.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "msp97oa",
              "author": "GodzlIIa",
              "body": "can psvr2 not play hl alyx? I was considering getting for alyx",
              "score": 3,
              "created_utc": 1747433226.0,
              "replies": [
                {
                  "id": "mspac74",
                  "author": "AwesomePossum_1",
                  "body": "You can connect psvr2 to a pc to play pcvr, though most people prefer quest/pc combo for wireless play. But if you only have ps5, the ps5/psvr2 exclusives are amazing too.",
                  "score": 7,
                  "created_utc": 1747433617.0,
                  "replies": [
                    {
                      "id": "mspal1s",
                      "author": "GodzlIIa",
                      "body": "ah, that is disappointing. But I do have a decent PC so I guess not a deal breaker.",
                      "score": -2,
                      "created_utc": 1747433704.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "msprv8y",
                  "author": "supremekingherpderp",
                  "body": "Yes! I’ve got a 2080ti so I can plug directly into the gpu not needing the adapter. Alyx was awesome and lived up to the hype wish it was longer and there was more though. I would say resident evil village and re4 on psvr2 are just as fun though.",
                  "score": 1,
                  "created_utc": 1747440641.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mspg6jk",
          "author": "4-3-4",
          "body": "it’s true for quite some gadgets, I had this with a drone years ago. thought I would use it much more….. but didn’t.",
          "score": 2,
          "created_utc": 1747436288.0,
          "replies": []
        },
        {
          "id": "msp8pji",
          "author": "MadOrange64",
          "body": "Not with the Meta Quest 3, the price just makes sense for me and I’m using it as a stand alone + PC VR.",
          "score": 8,
          "created_utc": 1747433051.0,
          "replies": [
            {
              "id": "msphgch",
              "author": "correctingStupid",
              "body": "I use it the same way but like there are enough good games to last a month. Now it's all shovelware and disappointments. AAA won't touch it with a 10 ft pole. ",
              "score": 2,
              "created_utc": 1747436776.0,
              "replies": [
                {
                  "id": "mspnwka",
                  "author": "brokenmessiah",
                  "body": "Can you blame them though? VR games probably have a insane piracy rate and I dont blame the pirateers either when your average VR game is just some 5 minute nonsense idea with a $20 price tag.",
                  "score": -1,
                  "created_utc": 1747439158.0,
                  "replies": [
                    {
                      "id": "msqtugm",
                      "author": "CMDR_KingErvin",
                      "body": "This is not true at all. Maybe this was true back in the very beginning but plenty of really great (some AAA quality) games have come out in the past few years and there are always sales and promotions in the quest store. Lots of good multiplayer games too and plenty of free stuff if you don’t want to spend money.",
                      "score": 2,
                      "created_utc": 1747456203.0,
                      "replies": [
                        {
                          "id": "mssgp90",
                          "author": "fakieTreFlip",
                          "body": "A lot of VR games are still very pricey for what you get, and the vast majority of it is nowhere near \"AAA\" quality. Even the bigger titles like Batman Arkham Shadow and Assassin's Creed Nexus aren't true \"AAA\" games. IMO there's only two games that are truly AAA quality, and that's Asgard's Wrath and Half-Life: Alyx. Those both came out over 5 years ago! There are promotions and some good free games, yes, but that's only going to convince so many people to buy a headset. Not nearly enough to really make VR as a whole take off.",
                          "score": 1,
                          "created_utc": 1747488502.0,
                          "replies": [
                            {
                              "id": "mssu081",
                              "author": "CMDR_KingErvin",
                              "body": "Asgard’s Wrath 2 came out less than 2 years ago. Why mention the 5 year old original game and not 2?\n\nAnyways I think the games are fine but personally a VR headset is pretty versatile and can do so many other things. At 500 the Quest 3 is a pretty good deal and I don’t think most owners feel any sort of regret buying it like the Apple Vision folks do.",
                              "score": 1,
                              "created_utc": 1747493244.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "msppa2m",
          "author": "Smokron85",
          "body": "Yeah I was an early PSVR1 adopter and it tool awhile but I eventually came around on it. The PSVR2 on the other hand I really regret buying it. It really needed to be wireless. Dunno what they were thinking when they designed it.  It just doesn't feel as fun to use or play games with. I find the controllers to be kind of not good to hold. The visual quality is OK at best.  There needs to be a lot more games too.",
          "score": 3,
          "created_utc": 1747439669.0,
          "replies": []
        },
        {
          "id": "msqtuqm",
          "author": "classicnikk",
          "body": "Meta quest 3 is phenomenal. But it also doesn’t cost $3500. I use it almost daily",
          "score": 1,
          "created_utc": 1747456207.0,
          "replies": []
        },
        {
          "id": "msuf60z",
          "author": "AlphaBetacle",
          "body": "But then they discover VR porn",
          "score": 1,
          "created_utc": 1747511931.0,
          "replies": []
        },
        {
          "id": "msx69qs",
          "author": "areyouondrugs_",
          "body": "Ehhh I loved my PSVR years ago. The problem was lack of quality content to consume. Lot of gimmick games etc",
          "score": 1,
          "created_utc": 1747554104.0,
          "replies": []
        },
        {
          "id": "mspnfuk",
          "author": "klitchell",
          "body": "PSVR was a great entry into VR at a reasonable price. No regrets",
          "score": 1,
          "created_utc": 1747438988.0,
          "replies": [
            {
              "id": "msq8cw9",
              "author": "IIILORDGOLDIII",
              "body": "PSVR2 fuckin rips and I got it with a year of free Netflix. I pay for Netflix anyway, so the \"discount\" was huge.",
              "score": 0,
              "created_utc": 1747446955.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msq83m6",
          "author": "IIILORDGOLDIII",
          "body": "Honestly, the biggest problem is the small playerbase. There are some bangers I would play in VR over my regular games, but there just isn't enough people online most of the time.",
          "score": 1,
          "created_utc": 1747446855.0,
          "replies": []
        },
        {
          "id": "mssp9gh",
          "author": "Chronicle112",
          "body": "Not true, I don’t regret getting my quest at all and I have had an htc vive before that. I still think half life alyx was an extremely awesome experience",
          "score": 1,
          "created_utc": 1747491644.0,
          "replies": []
        },
        {
          "id": "mspnns5",
          "author": "brokenmessiah",
          "body": "For me my Meta Quest 3S allowing me to play Blade and Sorcery makes it worth it on its own but I couldnt stomach dropping the extra 200 for the 3.",
          "score": 0,
          "created_utc": 1747439069.0,
          "replies": []
        },
        {
          "id": "msq6ijy",
          "author": "hawkwing11",
          "body": "half life alyx made it single handedly worth it for me lol",
          "score": 0,
          "created_utc": 1747446244.0,
          "replies": []
        },
        {
          "id": "mspgna6",
          "author": "ChafterMies",
          "body": "I mean, I no one in my house uses the PSVR2 much but how else are we going to try out VR?",
          "score": 0,
          "created_utc": 1747436468.0,
          "replies": []
        },
        {
          "id": "mspcff1",
          "author": "bonesnaps",
          "body": "Most Apple buyers also feel this after having tried Android or Linux.",
          "score": -12,
          "created_utc": 1747434351.0,
          "replies": [
            {
              "id": "mspegud",
              "author": "shofmon88",
              "body": "Now *that* is a statement completely disconnected from reality, and I’m a heavy Linux user. Apple’s UI and UE on Mac is exceptionally good. No one does tighter hardware and software integration than Apple. The closest thing I’ve come to that level of polish with Linux is the Steam Deck. And I greatly prefer iPhone over Android these days, since Android suffers from randomly discontinued Google products and lesser security than iOS. I liked my Pixel, but the 3 years of software updates and support it received vs iPhones getting 7 years or more… it just was more worth my money to buy an iPhone that would be supported longer. ",
              "score": 9,
              "created_utc": 1747435208.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "msr4w3u",
      "author": "PhantomTissue",
      "body": "It’s a product in search of a problem. The tech is extremely impressive, but there’s almost nothing it does that can’t be done with current methods just as easily. It also can’t be used with any current VR software so its only function is as a replacement for tools that already work just fine.",
      "score": 82,
      "created_utc": 1747462145.0,
      "replies": [
        {
          "id": "mssp50b",
          "author": "amaezingjew",
          "body": "It’s marketed all wrong - it should be marketed as an accessibility device and covered (at least partially) by insurance. It can be operated with eye movements only, or slight finger movements. It’s a really great tool for people with mobility issues to still be able to work",
          "score": 25,
          "created_utc": 1747491601.0,
          "replies": [
            {
              "id": "msss464",
              "author": "pinktieoptional",
              "body": "That wouldn't happen as long as Apple controls the technology. Disability isn't shiny or sexy",
              "score": 6,
              "created_utc": 1747492613.0,
              "replies": [
                {
                  "id": "mssu6pt",
                  "author": "amaezingjew",
                  "body": "[It doesn’t have to be if you can work it to rehab your public image](https://vimeo.com/776811579)",
                  "score": 3,
                  "created_utc": 1747493304.0,
                  "replies": []
                },
                {
                  "id": "msud14f",
                  "author": "hikeit233",
                  "body": "You mean like how they made air pods hearing aids? And now they’re some of the most accessible hearing aids on the market?",
                  "score": 1,
                  "created_utc": 1747511226.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msx0wyu",
              "author": "KoksundNutten",
              "body": "So exactly what neuralink does and how it's marketed. \n\n(Before they will mind control everyone)",
              "score": 1,
              "created_utc": 1747550792.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msswxbd",
          "author": "pinkynarftroz",
          "body": "It's such a stark contrast to how Jobs would design products. You ask what you want the product to do, then you worry about the tech to make that happen. \n\nI want to just be able to hook my printer to the network, and easily print exactly how my document looks. So you made appletalk, postscript, and the laserwriter.\n\nI want all my songs in my pocket. So you make the mini hard drive, and develop the scroll wheel interface to navigate.\n\nI want my phone to be a computer. So you develop the touch screen and gesture recognition.\n\nVision Pro seems like technology made first, and the experience and functionality being thought of after the fact to justify the tech. It's completely backwards from a classical Apple standpoint.",
          "score": 8,
          "created_utc": 1747494209.0,
          "replies": [
            {
              "id": "mstnmtk",
              "author": "PrimeIntellect",
              "body": "I truly think that the future is more on the altered reality vs virtual reality. A way to interact with technology to communicate without screens at all, being able to work, call, type, and use tech without even needing a laptop or console, especially with new inputs like gestures or neurolinks. The last thing I want is a screen strapped over my eyes",
              "score": 2,
              "created_utc": 1747502828.0,
              "replies": [
                {
                  "id": "mstpk02",
                  "author": "pinkynarftroz",
                  "body": "I'm going to go out on a limb and say that's not going to happen.\n\nMice and keyboards are already the equivalent of neurolink when you think about it. They are tools so ingrained into our experience, you move and click without having to consciously think. You can type fluidly much faster than you could talk.\n\nThere kind of already is no barrier from brain to result. I don't see it as ever being a serious option for people who do not have mobility issues.",
                  "score": 1,
                  "created_utc": 1747503422.0,
                  "replies": [
                    {
                      "id": "mt5mcq8",
                      "author": "PrimeIntellect",
                      "body": "True but that is because people train basically their entire lives typing and using a mouse, but communication has evolved quite a bit as well, we used to just be using typewriters. The keyboard isn't even design very well at all because if you typed too fast typewriters would get jammed up lol. These days a lot of communication has become much more visual/digital with memes, emojis, video clips, audio clips, group chats, etc and so I think there is still a pretty big field of new input related technology that could revolutionize how we interact with a digital system",
                      "score": 1,
                      "created_utc": 1747676016.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "msu9ziq",
              "author": "adamcoe",
              "body": "Every one of the things you mentioned were invented long before Apple had their version of it.",
              "score": 1,
              "created_utc": 1747510204.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mssxjl9",
          "author": "UrBoySergio",
          "body": "I’ve said it before and I’ll say it again, it’s a big screen TV “anywhere” technology and that’s it.",
          "score": 1,
          "created_utc": 1747494416.0,
          "replies": []
        },
        {
          "id": "msteera",
          "author": "TheRemanence",
          "body": "I think this is true for the consumer market. There are more reasons to use it in the workplace. My husband uses one at work about once a week (so in fairness not a huge amount yet.)\n\n\nThe biggest draw back above cost is comfort. I full believe that once they are closer to glasses we will see greater usage. Having said that there have been some others in the market (with worse screens) that didn't really take off.\n\n\nI don't think they'll replace ordinary screens but when they are more like glasses they will be far more popular.\nIssue with that of course, is if they don't replace anything, even at a lower price it's still another thing ordinary people may not budget for.",
          "score": 1,
          "created_utc": 1747499880.0,
          "replies": []
        },
        {
          "id": "mswynj2",
          "author": "_off_piste_",
          "body": "I think it solves a relatively niche use case for me, watching movies and shows while traveling. I’d absolutely love it for that, but it would need to come down to probably $1,000 or so before I seriously consider buying one.",
          "score": 1,
          "created_utc": 1747549418.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msp5h48",
      "author": "Tacotuesday8",
      "body": "Nothing sells a newspaper subscription like anger.",
      "score": 14,
      "created_utc": 1747431965.0,
      "replies": []
    },
    {
      "id": "msqzxfr",
      "author": "MacDugin",
      "body": "No one is making software that warrants that price.",
      "score": 6,
      "created_utc": 1747459367.0,
      "replies": []
    },
    {
      "id": "msp4xma",
      "author": "GenericReditAccount",
      "body": "“Some”",
      "score": 27,
      "created_utc": 1747431785.0,
      "replies": [
        {
          "id": "mspqv4f",
          "author": "skredditt",
          "body": "Reader may be shocked to hear that also, some buyers do not.",
          "score": 15,
          "created_utc": 1747440264.0,
          "replies": [
            {
              "id": "msr72kk",
              "author": "Vr00mf0ndler",
              "body": "I love mine to death. I primarily use it for watching movies/media content, and for that use case it’s basically all you can ask for. The screen is extremely good, the audio likewise and you get put into a bubble with no distractions. Personally I couldn’t be happier, but I understand that people with other use cases that hasn’t been realised yet might feel let down.",
              "score": 6,
              "created_utc": 1747463430.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "msp4f6u",
      "author": "seamonkey420",
      "body": "[google glass owners enter the chat](https://imgflip.com/i/9u9p8l)",
      "score": 36,
      "created_utc": 1747431617.0,
      "replies": [
        {
          "id": "msp7az7",
          "author": "microthrower",
          "body": "Don't forget Meta Ray-Ban glasses!",
          "score": 15,
          "created_utc": 1747432573.0,
          "replies": [
            {
              "id": "msp8vtg",
              "author": "maxwon",
              "body": "I actually love mine. At least they are not $1k+ if anybody hates theirs.",
              "score": 5,
              "created_utc": 1747433112.0,
              "replies": [
                {
                  "id": "msq39b0",
                  "author": "natek11",
                  "body": "I wouldn’t buy them just because I don’t trust Meta that much, but my cousin has them and they seem really cool.",
                  "score": 4,
                  "created_utc": 1747444983.0,
                  "replies": [
                    {
                      "id": "msqi3ju",
                      "author": "maxwon",
                      "body": "I hear ya. I give anything Meta the minimum permission possible. The problem is, they truly are everywhere. For example, so many websites are already embedded with their cookies. For the convenience of the glasses, I gave in a little. But if apple releases something similar, I’d switch in a heartbeat.",
                      "score": 7,
                      "created_utc": 1747450787.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "msryoz5",
                  "author": "distorted_kiwi",
                  "body": "I was up for new glasses and found out my insurance covered them. It was a no brainer and if I didn’t like them, I could always get a regular pair the following year.\n\nThey’ve been great! I used to have them turned on all the time, but that battery life is god awful. Now I have them turned off, sometimes days at a time.",
                  "score": 4,
                  "created_utc": 1747480519.0,
                  "replies": []
                },
                {
                  "id": "msqmcwv",
                  "author": "mletourn",
                  "body": "Never saw anybody wear those IRL. What do you do with them?",
                  "score": 2,
                  "created_utc": 1747452652.0,
                  "replies": [
                    {
                      "id": "msqmn60",
                      "author": "maxwon",
                      "body": "It’s very hard to tell apart from normal sunglasses, which is why I love them. I use mine primarily to take photos and videos outdoors, especially when using your phone isn’t the most convenient, like when I was paragliding on vacation. The speakers are also fine for podcasts or background music.",
                      "score": 3,
                      "created_utc": 1747452782.0,
                      "replies": []
                    },
                    {
                      "id": "mst0gui",
                      "author": "mak3itsn0w",
                      "body": "I use mine to listen to music while I run and to record the end of races",
                      "score": 2,
                      "created_utc": 1747495361.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mst3vhy",
              "author": "ivandagiant",
              "body": "Are these dead? I see a good amount of people on my instagram feed use them",
              "score": 1,
              "created_utc": 1747496460.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msrmy71",
          "author": "CocodaMonkey",
          "body": "Google glass was never sold to consumers. People bought them anyway but the program was meant for devs to buy it and develop apps to make them a consumer product. They ultimately pulled even that as they realized they need to be able to make them more compact before they can ever hit the consumer market. \n\nThere's a world of difference between Google Glass and Apple Vision Pro. One knew it needed development and marketed it as such. The other skipped the development phase and went straight to the consumer market.",
          "score": 1,
          "created_utc": 1747473430.0,
          "replies": [
            {
              "id": "mssnetc",
              "author": "seamonkey420",
              "body": "false. completely false. did you ever hear of the \"Explorer\" program? i was in that along w/several other of my pals, we paid around $1500 for glass explorer edition.  google also promised an upgraded headset later down the road but never delivered.\n\nalso.. if google glass had succeeded, things would be quite diff today in regards to AR tech (both in wearable sect and possible in the auto sect).",
              "score": 0,
              "created_utc": 1747490997.0,
              "replies": [
                {
                  "id": "mssvyab",
                  "author": "CocodaMonkey",
                  "body": "Of course I've heard of the Explorer program. It was made for developers and Google was quite explicit about that. You had to ask to be let in, wait for an invite and then you had to go to Google in person to get a fitting and sit through a presentation explaining how to use it and develop for Google Glass.\n\nAfter the explorer program they had a more open beta which was still not a consumer release and also required an invite which you could only get from Google+. That one didn't require you to go in person to Google and sit through their presentation but was certainly not a consumer release.\n\nThose are the only two semi public releases Google Glass has ever had. All other releases have been strictly for businesses or Enterprises with no way at all for a consumer to get a hold of them personally.",
                  "score": 1,
                  "created_utc": 1747493887.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "msqseax",
      "author": "albsen",
      "body": "At 350 this would have sold like hot cakes and be the next thing everyone is talking about. At 3500 it is just very expensive tech demo.",
      "score": 13,
      "created_utc": 1747455488.0,
      "replies": [
        {
          "id": "mss1r6e",
          "author": "froyolobro",
          "body": "Even at $1k it’d be worth it",
          "score": 10,
          "created_utc": 1747482070.0,
          "replies": []
        },
        {
          "id": "mstn2p5",
          "author": "pwhite13",
          "body": "I’m sorry but this is a silly statement. It’s like saying “if the BMW 3 Series was $5k instead of $50k they’d outsell the Corolla”\n\nHowever, I agree with your second point with this being a tech demo and a market test. Apple knew this as well and had no expectation for this to be a big seller. I think where Apple might be disappointed is the lack of developer interest 1.5 years into the platform; this is going to make it harder to justify further investment, though I absolutely believe we will see lower cost variants being released especially as Google/Samsung enter the space.\n\nMeta is still the leader in the VR space with their $500 Quest 3; I expect them to continue to dominate with their lower cost approach. The Vision Pro has incredible immersion but VR is still mostly a gaming device and the Quest 3 is superior there.",
          "score": 2,
          "created_utc": 1747502652.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msqyyvj",
      "author": "Vegetable_Tackle4154",
      "body": "Some?",
      "score": 4,
      "created_utc": 1747458849.0,
      "replies": []
    },
    {
      "id": "mspgpsh",
      "author": "gman5852",
      "body": "Is this subreddit just about negativity posting?\n\n\"Some people regret a purchase\" isn't newsworthy or really about tech. It's only useful for farming ad revenue off people that love negative posting.",
      "score": 32,
      "created_utc": 1747436495.0,
      "replies": [
        {
          "id": "msqfvfm",
          "author": "SUPRVLLAN",
          "body": "r/gadgets is the place for people who hate gadgets.",
          "score": 18,
          "created_utc": 1747449866.0,
          "replies": [
            {
              "id": "msql6jf",
              "author": "DarthBuzzard",
              "body": "And r/technology and r/futurology. There just isn't a large tech subreddit that is actually tech positive. The irony of luddites hating on tech and gadgets while using their tech and gadgets.",
              "score": 6,
              "created_utc": 1747452128.0,
              "replies": [
                {
                  "id": "mstqav2",
                  "author": "Space_Lux",
                  "body": "You can like and admire the tech, but dislike and criticise the overall product, marketing or the company.",
                  "score": 3,
                  "created_utc": 1747503653.0,
                  "replies": [
                    {
                      "id": "msu202u",
                      "author": "Cowicidal",
                      "body": "No, please only glaze techbros and their products.  That always makes them strive to do better. /s",
                      "score": 2,
                      "created_utc": 1747507495.0,
                      "replies": []
                    },
                    {
                      "id": "msttqah",
                      "author": "DarthBuzzard",
                      "body": "Liking tech in these subreddits usually gets you downvoted even if you condemn the company.",
                      "score": 1,
                      "created_utc": 1747504735.0,
                      "replies": [
                        {
                          "id": "msu23ri",
                          "author": "Cowicidal",
                          "body": "You're getting upvotes. Stop whining.",
                          "score": 1,
                          "created_utc": 1747507530.0,
                          "replies": [
                            {
                              "id": "msu2d0o",
                              "author": "DarthBuzzard",
                              "body": "Yes, as a rare exception. I'm still going to complain about people's asinine pessimism.",
                              "score": 1,
                              "created_utc": 1747507616.0,
                              "replies": [
                                {
                                  "id": "msu5bai",
                                  "author": "Cowicidal",
                                  "body": "Well, I'm going to complain about you complaining about people complaining.",
                                  "score": 1,
                                  "created_utc": 1747508617.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mssbcr6",
                  "author": "BlessingMagnet",
                  "body": "I honestly think the hate is due to two things. First, overhyping the tech and its abilities/usefulness and second, user impatience in n terms of features and cost.",
                  "score": 1,
                  "created_utc": 1747486361.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "msps1f7",
          "author": "shinyquagsire23",
          "body": "The journalist slant on Vision is just strange at this point, they're all way too eager to declare it a failure despite it working as advertised, receiving regular updates, etc.",
          "score": 12,
          "created_utc": 1747440704.0,
          "replies": [
            {
              "id": "msu2r3c",
              "author": "Cowicidal",
              "body": "> eager to declare it a failure\n\nAre you kidding? The media hyped the fuck out of it despite its high price for the average person.  Then when the sales (predictably) ground to a halt after no one else was left who could afford to buy them, the media reported on it.  Now, there's some people with buyer's remorse after the novelty wears off and you act like its some sort of personal attack.  lol",
              "score": 2,
              "created_utc": 1747507751.0,
              "replies": []
            },
            {
              "id": "mspz38q",
              "author": "None",
              "body": "i mean... sales...",
              "score": 1,
              "created_utc": 1747443375.0,
              "replies": [
                {
                  "id": "msqchg4",
                  "author": "_ravenclaw",
                  "body": "It wasn’t created to sell a ridiculous amount of units though. We know Apple went into this believing they’d only sell so much, hence why they didn’t make millions of these.",
                  "score": 6,
                  "created_utc": 1747448538.0,
                  "replies": [
                    {
                      "id": "msu3ijr",
                      "author": "Cowicidal",
                      "body": "> We know Apple went into this believing they’d only sell so much, hence why they didn’t make millions of these.\n\nUm, bullshit?  Apple was definitely out of touch and surprised by the lack of sales and their actions have shown this repeatedly.  They didn't cut production before the fact, they cut production after the fact.\n\nhttps://siliconangle.com/2025/01/01/apple-reportedly-ceases-vision-pro-production-amid-sluggish-sales/\n\n\" ... Apple originally was hoping to sell 700,000 to 800,000 units in the first year and usually reliable Apple analyst Ming-Chi Kuo forecasted that Apple could sell a half-million of the devices.\n\nInstead, Apple only managed to sell 370,000 units in the first three quarters of the year and though the fourth-quarter figures are not yet in, projections had Apple selling a further 50,000 units to bring the year total to 420,000. ... \"",
                      "score": 0,
                      "created_utc": 1747508011.0,
                      "replies": [
                        {
                          "id": "msu75a2",
                          "author": "_ravenclaw",
                          "body": "Lmao what?\n\n1. None of that is proven to be true. \n\n2. Everything I said is true according to your comment and sources, if they are true. Apple didn’t expect to sell millions of these, so they didn’t make millions of these. *Maybe* they sold a couple 100,000 less than they thought. That’s not even close to what I was saying lol. It’s a first time product in a first time category, they didn’t really have any way to for sure know how much it would actually sell.",
                          "score": 0,
                          "created_utc": 1747509235.0,
                          "replies": [
                            {
                              "id": "msufw5g",
                              "author": "Cowicidal",
                              "body": "> Apple didn’t expect to sell millions of these\n\nI didn't claim that, nor did the article.  No reason for you to get hysterical and obtuse.\n\nThey didn't meet their expectations and cut production (after the fact).  Don't know why you're so upset by this.\n\nThat said, some people with very low self-esteem associate brands with their own identities. If Apple fails at something, they feel like failures. We're also going to have corporate bots infiltrate threads like this in an attempt to distract us from said failures.",
                              "score": 1,
                              "created_utc": 1747512169.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "msshsu7",
          "author": "fakieTreFlip",
          "body": "Most of the major subs are just people complaining about things",
          "score": 3,
          "created_utc": 1747488926.0,
          "replies": []
        },
        {
          "id": "msqf7rb",
          "author": "lonefrog7",
          "body": "What you prefer? \"We love the corporations and we don't talk their mistakes!\" \n\nConflict is okay. You are having a primordial reaction to an illusion of danger. You're going to be fine",
          "score": 0,
          "created_utc": 1747449603.0,
          "replies": [
            {
              "id": "msu3vfv",
              "author": "Cowicidal",
              "body": "I think this is a case of people with very low self-esteem associating brands with their own identities.  If Apple fails at something, they feel like failures.  We're also going to have corporate bots infiltrate threads like this in an attempt to distract us from said failures.",
              "score": 1,
              "created_utc": 1747508131.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msu1n7l",
          "author": "Cowicidal",
          "body": "Living in a climate-collapsing, late stage capitalist, dystopian, fascist hellscape tends to bring on a bit of negativity.",
          "score": 0,
          "created_utc": 1747507373.0,
          "replies": []
        },
        {
          "id": "mspk759",
          "author": "stacecom",
          "body": "A very expensive over hyped product isn’t an every day thing.",
          "score": -6,
          "created_utc": 1747437796.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msqcssc",
      "author": "icantgetnosatisfacti",
      "body": "Some wsj subscribers “feel total regret”",
      "score": 5,
      "created_utc": 1747448659.0,
      "replies": []
    },
    {
      "id": "msr1g49",
      "author": "Mondernborefare",
      "body": "No shit,this was basically for developers and rich people. No one is surprised that bought this,",
      "score": 3,
      "created_utc": 1747460202.0,
      "replies": []
    },
    {
      "id": "msroofm",
      "author": "babaroga73",
      "body": "I would like to know how many of these did they even sell? Is it in thousands, tens of thousands?",
      "score": 3,
      "created_utc": 1747474570.0,
      "replies": [
        {
          "id": "mst01em",
          "author": "Lemurjeopice",
          "body": "I have read estimates ranging from 250 - 500k units. First version production should be halted considering lower demand and likely sufficient stock until the next iteration, rumored to be with m5.",
          "score": 1,
          "created_utc": 1747495221.0,
          "replies": [
            {
              "id": "mstr0xz",
              "author": "babaroga73",
              "body": "That's a big chunk of units. I'm guessing they have a big log file of user scenarios, bugs and demands now. I hope they don't give up on this. I need to further my detachment from reality now more than ever.",
              "score": 1,
              "created_utc": 1747503878.0,
              "replies": [
                {
                  "id": "msvibic",
                  "author": "Lemurjeopice",
                  "body": "And they keep improving on VisionOS. At least people in the VisionPro subreddit seem impressed with the latest releases.",
                  "score": 1,
                  "created_utc": 1747525584.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "msr9yfl",
      "author": "waywaytoomanycooks",
      "body": "I don’t have one and I feel regret!",
      "score": 6,
      "created_utc": 1747465151.0,
      "replies": []
    },
    {
      "id": "mspdek0",
      "author": "i_am_banished",
      "body": "I remember buying a rift cv1 bundle with the 2 sensors and the whole kit for about 200 on a black friday deal at best buy in like 2018 or so. It was honestly one of the coolest experiences ive ever had with gaming, but the novelty wore off after there were zero games doing anything the other 900 on there didnt do. Best games i played were sairento, super hot, hl:a, arizona sunshine and gorn but you see that all of them are basically boiling down to \"point and shoot\" experiences with the exception of gorn and its rubber mallet melee weapons. It was just too much work to put in and get into a game for me to want to keep going. The only other unique experience for me was beatsaber, but theres only so much of wagging your arms around that you can do at a time.\n\nI think i got my 200 worth from just those few titles, but now in 2025, with the vision pro and every other headseat, what the hell is there? What do you even do aside from play those games that came out 5 something years ago or longer?",
      "score": 4,
      "created_utc": 1747434693.0,
      "replies": [
        {
          "id": "mssmka3",
          "author": "Animanganime",
          "body": "For me it’s sim racing, with wheels and pedals and haptic seat it feels unreal.",
          "score": 2,
          "created_utc": 1747490702.0,
          "replies": []
        },
        {
          "id": "mss87y4",
          "author": "psilent",
          "body": "Can’t even play those on the Apple Vision Pro",
          "score": 2,
          "created_utc": 1747485044.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mspw4hj",
      "author": "canceroustattoo",
      "body": "I did a trial test with one of these like a year ago. It was really cool but not worth over three grand. I’ve since gotten an oculus quest 3S and it does pretty much the exact same thing but with more games.",
      "score": 2,
      "created_utc": 1747442251.0,
      "replies": []
    },
    {
      "id": "msq7yia",
      "author": "runsonpedals",
      "body": "I need a watch and a cell phone but I don’t need a Vision Pro.",
      "score": 2,
      "created_utc": 1747446801.0,
      "replies": []
    },
    {
      "id": "msqofmz",
      "author": "bad_robot_monkey",
      "body": "Cool, sell me yours for $500",
      "score": 2,
      "created_utc": 1747453597.0,
      "replies": []
    },
    {
      "id": "msqzt6i",
      "author": "Irish_Brewer",
      "body": "Buy it and play tetris vibes.",
      "score": 2,
      "created_utc": 1747459303.0,
      "replies": []
    },
    {
      "id": "msr4ozg",
      "author": "NovaHorizon",
      "body": "The VR setup 4K could buy you is mind boggling.",
      "score": 2,
      "created_utc": 1747462029.0,
      "replies": []
    },
    {
      "id": "msrhj5t",
      "author": "MrMoussab",
      "body": "Some? Some?",
      "score": 2,
      "created_utc": 1747469895.0,
      "replies": []
    },
    {
      "id": "mss0s4y",
      "author": "smandroid",
      "body": "If they had included subscription to courtside live games of your sport, then that would have been worth it. The potential was there. Sell the best seat for specific sports, lifestream it through the vision.",
      "score": 2,
      "created_utc": 1747481588.0,
      "replies": []
    },
    {
      "id": "mss7car",
      "author": "fordman84",
      "body": "I spent $300 on a VR headset and got my moneys worth out of it but realized there just wasn’t much I could do with it.  Felt apple vision would be the same.  At $350 I’d buy it and it would be a cool toy to pick up every so often.  At 3500 it better have some sort of actual use or function and not just a novelty.",
      "score": 2,
      "created_utc": 1747484657.0,
      "replies": []
    },
    {
      "id": "msshlwv",
      "author": "Anxious_Huckleberry9",
      "body": "They should have bought multiple Quest 3. \nAVP price is way off and is not 7 or so times better than the Quest 3.",
      "score": 2,
      "created_utc": 1747488851.0,
      "replies": []
    },
    {
      "id": "mssj9nu",
      "author": "NickCharlesYT",
      "body": "Somehow I'm not surprised. Look, the experience is cool. Really cool, even. But it doesn't actually solve any real-world problems or make doing anything easier. It's just a tech demo you pay $3500 for if you want to take it home...\n\nNever buy a product based on a promise of what it could be someday, even if you prefer living on the bleeding edge.",
      "score": 2,
      "created_utc": 1747489482.0,
      "replies": []
    },
    {
      "id": "mssre47",
      "author": "darkandark",
      "body": "its simply a cost issue $3500 is too much, period.  lower it to $500? and everyone and their grandma will be buying one.",
      "score": 2,
      "created_utc": 1747492374.0,
      "replies": []
    },
    {
      "id": "msu7z1f",
      "author": "Citycen01",
      "body": "I feel regret for them too. That was an insane boat to jump on too early for a company known for dropping unsuccessful projects.",
      "score": 2,
      "created_utc": 1747509516.0,
      "replies": [
        {
          "id": "msumh2i",
          "author": "toluwalase",
          "body": "Which unsuccessful released projects has Apple dropped? Google yes, Apple not really",
          "score": 1,
          "created_utc": 1747514334.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msxx2i7",
      "author": "jakgal04",
      "body": ">'Feel Total Regret'\n\nPretty sure there's people with that mindset on just about anything in life. Home purchases, relationships, trips they took, shoes they bought, food they tried at a restaurant, etc. \n\nThis article is actually pretty poor when you read it. It doesn't mention how many people they interviewed but it only shares the opinions of like 5 people.",
      "score": 2,
      "created_utc": 1747569842.0,
      "replies": []
    },
    {
      "id": "msyjq2f",
      "author": "Rogue_Diplomacy",
      "body": "I bought one because I am their target demo. Bored early/mid thirties with too much disposable income. I used it a lot at first, and haven't touched it in months. \n\nIt is a pretty immersive way to watch movies, but it hurts my neck after a while. Its just too heavy to be useable.",
      "score": 2,
      "created_utc": 1747578585.0,
      "replies": []
    },
    {
      "id": "msqhgj4",
      "author": "None",
      "body": "Open source it and give it to the people who really wanna use and make something out of it, not some wanna be techie with Daddy's credit card.",
      "score": 3,
      "created_utc": 1747450518.0,
      "replies": []
    },
    {
      "id": "msp0xx7",
      "author": "Crazy-Can9806",
      "body": "I’m sure some initial Apple Watch buyers too",
      "score": 8,
      "created_utc": 1747430483.0,
      "replies": [
        {
          "id": "mspanis",
          "author": "moment_in_the_sun_",
          "body": "yeah, that very first watch was garbage. and wasn't supported all that long either.",
          "score": 6,
          "created_utc": 1747433729.0,
          "replies": [
            {
              "id": "mspprwy",
              "author": "fraseyboo",
              "body": "People forget how quickly the series 0 was phased out and became obsolete. It wasn’t until the major redesigns of the Series 4 when the Apple Watch really saw mass adoption. Nowadays Apple Watches are eponymous, but you’d be hard-pressed to notice the difference between the generations after the Series 5.",
              "score": 3,
              "created_utc": 1747439854.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msp25w5",
          "author": "qckpckt",
          "body": "Pretty sure some everything buyers feel total regret.\n\nI think that’s why we have things like refunds, and second hand property.",
          "score": 2,
          "created_utc": 1747430876.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msq9mfa",
      "author": "zffjk",
      "body": "The first home computers were expensive as hell. As a person who lived through the coming of home computing and the internet… this was never that. It was a sad attempt to push something nobody asked for. \n\nAR is cool as fuck and has a ton of practical purposes, wish they went harder on that but oh well. Cool mask guys. \n\nSomeone in 20 years will see these in a milk crate and chuckle about it.",
      "score": 4,
      "created_utc": 1747447449.0,
      "replies": [
        {
          "id": "msqgwen",
          "author": "DarthBuzzard",
          "body": "> this was never that. It was a sad attempt to push something nobody asked for.\n\nJust like home computers. No one asked for them, people didn't know what to use them for, they collected dust, companies pulled out, sad attempt etc.\n\nIt wasn't all gloomy of course since we are where we are today and it succeeded, but it certainly looked gloomy in the early days. History repeats itself, people misrepresent VR as being this technology searching for a use when it has many uses across many sectors, and millions of people are getting practical use from it.\n\n> AR is cool as fuck and has a ton of practical purposes, wish they went harder on that but oh well. Cool mask guys.\n\nApple are taking the same process as Steve Jobs did with the Lisa and Macintosh: https://www.youtube.com/watch?v=vk3vo7xVkJc\n\nThey can't go harder on AR since they can't invent new physics. They have to work iteratively over a long period of time.",
          "score": 2,
          "created_utc": 1747450282.0,
          "replies": []
        },
        {
          "id": "mss8dsw",
          "author": "fordman84",
          "body": "That’s a good point.  Without the mouse developing into what it did, video games becoming what they did, and the internet…the personal computer was a glorified calculator and typewriter.",
          "score": 1,
          "created_utc": 1747485115.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msqcypd",
      "author": "LARGames",
      "body": "Just some? Should've gotten a Quest instead. There's way more to do on it.",
      "score": 4,
      "created_utc": 1747448722.0,
      "replies": []
    },
    {
      "id": "msr65ly",
      "author": "zer0sumgames",
      "body": "Buy used from someone for 2k. Feels good at 2k. Amazing tech.\n\nSeriously I am a deep cynic, jaded as anyone about tech. Apple Vision Pro is legit. I have been in VR from the very beginning. AVP is the first arrival of real VR tech.",
      "score": 4,
      "created_utc": 1747462880.0,
      "replies": []
    },
    {
      "id": "msqza97",
      "author": "Moonsleep",
      "body": "I have one and like it still.",
      "score": 2,
      "created_utc": 1747459019.0,
      "replies": []
    },
    {
      "id": "mspswkk",
      "author": "kc5ods",
      "body": "they should sell me one for like 35% of cost so I can have one, because I guarantee you I'd never feel an ounce of regret at that price",
      "score": 1,
      "created_utc": 1747441029.0,
      "replies": []
    },
    {
      "id": "msq8ao1",
      "author": "The_OtherGuy_99",
      "body": "Wait.\n\nIs the implication that some Aren't??",
      "score": 1,
      "created_utc": 1747446931.0,
      "replies": []
    },
    {
      "id": "msqh9aq",
      "author": "Riversntallbuildings",
      "body": "The fact that AppleTV is such an after thought to Apple should’ve given buyers an indication on how much effort Apple was going to put into this.\n\nAlso, the fact that since Jobs died, they’ve been less and less effective at innovation and product cannibalism.",
      "score": 1,
      "created_utc": 1747450433.0,
      "replies": []
    },
    {
      "id": "msria5r",
      "author": "sweatgod2020",
      "body": "Kind of ended up here from being on the front page of r/news but thought it would be a good time to ask if anyone could actually recommend a reasonably priced vr that can do things like access internet on one screen and have another screen running another thing like maybe a game or YouTube? Thanks in advance.",
      "score": 1,
      "created_utc": 1747470379.0,
      "replies": [
        {
          "id": "mss67c1",
          "author": "DarthBuzzard",
          "body": "Quest 3 ($500), but the comfort and resolution leave a lot to be desired.",
          "score": 1,
          "created_utc": 1747484153.0,
          "replies": [
            {
              "id": "mssi6bl",
              "author": "Anxious_Huckleberry9",
              "body": "Comfort is easily fixed with a \nBOBOVR headstrap. It also can give it infinite power with 2 hotswappable batteries. Quest games optimizer boosts resolution in the headset as well.",
              "score": 1,
              "created_utc": 1747489069.0,
              "replies": [
                {
                  "id": "mt0ja1l",
                  "author": "sweatgod2020",
                  "body": "So you have one and enjoy it!? I am not expecting ground breaking tech just simple to use but is capable of all the things",
                  "score": 2,
                  "created_utc": 1747601327.0,
                  "replies": [
                    {
                      "id": "mt1601l",
                      "author": "Anxious_Huckleberry9",
                      "body": "Yes and I also have videos on YouTube with gameplay using the items.",
                      "score": 1,
                      "created_utc": 1747609022.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "msrw46v",
          "author": "Lorax91",
          "body": "Just buy two monitors and have your eyes be the VR...",
          "score": 1,
          "created_utc": 1747479125.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msrpeyz",
      "author": "SilverSheepherder641",
      "body": "Some?",
      "score": 1,
      "created_utc": 1747475046.0,
      "replies": []
    },
    {
      "id": "msrznc2",
      "author": "Sylarxz",
      "body": "some apple buyers* fify",
      "score": 1,
      "created_utc": 1747481013.0,
      "replies": []
    },
    {
      "id": "mss4017",
      "author": "Sndr666",
      "body": "I still remember how hard meta was going \"this\" but in VR. Teams meetings, but in vr. I can't imagine a more dystopian version of this than a \"kids birthday party, but in vr\" like another poster mentioned as a experiencing in a demo.\n\nAn actual sales demo. a kid's birthday party. that is when you know the tech is walking dead.",
      "score": 1,
      "created_utc": 1747483143.0,
      "replies": [
        {
          "id": "mss5uk6",
          "author": "DarthBuzzard",
          "body": "People use phones to record birthday parties all the time. The headset looks weird in that usecase, but with a pair of normal looking glasses it wouldn't be a problem.",
          "score": 1,
          "created_utc": 1747483992.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mss6lc1",
      "author": "Kdilla77",
      "body": "Is anyone using it daily, at work? There was some thought it was gonna be a thing for artists/designers",
      "score": 1,
      "created_utc": 1747484325.0,
      "replies": []
    },
    {
      "id": "mssbwck",
      "author": "None",
      "body": "Love mine to this day. Was it pricey?! Yes but I love it. Can’t wait for the next version.",
      "score": 1,
      "created_utc": 1747486587.0,
      "replies": []
    },
    {
      "id": "mssfqfo",
      "author": "pbankey",
      "body": "I am glad I bought mine - I still use it almost every day. They need to get rid of the useless outer screen and make it lighter though",
      "score": 1,
      "created_utc": 1747488125.0,
      "replies": []
    },
    {
      "id": "msshfdf",
      "author": "tossaway390",
      "body": "This device was only for people with F you money",
      "score": 1,
      "created_utc": 1747488782.0,
      "replies": []
    },
    {
      "id": "mssl6hv",
      "author": "64bytesoldschool",
      "body": "Let me hook it to my Mac/ipad and cut the cost to 500",
      "score": 1,
      "created_utc": 1747490195.0,
      "replies": []
    },
    {
      "id": "msspqtk",
      "author": "Uncle_Rat_21",
      "body": "My favorite part of this thread is the Ray-Ban Meta glasses ad.",
      "score": 1,
      "created_utc": 1747491807.0,
      "replies": []
    },
    {
      "id": "msss812",
      "author": "ToMorrowsEnd",
      "body": "Fun fact, there are the same percentage of people that buy ANY electronic device and feels regret.  The article is stupid clickbait.\n\nWhere the Apple Vr headset fails is you can not use it for thebiggest group of gaming.  there is no way to use it as a PC VR headset.  it's locked to the apple ecosystem and the worlds largest Flight sim games and racing games are not on Mac.   Those people are the biggest buyers of VR headsets, and apple said,  \"nahh we dont want you\"",
      "score": 1,
      "created_utc": 1747492648.0,
      "replies": []
    },
    {
      "id": "mst1e2j",
      "author": "711-Gentleman",
      "body": "some =99%",
      "score": 1,
      "created_utc": 1747495661.0,
      "replies": []
    },
    {
      "id": "mst5pub",
      "author": "consumeshroomz",
      "body": "I don’t feel bad for them. It was pretty obvious it was useless and overpriced. If you couldn’t figure that out… well you gotta learn some lessons the hard way",
      "score": 1,
      "created_utc": 1747497049.0,
      "replies": []
    },
    {
      "id": "mstaecx",
      "author": "itisthelord",
      "body": "Tbh I’m never gonna be into this kinda useless tech until it’s baked into something like sunglasses. Until they manage to do that which will be a long, long time from now it’s just not feasible to use this as anything other than to show off you have the money to buy it.",
      "score": 1,
      "created_utc": 1747498564.0,
      "replies": []
    },
    {
      "id": "mstdbka",
      "author": "DaisyMa1",
      "body": "I too feel regret when I throw away $3500 on something not worth it.",
      "score": 1,
      "created_utc": 1747499525.0,
      "replies": []
    },
    {
      "id": "mstdvs2",
      "author": "robustofilth",
      "body": "It’s only 3500 bucks. Not that big a deal for business",
      "score": 1,
      "created_utc": 1747499709.0,
      "replies": []
    },
    {
      "id": "mstlyx2",
      "author": "OffTerror",
      "body": "Between 3D TVs and VR headsets it's been fascinating to see the public not only not gravitate toward that, but they also went to the tiny phone screens instead. It seems like humans don't care about the visual medium that much. They can completely sync in and be immersed regardless.  \n\nBut I do think there is a place for Augmented Reality in the future. Probably when someone make a decent smart glasses and an ingenious  interface.",
      "score": 1,
      "created_utc": 1747502300.0,
      "replies": []
    },
    {
      "id": "mstqgat",
      "author": "Hentai_For_Life",
      "body": "It's a device a large corporation could implement but definitely not a device for the average consumer.",
      "score": 1,
      "created_utc": 1747503699.0,
      "replies": []
    },
    {
      "id": "mstqkjf",
      "author": "PokeCaptain",
      "body": "The Vision Pro gives me Newton vibes.",
      "score": 1,
      "created_utc": 1747503736.0,
      "replies": []
    },
    {
      "id": "mstqr58",
      "author": "Existing-Stranger632",
      "body": "Probably because they spent $3000 dollars on what is a super cool, but very over priced product with features that will get old pretty fast. \n\nUnless you always wore these their is no reasonable explanation for one to get one of these. Unless you have the money to spend on one",
      "score": 1,
      "created_utc": 1747503793.0,
      "replies": []
    },
    {
      "id": "mstwdmx",
      "author": "high_everyone",
      "body": "I just wanted the desktop extension, but without wearing a giant pair of googly eyeballs on the front.",
      "score": 1,
      "created_utc": 1747505605.0,
      "replies": []
    },
    {
      "id": "mstxd0a",
      "author": "btsalamander",
      "body": "The price point is unacceptable, period",
      "score": 1,
      "created_utc": 1747505930.0,
      "replies": []
    },
    {
      "id": "mstxhd7",
      "author": "Charon_the_Reflector",
      "body": "Vr honestly sucks, walking around movie theaters and landscapes where people just chilled in vr chat was fun a couple years ago, other than that the games really kinda suck.\n\nNow they have bouncers that make you give personal info to sit in a virtual movie theater. Crazy",
      "score": 1,
      "created_utc": 1747505970.0,
      "replies": []
    },
    {
      "id": "msua3rm",
      "author": "Drawerpull",
      "body": "I fucking love mine",
      "score": 1,
      "created_utc": 1747510245.0,
      "replies": []
    },
    {
      "id": "msucg0w",
      "author": "mgd09292007",
      "body": "The regret is the price tag and being an early adoptee.  The product is amazing but it needs time for the software to mature a bit, make improvements to the weight and comfort and get the prices down.  Solve those things and this thing will sell like hot cakes",
      "score": 1,
      "created_utc": 1747511032.0,
      "replies": []
    },
    {
      "id": "msukyy1",
      "author": "cancolak",
      "body": "I don’t want to hate on innovation or new technology but maybe people don’t like wearing a computer on their head?",
      "score": 1,
      "created_utc": 1747513838.0,
      "replies": []
    },
    {
      "id": "msvpih3",
      "author": "WolpertingerRumo",
      "body": "Some airplanes have them in First Class. Seems like that’s what it’s made for. Most people won’t want to afford something like that. Do stream games even run on it?",
      "score": 1,
      "created_utc": 1747528410.0,
      "replies": []
    },
    {
      "id": "msvrywm",
      "author": "vietomatic",
      "body": "How about the guy who bought a Cybertruck and wore the Apple Vision Pro while driving it? Double Total Regret!",
      "score": 1,
      "created_utc": 1747529399.0,
      "replies": []
    },
    {
      "id": "msw6wib",
      "author": "godnorazi",
      "body": "Experiencing high fidelity VR like with the AVP is like seeing major fireworks event in person... it's a magical experience the first time, pretty cool the next few times and then its kinda boring and you don't really think about it anymore.",
      "score": 1,
      "created_utc": 1747535539.0,
      "replies": []
    },
    {
      "id": "mswbh33",
      "author": "shinryu6",
      "body": "Price is pretty much the killer for me. Sounds fun, but no way in hell do I have $3,500 + tax lying around on me, especially these days. ",
      "score": 1,
      "created_utc": 1747537505.0,
      "replies": []
    },
    {
      "id": "msxjhwd",
      "author": "Idolofdust",
      "body": "You're supposed to feel the regret within the 14-day return policy",
      "score": 1,
      "created_utc": 1747562454.0,
      "replies": []
    },
    {
      "id": "mt1vza2",
      "author": "otter5",
      "body": "I’d buy one if it was a lower price range. I’m not poor but 3500…nah. It’d have to be something truly above and beyond any competition in an exponential leap sorta way. It’s not. And even then I’d still wait for a competitive market cost haha",
      "score": 1,
      "created_utc": 1747618659.0,
      "replies": []
    },
    {
      "id": "mt240ds",
      "author": "iheartseuss",
      "body": "\"Some\"? Lol.",
      "score": 1,
      "created_utc": 1747621662.0,
      "replies": []
    },
    {
      "id": "mt5guun",
      "author": "ike_tyson",
      "body": "I always thought it would be a sex thing. But I guess it was too pricey and Apple doesn't want to be associated with stuff like that.",
      "score": 1,
      "created_utc": 1747674440.0,
      "replies": []
    },
    {
      "id": "mt8be57",
      "author": "IdontneedtoBonreddit",
      "body": "They've been trying to sell us this \"experience\" since the 90s ... people don't wantit.",
      "score": 1,
      "created_utc": 1747707763.0,
      "replies": []
    },
    {
      "id": "mub14vg",
      "author": "HansBooby",
      "body": "the rest of us passed the intelligence test",
      "score": 1,
      "created_utc": 1748244581.0,
      "replies": []
    },
    {
      "id": "msq62nt",
      "author": "None",
      "body": "VR is the worst buyers remorse I've ever felt. I bought the quest 2 and idk what it was about it but I had to return it. Just felt so robbed. The games aren't as fun as people are so desperate to convince you they are. VR is a cheap gimmick that costs so damn much. The quest is like $300. Can't even imagine a $3k headset.",
      "score": 1,
      "created_utc": 1747446075.0,
      "replies": [
        {
          "id": "msq8pnn",
          "author": "DarkDuo",
          "body": "I bought the original oculus rift when Palmer Lucky was still running the company, the only thing I really did on it was watch movies and YouTube anything else just gave me a headache while playing it",
          "score": 1,
          "created_utc": 1747447094.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mspnjnk",
      "author": "brokenmessiah",
      "body": "There's a chance for regret with any product, what makes this newsworthy?",
      "score": 1,
      "created_utc": 1747439027.0,
      "replies": []
    },
    {
      "id": "mspwl3k",
      "author": "Earthiness",
      "body": "This just in, 100% of customers aren’t happy forever. More at 6.",
      "score": 1,
      "created_utc": 1747442425.0,
      "replies": []
    },
    {
      "id": "msq7lbm",
      "author": "The_Human_Event",
      "body": "Hence why you don’t buy a gen 1 product",
      "score": 1,
      "created_utc": 1747446661.0,
      "replies": [
        {
          "id": "msuttl0",
          "author": "snapplesauce1",
          "body": "Tbf, if no one did, there wouldn’t be a 2nd gen.",
          "score": 2,
          "created_utc": 1747516788.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msrb4sh",
      "author": "Discobastard",
      "body": "Fucking mugs. \n\nDo Apple do mugs?",
      "score": 1,
      "created_utc": 1747465873.0,
      "replies": []
    },
    {
      "id": "mssicjp",
      "author": "Anxious_Huckleberry9",
      "body": "My YouTube channel shows some of the stuff a Quest 3 can do standalone.",
      "score": 1,
      "created_utc": 1747489135.0,
      "replies": []
    },
    {
      "id": "msp6vug",
      "author": "sheridan_lefanu",
      "body": "Some of the people who buy a thing, regret buying the thing. News at 11",
      "score": 0,
      "created_utc": 1747432434.0,
      "replies": []
    },
    {
      "id": "msp6d31",
      "author": "None",
      "body": "I love it. It tells my family I’m in me-time. Even though the only it does is let me check the weather.",
      "score": 0,
      "created_utc": 1747432259.0,
      "replies": []
    },
    {
      "id": "msp91lq",
      "author": "Dirty_Dragons",
      "body": "Not surprised since it's primarily a product for developers. The high price and pro in the name should have made it obvious.\n\nConsumers should wait for the lower price model Apple is working on.",
      "score": -6,
      "created_utc": 1747433167.0,
      "replies": [
        {
          "id": "mspdzcg",
          "author": "andynator1000",
          "body": "\"Pro\" is just branding. Is the iPhone 16 Pro Max primarily for developers too?",
          "score": 12,
          "created_utc": 1747434896.0,
          "replies": [
            {
              "id": "mspes18",
              "author": "Dirty_Dragons",
              "body": "Not always but it's a strong hint.\n\n\nAlso it's $3k. Not exactly priced for home use.",
              "score": -14,
              "created_utc": 1747435656.0,
              "replies": [
                {
                  "id": "mspgunl",
                  "author": "andynator1000",
                  "body": "And I'm sure the big, expensive screen on the front that shows your eyes that you can't develop anything for is also for developers, and also all the marketing that shows people sitting on their couch using it is probably just for developers.\n\nNot to mention that if you are a developer they will just loan you a Vision Pro headset through the Vision Pro Developer kit program instead of making you buy one.",
                  "score": 8,
                  "created_utc": 1747436547.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msq5ftp",
              "author": "silentcrs",
              "body": "The iPhone Pro series is primarily for photographers. Most people can get by with an iPhone Max.",
              "score": -8,
              "created_utc": 1747445827.0,
              "replies": [
                {
                  "id": "msqknou",
                  "author": "andynator1000",
                  "body": "Basically all professional photographers use cameras, not phones.",
                  "score": 6,
                  "created_utc": 1747451895.0,
                  "replies": [
                    {
                      "id": "mst4mv4",
                      "author": "silentcrs",
                      "body": "What is the key use case of the Max series then? Do you think it’s for developers?\n\nThe whole point of it is that it has a better camera.",
                      "score": 0,
                      "created_utc": 1747496704.0,
                      "replies": [
                        {
                          "id": "msu3zrw",
                          "author": "andynator1000",
                          "body": "I would wager that 99.9% of people buying an iPhone 16 Pro Max are not professional photographers. Most people either just want a better camera, a larger phome with the “pro” features or they just want the best iPhone regardless of the features.",
                          "score": 2,
                          "created_utc": 1747508171.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mspczux",
          "author": "ZainTheOne",
          "body": "Can you briefly tell the use case for developers",
          "score": 3,
          "created_utc": 1747434549.0,
          "replies": [
            {
              "id": "mspdko4",
              "author": "Dirty_Dragons",
              "body": "Developing.",
              "score": 1,
              "created_utc": 1747434752.0,
              "replies": [
                {
                  "id": "mspf353",
                  "author": "ZainTheOne",
                  "body": "Developing VR stuff?\n\nIf so how can they be primary audience, that would be VR users",
                  "score": 0,
                  "created_utc": 1747435835.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "msq24pm",
          "author": "AuryGlenz",
          "body": "I would say the fact it’s the first iteration is the greatest hint. The original iPhone, Apple Watch, etc. were quickly iterated on.",
          "score": 0,
          "created_utc": 1747444545.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msqau3y",
      "author": "haahaahaa",
      "body": "VR/AR is dope.  The vision pro is an iterative hardware upgrade over what came before it.  But it comes with all the important limitations of the Oculus.\n\nVR is probably close to what it will ever be.  A fun experience that requires a decent amount of space and not everyone can handle.  True limb/hand tracking is about the only thing I can think of to make it better.  A more \"free\" experience.\n\nAR seems to be what everyone thinks is the future.  Something that makes the promise of the HoloLens and/or Google Glass a reality.  Wearable tech that you take everywhere and integrates into every part of your life.  This isn't that.",
      "score": 0,
      "created_utc": 1747447905.0,
      "replies": [
        {
          "id": "msqg2cw",
          "author": "DarthBuzzard",
          "body": "> True limb/hand tracking is about the only thing I can think of to make it better. A more \"free\" experience.\n\nI would also say force feedback tactile haptic gloves, BCI input, lifelike avatars, personal HRTFs, full human field of view, retinal resolution, 200x higher brightness, no optical distortions, variable focus, high quality passthrough, high quality reverse passthrough, sunglasses-like form factors, and perfect dynamic foveated rendering.",
          "score": 4,
          "created_utc": 1747449943.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mspaa6r",
      "author": "None",
      "body": "Buying anything apple at this point is just stupid.",
      "score": -8,
      "created_utc": 1747433598.0,
      "replies": []
    },
    {
      "id": "msp5aie",
      "author": "IamParticle1",
      "body": "and? i regret buying a lot of things, don’t mean it’s a bad product. although, in the case of AVP it’s way overpriced but then again it was not intended for everyone and it’s the first of its kind. it’s truly superb with the technology it has and the whole experience. \n\nPS. Kontor Resmed band is WAYYY BETTER than the apple strap that it comes with and helps a lot with the discomfort",
      "score": -7,
      "created_utc": 1747431904.0,
      "replies": [
        {
          "id": "mspn22g",
          "author": "BigTonyT30",
          "body": "I think they just came in way too hot with the $3K price tag. That made it the most expensive VR headset and it wasn’t even geared towards gaming like the vast majority of VR is. Personally I think they should’ve kept this one limited to test units until they could present a more useful product at a *way* more reasonable price rather than a gadget to part rich people of their money.",
          "score": 2,
          "created_utc": 1747438849.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msq08mu",
      "author": "OrdinaryFirst6137",
      "body": "article is well done",
      "score": 0,
      "created_utc": 1747443813.0,
      "replies": []
    },
    {
      "id": "msruf5h",
      "author": "furcicle",
      "body": "Im still laughing at how much these losers paid for those cybertruck flavored shades🤣\n\n![gif](giphy|sbCdjSJEGghGM)",
      "score": 0,
      "created_utc": 1747478146.0,
      "replies": []
    },
    {
      "id": "mstpemy",
      "author": "r23dom",
      "body": "# Some ???",
      "score": 0,
      "created_utc": 1747503376.0,
      "replies": []
    },
    {
      "id": "mstqgr4",
      "author": "bluduuude",
      "body": "Some?",
      "score": 0,
      "created_utc": 1747503703.0,
      "replies": []
    },
    {
      "id": "mstsli9",
      "author": "2kids2adults",
      "body": "“Some”. 😂",
      "score": 0,
      "created_utc": 1747504376.0,
      "replies": [
        {
          "id": "mstt30g",
          "author": "2kids2adults",
          "body": "Honestly I’d love to try one and see it for myself - it seems like a cool experience for 10 minutes. But I’d never buy one - the tech would have to get much better and far more unobtrusive to the rest of life before I’d ever consider it. Also it’s way too much money. 🤷‍♂️",
          "score": 1,
          "created_utc": 1747504528.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mstyxp7",
      "author": "Right_Hour",
      "body": "Some?",
      "score": 0,
      "created_utc": 1747506459.0,
      "replies": []
    },
    {
      "id": "msxx25h",
      "author": "oysta1109",
      "body": "Ppl who can afford the price tag and own one love it and find plenty of uses for it.\n\nPpl who cannot justify the price tag doesn’t own one hate it and find zero reason for it to exist.\n\nThe journalists all own one but recommend not to get one because “it’s not for everyone” but it’s ok for them to use it.\n\nThis sums it up pretty much.\n\nI’m sure an AVP user only own apple products and never seen a gaming pc or own any other vr headsets. And when they really enjoy their AVP it’s just pure fanboism at work.",
      "score": 0,
      "created_utc": 1747569838.0,
      "replies": []
    },
    {
      "id": "msprqyg",
      "author": "BlobTheBuilderz",
      "body": "Wasn't this expected before release then it came out and there was some huge marketing campaign and everyone was like omg it's great and selling tons it's the next big thing. Wonder how much apple spent on bots commenting how great it is.",
      "score": -4,
      "created_utc": 1747440598.0,
      "replies": [
        {
          "id": "msqfs40",
          "author": "SUPRVLLAN",
          "body": "Anybody who likes what I don't like is a bot.",
          "score": 2,
          "created_utc": 1747449828.0,
          "replies": [
            {
              "id": "msqmjm2",
              "author": "BlobTheBuilderz",
              "body": "Well the talk sure dropped off all at the same time is all I’m saying.",
              "score": -2,
              "created_utc": 1747452737.0,
              "replies": [
                {
                  "id": "msqrea4",
                  "author": "SUPRVLLAN",
                  "body": "And if the talked kept going you'd still say it was bots.\n\nLiterally any scenario = bots. There's no winning with people that think like you.",
                  "score": 2,
                  "created_utc": 1747454999.0,
                  "replies": [
                    {
                      "id": "msr2ir8",
                      "author": "BlobTheBuilderz",
                      "body": "Yep. Sounds about right. I call everyone and everything online bots. Thanks for showing me the light.",
                      "score": -1,
                      "created_utc": 1747460799.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "msphtz2",
      "author": "Home_Assistantt",
      "body": "You don’t say.",
      "score": -1,
      "created_utc": 1747436919.0,
      "replies": []
    },
    {
      "id": "msq6nmq",
      "author": "walrusdoom",
      "body": "People actually bought that thing?",
      "score": -1,
      "created_utc": 1747446298.0,
      "replies": []
    },
    {
      "id": "msujbge",
      "author": "SoftlySpokenPromises",
      "body": "The Apple Tax seems to multiply every generation",
      "score": -1,
      "created_utc": 1747513295.0,
      "replies": []
    },
    {
      "id": "mspd0v3",
      "author": "garciawork",
      "body": "Only some?",
      "score": -5,
      "created_utc": 1747434559.0,
      "replies": []
    },
    {
      "id": "mspf0vt",
      "author": "leidheiser7",
      "body": "I’m surprised it’s not all buyers",
      "score": -5,
      "created_utc": 1747435805.0,
      "replies": []
    },
    {
      "id": "msqnw95",
      "author": "slick2hold",
      "body": "Ohh?  Man i recall when this POS was released.  I was attacked left and right by apple fanboys.   Seeing them with those stupid things on acting like its something practical for use in daily life was beyond laughable.   It was hilarious seeing stupid analysts pumping apple too acting like its some.new revolutionary device.   It's been around.  It's been tested and it has failed over and over.\n\nThe device is just not practical.",
      "score": -5,
      "created_utc": 1747453351.0,
      "replies": []
    },
    {
      "id": "mspmpvx",
      "author": "olearyboy",
      "body": "Only some?",
      "score": -2,
      "created_utc": 1747438723.0,
      "replies": []
    },
    {
      "id": "msqijk0",
      "author": "None",
      "body": "Overpriced, nothing new and poorly designed? That’s the new Apple.",
      "score": -2,
      "created_utc": 1747450975.0,
      "replies": []
    },
    {
      "id": "mss9asa",
      "author": "Winnipeg_Dad",
      "body": "Huge fail by apple.  Meta’s offering is one fifth the price and actually has some decent content.",
      "score": -2,
      "created_utc": 1747485508.0,
      "replies": [
        {
          "id": "mstqz2i",
          "author": "Existing-Stranger632",
          "body": "Meta Quest is much different but offers very similar features. Meta’s product is much more practical overall for the average person who’s interested in this technology",
          "score": 1,
          "created_utc": 1747503862.0,
          "replies": [
            {
              "id": "mstz4f9",
              "author": "Winnipeg_Dad",
              "body": "It's affordable, and there's a content library.  Yes, the resolution isn't close, but who cares...  It's a shipping product that makes a lot more sense than apple's thing...",
              "score": 0,
              "created_utc": 1747506523.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mspbssf",
      "author": "ChiefStrongbones",
      "body": "Zuckerberg [summed it up well](https://www.youtube.com/watch?v=7k1ehaE0bdU&t=8932s)",
      "score": -7,
      "created_utc": 1747434131.0,
      "replies": []
    }
  ]
}